<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="preface.html" title="&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;"><link rel="prev" href="sources.html" title="&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;"><link rel="next" href="disclaimer.html" title="&#1044;&#1080;&#1089;&#1082;&#1083;&#1077;&#1081;&#1084;&#1077;&#1088;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="sources.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="disclaimer.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="acknowledgments"></a>&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080;</h2></div></div></div><p>&#1053;&#1072; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080; &#1091;&#1096;&#1083;&#1086; &#1074; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1088;&#1072;&#1079;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1095;&#1077;&#1084; &#1103; &#1086;&#1078;&#1080;&#1076;&#1072;&#1083;, &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1084;&#1085;&#1077; &#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100; &#1073;&#1091;&#1076;&#1090;&#1086; &#1079;&#1076;&#1086;&#1088;&#1086;&#1074;&#1099;&#1081; &#1088;&#1086;&#1103;&#1083;&#1100; &#1074;&#1080;&#1089;&#1080;&#1090; &#1085;&#1072;&#1076; &#1084;&#1086;&#1077;&#1081; &#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1081; &#1082;&#1091;&#1076;&#1072; &#1073;&#1099; &#1103; &#1085;&#1077; &#1085;&#1080; &#1087;&#1086;&#1096;&#1105;&#1083;. &#1041;&#1077;&#1079; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1089;&#1090;&#1086;&#1083;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1103; &#1073;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1101;&#1090;&#1086; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1079;&#1076;&#1088;&#1072;&#1074;&#1099;&#1081; &#1088;&#1072;&#1089;&#1089;&#1091;&#1076;&#1086;&#1082;. </p><p>&#1069;&#1085;&#1076;&#1080; &#1054;&#1088;&#1072;&#1084;, &#1084;&#1086;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1074; O'Reilly, &#1073;&#1099;&#1083; &#1084;&#1077;&#1095;&#1090;&#1086;&#1081; &#1087;&#1080;&#1089;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1054;&#1085; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077; &#1087;&#1086;&#1085;&#1072;&#1089;&#1083;&#1099;&#1096;&#1082;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090; &#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1055;&#1054; (&#1086;&#1085; &#1087;&#1086;&#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074;&#1072;&#1083; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1090;&#1077;&#1084;&#1099;), &#1085;&#1086; &#1077;&#1097;&#1077; &#1080; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1076;&#1082;&#1080;&#1084; &#1076;&#1072;&#1088;&#1086;&#1084; &#1091;&#1075;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1099; &#1080;&#1084;&#1077;&#1083; &#1074; &#1074;&#1080;&#1076;&#1091; &#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1099;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1085;&#1080;&#1084; &#1073;&#1099;&#1083;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1095;&#1077;&#1089;&#1090;&#1100;&#1102;. &#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1063;&#1072;&#1082;&#1091; &#1058;&#1086;&#1087;&#1086;&#1088;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1088;&#1072;&#1079;&#1091; &#1086;&#1090;&#1099;&#1089;&#1082;&#1072;&#1083; &#1069;&#1085;&#1076;&#1080;. 
</p><p>&#1041;&#1088;&#1072;&#1081;&#1072;&#1085; &#1060;&#1080;&#1090;&#1079;&#1087;&#1072;&#1090;&#1088;&#1080;&#1082; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1077;&#1089;&#1100; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1082;&#1085;&#1080;&#1075;&#1080;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1086; &#1077;&#1105; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1085;&#1086; &#1080; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1086; &#1084;&#1077;&#1085;&#1103; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1085;&#1077; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099;&#1090;&#1100; &#1075;&#1076;&#1077; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086;, &#1083;&#1080;&#1096;&#1100; &#1073;&#1099; &#1085;&#1077; &#1079;&#1072; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084;. &#1041;&#1101;&#1085; &#1050;&#1086;&#1083;&#1083;&#1080;&#1085;&#1089;-&#1057;&#1072;&#1089;&#1089;&#1084;&#1101;&#1085; &#1080; &#1052;&#1072;&#1081;&#1082; &#1055;&#1080;&#1083;&#1072;&#1090;&#1086; &#1090;&#1086;&#1078;&#1077; &#1087;&#1088;&#1080;&#1075;&#1083;&#1103;&#1076;&#1099;&#1074;&#1072;&#1083;&#1080; &#1079;&#1072; &#1084;&#1086;&#1080;&#1084;&#1080; &#1091;&#1089;&#1087;&#1077;&#1093;&#1072;&#1084;&#1080; &#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1083;&#1080; &#1088;&#1072;&#1076;&#1099; &#1087;&#1086;&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1090;&#1100;, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1076;&#1086;&#1083;&#1075;&#1091;, &#1083;&#1102;&#1073;&#1091;&#1102; &#1090;&#1077;&#1084;&#1091;, &#1085;&#1072;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1103; &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;. &#1054;&#1085;&#1080; &#1078;&#1077; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1083;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1103; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1090;&#1086;&#1088;&#1084;&#1086;&#1079;&#1080;&#1083; &#1080; &#1074;&#1086;&#1074;&#1088;&#1077;&#1084;&#1103; &#1083;&#1077;&#1075;&#1086;&#1085;&#1100;&#1082;&#1086; &#1087;&#1086;&#1076;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;. &#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1074;&#1072;&#1084;.
</p><p>&#1041;&#1080;&#1077;&#1083;&#1083;&#1072; &#1050;&#1086;&#1083;&#1083;&#1084;&#1072;&#1085; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1072;&#1089;&#1100; &#1089;&#1074;&#1086;&#1077;&#1081; &#1076;&#1080;&#1089;&#1089;&#1077;&#1088;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1103; &#1087;&#1080;&#1089;&#1072;&#1083; &#1101;&#1090;&#1091; &#1082;&#1085;&#1080;&#1075;&#1091;. &#1045;&#1081; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &#1089;&#1080;&#1076;&#1077;&#1090;&#1100; &#1080; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1076;&#1077;&#1085;&#1100;, &#1086;&#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1091;&#1078;&#1080;&#1083;&#1072; &#1084;&#1085;&#1077; &#1080; &#1074;&#1076;&#1086;&#1093;&#1085;&#1086;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084;, &#1080; &#1089;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1089;&#1083;&#1091;&#1096;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1082;&#1072;&#1082; &#1072;&#1085;&#1090;&#1088;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075; &#1086;&#1085;&#1072; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1089;&#1086;&#1073;&#1099;&#1084; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;&#1086;&#1084; &#1085;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1077;&#1097;&#1080; &#1074; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083;&#1086; &#1077;&#1081; &#1076;&#1072;&#1090;&#1100; &#1084;&#1085;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1076;&#1077;&#1080; &#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083; &#1076;&#1083;&#1103; &#1082;&#1085;&#1080;&#1075;&#1080;.
&#1040;&#1083;&#1077;&#1082;&#1089; &#1043;&#1086;&#1083;&#1072;&#1073;, &#1077;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1072;&#1085;&#1090;&#1088;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089; &#1084;&#1080;&#1088;&#1086;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1079;&#1072;&#1085;&#1103;&#1090;&#1099;&#1081; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084; &#1076;&#1080;&#1089;&#1089;&#1077;&#1088;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1083; &#1084;&#1077;&#1085;&#1103; &#1089; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080; &#1101;&#1090;&#1086; &#1079;&#1076;&#1086;&#1088;&#1086;&#1074;&#1086; &#1087;&#1086;&#1084;&#1086;&#1075;&#1083;&#1086;. 
</p><p>&#1052;&#1080;&#1082;&#1072; &#1040;&#1085;&#1076;&#1077;&#1088;&#1089;&#1086;&#1085;, &#1087;&#1086; &#1074;&#1080;&#1076;&#1091; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1080; &#1085;&#1077; &#1089;&#1082;&#1072;&#1078;&#1077;&#1096;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1080;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1072;&#1103; &#1076;&#1077;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1090;&#1072;&#1082; &#1087;&#1086;&#1076;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1073;&#1099;&#1083; &#1090;&#1077;&#1084; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1083; &#1091; &#1084;&#1077;&#1085;&#1103; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1077; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1080;&#1079;-&#1079;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1090;&#1080;. &#1054;&#1085; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1083; &#1075;&#1086;&#1090;&#1086;&#1074; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1087;&#1086; &#1076;&#1088;&#1091;&#1078;&#1077;&#1089;&#1082;&#1080;, &#1087;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1080; (&#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1090;&#1086;&#1095;&#1085;&#1086;) &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;. &#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086;, &#1052;&#1080;&#1082;&#1072;!
</p><p>&#1044;&#1078;&#1086;&#1085; &#1058;&#1088;&#1086;&#1091;&#1073;&#1088;&#1080;&#1076;&#1078; &#1080; &#1057;&#1101;&#1085;&#1076;&#1077;&#1088; &#1057;&#1090;&#1088;&#1072;&#1081;&#1082;&#1077;&#1088;, &#1074;&#1076;&#1086;&#1093;&#1085;&#1086;&#1074;&#1083;&#1103;&#1083;&#1080; &#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083;&#1080; &#1084;&#1085;&#1077;&#8212;&#1080;&#1093; &#1086;&#1073;&#1096;&#1080;&#1088;&#1085;&#1099;&#1081; &#1086;&#1087;&#1099;&#1090; &#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1055;&#1054; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1083; &#1084;&#1077;&#1085;&#1103; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103; &#1073;&#1099; &#1085;&#1077; &#1085;&#1072;&#1096;&#1077;&#1083; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1080;&#1075;&#1076;&#1077;.</p><p>
&#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1043;&#1088;&#1077;&#1075;&#1091; &#1057;&#1090;&#1077;&#1081;&#1085;&#1091; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072; &#1076;&#1088;&#1091;&#1078;&#1073;&#1091; &#1080; &#1087;&#1077;&#1088;&#1077;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1073;&#1086;&#1076;&#1088;&#1077;&#1085;&#1080;&#1103;,
 &#1085;&#1086; &#1080; &#1079;&#1072; &#1090;&#1086; &#1095;&#1090;&#1086; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1083; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; Subversion &#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1081; &#1082;&#1086;&#1076;&#1072; &#1074; 
&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;. &#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1041;&#1088;&#1072;&#1080;&#1085;&#1091; &#1041;&#1077;&#1083;&#1077;&#1085;&#1076;&#1086;&#1088;&#1092;&#1091;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1090;&#1072;&#1082;&#1090;&#1080;&#1095;&#1085;&#1086; &#1074;&#1073;&#1080;&#1083; &#1074; &#1085;&#1072;&#1096;&#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099; &#1074;&#1089;&#1102; &#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1081;. 
&#1071; &#1085;&#1072;&#1076;&#1077;&#1102;&#1089;&#1100; &#1101;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1085;&#1072;&#1096;&#1077;&#1083; &#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1082;&#1085;&#1080;&#1075;&#1077;.
</p><p>&#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086;, &#1041;&#1077;&#1085;&#1078;&#1072;&#1084;&#1080;&#1085;&#1091; "&#1052;&#1072;&#1082;&#1086;" &#1061;&#1080;&#1083;&#1083; &#1080; &#1057;&#1077;&#1090;&#1091; &#1064;&#1086;&#1085;&#1091;, &#1079;&#1072; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1080; &#1086;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1055;&#1054; &#1080; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1077;; &#1047;&#1072;&#1082;&#1091; &#1059;&#1088;&#1083;&#1086;&#1082;&#1077;&#1088;&#1091; &#1080; &#1051;&#1091;&#1080;&#1089; &#1057;&#1091;&#1088;&#1101;&#1079;-&#1055;&#1086;&#1090;&#1090;&#1089; &#1079;&#1072; &#1090;&#1086; 
&#1095;&#1090;&#1086; &#1085;&#1072;&#1096;&#1083;&#1080; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1100;&#1102;, &#1085;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1087;&#1083;&#1086;&#1090;&#1085;&#1099;&#1081; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;;
&#1064;&#1077;&#1081;&#1085;&#1091; &#1080;&#1079; Shashcode &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1079;&#1072; &#1090;&#1086; &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083; &#1077;&#1075;&#1086; &#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;;
&#1080; &#1061;&#1072;&#1075;&#1075;&#1077;&#1085;&#1091; &#1057;&#1086; &#1079;&#1072; &#1085;&#1077;&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1077; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1077; &#1093;&#1086;&#1089;&#1090;&#1080;&#1085;&#1075;&#1086;&#1074;. 
</p><p>&#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1040;&#1083;&#1083;&#1077; &#1044;&#1077;&#1093;&#1090;&#1103;&#1088;, &#1055;&#1086;&#1083;&#1080;&#1085;&#1077;, &#1080; &#1057;&#1086;&#1085;&#1077; &#1079;&#1072; &#1085;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1091;&#1102; &#1080; &#1090;&#1077;&#1088;&#1087;&#1077;&#1083;&#1080;&#1074;&#1091;&#1102; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091;. &#1071; &#1086;&#1095;&#1077;&#1085;&#1100; &#1088;&#1072;&#1076;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; (&#1080;&#1083;&#1080; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1090;&#1097;&#1077;&#1090;&#1085;&#1086; &#1087;&#1099;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;) &#1085;&#1072;&#1096;&#1077; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1074;&#1077;&#1095;&#1077;&#1088;&#1072;&#1084; &#1080; &#1080;&#1076;&#1090;&#1080; &#1076;&#1086;&#1084;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; "&#1050;&#1085;&#1080;&#1075;&#1086;&#1081;". </p><p>&#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1044;&#1078;&#1077;&#1082;&#1091; &#1056;&#1080;&#1087;&#1077;&#1085;&#1080;&#1085;&#1075;&#1091; &#1079;&#1072; &#1076;&#1088;&#1091;&#1078;&#1073;&#1091;, &#1073;&#1077;&#1089;&#1077;&#1076;&#1099;, &#1080; &#1079;&#1072; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1077; &#1091;&#1087;&#1088;&#1103;&#1084;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1077;&#1089;&#1090;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1081;, &#1085;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081;. &#1071; &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1072;&#1076;&#1077;&#1102;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1077;-&#1095;&#1090;&#1086; &#1080;&#1079; &#1077;&#1075;&#1086; &#1086;&#1087;&#1099;&#1090;&#1072;, &#1082;&#1072;&#1082; &#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082; &#1080; &#1074; &#1080;&#1085;&#1076;&#1091;&#1089;&#1090;&#1088;&#1080;&#1080; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;, &#1085;&#1072;&#1096;&#1083;&#1086; &#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1077;.
</p><p>CollabNet &#1073;&#1099;&#1083;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086;&#1076;&#1091;&#1096;&#1085;&#1099;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1074; &#1084;&#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1087;&#1086; &#1075;&#1080;&#1073;&#1082;&#1086;&#1084;&#1091; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1085;&#1080;&#1075;&#1091;, &#1080; &#1085;&#1077; &#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100;, &#1076;&#1072;&#1078;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1088;&#1086;&#1082;&#1080; &#1074;&#1099;&#1096;&#1083;&#1080; &#1079;&#1072; &#1088;&#1072;&#1084;&#1082;&#1080; &#1079;&#1072;&#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1071; &#1085;&#1077; &#1079;&#1085;&#1072;&#1102; &#1074;&#1089;&#1077;&#1093; &#1093;&#1080;&#1090;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090; &#1082; &#1090;&#1072;&#1082;&#1080;&#1084; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1085;&#1086; &#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1102;
&#1057;&#1101;&#1085;&#1076;&#1103; &#1050;&#1083;&#1091;&#1090; &#1080; &#1087;&#1086;&#1079;&#1078;&#1077; &#1052;&#1072;&#1093;&#1077;&#1096; &#1052;&#1091;&#1088;&#1092;&#1080;, &#1073;&#1099;&#1083;&#1080; &#1082;&#1072;&#1082; &#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1089; &#1101;&#1090;&#1080;&#1084; &#8212; - &#1084;&#1086;&#1080; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; 
&#1080;&#1084; &#1086;&#1073;&#1086;&#1080;&#1084;.</p><p>
&#1042;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; Subversion &#1073;&#1099;&#1083;&#1072; &#1076;&#1083;&#1103; &#1084;&#1077;&#1085;&#1103; &#1074;&#1076;&#1086;&#1093;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; 
&#1087;&#1103;&#1090;&#1080; &#1083;&#1077;&#1090;, &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1077; &#1103; &#1080;&#1079;&#1091;&#1095;&#1080;&#1083; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;. &#1071; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1080;&#1090;&#1100; &#1080;&#1093; &#1079;&#1076;&#1077;&#1089;&#1100; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1080;&#1093; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1085;&#1086;&#1075;&#1086;, &#1085;&#1086; &#1103; &#1085;&#1072;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1090;&#1080;&#1090; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1091;&#1075;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074;&#1099;&#1087;&#1080;&#1074;&#1082;&#1086;&#1081; &#8212; &#1103; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1102;&#1089;&#1100; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1086;&#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;. </p><p>&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1072;&#1079; &#1103; &#1085;&#1072;&#1087;&#1099;&#1097;&#1077;&#1085;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083; &#1089; &#1056;&#1077;&#1081;&#1095;&#1101;&#1083;&#1083; &#1057;&#1082;&#1086;&#1083;&#1083;&#1086;&#1085; &#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1082;&#1085;&#1080;&#1075;&#1080;,
&#1086;&#1085;&#1072; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1083;&#1091;&#1096;&#1072;&#1083;&#1072; &#1080; &#1082;&#1072;&#1082;&#1080;&#1084;-&#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1077;&#1081; &#1091;&#1076;&#1072;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1084;&#1077;&#1085;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1095;&#1077;&#1084; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1076;&#1086; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;. &#1069;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1084;&#1086;&#1075;&#1083;&#1086; &#8212; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1086;&#1077; &#1089;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086;.
</p><p>&#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; (&#1077;&#1097;&#1077; &#1088;&#1072;&#1079;) &#1053;&#1086;&#1101;&#1083;&#1091; &#1058;&#1072;&#1081;&#1083;&#1086;&#1088;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1091;&#1076;&#1080;&#1074;&#1080;&#1083;&#1086;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091;
&#1103; &#1079;&#1072;&#1093;&#1086;&#1090;&#1077;&#1083; &#1086;&#1087;&#1103;&#1090;&#1100; &#1074;&#1079;&#1103;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072; &#1082;&#1085;&#1080;&#1075;&#1091;, &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103; &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1103; &#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1096;&#1083;&#1099;&#1081; &#1088;&#1072;&#1079;.
&#1045;&#1075;&#1086; &#1076;&#1088;&#1091;&#1078;&#1073;&#1072; &#1087;&#1086;&#1084;&#1086;&#1075;&#1083;&#1072; &#1084;&#1091;&#1079;&#1099;&#1082;&#1077; &#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1081; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1085;&#1077; &#1080;&#1089;&#1095;&#1077;&#1079;&#1085;&#1091;&#1090;&#1100; &#1080;&#1079; &#1078;&#1080;&#1079;&#1085;&#1080; &#1076;&#1072;&#1078;&#1077; &#1074; &#1089;&#1072;&#1084;&#1099;&#1077; &#1079;&#1072;&#1085;&#1103;&#1090;&#1099;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1072;. &#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1052;&#1101;&#1090;&#1100;&#1102; &#1044;&#1080;&#1085; &#1080; &#1044;&#1086;&#1088;&#1101;&#1090;&#1080; &#1057;&#1072;&#1084;&#1090;&#1083;&#1080;&#1073;&#1080;&#1085;, &#1076;&#1088;&#1091;&#1079;&#1100;&#1103;&#1084; &#1080; &#1076;&#1086;&#1083;&#1075;&#1086;&#1089;&#1090;&#1088;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1084; &#1087;&#1072;&#1088;&#1090;&#1085;&#1077;&#1088;&#1072;&#1084; &#1087;&#1086; &#1084;&#1091;&#1079;&#1099;&#1082;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1085;&#1103;&#1083;&#1080; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1099; &#1084;&#1086;&#1077;&#1075;&#1086; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1085;&#1072; &#1088;&#1077;&#1087;&#1077;&#1090;&#1080;&#1094;&#1080;&#1103;&#1093;. &#1052;&#1077;&#1075;&#1072;&#1085; &#1044;&#1078;&#1077;&#1085;&#1085;&#1080;&#1085;&#1082;&#1089;, &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1083;&#1072; &#1084;&#1077;&#1085;&#1103; &#1080; &#1080;&#1089;&#1082;&#1088;&#1077;&#1085;&#1085;&#1077; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1090;&#1077;&#1084;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080;, &#1093;&#1086;&#1090;&#1103; &#1090;&#1072; &#1080; &#1085;&#1077; &#1073;&#1099;&#1083;&#1072; &#1077;&#1081; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1072; &#8212; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082; &#1076;&#1072;&#1077;&#1090; &#1089;&#1080;&#1083;&#1099; &#1085;&#1077;&#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1080;&#1089;&#1072;&#1090;&#1077;&#1083;&#1102;. &#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086;, &#1076;&#1088;&#1091;&#1075;.
</p><p>&#1059; &#1084;&#1077;&#1085;&#1103; &#1073;&#1099;&#1083;&#1086; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1079;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1080; &#1089;&#1090;&#1072;&#1088;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1077;&#1085;&#1090;&#1072;: &#1049;&#1086;&#1072;&#1074; &#1064;&#1072;&#1087;&#1080;&#1088;&#1072;, &#1069;&#1085;&#1076;&#1088;&#1102; &#1057;&#1090;&#1077;&#1083;&#1083;&#1084;&#1072;&#1085;, &#1044;&#1072;&#1074;&#1072;&#1085;&#1091;&#1084; &#1057;&#1088;&#1080;&#1085;&#1080;&#1074;&#1072;&#1089; &#1080; &#1041;&#1077;&#1085; &#1061;&#1072;&#1081;&#1076;. &#1045;&#1089;&#1083;&#1080; &#1073;&#1099; &#1103; &#1084;&#1086;&#1075; &#1091;&#1095;&#1077;&#1089;&#1090;&#1100; &#1074;&#1089;&#1077; &#1080;&#1093; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086;&#1083;&#1077;&#1087;&#1085;&#1099;&#1077; &#1087;&#1086;&#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1103;, &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1073;&#1099;&#1083;&#1072; &#1073;&#1099; &#1077;&#1097;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077;. &#1042;&#1088;&#1077;&#1084;&#1103; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077;, &#1085;&#1086; &#1090;&#1086; &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086;, &#1076;&#1072;&#1083;&#1086; &#1082;&#1085;&#1080;&#1075;&#1077; &#1084;&#1085;&#1086;&#1075;&#1086;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1077;&#1097;&#1077; &#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1080;&#1089;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1090;&#1086; &#1086;&#1085;&#1080; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090; &#1084;&#1085;&#1077;.</p><p>&#1052;&#1086;&#1080; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080;, &#1060;&#1088;&#1072;&#1085;&#1089;&#1080;&#1089; &#1080; &#1043;&#1077;&#1085;&#1088;&#1080;, &#1073;&#1099;&#1083;&#1080; &#1085;&#1077;&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086; &#1076;&#1086;&#1073;&#1088;&#1099; &#1082;&#1072;&#1082; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;, &#1080; 
&#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1084;&#1077;&#1085;&#1077;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1085;&#1072; &#1095;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1072;&#1103; &#1103; &#1085;&#1072;&#1076;&#1091;&#1102;&#1089;&#1100; &#1086;&#1085;&#1080; &#1085;&#1072;&#1081;&#1076;&#1091;&#1090; &#1077;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1095;&#1080;&#1090;&#1072;&#1073;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;.</p><p>&#1048; &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094; &#1093;&#1086;&#1095;&#1091; &#1087;&#1086;&#1073;&#1072;&#1075;&#1083;&#1072;&#1076;&#1072;&#1088;&#1080;&#1090;&#1100; &#1090;&#1077;&#1093; &#1082;&#1086;&#1084;&#1091; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1072;, &#1050;&#1072;&#1088;&#1077;&#1085; &#1040;&#1085;&#1076;&#1077;&#1088;&#1093;&#1080;&#1083;&#1083; &#1080; &#1044;&#1078;&#1080;&#1084;&#1072; &#1041;&#1083;&#1101;&#1085;&#1076;&#1080;. &#1044;&#1088;&#1091;&#1078;&#1073;&#1072; &#1050;&#1072;&#1088;&#1077;&#1085; &#1080; &#1077;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1076;&#1083;&#1103; &#1084;&#1077;&#1085;&#1103; &#1074;&#1089;&#1077;, &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080;, &#1085;&#1086; &#1080; &#1079;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1089;&#1077;&#1084;&#1100; &#1083;&#1077;&#1090;. &#1041;&#1077;&#1079; &#1077;&#1077; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1073;&#1099; &#1085;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1083;&#1072;&#1089;&#1100;. &#1069;&#1090;&#1086; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1044;&#1078;&#1080;&#1084;&#1072;, &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1072; &#1080; &#1093;&#1072;&#1082;&#1077;&#1088;&#1072; &#1093;&#1072;&#1082;&#1077;&#1088;&#1086;&#1074;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1074;&#1096;&#1077;&#1075;&#1086; &#1084;&#1085;&#1077; &#1084;&#1080;&#1088; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1082;&#1072;&#1082; &#1087;&#1090;&#1080;&#1094;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1072;&#1091;&#1095;&#1080;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090;&#1099; &#1083;&#1077;&#1090;&#1072;&#1090;&#1100;.
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="sources.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="disclaimer.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1044;&#1080;&#1089;&#1082;&#1083;&#1077;&#1081;&#1084;&#1077;&#1088;</td></tr></table></div></body></html>
