<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1044;&#1083;&#1103; &#1082;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072;?</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="preface.html" title="&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;"><link rel="prev" href="preface.html" title="&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;"><link rel="next" href="sources.html" title="&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1044;&#1083;&#1103; &#1082;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072;?</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preface.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="sources.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1044;&#1083;&#1103; &#1082;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072;?"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="audience"></a>&#1044;&#1083;&#1103; &#1082;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072;?</h2></div></div></div><p>&#1069;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1080; &#1084;&#1077;&#1085;&#1077;&#1085;&#1076;&#1078;&#1077;&#1088;&#1086;&#1074;, &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1083;&#1103; &#1090;&#1077;&#1093; &#1082;&#1090;&#1086;, &#1091;&#1078;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081;, &#1085;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;. &#1050;&#1085;&#1080;&#1075;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1080; &#1078;&#1077;&#1083;&#1072;&#1102;&#1097;&#1080;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1086;&#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;, &#1085;&#1086; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1074;&#1096;&#1080;&#1084; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;.</p><p>&#1063;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1084;, &#1085;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1055;&#1054;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088;&#1099; &#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1099;&#1077; &#1087;&#1072;&#1090;&#1095;&#1080;, &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.</p><p>&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1086;&#1087;&#1099;&#1090; &#1089;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1058;&#1077; &#1082;&#1090;&#1086; &#1091;&#1078;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1055;&#1054;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086; &#1085;&#1072;&#1081;&#1076;&#1091;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1088;&#1080;&#1074;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1078;&#1077;&#1083;&#1072;&#1102;&#1090; &#1080;&#1093; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;. &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1087;&#1099;&#1090; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1074; &#1101;&#1090;&#1086;&#1084; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1077; &#1088;&#1072;&#1079;&#1085;&#1080;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;, &#1103; &#1087;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1083;&#1089;&#1103; &#1086;&#1079;&#1072;&#1075;&#1083;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1089;&#1072;&#1084;&#1099;&#1084; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1080; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1072;&#1090;&#1100; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1086; &#1090;&#1086;&#1084; &#1082;&#1072;&#1082;&#1080;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;.
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preface.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="sources.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;</td></tr></table></div></body></html>
