<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="prev" href="marketing.html" title="Marketing"><link rel="next" href="common-pitfalls.html" title="&#1050;&#1072;&#1082; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;?"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="marketing.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="common-pitfalls.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h2 class="title"><a name="communications"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</h2></div></div></div><div class="toc"><p><b>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</b></p><dl><dt><span class="sect1"><a href="communications.html#you-are-what-you-write">&#1042;&#1099; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1080;&#1096;&#1077;&#1090;&#1077;</a></span></dt><dd><dl><dt><span class="sect2"><a href="communications.html#structure-and-formatting">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</a></span></dt><dt><span class="sect2"><a href="communications.html#writing-content">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a></span></dt><dt><span class="sect2"><a href="communications.html#writing-tone">&#1058;&#1086;&#1085;</a></span></dt><dt><span class="sect2"><a href="communications.html#rudeness">&#1050;&#1072;&#1082; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;?</a></span></dt><dt><span class="sect2"><a href="communications.html#face">&#1051;&#1080;&#1094;&#1086;</a></span></dt></dl></dd><dt><span class="sect1"><a href="common-pitfalls.html">&#1050;&#1072;&#1082; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;?</a></span></dt><dd><dl><dt><span class="sect2"><a href="common-pitfalls.html#post-with-purpose">&#1053;&#1077; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1073;&#1077;&#1079; &#1094;&#1077;&#1083;&#1080;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#productive-threads">&#1055;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1080; &#1085;&#1077;&#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1090;&#1077;&#1084;&#1099;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#bikeshed">&#1063;&#1077;&#1084; &#1096;&#1080;&#1088;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1090;&#1077;&#1084; &#1076;&#1083;&#1080;&#1085;&#1085;&#1077;&#1077; &#1089;&#1087;&#1086;&#1088;&#1099;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#holy-wars">&#1050;&#1072;&#1082; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1088;&#1077;&#1083;&#1080;&#1075;&#1080;&#1086;&#1079;&#1085;&#1099;&#1093; &#1074;&#1086;&#1081;&#1085;?</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#noisy-minority">&#1069;&#1092;&#1092;&#1077;&#1082;&#1090; "&#1096;&#1091;&#1084;&#1103;&#1097;&#1077;&#1075;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072;"</a></span></dt></dl></dd><dt><span class="sect1"><a href="difficult-people.html">&#1058;&#1103;&#1078;&#1105;&#1083;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080;</a></span></dt><dd><dl><dt><span class="sect2"><a href="difficult-people.html#handling-difficult-people">&#1050;&#1072;&#1082; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089; &#1090;&#1103;&#1078;&#1105;&#1083;&#1099;&#1084;&#1080; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;</a></span></dt><dt><span class="sect2"><a href="difficult-people.html#difficult-people-case-study">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;: &#1090;&#1088;&#1091;&#1076;&#1085;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080;</a></span></dt></dl></dd><dt><span class="sect1"><a href="growth.html">&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;</a></span></dt><dd><dl><dt><span class="sect2"><a href="growth.html#using-archives">&#1064;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;</a></span></dt><dd><dl><dt><span class="sect3"><a href="growth.html#all-as-archives">&#1058;&#1088;&#1072;&#1082;&#1090;&#1091;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099; &#1082;&#1072;&#1082; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;</a></span></dt></dl></dd><dt><span class="sect2"><a href="growth.html#codifying-tradition">&#1050;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1081;</a></span></dt></dl></dd><dt><span class="sect1"><a href="bug-tracker-usage.html">&#1053;&#1077;&#1090; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084; &#1074; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</a></span></dt><dt><span class="sect1"><a href="publicity.html">&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</a></span></dt><dd><dl><dt><span class="sect2"><a href="publicity.html#security">&#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1076;&#1099;&#1088;&#1072;&#1093; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;</a></span></dt><dd><dl><dt><span class="sect3"><a href="publicity.html#security-receiving">&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-finding-a-fix">&#1053;&#1077;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-cve">&#1053;&#1086;&#1084;&#1077;&#1088;&#1072; CAN/CVE</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-prenotification">&#1055;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-announcing">&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;</a></span></dt></dl></dd></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#1057;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1085;&#1103;&#1090;&#1099;&#1084;,&#8212;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1089;&#1072;&#1084;&#1099;&#1084;
&#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1091;&#1084;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1084;&#1080;&#1088;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;. &#1042; &#1076;&#1086;&#1083;&#1075;&#1086;&#1089;&#1088;&#1086;&#1095;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; &#1086;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;
&#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1090;&#1072;&#1083;&#1072;&#1085;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;. &#1054;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090; &#1089; &#1087;&#1083;&#1086;&#1093;&#1080;&#1084;&#1080;
&#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1091; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;
&#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;. &#1040; &#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090; &#1089; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1084;&#1080; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1091;&#1073;&#1077;&#1078;&#1076;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1074;&#1077;&#1097;&#1077;&#1081;, &#1080;, &#1090;&#1072;&#1082;&#1080;&#1084;
&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1080;&#1084;&#1077;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
</p><p>&#1052;&#1077;&#1078;&#1076;&#1091; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1082;&#1086;&#1076; &#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1073;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1085;&#1077;&#1090;
&#1086;&#1097;&#1091;&#1090;&#1080;&#1084;&#1086;&#1081; &#1082;&#1086;&#1088;&#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1080;, &#1085;&#1080; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;, &#1085;&#1080; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103;
&#1082;&#1086;&#1088;&#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1084; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084;
&#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1101;&#1090;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1072;&#1083;&#1072;&#1103; &#1090;&#1086;&#1083;&#1080;&#1082;&#1072;
&#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;. &#1043;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1072; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;
&#1072;&#1091;&#1076;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1095;&#1100;&#1080;-&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1080;&#1093; &#1074;&#1080;&#1076;&#1103;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;, &#1080; &#1087;&#1086;&#1073;&#1091;&#1078;&#1076;&#1072;&#1090;&#1100;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1072; &#1089;&#1074;&#1086;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082; &#1078;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;. &#1056;&#1072;&#1074;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1080;&#1083;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1102;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;
&#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1074; &#1089;&#1080;&#1083;&#1091; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1085;&#1077; &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089; &#1074;&#1086;&#1079;&#1088;&#1086;&#1089;&#1096;&#1080;&#1084;
&#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1080; &#1091;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;.</p><p>&#1042;&#1089;&#1105; &#1101;&#1090;&#1086; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086; &#1074; &#1090;&#1077;&#1086;&#1088;&#1080;&#1080;, &#1085;&#1072; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1080;&#1084;&#1086; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;, &#1074; &#1089;&#1080;&#1083;&#1091; &#1090;&#1086;&#1075;&#1086;,
&#1095;&#1090;&#1086; &#1089;&#1088;&#1077;&#1076;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1085;&#1077;&#1086;&#1076;&#1085;&#1086;&#1088;&#1086;&#1076;&#1085;&#1072; &#1085;&#1080; &#1087;&#1086; &#1072;&#1091;&#1076;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1085;&#1080; &#1087;&#1086;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1084; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072;&#1084; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;. &#1063;&#1090;&#1086; &#1089;&#1090;&#1086;&#1080;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1077;&#1081; &#1084;&#1099;&#1089;&#1083;&#1100;&#1102; &#8212;
&#1088;&#1072;&#1079;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1082; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;, &#1080;&#1083;&#1080;
&#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;? &#1054;&#1090;&#1074;&#1077;&#1095;&#1072;&#1103; &#1085;&#1072; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1084; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;
&#1079;&#1085;&#1072;&#1085;&#1080;&#1081; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1091; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1103;, &#1095;&#1090;&#1086; "&#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1100;" &#8212; &#1101;&#1090;&#1086; &#1085;&#1077;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1090;, &#1082;&#1090;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1079;&#1072;&#1076;&#1072;&#1083; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1085;&#1086; &#1074;&#1089;&#1077;, &#1082;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1074;&#1072;&#1096; &#1086;&#1090;&#1074;&#1077;&#1090;? &#1063;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1086;&#1079;&#1080;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090;&#1077; &#1089;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;, &#1080; &#1085;&#1077; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1074;&#1072;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1079;&#1072;&#1103;&#1074;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072;, &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;&#1084;&#1080; &#1086; &#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;, &#1080; &#1073;&#1086;&#1083;&#1090;&#1086;&#1074;&#1085;&#1105;&#1081; &#1085;&#1080; &#1086; &#1095;&#1105;&#1084;?
&#1050;&#1072;&#1082; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1080;&#1089;&#1095;&#1077;&#1088;&#1087;&#1072;&#1083; &#1089;&#1077;&#1073;&#1103; &#1080; &#1095;&#1090;&#1086; &#1089; &#1101;&#1090;&#1080;&#1084; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100;?
</p><p>&#1069;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1077;
&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1072;&#1077;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1088;&#1086;&#1089;&#1090;&#1072; &#1080;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
&#1054;&#1085;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1102;&#1090; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081;
&#1080;&#1084;&#1087;&#1088;&#1086;&#1074;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1085;&#1072; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;. &#1042;&#1089;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100;
&#1079;&#1072; &#1090;&#1077;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1080; &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1074;&#1103;&#1079;&#1085;&#1091;&#1090;&#1100; &#1074; &#1073;&#1086;&#1083;&#1086;&#1090;&#1077;, &#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;
&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1055;&#1086;&#1084;&#1086;&#1097;&#1100; &#1083;&#1102;&#1076;&#1103;&#1084; &#1074; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1101;&#1090;&#1086;&#1081; &#1094;&#1077;&#1083;&#1080; - &#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1099;&#1093; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093;
&#1079;&#1072;&#1076;&#1072;&#1095; &#1087;&#1088;&#1080; &#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054;. &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1093; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1082;&#1072;&#1082;
&#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1105; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1082;&#1072;&#1082; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072;&#1084;&#1080;
&#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.<sup>[<a name="idp7438352" href="#ftn.idp7438352" class="footnote">22</a>]</sup></p></div><div class="sect1" title="&#1042;&#1099; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1080;&#1096;&#1077;&#1090;&#1077;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="you-are-what-you-write"></a>&#1042;&#1099; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1080;&#1096;&#1077;&#1090;&#1077;</h2></div></div></div><p>&#1055;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1076; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;: &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1074;&#1072;&#1089; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083;&#1080;, &#1080;&#1083;&#1080; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083; &#1086; &#1074;&#1072;&#1089;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1073;&#1099;&#1090;&#1100;
&#1103;&#1088;&#1082;&#1086;&#1081;, &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1080;&#1084;&#1095;&#1080;&#1074;&#1086;&#1081; &#1080; &#1093;&#1072;&#1088;&#1080;&#1079;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1080; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072; &#1073;&#1077;&#1089;&#1089;&#1074;&#1103;&#1079;&#1085;&#1099;
&#1080; &#1085;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;, &#1083;&#1102;&#1076;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1074;&#1072;&#1089; &#1090;&#1072;&#1082;&#1080;&#1084;. &#1048;&#1083;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1074;&#1099; &#1074; &#1078;&#1080;&#1079;&#1085;&#1080;
&#1085;&#1077;&#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081;, &#1073;&#1077;&#1089;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1085;&#1099;&#1081; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1085;&#1086; &#1085;&#1080;&#1082;&#1090;&#1086; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1079;&#1072;&#1076;&#1091;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1080;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099; &#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;.</p><p>&#1042;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082; &#1089;&#1090;&#1080;&#1083;&#1102; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072; &#1074;&#1077;&#1088;&#1085;&#1105;&#1090;&#1089;&#1103; &#1089;&#1090;&#1086;&#1088;&#1080;&#1094;&#1077;&#1081;. &#1057;&#1090;&#1072;&#1088;&#1099;&#1081; &#1093;&#1072;&#1082;&#1077;&#1088;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1044;&#1078;&#1080;&#1084; &#1041;&#1083;&#1101;&#1085;&#1076;&#1080; (Jim Blandy) &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1091;&#1102; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102;:</p><div class="blockquote"><blockquote class="blockquote"><p>&#1042; &#1076;&#1072;&#1083;&#1105;&#1082;&#1086;&#1084; 1993 &#1075;&#1086;&#1076;&#1091; &#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1085;&#1072; Free Software Foundation, &#1080; &#1084;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;&#1089;&#1100;
	&#1073;&#1077;&#1090;&#1072;-&#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 19 GNU Emacs. &#1052;&#1099; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1083;&#1080; &#1073;&#1077;&#1090;&#1072;-&#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102;
	&#1085;&#1077;&#1076;&#1077;&#1083;&#1102; &#1080;&#1083;&#1080; &#1086;&#1082;&#1086;&#1083;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1072; &#1083;&#1102;&#1076;&#1080; &#1080;&#1089;&#1087;&#1099;&#1090;&#1099;&#1074;&#1072;&#1083;&#1080; &#1077;&#1105; &#1080; &#1087;&#1088;&#1080;&#1089;&#1099;&#1083;&#1072;&#1083;&#1080; &#1085;&#1072;&#1084; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099; &#1086;&#1073;
	&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;. &#1041;&#1099;&#1083; &#1086;&#1076;&#1080;&#1085; &#1087;&#1072;&#1088;&#1077;&#1085;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1080;&#1082;&#1090;&#1086; &#1080;&#1079; &#1085;&#1072;&#1089; &#1085;&#1077; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1083; &#1074; &#1078;&#1080;&#1079;&#1085;&#1080;, &#1085;&#1086;
	&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1077;&#1083;&#1072;&#1083; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1091;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;: &#1077;&#1075;&#1086; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1083;&#1080;
	&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1084;&#1080; &#1080; &#1087;&#1088;&#1103;&#1084;&#1086; &#1085;&#1072;&#1074;&#1086;&#1076;&#1080;&#1083;&#1080; &#1085;&#1072;&#1089; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;, &#1072; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085; &#1089;&#1072;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083; 
	&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1086;&#1085;&#1086; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1054;&#1085; &#1073;&#1099;&#1083; &#1087;&#1088;&#1077;&#1074;&#1086;&#1089;&#1093;&#1086;&#1076;&#1077;&#1085;.</p><p>&#1044;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; FSF &#1084;&#1086;&#1075; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1095;&#1077;&#1081;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1082;&#1086;&#1076;, &#1084;&#1099; &#1087;&#1088;&#1086;&#1089;&#1080;&#1083;&#1080; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1085;&#1077;&#1082;&#1091;&#1102;
	&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1073;&#1091;&#1084;&#1072;&#1075;&#1091;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1097;&#1091;&#1102; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072; &#1082;&#1086;&#1076; FSF. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086;
	&#1090;&#1072;&#1082; &#1073;&#1088;&#1072;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1087;&#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; - &#1101;&#1090;&#1086; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;
	&#1085;&#1072;&#1078;&#1080;&#1090;&#1100; &#1102;&#1088;&#1080;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;.</p><p>&#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1103; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083; &#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1072;&#1088;&#1085;&#1102; &#1080;&#1084;&#1077;&#1081;&#1083; &#1089; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1080; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083;: "&#1042;&#1086;&#1090; &#1085;&#1077;&#1082;&#1072;&#1103;
	&#1073;&#1091;&#1084;&#1072;&#1075;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1072;, &#1080; &#1074;&#1086;&#1090; &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086;, &#1074;&#1099; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1079;&#1076;&#1077;&#1089;&#1100;, &#1072; &#1074;&#1072;&#1096;
	&#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100; &#1090;&#1091;&#1090;, &#1080; &#1090;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1074;&#1072;&#1096;&#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.
	&#1057;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077;."</p><p>&#1054;&#1085; &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1083; &#1084;&#1085;&#1077; &#1074; &#1086;&#1090;&#1074;&#1077;&#1090;: "&#1059; &#1084;&#1077;&#1085;&#1103; &#1085;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1103;."</p><p>&#1058;&#1086;&#1075;&#1076;&#1072; &#1103; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083;: "&#1051;&#1072;&#1076;&#1085;&#1086;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;, &#1087;&#1091;&#1089;&#1090;&#1100; &#1087;&#1086;&#1076;&#1087;&#1080;&#1096;&#1077;&#1090; &#1074;&#1072;&#1096; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090; &#1080;
	&#1087;&#1088;&#1080;&#1089;&#1099;&#1083;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;."</p><p>&#1063;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1085; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1083; &#1084;&#1085;&#1077; &#1089;&#1085;&#1086;&#1074;&#1072;: "&#1053;&#1091;, &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;... &#1084;&#1085;&#1077;
	&#1090;&#1088;&#1080;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1100; &#1083;&#1077;&#1090; &#1080; &#1103; &#1078;&#1080;&#1074;&#1091; &#1089; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;."</p></blockquote></div><p>&#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1077;&#1085;&#1100; &#1085;&#1077; &#1087;&#1080;&#1089;&#1072;&#1083; &#1082;&#1072;&#1082; &#1090;&#1088;&#1080;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1080;&#1083;&#1077;&#1090;&#1085;&#1080;&#1081;, &#1085;&#1080;&#1082;&#1090;&#1086; &#1080; &#1085;&#1077; &#1079;&#1085;&#1072;&#1083;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1084;&#1091;.
&#1044;&#1072;&#1083;&#1077;&#1077; &#1080;&#1079;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1072;&#1096;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077;
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1083;&#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1077;.</p><div class="sect2" title="&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h3 class="title"><a name="structure-and-formatting"></a>&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</h3></div></div></div><p>&#1053;&#1077; &#1079;&#1072;&#1075;&#1086;&#1085;&#1103;&#1081;&#1090;&#1077; &#1089;&#1077;&#1073;&#1103; &#1074; &#1083;&#1086;&#1074;&#1091;&#1096;&#1082;&#1091;, &#1080;&#1079;&#1083;&#1072;&#1075;&#1072;&#1103; &#1074;&#1089;&#1105; &#1090;&#1072;&#1082;, &#1073;&#1091;&#1076;&#1090;&#1086; &#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1089;&#1084;&#1089;. &#1055;&#1080;&#1096;&#1080;&#1090;&#1077; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084;&#1080;
&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1099;,
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1075;&#1076;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1099;&#1074;&#1099; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092;&#1086;&#1074;.&#1069;&#1090;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081;
&#1087;&#1086;&#1095;&#1090;&#1099; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1042; IRC &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1085;&#1077;&#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;&#1093; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;
&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086; &#1079;&#1072;&#1073;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086; &#1079;&#1072;&#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1078;&#1072;&#1090;&#1099;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;
&#1086;&#1073;&#1097;&#1077;&#1091;&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080; &#1090;.&#1076;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077; &#1101;&#1090;&#1080; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1082;&#1080; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;, &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1077; &#1092;&#1086;&#1088;&#1091;&#1084;&#1099;. &#1069;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1095;&#1090;&#1072;, &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1074;&#1080;&#1076;&#1099; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1086;&#1083;&#1075;&#1072;&#1103; &#1078;&#1080;&#1079;&#1085;&#1100;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080; &#1080; &#1086;&#1088;&#1092;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080; &#1080; &#1080;&#1084;&#1077;&#1090;&#1100;
&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1089;&#1074;&#1103;&#1079;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;. &#1048; &#1101;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1073;&#1086;&#1088;&#1091; &#1095;&#1091;&#1076;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1099;&#1093;
&#1087;&#1088;&#1072;&#1074;&#1080;&#1083; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; <span class="emphasis"><em>&#1085;&#1077;</em></span> &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;:
&#1086;&#1085;&#1080; &#1101;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080; &#1074; &#1089;&#1074;&#1086;&#1080; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;
&#1090;&#1077;&#1082;&#1089;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1099;&#1084;, &#1080; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1080;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1093; &#1087;&#1086; &#1101;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;.
&#1063;&#1080;&#1090;&#1072;&#1073;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1072;&#1078;&#1085;&#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;
&#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1085;&#1086; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082;&#1072;&#1082; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1091;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1074;&#1088;&#1077;&#1084;&#1103;
&#1103;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1082;&#1072;&#1082; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081;.</p><p>&#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1099; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1055;&#1054; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;
&#1074;&#1099;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;:</p><p>&#1055;&#1086;&#1089;&#1099;&#1083;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1085;&#1077; &#1074; HTML, RichText,
&#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1089; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; 72 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1074;
&#1076;&#1083;&#1080;&#1085;&#1091;. &#1053;&#1077; &#1079;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077; &#1079;&#1072; 80-&#1102; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1090;&#1072;&#1083;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1086;&#1084;
<span class="foreignphrase"><em class="foreignphrase">&#1076;&#1077;-&#1092;&#1072;&#1082;&#1090;&#1086;</em></span> &#1076;&#1083;&#1103; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1072; (&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1083;&#1102;&#1076;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1077; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1099;, &#1085;&#1086; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1091;&#1079;&#1082;&#1080;&#1077;). &#1044;&#1077;&#1083;&#1072;&#1103; &#1089;&#1074;&#1086;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086;<span class="emphasis"><em>&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;</em></span> 80 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;,
&#1074;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1076;&#1086;&#1073;&#1072;&#1074;&#1103;&#1090;&#1089;&#1103; &#1074; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072;&#1093; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086;
&#1090;&#1077;&#1082;&#1089;&#1090;&#1072;.</p><p><span class="emphasis"><em>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1088;&#1072;&#1079;&#1088;&#1099;&#1074;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;.</em></span> &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1103;&#1090; &#1092;&#1080;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1073;&#1086;&#1088;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072; &#1085;&#1072; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1077; &#1074;&#1080;&#1076;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1099; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084;
&#1076;&#1077;&#1083;&#1077; &#1090;&#1072;&#1084; &#1085;&#1077;&#1090;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1074; &#1085;&#1105;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1073;&#1099;&#1090;&#1100; &#1090;&#1077;&#1093; &#1088;&#1072;&#1079;&#1088;&#1099;&#1074;&#1086;&#1074; &#1089;&#1090;&#1088;&#1086;&#1082;,
&#1095;&#1090;&#1086; &#1074;&#1099; &#1074;&#1080;&#1076;&#1077;&#1083;&#1080;, &#1080; &#1086;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1086; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1085;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1103;&#1093; &#1087;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080;.
&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1072; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1080;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1099;, &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077;
&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1072;&#1076;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1083;&#1080;&#1089;&#1100; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1099;&#1077;
&#1088;&#1072;&#1079;&#1088;&#1099;&#1074;&#1099; &#1089;&#1090;&#1088;&#1086;&#1082;.</p><p>&#1055;&#1088;&#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1074;, &#1082;&#1091;&#1089;&#1082;&#1086;&#1074; &#1082;&#1086;&#1076;&#1072; &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1074;&#1076;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1103;&#1074;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1072;&#1078;&#1077; &#1091;&#1089;&#1090;&#1072;&#1074;&#1096;&#1080;&#1077; &#1075;&#1083;&#1072;&#1079;&#1072; &#1084;&#1086;&#1075;&#1083;&#1080;
&#1083;&#1077;&#1075;&#1082;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1074;&#1072;&#1096;&#1077;&#1081; &#1087;&#1088;&#1086;&#1079;&#1086;&#1081; &#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1094;&#1080;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;. (&#1071; &#1085;&#1077;
&#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1083;&#1089;&#1103; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1089;&#1086;&#1074;&#1077;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1083; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1085;&#1080;&#1075;&#1091;, &#1085;&#1086; &#1087;&#1086;&#1079;&#1078;&#1077; &#1074;&#1086;
&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1055;&#1054; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1103; &#1074;&#1089;&#1090;&#1088;&#1077;&#1090;&#1080;&#1083; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1089;&#1084;&#1077;&#1096;&#1080;&#1074;&#1072;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1080;&#1079; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1085;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1103; &#1095;&#1105;&#1090;&#1082;&#1086; &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1095;&#1090;&#1086;. &#1069;&#1092;&#1092;&#1077;&#1082;&#1090;
&#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1087;&#1077;&#1095;&#1072;&#1083;&#1077;&#1085;. &#1048;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1090;&#1088;&#1091;&#1076;&#1085;&#1099; &#1076;&#1083;&#1103; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103; &#1080;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1077;&#1089;&#1090;&#1085;&#1086;,
&#1090;&#1072;&#1082;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;.)</p><p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1094;&#1080;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1095;&#1100;&#1105;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086;, &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1089;&#1074;&#1086;&#1080; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1090;&#1072;&#1084;, &#1075;&#1076;&#1077; &#1086;&#1085;&#1080; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077;
&#1091;&#1084;&#1077;&#1089;&#1090;&#1085;&#1099;, &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1091;&#1078;&#1085;&#1086;, &#1080; &#1074;&#1099;&#1088;&#1077;&#1078;&#1100;&#1090;&#1077; &#1090;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1085;&#1077; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1083;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1080;&#1096;&#1080;&#1090;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1102; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;
<em class="firstterm">&#1074;&#1099;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;</em> (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1074;&#1099;&#1096;&#1077; &#1094;&#1080;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;); &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1099; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1086;&#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102;
&#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090;.</p><p>&#1061;&#1086;&#1088;&#1086;&#1096;&#1086; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1076; &#1090;&#1077;&#1084;&#1086;&#1081; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077;
&#1074;&#1072;&#1078;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091;
&#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100;, &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1057;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1095;&#1090;&#1099;
&#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1074;&#1077;&#1090;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1097;&#1077;&#1081; &#1090;&#1077;&#1084;&#1086;&#1081;, &#1085;&#1086; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1084;&#1080; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103;).
 &#1054;&#1090;&#1089;&#1102;&#1076;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074; &#1074;&#1077;&#1090;&#1082;&#1077; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1072;&#1103; &#1090;&#1077;&#1084;&#1072;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;&#8212;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#8212;&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1090;&#1077;&#1084;&#1091; &#1087;&#1088;&#1080; &#1086;&#1090;&#1074;&#1077;&#1090;&#1077;. &#1062;&#1077;&#1083;&#1086;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1077;&#1090;&#1082;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1072;, &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1084;, &#1085;&#1086; &#1085;&#1086;&#1074;&#1072;&#1103; &#1090;&#1077;&#1084;&#1072; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1083;&#1102;&#1076;&#1103;&#1084;,
&#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084; &#1074;&#1077;&#1090;&#1082;&#1091;, &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1089;&#1090;&#1072;&#1083; &#1096;&#1080;&#1088;&#1077;. &#1048; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;
&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1076;&#1085;&#1103;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;,
&#1072; &#1085;&#1077; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1074; &#1090;&#1077;&#1084;&#1091;. &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1072;&#1096;&#1072; &#1087;&#1086;&#1095;&#1090;&#1072; &#1074;&#1089;&#1105;
&#1077;&#1097;&#1105; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1074; &#1090;&#1091; &#1078;&#1077; &#1074;&#1077;&#1090;&#1082;&#1091;, &#1095;&#1090;&#1086; &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1072;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1099; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090;&#1077;, &#1080; &#1090;&#1086;&#1075;&#1076;&#1072; &#1083;&#1102;&#1076;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1096;&#1072; &#1087;&#1086;&#1095;&#1090;&#1072;
&#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1090;&#1086;&#1081; &#1090;&#1077;&#1084;&#1077; &#1072; &#1101;&#1090;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082;. &#1048; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1085;&#1080; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1102;&#1090; &#1089;&#1074;&#1086;&#1077;
&#1074;&#1088;&#1077;&#1084;&#1103;, &#1085;&#1086; &#1080; &#1076;&#1086;&#1074;&#1077;&#1088;&#1080;&#1077; &#1082; &#1074;&#1072;&#1084;, &#1082;&#1072;&#1082; &#1082; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1074;&#1083;&#1072;&#1076;&#1077;&#1077;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;
&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1086;&#1088;&#1074;&#1072;&#1085;&#1086;.</p></div><div class="sect2" title="&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h3 class="title"><a name="writing-content"></a>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h3></div></div></div><p>&#1055;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;
&#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1080;&#1093;. &#1053;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1075;&#1086;
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1077;&#1075;&#1086; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1099;&#1084;.</p><p>&#1059;&#1087;&#1088;&#1086;&#1097;&#1072;&#1081;&#1090;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1089;&#1074;&#1086;&#1080;&#1084; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;. &#1042;&#1086;&#1082;&#1088;&#1091;&#1075; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1055;&#1054; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1074;&#1080;&#1090;&#1072;&#1077;&#1090; &#1084;&#1072;&#1089;&#1089;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1090;&#1086;,
&#1095;&#1090;&#1086; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1079;&#1085;&#1072;&#1102;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1077;&#1105; &#1095;&#1072;&#1089;&#1090;&#1100;,&#8212;&#1074;&#1086;&#1086;&#1073;&#1097;&#1077;, &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086;
&#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090; &#1082;&#1072;&#1082; &#1077;&#1105; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100;. &#1042;&#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1074;&#1072;&#1096;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077;, &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;.
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1076;&#1074;&#1077; &#1083;&#1080;&#1096;&#1085;&#1080;&#1093; &#1084;&#1080;&#1085;&#1091;&#1090;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1082;&#1086;&#1087;&#1072;&#1090;&#1100; URL &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1074;&#1077;&#1090;&#1082;&#1091; &#1074;
&#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080; &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1080;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1077; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1086;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072;,&#8212;
&#1086;&#1085;&#1086; &#1090;&#1086;&#1075;&#1086; &#1089;&#1090;&#1086;&#1080;&#1090;! &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; 5-10 &#1084;&#1080;&#1085;&#1091;&#1090; &#1085;&#1072; &#1090;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1076;&#1074;&#1077;&#1089;&#1090;&#1080; &#1080;&#1090;&#1086;&#1075;&#1080;,
&#1085;&#1072;&#1082;&#1086;&#1087;&#1080;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1088;&#1086;&#1089;&#1096;&#1077;&#1081;&#1089;&#1103; &#1074;&#1077;&#1090;&#1082;&#1077;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1072;&#1090;&#1100; &#1083;&#1102;&#1076;&#1103;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;,
&#1074; &#1088;&#1072;&#1084;&#1082;&#1072;&#1093; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1072;&#1076;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074;&#1072;&#1096;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;. &#1044;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073;
&#1101;&#1090;&#1086;&#1084; &#1090;&#1072;&#1082;: &#1095;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1077;&#1085; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;
&#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1080;&#1089;&#1072;&#1090;&#1077;&#1083;&#1103; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1084; &#1080;&#1079; &#1092;&#1086;&#1088;&#1091;&#1084;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1074;&#1072;&#1096;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074;&#1080;&#1076;&#1103;&#1090;
<span class="emphasis"><em>N</em></span> &#1083;&#1102;&#1076;&#1077;&#1081;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1088;&#1086;&#1089;&#1090;&#1077; <span class="emphasis"><em>N</em></span>&#1094;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;
&#1079;&#1072;&#1090;&#1088;&#1072;&#1090; &#1085;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1089;&#1080;&#1083;&#1080;&#1103;, &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1103;&#1097;&#1080;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1101;&#1090;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1072;&#1089;&#1090;&#1105;&#1090;. &#1048;
&#1077;&#1089;&#1083;&#1080; &#1083;&#1102;&#1076;&#1080; &#1074;&#1080;&#1076;&#1103;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1089;&#1072;&#1084;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082;&#1086;&#1084;&#1091; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1091;, &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076;
&#1090;&#1077;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1074; &#1089;&#1074;&#1086;&#1080;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;&#1093;. &#1042; &#1080;&#1076;&#1077;&#1072;&#1083;&#1077;, &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1086;&#1089;&#1090; &#1086;&#1073;&#1097;&#1077;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;: &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#8212;&#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1083;&#1080; 
&#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1089;&#1077;&#1084; &#1080;&#1083;&#1080; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1074;&#1099;&#1075;&#1086;&#1076;&#1085;&#1077;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077;.</p><p>&#1053;&#1077; &#1091;&#1074;&#1083;&#1077;&#1082;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1075;&#1080;&#1087;&#1077;&#1088;&#1073;&#1086;&#1083;&#1072;&#1084;&#1080;. &#1055;&#1088;&#1077;&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1093; - &#1101;&#1090;&#1086;
&#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1075;&#1086;&#1085;&#1082;&#1072; &#1074;&#1086;&#1086;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1102;&#1097;&#1080;&#1081; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;, &#1084;&#1086;&#1078;&#1077;&#1090;
&#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1085;&#1077; &#1091;&#1076;&#1077;&#1083;&#1103;&#1090; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085;
&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1082;&#1072;&#1082; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1091;&#1102;, &#1085;&#1077; &#1076;&#1072;&#1102;&#1097;&#1091;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1077;
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1077;&#1084;&#1091; (&#1080; &#1074;&#1089;&#1077;&#1084; &#1077;&#1075;&#1086; &#1076;&#1088;&#1091;&#1079;&#1100;&#1103;&#1084;/&#1082;&#1086;&#1083;&#1083;&#1077;&#1075;&#1072;&#1084;/&#1088;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1080;&#1082;&#1072;&#1084;) &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1055;&#1054;, &#1093;&#1086;&#1090;&#1103; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1101;&#1090;&#1086; &#1074;&#1089;&#1077;&#1075;&#1086; &#1083;&#1080;&#1096;&#1100; &#1084;&#1077;&#1083;&#1082;&#1086;&#1077; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1086;. &#1053;&#1086;
&#1087;&#1088;&#1077;&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1095;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090;&#1089;&#1103;
&#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1078;&#1077; &#1074;&#1077;&#1097;&#1072;&#1084;&#1080; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1076;&#1077;&#1073;&#1072;&#1090;&#1086;&#1074;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1081;&#1090;&#1080;&#1089;&#1100; 
&#1074;&#1086; &#1074;&#1082;&#1091;&#1089;&#1072;&#1093; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1074; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;:</p><div class="blockquote"><blockquote class="blockquote"><p>"&#1055;&#1086;&#1089;&#1090;&#1091;&#1087;&#1080;&#1074; &#1090;&#1072;&#1082;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1099;&#1084;. &#1069;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090;
	&#1082;&#1086;&#1096;&#1084;&#1072;&#1088;&#1086;&#1084; &#1087;&#1088;&#1080; &#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080;, &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; J.Random'&#1072;..."</p></blockquote></div><p>&#1058;&#1086; &#1078;&#1077; &#1084;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; <span class="emphasis"><em>&#1089;&#1080;&#1083;&#1100;&#1085;&#1077;&#1077;</em></span>,
&#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1084;&#1077;&#1085;&#1077;&#1077; &#1072;&#1075;&#1088;&#1077;&#1089;&#1089;&#1080;&#1074;&#1085;&#1086;:</p><div class="blockquote"><blockquote class="blockquote"><p>"&#1069;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;, &#1085;&#1086; &#1076;&#1072;&#1083;&#1077;&#1082;&#1086; &#1085;&#1077; &#1080;&#1076;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1093; &#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080; 
	&#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1103; &#1090;&#1072;&#1082; &#1076;&#1091;&#1084;&#1072;&#1102;. &#1055;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; J.Random'&#1072; &#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1090; &#1101;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;,
	&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1086;..."</p></blockquote></div><p>&#1042;&#1072;&#1084; &#1085;&#1077; &#1091;&#1076;&#1072;&#1089;&#1090;&#1089;&#1103; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1080;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1087;&#1088;&#1077;&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1080; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1082; &#1101;&#1090;&#1086;&#1084;&#1091; &#1089;&#1090;&#1088;&#1077;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103;. &#1055;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1084;&#1080; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081;,
&#1075;&#1080;&#1087;&#1077;&#1088;&#1073;&#1086;&#1083;&#1099; &#1085;&#1077; &#1085;&#1072;&#1085;&#1086;&#1089;&#1103;&#1090; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1091;&#1097;&#1077;&#1088;&#1073;&#1072; - &#1086;&#1085;&#1080; &#1074;&#1088;&#1077;&#1076;&#1103;&#1090;, &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084;, &#1085;&#1072;&#1088;&#1091;&#1096;&#1080;&#1090;&#1077;&#1083;&#1102;. &#1059;
&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1077;&#1089;&#1090;&#1100; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1082;&#1086;&#1084;&#1087;&#1077;&#1085;&#1089;&#1072;&#1094;&#1080;&#1080;, &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1090;&#1077;&#1088;&#1103;&#1077;&#1090;
&#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1074;&#1077;&#1088;&#1080;&#1103;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1088;&#1072;&#1076;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;, &#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100;
&#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1072;&#1093;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1058;&#1086;&#1075;&#1076;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; <span class="emphasis"><em>&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;</em></span>
&#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1083;&#1102;&#1076;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1084;&#1091;&#1090; &#1074;&#1072;&#1089; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;.</p><p>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099;. &#1051;&#1102;&#1073;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1080;&#1085;&#1085;&#1077;&#1077; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092;&#1072; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086;
&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1094;&#1077;&#1083;&#1080;&#1082;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1088;&#1077;&#1096;&#1080;&#1083;&#1080; &#1095;&#1090;&#1086; &#1086;&#1085;&#1086;
&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1086;. &#1069;&#1090;&#1086; &#1089;&#1086;&#1074;&#1077;&#1090; &#1079;&#1085;&#1072;&#1102;&#1090; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1087;&#1086;&#1089;&#1077;&#1097;&#1072;&#1083; &#1091;&#1088;&#1086;&#1082;&#1080; &#1087;&#1080;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;, &#1085;&#1086; &#1076;&#1083;&#1103; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1093;
&#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1081; &#1086;&#1085; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074;&#1072;&#1078;&#1077;&#1085;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1089;&#1077;&#1090;&#1080; &#1079;&#1072;&#1095;&#1072;&#1089;&#1090;&#1091;&#1102;
&#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086; &#1089; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1076;&#1077;&#1083;&#1072; (&#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1091;&#1090;&#1100; &#1085;&#1072;&#1076;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;&#1079;&#1072;&#1076; &#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1089;&#1077;&#1090;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1089;&#1072;&#1081;&#1090;&#1099;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1076;&#1083;&#1103;
&#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1093; &#1086;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1093; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1074;, &#1080; &#1090;.&#1076;.), &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;.
&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1085;&#1077;&#1089;&#1074;&#1103;&#1079;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1080; &#1085;&#1077;
&#1073;&#1099;&#1083;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1086;&#1081;, &#1095;&#1072;&#1089;&#1090;&#1086; &#1080; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090; &#1085;&#1077;&#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1084;&#1080;, &#1082; &#1086;&#1075;&#1086;&#1088;&#1095;&#1077;&#1085;&#1080;&#1102; (&#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081;
&#1084;&#1077;&#1088;&#1077; &#1090;&#1072;&#1082; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1076;&#1091;&#1084;&#1072;&#1090;&#1100;) &#1080;&#1093; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074;. &#1055;&#1086;&#1090;&#1088;&#1072;&#1090;&#1100;&#1090;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088; &#1090;&#1086;&#1075;&#1086;,
&#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1077;. &#1063;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074;&#1072;&#1096;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1093; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;.</p></div><div class="sect2" title="&#1058;&#1086;&#1085;"><div class="titlepage"><div><div><h3 class="title"><a name="writing-tone"></a>&#1058;&#1086;&#1085;</h3></div></div></div><p>&#1055;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1085;&#1072;&#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1090;&#1099;&#1089;&#1103;&#1095;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1099;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1096;
&#1089;&#1090;&#1080;&#1083;&#1100; &#1090;&#1103;&#1075;&#1086;&#1090;&#1077;&#1077;&#1090; &#1082; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1090;&#1080;. &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1092;&#1086;&#1088;&#1091;&#1084;&#1086;&#1074; &#1101;&#1090;&#1086; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1088;&#1084;&#1086;&#1081;,
&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1087;&#1083;&#1086;&#1093;&#1086;&#1075;&#1086;. &#1057;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1099;&#1083;&#1072; &#1073;&#1099; &#1085;&#1077;&#1087;&#1088;&#1080;&#1077;&#1084;&#1083;&#1077;&#1084;&#1072; &#1074;
&#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1081; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1078;&#1080;&#1079;&#1085;&#1080;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1088;&#1084;&#1086;&#1081; &#1091; &#1093;&#1072;&#1082;&#1077;&#1088;&#1086;&#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;. &#1042;&#1086;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103; &#1086;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1077;&#1082;&#1086;&#1077;&#1075;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1086;&#1084;. &#1055;&#1088;&#1080;&#1074;&#1086;&#1078;&#1091; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;:</p><pre class="screen">
&#1053;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1074;&#1099; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100;, &#1089; &#1082;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1074;&#1099; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100;,
	&#1080; &#1090;.&#1087;.?
	
	&#1040; &#1090;&#1072;&#1082;&#1078;&#1077;:
	
	&#1050;&#1072;&#1082;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; Slash &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077;? &#1071; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100; &#1080;&#1079; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086;
	&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;.
	
	&#1050;&#1072;&#1082; &#1074; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074;&#1099; &#1089;&#1086;&#1073;&#1088;&#1072;&#1083;&#1080; apache/mod_perl &#1080;&#1079; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;?
	
	&#1055;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1083;&#1080; &#1083;&#1080; &#1074;&#1099; &#1087;&#1072;&#1090;&#1095; &#1076;&#1083;&#1103; Apache 2.0, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1096;&#1083;&#1072; &#1088;&#1077;&#1095;&#1100; &#1085;&#1072; 
	slashcode.com?
	
	&#1064;&#1077;&#1081;&#1085;</pre><p>&#1042;&#1086;&#1090; <span class="emphasis"><em>&#1101;&#1090;&#1086;</em></span> &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1090;&#1100;! &#1053;&#1080; &#1087;&#1088;&#1080;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1085;&#1080; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080;, &#1080; &#1089;&#1072;&#1084;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; -
&#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1077;&#1088;&#1080;&#1103; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1078;&#1072;&#1090;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
&#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1086; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1077;&#1103;&#1074;&#1085;&#1091;&#1102; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1091;
&#1084;&#1086;&#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1048; &#1074;&#1089;&#1105;-&#1090;&#1072;&#1082;&#1080;, &#1103; &#1073;&#1099;&#1083; &#1089;&#1095;&#1072;&#1089;&#1090;&#1083;&#1080;&#1074; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1087;&#1086;&#1095;&#1090;&#1091; &#1064;&#1077;&#1081;&#1085;&#1072;, &#1080; &#1085;&#1077;
&#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1103;&#1083; &#1077;&#1075;&#1086; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1090;&#1100; &#1082;&#1072;&#1082; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1079;&#1072;&#1085;&#1103;&#1090;&#1086;&#1089;&#1090;&#1080;. &#1058;&#1086;&#1090;
&#1092;&#1072;&#1082;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1083; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1072; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083; &#1084;&#1086;&#1105; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1086;&#1085;
&#1073;&#1099;&#1083; &#1075;&#1086;&#1090;&#1086;&#1074; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; &#1084;&#1086;&#1102; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;.</p><p>&#1041;&#1091;&#1076;&#1091;&#1090; &#1083;&#1080; &#1074;&#1089;&#1077; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1080;&#1083;&#1100;? &#1053;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;;
&#1101;&#1090;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1080; &#1086;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086;, &#1089;&#1082;&#1072;&#1078;&#1077;&#1084; &#1085;&#1077;&#1082;&#1072;&#1103;
&#1076;&#1077;&#1074;&#1091;&#1096;&#1082;&#1072;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083;&#1072; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1074; &#1082;&#1086;&#1076;&#1077; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;
&#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1073;&#1072;&#1075;&#1091;), &#1072; &#1074;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1080;&#1079; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1087;&#1099;&#1090;&#1072;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; - &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; 
&#1101;&#1084;&#1086;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;, &#1090;&#1086;, &#1093;&#1086;&#1090;&#1103; &#1074;&#1099; &#1087;&#1086; &#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090;, &#1074;&#1099;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1077;&#1105; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1072;&#1093;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072;, &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;
&#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080; &#1075;&#1083;&#1072;&#1079;&#1072;&#1084;&#1080; &#1080;&#1085;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1081;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1078;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077;. &#1053;&#1086; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077;
&#1085;&#1072;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077; &#1095;&#1090;&#1086;-&#1090;&#1086;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1096;&#1072; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1093;&#1086;&#1083;&#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1080;.
&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1072;&#1105;&#1090;&#1077; &#1084;&#1072;&#1089;&#1089;&#1091; &#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;, &#1090;&#1086; &#1087;&#1086;&#1076;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077;&#1089;&#1100; "&#1059;&#1076;&#1072;&#1095;&#1080;, &lt;&#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1077;&#1075;&#1086; &#1080;&#1084;&#1103;&gt;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;,
&#1095;&#1090;&#1086; &#1074;&#1099; &#1078;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1077;&#1084;&#1091; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1075;&#1086; &#1080; &#1085;&#1077; &#1089;&#1077;&#1088;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;. &#1059;&#1076;&#1072;&#1095;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1084;&#1072;&#1081;&#1083; &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;
&#1101;&#1084;&#1086;&#1090;&#1080;&#1082;&#1086;&#1085;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1102;&#1090; &#1091;&#1084;&#1080;&#1088;&#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1089;&#1086;&#1073;&#1077;&#1089;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;.</p><p>&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1091;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1072;&#1084; &#1089;&#1086;&#1073;&#1077;&#1089;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074; &#1080; &#1092;&#1086;&#1088;&#1084;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1081;, &#1085;&#1086;, &#1073;&#1077;&#1079; &#1086;&#1073;&#1080;&#1085;&#1103;&#1082;&#1086;&#1074;, &#1101;&#1084;&#1086;&#1094;&#1080;&#1080; &#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072;
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1054;&#1085;&#1080; &#1074;&#1072;&#1078;&#1085;&#1099; &#1080; &#1087;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;, &#1085;&#1086; &#1076;&#1072;&#1078;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1103;&#1089;&#1100;
&#1095;&#1080;&#1089;&#1090;&#1086; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1072;&#1088;&#1085;&#1099;&#1084;&#1080; &#1084;&#1086;&#1090;&#1080;&#1074;&#1072;&#1084;&#1080;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1089;&#1095;&#1072;&#1089;&#1090;&#1085;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1087;&#1080;&#1096;&#1091;&#1090; &#1089;&#1072;&#1084;&#1086;&#1077;
&#1087;&#1083;&#1086;&#1093;&#1086;&#1077; &#1055;&#1054;, &#1080; &#1087;&#1080;&#1096;&#1091;&#1090; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;. &#1059;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080;&#1089;&#1091;&#1097;&#1091;&#1102; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1091;
&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1080; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1099;&#1093; &#1101;&#1084;&#1086;&#1094;&#1080;&#1081; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1085;&#1077;
&#1095;&#1072;&#1089;&#1090;&#1086;. &#1042;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1089;&#1103; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1086;&#1075;&#1072;&#1076;&#1082;&#1080; &#1087;&#1086; &#1086;&#1087;&#1099;&#1090;&#1091;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1103;&#1089;&#1100; &#1085;&#1072; &#1090;&#1086;&#1084;, &#1072;) &#1082;&#1072;&#1082;
&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1074; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;, &#1080; &#1073;) &#1095;&#1090;&#1086; &#1074;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1086;
&#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1084; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1077; &#1080;&#1079; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090;
&#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1090;&#1089;&#1090;&#1088;&#1072;&#1085;&#1105;&#1085;&#1085;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1077;&#1089;&#1090;&#1100;, &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1103;
&#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082; &#1085;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1087;&#1088;&#1103;&#1084;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084;
&#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1090;&#1086; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1086; &#1077;&#1075;&#1086; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1072;&#1093;. &#1071; &#1085;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;
&#1101;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1087;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;. &#1055;&#1077;&#1088;&#1074;&#1072;&#1103;, &#1083;&#1102;&#1076;&#1080; &#1085;&#1077; &#1074;&#1077;&#1076;&#1091;&#1090; &#1089;&#1077;&#1073;&#1103;
&#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1078;&#1080;&#1079;&#1085;&#1080;,&#1090;&#1072;&#1082; &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1074; &#1089;&#1077;&#1090;&#1080;?
&#1042;&#1090;&#1086;&#1088;&#1072;&#1103;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;&#1093;, &#1083;&#1102;&#1076;&#1080;
&#1089;&#1090;&#1072;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1101;&#1084;&#1086;&#1094;&#1080;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1095;&#1077;&#1084; &#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1081; &#1078;&#1080;&#1079;&#1085;&#1080;. &#1059;&#1090;&#1086;&#1095;&#1085;&#1102;, &#1086;&#1085;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086;
&#1089;&#1090;&#1072;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1099;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1101;&#1084;&#1086;&#1094;&#1080;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1077;
&#1082;&#1072;&#1082; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1083;&#1080; &#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1085;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1101;&#1084;&#1086;&#1094;&#1080;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082;
&#1085;&#1077;&#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1083;&#1080; &#1075;&#1086;&#1088;&#1076;&#1086;&#1089;&#1090;&#1100;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072;
&#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1089;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1099; &#1086;&#1073; &#1080;&#1093; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080;. &#1059;&#1076;&#1077;&#1083;&#1103;&#1103; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;
&#1084;&#1077;&#1083;&#1086;&#1095;&#1072;&#1084;, &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1075;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1080;
&#1084;&#1086;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1102;&#1076;&#1077;&#1081; &#1082; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1105;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;.</p><p>&#1071;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1088;&#1086;&#1083;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1086;&#1075;&#1086; &#1090;&#1077;&#1088;&#1072;&#1087;&#1077;&#1074;&#1090;&#1072;,
&#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;. &#1053;&#1086;, &#1091;&#1076;&#1077;&#1083;&#1103;&#1103; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;
&#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;&#1084; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1074;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1090;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1080;&#1093; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;,
&#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1089; &#1085;&#1080;&#1084;&#1080; &#1083;&#1080;&#1094;&#1086;&#1084; &#1082; &#1083;&#1080;&#1094;&#1091;. &#1040; &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;
&#1090;&#1086;&#1085;&#1091; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1085;&#1077;&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072;
&#1089;&#1072;&#1084;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1074;&#1099;&#1075;&#1086;&#1076;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.</p></div><div class="sect2" title="&#1050;&#1072;&#1082; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;?"><div class="titlepage"><div><div><h3 class="title"><a name="rudeness"></a>&#1050;&#1072;&#1082; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;?</h3></div></div></div><p>&#1054;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054; 
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1077;&#1105; &#1086;&#1089;&#1086;&#1073;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;, &#1072; &#1095;&#1090;&#1086; &#1085;&#1077;&#1090;.
&#1061;&#1086;&#1090;&#1103; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080;&#1078;&#1077;, &#1085;&#1077; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1055;&#1054;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1076;&#1083;&#1103; &#1055;&#1054; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; - &#1086;&#1085;&#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091;, &#1082;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1074; 
&#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1077;, &#1090;&#1086;&#1095;&#1085;&#1099;&#1093; &#1085;&#1072;&#1091;&#1082;&#1072;&#1093; &#1080;&#1083;&#1080; &#1074; &#1080;&#1085;&#1078;&#1077;&#1085;&#1077;&#1088;&#1085;&#1099;&#1093; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1103;&#1093;.
&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1089; &#1077;&#1105; &#1087;&#1086;&#1088;&#1080;&#1089;&#1090;&#1099;&#1084;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;&#1080; &#1080; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1090;&#1086;&#1082;&#1086;&#1084; &#1085;&#1086;&#1074;&#1099;&#1093;
&#1083;&#1102;&#1076;&#1077;&#1081;, &#8212;&#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072; &#1089;&#1088;&#1077;&#1076;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1101;&#1090;&#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081;
&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1086;&#1087;&#1072;&#1076;&#1091;&#1090;&#1089;&#1103; &#1090;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1089; &#1085;&#1080;&#1084;&#1080;.</p><p>&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1095;&#1085;&#1105;&#1084; &#1089; &#1074;&#1077;&#1097;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;&#1102;:</p><p>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1072;, &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1103;&#1084;&#1072;&#1103; &#1080; &#1085;&#1077;&#1087;&#1088;&#1080;&#1082;&#1088;&#1099;&#1090;&#1072;&#1103;, &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;&#1102;.
&#1053;&#1072;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;, &#1086;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1086;&#1081; &#1083;&#1077;&#1089;&#1090;&#1080;: &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1072; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;, &#1074; &#1087;&#1086;&#1076;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1091;&#1077;&#1084;&#1099;&#1081;
&#1079;&#1072;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;, &#1087;&#1086;&#1090;&#1088;&#1072;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1095;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1080; &#1089;&#1080;&#1083; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;,
&#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1093;&#1074;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1080; (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1072; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090; &#1085;&#1072; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;
&#1080;&#1083;&#1080; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1089;&#1090;&#1072;&#1077;&#1090; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1091;&#1102; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;).</p><p>&#1055;&#1088;&#1103;&#1084;&#1099;&#1077;, &#1073;&#1077;&#1079; &#1087;&#1088;&#1080;&#1082;&#1088;&#1072;&#1089; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1064;&#1077;&#1081;&#1085;&#1072; &#1082;&#1086; &#1084;&#1085;&#1077; &#1074; &#1087;&#1088;&#1086;&#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;
&#1074;&#1099;&#1096;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1042;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077;
&#1084;&#1086;&#1075;&#1091;&#1090; &#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1093;&#1086;&#1083;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080;, &#1088;&#1080;&#1090;&#1086;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1085;&#1072;&#1089;&#1084;&#1077;&#1096;&#1082;&#1086;&#1081;, &#1095;&#1072;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103;
&#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086; &#1080; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086;
&#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;. &#1050;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; - &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; "&#1042;&#1072;&#1096;
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1074; &#1088;&#1086;&#1079;&#1077;&#1090;&#1082;&#1091;?" &#1057;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1079;&#1085;&#1072;&#1090;&#1100;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088; &#1074; &#1088;&#1086;&#1079;&#1077;&#1090;&#1082;&#1091;, &#1080;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1085;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;,
&#1091;&#1089;&#1090;&#1072;&#1105;&#1090; &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1074;&#1077;&#1078;&#1083;&#1080;&#1074;&#1099;&#1084;&#1080; &#1091;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084;&#1080; ("&#1071; &#1086;&#1095;&#1077;&#1085;&#1100; &#1080;&#1079;&#1074;&#1080;&#1085;&#1103;&#1102;&#1089;&#1100;, &#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1093;&#1086;&#1095;&#1091; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1074;&#1072;&#1084; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1085;&#1077;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1085;&#1086;
&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1080;&#1093; &#1087;&#1088;&#1086;&#1081;&#1076;&#1105;&#1084;..."). &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086;&#1085; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1089;&#1103; &#1086;&#1073; &#1101;&#1090;&#1080;&#1093; "&#1087;&#1086;&#1076;&#1089;&#1090;&#1080;&#1083;&#1082;&#1072;&#1093;" &#1080;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1103;&#1084;&#1086;: &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;? &#1042; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1093; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;. &#1062;&#1077;&#1083;&#1100;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; 
&#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1083;&#1077;&#1085;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1090;&#1072;, &#1072; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1077; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1093; (&#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;,
&#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1073;&#1097;&#1080;&#1093;) &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1040;&#1076;&#1088;&#1077;&#1089;&#1072;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1101;&#1090;&#1086; &#1080; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1091;&#1102;&#1090;
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1085;&#1072;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090; &#1086;&#1095;&#1082;&#1080;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1103; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1081; &#1086;&#1090;&#1082;&#1083;&#1080;&#1082; &#1073;&#1077;&#1079; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;. &#1053;&#1086; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1090;&#1088;&#1072;&#1076;&#1072;&#1090;&#1100;. &#1069;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1082;&#1086;&#1083;&#1083;&#1080;&#1079;&#1080;&#1103; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;, &#1072; &#1085;&#1077; &#1095;&#1077;&#1081;-&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1091;&#1087;&#1086;&#1082;. &#1044;&#1088;&#1091;&#1078;&#1077;&#1083;&#1102;&#1073;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1072;&#1096; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;
(&#1080;&#1083;&#1080; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1072;) &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1089;&#1084;&#1099;&#1089;&#1083;&#1086;&#1074;; &#1086;&#1085; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;
(&#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080;) &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;, &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;.</p><p>&#1058;&#1086;&#1075;&#1076;&#1072; &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;?</p><p>&#1057;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1091;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1072; &#1077;&#1089;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;
&#1083;&#1077;&#1089;&#1090;&#1080;, &#1086;&#1090;&#1082;&#1072;&#1079; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1091; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1080;&#1076;&#1086;&#1084; &#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1071;
&#1085;&#1077; &#1080;&#1084;&#1077;&#1102; &#1074; &#1074;&#1080;&#1076;&#1091; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1095;&#1100;&#1077;&#1081;-&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;, &#1073;&#1091;&#1076;&#1100; &#1101;&#1090;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1074; &#1082;&#1086;&#1076;&#1077;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1080;&#1083;&#1080; &#1077;&#1097;&#1105; &#1095;&#1090;&#1086;-&#1090;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099; &#1079;&#1072;&#1088;&#1072;&#1085;&#1077;&#1077; &#1085;&#1077;
&#1086;&#1073;&#1077;&#1097;&#1072;&#1083;&#1080; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; - &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1051;&#1102;&#1076;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091; &#1074;&#1072;&#1089; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1093;&#1086;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;. &#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;
 <span class="emphasis"><em>&#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;</em></span>, &#1085;&#1077; &#1089;&#1082;&#1091;&#1087;&#1080;&#1090;&#1077;&#1089;&#1100;: &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1090;&#1072;&#1084;, &#1075;&#1076;&#1077; &#1101;&#1090;&#1086; &#1091;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1087;&#1086;&#1082;&#1086;&#1087;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1074;
&#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1081;&#1090;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1084; &#1080; &#1090;.&#1076;. &#1051;&#1080;&#1073;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1085;&#1077;&#1090;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1085;&#1072; &#1090;&#1072;&#1082;&#1080;&#1077; &#1091;&#1089;&#1080;&#1083;&#1080;&#1103;, &#1085;&#1086; &#1074;&#1089;&#1105; &#1078;&#1077; &#1085;&#1072;&#1076;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1090;&#1086;
&#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1077; &#1074; &#1086;&#1090;&#1074;&#1077;&#1090;, &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1100;&#1090;&#1077; &#1101;&#1090;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086; &#1074; &#1089;&#1074;&#1086;&#1105;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; ("&#1071; &#1076;&#1091;&#1084;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103;
&#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103; &#1091;&#1078;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;, &#1085;&#1086;, &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1105; &#1085;&#1072;&#1081;&#1090;&#1080;. &#1048;&#1079;&#1074;&#1080;&#1085;&#1080;&#1090;&#1077;."). &#1043;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; - &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1090;&#1100; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1085;&#1086;&#1081; &#1085;&#1086;&#1088;&#1084;&#1099;, &#1083;&#1080;&#1073;&#1086;
&#1089;&#1083;&#1077;&#1076;&#1091;&#1103; &#1077;&#1081;, &#1083;&#1080;&#1073;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086; &#1080;&#1079;&#1074;&#1077;&#1097;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1082;&#1088;&#1072;&#1090;&#1086;&#1082; &#1074; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;,
&#1085;&#1086;&#1088;&#1084;&#1072; &#1087;&#1086;&#1076;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1053;&#1086;, &#1086;&#1090;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1103;&#1089;&#1100; &#1086;&#1090; &#1085;&#1086;&#1088;&#1084;&#1099;, &#1074; &#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1103;,
<span class="emphasis"><em>&#1087;&#1086;&#1095;&#1077;&#1084;&#1091;</em></span> &#1074;&#1099; &#1086;&#1090;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1086;&#1090; &#1085;&#1077;&#1105;, &#1101;&#1090;&#1086; &#1082;&#1072;&#1082; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;
 &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; (&#1080; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;) &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1086;&#1081;&#1085;&#1099; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;.
&#1051;&#1091;&#1095;&#1096;&#1077; &#1087;&#1088;&#1086;&#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1094;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1084;, &#1095;&#1077;&#1084; &#1083;&#1077;&#1085;&#1080;&#1074;&#1099;&#1084;.
</p><p>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &#1085;&#1077;
&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1080; &#1079;&#1076;&#1088;&#1072;&#1074;&#1086;&#1075;&#1086; &#1089;&#1084;&#1099;&#1089;&#1083;&#1072;
&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077;
<a class="xref" href="setting-tone.html#prevent-rudeness" title="&#1055;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1082;&#1086;&#1088;&#1085;&#1102;">«&#1055;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1082;&#1086;&#1088;&#1085;&#1102;»</a><span> &#1074;
<a class="xref" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;">&#1043;&#1083;&#1072;&#1074;&#1072; 2, <i>&#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</i></a></span>, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1077;&#1097;&#1105; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080;.</p></div><div class="sect2" title="&#1051;&#1080;&#1094;&#1086;"><div class="titlepage"><div><div><h3 class="title"><a name="face"></a>&#1051;&#1080;&#1094;&#1086;</h3></div></div></div><p>&#1042; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1084;&#1086;&#1079;&#1075;&#1077; &#1077;&#1089;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1102;&#1097;&#1072;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1085;&#1080;&#1077;
&#1083;&#1080;&#1094;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1077;&#1077; &#1090;&#1072;&#1082; &#1080; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; - "&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1085;&#1080;&#1103; &#1083;&#1080;&#1094;", &#1080; &#1077;&#1105;
&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1074;&#1088;&#1086;&#1078;&#1076;&#1105;&#1085;&#1085;&#1072;&#1103;, &#1072; &#1085;&#1077; &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1105;&#1085;&#1085;&#1072;&#1103;.
&#1055;&#1086;&#1093;&#1086;&#1078;&#1077;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1085;&#1080;&#1077; &#1083;&#1102;&#1076;&#1077;&#1081; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1088;&#1080;&#1090;&#1080;&#1095;&#1085;&#1086;
&#1076;&#1083;&#1103; &#1074;&#1099;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1091; &#1085;&#1072;&#1089; &#1074; &#1093;&#1086;&#1076;&#1077; &#1101;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1080; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1086;&#1089;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; "&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;" &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086;.</p><p>&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1089; &#1087;&#1089;&#1080;&#1093;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;-&#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; 
&#1085;&#1077;&#1086;&#1073;&#1099;&#1095;&#1085;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1086; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090; &#1090;&#1077;&#1089;&#1085;&#1091;&#1102; &#1082;&#1086;&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1084;&#1077;&#1078;&#1076;&#1091; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1087;&#1086;&#1095;&#1090;&#1080; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1090; &#1076;&#1088;&#1091;&#1075; &#1076;&#1088;&#1091;&#1075;&#1072; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1080;&#1085;&#1090;&#1091;&#1080;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080;: &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1087;&#1086; &#1083;&#1080;&#1094;&#1072;&#1084;, &#1087;&#1086; &#1075;&#1086;&#1083;&#1086;&#1089;&#1091;, &#1087;&#1086;&#1079;&#1077; &#1080; &#1090;.&#1076;.&#1044;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1077;&#1085;&#1089;&#1072;&#1094;&#1080;&#1080;
&#1101;&#1090;&#1086;&#1075;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072; &#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; <em class="firstterm">&#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084;
</em> &#1087;&#1086;&#1074;&#1089;&#1102;&#1076;&#1091;. &#1054;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; email-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; (&#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084; @), &#1074;&#1072;&#1096;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1074; IRC, &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080; &#1073;&#1072;&#1075;-&#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; &#1080; &#1090;.&#1076;. &#1069;&#1090;&#1086; &#1080;&#1084;&#1103; - &#1074;&#1072;&#1096;&#1077; "&#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1077; &#1083;&#1080;&#1094;&#1086;": &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1072;&#1103;
&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1083;&#1080;&#1094;&#1072;, &#1093;&#1086;&#1090;&#1103;, &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1080; &#1085;&#1077; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090; &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; "&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;"
&#1074; &#1084;&#1086;&#1079;&#1075;&#1091;.</p><p>&#1055;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080;&#1085;&#1090;&#1091;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1086;&#1081; &#1086;&#1090; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;
(&#1084;&#1086;&#1081;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, "kfogel"). &#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1093; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1072;&#1096;&#1080;&#1084; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1093; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;:</p><pre class="screen">
From: "Karl Fogel" &lt;kfogel@whateverdomain.com&gt;
</pre><p>&#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;, &#1101;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1076;&#1074;&#1077; &#1074;&#1077;&#1097;&#1080;. &#1050;&#1072;&#1082; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;,
&#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084; &#1080;&#1085;&#1090;&#1091;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1080;&#1084;&#1077;&#1085;&#1080;, &#1085;&#1086; &#1080; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1080;&#1084;&#1103;
&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; <span class="emphasis"><em>&#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;</em></span>. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1086;&#1085;&#1086; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1074;&#1099;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1090;&#1080;&#1087;&#1072;:</p><pre class="screen">
From: "&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1093;&#1072;&#1082;&#1077;&#1088;" &lt;wonderhacker@whateverdomain.com&gt;
</pre><p>&#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072; &#1079;&#1085;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1072;&#1103; &#1082;&#1072;&#1088;&#1080;&#1082;&#1072;&#1090;&#1091;&#1088;&#1072; &#1055;&#1086;&#1083;&#1103; &#1064;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;, &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1072;&#1103;&#1089;&#1103; 5 &#1080;&#1102;&#1083;&#1103;
1993 &#1074;<em class="citetitle">The New Yorker</em>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1089;&#1086;&#1073;&#1072;&#1082;&#1091;, &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074;&#1096;&#1091;&#1102;&#1089;&#1103; &#1085;&#1072;
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1084; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;&#1077;, &#1079;&#1072;&#1075;&#1086;&#1074;&#1086;&#1088;&#1097;&#1080;&#1094;&#1082;&#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1103;&#1097;&#1091;&#1102; &#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1097;&#1091;&#1102; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1086;&#1073;&#1072;&#1082;&#1077;: "&#1042;
&#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1090;&#1099; &#1089;&#1086;&#1073;&#1072;&#1082;&#1072;." &#1058;&#1072;&#1082;&#1086;&#1075;&#1086; &#1088;&#1086;&#1076;&#1072; &#1088;&#1072;&#1089;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;
&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1075;&#1086;
&#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1074;&#1086;&#1079;&#1074;&#1099;&#1096;&#1072;&#1102;&#1097;&#1080;&#1093;, &#1079;&#1072;&#1076;&#1091;&#1084;&#1072;&#1085;&#1085;&#1099;&#1093;-&#1073;&#1099;&#1090;&#1100;-&#1082;&#1088;&#1091;&#1090;&#1099;&#1084;&#1080; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1093; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1089;&#1077;&#1073;&#1077; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1102;&#1090; - &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1085;&#1072;&#1079;&#1086;&#1074;&#1072;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103; 
"&#1048;&#1079;&#1091;&#1084;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1061;&#1072;&#1082;&#1077;&#1088;&#1086;&#1084;, &#1090;&#1086; &#1083;&#1102;&#1076;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; <span class="emphasis"><em>&#1090;&#1072;&#1082;</em></span> 
&#1086;&#1085;&#1086; &#1080; &#1077;&#1089;&#1090;&#1100;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1092;&#1072;&#1082;&#1090; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1092;&#1072;&#1082;&#1090;&#1086;&#1084;: &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1082;&#1090;&#1086;
&#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; - &#1089;&#1086;&#1073;&#1072;&#1082;&#1072;, &#1074;&#1099; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1077;&#1081; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1077;&#1089;&#1100;. &#1060;&#1072;&#1085;&#1090;&#1072;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1081; 
&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1053;&#1072;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;, &#1086;&#1085;
&#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1093; &#1076;&#1091;&#1084;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1086;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1084;&#1086;&#1077;, &#1095;&#1077;&#1084; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;, &#1080;&#1083;&#1080; 
&#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077;&#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1099;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1089;&#1074;&#1086;&#1105; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; 
&#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; &#1080;&#1083;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1090;&#1100; 
&#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1074;&#1099;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1080;&#1084;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1079;&#1074;&#1091;&#1095;&#1080;&#1090; &#1082;&#1072;&#1082; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103;, 
&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;.</p><p>&#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084;&#1072; &#1077;&#1089;&#1090;&#1100; &#1077;&#1097;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; 
&#1087;&#1088;&#1080;&#1105;&#1084;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; 
&#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1080;&#1090;&#1091;&#1083; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, "&#1076;&#1086;&#1082;&#1090;&#1086;&#1088;", 
"&#1087;&#1088;&#1086;&#1092;&#1077;&#1089;&#1089;&#1086;&#1088;", "&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;"), &#1085;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086;, &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1081;&#1090;&#1077;, &#1079;&#1072; 
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1091;.
&#1061;&#1072;&#1082;&#1077;&#1088;&#1089;&#1082;&#1072;&#1103; &#1089;&#1088;&#1077;&#1076;&#1072; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084; &#1080; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1082;&#1083;&#1086;&#1085;&#1085;&#1072; 
&#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1102; &#1090;&#1080;&#1090;&#1091;&#1083;&#1072; &#1082;&#1072;&#1082; &#1085;&#1077;&#1095;&#1090;&#1086; &#1074;&#1099;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077; &#1079;&#1072; &#1088;&#1072;&#1084;&#1082;&#1080; &#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; 
&#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1085;&#1077;&#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1055;&#1088;&#1080;&#1077;&#1084;&#1083;&#1077;&#1084;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1090;&#1080;&#1090;&#1091;&#1083; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082;
&#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1074;&#1072;&#1084;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1075;&#1086; &#1082;&#1072;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1086;&#1090;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1074; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; - &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086; &#1076;&#1072;&#1089;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;. &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1088;&#1091;&#1078;&#1072;&#1102;&#1097;&#1080;&#1077; &#1091;&#1074;&#1072;&#1078;&#1072;&#1083;&#1080; &#1074;&#1072;&#1096;&#1091; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1072; &#1085;&#1077; &#1090;&#1080;&#1090;&#1091;&#1083;.</p><p>&#1063;&#1090;&#1086; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080;: &#1087;&#1091;&#1089;&#1090;&#1100; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1084;&#1080; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; 
&#1089;&#1086; &#1074;&#1082;&#1091;&#1089;&#1086;&#1084;, &#1083;&#1080;&#1073;&#1086; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074;&#1086;&#1074;&#1089;&#1077;. &#1048;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1087;&#1088;&#1072;&#1074;&#1086;&#1074;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1081;, 
&#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090; &#1084;&#1085;&#1077;&#1085;&#1080;&#1103;, 
&#1085;&#1077;&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1089; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077;&#1084; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1082;&#1080; &#1078;&#1072;&#1085;&#1088;&#1072;, 
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;
&#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085;:</p><pre class="screen">
&#1042;&#1040;&#1046;&#1053;&#1054;&#1045; &#1047;&#1040;&#1052;&#1045;&#1063;&#1040;&#1053;&#1048;&#1045;

&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; e-mail &#1087;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1080;&#1083;&#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1096;&#1077; &#1079;&#1072;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;
&#1086;&#1090;&#1082;&#1072;&#1079;&#1077; &#1086;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1077;&#1088;&#1077;&#1075;&#1072;&#1102;&#1097;&#1077;&#1081; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1077;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082;
&#1085;&#1080;&#1078;&#1077;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; &#1079;&#1072;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1080;&#1083;&#1080; &#1089;&#1074;&#1103;&#1078;&#1080;&#1090;&#1077;&#1089;&#1100; &#1089; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084;.

&#1044;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1083;&#1072;&#1085;&#1086; &#1080;&#1079; Deloitte &amp; Touche LLP. Deloitte &amp; Touche LLP
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1074;&#1072;&#1088;&#1080;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1089; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074;
&#1040;&#1085;&#1075;&#1083;&#1080;&#1080; &#1080; &#1059;&#1101;&#1083;&#1100;&#1089;&#1077; &#1087;&#1086;&#1076; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; OC303675. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1095;&#1083;&#1077;&#1085;&#1086;&#1074; &#1076;&#1083;&#1103;
&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1074; Stonecutter Court, 1 Stonecutter Street, London
EC4A 4TR, United Kingdom, &#1087;&#1086; &#1084;&#1077;&#1089;&#1090;&#1091; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1076;&#1077;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1092;&#1080;&#1088;&#1084;&#1099;.
Deloitte &amp; Touche LLP &#1089;&#1072;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1080; &#1088;&#1077;&#1075;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; Financial Services
Authority.

&#1044;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1080; &#1083;&#1102;&#1073;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1074;&#1080;&#1083;&#1077;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081;. &#1054;&#1085;&#1086; - &#1076;&#1083;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;(&#1103;&#1084;&#1080;), &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077;&#1089;&#1100;
&#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;(&#1103;&#1084;&#1080;), &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1083;&#1102;&#1073;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;
&#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080;
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1085;&#1105;&#1084; &#1080;&#1083;&#1080; &#1074; &#1083;&#1102;&#1073;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1077;&#1085;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1085;&#1077;&#1079;&#1072;&#1082;&#1086;&#1085;&#1085;&#1086;&#1081;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1074;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;
&#1089; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084; "&#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1086; &#1087;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;" &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; IT.SECURITY.UK@deloitte.co.uk, &#1072;
&#1079;&#1072;&#1090;&#1077;&#1084; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1080;&#1079; &#1087;&#1086;&#1095;&#1090;&#1099; &#1080; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1100;&#1090;&#1077; &#1083;&#1102;&#1073;&#1099;&#1077; &#1077;&#1075;&#1086; &#1082;&#1086;&#1087;&#1080;&#1080;.

&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1099; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1099;&#1084;&#1080; &#1080;&#1083;&#1080;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1086;&#1090; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1095;&#1077;&#1085;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1088;&#1095;&#1077;&#1085;&#1072;,
&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072;, &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1085;&#1072;, &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1077;&#1085;&#1072;, &#1087;&#1088;&#1080;&#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1079;&#1076;&#1085;&#1086; &#1080;&#1083;&#1080; &#1085;&#1077; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1080;&#1083;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;
&#1074;&#1080;&#1088;&#1091;&#1089;&#1099;. &#1052;&#1099; &#1085;&#1077; &#1085;&#1077;&#1089;&#1105;&#1084; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072; &#1083;&#1102;&#1073;&#1099;&#1077; &#1090;&#1072;&#1082;&#1080;&#1077; &#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1080;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1103;.
&#1050;&#1072;&#1078;&#1076;&#1099;&#1081;, &#1082;&#1090;&#1086; &#1086;&#1073;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1085;&#1072;&#1084;&#1080; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1099;, &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1088;&#1080;&#1089;&#1082;&#1080;,
&#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084;.

&#1051;&#1102;&#1073;&#1099;&#1077; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1089;&#1086;&#1074;&#1077;&#1090;&#1099;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077;&#1089;&#1103; &#1074; &#1101;&#1090;&#1086;&#1084; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1083;&#1102;&#1073;&#1099;&#1093;
&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;&#1096;&#1080;&#1084; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;&#1084;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1086;&#1084; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081; &#1080;
&#1086;&#1073;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;, &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1087;&#1080;&#1089;&#1100;&#1084;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072; Deloitte &amp; Touche
LLP &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1086;&#1084;.

&#1052;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1083;&#1102;&#1073;&#1099;&#1093;
&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1077;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1092;&#1080;&#1088;&#1084;&#1099;, &#1085;&#1077;
&#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1099; &#1092;&#1080;&#1088;&#1084;&#1086;&#1081;.

</pre><p>&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1090;&#1086; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1090;&#1077;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;,
&#1090;&#1072;&#1082;&#1086;&#1077; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1077;&#1088;&#1077;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1075;&#1083;&#1091;&#1087;&#1086;, &#1085;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1085;&#1077;
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1076;&#1072;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1093;&#1086;&#1095;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;, &#1090;&#1072;&#1082;&#1086;&#1081; &#1102;&#1088;&#1080;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1096;&#1090;&#1072;&#1084;&#1087; &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1077;&#1090; &#1082;&#1086;&#1074;&#1072;&#1088;&#1085;&#1099;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;. &#1054;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;
&#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1076;&#1074;&#1072; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1076;&#1077;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;: &#1074;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1095;&#1090;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;
&#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1085;&#1072;&#1076; &#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; - &#1086;&#1085; &#1079;&#1072;&#1075;&#1085;&#1072;&#1085; &#1074; &#1085;&#1077;&#1082;&#1091;&#1102;
&#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1080;&#1089;&#1090;&#1105;&#1075;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072;&#1076;&#1086;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086;&#1077;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1082;&#1086;&#1085;&#1077;&#1094; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072;, &#1080; &#1086;&#1085; &#1085;&#1077; &#1085;&#1072;&#1096;&#1105;&#1083; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080; &#1077;&#1105;; &#1080; &#1074;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;,
&#1095;&#1090;&#1086; &#1091; &#1085;&#1077;&#1075;&#1086; &#1084;&#1072;&#1083;&#1086; &#1080;&#1083;&#1080; &#1074;&#1086;&#1074;&#1089;&#1077; &#1085;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1103; &#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1055;&#1054; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1077;&#1075;&#1086;
&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. &#1044;&#1072;, &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086; &#1085;&#1077; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1077;&#1090; &#1077;&#1084;&#1091; &#1074; &#1103;&#1074;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1085;&#1086; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;
&#1085;&#1077;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1088;&#1080;&#1089;&#1082; &#1091;&#1090;&#1077;&#1095;&#1082;&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1090;&#1100;
&#1074;&#1089;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1099;.</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;&#1077; &#1074; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093;
&#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1080; &#1082;&#1086; &#1074;&#1089;&#1077;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072;&#1076; 
&#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1081; &#1091;&#1095;&#1105;&#1090;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072; <a class="ulink" href="http://gmail.google.com/" target="_top">gmail.google.com</a>, <a class="ulink" href="http://www.hotmail.com/" target="_top">www.hotmail.com</a>, &#1080;&#1083;&#1080; <a class="ulink" href="http://www.yahoo.com/" target="_top">www.yahoo.com</a>, &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1105; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;
&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;.</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp7438352" href="#idp7438352" class="para">22</a>] </sup>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1093; &#1072;&#1082;&#1072;&#1076;&#1077;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1091;;
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;<em class="citetitle">Group Awareness in Distributed Software
Development</em> &#1072;&#1074;&#1090;&#1086;&#1088;&#1099; Gutwin, Penner, and Schneider. &#1069;&#1090;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1073;&#1099;&#1083;&#1072;
&#1082;&#1072;&#1082;&#1086;&#1077;-&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1074; &#1089;&#1077;&#1090;&#1080;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1077;&#1090;, &#1087;&#1086;&#1090;&#1086;&#1084; &#1086;&#1087;&#1103;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; <a class="ulink" href="http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf" target="_top">http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf</a>.
&#1058;&#1072;&#1082; &#1095;&#1090;&#1086;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1091; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091;, &#1085;&#1086; &#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1077; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1099;,
&#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1072; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100;.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="marketing.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="common-pitfalls.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">Marketing </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1050;&#1072;&#1082; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;?</td></tr></table></div></body></html>
