<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1050;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1085;&#1072;&#1103; &#1076;&#1077;&#1084;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1103;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="social-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1057;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;"><link rel="prev" href="social-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1057;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;"><link rel="next" href="written-rules.html" title="Writing It All Down"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1050;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1085;&#1072;&#1103; &#1076;&#1077;&#1084;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1103;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="social-infrastructure.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1057;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;</th><td width="20%" align="right"> <a accesskey="n" href="written-rules.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1050;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1085;&#1072;&#1103; &#1076;&#1077;&#1084;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1103;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="consensus-democracy"></a>&#1050;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1085;&#1072;&#1103; &#1076;&#1077;&#1084;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1103;</h2></div></div></div><p>&#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1074;&#1079;&#1088;&#1086;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1086;&#1090;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086;&#1076;&#1091;&#1096;&#1085;&#1086;&#1075;&#1086;
&#1076;&#1080;&#1082;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; &#1074; &#1091;&#1075;&#1086;&#1076;&#1091; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1076;&#1077;&#1084;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;
&#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1088;&#1072;&#1079;&#1086;&#1095;&#1072;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1076;&#1080;&#1082;&#1090;&#1072;&#1090;&#1086;&#1088;&#1077;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;
&#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1086;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; "&#1101;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;", &#1077;&#1089;&#1083;&#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;
&#1103;&#1079;&#1099;&#1082;&#1086;&#1084; &#1073;&#1080;&#1086;&#1083;&#1086;&#1075;&#1086;&#1074;. &#1042; &#1090;&#1086;&#1090; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1080;&#1082;&#1090;&#1072;&#1090;&#1086;&#1088; &#1091;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086; &#1089;&#1094;&#1077;&#1085;&#1099; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1091;&#1077;&#1090;
&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1097;&#1080;&#1081; &#1086;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;,
&#1085;&#1072;&#1089;&#1090;&#1091;&#1087;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1082; &#1085;&#1086;&#1074;&#1086;&#1081; &#1085;&#1077;&#1076;&#1080;&#1082;&#1090;&#1072;&#1090;&#1086;&#1088;&#1089;&#1082;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1080;
&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1085;&#1089;&#1090;&#1080;&#1090;&#1091;&#1094;&#1080;&#1102;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1091;&#1078;&#1077; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;. &#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1085;&#1077; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1086;&#1081; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1080;&#1083;&#1080; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081;, &#1085;&#1086;
&#1088;&#1072;&#1085;&#1086; &#1080;&#1083;&#1080; &#1087;&#1086;&#1079;&#1076;&#1085;&#1086; &#1086;&#1085;&#1086; &#1077;&#1081; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1080; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1074;&#1096;&#1080;&#1089;&#1100; &#1074;&#1088;&#1103;&#1076; &#1083;&#1080; &#1091;&#1078;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1089;&#1103;
&#1085;&#1072;&#1079;&#1072;&#1076;. &#1047;&#1076;&#1088;&#1072;&#1074;&#1099;&#1081; &#1089;&#1084;&#1099;&#1089;&#1083; &#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;. &#1045;&#1089;&#1083;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1083;&#1102;&#1076;&#1077;&#1081;
&#1095;&#1080;&#1089;&#1083;&#1086;&#1084; N &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1085;&#1072;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1086;&#1089;&#1086;&#1073;&#1086;&#1081; &#1074;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086;
N &#1083;&#1102;&#1076;&#1077;&#1081; &#1088;&#1077;&#1096;&#1080;&#1083;&#1086; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077;&#1084; &#1074; &#1091;&#1075;&#1086;&#1076;&#1091; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091;. &#1051;&#1102;&#1076;&#1103;&#1084; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;
&#1085;&#1077; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100;. &#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1090;&#1072;&#1082; &#1089;&#1076;&#1077;&#1083;&#1072;&#1102;&#1090;, &#1090;&#1086; &#1076;&#1080;&#1082;&#1090;&#1072;&#1090;&#1091;&#1088;&#1072; &#1074;&#1089;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086;
&#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1081;. &#1043;&#1088;&#1091;&#1087;&#1087;&#1072; &#1085;&#1072;&#1076;&#1077;&#1083;&#1080;&#1083;&#1072; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1074;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1080; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1077;&#1075;&#1086; &#1085;&#1080;&#1079;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1087;&#1077;&#1088;&#1077;&#1096;&#1077;&#1083; &#1086;&#1090; &#1087;&#1088;&#1077;&#1076;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1093;&#1072;&#1088;&#1080;&#1079;&#1084;&#1072;&#1090;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1083;&#1080;&#1076;&#1077;&#1088;&#1072; &#1082; &#1073;&#1086;&#1083;&#1077;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1086;&#1085;
&#1088;&#1077;&#1076;&#1082;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082; &#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;.</p><p>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1077;&#1083;&#1086;&#1095;&#1072;&#1093;, &#1085;&#1086; &#1077;&#1089;&#1090;&#1100; &#1076;&#1074;&#1072; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1072;
&#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1085;&#1080; &#1089;&#1093;&#1086;&#1078;&#1080;: &#1074;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;
&#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1072;, &#1074;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1080;&#1084;.</p><p><em class="firstterm">&#1050;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;</em>&#8212; &#1074;&#1089;&#1077;&#1075;&#1086; &#1083;&#1080;&#1096;&#1100; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;. &#1069;&#1090;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;: &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1083;&#1072;
&#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1072; &#1087;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1072;&#1083; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;
&#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1091;&#1090;, &#1080; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1072;&#1083;&#1089;&#1103; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;. &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;,
&#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1079;&#1072;&#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1086; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1077; &#1095;&#1077;&#1090;&#1082;&#1086; &#1074;&#1099;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1074; &#1095;&#1077;&#1084; &#1086;&#1085; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1080;
&#1082;&#1072;&#1082;&#1080;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1099; (&#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1085;&#1077; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;) &#1087;&#1086;&#1089;&#1083;&#1077; &#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1103;.
</p><p>&#1041;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1086;&#1074; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1080;&#1076;&#1077;&#1090; &#1086; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;&#1093;, &#1090;&#1072;&#1082;&#1080;&#1093;
&#1082;&#1072;&#1082; &#1087;&#1091;&#1090;&#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072;,
&#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074;, &#1080; &#1090;.&#1087;. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1072;
&#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1073;&#1077;&#1089;&#1096;&#1086;&#1074;&#1085;&#1086; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;
&#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1102;. &#1050; &#1082;&#1086;&#1085;&#1094;&#1091; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;
&#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100;. &#1050;&#1090;&#1086;-&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1080;&#1096;&#1077;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;,
&#1087;&#1086;&#1076;&#1074;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077; &#1080;&#1090;&#1086;&#1075; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1102; &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077;
&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1089;&#1091;&#1090;&#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1077;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1091; &#1085;&#1077;&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086;
&#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1077;&#1089;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1079;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1080; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;: "&#1055;&#1086;&#1076;&#1086;&#1078;&#1076;&#1080;&#1090;&#1077;, &#1103;
&#1085;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1077;&#1085;. &#1052;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1077;&#1097;&#1077; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1101;&#1090;&#1080;&#1084;".</p><p>&#1044;&#1083;&#1103; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093;, &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1089;&#1087;&#1086;&#1088;&#1086;&#1074; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1077;
&#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1072;&#1090;&#1095; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;,
&#1089;&#1072;&#1084;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1077;: "&#1071; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1084;&#1099;
&#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1077;&#1084;&#1089;&#1103; &#1089; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077;
&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1077;&#1105; &#1088;&#1077;&#1096;&#1072;&#1077;&#1090;". &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1090;&#1072;&#1082; &#1085;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090;. &#1054;&#1085;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1077; &#1076;&#1077;&#1082;&#1083;&#1072;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1074;&#1086;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1077;,
&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1077; &#1080; &#1077;&#1089;&#1090;&#1100; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1085;&#1072;
&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; <span class="emphasis"><em>&#1085;&#1077;</em></span> &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;, &#1090;&#1086; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103;,
&#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1085;&#1077; &#1074;&#1085;&#1086;&#1089;&#1080;&#1083;&#1086;&#1089;&#1100;. &#1052;&#1099; &#1087;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1084; &#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1093; &#1101;&#1090;&#1086;&#1075;&#1086;
&#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;.</p><div class="sect2" title="&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1091;&#1087;&#1088;&#1086;&#1097;&#1072;&#1077;&#1090; &#1078;&#1080;&#1079;&#1085;&#1100;"><div class="titlepage"><div><div><h3 class="title"><a name="version-control-relaxation"></a>&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1091;&#1087;&#1088;&#1086;&#1097;&#1072;&#1077;&#1090; &#1078;&#1080;&#1079;&#1085;&#1100;</h3></div></div></div><p>&#1058;&#1086;, &#1095;&#1090;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;,
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1083;&#1077;&#1075;&#1082;&#1086; &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1063;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1080;&#1093; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;,
&#1095;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1083;, &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1076;&#1091;&#1102;&#1090; &#1074;&#1089;&#1077;&#1093;, &#1072; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084;
&#1076;&#1077;&#1083;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1088;&#1072;&#1079;&#1075;&#1086;&#1088;&#1077;&#1083;&#1072;&#1089;&#1100; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103;. &#1056;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;
&#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1079;&#1074;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1079;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1086;&#1079;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1073;&#1099;&#1083;&#1080; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099;
&#1074; &#1093;&#1086;&#1076;&#1077; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1076;&#1086; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1048;&#1079;&#1074;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1087;&#1088;&#1080;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080;
&#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1090; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086; &#1080;
&#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1051;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;, &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077;
&#1076;&#1086; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1086;&#1090; &#1085;&#1077;&#1075;&#1086; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1085;&#1086;&#1074;&#1099;&#1081; &#1082;&#1086;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1077;&#1089;&#1083;&#1080; &#1091;&#1073;&#1088;&#1072;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;). &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1089;&#1084;&#1103;&#1075;&#1095;&#1072;&#1077;&#1090;
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1093; &#1080;&#1083;&#1080; &#1087;&#1086;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;. &#1069;&#1090;&#1086;, &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1076;&#1072;&#1077;&#1090; &#1083;&#1102;&#1076;&#1103;&#1084;
&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1094;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;
&#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.</p><p>&#1058;&#1072;&#1082;&#1078;&#1077; &#1101;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1074;&#1099;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1072;
&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1085; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;.
&#1053;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; &#1083;&#1080;&#1073;&#1086; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1073;&#1077;&#1079; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1089; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;
&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1084;&#1086;&#1083;&#1095;&#1072;&#1083;&#1080;&#1074;&#1099;&#1084; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1077;&#1084;. &#1055;&#1077;&#1088;&#1077;&#1076; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1076;&#1077;&#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077;
&#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1080; &#1082;&#1086;&#1076;&#1072;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1076;&#1086;&#1078;&#1076;&#1072;&#1090;&#1100; &#1076;&#1074;&#1072;-&#1090;&#1088;&#1080; &#1076;&#1085;&#1103; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;
&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1074;&#1096;&#1080;&#1084;&#1089;&#1103;. &#1048;&#1076;&#1077;&#1103; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1089;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072; &#1073;&#1086;&#1088;&#1090;&#1086;&#1084;,
&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090; &#1087;&#1086;&#1095;&#1090;&#1091; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086;.</p><p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;. &#1069;&#1090;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102; &#1082;&#1086;&#1076;&#1072; &#1055;&#1054;, &#1085;&#1086; &#1080; &#1082; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102;
&#1089;&#1072;&#1081;&#1090;&#1072;, &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1102; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;, &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1074;&#1077;&#1097;&#1072;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1073;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074;, &#1074;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;. C &#1085;&#1080;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077;
&#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077; &#1089;&#1090;&#1086;&#1080;&#1090; &#1087;&#1086;&#1086;&#1097;&#1088;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077;&#1074;&#1086;&#1083;&#1080;&#1077;. &#1045;&#1089;&#1090;&#1100; &#1087;&#1089;&#1080;&#1093;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103;
&#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1099;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1091;&#1078;&#1077;
&#1074;&#1089;&#1090;&#1091;&#1087;&#1080;&#1083;&#1086; &#1074; &#1089;&#1080;&#1083;&#1091;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;. &#1051;&#1102;&#1076;&#1080; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1095;&#1090;&#1086; &#1076;&#1074;&#1080;&#1078;&#1091;&#1097;&#1072;&#1103; &#1089;&#1080;&#1083;&#1072;
&#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1072; &#1089; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084;, &#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1091;&#1078;&#1077; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086;&#1084;&#1091; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1102;,
&#1095;&#1077;&#1084; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1102; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1101;&#1090;&#1080;&#1084; &#1080; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1087;&#1086;&#1088;&#1085;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;, &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080;
&#1084;&#1086;&#1075;&#1091;&#1090; &#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1086;&#1079;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1077;&#1084;&#1091;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1089;&#1090;&#1088;&#1086;&#1075;&#1080;&#1084; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072;&#1084; &#1087;&#1086;&#1082;&#1072; &#1086;&#1085; &#1085;&#1077; &#1085;&#1072;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103;.</p></div><div class="sect2" title="&#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1080;&#1084;, &#1075;&#1086;&#1083;&#1086;&#1089;&#1091;&#1081;&#1090;&#1077;"><div class="titlepage"><div><div><h3 class="title"><a name="voting"></a>&#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1080;&#1084;, &#1075;&#1086;&#1083;&#1086;&#1089;&#1091;&#1081;&#1090;&#1077;</h3></div></div></div><p>&#1063;&#1072;&#1089;&#1090;&#1100; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1081; &#1085;&#1077;&#1080;&#1079;&#1073;&#1077;&#1078;&#1085;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1077;&#1085;&#1089;&#1091;&#1089;&#1086;&#1084;.
&#1050;&#1086;&#1075;&#1076;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1080;&#1089;&#1089;&#1072; &#1080;&#1089;&#1095;&#1077;&#1088;&#1087;&#1072;&#1102;&#1090; &#1089;&#1077;&#1073;&#1103;, &#1075;&#1086;&#1083;&#1086;&#1089;&#1091;&#1081;&#1090;&#1077;.
&#1053;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1080;&#1089;&#1093;&#1086;&#1076;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1076; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;.
&#1048; &#1079;&#1076;&#1077;&#1089;&#1100;, &#1089;&#1085;&#1086;&#1074;&#1072;, &#1087;&#1088;&#1080;&#1088;&#1086;&#1076;&#1072; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103;
&#1080; &#1089;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1086;&#1081; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1047;&#1072;&#1095;&#1072;&#1089;&#1090;&#1091;&#1102; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103;
&#1085;&#1072; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1089;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093;, &#1084;&#1085;&#1086;&#1075;&#1086;&#1075;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1097;&#1077;&#1081;. &#1042; &#1101;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, 
&#1086;&#1076;&#1080;&#1085; &#1080;&#1083;&#1080; &#1076;&#1074;&#1072; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1073;&#1077;&#1088;&#1091;&#1090; &#1085;&#1072; &#1089;&#1077;&#1073;&#1077; &#1088;&#1086;&#1083;&#1100;
<em class="firstterm">&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;</em>, &#1086;&#1085;&#1080; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1091;&#1102;&#1090; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1077;
&#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1080; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1102;&#1090;&#1089;&#1103;
(&#1080;&#1083;&#1080; &#1085;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1102;&#1090;&#1089;&#1103;) &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;. &#1069;&#1090;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1102;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072;&#1084; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;
&#1086;&#1094;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1091;&#1090;&#1099;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1077;&#1089;&#1089; &#1080; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1090; &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1077;&#1097;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1086;&#1080;&#1090;
&#1088;&#1077;&#1096;&#1080;&#1090;&#1100;. &#1069;&#1090;&#1080; &#1078;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1083;&#1091;&#1078;&#1072;&#1090; &#1087;&#1088;&#1086;&#1090;&#1086;&#1090;&#1080;&#1087;&#1072;&#1084;&#1080; &#1073;&#1102;&#1083;&#1083;&#1077;&#1090;&#1077;&#1085;&#1077;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1082;&#1080; &#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1089;&#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081;, &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1087;&#1088;&#1086;&#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1086;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1076;&#1083;&#1103; &#1073;&#1102;&#1083;&#1083;&#1077;&#1090;&#1077;&#1085;&#1077;&#1081;. &#1055;&#1086;&#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;
&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080;. &#1054;&#1085;&#1080; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1099; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1087;&#1086;&#1085;&#1103;&#1090;&#1100; &#1080; &#1072;&#1076;&#1077;&#1082;&#1074;&#1072;&#1090;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1080; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090;
&#1089;&#1074;&#1086;&#1080;&#1084; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;&#1072;&#1084; &#1074;&#1083;&#1080;&#1103;&#1090;&#1100; &#1085;&#1072; &#1085;&#1077;&#1081;&#1090;&#1088;&#1072;&#1083;&#1080;&#1090;&#1077;&#1090; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1088;&#1086;&#1083;&#1080; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;.
</p><p>&#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1073;&#1102;&#1083;&#1083;&#1077;&#1090;&#1077;&#1085;&#1103; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1089;&#1087;&#1086;&#1088;&#1086;&#1074;. &#1050;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;
&#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1087;&#1086;&#1088;&#1099; &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1089;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1082; &#1091;&#1079;&#1082;&#1086;&#1084;&#1091; &#1082;&#1088;&#1091;&#1075;&#1091; &#1095;&#1077;&#1090;&#1082;&#1086; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;. &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1090;&#1089;&#1103; &#1089; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1073;&#1102;&#1083;&#1083;&#1077;&#1090;&#1077;&#1085;&#1077;. &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1077;&#1075;&#1086; &#1076;&#1086;&#1074;&#1086;&#1076;&#1099; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1077;&#1089;&#1083;&#1080;
&#1074;&#1072;&#1078;&#1085;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1073;&#1099;&#1083; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1079;&#1072; &#1073;&#1086;&#1088;&#1090;&#1086;&#1084;, &#1080;&#1083;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1086;&#1095;&#1085;&#1086;.
&#1053;&#1086; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1087;&#1088;&#1086;&#1089;&#1090;&#1091; &#1086;&#1090;&#1090;&#1103;&#1075;&#1080;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1080;&#1079;&#1073;&#1077;&#1078;&#1085;&#1086;&#1077;, &#1079;&#1085;&#1072;&#1103;
&#1095;&#1090;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077; &#1074; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;.
&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1084;&#1091; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1102; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <span>
<a class="xref" href="communications.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;">&#1043;&#1083;&#1072;&#1074;&#1072; 6, <i>&#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</i></a></span>:<a class="xref" href="difficult-people.html" title="&#1058;&#1103;&#1078;&#1105;&#1083;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080;">«&#1058;&#1103;&#1078;&#1105;&#1083;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080;»</a>.
</p><p>Remember to specify the voting system, as there are many
different kinds, and people might make wrong assumptions about which
procedure is being used.  A good choice in most cases is
<em class="firstterm">approval voting</em>, whereby each voter can vote
for as many of the choices on the ballot as he likes.  Approval
voting is simple to explain and to count, and unlike some other
methods, it only involves one round of voting.  See <a class="ulink" href="http://en.wikipedia.org/wiki/Voting_system#List_of_systems" target="_top">http://en.wikipedia.org/wiki/Voting_system#List_of_systems</a> for
more details about approval voting and other voting systems, but try
to avoid getting into a long debate about which voting system to use
(because, of course, you will then find yourself in a debate about
which voting system to use to decide the voting system!).  One reason
approval voting is a good choice is that it's very hard for anyone to
object to&#8212;it's about as fair as a voting system can be.</p><p>Finally, conduct votes in public.  There is no need for secrecy
or anonymity in a vote on matters that have been debated publicly
anyway.  Have each participant post her votes to the project mailing
list, so that any observer can tally and check the results for
herself, and so that everything is recorded in the archives.</p></div><div class="sect2" title="When To Vote"><div class="titlepage"><div><div><h3 class="title"><a name="when-to-vote"></a>When To Vote</h3></div></div></div><p>The hardest thing about voting is determining when to do it.  In
general, taking a vote should be very rare&#8212;a last resort for
when all other options have failed.  Don't think of voting as a great
way to resolve debates.  It isn't.  It ends discussion, and thereby
ends creative thinking about the problem.  As long as discussion
continues, there is the possibility that someone will come up with a
new solution everyone likes.  This happens surprisingly often: a
lively debate can produce a new way of thinking about the problem, and
lead to a proposal that eventually satisfies everyone.  Even when no
new proposal arises, it's still usually better to broker a compromise
than to hold a vote.  After a compromise, everyone is a little bit
unhappy, whereas after a vote, some people are unhappy while others
are happy.  From a political standpoint, the former situation is
preferable: at least each person can feel he extracted a price for his
unhappiness.  He may be dissatisfied, but so is everyone else.</p><p>Voting's main advantage is that it finally settles a question so
everyone can move on.  But it settles it by a head count, instead of
by rational dialogue leading everyone to the same conclusion.  The
more experienced people are with open source projects, the less eager
I find them to be to settle questions by vote.  Instead they will try
to explore previously unconsidered solutions, or compromise more
severely than they'd originally planned.  Various techniques are
available to prevent a premature vote.  The most obvious is simply to
say "I don't think we're ready for a vote yet," and explain why not.
Another is to ask for an informal (non-binding) show of hands.  If the
response clearly tends toward one side or another, this will make some
people suddenly more willing to compromise, obviating the need for a
formal vote.  But the most effective way is simply to offer a new
solution, or a new viewpoint on an old suggestion, so that people
re-engage with the issues instead of merely repeating the same
arguments.</p><p>In certain rare cases, everyone may agree that all the
compromise solutions are worse than any of the non-compromise ones.
When that happens, voting is less objectionable, both because it is
more likely to lead to a superior solution and because people will not
be overly unhappy no matter how it turns out.  Even then, the vote
should not be rushed.  The discussion leading up to a vote is what
educates the electorate, so stopping that discussion early can lower
the quality of the result.</p><p>(Note that this advice to be reluctant to call votes does not
apply to the change-inclusion voting described in
<a class="xref" href="stabilizing-a-release.html" title="Stabilizing a Release">«Stabilizing a Release»</a><span>
in <a class="xref" href="development-cycle.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 7. Packaging, Releasing, and Daily Development">&#1043;&#1083;&#1072;&#1074;&#1072; 7, <i>Packaging, Releasing, and Daily Development</i></a></span>.  There, voting
is more of a communications mechanism, a means of registering one's
involvement in the change review process so that everyone can tell how
much review a given change has received.)</p></div><div class="sect2" title="Who Votes?"><div class="titlepage"><div><div><h3 class="title"><a name="electorate"></a>Who Votes?</h3></div></div></div><p>Having a voting system raises the question of electorate: who
gets to vote?  This has the potential to be a sensitive issue, because
it forces the project to officially recognize some people as being
more involved, or as having better judgement, than others.</p><p>The best solution is to simply take an existing distinction,
commit access, and attach voting privileges to it.  In projects that
offer both full and partial commit access, the question of whether
partial committers can vote largely depends on the process by which
partial commit access is granted.  If the project hands it out
liberally, for example as a way of maintaining many third-party
contributed tools in the repository, then it should be made clear that
partial commit access is really just about committing, not voting.
The reverse implication naturally holds as well: since full committers
<span class="emphasis"><em>will</em></span> have voting privileges, they must be chosen
not only as programmers, but as members of the electorate.  If someone
shows disruptive or obstructionist tendencies on the mailing list, the
group should be very cautious about making him a committer, even if
the person is technically skilled.</p><p>The voting system itself should be used to choose new
committers, both full and partial.  But here is one of the rare
instances where secrecy is appropriate.  You can't have votes about
potential committers posted to a public mailing list, because the
candidate's feelings (and reputation) could be hurt.  Instead, the
usual way is that an existing committer posts to a private mailing
list consisting only of the other committers, proposing that someone
be granted commit access.  The other committers speak their minds
freely, knowing the discussion is private.  Often there will be no
disagreement, and therefore no vote necessary.  After waiting a few
days to make sure every committer has had a chance to respond, the
proposer mails the candidate and offers him commit access.  If there
is disagreement, discussion ensues as for any other question, possibly
resulting in a vote.  For this process to be open and frank, the mere
fact that the discussion is taking place at all should be secret.  If
the person under consideration knew it was going on, and then were
never offered commit access, he could conclude that he had lost
the vote, and would likely feel hurt.  Of course, if someone
explicitly asks for commit access, then there is no choice but to
consider the proposal and explicitly accept or reject him.  If the
latter, then it should be done as politely as possible, with a clear
explanation: "We liked your patches, but haven't seen enough of them
yet," or "We appreciate all your patches, but they required
considerable adjustments before they could be applied, so we don't
feel comfortable giving you commit access yet.  We hope that this will
change over time, though."  Remember, what you're saying could come as
a blow, depending on the person's level of confidence.  Try to see it
from their point of view as you write the mail.</p><p>Because adding a new committer is more consequential than most
other one-time decisions, some projects have special requirements for
the vote.  For example, they may require that the proposal receive at
least <span class="emphasis"><em>n</em></span> positive votes and no negative votes, or
that a supermajority vote in favor.  The exact parameters are not
important; the main idea is to get the group to be careful about
adding new committers.  Similar, or even stricter, special requirements
can apply to votes to <span class="emphasis"><em>remove</em></span> a committer, though
hopefully that will never be necessary.  See <a class="xref" href="committers.html" title="Committers">«Committers»</a><span> in
<a class="xref" href="managing-volunteers.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 8. Managing Volunteers">&#1043;&#1083;&#1072;&#1074;&#1072; 8, <i>Managing Volunteers</i></a></span> for more on the
non-voting aspects of adding and removing committers.</p></div><div class="sect2" title="Polls Versus Votes"><div class="titlepage"><div><div><h3 class="title"><a name="polls"></a>Polls Versus Votes</h3></div></div></div><p>For certain kinds of votes, it may be useful to expand the
electorate. For example, if the developers simply can't figure out
whether a given interface choice matches the way people actually use
the software, one solution is to ask to all the subscribers of the
project's mailing lists to vote.  These are really
<em class="firstterm">polls</em> rather than votes, but the developers may
choose to treat the result as binding.  As with any poll, be sure to
make it clear to the participants that there's a write-in option: if
someone thinks of a better option not offered in the poll questions,
her response may turn out to be the most important result of the
poll.</p></div><div class="sect2" title="Vetoes"><div class="titlepage"><div><div><h3 class="title"><a name="veto"></a>Vetoes</h3></div></div></div><p>Some projects allow a special kind of vote known as a
<em class="firstterm">veto</em>.  A veto is a way for a developer to put a
halt to a hasty or ill-considered change, at least long enough for
everyone to discuss it more.  Think of a veto as somewhere between a
very strong objection and a filibuster.  Its exact meaning varies from
one project to another.  Some projects make it very difficult to
override a veto; others allow them to be overridden by regular
majority vote, perhaps after an enforced delay for more discussion.
Any veto should be accompanied by a thorough explanation; a veto
without such an explanation should be considered invalid on
arrival.</p><p>With vetoes comes the problem of veto abuse.  Sometimes
developers are too eager to raise the stakes by casting a veto, when
really all that was called for was more discussion.  You can prevent
veto abuse by being very reluctant to use vetoes yourself, and by
gently calling it out when someone else uses her veto too often.  If
necessary, you can also remind the group that vetoes are binding for
only as long as the group agrees they are&#8212;after all, if a
clear majority of developers wants X, then X is going to happen one
way or another.  Either the vetoing developer will back down, or the
group will decide to weaken the meaning of a veto.</p><p>You may see people write "-1" to express a veto.  This usage
comes from the Apache Software Foundation, which has a highly
structured voting and veto process, described at <a class="ulink" href="http://www.apache.org/foundation/voting.html" target="_top">http://www.apache.org/foundation/voting.html</a>.  The Apache
standards have spread to other projects, and you will see their
conventions used to varying degrees in a lot of places in the open
source world.  Technically, "-1" does not always indicate a formal
veto even according to the Apache standards, but informally it is
usually taken to mean a veto, or at least a very strong
objection.</p><p>Like votes, vetoes can apply retroactively.  It's not okay to
object to a veto on the grounds that the change in question has
already been committed, or the action taken (unless it's something
irrevocable, like putting out a press release).  On the other hand, a
veto that arrives weeks or months late isn't likely to be taken very
seriously, nor should it be.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="social-infrastructure.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="social-infrastructure.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="written-rules.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1057;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> Writing It All Down</td></tr></table></div></body></html>
