<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="communications.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;"><link rel="prev" href="difficult-people.html" title="&#1058;&#1103;&#1078;&#1105;&#1083;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080;"><link rel="next" href="bug-tracker-usage.html" title="&#1053;&#1077;&#1090; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084; &#1074; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="difficult-people.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="bug-tracker-usage.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="growth"></a>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;</h2></div></div></div><p>&#1062;&#1077;&#1085;&#1072; &#1091;&#1089;&#1087;&#1077;&#1093;&#1072; &#1074; &#1084;&#1080;&#1088;&#1077; &#1055;&#1054; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1074;&#1099;&#1089;&#1086;&#1082;&#1072;. &#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1086;&#1089;&#1090;&#1072; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086;
&#1055;&#1054;, &#1095;&#1080;&#1089;&#1083;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1097;&#1091;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1088;&#1072;&#1089;&#1090;&#1077;&#1090; &#1089;&#1090;&#1088;&#1077;&#1084;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1090;&#1086;&#1075;&#1076;&#1072;
&#1082;&#1072;&#1082; &#1095;&#1080;&#1089;&#1083;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1088;&#1072;&#1089;&#1090;&#1105;&#1090; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1077;&#1077;.
&#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1086;&#1085;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;, &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1073;&#1099;
&#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054;. &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;. &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1077;&#1089;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1083;&#1103; &#1086;&#1073;&#1097;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; - &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;
"users", "discuss", "help", &#1080;&#1083;&#1080; &#1082;&#1072;&#1082;-&#1090;&#1086; &#1077;&#1097;&#1105;. &#1050;&#1072;&#1082;&#1086;&#1074;&#1086; &#1073;&#1099; &#1085;&#1080; &#1073;&#1099;&#1083;&#1086; &#1077;&#1075;&#1086; &#1080;&#1084;&#1103;, &#1094;&#1077;&#1083;&#1100;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1076;&#1085;&#1072; &#1080; &#1090;&#1072; &#1078;&#1077;: &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1075;&#1076;&#1077; &#1086;&#1076;&#1085;&#1080; &#1083;&#1102;&#1076;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;
&#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1085;&#1072; &#1089;&#1074;&#1086;&#1080; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1080;&#1097;&#1091;&#1090; &#1080; (&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103;) &#1085;&#1072;&#1082;&#1072;&#1087;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103;,
&#1085;&#1072;&#1073;&#1083;&#1102;&#1076;&#1072;&#1103; &#1079;&#1072; &#1101;&#1090;&#1080;&#1084; &#1086;&#1073;&#1084;&#1077;&#1085;&#1086;&#1084;.</p><p>&#1058;&#1072;&#1082;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074; &#1085;&#1080;&#1093; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1076;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093;
&#1090;&#1099;&#1089;&#1103;&#1095; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074; &#1080;&#1083;&#1080;/&#1080; &#1074; &#1085;&#1080;&#1093; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086; &#1089;&#1086;&#1090;&#1077;&#1085; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1076;&#1077;&#1085;&#1100;.
&#1053;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1073;&#1086;&#1080;,
&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082; &#1074;&#1080;&#1076;&#1080;&#1090; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;; &#1077;&#1089;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1090;&#1100; &#1090;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;
&#1079;&#1072; &#1076;&#1077;&#1085;&#1100;, &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1090;&#1103;&#1075;&#1086;&#1090;&#1080;&#1090;&#1100; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;.
&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1090;&#1086; Microsoft &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1083;&#1103; Windows XP. Windows
XP &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1086;&#1090;&#1085;&#1080; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;; &#1077;&#1089;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1086;&#1076;&#1085;&#1072; &#1076;&#1077;&#1089;&#1103;&#1090;&#1072;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079; &#1085;&#1080;&#1093;
&#1079;&#1072;&#1076;&#1072;&#1076;&#1091;&#1090; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; 24-&#1095;&#1072;&#1089;&#1086;&#1074;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1072;, &#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084;
&#1075;&#1080;&#1087;&#1086;&#1090;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1090;&#1085;&#1080; &#1090;&#1099;&#1089;&#1103;&#1095; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1076;&#1077;&#1085;&#1100;! &#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075; &#1073;&#1099; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1085;&#1077;
&#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1089;&#1103; &#1073;&#1099; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1086;&#1084;. &#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;;
&#1090;&#1072; &#1078;&#1077; &#1083;&#1086;&#1075;&#1080;&#1082;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1072; &#1082; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;&#1084; IRC, &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;&#1084;, &#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1082;
&#1083;&#1102;&#1073;&#1099;&#1084; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1074;&#1099;&#1089;&#1083;&#1091;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1091;&#1084;&#1086;&#1074;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1103;
&#1091;&#1075;&#1088;&#1086;&#1078;&#1072;&#1102;&#1097;&#1080;: &#1086;&#1073;&#1099;&#1095;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1086;&#1081; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1080;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1084;&#1080;&#1088;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;.</p><p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1099; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1091;&#1090; &#1089;&#1074;&#1086;&#1080;&#1093; &#1082;&#1088;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082;, &#1074;&#1079;&#1088;&#1099;&#1074;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;.
&#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1097;&#1091;&#1090;&#1080;&#1084;&#1099;&#1081; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;: &#1083;&#1102;&#1076;&#1080; &#1086;&#1090;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;, &#1080;&#1083;&#1080; &#1087;&#1086;&#1082;&#1080;&#1076;&#1072;&#1102;&#1090; &#1082;&#1072;&#1085;&#1072;&#1083;&#1099; IRC, &#1080;&#1083;&#1080; &#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1084;-&#1090;&#1086; &#1101;&#1090;&#1072;&#1087;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1102;&#1090;
&#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1074;&#1080;&#1076;&#1103;&#1090;, &#1095;&#1090;&#1086; &#1080;&#1093; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1091;&#1089;&#1083;&#1099;&#1096;&#1072;&#1090;&#1100; &#1074; &#1101;&#1090;&#1086;&#1084; &#1096;&#1091;&#1084;&#1077;. &#1055;&#1086;
&#1084;&#1077;&#1088;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1089;&#1105; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1083;&#1102;&#1076;&#1077;&#1081; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1101;&#1090;&#1086;&#1090; &#1074; &#1074;&#1099;&#1089;&#1096;&#1077;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080;
&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1085;&#1072;
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;. &#1053;&#1086; &#1086;&#1085;&#1072; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1074; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;
(&#1080;&#1083;&#1080;, &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077;, &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077;) &#1083;&#1102;&#1076;&#1080; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1075;&#1076;&#1077;-&#1090;&#1086; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;
&#1084;&#1077;&#1089;&#1090;&#1072;&#1093; - &#1090;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082; &#1085;&#1077;&#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1080;&#1089;&#1100; &#1080; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1102;&#1090; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100;. &#1044;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;,
&#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1087;&#1086;&#1073;&#1086;&#1095;&#1085;&#1099;&#1093; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1090; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1086;&#1089;&#1090;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;,
&#1085;&#1077;&#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1081; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;
&#1082;&#1072;&#1082; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1090;&#1072;&#1082; &#1080; &#1086;&#1090;&#1074;&#1077;&#1090;&#1086;&#1074; &#1089;&#1085;&#1080;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1080; &#1074;&#1089;&#1105; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082;
&#1073;&#1091;&#1076;&#1090;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1075;&#1083;&#1091;&#1087;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077;, &#1093;&#1086;&#1090;&#1103; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1085;&#1080;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;,
&#1085;&#1077; &#1090;&#1072;&#1082;&#1080;&#1077;. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1078;&#1077; &#1076;&#1077;&#1083;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1099; &#1082; &#1079;&#1072;&#1090;&#1088;&#1072;&#1090;&#1072;&#1084; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093;
&#1074;&#1099;&#1089;&#1086;&#1082;&#1086;-&#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1091;&#1084;&#1086;&#1074; &#1087;&#1072;&#1076;&#1072;&#1077;&#1090;, &#1080; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090;
&#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1086;&#1074;
&#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080; &#1088;&#1086;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1081;:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;
   <span class="emphasis"><em>&#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1102;&#1090;</em></span> &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089; &#1073;&#1077;&#1079;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1085;&#1099;&#1084;
   &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1092;&#1086;&#1088;&#1091;&#1084; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084; &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1074; &#1085;&#1086;&#1074;&#1099;&#1077;,
   &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1086;&#1088;&#1091;&#1084;&#1099; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1081;&#1090;&#1077; &#1087;&#1083;&#1086;&#1093;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077;).</p></li><li class="listitem"><p>&#1054;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1074; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;,
   &#1080; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099;, &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;, &#1080; &#1074; &#1085;&#1080;&#1093; &#1083;&#1077;&#1075;&#1082;&#1086; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100;.</p></li></ol></div><p>&#1055;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1077; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;: &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1089;&#1105;
&#1086;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1076;&#1077;&#1081; &#1080; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072; &#1076;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081;,
&#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;, - &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103;
&#1103;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1101;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083; &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1089;&#1086;
&#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1090;&#1077;&#1084;&#1072;&#1084;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1090;&#1077;&#1084;&#1099; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086; &#1082;&#1072;&#1089;&#1072;&#1102;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072;;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1077; - &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1090;&#1080;&#1087;&#1072; "&#1050;&#1072;&#1082; &#1084;&#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; X?"; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1077;&#1089;&#1090;&#1100;
&#1090;&#1088;&#1077;&#1090;&#1100;&#1077; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1089;&#1082;&#1086;&#1085;&#1094;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1074; &#1086;&#1073;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1085;&#1072; &#1076;&#1086;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091;; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1050;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1084;&#1086;&#1078;&#1077;&#1090;
&#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1074;&#1077;&#1090;&#1082;&#1072;&#1093; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;, &#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1072;&#1084;&#1080; &#1074;&#1077;&#1090;&#1082;&#1080;
&#1085;&#1077; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;. &#1048;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1085;&#1077;
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1103; &#1087;&#1072;&#1075;&#1091;&#1073;&#1085;&#1086;&#1081; &#1073;&#1072;&#1083;&#1082;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1088;&#1077;&#1076;&#1082;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1090;&#1077;&#1084;.</p><p>&#1044;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1076;&#1074;&#1091;&#1093;&#1096;&#1072;&#1075;&#1086;&#1074;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;. &#1042;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; (&#1080;&#1083;&#1080; &#1082;&#1072;&#1085;&#1072;&#1083; IRC, &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;), &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1074;&#1077;&#1078;&#1083;&#1080;&#1074;&#1086; &#1079;&#1072;&#1085;&#1091;&#1076;&#1089;&#1090;&#1074;&#1091;&#1103; &#1080; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1103; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1080;
<span class="emphasis"><em>&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;</em></span> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1086;&#1074;&#1099;&#1077; &#1092;&#1086;&#1088;&#1091;&#1084;&#1099;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081;
&#1096;&#1072;&#1075; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1076;&#1077;&#1083;&#1100;, &#1085;&#1086; &#1074; &#1080;&#1090;&#1086;&#1075;&#1077; &#1083;&#1102;&#1076;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1084;&#1091;&#1090; &#1080;&#1076;&#1077;&#1102;. &#1042;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1090;&#1100; &#1074;&#1089;&#1103;&#1082;&#1080;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1090;&#1091;&#1076;&#1072;, &#1080; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;
&#1103;&#1074;&#1085;&#1086;, &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1086;&#1097;&#1088;&#1080;&#1090;&#1100; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; &#1082; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1091;. &#1055;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1084;&#1077;&#1090;&#1100;
web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1089; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1077;&#1081; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1084; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;; &#1074;&#1072;&#1096;&#1080; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1080;, &#1082;&#1072;&#1082; &#1073;&#1086;&#1085;&#1091;&#1089;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100;,
&#1080;&#1079;&#1091;&#1095;&#1072;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1086;&#1081; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;.</p><p>&#1057;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1103; (2) - &#1085;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;, &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074;&#1089;&#1105; &#1074;&#1088;&#1077;&#1084;&#1103; &#1078;&#1080;&#1079;&#1085;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080;
&#1074;&#1086;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1097;&#1080;&#1081; &#1084;&#1085;&#1086;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086;&#1090; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1080;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084;
&#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1103; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; 
<a class="xref" href="getting-started.html#documentation" title="&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;">«&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;»</a><span> &#1074;
<a class="xref" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;">&#1043;&#1083;&#1072;&#1074;&#1072; 2, <i>&#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</i></a></span>) &#1080; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1083;&#1102;&#1076;&#1077;&#1081; &#1082; &#1085;&#1077;&#1081;. &#1053;&#1086; &#1086;&#1085; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1102;&#1090; &#1101;&#1090;&#1091;
&#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1074; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093;</p><div class="sect2" title="&#1064;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;"><div class="titlepage"><div><div><h3 class="title"><a name="using-archives"></a>&#1064;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;</h3></div></div></div><p>&#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1074;&#1089;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1055;&#1054; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; (&#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;
IRC-&#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1086;&#1074;) &#1072;&#1088;&#1093;&#1080;&#1074;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;. &#1040;&#1088;&#1093;&#1080;&#1074;&#1099; &#1086;&#1073;&#1097;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;, &#1074; &#1085;&#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100;, &#1080; &#1086;&#1085;&#1080;
&#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;: &#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1086;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;&#1084;&#1091;
&#1072;&#1076;&#1088;&#1077;&#1089;&#1091;, &#1087;&#1086;&#1088;&#1094;&#1080;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;.</p><p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; &#1090;&#1072;&#1082; &#1095;&#1072;&#1089;&#1090;&#1086;, &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086;, &#1080; &#1090;&#1072;&#1082; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;, &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1084;&#1086;&#1078;&#1085;&#1086;. &#1044;&#1072;&#1078;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1083;&#1077;&#1078;&#1080;&#1090; &#1076;&#1083;&#1103; &#1074;&#1072;&#1089; &#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1077;&#1089;&#1083;&#1080;
&#1074;&#1099; &#1076;&#1091;&#1084;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093; &#1077;&#1089;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1089; &#1086;&#1090;&#1074;&#1077;&#1090;&#1086;&#1084; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1100;&#1090;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1082;&#1086;&#1087;&#1072;&#1090;&#1100; &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1105;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1101;&#1090;&#1086; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086; &#1103;&#1074;&#1085;&#1099;&#1084;
&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1091;&#1079;&#1085;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;, &#1080; &#1087;&#1086;&#1080;&#1089;&#1082; &#1074; &#1085;&#1080;&#1093;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1089;&#1089;&#1099;&#1083;&#1072;&#1103;&#1089;&#1100; &#1085;&#1072; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1077;&#1090;&#1072;, &#1074;&#1099;
&#1087;&#1086;&#1076;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1090;&#1077; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1085;&#1086;&#1088;&#1084;&#1091; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1074;&#1077;&#1089; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1047;&#1072;&#1095;&#1077;&#1084;
&#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1086;&#1076;&#1080;&#1085; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1074; &#1076;&#1074;&#1091;&#1093; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;? &#1050;&#1086;&#1075;&#1076;&#1072; &#1095;&#1080;&#1089;&#1083;&#1086; &#1084;&#1077;&#1089;&#1090;, &#1074;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1083;&#1102;&#1076;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1096;&#1083;&#1080; &#1077;&#1075;&#1086;
&#1086;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099;, &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1089;&#1087;&#1086;&#1084;&#1085;&#1103;&#1090;, &#1075;&#1076;&#1077; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1085;&#1086;&#1074;&#1072;. &#1055;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;
&#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1105;&#1085;&#1085;&#1099;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;
&#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1088;&#1072;&#1085;&#1075; &#1080;&#1089;&#1082;&#1086;&#1084;&#1086;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1074; &#1087;&#1086;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1093; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072;&#1093; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;.</p><p>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1089;&#1083;&#1091;&#1095;&#1072;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084; &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093; &#1091;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1090;, &#1085;&#1077; &#1074;&#1072;&#1096;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;:</p><pre class="screen">
&#1058;&#1072;&#1082;&#1086;&#1077; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1091; &#1074;&#1072;&#1089; &#1079;&#1072;&#1082;&#1083;&#1080;&#1085;&#1080;&#1083;&#1086; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099; Scanley. &#1063;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1089;&#1082;&#1083;&#1080;&#1085;&#1080;&#1090;&#1100; &#1080;&#1093;,
&#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1090;&#1072;&#1082;:

1. &#1054;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; Scanley.
2. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; 'defrobnicate', &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080;&#1076;&#1105;&#1090; &#1074; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1082;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089;&#1086; Scanley.
3. &#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;.
</pre><p>&#1047;&#1072;&#1090;&#1077;&#1084;, &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1077;&#1089;&#1103;&#1094;&#1077;&#1074; &#1089;&#1087;&#1091;&#1089;&#1090;&#1103;, &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1085;&#1072; &#1090;&#1086;,
&#1095;&#1090;&#1086; &#1091; &#1082;&#1086;&#1075;&#1086;-&#1090;&#1086; &#1086;&#1087;&#1103;&#1090;&#1100; &#1079;&#1072;&#1082;&#1083;&#1080;&#1085;&#1080;&#1083;&#1086; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099;. &#1074;&#1099; &#1080;&#1097;&#1077;&#1090;&#1077; &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093; &#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077;
&#1074;&#1099;&#1096;&#1077;&#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090;, &#1085;&#1086; &#1074;&#1099; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1105;&#1084; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1096;&#1072;&#1075;&#1086;&#1074;
(&#1090;&#1086; &#1083;&#1080; &#1087;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;, &#1090;&#1086; &#1083;&#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1055;&#1054; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1086;&#1089;&#1100; &#1089; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1082;&#1072;&#1082; &#1073;&#1099;&#1083; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;
&#1086;&#1090;&#1074;&#1077;&#1090;). &#1057;&#1072;&#1084;&#1099;&#1081; &#1089;&#1090;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086; - &#1087;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1089; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081;, &#1080; &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1077;&#1077; &#1089;&#1090;&#1072;&#1088;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;:</p><pre class="screen">
&#1058;&#1072;&#1082;&#1086;&#1077; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1091; &#1074;&#1072;&#1089; &#1079;&#1072;&#1082;&#1083;&#1080;&#1085;&#1080;&#1083;&#1086; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099; Scanley. &#1052;&#1099; &#1091;&#1078;&#1077; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;
&#1101;&#1090;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1074; &#1048;&#1102;&#1083;&#1077;, &#1080; J.Random &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1083; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; http://blahblahblah/blah.
&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1072;&#1096;&#1080; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077;
&#1085;&#1072; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1093; J.Random'&#1072;, &#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1102;&#1097;&#1077;&#1077; &#1080;&#1093;:

1. &#1054;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; Scanley.
2. &#1042;&#1086;&#1081;&#1076;&#1080;&#1090;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1086;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; Scanley.
3. &#1054;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; 'defrobnicate' &#1076;&#1083;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1074;.
4. &#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; Scanley "&#1088;&#1091;&#1082;&#1072;&#1084;&#1080;", &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;.
5. &#1055;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;.
</pre><p>(&#1042; &#1080;&#1076;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1084;&#1080;&#1088;&#1077; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1082; &#1089;&#1090;&#1072;&#1088;&#1086;&#1084;&#1091; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1102;,
&#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1097;&#1077;&#1077;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1074;&#1077;&#1078;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;, &#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1085;&#1086;&#1074;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;.
&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1103; &#1085;&#1077; &#1079;&#1085;&#1072;&#1102; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1055;&#1054; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086; &#1073;&#1099;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; "&#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;&#1086; &#1087;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;", &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;
&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1085;&#1072;&#1088;&#1091;&#1096;&#1072;&#1083;&#1072;&#1089;&#1100; &#1094;&#1077;&#1083;&#1086;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072; &#1082;&#1072;&#1082; &#1089;&#1090;&#1077;&#1085;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1069;&#1090;&#1086;
&#1074;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072;&#1084;&#1080; &#1085;&#1072; &#1086;&#1073;&#1097;&#1080;&#1077;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1081; &#1080;&#1076;&#1077;&#1077;&#1081;.)</p><p>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1080;&#1097;&#1091;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1085;&#1072; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1085;&#1086; &#1080;&#1093;
&#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1072;&#1083;&#1077;&#1082;&#1086; &#1079;&#1072; &#1101;&#1090;&#1080; &#1088;&#1072;&#1084;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; - &#1101;&#1090;&#1086; &#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1074;&#1086;&#1079;&#1075;&#1083;&#1072;&#1096;&#1105;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1099;, &#1090;&#1086; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099; - &#1101;&#1090;&#1086; &#1077;&#1075;&#1086; &#1085;&#1077;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1099;:
&#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1074;&#1089;&#1077;&#1093; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; &#1080; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1082; &#1085;&#1080;&#1084; &#1087;&#1088;&#1080;&#1096;&#1083;&#1080;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1081; &#1074;&#1086;&#1079;&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081;
&#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1085;&#1099;&#1085;&#1095;&#1077; &#1085;&#1077;&#1087;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1076;&#1086; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1077;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1072;&#1084;
&#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088; &#1089; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1074;&#1077;&#1097;&#1077;&#1081;, &#1087;&#1088;&#1077;&#1076;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;,
&#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1100; &#1086;&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1090;&#1100; &#1091;&#1075;&#1083;&#1099; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1099; &#1085;&#1077;
&#1076;&#1091;&#1084;&#1072;&#1083;&#1080;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080; <span class="emphasis"><em>&#1086;&#1078;&#1080;&#1076;&#1072;&#1102;&#1090;</em></span>, &#1095;&#1090;&#1086; &#1074;&#1099;
&#1087;&#1086;&#1080;&#1089;&#1082;&#1072;&#1083;&#1080; &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093;. &#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080;
&#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1085;&#1080;&#1082;&#1091;&#1076;&#1072; &#1085;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1080;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1085;&#1080;&#1093;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1076;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077; &#1090;&#1077;&#1084;&#1091; &#1089;&#1085;&#1086;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1102;&#1076;&#1080; &#1089;&#1072;&#1084;&#1080; &#1084;&#1086;&#1075;&#1083;&#1080; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1072;) &#1095;&#1090;&#1086; &#1086;&#1085;&#1080;
&#1085;&#1080;&#1082;&#1091;&#1076;&#1072; &#1085;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1080; &#1080; &#1073;) &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077;,
&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1095;&#1090;&#1086;-&#1090;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;.</p><div class="sect3" title="&#1058;&#1088;&#1072;&#1082;&#1090;&#1091;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099; &#1082;&#1072;&#1082; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;"><div class="titlepage"><div><div><h4 class="title"><a name="all-as-archives"></a>&#1058;&#1088;&#1072;&#1082;&#1090;&#1091;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099; &#1082;&#1072;&#1082; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;</h4></div></div></div><p>&#1042;&#1089;&#1077; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1089;&#1086;&#1074;&#1077;&#1090;&#1099; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1099; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084;, &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086;
&#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1086;&#1084; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074;&#1086;&#1079;&#1100;&#1084;&#1105;&#1084; FAQ &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;
&#1082;&#1072;&#1082; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;.</p><p>&#1050;&#1072;&#1082; &#1083;&#1102;&#1076;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; FAQ?</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#1054;&#1085;&#1080; &#1093;&#1086;&#1090;&#1103;&#1090; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1074; &#1085;&#1105;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; &#1080; &#1092;&#1088;&#1072;&#1079;&#1099;.</p></li><li class="listitem"><p> &#1054;&#1085;&#1080; &#1093;&#1086;&#1090;&#1103;&#1090; &#1083;&#1080;&#1089;&#1090;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1074;&#1087;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1097;&#1072; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1085;&#1072;
&#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;.</p></li><li class="listitem"><p>&#1054;&#1085;&#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1077; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1099; &#1090;&#1080;&#1087;&#1072; Google &#1079;&#1085;&#1072;&#1102;&#1090; &#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
FAQ'&#1072;, &#1080; &#1087;&#1086;&#1080;&#1089;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1076;&#1072;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1100;&#1102; &#1080;&#1079; &#1085;&#1077;&#1075;&#1086;.</p></li><li class="listitem"><p>&#1054;&#1085;&#1080; &#1093;&#1086;&#1090;&#1103;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1103;&#1084;&#1086; &#1086;&#1090;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; &#1082; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1084; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1084;
FAQ'&#1072;.</p></li><li class="listitem"><p>&#1054;&#1085;&#1080; &#1093;&#1086;&#1090;&#1103;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; FAQ &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1099;, &#1085;&#1086; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086;
&#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1078;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1086;&#1080;&#1089;&#1082; &#1086;&#1090;&#1074;&#1077;&#1090;&#1086;&#1074; - FAQ'&#1080; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1095;&#1072;&#1097;&#1077; &#1095;&#1080;&#1090;&#1072;&#1102;&#1090;, &#1095;&#1077;&#1084;
&#1087;&#1080;&#1096;&#1091;&#1090; &#1074; &#1085;&#1080;&#1093;.</p></li></ol></div><p>&#1055;&#1091;&#1085;&#1082;&#1090; 1 &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; FAQ &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;.
&#1055;&#1091;&#1085;&#1082;&#1090;&#1099; 2 &#1080; 3 &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; FAQ &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; &#1074;&#1080;&#1076;&#1077; HTML-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1072;
&#1087;&#1091;&#1085;&#1082;&#1090; 2 &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086;&#1090; HTML &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074;&#1080;&#1076; (&#1090;&#1086;
&#1077;&#1089;&#1090;&#1100;, &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;) &#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103;. &#1055;&#1091;&#1085;&#1082;&#1090; 4 &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1089;&#1090;&#1072;&#1090;&#1100;&#1077; &#1074; FAQ'&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100;
&#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085; <em class="firstterm">&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1103;&#1082;&#1086;&#1088;&#1100;</em> HTML, &#1090;&#1077;&#1075;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1074;
&#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;. &#1055;&#1091;&#1085;&#1082;&#1090; 5 &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; FAQ &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100;
&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a class="xref" href="vc.html#version-everything" title="Version everything">«Version everything»</a><span> &#1074;
<a class="xref" href="technical-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;">&#1043;&#1083;&#1072;&#1074;&#1072; 3, <i>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</i></a></span>), &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1083;&#1077;&#1075;&#1082;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;.</p><div class="sidebar" title="&#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; ID"><a name="html-named-anchors-and-ids"></a><div class="titlepage"><div><div><p class="title"><b>&#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; ID</b></p></div></div></div><p>&#1045;&#1089;&#1090;&#1100; &#1076;&#1074;&#1072; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;
	web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;: &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; id.</p><p><em class="firstterm">&#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1103;&#1082;&#1086;&#1088;&#1100;</em> - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; HTML
  "&#1103;&#1082;&#1086;&#1088;&#1100;" (<code class="literal">&lt;a&gt;...&lt;/a&gt;</code>), &#1085;&#1086; &#1089; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1084; "name":</p><pre class="screen">&lt;a name="mylabel"&gt;...&lt;/a&gt;</pre><p>&#1041;&#1086;&#1083;&#1077;&#1077; &#1089;&#1074;&#1077;&#1078;&#1080;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; HTML &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1086;&#1073;&#1097;&#1080;&#1081; <em class="firstterm">&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; id</em>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086;
	&#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1082; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1091; HTML, &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082; <code class="literal">&lt;a&gt;</code>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
        </p><pre class="screen">&lt;p id="mylabel"&gt;...&lt;/p&gt;</pre><p>&#1048; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103;, &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; id &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; 
	&#1088;&#1077;&#1096;&#1105;&#1090;&#1082;&#1091; &#1080; &#1084;&#1077;&#1090;&#1082;&#1091; &#1082; URL, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086; &#1085;&#1072; &#1090;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086;
	&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;:</p><pre class="screen">http://myproject.example.com/faq.html#mylabel</pre><p>&#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1089;&#1077; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103;; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;
	&#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1086;&#1074; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; id. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1076;&#1089;&#1090;&#1088;&#1072;&#1093;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1103;
	&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;
	&#1103;&#1082;&#1086;&#1088;&#1103; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; id &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086; (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1089; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080; &#1090;&#1086;&#1081; &#1078;&#1077; &#1084;&#1077;&#1090;&#1082;&#1086;&#1081; &#1076;&#1083;&#1103;
	&#1086;&#1073;&#1086;&#1080;&#1093; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1088;&#1077;). &#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086;&#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080;&#1089;&#1103;
	- &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1074;&#1099; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1099; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086;
	&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1091;&#1102; (&#1076;&#1074;&#1091;&#1093;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1102;&#1102;) &#1092;&#1086;&#1088;&#1084;&#1091;:</p><pre class="screen">&lt;a name="mylabel"&gt;&lt;/a&gt;</pre><p>...&#1093;&#1086;&#1090;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1090;&#1072;&#1084; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1090;&#1080;&#1087;&#1072; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;.</p><p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1083;&#1080; &#1074;&#1099; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1103;&#1082;&#1086;&#1088;&#1100;, &#1080;&#1083;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; id, &#1080;&#1083;&#1080; &#1086;&#1073;&#1072;, &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;,
	&#1095;&#1090;&#1086; &#1084;&#1077;&#1090;&#1082;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1072; &#1090;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1087;&#1088;&#1080;&#1096;&#1105;&#1083; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1085;&#1077;
	&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1084;&#1077;&#1090;&#1082;&#1091;. &#1053;&#1086; &#1086;&#1085;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1093;&#1086;&#1090;&#1103;&#1090; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1082;&#1091; &#1076;&#1083;&#1103;
	&#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100; URL &#1085;&#1072; FAQ, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1103;
	&#1076;&#1088;&#1091;&#1075;&#1091;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1080;&#1084; &#1074; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; "title" &#1082; &#1090;&#1086;&#1084;&#1091;
	&#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1084;&#1091; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1091;, &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1074;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; "name" &#1080;/&#1080;&#1083;&#1080; "id",
	&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</p><pre class="screen">&lt;a name="mylabel" title="#mylabel"&gt;...&lt;/a&gt;</pre><p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1076; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;
	&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1084; "title", &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1086;&#1074; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1091;&#1102;
	&#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1091;&#1102; &#1088;&#1072;&#1084;&#1082;&#1091;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1097;&#1091;&#1102; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; (title). &#1071; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;
	&#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1088;&#1077;&#1096;&#1105;&#1090;&#1082;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
	&#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; &#1082;&#1086;&#1085;&#1077;&#1094; URL &#1076;&#1083;&#1103; &#1087;&#1088;&#1103;&#1084;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;.</p></div><p>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; FAQ &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; - &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1073;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1058;&#1077; &#1078;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; - &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1086;&#1080;&#1089;&#1082;&#1072;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1086;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1093; &#1084;&#1072;&#1096;&#1080;&#1085; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;
&#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1086;&#1084;, &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1080; (&#1075;&#1076;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1086;) &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;
&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; - &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1099; &#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;, &#1076;&#1077;&#1088;&#1077;&#1074;&#1091; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1082;&#1086;&#1076;&#1086;&#1074;,
&#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1091; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1080; &#1090;.&#1076;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1090;&#1072;&#1082; &#1089;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1055;&#1054; &#1076;&#1083;&#1103; &#1072;&#1088;&#1093;&#1080;&#1074;&#1086;&#1074; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081;
&#1087;&#1086;&#1095;&#1090;&#1099; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1074;&#1086;&#1105;&#1084; &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1083;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1101;&#1090;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1076;&#1072;&#1074;&#1085;&#1099;&#1084; &#1076;&#1072;&#1074;&#1085;&#1086;, &#1074;&#1086;&#1090;
&#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1101;&#1090;&#1091; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;
&#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;
&#1091;&#1089;&#1080;&#1083;&#1080;&#1081; &#1086;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;
&#1042; (<a class="xref" href="managing-volunteers.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 8. Managing Volunteers">&#1043;&#1083;&#1072;&#1074;&#1072; 8, <i>Managing Volunteers</i></a> &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1075;&#1088;&#1091;&#1079; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084;&#1080; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1072;&#1084;&#1080;</p></div></div><div class="sect2" title="&#1050;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1081;"><div class="titlepage"><div><div><h3 class="title"><a name="codifying-tradition"></a>&#1050;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1081;</h3></div></div></div><p>&#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072;&#1082;&#1072;&#1087;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102; &#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1105;&#1084;
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1091;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1085;&#1086;&#1074;&#1099;&#1081; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;. &#1058;&#1077;, &#1082;&#1090;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1076;&#1086;&#1083;&#1075;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1084;&#1086;&#1075;&#1083;&#1080; &#1080;&#1079;&#1091;&#1095;&#1072;&#1090;&#1100; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; 
&#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1054;&#1085;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1085;&#1077; &#1086;&#1090;&#1076;&#1072;&#1102;&#1090; &#1089;&#1077;&#1073;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;, &#1082;&#1072;&#1082;&#1091;&#1102;
&#1084;&#1072;&#1089;&#1089;&#1091; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1081; &#1086;&#1085;&#1080; &#1072;&#1082;&#1082;&#1091;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080;, &#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1076;&#1080;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1084;&#1091;, &#1082;&#1072;&#1082; &#1084;&#1085;&#1086;&#1075;&#1086; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1093;
&#1096;&#1072;&#1075;&#1086;&#1074; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1080;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1085;&#1077; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1080;
&#1084;&#1077;&#1085;&#1077;&#1077; &#1082;&#1074;&#1072;&#1083;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;, &#1095;&#1077;&#1084; &#1090;&#1077; &#1082;&#1090;&#1086; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;, &#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1089;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;
&#1072;&#1089;&#1089;&#1080;&#1084;&#1080;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084; &#1075;&#1088;&#1091;&#1079;&#1086;&#1084;, &#1095;&#1077;&#1084; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;.</p><p>&#1058;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1072;&#1082;&#1082;&#1091;&#1084;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1082;&#1072;&#1082; &#1089; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;&#1084;&#1080; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1080;
&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1089;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072;&#1084;&#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;
&#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;. &#1052;&#1099; &#1091;&#1078;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1083;&#1080; &#1086;&#1073;&#1072; &#1074;&#1080;&#1076;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1086;&#1074; &#1074;
<a class="xref" href="getting-started.html#developer-documentation" title="&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;">«&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;»</a><span> 
&#1074; <a class="xref" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;">&#1043;&#1083;&#1072;&#1074;&#1072; 2, <i>&#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</i></a></span> &#1080;
<a class="xref" href="written-rules.html" title="Writing It All Down">«Writing It All Down»</a><span> &#1074;
<a class="xref" href="social-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1057;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;">&#1043;&#1083;&#1072;&#1074;&#1072; 4, <i>&#1057;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;</i></a></span> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099;
&#1090;&#1072;&#1084;. &#1054; &#1095;&#1105;&#1084; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1089;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;, &#1090;&#1072;&#1082; &#1101;&#1090;&#1086; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099;
&#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081; &#1080;
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1085;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1086;&#1089;&#1090;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;
&#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
 </p><p>&#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1077; &#1079;&#1072; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1093;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1083;&#1102;&#1076;&#1080;
&#1085;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1082;&#1072;&#1082; &#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1077;&#1073;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1076;&#1085;&#1072; &#1080; &#1090;&#1072; &#1078;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1089;&#1085;&#1086;&#1074;&#1072;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1089; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1072;&#1084;&#1080;, &#1090;&#1086; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1083; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;, &#1085;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086;.
&#1042;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1090;&#1100; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1089;&#1085;&#1086;&#1074;&#1072; &#1086;&#1076;&#1085;&#1080; &#1080; &#1090;&#1077; &#1078;&#1077; &#1074;&#1077;&#1097;&#1080;, &#1080; &#1085;&#1077;
<span class="emphasis"><em>&#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077;</em></span> &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1090;&#1072;&#1083;&#1080; &#1080;&#1093; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;. &#1042;&#1099; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;
&#1074;&#1077;&#1090;&#1077;&#1088;&#1072;&#1085;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1090;&#1100;&#1089;&#1103;; &#1101;&#1090;&#1086; &#1085;&#1077;&#1079;&#1073;&#1077;&#1078;&#1085;&#1099;&#1081; &#1087;&#1086;&#1073;&#1086;&#1095;&#1085;&#1099;&#1081;
&#1101;&#1092;&#1092;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1090;&#1086;&#1082;&#1072; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1086;&#1074;.</p><p>&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;, &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; IRC-&#1082;&#1072;&#1085;&#1072;&#1083;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1084;&#1077;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1099; - &#1085;&#1077; &#1076;&#1083;&#1103; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;,
&#1085;&#1086; &#1076;&#1083;&#1103; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1063;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099; &#1089;&#1102;&#1076;&#1072;
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1077;, &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1076;&#1077;&#1084;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1099;&#1093; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, IRC-&#1082;&#1072;&#1085;&#1072;&#1083;
&#1076;&#1083;&#1103; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072;
&#1085;&#1077; &#1089;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; - &#1095;&#1072;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083; &#1055;&#1054; &#1080; &#1093;&#1086;&#1095;&#1077;&#1090;
&#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1080;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; (&#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1086;&#1085; &#1084;&#1086;&#1075;
&#1078;&#1076;&#1072;&#1090;&#1100;, &#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083; &#1073;&#1099; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1095;&#1090;&#1086;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074; &#1080;&#1090;&#1086;&#1075;&#1077; &#1086;&#1090;&#1085;&#1103;&#1083;&#1086; &#1073;&#1099; &#1091;
&#1085;&#1077;&#1075;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1093;&#1086;&#1090;&#1103; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1078;&#1076;&#1072;&#1090;&#1100; &#1076;&#1086;&#1083;&#1100;&#1096;&#1077;). &#1051;&#1102;&#1076;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077;
&#1091;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103; IRC-&#1082;&#1072;&#1085;&#1072;&#1083;&#1091;; &#1086;&#1085;&#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1089;&#1074;&#1086;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1080;
&#1080;&#1089;&#1095;&#1077;&#1079;&#1072;&#1102;&#1090;.</p><p>&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1090;&#1077;&#1084;&#1072; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1085;&#1072; &#1090;&#1077;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1097;&#1091;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099;
&#1085;&#1072; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; <span class="emphasis"><em>&#1087;&#1088;&#1103;&#1084;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089;</em></span>, &#1072; &#1085;&#1077; &#1085;&#1072; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;,
&#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1099;
&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072; &#1076;&#1086;&#1083;&#1075;&#1086;&#1089;&#1088;&#1086;&#1095;&#1085;&#1086;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1080; &#1076;&#1083;&#1103; &#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;
&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1080;&#1077;&#1084;&#1083;&#1077;&#1084;&#1099;. &#1042;&#1086;&#1090; &#1082;&#1072;&#1082; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1085;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1072;&#1085;&#1072;&#1083; &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084; (&#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1077;
&#1089; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1085;&#1085;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;
<a class="xref" href="irc.html" title="IRC / Real-Time Chat Systems">«IRC / Real-Time Chat Systems»</a><span> &#1074;
<a class="xref" href="technical-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;">&#1043;&#1083;&#1072;&#1074;&#1072; 3, <i>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</i></a></span>):</p><pre class="screen">
You are now talking on #linuxhelp

Topic for #linuxhelp is Please READ
http://www.catb.org/~esr/faqs/smart-questions.html &amp;&amp;
http://www.tldp.org/docs.html#howto BEFORE asking questions | Channel
rules are at http://www.nerdfest.org/lh_rules.html | Please consult
http://kerneltrap.org/node/view/799 before asking about upgrading to a
2.6.x kernel | memory read possible: http://tinyurl.com/4s6mc -&gt;
update to 2.6.8.1 or 2.4.27 | hash algo disaster: http://tinyurl.com/6w8rf
| reiser4 out
</pre><p>&#1042; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1093; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; "&#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;" - &#1101;&#1090;&#1086; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1081; "&#1087;&#1086;&#1076;&#1074;&#1072;&#1083;",
&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1081; &#1082; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1102;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090; &#1090;&#1091;&#1076;&#1072; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;
&#1087;&#1086; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1082;&#1077;/&#1086;&#1090;&#1082;&#1072;&#1079;&#1091; &#1080;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1102;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;
FAQ. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1075;&#1076;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1090;&#1072;&#1082;&#1080;&#1077; &#1074;&#1077;&#1097;&#1080;, &#1080;,
&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1090;&#1072;&#1082; &#1080; &#1077;&#1089;&#1090;&#1100; - &#1085;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074;&#1080;&#1076;&#1103;&#1090; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1083;&#1102;&#1076;&#1077;&#1081;,
&#1095;&#1077;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1080;. &#1053;&#1072; &#1072;&#1088;&#1093;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1095;&#1090;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093;
&#1084;&#1077;&#1089;&#1090;; &#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;
&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1084;&#1080;, &#1095;&#1090;&#1086; &#1089;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084; &#1080;&#1084;&#1077;&#1102;&#1090; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1074;&#1085;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;,
&#1095;&#1077;&#1084; &#1074; &#1085;&#1105;&#1084;.</p><p>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; Subversion &#1084;&#1099;
&#1076;&#1086;&#1073;&#1080;&#1083;&#1080;&#1089;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1091;&#1089;&#1087;&#1077;&#1093;&#1072; &#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;,
&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;
<a class="xref" href="bug-tracker.html#bug-filtering" title="Pre-Filtering the Bug Tracker">«Pre-Filtering the Bug Tracker»</a><span> &#1074;
<a class="xref" href="technical-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;">&#1043;&#1083;&#1072;&#1074;&#1072; 3, <i>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</i></a></span>.  &#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1086; &#1092;&#1080;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105;
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1085;&#1077;&#1086;&#1087;&#1099;&#1090;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;, &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100;,
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;&#1089;&#1100; &#1086;&#1073;&#1091;&#1095;&#1072;&#1090;&#1100; &#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; 500 &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1076;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;.
&#1054;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1085;&#1072;&#1096;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1083;
&#1090;&#1077;&#1088;&#1087;&#1077;&#1085;&#1080;&#1077; &#1080; &#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1080;&#1083; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1073;&#1077;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;
&#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;
&#1088;&#1077;&#1096;&#1080;&#1083;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1091;&#1078;&#1077; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; "&#1089;&#1086;&#1079;&#1088;&#1077;&#1083;". &#1054;&#1085; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1083; &#1085;&#1072;&#1084;
&#1087;&#1077;&#1088;&#1077;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1072;&#1103;
&#1095;&#1072;&#1089;&#1090;&#1100; - &#1087;&#1088;&#1077;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1089;&#1091;&#1076;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1093; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080;&#1083;&#1080; IRC-&#1082;&#1072;&#1085;&#1072;&#1083;&#1072;&#1093; &#1076;&#1086;
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085;&#1086; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1099;&#1084;&#1080;, &#1078;&#1080;&#1088;&#1085;&#1099;&#1084;&#1080; &#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1084;&#1080; &#1073;&#1091;&#1082;&#1074;&#1072;&#1084;&#1080; &#1085;&#1072; &#1103;&#1088;&#1082;&#1086;&#1084; &#1078;&#1105;&#1083;&#1090;&#1086;&#1084;
&#1092;&#1086;&#1085;&#1077; &#1080; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1074;&#1099;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;. &#1052;&#1099; &#1090;&#1072;&#1082; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; (&#1074;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1085;&#1072;
<a class="ulink" href="http://subversion.tigris.org/project_issues.html" target="_top">http://subversion.tigris.org/project_issues.html</a>), &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077;
&#1076;&#1086;&#1083;&#1103; &#1092;&#1080;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1086; &#1091;&#1087;&#1072;&#1083;&#1072; . &#1052;&#1099; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1080;&#1093; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084;,
&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, - &#1090;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;, - &#1085;&#1086; &#1076;&#1086;&#1083;&#1103; &#1091;&#1087;&#1072;&#1083;&#1072; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1076;&#1072;&#1078;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1083;&#1086;
&#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1055;&#1086;&#1083;&#1100;&#1079;&#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;
&#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1093;&#1083;&#1072;&#1084;&#1072;, &#1085;&#1086; &#1080; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1090;&#1077;, &#1082;&#1090;&#1086;
&#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1085;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1102; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1083;&#1091;&#1095;&#1096;&#1077;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1076;&#1091;&#1093;&#1072;, &#1080; &#1089;
&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1089;&#1090;&#1072;&#1085;&#1091;&#1090;&#1089;&#1103; &#1076;&#1086;&#1073;&#1088;&#1086;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1103; &#1085;&#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1091;&#1078;&#1077; &#1088;&#1077;&#1076;&#1082;&#1080;&#1077;
&#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1086; &#1091;&#1083;&#1091;&#1095;&#1096;&#1072;&#1077;&#1090; &#1082;&#1072;&#1082; &#1080;&#1084;&#1080;&#1076;&#1078; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1089;&#1080;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077;
&#1079;&#1076;&#1086;&#1088;&#1086;&#1074;&#1100;&#1077; &#1077;&#1075;&#1086; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1077;&#1074;.</p><p>&#1059;&#1088;&#1086;&#1082; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1083; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;. &#1052;&#1099;
&#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1083;&#1080; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080;&#1093; &#1090;&#1072;&#1084;, &#1075;&#1076;&#1077; &#1073;&#1099; &#1080;&#1093; &#1091;&#1074;&#1080;&#1076;&#1077;&#1083;&#1080; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1074; &#1085;&#1080;&#1093; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;
&#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1080; &#1087;&#1086;&#1076;&#1072;&#1090;&#1100; &#1080;&#1093; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1085;&#1077;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099;&#1084; &#1089; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1073;&#1099;&#1083;&#1086; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;,
&#1095;&#1090;&#1086; &#1089; &#1085;&#1080;&#1084;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081;.</p><p>&#1057;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; - &#1085;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1099; &#1086;&#1073;&#1099;&#1095;&#1072;&#1077;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
&#1053;&#1072;&#1076;&#1079;&#1086;&#1088; (&#1074; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077; &#1076;&#1088;&#1091;&#1078;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1103;, &#1072; &#1085;&#1077; &#1074; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077; &#1074; &#1085;&#1072;&#1088;&#1091;&#1095;&#1085;&#1080;&#1082;&#1080;-&#1080;-&#1074; &#1090;&#1102;&#1088;&#1100;&#1084;&#1091;)
&#1090;&#1086;&#1078;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;. &#1042;&#1089;&#1077; &#1080;&#1085;&#1089;&#1087;&#1077;&#1082;&#1094;&#1080;&#1080;, &#1076;&#1072;&#1078;&#1077; &#1080;&#1085;&#1089;&#1087;&#1077;&#1082;&#1094;&#1080;&#1080; commit'&#1086;&#1074;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; 
<a class="xref" href="setting-tone.html#code-review" title="&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1050;&#1086;&#1076;&#1072;">«&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1050;&#1086;&#1076;&#1072;»</a><span> &#1074;
<a class="xref" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;">&#1043;&#1083;&#1072;&#1074;&#1072; 2, <i>&#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</i></a></span>
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1086;&#1073;&#1079;&#1086;&#1088; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1077;&#1085;&#1080;&#1103; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;&#1084; &#1085;&#1086;&#1088;&#1084;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1081; &#1086; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;&#1093;.
</p><p>&#1045;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1079; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Subversion: &#1084;&#1099; &#1087;&#1088;&#1080;&#1096;&#1083;&#1080; &#1082; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1102; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;
"r12908" &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; "&#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1103; 12908 &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;". &#1055;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089; "r"
&#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1083;&#1077;&#1075;&#1082;&#1086; &#1085;&#1072;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085; &#1074;&#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1091; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1099;&#1089;&#1086;&#1090;&#1099; &#1094;&#1080;&#1092;&#1088;,
&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1083;&#1077;&#1075;&#1082;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1085;&#1080;&#1084;&#1080;.
&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1085;&#1072;&#1095;&#1085;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;
&#1077;&#1076;&#1080;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1086; &#1080; &#1089;&#1088;&#1072;&#1079;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1086;&#1095;&#1090;&#1072; &#1089; commit'&#1086;&#1084; &#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; log-message'&#1077;&#1084;:</p><pre class="screen">
------------------------------------------------------------------------
r12908 | qsimon | 2005-02-02 14:15:06 -0600 (Wed, 02 Feb 2005) | 4 lines

Patch from J. Random Contributor &lt;jrcontrib@gmail.com&gt;

* trunk/contrib/client-side/psvn/psvn.el:
  Fixed some typos from revision 12828.
------------------------------------------------------------------------
</pre><p>..., &#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1085;&#1089;&#1087;&#1077;&#1082;&#1094;&#1080;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; commit'&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1072; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;:
"&#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; 'r12828', &#1072; &#1085;&#1077; 'revision 12828', &#1082;&#1086;&#1075;&#1076;&#1072;
&#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;." &#1069;&#1090;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1077;&#1076;&#1072;&#1085;&#1090;&#1080;&#1079;&#1084;; &#1101;&#1090;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086; &#1082;&#1072;&#1082; &#1076;&#1083;&#1103;
&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;&#1072; (&#1087;&#1072;&#1088;&#1089;&#1080;&#1085;&#1075;&#1072;), &#1090;&#1072;&#1082; &#1080; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;.</p><p>&#1045;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1080;&#1093; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;, &#1080; &#1101;&#1090;&#1080;&#1084; &#1087;&#1088;&#1077;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090;
&#1085;&#1077;&#1091;&#1082;&#1083;&#1086;&#1085;&#1085;&#1086;, &#1090;&#1086; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1088;&#1086;&#1078;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1099;. &#1069;&#1090;&#1080;
&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1083;&#1102;&#1076;&#1103;&#1084; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1074;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1102;, &#1086;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1082;&#1072;&#1082;
"r12828", &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072;
&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1090;&#1088;&#1091;&#1076;&#1085;&#1077;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1082;&#1072;&#1082;
"revision 12828", &#1082;&#1072;&#1082; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1077;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1084;&#1077;&#1085;&#1077;&#1077; &#1090;&#1086;&#1095;&#1085;&#1072;&#1103; (&#1089;&#1083;&#1086;&#1074;&#1086; "revision" &#1073;&#1091;&#1076;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086;
&#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077;, &#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1094;&#1080;&#1092;&#1088; &#1073;&#1091;&#1076;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077;,
&#1090;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; "r12828" &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1086;&#1084;&#1077;&#1088; &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1080;). &#1040;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1077;
&#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1099; &#1082; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072;&#1084; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1084; FAQ (&#1089;&#1086;&#1074;&#1077;&#1090;: &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; URL &#1089;
&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1103;&#1082;&#1086;&#1088;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074;&#1086; &#1074;&#1088;&#1077;&#1079;&#1082;&#1077; <a class="xref" href="growth.html#html-named-anchors-and-ids" title="&#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; ID">&#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1103;&#1082;&#1086;&#1088;&#1103; &#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; ID</a>), &#1080;
&#1090;.&#1076;.</p><p>&#1051;&#1102;&#1076;&#1077;&#1081; &#1085;&#1072;&#1076;&#1086; &#1089;&#1090;&#1080;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086; &#1076;&#1072;&#1078;&#1077; &#1090;&#1086;&#1075;&#1076;&#1072;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1077;&#1095;&#1100; &#1080;&#1076;&#1077;&#1090; &#1086; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1103;&#1093;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086; &#1087;&#1088;&#1080;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1072;&#1082;&#1090;&#1085;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091;
&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077; &#1085;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080; &#1090;&#1077;&#1084;&#1091;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; URL &#1074; &#1072;&#1088;&#1093;&#1080;&#1074;&#1077; <span class="emphasis"><em>&#1080;</em></span> Message-ID
&#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084; &#1089;&#1074;&#1086;&#1102; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1082;&#1086;&#1087;&#1080;&#1102; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; (&#1083;&#1102;&#1076;&#1080; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072;
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090; offline-&#1082;&#1086;&#1087;&#1080;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1077; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;
&#1087;&#1091;&#1090;&#1077;&#1096;&#1077;&#1089;&#1090;&#1074;&#1080;&#1081;), &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077;
&#1080;&#1084;&#1077;&#1102;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1084;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080; &#1090;&#1077;&#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;,
&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091; &#1078;&#1077; &#1074;&#1077;&#1090;&#1082;&#1091;,
&#1080; &#1076;&#1072;&#1078;&#1077; &#1074; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1076;&#1077;&#1085;&#1100;.</p><p>&#1063;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1088;&#1072;&#1089;&#1090;&#1105;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1101;&#1090;&#1086;&#1090; &#1074;&#1080;&#1076; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1089;&#1090;&#1074;&#1072;.
&#1055;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1089;&#1090;&#1074;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1082;&#1091;&#1076;&#1072; &#1073;&#1099; &#1083;&#1102;&#1076;&#1080; &#1085;&#1077; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1083;&#1080;, &#1086;&#1085;&#1080; &#1074;&#1080;&#1076;&#1103;&#1090; &#1086;&#1076;&#1085;&#1080; &#1080; &#1090;&#1077; &#1078;&#1077;
&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1080; &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1084; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1069;&#1090;&#1086;,
&#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1085;&#1080; &#1074;&#1099;&#1085;&#1091;&#1078;&#1076;&#1077;&#1085;&#1099; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;.
&#1041;&#1088;&#1077;&#1084;&#1103; &#1080;&#1084;&#1077;&#1090;&#1100; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1085;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1073;&#1088;&#1077;&#1084;&#1103; &#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;
&#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1075;&#1076;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1101;&#1090;&#1080;&#1093; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1079;&#1072;&#1076;&#1072;&#1105;&#1090;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1089; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1072;&#1076;&#1086; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1087;&#1091;&#1090;&#1105;&#1084; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103;
&#1087;&#1083;&#1086;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1102;&#1073;&#1086;&#1081; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081;
&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1084;&#1086;&#1075; &#1085;&#1072;&#1081;&#1090;&#1080; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1077;&#1084;&#1091; &#1085;&#1072;&#1076;&#1086;, &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1103; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="difficult-people.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="bug-tracker-usage.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1058;&#1103;&#1078;&#1105;&#1083;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1053;&#1077;&#1090; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084; &#1074; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</td></tr></table></div></body></html>
