<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="prev" href="disclaimer.html" title="&#1044;&#1080;&#1089;&#1082;&#1083;&#1077;&#1081;&#1084;&#1077;&#1088;"><link rel="next" href="today.html" title="&#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="disclaimer.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="today.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</h2></div></div></div><div class="toc"><p><b>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</b></p><dl><dt><span class="sect1"><a href="introduction.html#history">&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</a></span></dt><dd><dl><dt><span class="sect2"><a href="introduction.html#propertization">&#1042;&#1086;&#1089;&#1093;&#1086;&#1076; &#1055;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;</a></span></dt><dd><dl><dt><span class="sect3"><a href="introduction.html#history-conscious-resistance">&#1054;&#1089;&#1086;&#1079;&#1085;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a></span></dt><dt><span class="sect3"><a href="introduction.html#history-accidental-resistance">&#1057;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a></span></dt></dl></dd><dt><span class="sect2"><a href="introduction.html#free-vs-open-source">"&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077;" &#1055;&#1088;&#1086;&#1090;&#1080;&#1074; "&#1057; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1050;&#1086;&#1076;&#1086;&#1084;"</a></span></dt></dl></dd><dt><span class="sect1"><a href="today.html">&#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;.</p><p>&#1052;&#1099; &#1085;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083;&#1099;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;
&#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1090; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1086;&#1073;&#1097;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 
&#1074;&#1077;&#1083;&#1080;&#1082;&#1086;<sup>[<a name="idp4935952" href="#ftn.idp4935952" class="footnote">2</a>]</sup>, &#1095;&#1090;&#1086; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; 
&#1085;&#1080;&#1079;&#1082;&#1080;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1074;&#1099;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1072;&#1084; &#1077;&#1089;&#1090;&#1100; &#1085;&#1072; &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;.
&#1052;&#1099; &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083;&#1099; &#1077;&#1097;&#1077; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083; &#1101;&#1090;&#1086; &#1085;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;. &#1053;&#1077;&#1083;&#1100;&#1079;&#1103;
&#1074;&#1099;&#1095;&#1083;&#1077;&#1085;&#1080;&#1090;&#1100; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1074;&#1085;&#1077;&#1079;&#1072;&#1087;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1078;&#1080;&#1079;&#1085;&#1077;&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099;&#1084;.
&#1051;&#1102;&#1076;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090; &#1087;&#1086;&#1090;&#1080;&#1093;&#1086;&#1085;&#1100;&#1082;&#1091; &#1088;&#1072;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;, &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1102;&#1090; &#1085;&#1072;&#1076; &#1085;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;.
&#1052;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1089;&#1090;&#1091;&#1087;&#1080;&#1090;&#1100; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1085;&#1086; &#1086;&#1085; &#1077;&#1097;&#1077;
&#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;. &#1053;&#1077;&#1090; &#1076;&#1072;&#1078;&#1077; &#1095;&#1077;&#1090;&#1082;&#1086;&#1075;&#1086; 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1090;&#1091;&#1093;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1083;&#1080; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1091;&#1075;&#1072;&#1089;&#1096;&#1080;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1085;&#1072;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1096;&#1077;&#1089;&#1090;&#1080; &#1084;&#1077;&#1089;&#1103;&#1094;&#1077;&#1074;? &#1048;&#1083;&#1080; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;
&#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1083;&#1086; &#1088;&#1072;&#1089;&#1090;&#1080;,&#1085;&#1077; &#1091;&#1089;&#1087;&#1077;&#1074; &#1087;&#1077;&#1088;&#1077;&#1074;&#1072;&#1083;&#1080;&#1090;&#1100; &#1079;&#1072; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;? &#1063;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;
&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1079;&#1072;&#1073;&#1088;&#1086;&#1089;&#1080;&#1083;&#1080; &#1077;&#1075;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1101;&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1085;&#1080; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;? &#1063;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1088;&#1077;&#1096;&#1080;&#1083;&#1080; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099;
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1074;&#1083;&#1086;&#1078;&#1080;&#1074; &#1074; &#1085;&#1077;&#1075;&#1086; &#1087;&#1083;&#1086;&#1076;&#1099; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1075;&#1086; &#1090;&#1088;&#1091;&#1076;&#1072;? &#1048;&#1089;&#1095;&#1077;&#1079; &#1083;&#1080; &#1087;&#1088;&#1077;&#1078;&#1085;&#1080;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072;&#1089;&#1086;&#1074;&#1089;&#1077;&#1084;
&#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1083; &#1084;&#1077;&#1089;&#1090;&#1086; &#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;?
</p><p>&#1048;&#1079;-&#1079;&#1072; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1090;&#1086;&#1095;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083;&#1086;&#1074;.
&#1053;&#1086; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1083;&#1077;&#1090;&#1085;&#1080;&#1077; &#1085;&#1072;&#1073;&#1083;&#1102;&#1076;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072; &#1084;&#1080;&#1088;&#1086;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1085;&#1077;&#1093;&#1080;&#1090;&#1088;&#1099;&#1081; &#1088;&#1072;&#1089;&#1095;&#1077;&#1090; &#1087;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; SourceForge.net,
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1082; &#1043;&#1091;&#1075;&#1083;&#1091; -  &#1074;&#1089;&#1077; &#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1080; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1091;: &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083;&#1086;&#1074;
&#1095;&#1088;&#1077;&#1079;&#1074;&#1099;&#1095;&#1072;&#1081;&#1085;&#1086; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086; &#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1082;&#1086;&#1083;&#1086; 90&#8211;95 &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1069;&#1090;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1077;&#1097;&#1077; &#1074;&#1099;&#1096;&#1077; &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1091;&#1095;&#1090;&#1077;&#1084;
&#1074;&#1099;&#1078;&#1080;&#1074;&#1096;&#1080;&#1077;, &#1085;&#1086; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;: &#1090;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1088;&#1086;&#1076;&#1077; &#1073;&#1099; &#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1103;&#1090; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1081; &#1082;&#1086;&#1076;, &#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;
&#1085;&#1077; &#1089;&#1072;&#1084;&#1091;&#1102; &#1073;&#1083;&#1072;&#1075;&#1086;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1091;&#1102; &#1089;&#1088;&#1077;&#1076;&#1091; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1080;&#1083;&#1080; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086; &#1101;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1102;&#1090;.
</p><p>&#1069;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1072; &#1090;&#1086;&#1084;&#1091; &#1082;&#1072;&#1082; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083;&#1072;. &#1054;&#1085;&#1072; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1080;, &#1085;&#1086;
 &#1080; <span class="emphasis"><em>&#1087;&#1083;&#1086;&#1093;&#1080;&#1077;</em></span>, &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1090;&#1100; &#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1085;&#1072; &#1088;&#1072;&#1085;&#1085;&#1077;&#1084;
&#1101;&#1090;&#1072;&#1087;&#1077; &#1080;&#1093; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1071; &#1085;&#1072;&#1076;&#1077;&#1102;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1088;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080;, &#1074;&#1099; &#1086;&#1073;&#1079;&#1072;&#1074;&#1077;&#1076;&#1077;&#1090;&#1077;&#1089;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1072;&#1088;&#1089;&#1077;&#1085;&#1072;&#1083;&#1086;&#1084;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1090; &#1074;&#1072;&#1084; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077; &#1085;&#1072;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; &#1085;&#1072; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1099;&#1077; &#1075;&#1088;&#1072;&#1073;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1055;&#1054;, &#1085;&#1086; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1081; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084;. &#1059;&#1089;&#1087;&#1077;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; -  &#1101;&#1090;&#1086; &#1085;&#1077; &#1080;&#1075;&#1088;&#1072;
&#1089; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1091;&#1084;&#1084;&#1086;&#1081;, &#1080; &#1101;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; &#1074;&#1086;&#1074;&#1089;&#1077; &#1085;&#1077; &#1086; &#1090;&#1086;&#1084; &#1082;&#1072;&#1082; &#1074;&#1099;&#1080;&#1075;&#1088;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1086;&#1073;&#1086;&#1075;&#1085;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1074;&#1072;&#1078;&#1085;&#1086;&#1081;
&#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1088;&#1077;&#1087;&#1082;&#1086;&#1077; &#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080;, &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1084;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;.
&#1042; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1089;&#1095;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1073;&#1083;&#1072;&#1075;&#1086;&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1077; &#1084;&#1080;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1086;&#1085;&#1076;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;.   
</p><p>
&#1051;&#1077;&#1075;&#1082;&#1086; &#1087;&#1086;&#1076;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1089;&#1082;&#1091;&#1096;&#1077;&#1085;&#1080;&#1102; &#1080; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1099; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1090;&#1077;&#1078;&#1077;, &#1095;&#1090;&#1086; &#1080; &#1091; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;. 
&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1087;&#1088;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1079;&#1072;&#1074;&#1099;&#1096;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1088;&#1072;&#1089;&#1087;&#1083;&#1099;&#1074;&#1095;&#1072;&#1090;&#1099;&#1084;&#1080; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;,
&#1085;&#1077;&#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;&#1084;&#1080;, &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1081; &#1092;&#1072;&#1079;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;
&#1076;&#1072;&#1074;&#1085;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1084;&#1080; &#1074; &#1080;&#1085;&#1076;&#1091;&#1089;&#1090;&#1088;&#1080;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1055;&#1054;. &#1053;&#1072; &#1101;&#1090;&#1080; &#1090;&#1077;&#1084;&#1099; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1075;&#1086;&#1088;&#1099; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1099;, &#1080; &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1082;&#1085;&#1080;&#1075;&#1077;
&#1103; &#1087;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1102;&#1089;&#1100; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103; &#1091;&#1078;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1103; &#1093;&#1086;&#1095;&#1091; &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1099;&#1077;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1087;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; 
&#1089;&#1072;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072; &#1084;&#1077;&#1083;&#1100;, &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1090;&#1086;&#1084;&#1091; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077;&#1091;&#1084;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; (&#1080;&#1083;&#1080; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1086;&#1074;) &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;
&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1093;&#1086;&#1090;&#1103; &#1082; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1084; &#1087;&#1088;&#1080;&#1089;&#1091;&#1097;&#1080;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1055;&#1054; 
&#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;. 
</p><p>&#1054;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1086;&#1094;&#1077;&#1085;&#1082;&#1072; &#1076;&#1086;&#1089;&#1090;&#1086;&#1080;&#1085;&#1089;&#1090;&#1074; &#1080;&#1076;&#1077;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054;.
&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1085;&#1077; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1088;&#1076;&#1099; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1085;&#1077;&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1085;&#1086; &#1080;&#1079;&#1074;&#1086;&#1083;&#1103;&#1090; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;
&#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; &#1074;&#1072;&#1096; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;. &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1085;&#1077; &#1088;&#1077;&#1096;&#1080;&#1090; &#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;.
&#1050;&#1072;&#1082; &#1088;&#1072;&#1079; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089;&#1090;&#1080; &#1094;&#1077;&#1083;&#1099;&#1081; &#1074;&#1086;&#1088;&#1086;&#1093; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1080; <span class="emphasis"><em>&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100;</em></span>
&#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1088;&#1086;&#1095;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1086;&#1081; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;.
&#1056;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1088;&#1077;&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085; &#1073;&#1099;&#1083; &#1087;&#1086;&#1085;&#1103;&#1090;&#1077;&#1085; &#1085;&#1086;&#1074;&#1099;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;,
&#1085;&#1077;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099;&#1084; &#1089; &#1074;&#1072;&#1096;&#1080;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1077;&#1073;-&#1089;&#1072;&#1081;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; 
&#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;,&#1072; &#1079;&#1072;&#1095;&#1072;&#1089;&#1090;&#1091;&#1102; &#1077;&#1097;&#1077; &#1080; &#1074;&#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1074;&#1079;&#1103;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1086; - &#1091;&#1081;&#1084;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.
&#1048; &#1077;&#1089;&#1083;&#1080; &#1074;&#1089;&#1105;-&#1090;&#1072;&#1082;&#1080; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;, &#1082; &#1101;&#1090;&#1086;&#1084;&#1091; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1077;&#1097;&#1077; &#1080; &#1073;&#1088;&#1077;&#1084;&#1103; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1090;&#1100; &#1085;&#1072;
&#1082;&#1091;&#1095;&#1091; &#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1086;&#1090; &#1080;&#1093; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1093;&#1086;&#1090;&#1100; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1090;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1072;.
&#1050;&#1072;&#1082; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083; &#1044;&#1078;&#1077;&#1081;&#1084;&#1080; &#1047;&#1072;&#1074;&#1080;&#1085;&#1089;&#1082;&#1080; &#1086; &#1088;&#1072;&#1085;&#1085;&#1080;&#1093; &#1090;&#1088;&#1091;&#1076;&#1085;&#1099;&#1093; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1072;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Mozilla:
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1050;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1080; &#1074;&#1087;&#1088;&#1072;&#1074;&#1076;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;, &#1085;&#1086; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1077;&#1082;&#1072;&#1088;&#1089;&#1090;&#1074;&#1086;&#1084; &#1086;&#1090; &#1074;&#1089;&#1077;&#1093; &#1073;&#1086;&#1083;&#1077;&#1079;&#1085;&#1077;&#1081;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1084;&#1086;&#1077;&#1081; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1077;&#1088;&#1077;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1083;&#1080;&#1096;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1090;&#1072;&#1082; &#1074;&#1079;&#1103;&#1090;&#1100; &#1079;&#1072;&#1075;&#1080;&#1073;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1087;&#1086;&#1089;&#1099;&#1087;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074;&#1086;&#1083;&#1096;&#1077;&#1073;&#1085;&#1086;&#1081; &#1087;&#1099;&#1083;&#1100;&#1102; "&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054;" &#1080; &#1087;&#1086; &#1074;&#1086;&#1083;&#1096;&#1077;&#1073;&#1089;&#1090;&#1074;&#1091; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1055;&#1054; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;. &#1056;&#1077;&#1096;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1085;&#1077; &#1090;&#1072;&#1082; &#1091;&#1078; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;.  </em></span></p><p>(from <span class="bold"><strong><a class="ulink" href="http://www.jwz.org/gruntle/nomo.html" target="_top">http://www.jwz.org/gruntle/nomo.html</a></strong></span>)</p></blockquote></div><p>
&#1045;&#1097;&#1077; &#1086;&#1076;&#1085;&#1072; &#1087;&#1086;&#1093;&#1086;&#1078;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1087;&#1088;&#1077;&#1085;&#1077;&#1073;&#1088;&#1077;&#1075;&#1072;&#1102;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;
&#1080; &#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081; &#1055;&#1054;, &#1085;&#1072;&#1080;&#1074;&#1085;&#1086; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1080; &#1074;&#1077;&#1097;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072; &#1087;&#1086;&#1090;&#1086;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1076;&#1090;&#1080; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1093;&#1086;&#1076;&#1086;&#1084;.
&#1055;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1081; &#1082;&#1088;&#1091;&#1075; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1089;&#1083;&#1091;&#1078;&#1072;&#1097;&#1080;&#1093; &#1086;&#1076;&#1085;&#1086;&#1081; &#1094;&#1077;&#1083;&#1080; - &#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100;  
&#1074;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;.
&#1057;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1080; 
&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1074; &#1089;&#1072;&#1081;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1076;&#1083;&#1103; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1086;&#1074;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074;
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1099; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1090;.&#1076;.
&#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099;, &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090; &#1101;&#1090;&#1091; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1074;&#1090;&#1086;&#1088;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080; &#1089;&#1090;&#1072;&#1074;&#1103;&#1090; &#1077;&#1105; &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072;.
&#1053;&#1072; &#1101;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;. &#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1101;&#1090;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1088;&#1090;&#1099;&#1096;&#1082;&#1080;&#1085;&#1099;&#1084; &#1090;&#1088;&#1091;&#1076;&#1086;&#1084;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; 
&#1077;&#1105; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1079;&#1072;&#1084;&#1077;&#1090;&#1077;&#1085; &#1083;&#1080;&#1096;&#1100; &#1090;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1089; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1080; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;. 
&#1042; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074;, &#1083;&#1102;&#1076;&#1103;&#1084; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1074;&#1096;&#1080;&#1084; &#1082;&#1086;&#1076; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1097;&#1080;&#1082;&#1080;.
&#1054;&#1085;&#1080; &#1080; &#1090;&#1072;&#1082; &#1079;&#1085;&#1072;&#1102;&#1090; &#1082;&#1072;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;, &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1055;&#1054;.
&#1042;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1091;&#1084;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1075;&#1088;&#1072;&#1084;&#1086;&#1090;&#1085;&#1086; &#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; &#1055;&#1054; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;
&#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090; &#1090;&#1077;&#1093;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1099; &#1076;&#1083;&#1103; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072;.
&#1051;&#1102;&#1076;&#1080; &#1089;&#1082;&#1083;&#1086;&#1085;&#1085;&#1099; &#1091;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1090;&#1086;&#1084;&#1091;, &#1074; &#1095;&#1077;&#1084; &#1086;&#1085;&#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090;,
&#1095;&#1090;&#1086; &#1087;&#1086;&#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1074; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1080;&#1084; &#1084;&#1077;&#1085;&#1077;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;, &#1086;&#1085;&#1080; &#1087;&#1086;&#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;.

&#1042; &#1075;&#1083;&#1072;&#1074;&#1077; 
<a class="xref" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;">&#1043;&#1083;&#1072;&#1074;&#1072; 2, <i>&#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</i></a>, &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086; &#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1055;&#1054; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1074; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1072;&#1093;
&#1089; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. 

</p><p>
&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; &#1079;&#1072;&#1073;&#1083;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084; &#1095;&#1090;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1083;&#1080;&#1073;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086;, &#1080;&#1083;&#1080;
&#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1084;&#1091; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1090; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077;
&#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1092;&#1080;&#1088;&#1084;&#1099;. &#1055;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1074;&#1080;&#1076;&#1085;&#1099;, &#1085;&#1086; &#1074; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093;, &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;
&#1074; &#1090;&#1086;&#1081; &#1080;&#1083;&#1080; &#1080;&#1085;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072; &#1089;&#1094;&#1077;&#1085;&#1086;&#1081;.
&#1044;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1089;&#1090;&#1080; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100; &#1087;&#1086;&#1095;&#1077;&#1084;&#1091;.
&#1058;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;&#8212;&#1087;&#1077;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1076;&#1091;&#1084;&#1094;&#1077;&#1074;
&#8212;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1085;&#1077;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099;&#1093; &#1083;&#1080;&#1095;&#1085;&#1086; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;,
&#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1087;&#1088;&#1077;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1094;&#1077;&#1083;&#1080; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1085;&#1072;&#1076; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;.
&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1077;&#1073;&#1077; &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1077;&#1090; &#1089; &#1090;&#1072;&#1082;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1081; &#1083;&#1102;&#1076;&#1077;&#1081; <span class="emphasis"><em>&#1073;&#1077;&#1079;&#1086; &#1074;&#1089;&#1103;&#1082;&#1086;&#1075;&#1086;</em></span> &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072;.
&#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103; &#1095;&#1091;&#1076;&#1072;, &#1086;&#1085;&#1080; &#1087;&#1086;&#1090;&#1077;&#1088;&#1087;&#1103;&#1090; &#1082;&#1088;&#1072;&#1093; &#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1073;&#1088;&#1077;&#1076;&#1091;&#1090;&#1089;&#1103; &#1082;&#1090;&#1086; &#1082;&#1091;&#1076;&#1072; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;. 
&#1044;&#1077;&#1083;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1077;&#1089;&#1090;&#1080;&#1089;&#1100; &#1089;&#1072;&#1084;&#1080; &#1089;&#1086;&#1073;&#1086;&#1081;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1099; &#1085;&#1072;&#1084; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1080; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100;.
&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1077;&#1075;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086;, &#1095;&#1072;&#1089;&#1090;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1084;&#1103;&#1075;&#1082;&#1086; &#1080; &#1085;&#1077; &#1085;&#1072; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1085;&#1099;&#1093; &#1090;&#1086;&#1085;&#1072;&#1093;. 
&#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1091;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; - &#1101;&#1090;&#1086; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1072;&#1103; &#1074;&#1077;&#1088;&#1072; &#1074; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1091;&#1090;&#1100;
&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077;, &#1095;&#1077;&#1084; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1094;&#1077;&#1083;&#1100;&#1102; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;
&#1101;&#1090;&#1086;&#1081; &#1074;&#1077;&#1088;&#1099; &#1074; &#1083;&#1102;&#1076;&#1103;&#1093;, &#1087;&#1091;&#1090;&#1077;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1086;&#1074; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1083;&#1077;&#1078;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; <span class="emphasis"><em>&#1085;&#1077;</em></span>
&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080;&#1079;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1086;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1080;&#1079;-&#1079;&#1072; &#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1072;, &#1080; &#1087;&#1091;&#1090;&#1077;&#1084; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;
&#1074; &#1090;&#1072;&#1082;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1082;&#1091;&#1076;&#1072; &#1093;&#1086;&#1095;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1089;&#1085;&#1086;&#1074;&#1072;. &#1050;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103;
&#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1076;&#1072;&#1083;&#1077;&#1077; &#1074; &#1082;&#1085;&#1080;&#1075;&#1077;.
</p><p>
&#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1073;&#1097;&#1072;&#1103; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1082;&#1072;&#1082; "&#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;".&#1051;&#1077;&#1090; &#1076;&#1077;&#1089;&#1103;&#1090;&#1100; &#1085;&#1072;&#1079;&#1072;&#1076; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1103;&#1090;&#1100;, &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1086; &#1074;&#1089;&#1077;&#1084;&#1080;&#1088;&#1085;&#1086;&#1081; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; 
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1085;&#1077; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100;. &#1055;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1072;&#1103; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1080;, &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1077;&#1076;&#1080;&#1085;&#1086;&#1081; &#1080;
&#1084;&#1086;&#1085;&#1086;&#1083;&#1080;&#1090;&#1085;&#1086;&#1081; (&#1087;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1086;&#1085;&#1072; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1078;&#1077; &#1089;&#1082;&#1083;&#1086;&#1085;&#1085;&#1072; &#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084; &#1088;&#1072;&#1079;&#1085;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1103;&#1084; &#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1103;&#1084; &#1082;&#1072;&#1082; &#1080; &#1088;&#1077;&#1075;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1099;),
&#1086;&#1085;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1073;&#1097;&#1080;&#1081; &#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1099;&#1081; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;. &#1057;&#1072;&#1084;&#1099;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1090; &#1074;&#1089;&#1077;&#1084;&#1080; &#1080;&#1083;&#1080; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;
&#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;. &#1054;&#1085;&#1080; &#1074;&#1086;&#1079;&#1085;&#1072;&#1075;&#1088;&#1072;&#1078;&#1076;&#1072;&#1102;&#1090; &#1079;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080; &#1085;&#1072;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;;
&#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1072;&#1090;&#1084;&#1086;&#1089;&#1092;&#1077;&#1088;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1086;&#1097;&#1088;&#1103;&#1077;&#1090; &#1085;&#1077;&#1079;&#1072;&#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077;, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1074; &#1091;&#1097;&#1077;&#1088;&#1073;
&#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080;; &#1091; &#1085;&#1080;&#1093; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1080; &#1080; &#1074;&#1077;&#1078;&#1083;&#1080;&#1074;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1084;&#1086;&#1075;&#1091;&#1090; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1099;&#1093; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093;. &#1057;&#1072;&#1084;&#1086;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1083;&#1102;&#1076;&#1080;, &#1076;&#1086;&#1083;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;,
&#1087;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1101;&#1090;&#1080; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1084;&#1077;&#1078;&#1076;&#1091;
&#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084; &#1077;&#1076;&#1080;&#1085;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1079; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;.
&#1053;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;, &#1093;&#1086;&#1090;&#1103; &#1080; &#1085;&#1077; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;, &#1086;&#1090;&#1082;&#1083;&#1086;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; 
&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1086;&#1090; &#1101;&#1090;&#1080;&#1093; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1086;&#1074;, &#1080; &#1079;&#1072;&#1095;&#1072;&#1089;&#1090;&#1091;&#1102; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; 
&#1077;&#1076;&#1080;&#1085;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;.
&#1069;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1091;&#1093;&#1091;&#1076;&#1096;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1080;&#1079;-&#1079;&#1072; &#1095;&#1090;&#1086;
&#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080; &#1085;&#1077; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1090; &#1086;&#1073;&#1097;&#1080;&#1084;&#1080; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1085;&#1099;&#1084;&#1080; &#1094;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1080;
&#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;.
</p><p>
&#1069;&#1090;&#1072; &#1082;&#1085;&#1080;&#1075;&#1072; - &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;, &#1072; &#1085;&#1077; &#1082;&#1091;&#1088;&#1089; &#1072;&#1085;&#1090;&#1088;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1080;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;.
&#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1080;&#1089;&#1090;&#1086;&#1082;&#1086;&#1074; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1099; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1076;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1089;&#1086;&#1074;&#1077;&#1090;. &#1063;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1101;&#1090;&#1091; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1091;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1091;&#1090;&#1077;&#1096;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086; &#1084;&#1080;&#1088;&#1091; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;
&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1073;&#1077;&#1079; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1103; &#1076;&#1083;&#1103; &#1089;&#1077;&#1073;&#1103; &#1084;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103; &#1074; &#1086;&#1073;&#1099;&#1095;&#1072;&#1103;&#1093; &#1080; &#1076;&#1080;&#1072;&#1083;&#1077;&#1082;&#1090;&#1077;,
&#1080; &#1085;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1085;&#1080;&#1093; &#1073;&#1099;&#1090;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1080; &#1073;&#1077;&#1079; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1074;&#1090;&#1103;&#1075;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;. &#1063;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1101;&#1090;&#1091; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1091; &#1085;&#1077;
&#1091;&#1089;&#1074;&#1086;&#1080;&#1083;, &#1085;&#1072;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;, &#1085;&#1072;&#1081;&#1076;&#1077;&#1090; &#1076;&#1083;&#1103; &#1089;&#1077;&#1073;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084; &#1080; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084;
&#1089;&#1102;&#1088;&#1087;&#1088;&#1080;&#1079;&#1086;&#1074;.
&#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1055;&#1054; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1088;&#1072;&#1089;&#1090;&#1077;&#1090;
&#1089;&#1082;&#1072;&#1095;&#1082;&#1072;&#1084;&#1080; &#1080; &#1088;&#1099;&#1074;&#1082;&#1072;&#1084;&#1080;, &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; &#1082; &#1101;&#1090;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080;&#8212;
&#1087;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1084;&#1091; &#1089;&#1095;&#1077;&#1090;&#1091; &#1101;&#1090;&#1086; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1089;&#1091;&#1097;&#1077; &#1085;&#1077;&#1076;&#1072;&#1074;&#1085;&#1080;&#1084; &#1084;&#1080;&#1075;&#1088;&#1072;&#1085;&#1090;&#1072;&#1084;, &#1080; &#1086;&#1085;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1091; &#1085;&#1080;&#1093; &#1085;&#1072;
&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1077; &#1089;&#1077;&#1073;&#1103; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1085;&#1080;&#1093;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1087;&#1086;&#1089;&#1083;&#1091;&#1078;&#1080;&#1090;
&#1074;&#1072;&#1084; &#1091;&#1088;&#1086;&#1082;&#1086;&#1084; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090; &#1082; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1080;&#1084; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1074;&#1089;&#1090;&#1088;&#1077;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1079;&#1078;&#1077;, 
&#1082;&#1072;&#1082; &#1074; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1077;, &#1090;&#1072;&#1082; &#1080; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077;. (&#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1078;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1085;&#1072;&#1076; 
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1086;&#1083;&#1075;&#1086;, &#1074;&#1072;&#1084; &#1091;&#1078;&#1077; &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1103;&#1082;&#1072; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;,
&#1080; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;.)
</p></div><div class="sect1" title="&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>&#1048;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;</h2></div></div></div><p>
&#1054;&#1073;&#1084;&#1077;&#1085; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1078;&#1077; &#1076;&#1086;&#1083;&#1075;&#1086; &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;
&#1089;&#1072;&#1084;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1053;&#1072; &#1079;&#1072;&#1088;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080; &#1089;&#1095;&#1080;&#1090;&#1072;&#1083;&#1080;, &#1095;&#1090;&#1086; 
&#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1099; &#1083;&#1080;&#1096;&#1100; &#1080;&#1079; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093;
&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1080; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1083;&#1080;&#1089;&#1100; &#1082; &#1055;&#1054; &#1082;&#1072;&#1082; &#1082; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089; &#1072;&#1082;&#1090;&#1080;&#1074;&#1091;. 
&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1090;&#1077;&#1093; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1084;&#1072;&#1096;&#1080;&#1085; &#1073;&#1099;&#1083;&#1080; &#1091;&#1095;&#1077;&#1085;&#1099;&#1084;&#1080; &#1080;&#1083;&#1080; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1085;&#1090;&#1072;&#1084;&#1080;. &#1054;&#1085;&#1080; &#1089;&#1072;&#1084;&#1080; 
&#1084;&#1086;&#1075;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1080;&#1083;&#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100;, &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1084;&#1080;,
&#1055;&#1054;. &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1083;&#1080;
&#1089;&#1074;&#1086;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1077; &#1087;&#1072;&#1090;&#1095;&#1080; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1080;&#1079;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1077;&#1083;&#1102;, &#1085;&#1086; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; 
&#1074;&#1083;&#1072;&#1076;&#1077;&#1083;&#1100;&#1094;&#1072;&#1084; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;. &#1050;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080; &#1080;&#1079;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1077;&#1083;&#1080; &#1086;&#1095;&#1077;&#1085;&#1100; &#1095;&#1072;&#1089;&#1090;&#1086;
&#1076;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1083;&#1080; &#1101;&#1090;&#1086; &#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1086;&#1086;&#1097;&#1088;&#1103;&#1083;&#1080;: &#1087;&#1086; &#1080;&#1093; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102;, &#1091;&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1077;
&#1085;&#1072;&#1076; &#1080;&#1093; &#1055;&#1054;, &#1073;&#1077;&#1079; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1099; &#1095;&#1100;&#1080; &#1080; &#1086;&#1090;&#1082;&#1091;&#1076;&#1072;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1084;&#1072;&#1096;&#1080;&#1085;&#1091; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1086;&#1082;&#1091;&#1087;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;.
</p><p>
&#1061;&#1086;&#1090;&#1103; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1085;&#1085;&#1080;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; &#1080; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1091; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1085; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1076;&#1074;&#1091;&#1084; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;.
&#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1085;&#1072; &#1090;&#1086;&#1090; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1086; &#1087;&#1086;&#1095;&#1090;&#1080; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081;
&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1089;&#1088;&#1077;&#1076;&#1080; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#8212;&#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;
&#1088;&#1072;&#1089;&#1094;&#1074;&#1077;&#1090;&#1072; &#1080;&#1085;&#1085;&#1086;&#1074;&#1072;&#1094;&#1080;&#1081; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1084; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1077;, &#1085;&#1086; &#1088;&#1072;&#1079;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1077;
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1099;&#1093; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077;&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086; 
&#1089;&#1086; &#1074;&#1089;&#1077;&#1084; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1084;&#1072;&#1096;&#1080;&#1085;&#1099;
&#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1089;&#1090;&#1072;&#1088;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077;
&#1080;&#1083;&#1080; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1077; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088; (&#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1072;&#1082; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; 
&#1103;&#1079;&#1099;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1080;&#1093; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1077;, &#1074; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1095;&#1090;&#1086; &#1080;&#1093; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1085;&#1072; &#1083;&#1102;&#1073;&#1091;&#1102; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1091;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080;&#1084; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;). &#1048;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1083;&#1080;&#1089;&#1100; &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1074;&#1080;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;,
&#1085;&#1072;&#1082;&#1086;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1083;&#1086; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080;&#1089;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;
&#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1080; &#1077;&#1075;&#1086; &#1082;&#1086;&#1083;&#1083;&#1077;&#1075;. &#1057;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1072;&#1093; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;
&#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;-&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1096;&#1080;&#1088;&#1077;.</p><p>
&#1042;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1072;. &#1048; &#1093;&#1086;&#1090;&#1103; &#1074; &#1090;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1072; &#1073;&#1099;&#1083;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;
&#1102;&#1088;&#1080;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1095;&#1077;&#1084; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;, 
&#1073;&#1099;&#1083;&#1086; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093;: &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1090;&#1086;&#1075;&#1086;
&#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1073;&#1099;&#1083;&#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084;&#1080; &#1080; &#1075;&#1088;&#1086;&#1084;&#1086;&#1079;&#1076;&#1082;&#1080;&#1084;&#1080;.
&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1077;, &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1077;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080; &#1076;&#1083;&#1103; 
&#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080;
&#1080;&#1083;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1103;. &#1053;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1088;&#1077;&#1075;&#1088;&#1072;&#1076;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1077;&#1086;&#1076;&#1086;&#1083;&#1077;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1093;&#1086;&#1090;&#1077;&#1083; 
&#1086;&#1073;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1089; &#1082;&#1077;&#1084;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;, &#1074;&#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, 
&#1075;&#1076;&#1077; &#1086;&#1085;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100;. &#1069;&#1090;&#1080; &#1087;&#1088;&#1077;&#1075;&#1088;&#1072;&#1076;&#1099; <span class="emphasis"><em>&#1087;&#1088;&#1077;&#1086;&#1076;&#1086;&#1083;&#1077;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100;</em></span> &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;.
&#1048;&#1085;&#1086;&#1075;&#1076;&#1072;, &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1074;&#1089;&#1090;&#1091;&#1087;&#1072;&#1083;&#1080; &#1074; &#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;,
&#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1103; &#1076;&#1080;&#1089;&#1082;&#1080; &#1080;&#1083;&#1080; &#1084;&#1072;&#1075;&#1085;&#1080;&#1090;&#1085;&#1099;&#1077; &#1083;&#1077;&#1085;&#1090;&#1099; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1086;&#1081;, &#1072; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1089;&#1072;&#1084;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080; 
&#1089;&#1083;&#1091;&#1078;&#1080;&#1083;&#1080; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084; &#1094;&#1077;&#1085;&#1090;&#1088;&#1086;&#1084; &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;. &#1055;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083;&#1086; &#1080; &#1090;&#1086;,
&#1095;&#1090;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074; &#1088;&#1072;&#1085;&#1085;&#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1074; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;&#1072;&#1093;,
&#1075;&#1076;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1095;&#1100;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081; &#1073;&#1099;&#1083;&#1072; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1099;&#1084; &#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1053;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1080; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1080;, 
&#1095;&#1090;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1086; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1086;&#1073;&#1084;&#1077;&#1085;&#1077;, &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;
&#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102; (&#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1080;&#1083;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1084;&#1091;), &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1077;&#1086;&#1076;&#1086;&#1083;&#1077;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1064;&#1080;&#1088;&#1086;&#1082;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081;, &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081; &#1086;&#1090; "&#1090;&#1088;&#1077;&#1085;&#1080;&#1103;" &#1086;&#1073;&#1084;&#1077;&#1085;, &#1082;&#1072;&#1082;&#1080;&#1084; &#1084;&#1099; &#1079;&#1085;&#1072;&#1077;&#1084; &#1077;&#1075;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089;,
&#1073;&#1099;&#1083; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1077;&#1085;.</p><div class="sect2" title="&#1042;&#1086;&#1089;&#1093;&#1086;&#1076; &#1055;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><div class="titlepage"><div><div><h3 class="title"><a name="propertization"></a>&#1042;&#1086;&#1089;&#1093;&#1086;&#1076; &#1055;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;</h3></div></div></div><p>&#1057; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077;&#1084; &#1086;&#1090;&#1088;&#1072;&#1089;&#1083;&#1080;, &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. 
&#1059;&#1078;&#1072;&#1089;&#1072;&#1102;&#1097;&#1077;&#1077; &#1088;&#1072;&#1079;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;, &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1091;&#1089;&#1090;&#1091;&#1087;&#1080;&#1083;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084; &#1073;&#1077;&#1089;&#1089;&#1087;&#1086;&#1088;&#1085;&#1099;&#1084; &#1087;&#1086;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;&#1084; - &#1087;&#1086;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;&#1084;, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1074;&#1096;&#1080;&#1084; &#1083;&#1091;&#1095;&#1096;&#1077;&#1081; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1077;&#1081;,
&#1083;&#1091;&#1095;&#1096;&#1080;&#1084; &#1084;&#1072;&#1088;&#1082;&#1077;&#1090;&#1080;&#1085;&#1075;&#1086;&#1084; &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086;&#1073;&#1086;&#1080;&#1093;. &#1042; &#1090;&#1086;&#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1080; &#1085;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;,
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; "&#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;", &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1072; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086;, &#1082;&#1090;&#1086; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086;
&#1084;&#1086;&#1075; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1084; &#1103;&#1079;&#1099;&#1082;&#1077;, &#1080; &#1087;&#1086;&#1090;&#1086;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1089;&#1090;&#1080; ("&#1089;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;") &#1077;&#1077; &#1074; &#1082;&#1086;&#1076;,
&#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1084; &#1090;&#1080;&#1087;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1103; &#1082;&#1086;&#1089;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081; 
&#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;: &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090; &#1084;&#1086;&#1075; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1089;&#1080;&#1083;&#1080;&#1103; &#1087;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; 
&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081;
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077;. &#1054;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1101;&#1090;&#1080;&#1084; &#1089;&#1090;&#1080;&#1088;&#1072;&#1083;&#1072;&#1089;&#1100; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; 
&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086; &#1074;&#1099;&#1090;&#1077;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;. &#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080;,
&#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074;&#1080;&#1076;&#1086;&#1084; &#1072;&#1082;&#1090;&#1080;&#1074;&#1072;, &#1087;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1080; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1077; &#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1073;&#1099;&#1083;&#1080;.
&#1063;&#1080;&#1089;&#1090;&#1072;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1084;&#1086;&#1097;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1072;&#1089;&#1100; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084; &#1090;&#1086;&#1074;&#1072;&#1088;&#1086;&#1084;, &#1072; &#1055;&#1054; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074; &#1085;&#1086;&#1074;&#1091;&#1102; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;.
&#1055;&#1088;&#1086;&#1076;&#1072;&#1078;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1083;&#1080;, &#1093;&#1086;&#1090;&#1103; &#1073;&#1099;, &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082; &#1085;&#1077;&#1084;&#1091; &#1082;&#1072;&#1082; &#1082; &#1085;&#1077;&#1086;&#1090;&#1098;&#1077;&#1084;&#1083;&#1077;&#1084;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1076;&#1072;&#1078;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;,
&#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1083;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1081; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1077;&#1081; &#1085;&#1072; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1077;.</p><p>&#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1086; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1080; &#1089;&#1090;&#1072;&#1083;&#1080; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1088;&#1086;&#1078;&#1077; &#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072;
&#1085;&#1072; &#1089;&#1074;&#1086;&#1081; &#1082;&#1086;&#1076;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1083;&#1080; &#1073;&#1099; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1086;&#1073;&#1084;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081; &#1080;
&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1076;, &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1091;&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1076;&#1072;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1086;&#1084; &#1082;&#1072;&#1082; "&#1076;&#1086;&#1073;&#1072;&#1074;&#1086;&#1095;&#1085;&#1072;&#1103; &#1094;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;". &#1045;&#1097;&#1077; &#1093;&#1091;&#1078;&#1077;, &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1084;&#1086;&#1075; &#1073;&#1099; &#1087;&#1086;&#1087;&#1072;&#1089;&#1090;&#1100; 
&#1074; &#1088;&#1091;&#1082;&#1080; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1048;&#1088;&#1086;&#1085;&#1080;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090; &#1074;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083; &#1085;&#1072; &#1085;&#1086;&#1075;&#1080;. &#1050;&#1072;&#1082; &#1088;&#1072;&#1079; &#1090;&#1086;&#1075;&#1076;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1077;&#1089;&#1087;&#1088;&#1077;&#1087;&#1103;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081;
&#1086;&#1073;&#1084;&#1077;&#1085; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1072;&#1083; &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1084; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1077;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1077;&#1075;&#1086; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1089; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1080;.
&#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1085;&#1103;&#1083;&#1080; &#1084;&#1077;&#1088;&#1099;, &#1083;&#1080;&#1073;&#1086; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1082;&#1086;&#1076;&#1091;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1077;&#1084;&#1091;&#1089;&#1103; &#1085;&#1072; &#1077;&#1075;&#1086;
&#1084;&#1072;&#1096;&#1080;&#1085;&#1077;, &#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1080; &#1086; &#1085;&#1077;&#1088;&#1072;&#1079;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1086;&#1073;&#1084;&#1077;&#1085; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;
&#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;.</p><div class="sect3" title="&#1054;&#1089;&#1086;&#1079;&#1085;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h4 class="title"><a name="history-conscious-resistance"></a>&#1054;&#1089;&#1086;&#1079;&#1085;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</h4></div></div></div><p>&#1042; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1084;&#1080;&#1088; &#1085;&#1077;&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1082;&#1086;&#1076;&#1086;&#1084; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1091;&#1075;&#1072;&#1089;&#1072;&#1083;, &#1074; &#1075;&#1086;&#1083;&#1086;&#1074;&#1077; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072; &#1074;&#1099;&#1082;&#1088;&#1080;&#1089;&#1090;&#1072;&#1083;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1080;&#1076;&#1077;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1080;. &#1056;&#1080;&#1095;&#1072;&#1088;&#1076; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;
&#1074; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1048;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1048;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1072; &#1074; &#1052;&#1072;&#1089;&#1089;&#1072;&#1095;&#1091;&#1089;&#1077;&#1090;&#1089;&#1082;&#1086;&#1084; &#1058;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1048;&#1085;&#1089;&#1090;&#1080;&#1090;&#1091;&#1090;&#1077;
&#1074; 1970-&#1093; &#1080; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; 80-&#1093;, &#1074; &#1084;&#1077;&#1089;&#1090;&#1077; &#1080; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1082;&#1072;&#1082; &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099;&#1083;&#1086;
&#1079;&#1077;&#1084;&#1083;&#1077;&#1081; &#1086;&#1073;&#1077;&#1090;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1080; &#1079;&#1086;&#1083;&#1086;&#1090;&#1099;&#1084; &#1074;&#1077;&#1082;&#1086;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1082;&#1086;&#1076;&#1086;&#1084;.
&#1042; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1048;&#1048; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1072; &#1089;&#1090;&#1088;&#1086;&#1075;&#1072;&#1103; "&#1101;&#1090;&#1080;&#1082;&#1072; &#1093;&#1072;&#1082;&#1077;&#1088;&#1086;&#1074;",<sup>[<a name="idp5046544" href="#ftn.idp5046544" class="footnote">3</a>]</sup>  &#1080; &#1083;&#1102;&#1076;&#1103;&#1084; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1083;&#1080;, &#1085;&#1086; &#1080; &#1078;&#1076;&#1072;&#1083;&#1080; &#1086;&#1090; &#1085;&#1080;&#1093;,
&#1095;&#1090;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;, &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;&#1084; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1050;&#1072;&#1082; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;
&#1087;&#1080;&#1089;&#1072;&#1083; &#1087;&#1086;&#1079;&#1078;&#1077;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1052;&#1099; &#1085;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072;&#1096;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1055;&#1054;", &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; &#1077;&#1097;&#1077; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;, &#1093;&#1086;&#1090;&#1103; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1081; &#1078;&#1077;&#1083;&#1072;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1085;&#1072; &#1089;&#1074;&#1086;&#1080; &#1084;&#1072;&#1096;&#1080;&#1085;&#1099; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1077;&#1077; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1080;&#1093; &#1094;&#1077;&#1083;&#1077;&#1081;, &#1084;&#1099; &#1089; &#1088;&#1072;&#1076;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1083;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1080;&#1076;&#1077;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1099;&#1095;&#1085;&#1091;&#1102; &#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1091;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1083;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1077;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1077;&#1077; &#1083;&#1080;&#1073;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074; &#1085;&#1086;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;.
      </em></span></p><p>(&#1080;&#1079; <span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.html" target="_top">http://www.gnu.org/gnu/thegnuproject.html</a></strong></span>)</p></blockquote></div><p>&#1069;&#1090;&#1086; &#1088;&#1072;&#1081;&#1089;&#1082;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;, &#1086;&#1082;&#1088;&#1091;&#1078;&#1072;&#1074;&#1096;&#1077;&#1077; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1072;, &#1088;&#1072;&#1089;&#1087;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; 1980 &#1075;&#1086;&#1076;&#1072;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1074;&#1096;&#1080;&#1077; &#1074;&#1086; &#1074;&#1089;&#1077;&#1081; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1076;&#1091;&#1089;&#1090;&#1088;&#1080;&#1080;, &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074; &#1076;&#1086;&#1082;&#1072;&#1090;&#1080;&#1083;&#1080;&#1089;&#1100; 
&#1080; &#1076;&#1086; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1048;&#1048;. &#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1072;&#1103; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1085;&#1103;&#1083;&#1072; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1074;&#1096;&#1080;&#1093;
&#1074; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1087;&#1086;&#1093;&#1086;&#1078;&#1077;&#1081; &#1085;&#1072; &#1090;&#1091;, &#1085;&#1072;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1085;&#1080;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1074; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1076; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1077;&#1081;. &#1042; &#1090;&#1086;&#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1103; &#1048;&#1048; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072; 
&#1085;&#1086;&#1074;&#1086;&#1077; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1093;&#1086;&#1076;&#1080;&#1083;&#1072; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;.</p><p>&#1042; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;, &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085; &#1091;&#1074;&#1080;&#1076;&#1077;&#1083; &#1086;&#1073;&#1097;&#1091;&#1102; &#1090;&#1077;&#1085;&#1076;&#1077;&#1085;&#1094;&#1080;&#1102;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1057;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099; &#1090;&#1077;&#1093; &#1083;&#1077;&#1090;, &#1090;&#1072;&#1082;&#1080;&#1077;, &#1082;&#1072;&#1082; VAX &#1080;&#1083;&#1080; 68020, &#1080;&#1084;&#1077;&#1083;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1085;&#1086; &#1085;&#1080; &#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1085;&#1080;&#1093; &#1085;&#1077; &#1073;&#1099;&#1083;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1081;: &#1074;&#1099; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1099; &#1073;&#1099;&#1083;&#1080; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077;&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1078;&#1077; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084;&#1099;&#1081; &#1082;&#1086;&#1076;.</em></span> </p><p><span class="emphasis"><em>&#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1083;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1096;&#1072;&#1075;&#1086;&#1084; &#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1089;&#1090;&#1072;&#1083;&#1086; &#1086;&#1073;&#1077;&#1097;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1100; &#1086;&#1082;&#1088;&#1091;&#1078;&#1072;&#1102;&#1097;&#1080;&#1084;. &#1057;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1077;&#1085;&#1086;. &#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1080;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;: "&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080;&#1089;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081; &#1089; &#1074;&#1072;&#1096;&#1080;&#1084; &#1089;&#1086;&#1089;&#1077;&#1076;&#1086;&#1084;, &#1074;&#1099; &#1087;&#1080;&#1088;&#1072;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;, &#1091;&#1084;&#1086;&#1083;&#1103;&#1081;&#1090;&#1077; &#1085;&#1072;&#1089; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093;."
      </em></span> </p></blockquote></div><p>&#1055;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1083;&#1080;&#1095;&#1085;&#1086;&#1084;&#1091; &#1082;&#1072;&#1087;&#1088;&#1080;&#1079;&#1091;, &#1086;&#1085; &#1088;&#1077;&#1096;&#1080;&#1083; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1086;&#1073;&#1097;&#1077;&#1084;&#1091; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102;.
&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1074; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1091;&#1078;&#1077; &#1086;&#1087;&#1091;&#1089;&#1090;&#1086;&#1096;&#1077;&#1085;&#1085;&#1086;&#1081; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1048;&#1048; &#1080;&#1083;&#1080;
&#1091;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1084; &#1074; &#1086;&#1076;&#1085;&#1091; &#1080;&#1079; &#1085;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1081;, &#1075;&#1076;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1077;&#1075;&#1086; &#1090;&#1088;&#1091;&#1076;&#1072; &#1073;&#1099;&#1083;&#1080; &#1073;&#1099;
&#1079;&#1072;&#1087;&#1077;&#1088;&#1090;&#1099; &#1074; &#1103;&#1097;&#1080;&#1082;&#1077;, &#1086;&#1085; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072;&#1083;&#1089;&#1103; &#1086;&#1090; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080; &#1085;&#1072;&#1095;&#1072;&#1083; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; GNU, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1083; &#1060;&#1086;&#1085;&#1076;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; (FSF).&#1062;&#1077;&#1083;&#1100;&#1102; GNU <sup>[<a name="idp5015904" href="#ftn.idp5015904" class="footnote">4</a>]</sup> &#1073;&#1099;&#1083;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1081; &#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; 
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;, &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1073;&#1099;
&#1085;&#1077; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1083;&#1086;&#1089;&#1100; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1080;&#1083;&#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080;&#1084;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;.
&#1054;&#1085;, &#1074; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1099;&#1090;&#1072;&#1083;&#1089;&#1103; &#1074;&#1086;&#1089;&#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1077;&#1085;&#1086; &#1074; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1048;&#1048;, &#1085;&#1086; &#1074; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1084;&#1080;&#1088;&#1072; &#1080; &#1073;&#1077;&#1079;
&#1090;&#1077;&#1093; &#1089;&#1083;&#1072;&#1073;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1080;&#1080; &#1048;&#1048; &#1082; &#1088;&#1072;&#1089;&#1087;&#1072;&#1076;&#1091;.</p><p>&#1054;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081; &#1085;&#1072;&#1076; &#1085;&#1086;&#1074;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;, &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085; 
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1091;&#1102; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1102;, &#1095;&#1100;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080;,
&#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1082;&#1086;&#1076; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1084;. &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;&#1103; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; (GPL) &#1060;&#1086;&#1085;&#1076;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090; GNU,
&#1073;&#1099;&#1083;&#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1094;&#1086;&#1084; &#1076;&#1079;&#1102;&#1076;&#1086; &#1074; &#1102;&#1088;&#1080;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;: &#1074; &#1085;&#1077;&#1081; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100;, 
&#1095;&#1090;&#1086; &#1082;&#1086;&#1076; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1073;&#1077;&#1079;&#1086; &#1074;&#1089;&#1103;&#1082;&#1080;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1080; &#1095;&#1090;&#1086; &#1080; &#1082;&#1086;&#1087;&#1080;&#1080;
&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;) &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; 
&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1090;&#1086;&#1081; &#1078;&#1077; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1082;&#1072;&#1082; &#1080; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;, &#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093; &#1083;&#1080;&#1073;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1086;&#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1079;&#1072;&#1082;&#1086;&#1085; &#1086;&#1073; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1086;&#1084; &#1087;&#1088;&#1072;&#1074;&#1077;, &#1076;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103;
&#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072;, &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1084;&#1091; &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1086;&#1084;&#1091; &#1087;&#1088;&#1072;&#1074;&#1091;: &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099;
&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1085;&#1072; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;<span class="emphasis"><em>&#1085;&#1080;&#1082;&#1086;&#1084;&#1091;</em></span>,
&#1076;&#1072;&#1078;&#1077; &#1072;&#1074;&#1090;&#1086;&#1088;&#1091;, &#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1044;&#1083;&#1103; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1072;, &#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1076;&#1072;&#1078;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1074;&#1099;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1074; &#1086;&#1073;&#1097;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;. &#1045;&#1089;&#1083;&#1080; &#1073;&#1099; &#1086;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1089;&#1103; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;, &#1083;&#1102;&#1073;&#1072;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; 
&#1082;&#1086;&#1087;&#1080;&#1103; &#1084;&#1086;&#1075;&#1083;&#1072; &#1073;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1074; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1091;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; (&#1090;&#1072;&#1082;&#1086;&#1077;, &#1082;&#1072;&#1082;  &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1089;&#1083;&#1091;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100;
&#1089; &#1082;&#1086;&#1076;&#1086;&#1084;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084; &#1087;&#1086; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1097;&#1080;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1074;&#1099;&#1084; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;&#1084;).
&#1055;&#1086;&#1082;&#1072; &#1090;&#1072;&#1082;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1085;&#1077; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1083;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;,
 &#1085;&#1086; &#1086;&#1085;&#1086; &#1084;&#1086;&#1075;&#1083;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1080;&#1083;&#1080;&#1103; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1072; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1086;&#1081;&#1090;&#1080; &#1085;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091; &#1074;&#1088;&#1072;&#1075;&#1091; &#8212; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1084;&#1091;
 &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102;. GPL &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1074;&#1080;&#1076; &#1087;&#1088;&#1086;&#1090;&#1077;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1079;&#1084;&#1072; &#1076;&#1083;&#1103; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086;
 &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1072; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1085;&#1077;-&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;
 &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1082;&#1086;&#1076;&#1072;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086; GPL. GPL &#1080; &#1077;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;&#1084;&#1080;
 &#1085;&#1072; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;
<a class="xref" href="legal.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 9. Licenses, Copyrights, and Patents">&#1043;&#1083;&#1072;&#1074;&#1072; 9, <i>Licenses, Copyrights, and Patents</i></a>.</p><p>&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1083;&#1080;
&#1080;&#1076;&#1077;&#1080; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1072;, &#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086;
&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; GNU &#1085;&#1072;&#1095;&#1072;&#1083; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072;
&#1089;&#1072;&#1084;&#1099;&#1093; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1042; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1091;&#1078;&#1077; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081; 
&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1084; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080;, &#1089;&#1090;&#1072;&#1083;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099; &#1086;&#1090; GNU &#1076;&#1083;&#1103; &#1085;&#1077;-&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1080; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1090;&#1072;&#1082; &#1080; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1083;&#1080;. &#1058;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081;
&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1086;&#1090; GNU (Emacs) &#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088; &#1057;&#1080; (GCC) &#1073;&#1099;&#1083;&#1080; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;, &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; 
&#1080; &#1087;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1072;&#1088;&#1084;&#1080;&#1102; &#1087;&#1086;&#1082;&#1083;&#1086;&#1085;&#1085;&#1080;&#1082;&#1086;&#1074; &#1085;&#1077; &#1085;&#1072; &#1080;&#1076;&#1077;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077;, &#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1079;-&#1079;&#1072; &#1080;&#1093; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093;
&#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1082; 1990 &#1075;&#1086;&#1076;&#1091;, GNU &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081;
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1103;&#1076;&#1088;&#1072; &#8212; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;, &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;
&#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102;, &#1076;&#1080;&#1089;&#1082;&#1086;&#1084; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1084;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;&#1084;&#1080;.</p><p>&#1050; &#1085;&#1077;&#1089;&#1095;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; GNU &#1074;&#1099;&#1073;&#1088;&#1072;&#1083; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091; &#1103;&#1076;&#1088;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100;
&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1088;&#1091;&#1076;&#1085;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1072;&#1103;&#1089;&#1103; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083;&#1072; 
&#1060;&#1086;&#1085;&#1076;&#1091; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;
&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1080;&#1093;, &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1073;&#1099;&#1083;&#1072; 
&#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1085;&#1072; &#1089;&#1074;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1051;&#1080;&#1085;&#1091;&#1089;&#1086;&#1084; &#1058;&#1086;&#1088;&#1074;&#1072;&#1083;&#1100;&#1076;&#1089;&#1086;&#1084;, &#1092;&#1080;&#1085;&#1089;&#1082;&#1080;&#1084; &#1089;&#1090;&#1091;&#1076;&#1077;&#1085;&#1090;&#1086;&#1084; &#1092;&#1072;&#1082;&#1091;&#1083;&#1100;&#1090;&#1077;&#1090;&#1072; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1099;&#1093; 
&#1085;&#1072;&#1091;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1077;&#1074; &#1089;&#1086; &#1074;&#1089;&#1077;&#1075;&#1086; &#1084;&#1080;&#1088;&#1072;, &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1083; &#1103;&#1076;&#1088;&#1086;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1074; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1082;&#1086;&#1085;&#1089;&#1077;&#1088;&#1074;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;. &#1054;&#1085; &#1085;&#1072;&#1079;&#1074;&#1072;&#1083; &#1077;&#1075;&#1086; Linux, &#1080; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1086; &#1089; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080;
GNU &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080;, &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1073;&#1099;&#1083;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;.
&#1042; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088; &#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1073;&#1077;&#1079; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1090;&#1086; &#1085;&#1080; &#1073;&#1099;&#1083;&#1086;
&#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;.<sup>[<a name="idp5084336" href="#ftn.idp5084336" class="footnote">5</a>]</sup></p><p>&#1041;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1085;&#1086;&#1074;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;
&#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; GNU. &#1042; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, GNU &#1073;&#1099;&#1083;&#1072; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081;
&#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1081;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1074;&#1096;&#1077;&#1081; &#1085;&#1072;&#1076; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1086;&#1076;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1080;&#1090;&#1086;&#1075;&#1077; &#1089;&#1090;&#1072;&#1083; NetBSD &#1080; FreeBSD &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1091;&#1078;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1089;&#1103; &#1074; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080;
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;). &#1047;&#1085;&#1072;&#1095;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1060;&#1086;&#1085;&#1076;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1082;&#1086;&#1076;&#1077;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1085;&#1080; &#1087;&#1080;&#1089;&#1072;&#1083;&#1080;, &#1085;&#1086; &#1074; &#1080;&#1093; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1088;&#1080;&#1090;&#1086;&#1088;&#1080;&#1082;&#1077;. &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1074;&#1077;&#1083;&#1080; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088; &#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; &#1082;&#1072;&#1082; &#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;, &#1072; &#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1080;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;&#1084; &#1073;&#1099;&#1083;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086; <span class="emphasis"><em>&#1085;&#1077;</em></span> 
&#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082; &#1085;&#1077;&#1084;&#1091;. &#1044;&#1072;&#1078;&#1077; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1085;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1083;&#1089;&#1103; &#1089; FSF, &#1074;&#1089;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086;
&#1080;&#1084;&#1077;&#1083;&#1080; &#1089; &#1085;&#1080;&#1084; &#1076;&#1077;&#1083;&#1086;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1103; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;. &#1069;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; FSF &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1087;&#1072;&#1075;&#1072;&#1085;&#1076;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1083;&#1072;
&#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; &#1082;&#1086;&#1076; &#1089;&#1086; &#1089;&#1074;&#1086;&#1080;&#1084; &#1087;&#1086;&#1089;&#1083;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; GPL &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. 
&#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1080;&#1093; &#1082;&#1086;&#1076; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1083;&#1089;&#1103; &#1074;&#1089;&#1077; &#1096;&#1080;&#1088;&#1077;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1083;&#1086;&#1089;&#1100; &#1080; &#1080;&#1093; &#1087;&#1086;&#1089;&#1083;&#1072;&#1085;&#1080;&#1077;.</p></div><div class="sect3" title="&#1057;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h4 class="title"><a name="history-accidental-resistance"></a>&#1057;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</h4></div></div></div><p>&#1042; &#1079;&#1072;&#1088;&#1086;&#1078;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084;&#1089;&#1103; &#1084;&#1080;&#1088;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;
&#1077;&#1097;&#1077; &#1080; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;, &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1073;&#1099;&#1083;&#1080; &#1103;&#1074;&#1085;&#1086; &#1080;&#1076;&#1077;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;, &#1082;&#1072;&#1082; &#1080;
GNU &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1072;. &#1054;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1089;&#1090;&#1072;&#1083;  <em class="firstterm">&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;
 &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;&#1072; &#1041;&#1077;&#1088;&#1082;&#1083;&#1080; (Berkeley Software Distribution)</em> 
(<em class="firstterm">BSD </em>), &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;
Unix, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1076;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; 1970-&#1093; &#1073;&#1099;&#1083;&#1072; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1099;&#1084; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1074; AT&amp;T, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;&#1084;&#1080; &#1050;&#1072;&#1083;&#1080;&#1092;&#1086;&#1088;&#1085;&#1080;&#1081;&#1089;&#1082;&#1086;&#1075;&#1086; &#1059;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;&#1072; &#1074; &#1041;&#1077;&#1088;&#1082;&#1083;&#1080;.
&#1043;&#1088;&#1091;&#1087;&#1087;&#1072; BSD &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1083;&#1072; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1079;&#1072;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;&#1084;
&#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1089;&#1103; &#1080; &#1086;&#1073;&#1084;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;, &#1085;&#1086; &#1086;&#1085;&#1080; <span class="emphasis"><em>&#1074;&#1086;&#1087;&#1083;&#1086;&#1097;&#1072;&#1083;&#1080;</em></span> &#1101;&#1090;&#1091;
&#1080;&#1076;&#1077;&#1102; &#1089;&#1086; &#1074;&#1082;&#1091;&#1089;&#1086;&#1084; &#1080; &#1101;&#1085;&#1090;&#1091;&#1079;&#1080;&#1072;&#1079;&#1084;&#1086;&#1084;, &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1080;&#1088;&#1091;&#1103; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091;, &#1075;&#1076;&#1077;
Unix-&#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1082;&#1086;&#1076;&#1072;, &#1072; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1080; &#1089;&#1072;&#1084;&#1086; &#1103;&#1076;&#1088;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;,
&#1073;&#1099;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1089; &#1085;&#1091;&#1083;&#1103; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1072;&#1084;&#1080;. &#1055;&#1088;&#1086;&#1077;&#1082;&#1090; BSD &#1089;&#1090;&#1072;&#1083; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1085;&#1077;-&#1080;&#1076;&#1077;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; &#1087;&#1086;&#1089;&#1083;&#1091;&#1078;&#1080;&#1083; &#1090;&#1088;&#1077;&#1085;&#1080;&#1088;&#1086;&#1074;&#1086;&#1095;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1082;&#1086;&#1081;
&#1076;&#1083;&#1103; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080;
&#1083;&#1080;&#1094;&#1072;&#1084;&#1080; &#1084;&#1080;&#1088;&#1072; &#1074; &#1084;&#1080;&#1088;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;.</p><p>&#1044;&#1088;&#1091;&#1075;&#1080;&#1084; &#1075;&#1086;&#1088;&#1085;&#1080;&#1083;&#1086;&#1084; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1073;&#1099;&#1083;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; <em class="firstterm">X
Window System</em>, &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072;&#1103;, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1097;&#1072;&#1103; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;,
&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1088;&#1077;&#1076;&#1072;, &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; &#1052;&#1072;&#1089;&#1089;&#1072;&#1095;&#1091;&#1089;&#1077;&#1090;&#1089;&#1089;&#1082;&#1086;&#1084; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1080;&#1085;&#1089;&#1090;&#1080;&#1090;&#1091;&#1090;&#1077;
(Massachusetts Institute of Technology, MIT) &#1074; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; 1980-&#1093; &#1074; &#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;
&#1089; &#1087;&#1088;&#1086;&#1076;&#1072;&#1074;&#1094;&#1072;&#1084;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1095;&#1100;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1099; &#1089;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1085;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1082;&#1072;&#1079;&#1095;&#1080;&#1082;&#1072;&#1084;
&#1084;&#1085;&#1086;&#1075;&#1086;&#1086;&#1082;&#1086;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;. 

&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1061; &#1085;&#1077; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1072; &#1089;&#1077;&#1073;&#1103; &#1089;&#1077;&#1073;&#1103; &#1084;&#1080;&#1088;&#1091; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;
&#1080; &#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1083;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1099;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;
&#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1103;&#1076;&#1088;&#1072;&#8212;&#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1095;&#1083;&#1077;&#1085; &#1082;&#1086;&#1085;&#1089;&#1086;&#1088;&#1094;&#1080;&#1091;&#1084;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1083; &#1096;&#1072;&#1085;&#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100;
&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1082;&#1091; X, &#1080; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1076;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1095;&#1083;&#1077;&#1085;&#1072;&#1084;&#1080;. X Windows<sup>[<a name="idp5083920" href="#ftn.idp5083920" class="footnote">6</a>]</sup>&#1089;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1073;&#1099;&#1083;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;,
&#1085;&#1086; &#1087;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1089;&#1083;&#1091;&#1078;&#1080;&#1083;&#1072; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1077;&#1076;&#1080;&#1085;&#1099;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1080;&#1075;&#1088;&#1099; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1093;
&#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;, &#1072; &#1085;&#1077; &#1078;&#1077;&#1083;&#1072;&#1083;&#1072; &#1087;&#1086;&#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1100; &#1089; &#1087;&#1088;&#1077;&#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1097;&#1077; &#1086;&#1076;&#1085;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084;, &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1080;&#1084;&#1089;&#1103; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1083;&#1077;&#1090; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; GNU, 
&#1073;&#1099;&#1083; TeX, &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1072;&#1103; &#1080;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1044;&#1086;&#1085;&#1072;&#1083;&#1100;&#1076;&#1072; &#1050;&#1085;&#1091;&#1090;&#1072;. &#1054;&#1085; &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1083;
&#1077;&#1077; &#1087;&#1086;&#1076; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1083;&#1072; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1076;, &#1085;&#1086; &#1085;&#1077;
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077; "TeX" &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1087;&#1086;&#1082;&#1072; &#1086;&#1085;&#1072; &#1085;&#1077; &#1087;&#1088;&#1086;&#1081;&#1076;&#1077;&#1090; &#1085;&#1072;&#1073;&#1086;&#1088; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1090;&#1088;&#1086;&#1075;&#1080;&#1093; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074; &#1085;&#1072;
&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; (&#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; "&#1079;&#1072;&#1097;&#1080;&#1097;&#1072;&#1102;&#1097;&#1080;&#1093;-&#1090;&#1086;&#1074;&#1072;&#1088;&#1085;&#1099;&#1081;-&#1079;&#1085;&#1072;&#1082;" &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081;,
&#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1084;&#1099;&#1093; &#1074; <a class="xref" href="legal.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 9. Licenses, Copyrights, and Patents">&#1043;&#1083;&#1072;&#1074;&#1072; 9, <i>Licenses, Copyrights, and Patents</i></a>). &#1050;&#1085;&#1091;&#1090; &#1085;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083; &#1090;&#1091; &#1080;&#1083;&#1080; &#1080;&#1085;&#1091;&#1102; &#1087;&#1086;&#1079;&#1097;&#1080;&#1094;&#1080;&#1102;
&#1074; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;-&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;-&#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1077;&#1084;&#1091; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1073;&#1099;&#1083;&#1072; 
&#1085;&#1091;&#1078;&#1085;&#1072; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1072;&#1103; &#1090;&#1080;&#1087;&#1086;&#1075;&#1088;&#1072;&#1092;&#1089;&#1082;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1089;&#1090;&#1080;&#1095;&#1100; &#1089;&#1074;&#1086;&#1077;&#1081; <span class="emphasis"><em>&#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1081;</em></span>
&#1094;&#1077;&#1083;&#1080;&#8212;&#1082;&#1085;&#1080;&#1075;&#1080; &#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;&#8212;&#1080; &#1086;&#1085; &#1085;&#1077; &#1074;&#1080;&#1076;&#1077;&#1083; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085; &#1085;&#1077;
&#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1074; &#1084;&#1080;&#1088; &#1087;&#1086; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080;.</p></div><p>&#1044;&#1072;&#1078;&#1077; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1103; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1080; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1102; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;
&#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; 1980-&#1093;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1076; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081;.
&#1056;&#1072;&#1079;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1077; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1081; &#1086;&#1090;&#1088;&#1072;&#1078;&#1072;&#1083;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1088;&#1072;&#1079;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1077; &#1084;&#1086;&#1090;&#1080;&#1074;&#1086;&#1074;.
&#1044;&#1072;&#1078;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074;&#1096;&#1080;&#1093; GNU GPL &#1073;&#1099;&#1083;&#1080;
&#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1076;&#1074;&#1080;&#1078;&#1080;&#1084;&#1099; &#1080;&#1076;&#1077;&#1086;&#1083;&#1086;&#1075;&#1080;&#1077;&#1081;, &#1095;&#1077;&#1084; &#1090;&#1086; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1083; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; GNU. &#1061;&#1086;&#1090;&#1103; &#1080;&#1084; &#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1086;
&#1091;&#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1084;&#1085;&#1086;&#1075;&#1080;&#1077;
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1085;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1082;
&#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1083;&#1086;. &#1041;&#1099;&#1083;&#1080; &#1083;&#1102;&#1076;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1080; &#1076;&#1091;&#1096;&#1077;&#1074;&#1085;&#1099;&#1081; &#1087;&#1086;&#1088;&#1099;&#1074; &#1082; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1102;
&#1084;&#1080;&#1088;&#1072; &#1086;&#1090; "&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072; &#1079;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084;" (&#1090;&#1077;&#1088;&#1084;&#1080;&#1085; &#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1072; &#1076;&#1083;&#1103; &#1085;&#1077;-&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;), &#1085;&#1086; &#1084;&#1086;&#1090;&#1080;&#1074;&#1086;&#1084; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1073;&#1099;&#1083;&#1086; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077;
&#1083;&#1102;&#1073;&#1086;&#1087;&#1099;&#1090;&#1089;&#1090;&#1074;&#1086;, &#1091;&#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1080;&#1077; &#1086;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;  &#1089;&#1086;&#1088;&#1072;&#1090;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1086;&#1073;&#1097;&#1080;&#1084;&#1080;
&#1074;&#1079;&#1075;&#1083;&#1103;&#1076;&#1072;&#1084;&#1080;, &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1077; &#1089;&#1083;&#1072;&#1074;&#1099;. &#1042; &#1086;&#1073;&#1097;&#1077;&#1084; &#1080; &#1094;&#1077;&#1083;&#1086;&#1084;,
&#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1085;&#1077; &#1089;&#1086;&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084;&#1099;&#1093; &#1084;&#1086;&#1090;&#1080;&#1074;&#1086;&#1074; &#1085;&#1077; &#1087;&#1086;&#1096;&#1083;&#1086; &#1087;&#1086; &#1087;&#1091;&#1090;&#1080; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1063;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;,
&#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084; &#1090;&#1074;&#1086;&#1088;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;,
&#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1079;&#1072; &#1080;&#1083;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1072;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1081;&#1090;&#1080; &#1087;&#1086;&#1083;&#1091;-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081;
&#1090;&#1077;&#1089;&#1090;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1084;: &#1086;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1080; &#1073;&#1099;&#1090;&#1100;, &#1074; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1086;&#1081;
&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080;, &#1083;&#1080;&#1096;&#1077;&#1085;&#1086; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;. &#1069;&#1090;&#1086; &#1074; &#1082;&#1072;&#1082;&#1086;&#1081; &#1090;&#1086; &#1084;&#1077;&#1088;&#1077; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1076;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077;&#1084; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;
&#1086;&#1073;&#1097;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; &#1086;&#1090;&#1089;&#1095;&#1077;&#1090;&#1072;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1076;&#1083;&#1103; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1103; &#1085;&#1077; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; 
&#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1082;&#1074;&#1072;&#1083;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;.</p><p>&#1059; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1073;&#1099;&#1083;&#1072; &#1090;&#1072;&#1082; &#1078;&#1077; &#1080; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077;:
&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086; &#1084;&#1080;&#1088; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1083;
&#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;. &#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1086;&#1085; &#1073;&#1099;&#1083; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;
&#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1073;&#1083;&#1080;&#1078;&#1072;&#1081;&#1096;&#1072;&#1103; &#1085;&#1077;-&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1072;&#1103; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1072;;&#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;, &#1086;&#1085;
&#1073;&#1099;&#1083;, &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1089;&#1086;&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084;, &#1080;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1086;&#1085; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1090;&#1086;&#1080;&#1083; &#1076;&#1077;&#1096;&#1077;&#1074;&#1083;&#1077;.
&#1051;&#1080;&#1096;&#1100; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1055;&#1054; &#1080;&#1079; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1092;&#1080;&#1083;&#1086;&#1089;&#1086;&#1092;&#1089;&#1082;&#1080;&#1093; &#1087;&#1086;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081;,
&#1087;&#1086;&#1076;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081; &#1073;&#1099;&#1083;&#1080; &#1089;&#1095;&#1072;&#1089;&#1090;&#1083;&#1080;&#1074;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1084;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086;
&#1086;&#1085;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1083;&#1086;&#1089;&#1100; &#1089;&#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081;. &#1040; &#1089;&#1088;&#1077;&#1076;&#1080; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083; &#1077;&#1075;&#1086;, 
&#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1089;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1093; &#1078;&#1077;&#1088;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084; &#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1072;&#1084;&#1080;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1080; &#1091;&#1083;&#1091;&#1095;&#1096;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;.</p><p>&#1069;&#1090;&#1072; &#1090;&#1077;&#1085;&#1076;&#1077;&#1085;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1082;&#1086;&#1076;, &#1073;&#1099;&#1083;&#1072; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077;&#1086;&#1073;&#1097;&#1077;&#1081;, 
&#1085;&#1086; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1083;&#1072;&#1089;&#1100; &#1089;&#1086; &#1074;&#1089;&#1077; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1102;&#1097;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1086;&#1081; &#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093;
&#1087;&#1086; &#1074;&#1089;&#1077;&#1084;&#1091; &#1084;&#1080;&#1088;&#1091;. &#1053;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1083;&#1080; &#1086;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; 
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1089;&#1090;&#1072;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1085;&#1072; &#1101;&#1090;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;. &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083;&#1080;,
&#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1091;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1086;&#1074;&#1089;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093;
&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1102;&#1090; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; (&#1074;&#1099;&#1089;&#1096;&#1080;&#1081; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1084;, &#1095;&#1090;&#1086; 
&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083; &#1048;&#1058;). &#1050;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1090;&#1072;&#1083;&#1080; &#1080;&#1075;&#1088;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; &#1080; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1091;&#1102; &#1088;&#1086;&#1083;&#1100; &#1074; 
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1074;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1103; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, 
&#1072; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1076;&#1072;&#1078;&#1077; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1092;&#1080;&#1085;&#1072;&#1085;&#1089;&#1080;&#1088;&#1091;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;. &#1058;&#1072;&#1082;&#1080;&#1077; 
&#1080;&#1085;&#1074;&#1077;&#1089;&#1090;&#1080;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090;, &#1074; &#1083;&#1091;&#1095;&#1096;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1086;&#1087;&#1088;&#1072;&#1074;&#1076;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;. &#1057;&#1087;&#1086;&#1085;&#1089;&#1086;&#1088;
&#1086;&#1087;&#1083;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1082;&#1074;&#1072;&#1083;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1072;&#1102;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1081; &#1076;&#1077;&#1085;&#1100;, &#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1077;&#1097;&#1077; &#1080; &#1086;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;
<span class="emphasis"><em>&#1083;&#1102;&#1073;&#1086;&#1075;&#1086;</em></span> &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072;, &#1073;&#1091;&#1076;&#1100; &#1090;&#1086; &#1085;&#1077;&#1086;&#1087;&#1083;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074;&#1086;&#1083;&#1086;&#1085;&#1090;&#1077;&#1088; 
&#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099;, &#1086;&#1087;&#1083;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;.</p></div><div class="sect2" title='"&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077;" &#1055;&#1088;&#1086;&#1090;&#1080;&#1074; "&#1057; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1050;&#1086;&#1076;&#1086;&#1084;"'><div class="titlepage"><div><div><h3 class="title"><a name="free-vs-open-source"></a>"&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077;" &#1055;&#1088;&#1086;&#1090;&#1080;&#1074; "&#1057; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1050;&#1086;&#1076;&#1086;&#1084;"</h3></div></div></div><p>&#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1084;&#1080;&#1088; &#1091;&#1076;&#1077;&#1083;&#1103;&#1083; &#1074;&#1089;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1084;&#1080;
&#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1081;. &#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1089;&#1083;&#1086;&#1074;&#1077; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;".&#1059;&#1089;&#1083;&#1099;&#1096;&#1072;&#1074; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; 
"&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;" &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086; &#1076;&#1091;&#1084;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; 
&#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; "&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102;". &#1069;&#1090;&#1086;
&#1087;&#1088;&#1072;&#1074;&#1076;&#1072;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1084; &#1089; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081;
&#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102;,<sup>[<a name="idp5125024" href="#ftn.idp5125024" class="footnote">7</a>]</sup>&#1085;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084;. &#1058;&#1072;&#1082;, &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1086;&#1081;&#1085;&#1099; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1086;&#1074; &#1074; 1990-&#1093;, &#1080; Netscape &#1080;
Microsoft &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1080; &#1089;&#1074;&#1086;&#1080; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1099; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;, &#1074; &#1073;&#1086;&#1088;&#1100;&#1073;&#1077; &#1079;&#1072;
&#1079;&#1072;&#1074;&#1086;&#1077;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1086;&#1083;&#1080; &#1088;&#1099;&#1085;&#1082;&#1072;. &#1053;&#1080; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1086;&#1074; &#1085;&#1077; &#1073;&#1099;&#1083; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1074; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1080;
"&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;". &#1042;&#1099; &#1085;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1080;
&#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1089;&#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099;, &#1074;&#1099; &#1085;&#1077; &#1080;&#1084;&#1077;&#1083;&#1080; &#1087;&#1088;&#1072;&#1074; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080;&#1083;&#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;.<sup>[<a name="idp5127536" href="#ftn.idp5127536" class="footnote">8</a>]</sup> 
&#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1097;&#1100;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1073;&#1099;&#1083;&#1072; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1077;&#1075;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;.
&#1041;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1099; &#1073;&#1099;&#1083;&#1080; &#1085;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;, &#1095;&#1077;&#1084; &#1082;&#1086;&#1088;&#1086;&#1073;&#1086;&#1095;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1055;&#1054;, &#1082;&#1091;&#1087;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1084;&#1072;&#1075;&#1072;&#1079;&#1080;&#1085;&#1077;; &#1091; &#1085;&#1080;&#1093; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1094;&#1077;&#1085;&#1072; &#1073;&#1099;&#1083;&#1072; &#1085;&#1080;&#1078;&#1077;.</p><p>&#1069;&#1090;&#1072; &#1087;&#1091;&#1090;&#1072;&#1085;&#1080;&#1094;&#1072; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1089;&#1083;&#1086;&#1074;&#1072; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077;" &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1080;&#1079;-&#1079;&#1072; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1086;&#1081; &#1076;&#1074;&#1091;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084; &#1103;&#1079;&#1099;&#1082;&#1077;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;
&#1103;&#1079;&#1099;&#1082;&#1086;&#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090; &#1085;&#1080;&#1079;&#1082;&#1091;&#1102; &#1094;&#1077;&#1085;&#1091; &#1086;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,&#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; <span class="emphasis"><em>gratis</em></span>
&#1080; <span class="emphasis"><em>libre</em></span> &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1072; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1097;&#1080;&#1084; &#1085;&#1072; &#1056;&#1086;&#1084;&#1072;&#1085;&#1089;&#1082;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;).
&#1053;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1075;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072; &#1082;&#1072;&#1082; &#1076;&#1077; &#1092;&#1072;&#1082;&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1103;&#1079;&#1099;&#1082;&#1072; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1072;, &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;,
&#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084;, &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080;, &#1089;&#1090;&#1072;&#1083;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093;.
&#1053;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;" &#1073;&#1099;&#1083;&#1086; &#1090;&#1072;&#1082; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086;,
&#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099;, &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1074;&#1099;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1091; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072;: "&#1054;&#1085;&#1086; <span class="emphasis"><em>&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077;</em></span>&#1082;&#1072;&#1082;
<span class="emphasis"><em>&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072;</em></span>&#8212;&#1082;&#1072;&#1082; <span class="emphasis"><em>&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072; &#1089;&#1083;&#1086;&#1074;&#1072;</em></span>, 
&#1085;&#1077; &#1082;&#1072;&#1082; <span class="emphasis"><em>&#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1080;&#1074;&#1086;</em></span>." &#1048; &#1074;&#1089;&#1077; &#1078;&#1077;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1103;&#1090;&#1100;
&#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1089;&#1085;&#1086;&#1074;&#1072; &#1073;&#1099;&#1083;&#1072; &#1091;&#1090;&#1086;&#1084;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;. &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1080;, &#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1082;&#1086;&#1081;,
&#1095;&#1090;&#1086; &#1076;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1083;&#1086;&#1074;&#1072; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;" &#1087;&#1088;&#1077;&#1087;&#1103;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1102; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;.</p><p>&#1053;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1079;&#1072;&#1096;&#1083;&#1072; &#1077;&#1097;&#1077; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;. &#1057;&#1083;&#1086;&#1074;&#1086; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;" &#1085;&#1077;&#1086;&#1090;&#1098;&#1077;&#1084;&#1083;&#1077;&#1084;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086; &#1089; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;&#1084;
&#1084;&#1086;&#1088;&#1072;&#1083;&#1080;: &#1077;&#1089;&#1083;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072; &#1073;&#1099;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1094;&#1077;&#1083;&#1100;&#1102;, &#1090;&#1086; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1086;&#1089;&#1100; &#1085;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1083;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1055;&#1054;
&#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1083;&#1080; &#1074;&#1099;&#1075;&#1086;&#1076;&#1085;&#1077;&#1077; &#1076;&#1083;&#1103; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1093;. &#1042;&#1089;&#1077; &#1101;&#1090;&#1086; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1086;&#1089;&#1100; &#1083;&#1080;&#1096;&#1100; &#1076;&#1086;&#1074;&#1077;&#1089;&#1082;&#1086;&#1084; &#1082; 
&#1087;&#1086;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086; &#1089;&#1091;&#1090;&#1080; &#1089;&#1074;&#1086;&#1077;&#1081; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1085;&#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;, &#1085;&#1080; &#1084;&#1077;&#1088;&#1082;&#1072;&#1085;&#1090;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1072; &#1076;&#1091;&#1093;&#1086;&#1074;&#1085;&#1099;&#1084;.
&#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1082;&#1072;&#1082; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072;" &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1103;&#1088;&#1082;&#1086; &#1074;&#1099;&#1089;&#1074;&#1077;&#1090;&#1080;&#1083;&#1072; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1074; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1081;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1088;&#1072;&#1076;&#1080; &#1086;&#1076;&#1085;&#1080;&#1093; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;
&#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072;, &#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1083;&#1080; &#1090;&#1086;&#1088;&#1075;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;.</p><p>&#1057;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1085;&#1072; &#1087;&#1086;&#1088;&#1086;&#1075;&#1077; &#1082;&#1088;&#1080;&#1079;&#1080;&#1089;&#1072; &#1089;&#1072;&#1084;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1086;&#1089;&#1100; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1076;&#1080;&#1083;&#1077;&#1084;&#1084;&#1072;&#1084;&#1080;.
&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; <span class="emphasis"><em>&#1087;&#1080;&#1089;&#1072;&#1083;&#1080;</em></span> &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;,
&#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080; &#1082; &#1077;&#1076;&#1080;&#1085;&#1086;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1073;&#1097;&#1077;&#1081; &#1094;&#1077;&#1083;&#1080; (&#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1072; &#1073;&#1099;&#1083;&#1072; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077;) &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103;
&#1087;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1102; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1085;&#1077;&#1085;&#1080;&#1103; &#1073;&#1099;&#1083;&#1080; &#1076;&#1080;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1099;,
- &#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1074;&#1072;&#1089; &#1074; &#1079;&#1072;&#1073;&#1083;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1074;&#1077;&#1076;&#1103; &#1080;&#1093; &#1082; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1084;&#1091; &#1085;&#1072;&#1073;&#1086;&#1088;&#1091; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074;. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1086;
&#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1084;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1088;&#1072;&#1079;&#1085;&#1080;&#1074;&#1096;&#1080;&#1093;&#1089;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1091;&#1073;&#1077;&#1078;&#1076;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1086; &#1080; &#1087;&#1086; &#1090;&#1086;&#1095;&#1082;&#1077; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;.
&#1054;&#1090;&#1082;&#1080;&#1085;&#1091;&#1074; &#1090;&#1086;&#1085;&#1082;&#1080;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103;, &#1074;&#1089;&#1077; &#1090;&#1072;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1076;&#1074;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;. &#1054;&#1076;&#1085;&#1072; &#1080;&#1079; &#1085;&#1080;&#1093; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1083;&#1072;&#1089;&#1100; &#1089;&#1086;
&#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085;&#1086;&#1084; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1080;,&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;,
&#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1077;&#1084; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1077;, &#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;.
&#1044;&#1088;&#1091;&#1075;&#1072;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1089;&#1095;&#1080;&#1090;&#1072;&#1083;&#1072;, &#1095;&#1090;&#1086; &#1055;&#1054; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086; &#1079;&#1072; &#1089;&#1077;&#1073;&#1103;, &#1080; &#1095;&#1090;&#1086; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1077; &#1055;&#1054; &#1087;&#1083;&#1086;&#1093;&#1080;&#1084;
&#1087;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077; &#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1087;&#1088;&#1080;&#1077;&#1090;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1086;. &#1063;&#1072;&#1089;&#1090;&#1100;, &#1085;&#1077; &#1074;&#1089;&#1077;, &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1089;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086;
&#1072;&#1074;&#1090;&#1086;&#1088; (&#1080;&#1083;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1087;&#1083;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;) <span class="emphasis"><em>&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;</em></span>
&#1080;&#1084;&#1077;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1055;&#1054;, &#1080; &#1101;&#1090;&#1086;&#1090; &#1074;&#1099;&#1073;&#1086;&#1088; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085; &#1089;
&#1084;&#1086;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.</p><p>&#1042; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1083;&#1075;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1101;&#1090;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103; &#1085;&#1077; &#1085;&#1091;&#1078;&#1076;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; 
&#1095;&#1077;&#1090;&#1082;&#1080;&#1093; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;&#1093;, &#1085;&#1086; &#1074;&#1086;&#1089;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054; &#1074; &#1084;&#1080;&#1088;&#1077; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072; &#1088;&#1086;&#1089;&#1083;&#1072; &#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;
&#1089;&#1090;&#1072;&#1083;&#1086; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1086;&#1090;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100;. &#1042; 1998, &#1082;&#1086;&#1072;&#1083;&#1080;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1080;
&#1089;&#1090;&#1072;&#1083;&#1072; &#1050;&#1086;&#1084;&#1080;&#1090;&#1077;&#1090;&#1086;&#1084; &#1087;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102; &#1089; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1050;&#1086;&#1076;&#1086;&#1084; 
(Open Source Initiative (OSI)) &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1072; &#1085;&#1072; &#1079;&#1072;&#1084;&#1077;&#1085;&#1091; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1091; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;" &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; <em class="firstterm">&#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;
 &#1082;&#1086;&#1076;&#1086;&#1084;</em>.<sup>[<a name="idp5142400" href="#ftn.idp5142400" class="footnote">9</a>]</sup>
OSI &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1086; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;" &#1084;&#1086;&#1075; &#1089;&#1073;&#1080;&#1090;&#1100; &#1089; &#1090;&#1086;&#1083;&#1082;&#1091; , &#1085;&#1086; &#1080; &#1095;&#1090;&#1086;
&#1089;&#1091;&#1077;&#1090;&#1072; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;" &#1073;&#1099;&#1083;&#1072; &#1083;&#1080;&#1096;&#1100; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1075;&#1083;&#1091;&#1073;&#1086;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;:
&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1091;&#1078;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074; &#1084;&#1072;&#1088;&#1082;&#1077;&#1090;&#1080;&#1085;&#1075;&#1086;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084;&#1091; &#1084;&#1080;&#1088;&#1091;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;
&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1083;&#1072; &#1073;&#1099; &#1082;&#1086;&#1085;&#1077;&#1094; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084; &#1086; "&#1084;&#1086;&#1088;&#1072;&#1083;&#1080;" &#1080; "&#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1073;&#1083;&#1072;&#1075;&#1072;&#1093;" &#1074; &#1079;&#1072;&#1083;&#1072;&#1093; &#1079;&#1072;&#1089;&#1077;&#1076;&#1072;&#1085;&#1080;&#1081; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1081;.

  &#1055;&#1086; &#1080;&#1093; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>OSI&#8212;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1088;&#1082;&#1077;&#1090;&#1080;&#1085;&#1075;&#1086;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
	  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1076;&#1072;&#1095;&#1072; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086;
	  &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;" &#1085;&#1072; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1081; &#1087;&#1088;&#1072;&#1075;&#1084;&#1072;&#1090;&#1080;&#1095;&#1085;&#1086;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077;, &#1072; &#1085;&#1077; &#1085;&#1072;&#1087;&#1099;&#1097;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1077;&#1095;&#1077;&#1081;.
          &#1057;&#1091;&#1090;&#1100; &#1055;&#1054; &#1076;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1089;&#1077;&#1084; &#1074;&#1099;&#1080;&#1075;&#1088;&#1099;&#1096; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100;, &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1082;&#1072; &#1080; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1077;&#1076;&#1096;&#1080;&#1077; &#1082; &#1091;&#1087;&#1072;&#1076;&#1082;&#1091; - &#1076;&#1072;. ...</em></span></p><p><span class="emphasis"><em>&#1063;&#1090;&#1086; &#1085;&#1072;&#1076;&#1086; &#1073;&#1099;&#1083;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084; &#1090;&#1077;&#1093;&#1085;&#1072;&#1088;&#1103;&#1084;,
	  &#1090;&#1072;&#1082; &#1101;&#1090;&#1086; &#1085;&#1077; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1102; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;, &#1072; &#1077;&#1075;&#1086; &#1080;&#1084;&#1103;.
	  &#1055;&#1086;&#1095;&#1077;&#1084;&#1091; &#1073;&#1099; &#1085;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1087;&#1086; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1080;, &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; 
	  &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;?</em></span></p><p><span class="emphasis"><em>&#1057;&#1072;&#1084;&#1072;&#1103; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1072;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;
	  "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;" &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;
	  &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1088;&#1072;&#1079;&#1085;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1103;&#1084;. ...</em></span></p><p><span class="emphasis"><em>&#1053;&#1086; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1089;&#1084;&#1077;&#1085;&#1099; &#1103;&#1088;&#1083;&#1099;&#1082;&#1072;
	  &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1088;&#1082;&#1077;&#1090;&#1080;&#1085;&#1075;. &#1052;&#1099; &#1087;&#1099;&#1090;&#1072;&#1077;&#1084;&#1089;&#1103; &#1076;&#1086;&#1085;&#1077;&#1089;&#1090;&#1080; &#1085;&#1072;&#1096;&#1091;
	  &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1102; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084;&#1091; &#1084;&#1080;&#1088;&#1091;. &#1059; &#1085;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099;&#1080;&#1075;&#1088;&#1099;&#1096;&#1085;&#1099;&#1081;
	  &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;, &#1085;&#1086; &#1085;&#1072;&#1096;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1084;, &#1073;&#1099;&#1083;&#1086; 
	  &#1086;&#1090;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1058;&#1077;&#1088;&#1084;&#1080;&#1085; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;"
	  &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1083;&#1089;&#1103; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;
	  &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1084;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072; &#1072;&#1085;&#1090;&#1080;-&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1094;&#1080;&#1102;, &#1080;&#1083;&#1080;, &#1077;&#1097;&#1077; &#1093;&#1091;&#1078;&#1077;,
	  &#1079;&#1072; &#1074;&#1086;&#1088;&#1086;&#1074;&#1089;&#1090;&#1074;&#1086;.</em></span></p><p><span class="emphasis"><em>&#1055;&#1088;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1099; &#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1081;
	  &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1082;&#1091;&#1087;&#1103;&#1090; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;". &#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; 
	  &#1074;&#1086;&#1079;&#1100;&#1084;&#1077;&#1084; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1090;&#1091; &#1078;&#1077; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1102;, &#1090;&#1077;&#1093; &#1078;&#1077; &#1083;&#1102;&#1076;&#1077;&#1081; &#1080; &#1090;&#1077; &#1078;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077;
	  &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1080; &#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; "&#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;"? &#1058;&#1072;&#1082;&#1086;&#1077;
	  &#1086;&#1085;&#1080; &#1082;&#1091;&#1087;&#1103;&#1090;.</em></span></p><p><span class="emphasis"><em>&#1052;&#1085;&#1086;&#1075;&#1080;&#1084; &#1093;&#1072;&#1082;&#1077;&#1088;&#1072;&#1084; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086; &#1074; &#1101;&#1090;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1085;&#1086; &#1101;&#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;,
	  &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1090;&#1077;&#1093;&#1085;&#1072;&#1088;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1091;&#1084;&#1072;&#1102;&#1090; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1084;&#1080;, &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1084;&#1080;,
	  &#1080; &#1085;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090;, &#1082;&#1072;&#1082; &#1074;&#1072;&#1078;&#1077;&#1085; &#1086;&#1073;&#1088;&#1072;&#1079; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1088;&#1086;&#1076;&#1072;&#1077;&#1090;&#1077;.</em></span></p><p><span class="emphasis"><em>&#1042; &#1084;&#1072;&#1088;&#1082;&#1077;&#1090;&#1080;&#1085;&#1075;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;&#8212;&#1101;&#1090;&#1086; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;.
	  &#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1084;&#1099; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1089;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089; &#1073;&#1072;&#1088;&#1088;&#1080;&#1082;&#1072;&#1076; &#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;,
	  &#1089;&#1095;&#1080;&#1090;&#1072;&#1103;&#1089;&#1100; &#1089; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1084;&#1080;&#1088;&#1086;&#1084; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090;
	  &#1088;&#1077;&#1072;&#1083;&#1080;&#1080; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1091;&#1073;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081; &#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;.</em></span></p><p>(&#1089; <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>.  &#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;
	&#1090;&#1072;&#1084; <span class="emphasis"><em>&#1073;&#1099;&#1083;</em></span>.OSI &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086; &#1091;&#1073;&#1088;&#1072;&#1083;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089; &#1089;&#1072;&#1081;&#1090;&#1072; &#1089; &#1090;&#1086;&#1075;&#1086;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1085;&#1086; &#1080;&#1093; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; 
      <a class="ulink" href="http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php" target="_top">http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php</a>
      &#1080;
      <a class="ulink" href="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a>.)</p></blockquote></div><p>&#1042;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1094;&#1077;&#1083;&#1099;&#1093; &#1072;&#1081;&#1089;&#1073;&#1077;&#1088;&#1075;&#1086;&#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1088;&#1077;&#1095;&#1080;&#1081; &#1074;&#1080;&#1076;&#1085;&#1099; &#1074; &#1101;&#1090;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;. &#1054;&#1085; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1085;&#1072; "&#1085;&#1072;&#1096;&#1080; &#1091;&#1073;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;", &#1085;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1084;&#1085;&#1086; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1077;&#1090; &#1090;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082;&#1086;&#1074;&#1099;
&#1101;&#1090;&#1080; &#1091;&#1073;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;. &#1044;&#1083;&#1103; &#1086;&#1076;&#1085;&#1080;&#1093; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1073;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1076; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1081;
&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; &#1086;&#1073; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1089;&#1090;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1083;&#1091;&#1095;&#1096;&#1080;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1073;&#1099;&#1090;&#1100; &#1091;&#1073;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1097;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;. &#1042;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; "&#1074;&#1086;&#1088;&#1086;&#1074;&#1089;&#1090;&#1074;&#1086;" &#1076;&#1083;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; (&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;) &#1085;&#1072; &#1085;&#1077;&#1079;&#1072;&#1082;&#1086;&#1085;&#1085;&#1086;&#1077; 
&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#8212;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1089;&#1091;&#1090;&#1080;
&#1101;&#1090;&#1086; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1088;&#1086;&#1074;&#1089;&#1090;&#1074;&#1086;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1083;&#1072;&#1076;&#1077;&#1083;&#1077;&#1094; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1083;&#1072;&#1076;&#1077;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1086;&#1084;.
&#1053;&#1077;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086; &#1080; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086; &#1086;&#1073;&#1074;&#1080;&#1085;&#1077;&#1085;&#1086; &#1074; &#1072;&#1085;&#1090;&#1080;-&#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1094;&#1080;&#1080;, &#1085;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086; &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1083;&#1080; &#1101;&#1090;&#1086; &#1086;&#1073;&#1074;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076; &#1089;&#1086;&#1073;&#1086;&#1081; &#1082;&#1072;&#1082;&#1091;&#1102;-&#1083;&#1080;&#1073;&#1086; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1086;&#1089;&#1085;&#1086;&#1074;&#1091;.</p><p>&#1069;&#1090;&#1080; &#1092;&#1072;&#1082;&#1090;&#1099; &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1085;&#1077; &#1076;&#1072;&#1102;&#1090; &#1085;&#1072;&#1084; &#1087;&#1086;&#1074;&#1086;&#1076;&#1072; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1072;&#1081;&#1090; OSI 
&#1085;&#1077;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085; &#1080;&#1083;&#1080; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090; &#1074; &#1079;&#1072;&#1073;&#1083;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082;. &#1057;&#1082;&#1086;&#1088;&#1077;&#1077;, &#1101;&#1090;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;
&#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;, &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084; OSI, &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; 
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;: &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1084;&#1072;&#1088;&#1082;&#1077;&#1090;&#1080;&#1085;&#1075;, &#1075;&#1076;&#1077; "&#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081;" &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; "&#1078;&#1080;&#1079;&#1085;&#1077;&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099;&#1081; &#1074; &#1084;&#1080;&#1088;&#1077; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072;."
&#1050;&#1086;&#1084;&#1080;&#1090;&#1077;&#1090; &#1087;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102; &#1089; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1050;&#1086;&#1076;&#1086;&#1084; &#1076;&#1072;&#1083; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1084;&#1091;
&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1091; &#1083;&#1102;&#1076;&#1077;&#1081; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1080;&#1089;&#1082;&#1072;&#1083;&#1080;&#8212;&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072; &#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; &#1082;&#1072;&#1082; &#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1080;&#1082;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1080; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072;, &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1080;&#1076;&#1077;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;
&#1082;&#1088;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1093;&#1086;&#1076;&#1072;.</p></div><p>&#1055;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1050;&#1086;&#1084;&#1080;&#1090;&#1077;&#1090;&#1072; &#1087;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084;&#1091; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102; &#1089; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1050;&#1086;&#1076;&#1086;&#1084;
&#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1086; &#1083;&#1072;&#1085;&#1076;&#1096;&#1072;&#1092;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1085;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1083;&#1086;
&#1076;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1073;&#1099;&#1083;&#1072; &#1073;&#1077;&#1079;&#1099;&#1084;&#1103;&#1085;&#1085;&#1086;&#1081;, &#1080; &#1076;&#1077;&#1083;&#1072;&#1103; &#1101;&#1090;&#1086;, &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083;&#1086;
&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091; &#1085;&#1077;&#1075;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1072;&#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1103;&#1103;, &#1090;&#1072;&#1082; &#1080;
&#1074;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1072;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1073;&#1077;&#1080;&#1084; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;
&#1085;&#1072;&#1081;&#1090;&#1080; &#1086;&#1073;&#1097;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1080;&#1079; &#1086;&#1073;&#1086;&#1080;&#1093;
&#1083;&#1072;&#1075;&#1077;&#1088;&#1077;&#1081;, &#1090;&#1072;&#1082; &#1078;&#1077; &#1082;&#1072;&#1082; &#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1085;&#1080; &#1074; &#1086;&#1076;&#1085;&#1091; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102;
&#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1102;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1083;&#1102;&#1076;&#1080; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090; &#1086; &#1084;&#1086;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1084;&#1086;&#1090;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080;&#8212;
&#1080;&#1085;&#1086;&#1075;&#1076;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090;&#1082;&#1083;&#1086;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; "&#1093;&#1072;&#1082;&#1077;&#1088;&#1089;&#1082;&#1086;&#1081; &#1101;&#1090;&#1080;&#1082;&#1080;".
&#1053;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;/&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; 
&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1088;&#1077;&#1076;&#1082;&#1086; &#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1091;&#1102; &#1089;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1084;&#1086;&#1090;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1042;&#1082;&#1083;&#1072;&#1076; &#1075;&#1083;&#1072;&#1074;&#1085;&#1077;&#1077; &#1074;&#1082;&#1083;&#1072;&#1076;&#1095;&#1080;&#1082;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1087;&#1080;&#1096;&#1077;&#1090; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1082;&#1086;&#1076;, &#1074;&#1099; &#1085;&#1077; &#1089;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090;&#1077; &#1077;&#1075;&#1086;,
&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1083;&#1080; &#1086;&#1085; &#1101;&#1090;&#1086; &#1087;&#1086; &#1085;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1080;&#1083;&#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1077;&#1084;&#1091; &#1087;&#1083;&#1072;&#1090;&#1080;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1076;&#1072;&#1090;&#1077;&#1083;&#1100;, &#1080;&#1083;&#1080;
&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085; &#1091;&#1083;&#1091;&#1095;&#1096;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1077; &#1088;&#1077;&#1079;&#1102;&#1084;&#1077;, &#1080;&#1083;&#1080; &#1087;&#1086; &#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1077;. &#1042;&#1099; &#1086;&#1094;&#1077;&#1085;&#1080;&#1074;&#1072;&#1077;&#1090;&#1077; &#1074;&#1082;&#1083;&#1072;&#1076; &#1085;&#1072;
&#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081; &#1080; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090;&#1077; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081;. &#1044;&#1072;&#1078;&#1077; &#1103;&#1074;&#1085;&#1086; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;
&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; Debian, &#1095;&#1100;&#1077;&#1081; &#1094;&#1077;&#1083;&#1100;&#1102; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; 100% &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1081;
(&#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082;, "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1072;&#1082; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072;") &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1088;&#1077;&#1076;&#1099;, &#1103;&#1074;&#1085;&#1086; &#1085;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1103;&#1090;&#1089;&#1103; &#1086;&#1073;
&#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089; &#1085;&#1077;-&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1080; &#1086; &#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; 
&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082;&#1080;&#1093; &#1078;&#1077; &#1094;&#1077;&#1083;&#1077;&#1081;.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp4935952" href="#idp4935952" class="para">2</a>] </sup>&#1053;&#1072; SourceForge.net, &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1093;&#1086;&#1089;&#1090;&#1080;&#1085;&#1075;-&#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; 
&#1090;&#1072;&#1082;&#1080;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;,&#1082; &#1072;&#1087;&#1088;&#1077;&#1083;&#1102; 2004 &#1075;&#1086;&#1076;&#1072; &#1080;&#1093; &#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; 79,225. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1101;&#1090;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072;
&#1076;&#1072;&#1083;&#1077;&#1082;&#1072; &#1086;&#1090; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077;, &#1086;&#1085;&#1072; &#1086;&#1090;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1083;&#1080;&#1096;&#1100; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; 
&#1090;&#1077;&#1093;, &#1095;&#1090;&#1086; &#1080;&#1079;&#1073;&#1088;&#1072;&#1083;&#1080; &#1089;&#1074;&#1086;&#1080;&#1084; &#1093;&#1086;&#1089;&#1090;&#1080;&#1085;&#1075;&#1086;&#1084; SourceForge</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5046544" href="#idp5046544" class="para">3</a>] </sup>&#1057;&#1090;&#1086;&#1083;&#1083;&#1084;&#1101;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;
&#1089;&#1083;&#1086;&#1074;&#1086; "&#1093;&#1072;&#1082;&#1077;&#1088;", &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1103; &#1087;&#1086;&#1076; &#1085;&#1080;&#1084; "&#1083;&#1102;&#1073;&#1086;&#1075;&#1086;, &#1082;&#1090;&#1086; &#1083;&#1102;&#1073;&#1080;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;
&#1091;&#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1080;&#1077; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103;", &#1072; &#1085;&#1077; &#1074; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077;
"&#1083;&#1102;&#1073;&#1086;&#1081;, &#1082;&#1090;&#1086; &#1074;&#1090;&#1086;&#1088;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099;"</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5015904" href="#idp5015904" class="para">4</a>] </sup>&#1069;&#1090;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; "GNU &#1085;&#1077; Unix", &#1072; "GNU" &#1074; &#1101;&#1090;&#1086;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080;
&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;...&#1101;&#1090;&#1091; &#1078;&#1077; &#1092;&#1088;&#1072;&#1079;&#1091;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5084336" href="#idp5084336" class="para">5</a>] </sup>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, Linux &#1085;&#1077; &#1073;&#1099;&#1083;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081;. 
&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1076;&#1083;&#1103; IBM-&#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; 386BSD, 
&#1074;&#1099;&#1096;&#1083;&#1072; &#1085;&#1077;&#1079;&#1072;&#1076;&#1086;&#1083;&#1075;&#1086; &#1076;&#1086; Linux. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, 386BSD &#1073;&#1099;&#1083;&#1086; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1077; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;. 
Linux &#1085;&#1072;&#1076;&#1077;&#1083;&#1072;&#1083;&#1072; &#1084;&#1085;&#1086;&#1075;&#1086; &#1096;&#1091;&#1084;&#1072; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1072; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1081;, &#1085;&#1086; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;,
&#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1089; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1083;&#1072; &#1074;&#1072;&#1096; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088; &#1087;&#1086;&#1089;&#1083;&#1077;
&#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1074;&#1099; &#1077;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080;.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5083920" href="#idp5083920" class="para">6</a>] </sup>&#1054;&#1085;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083;&#1080; &#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; 
"&#1054;&#1082;&#1086;&#1085;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; X (X Window System)", &#1085;&#1086; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;, &#1083;&#1102;&#1076;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; &#1077;&#1077;
"&#1048;&#1082;&#1089; &#1054;&#1082;&#1085;&#1072; (X Windows,&#1074; &#1056;&#1086;&#1089;&#1089;&#1080;&#1080; &#1085;&#1077;&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; "&#1080;&#1082;&#1089;&#1099;&#769;")", &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100; &#1090;&#1088;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1088;&#1086;&#1084;&#1086;&#1079;&#1076;&#1082;&#1086;
.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5125024" href="#idp5125024" class="para">7</a>] </sup>&#1050;&#1090;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1088;&#1072;&#1090;&#1100; &#1076;&#1077;&#1085;&#1100;&#1075;&#1080; &#1079;&#1072; &#1088;&#1072;&#1079;&#1076;&#1072;&#1095;&#1091; &#1082;&#1086;&#1087;&#1080;&#1081;
&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1086;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1087;&#1088;&#1077;&#1090;&#1080;&#1090;&#1100;
&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; &#1074; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1080;&#1093; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;, &#1094;&#1077;&#1085;&#1072; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;
&#1091;&#1087;&#1072;&#1076;&#1077;&#1090; &#1076;&#1086; &#1085;&#1091;&#1083;&#1103;.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5127536" href="#idp5127536" class="para">8</a>] </sup>
&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; Netscape Navigator <span class="emphasis"><em>&#1073;&#1099;&#1083;</em></span> &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074; &#1073;&#1099;&#1083; &#1074;&#1099;&#1087;&#1091;&#1097;&#1077;&#1085; &#1087;&#1086;&#1076;
&#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1077;&#1081; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1074; 1998 &#1080; &#1089;&#1090;&#1072;&#1083; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1076;&#1083;&#1103; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072; &#1086;&#1090; Mozilla.
&#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a class="ulink" href="http://www.mozilla.org/" target="_top">http://www.mozilla.org/</a>.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5142400" href="#idp5142400" class="para">9</a>] </sup>&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; OSI &#1074;
&#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077; <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="disclaimer.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="today.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1044;&#1080;&#1089;&#1082;&#1083;&#1077;&#1081;&#1084;&#1077;&#1088; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;</td></tr></table></div></body></html>
