<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="communications.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;"><link rel="prev" href="bug-tracker-usage.html" title="&#1053;&#1077;&#1090; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084; &#1074; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;"><link rel="next" href="development-cycle.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 7. Packaging, Releasing, and Daily Development"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-tracker-usage.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="development-cycle.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="publicity"></a>&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</h2></div></div></div><p>&#1042; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1055;&#1054; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1090;&#1086;&#1085;&#1082;&#1072;&#1103; &#1075;&#1088;&#1072;&#1085;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1095;&#1080;&#1089;&#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084;&#1080;
&#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103;&#1084;&#1080; &#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1079;&#1072;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1054;&#1090;&#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086;
&#1094;&#1077;&#1083;&#1077;&#1074;&#1072;&#1103; &#1072;&#1091;&#1076;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1088;&#1072;&#1079;&#1084;&#1099;&#1090;&#1072;: &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1083;&#1080; &#1074;&#1089;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;
&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1085;&#1072;&#1076; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1086;&#1082;&#1088;&#1091;&#1078;&#1072;&#1102;&#1097;&#1080;&#1081; &#1084;&#1080;&#1088;. &#1050;&#1090;&#1086;-&#1090;&#1086; - &#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;
<a class="ulink" href="http://slashdot.org/" target="_top">slashdot.org</a>
&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1095;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085;&#1086;&#1074; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1082;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1083; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1074;&#1085;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1069;&#1090;&#1086; &#1092;&#1072;&#1082;&#1090;,
&#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1080;&#1088;&#1080;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1085;&#1086; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;
&#1090;&#1072;&#1082;&#1086;&#1081; &#1088;&#1080;&#1089;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1084;&#1072;&#1083;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1093;&#1086;&#1095;&#1077;&#1090;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;, &#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1074;&#1099;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1084;&#1091; &#1084;&#1080;&#1088;&#1091; &#1082;&#1072;&#1082;&#1080;&#1077; &#1080;&#1079;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1089;&#1090;&#1086;&#1103;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080;&#1079; &#1085;&#1080;&#1093; &#1085;&#1086;&#1074;&#1086;&#1089;&#1090;&#1080;.</p><p>&#1044;&#1083;&#1103; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1074; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1077;&#1089;&#1090;&#1100; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1080;&#1083;&#1080; &#1087;&#1103;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074;
&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1072;&#1076;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#1043;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081;,
&#1095;&#1077;&#1084; &#1083;&#1102;&#1073;&#1091;&#1102; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077;
&#1079;&#1076;&#1077;&#1089;&#1100; &#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1091;. &#1056;&#1077;&#1082;&#1083;&#1072;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1086;&#1081; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1077; &#1088;&#1077;&#1079;&#1102;&#1084;&#1077;, &#1086;&#1090;&#1089;&#1099;&#1083;&#1072;&#1102;&#1097;&#1077;&#1077; &#1082;
&#1087;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;&#1091; (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1080;&#1078;&#1077;) &#1079;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;.</p></li><li class="listitem"><p>&#1042; &#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1091; &#1074;&#1072;&#1089; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1072; web-&#1089;&#1072;&#1081;&#1090;&#1077; &#1076;&#1083;&#1103; "&#1053;&#1086;&#1074;&#1086;&#1089;&#1090;&#1077;&#1081;" &#1080;&#1083;&#1080;
"&#1055;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;&#1086;&#1074;", &#1075;&#1076;&#1077; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093;. &#1054;&#1090;&#1095;&#1072;&#1089;&#1090;&#1080;, &#1094;&#1077;&#1083;&#1100;
&#1087;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;&#1072; - &#1101;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081;, &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; "&#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;", &#1085;&#1072;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1072;&#1081;&#1090;&#1099;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1072;&#1073;&#1086;&#1090;&#1100;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085; &#1073;&#1099;&#1083;
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;: &#1083;&#1080;&#1073;&#1086; &#1086;&#1076;&#1085;&#1072; web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1085;&#1072; &#1086;&#1076;&#1080;&#1085; &#1088;&#1077;&#1083;&#1080;&#1079;, &#1082;&#1072;&#1082;
&#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1090;&#1072;&#1090;&#1100;&#1103; &#1073;&#1083;&#1086;&#1075;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086;
&#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1073;&#1099; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086;&#1081; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1088;&#1077;&#1083;&#1080;&#1079;&#1086;&#1074; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1084;&#1077;&#1089;&#1090;&#1077;.</p></li><li class="listitem"><p> &#1045;&#1089;&#1083;&#1080; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1083;&#1077;&#1085;&#1090;&#1072; RSS (&#1089;&#1084;. <a class="xref" href="rss.html" title="RSS Feeds">«RSS Feeds»</a>),
&#1087;&#1086;&#1079;&#1072;&#1073;&#1086;&#1090;&#1100;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1087;&#1072;&#1083;&#1086; &#1080; &#1090;&#1091;&#1076;&#1072;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1087;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;&#1072;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1091;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085; &#1074;&#1072;&#1096;
&#1089;&#1072;&#1081;&#1090;.</p></li><li class="listitem"><p>&#1045;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1055;&#1054;, &#1090;&#1086; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;
&#1086; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1085;&#1072;  <a class="ulink" href="http://freshmeat.net/" target="_top">http://freshmeat.net/</a> (&#1089;&#1084;.<a class="xref" href="announcing.html" title="Announcing">«Announcing»</a> 
&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079;). &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1085;&#1072; Freshmeat,
&#1101;&#1090;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1085;&#1077;&#1074;&#1085;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; Freshmeat. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; Freshmeat, &#1085;&#1086; &#1080; &#1085;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1086;&#1088;&#1090;&#1072;&#1083;&#1072;&#1093; (&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103;
            <a class="ulink" href="http://slashdot.org" target="_top">http://slashdot.org</a>) &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1099;&#1077; &#1090;&#1086;&#1083;&#1087;&#1099; &#1083;&#1102;&#1076;&#1077;&#1081;. Freshmeat
&#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1101;&#1090;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1083;&#1077;&#1085;&#1090;&#1091; RSS, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1083;&#1102;&#1076;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077;
&#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1085;&#1072; RSS-&#1083;&#1077;&#1085;&#1090;&#1091; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1089;&#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;
&#1095;&#1077;&#1088;&#1077;&#1079; &#1083;&#1077;&#1085;&#1090;&#1091; Freshmeat.</p></li><li class="listitem"><p>&#1055;&#1086;&#1096;&#1083;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1085;&#1086;&#1074;&#1086;&#1089;&#1090;&#1085;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; "announce", &#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, <code class="literal">announce@yourprojectdomain.org</code>,
            &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1101;&#1090;&#1086; &#1091;&#1078;&#1077; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1077;
&#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1091;&#1089;&#1090;&#1072;&#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1091;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1077;&#1085;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1090;&#1072;&#1082;&#1080;&#1093;
&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086; &#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1093; &#1055;&#1054;, &#1085;&#1086; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080; &#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;
&#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;&#1093;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1082;&#1072;&#1084;&#1087;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1089;&#1073;&#1086;&#1088;&#1091; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;, &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1088;&#1077;&#1096;&#1077;&#1081; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;
(&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; <a class="xref" href="publicity.html#security" title="&#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1076;&#1099;&#1088;&#1072;&#1093; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;">«&#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1076;&#1099;&#1088;&#1072;&#1093; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;»</a>)<span> &#1085;&#1080;&#1078;&#1077; &#1074; &#1101;&#1090;&#1086;&#1081;
&#1075;&#1083;&#1072;&#1074;&#1077;</span>, &#1080;&#1083;&#1080; &#1074;&#1072;&#1078;&#1085;&#1099;&#1077; &#1089;&#1076;&#1074;&#1080;&#1075;&#1080; &#1074; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1090;&#1088;&#1072;&#1092;&#1080;&#1082; &#1084;&#1072;&#1083; &#1080;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1074;&#1077;&#1097;&#1077;&#1081;, &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; announce &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077;
&#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1086;&#1074; &#1089;&#1088;&#1077;&#1076;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1101;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099;
&#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1083;&#1086;&#1091;&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1083;&#1103;&#1090;&#1100; &#1101;&#1090;&#1080;&#1084; - &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1085;&#1100;&#1082;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100;). &#1063;&#1090;&#1086;&#1073;&#1099;
&#1086;&#1075;&#1088;&#1072;&#1076;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1086;&#1090; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; &#1080;&#1083;&#1080;, &#1077;&#1097;&#1105; &#1093;&#1091;&#1078;&#1077;, &#1089;&#1087;&#1072;&#1084;&#1072;, &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;
<code class="literal">announce</code> &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1084;&#1086;&#1076;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;.</p></li></ol></div><p>&#1055;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1101;&#1090;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;. &#1051;&#1102;&#1076;&#1077;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1074; &#1079;&#1072;&#1073;&#1083;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1077;&#1089;&#1083;&#1080;
&#1086;&#1085;&#1080; &#1085;&#1077; &#1074;&#1080;&#1076;&#1103;&#1090; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080;&#1083;&#1080; &#1074; &#1087;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;&#1072;&#1093;.
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1087;&#1086;&#1095;&#1090;&#1091;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1080; &#1090;.&#1076;.) &#1074;
&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1072;&#1083;&#1080; &#1080;&#1093; &#1074;&#1089;&#1077; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1082;&#1085;&#1086;
&#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1084;.</p><p>&#1044;&#1083;&#1103; &#1084;&#1077;&#1085;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; &#1080;&#1083;&#1080; &#1074;&#1089;&#1077; &#1080;&#1079; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1093;
&#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074;. &#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1095;&#1077;&#1085;&#1086; &#1074;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1084; &#1084;&#1080;&#1088;&#1077; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090;
&#1077;&#1075;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1086;&#1074;&#1099;&#1081; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082; &#1055;&#1054; - &#1101;&#1090;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1090;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; - &#1093;&#1086;&#1090;&#1103; &#1080; &#1085;&#1077;&#1095;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077;, &#1085;&#1086; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1090;&#1072;&#1082;&#1086;&#1077;
&#1074;&#1072;&#1078;&#1085;&#1086;&#1077;, &#1082;&#1072;&#1082; &#1089;&#1072;&#1084; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1076;&#1072;&#1090;&#1099; - &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1077;&#1078;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1099;&#1093;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; (&#1072; &#1085;&#1077; &#1076;&#1083;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; announce), &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080;
web-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1085;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077;.</p><p>&#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1101;&#1090;&#1086;, &#1074;&#1099; &#1074;&#1089;&#1105; &#1078;&#1077; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1090;&#1072; &#1088;&#1077;&#1083;&#1080;&#1079;&#1072; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103;&#1093;
&#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093; &#1074; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077;, &#1075;&#1076;&#1077; &#1077;&#1089;&#1090;&#1100; &#1083;&#1102;&#1076;&#1080;, &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;. &#1051;&#1102;&#1076;&#1080;-&#1085;&#1077;&#1074;&#1080;&#1076;&#1080;&#1084;&#1082;&#1080;
&#1074; &#1074;&#1072;&#1096;&#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1093; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1083;&#1091;&#1096;&#1072;&#1102;&#1090; &#1080; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090;, &#1085;&#1077;
&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1084;&#1086;&#1083;&#1095;&#1072;&#1090; &#1075;&#1076;&#1077;-&#1090;&#1086; &#1077;&#1097;&#1105;. &#1053;&#1072;&#1088;&#1086;&#1076;&#1085;&#1072;&#1103; &#1084;&#1086;&#1083;&#1074;&#1072; - &#1086;&#1095;&#1077;&#1085;&#1100; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1081; &#1082;&#1072;&#1085;&#1072;&#1083;
&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084; &#1080; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1076;&#1072;&#1078;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1099;&#1077;
&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1042;
&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1091;&#1102; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102;-&#1076;&#1083;&#1103;-&#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086; &#1074;&#1099; &#1087;&#1080;&#1096;&#1080;&#1090;&#1077;
&#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1059;&#1090;&#1086;&#1095;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1083;&#1072;&#1085;&#1086;&#1074;: &#1084;&#1099; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1084; &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; 2.0 Scanley &#1074; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077;
	&#1040;&#1074;&#1075;&#1091;&#1089;&#1090;&#1072; 2005 &#1075;&#1086;&#1076;&#1072;. &#1042;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072;
	http://www.scanley.org/status.html. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1085;&#1086;&#1074;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1080;&#1089;&#1082;
	&#1087;&#1086; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1084; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;.</em></span></p><p><span class="emphasis"><em>&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1085;&#1086;&#1074;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;: ... &#1058;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077;
	&#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103;: ...</em></span></p></blockquote></div><p>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092; - &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1081;, &#1074;&#1099;&#1076;&#1072;&#1105;&#1090; &#1076;&#1074;&#1077; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1077; &#1087;&#1086;&#1088;&#1094;&#1080;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; (&#1076;&#1072;&#1090;&#1072;
&#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1080; &#1075;&#1083;&#1072;&#1074;&#1085;&#1072;&#1103; &#1085;&#1086;&#1074;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;), &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; URL &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1073;&#1091;&#1076;&#1091;&#1097;&#1080;&#1093; &#1085;&#1086;&#1074;&#1086;&#1089;&#1090;&#1077;&#1081;.
&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092; - &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1081;&#1076;&#1105;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; &#1095;&#1100;&#1105;-&#1090;&#1086; &#1089;&#1080;&#1090;&#1086;, - &#1101;&#1090;&#1086; &#1090;&#1086;&#1078;&#1077;
&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;. &#1054;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;, &#1085;&#1077; &#1080;&#1089;&#1082;&#1072;&#1078;&#1072;&#1103; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086;.
&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1083;&#1102;&#1076;&#1080; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1076;&#1072;&#1076;&#1091;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086; &#1086;&#1085;&#1080;
&#1073;&#1091;&#1076;&#1091;&#1090; &#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100;. &#1059;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086;, &#1074;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1080;&#1090;&#1100; &#1080;&#1084; &#1101;&#1090;&#1086; &#1079;&#1072;&#1085;&#1103;&#1090;&#1080;&#1077; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102; &#1074;&#1099;&#1075;&#1086;&#1076;&#1091; &#1086; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;,
&#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1094;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;.</p><div class="sect2" title="&#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1076;&#1099;&#1088;&#1072;&#1093; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;"><div class="titlepage"><div><div><h3 class="title"><a name="security"></a>&#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1076;&#1099;&#1088;&#1072;&#1093; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;</h3></div></div></div><p>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1084; &#1086;&#1073; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1084;
&#1086; &#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;. &#1042; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1084; &#1055;&#1054; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1089;&#1105; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086; &#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086; - &#1101;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;
&#1087;&#1086;&#1095;&#1090;&#1080; &#1088;&#1077;&#1083;&#1080;&#1075;&#1080;&#1086;&#1079;&#1085;&#1086;&#1077; &#1082;&#1088;&#1077;&#1076;&#1086;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1096;&#1072;&#1075; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;
&#1074;&#1080;&#1076;&#1077;&#1085; &#1074;&#1089;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1093;&#1086;&#1095;&#1077;&#1090; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;: &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1095;&#1105;&#1090;&#1072;, &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1102;&#1097;&#1072;&#1103;
&#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103; &#1080; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;.</p><p>&#1054;&#1096;&#1080;&#1073;&#1082;&#1080; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077; &#1090;&#1072;&#1082;&#1080;&#1077;. &#1054;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1077;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;
&#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;. &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099;
&#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1086;&#1081; &#1074;&#1086; &#1074;&#1089;&#1077;&#1084; &#1084;&#1080;&#1088;&#1077; - &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1074;&#1089;&#1077;&#1093; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1083;&#1086;&#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;. &#1044;&#1072;&#1078;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; commit &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1072;&#1085;&#1086;&#1085;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; (&#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1099; commit'&#1086;&#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1099;&#1080;&#1089;&#1082;&#1080;&#1074;&#1072;&#1103;
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1082;&#1086;&#1076;&#1077; &#1076;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;).
&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1096;&#1072;&#1075;&#1086;&#1074; &#1076;&#1083;&#1103;
&#1091;&#1088;&#1077;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072;
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093;:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#1053;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;; &#1079;&#1072;&#1090;&#1077;&#1084;
&#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;.</p></li><li class="listitem"><p>&#1055;&#1086;&#1090;&#1086;&#1088;&#1086;&#1087;&#1080;&#1090;&#1077;&#1089;&#1100; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; - &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1083; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1074;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077;
&#1086;&#1076;&#1080;&#1085; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1074;&#1085;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;.</p></li></ol></div><p>&#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1090;&#1072;&#1082;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103;&#1090; &#1082; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1077;&#1088;&#1080;&#1080; &#1096;&#1072;&#1075;&#1086;&#1074;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1093;.</p><div class="sect3" title="&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;"><div class="titlepage"><div><div><h4 class="title"><a name="security-receiving"></a>&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1086;&#1090;&#1095;&#1105;&#1090;</h4></div></div></div><p>&#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1085;&#1091;&#1078;&#1085;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1086;&#1090; &#1082;&#1086;&#1075;&#1086; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1074;
&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1053;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1083;&#1103; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1074; &#1086;&#1073; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;,
&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1079;&#1072;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;
&#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1105;&#1084;&#1072; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1074; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1059; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086;
&#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1097;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072; &#1080; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1080; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; -
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;, &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1080; &#1073;&#1099;&#1090;&#1100;.
&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; "&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1099;&#1081;", &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
"&#1083;&#1102;&#1073;&#1086;&#1081;, &#1091; &#1082;&#1086;&#1075;&#1086; &#1073;&#1099;&#1083; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1085;&#1072; commit &#1076;&#1074;&#1072; &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1075;&#1086;&#1076;&#1072;" &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1074; &#1101;&#1090;&#1086;&#1084;
&#1088;&#1086;&#1076;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1092;&#1072;&#1074;&#1086;&#1088;&#1080;&#1090;&#1080;&#1079;&#1084;&#1072;. &#1069;&#1090;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;.</p><p>&#1042; &#1080;&#1076;&#1077;&#1072;&#1083;&#1077; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1084;&#1086;&#1076;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080; &#1079;&#1072;&#1097;&#1080;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1089;&#1087;&#1072;&#1084;&#1072;,
&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1074;&#1099; &#1085;&#1077; &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1072;&#1078;&#1085;&#1099;&#1081; &#1086;&#1090;&#1095;&#1105;&#1090; &#1073;&#1099;&#1083; &#1086;&#1090;&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1085; &#1080;&#1083;&#1080; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;
&#1095;&#1090;&#1086; &#1074; &#1101;&#1090;&#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1084;&#1086;&#1076;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1085;&#1077; &#1073;&#1099;&#1083; &#1074; &#1089;&#1077;&#1090;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1099;&#1085;&#1091;&#1078;&#1076;&#1077;&#1085;&#1099;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1055;&#1054; &#1076;&#1083;&#1103; &#1079;&#1072;&#1097;&#1080;&#1090;&#1099; &#1086;&#1090; &#1089;&#1087;&#1072;&#1084;&#1072;, &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1086;&#1095;&#1077;&#1085;&#1100;
&#1084;&#1103;&#1075;&#1082;&#1080;&#1084;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;&#1084;&#1080;; &#1083;&#1091;&#1095;&#1096;&#1077; &#1087;&#1091;&#1089;&#1090;&#1100; &#1073;&#1091;&#1076;&#1077;&#1090; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1089;&#1087;&#1072;&#1084;, &#1095;&#1077;&#1084; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1095;&#1105;&#1090;.
&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1073;&#1099;&#1083; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1086;&#1090;&#1088;&#1077;&#1082;&#1083;&#1072;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;; &#1085;&#1086;,
&#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077;&#1084;&#1086;&#1076;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1089;&#1083;&#1072;&#1073;&#1086; &#1079;&#1072;&#1097;&#1080;&#1097;&#1105;&#1085;&#1085;&#1099;&#1084; &#1086;&#1090; &#1089;&#1087;&#1072;&#1084;&#1072;,
&#1087;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; &#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103;
&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;
<a class="xref" href="mailing-lists.html#address-hiding" title="Address hiding in archives">«Address hiding in archives»</a><span> &#1074;
<a class="xref" href="technical-infrastructure.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;">&#1043;&#1083;&#1072;&#1074;&#1072; 3, <i>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</i></a></span>.
&#1050; &#1089;&#1095;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1077;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1099;&#1084;; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;
<a class="ulink" href="http://subversion.tigris.org/security.html" target="_top">http://subversion.tigris.org/security.html</a>, &#1080; &#1077;&#1105;
HTML-&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;.</p></div><div class="sect3" title="&#1053;&#1077;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h4 class="title"><a name="security-finding-a-fix"></a>&#1053;&#1077;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</h4></div></div></div><p>&#1063;&#1090;&#1086; &#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1086;&#1090;&#1095;&#1105;&#1090;? &#1055;&#1077;&#1088;&#1074;&#1072;&#1103;
&#1079;&#1072;&#1076;&#1072;&#1095;&#1072; - &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1089;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#1053;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1072; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;? &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1083;&#1080; &#1086;&#1085;&#1072; &#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082;&#1091; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; 
&#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1085;&#1072;&#1076; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074;&#1072;&#1096;&#1077; &#1055;&#1054;? &#1048;&#1083;&#1080;, &#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1087;&#1086;&#1076;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1093; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;?</p></li><li class="listitem"><p>&#1053;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;? &#1044;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1076;&#1083;&#1103; &#1072;&#1090;&#1072;&#1082;&#1080; &#1080;&#1083;&#1080;
&#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090;&#1089;&#1103; &#1086;&#1073;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103;, &#1076;&#1086;&#1075;&#1072;&#1076;&#1082;&#1080;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1086;&#1087;&#1099;&#1090;&#1077;, &#1080; &#1091;&#1076;&#1072;&#1095;&#1072;?</p></li><li class="listitem"><p><span class="emphasis"><em>&#1050;&#1090;&#1086;</em></span> &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1083; &#1074;&#1072;&#1084; &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1077;? &#1054;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1087;&#1088;&#1080;&#1088;&#1086;&#1076;&#1099; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1086; &#1086;&#1085; &#1076;&#1072;&#1105;&#1090; &#1074;&#1072;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;
&#1090;&#1086;&#1084;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1088;&#1086;&#1076;&#1091; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086; &#1085;&#1077;&#1081; &#1079;&#1085;&#1072;&#1090;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1090;&#1095;&#1105;&#1090; &#1087;&#1088;&#1080;&#1096;&#1105;&#1083; &#1086;&#1090; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093;
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1079;&#1076;&#1086;&#1093;&#1085;&#1091;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1077;&#1077; (&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1091;&#1090;&#1100;-&#1095;&#1091;&#1090;&#1100;),
&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1076;&#1077;&#1103;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1085;&#1077; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1082;&#1086;&#1084;&#1091;-&#1090;&#1086; &#1077;&#1097;&#1105;.
&#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1087;&#1088;&#1080;&#1096;&#1105;&#1083; &#1086;&#1090; <code class="literal">anonymous14@globalhackerz.net</code>
&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1083;&#1091;&#1095;&#1096;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1072;&#1095;&#1085;&#1105;&#1090;&#1077;
&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;. &#1063;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074;, &#1086;&#1082;&#1072;&#1079;&#1072;&#1083; &#1074;&#1072;&#1084; &#1091;&#1089;&#1083;&#1091;&#1075;&#1091;,
&#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1074; &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1077;, &#1085;&#1086; &#1074;&#1099; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084; &#1077;&#1097;&#1105; &#1083;&#1102;&#1076;&#1103;&#1084; &#1086;&#1085; &#1101;&#1090;&#1086;
&#1089;&#1082;&#1072;&#1079;&#1072;&#1083;, &#1080;&#1083;&#1080; &#1082;&#1072;&#1082; &#1076;&#1086;&#1083;&#1075;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1078;&#1076;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102;
&#1085;&#1072; &#1078;&#1080;&#1074;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103;&#1093;.</p></li></ol></div><p>&#1054;&#1090;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1099; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1084;, &#1095;&#1072;&#1089;&#1090;&#1086; &#1083;&#1077;&#1078;&#1080;&#1090; &#1084;&#1077;&#1078;&#1076;&#1091;
<span class="emphasis"><em>&#1089;&#1088;&#1086;&#1095;&#1085;&#1086;</em></span> &#1080; <span class="emphasis"><em>&#1095;&#1088;&#1077;&#1079;&#1074;&#1099;&#1095;&#1072;&#1081;&#1085;&#1086; &#1089;&#1088;&#1086;&#1095;&#1085;&#1086;</em></span>.
&#1044;&#1072;&#1078;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1090;&#1095;&#1105;&#1090; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1077;&#1090; &#1080;&#1079; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086;,
&#1076;&#1088;&#1091;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1074; &#1057;&#1077;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1072;&#1074;&#1085;&#1086;
&#1085;&#1072;&#1096;&#1083;&#1080; &#1101;&#1090;&#1091; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1102;&#1090; &#1086; &#1085;&#1077;&#1081;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1105; &#1085;&#1077;
&#1090;&#1072;&#1082; &#1089;&#1088;&#1086;&#1095;&#1085;&#1086;, &#1101;&#1090;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1081; &#1087;&#1088;&#1080;&#1088;&#1086;&#1076;&#1077; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086; &#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072;
&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100;.</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089; "<code class="literal">anonymous14@globalhackerz.net</code>" &#1082;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1085;&#1077; &#1096;&#1091;&#1090;&#1082;&#1072;.
&#1042;&#1099; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1086;&#1090; &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1087;&#1086; &#1080;&#1093;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1084; &#1080; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1102;, &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1086;&#1090;&#1085;&#1077;&#1089;&#1090;&#1080; &#1085;&#1080; &#1085;&#1072; &#1074;&#1072;&#1096;&#1091; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091;, &#1085;&#1080; &#1085;&#1072;
&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1091;&#1102;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;: &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1083;&#1080; &#1074;&#1072;&#1084; &#1086; &#1076;&#1099;&#1077; &#1074;
&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1086;&#1085;&#1080; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1074;&#1072;&#1084; &#1076;&#1086;&#1073;&#1088;&#1086;, &#1080; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1090;&#1100; &#1090;&#1077;&#1084; &#1078;&#1077;.
&#1055;&#1086;&#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1080;&#1090;&#1077; &#1080;&#1093; &#1079;&#1072; &#1086;&#1090;&#1095;&#1105;&#1090;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1077; &#1076;&#1072;&#1090;&#1091;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1080;&#1083;&#1080; &#1076;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081;, &#1074;&#1099; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;
&#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1085;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1081;&#1090;&#1077;&#1089;&#1100; &#1086;&#1073; &#1101;&#1090;&#1080;&#1093; &#1083;&#1102;&#1076;&#1103;&#1093;. &#1048;&#1085;&#1086;&#1075;&#1076;&#1072;
&#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; <span class="emphasis"><em>&#1074;&#1072;&#1084;</em></span> &#1076;&#1072;&#1090;&#1091; - &#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1085;&#1077;&#1076;&#1074;&#1091;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;
&#1091;&#1075;&#1088;&#1086;&#1078;&#1072;&#1090;&#1100; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1076;&#1077;&#1085;&#1100;, &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1074;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;.
&#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1082;&#1072;&#1082; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1089;&#1080;&#1083;&#1086;&#1081; &#1079;&#1072;&#1075;&#1085;&#1072;&#1090;&#1100; &#1074;&#1072;&#1089; &#1074; &#1091;&#1075;&#1086;&#1083;, &#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;,
&#1101;&#1090;&#1086; &#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1072;&#1102;&#1097;&#1077;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1096;&#1083;&#1099;&#1093; &#1088;&#1072;&#1079;&#1086;&#1095;&#1072;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1074;
&#1073;&#1077;&#1079;&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;&#1093; &#1055;&#1054;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099; &#1086; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;.
&#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1101;&#1090;&#1086;&#1090; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1088;&#1072;&#1089;&#1089;&#1077;&#1088;&#1076;&#1080;&#1083;&#1089;&#1103;. &#1042; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;
&#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1072;&#1103;, &#1086;&#1085; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1091;
&#1074;&#1072;&#1096;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; &#1090;&#1072;&#1082;&#1080;&#1084; &#1082;&#1086;&#1088;&#1088;&#1077;&#1089;&#1087;&#1086;&#1085;&#1076;&#1077;&#1085;&#1090;&#1072;&#1084; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1080; &#1085;&#1072;&#1076;&#1077;&#1081;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086;
&#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1074;&#1072;&#1084; &#1090;&#1072;&#1082;&#1078;&#1077;.</p><p>&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1099;&#1081; &#1082;&#1086;&#1088;&#1088;&#1077;&#1089;&#1087;&#1086;&#1085;&#1076;&#1077;&#1085;&#1090;, &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1102;&#1097;&#1080;&#1081; &#1086; &#1076;&#1099;&#1088;&#1072;&#1093; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, - &#1087;&#1088;&#1086;&#1092;&#1077;&#1089;&#1089;&#1080;&#1086;&#1085;&#1072;&#1083; &#1087;&#1086;
&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1077;&#1082;&#1090;&#1086;, &#1082;&#1090;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1091;&#1076;&#1080;&#1090;&#1086;&#1084; &#1082;&#1086;&#1076;&#1072; &#1087;&#1086; &#1078;&#1080;&#1079;&#1085;&#1080; &#1080; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090; &#1079;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;&#1080;
&#1085;&#1086;&#1074;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1074; &#1089;&#1092;&#1077;&#1088;&#1077; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1055;&#1054;. &#1069;&#1090;&#1080; &#1083;&#1102;&#1076;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080;&#1084;&#1077;&#1102;&#1090; &#1086;&#1087;&#1099;&#1090; &#1087;&#1086; &#1086;&#1073;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;
&#1079;&#1072;&#1073;&#1086;&#1088;&#1072; - &#1086;&#1085;&#1080; &#1080; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1083;&#1080; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1083;&#1080; &#1086;&#1090;&#1095;&#1105;&#1090;&#1099;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1054;&#1085;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090; &#1082;&#1088;&#1072;&#1081;&#1085;&#1080;&#1081; &#1089;&#1088;&#1086;&#1082; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1088;&#1077;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084; &#1077;&#1105; &#1086;&#1075;&#1083;&#1072;&#1089;&#1082;&#1077;. &#1050;&#1088;&#1072;&#1081;&#1085;&#1080;&#1081; &#1089;&#1088;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;,
&#1085;&#1086; &#1086;&#1085; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1088;&#1088;&#1077;&#1089;&#1087;&#1086;&#1085;&#1076;&#1077;&#1085;&#1090;&#1072;. &#1050;&#1088;&#1072;&#1081;&#1085;&#1080;&#1077; &#1089;&#1088;&#1086;&#1082;&#1080; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1083;&#1080;&#1089;&#1100;
&#1089;&#1088;&#1077;&#1076;&#1080; &#1087;&#1088;&#1086;&#1092;&#1077;&#1089;&#1089;&#1080;&#1086;&#1085;&#1072;&#1083;&#1086;&#1074; &#1087;&#1086; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1099;&#1081; &#1088;&#1099;&#1095;&#1072;&#1075; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1085;&#1072;&#1076;
&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;, &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1080;&#1093; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;. &#1058;&#1072;&#1082;
&#1095;&#1090;&#1086; &#1085;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1082;&#1088;&#1072;&#1081;&#1085;&#1080;&#1081; &#1089;&#1088;&#1086;&#1082; &#1082;&#1072;&#1082; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100;; &#1101;&#1090;&#1086; &#1086;&#1089;&#1074;&#1103;&#1097;&#1105;&#1085;&#1085;&#1072;&#1103; &#1074;&#1077;&#1082;&#1072;&#1084;&#1080; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1103;,
&#1080; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1077;&#1089;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</p><p>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099; &#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1083;&#1080; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1089;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1085;&#1072;&#1076;
&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1080;&#1089;&#1089; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1077;&#1084;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1083;&#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;
&#1101;&#1083;&#1077;&#1075;&#1072;&#1085;&#1090;&#1085;&#1086;, &#1083;&#1080;&#1073;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;; &#1074;&#1086;&#1090; &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1089;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084;
&#1082;&#1072;&#1082; &#1085;&#1072;&#1095;&#1085;&#1105;&#1090;&#1077;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1095;&#1083;&#1077;&#1085;&#1072;&#1084;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;
&#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1086; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1080;&#1085;&#1080;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074;&#1096;&#1080;&#1084; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1088;&#1088;&#1077;&#1089;&#1087;&#1086;&#1085;&#1076;&#1077;&#1085;&#1090;&#1086;&#1084;
(&#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1079;&#1072;&#1093;&#1086;&#1095;&#1077;&#1090;) &#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;.</p><p>&#1053;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;. &#1054;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1072;&#1090;&#1095;&#1072; &#1076;&#1086; &#1076;&#1072;&#1090;&#1099;
&#1086;&#1073;&#1085;&#1072;&#1088;&#1086;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1076;&#1072;&#1078;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1074; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1097;&#1080;&#1084;
&#1085;&#1077;&#1074;&#1080;&#1085;&#1085;&#1086; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1084;, &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086;. &#1042;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077;
&#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1072;&#1096;&#1080; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080; &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1080;&#1084;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1090;&#1089;&#1103;. &#1053;&#1077; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090;
&#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1093; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; &#1086; commit'&#1072;&#1093;; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;, &#1079;&#1072;&#1079;&#1086;&#1088; &#1074;
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1072;&#1084; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1080; &#1074;&#1077;&#1076;&#1100; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074;
&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1074;&#1089;&#1102; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1072;&#1090;&#1095;&#1072; &#1080; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074;
&#1082;&#1072;&#1082;&#1086;&#1084; &#1090;&#1086; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1084; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1084;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1078;&#1077; &#1086;&#1089;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1099; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;. (&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077;
&#1076;&#1077;&#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1090;&#1080;&#1087;&#1072; Arch &#1080;&#1083;&#1080; SVK, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1087;&#1086;&#1076; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1077;&#1084; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1103; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;
&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084; &#1080;&#1079;&#1074;&#1085;&#1077;.)</p></div><div class="sect3" title="&#1053;&#1086;&#1084;&#1077;&#1088;&#1072; CAN/CVE"><div class="titlepage"><div><div><h4 class="title"><a name="security-cve"></a>&#1053;&#1086;&#1084;&#1077;&#1088;&#1072; CAN/CVE</h4></div></div></div><p>&#1042;&#1099;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1083;&#1080; <em class="firstterm">&#1085;&#1086;&#1084;&#1077;&#1088;&#1072; CAN</em> &#1080;&#1083;&#1080;
<em class="firstterm">CVE</em>, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1084;&#1080; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;.
&#1069;&#1090;&#1080; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1072;&#1082; "CAN-2004-0397" &#1080;&#1083;&#1080; "CVE-2002-0092".</p><p>&#1063;&#1080;&#1089;&#1083;&#1072; &#1086;&#1073;&#1086;&#1080;&#1093; &#1074;&#1080;&#1076;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;: &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; "&#1054;&#1073;&#1097;&#1080;&#1077;
&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;", &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1077;&#1076;&#1105;&#1090;&#1089;&#1103; &#1085;&#1072; <a class="ulink" href="http://cve.mitre.org/" target="_top">http://cve.mitre.org/</a>.
&#1062;&#1077;&#1083;&#1100; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; - &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1084;&#1086;&#1075; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1072;&#1085;&#1086;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103; &#1087;&#1088;&#1080; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080;
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1080; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1082;&#1091;&#1076;&#1072; &#1085;&#1072;&#1076;&#1086; &#1080;&#1076;&#1090;&#1080; &#1079;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;.
&#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; CAN- &#1080; CVE-&#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;
&#1079;&#1072;&#1087;&#1080;&#1089;&#1100;-&#1082;&#1072;&#1085;&#1076;&#1080;&#1076;&#1072;&#1090;, &#1077;&#1097;&#1105; &#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1091;&#1102; &#1076;&#1083;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;
&#1056;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1050;&#1086;&#1083;&#1083;&#1077;&#1075;&#1080;&#1077;&#1081; CVE, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; - &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1086;&#1073;&#1072; &#1090;&#1080;&#1087;&#1072;
&#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081; &#1074;&#1080;&#1076;&#1085;&#1099; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;, &#1080; &#1085;&#1086;&#1084;&#1077;&#1088; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089; "CAN" &#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; "CVE".</p><p>&#1057;&#1072;&#1084; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; CAN/CVE &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1080; &#1079;&#1072;&#1097;&#1080;&#1090;&#1099; &#1086;&#1090; &#1085;&#1077;&#1105;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086;
&#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1085;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1088;&#1077;&#1079;&#1102;&#1084;&#1077; &#1080; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099; (&#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082;
&#1072;&#1088;&#1093;&#1080;&#1074;&#1099; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;), &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1083;&#1102;&#1076;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1081;&#1090;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1091;&#1102;
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1056;&#1077;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1100; <a class="ulink" href="http://cve.mitre.org/" target="_top">http://cve.mitre.org/</a>
- &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;
&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;, &#1075;&#1076;&#1077; &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1084;&#1086;&#1075;&#1083;&#1072; &#1073;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1080;&#1084;&#1103; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;
&#1082; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1080;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;
<a class="ulink" href="http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092" target="_top">http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092</a>
&#1047;&#1072;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1078;&#1072;&#1090;&#1099;&#1084;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; &#1082;&#1072;&#1078;&#1091;&#1090;&#1089;&#1103;
&#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1072;&#1073;&#1073;&#1088;&#1077;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1072;&#1084;&#1080;. &#1050;&#1083;&#1102;&#1095; &#1082; &#1090;&#1072;&#1082;&#1080;&#1084; &#1072;&#1073;&#1073;&#1088;&#1077;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1072;&#1084; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072;
<a class="ulink" href="http://cve.mitre.org/data/refs/refkey.html" target="_top">http://cve.mitre.org/data/refs/refkey.html</a>.</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1072; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1091;&#1076;&#1086;&#1074;&#1083;&#1077;&#1090;&#1074;&#1086;&#1088;&#1103;&#1077;&#1090; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1102; CVE, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1078;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1083;&#1103;
&#1085;&#1077;&#1105; &#1085;&#1086;&#1084;&#1077;&#1088; CAN. &#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1072;: &#1074; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1085;&#1072;&#1090;&#1100;
&#1082;&#1086;&#1075;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100;, &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1090;&#1100; &#1082;&#1086;&#1075;&#1086;-&#1090;&#1086;, &#1082;&#1090;&#1086; &#1079;&#1085;&#1072;&#1077;&#1090; &#1082;&#1086;&#1075;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1090;&#1072;&#1082; &#1073;&#1077;&#1079;&#1091;&#1084;&#1085;&#1086;, &#1082;&#1072;&#1082;
&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1075;&#1088;&#1072;&#1076;&#1080;&#1090;&#1100; &#1056;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1091;&#1102; &#1050;&#1086;&#1083;&#1083;&#1077;&#1075;&#1080;&#1102; CVE &#1086;&#1090; &#1079;&#1072;&#1074;&#1072;&#1083;&#1072; &#1092;&#1072;&#1083;&#1100;&#1096;&#1080;&#1074;&#1099;&#1084;&#1080; &#1080;&#1083;&#1080; &#1087;&#1083;&#1086;&#1093;&#1086;
&#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1086;&#1085;&#1080; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1090; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1074;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1085;&#1080; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1102;&#1090; &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1076;&#1086;&#1074;&#1077;&#1088;&#1103;&#1102;&#1090;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1072;&#1096;&#1091; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1074;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1085;&#1072;&#1081;&#1090;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1080;&#1079;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1056;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1050;&#1086;&#1083;&#1083;&#1077;&#1075;&#1080;&#1080; CVE &#1086; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;.
&#1054;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1077; &#1089;&#1074;&#1086;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1080;&#1079;
&#1085;&#1080;&#1093; &#1079;&#1085;&#1072;&#1077;&#1090; &#1082;&#1086;&#1075;&#1086;-&#1090;&#1086; &#1077;&#1097;&#1105;, &#1082;&#1090;&#1086; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1083; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; CAN &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;, &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1077;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1090;&#1086;
&#1079;&#1085;&#1072;&#1077;&#1090;, &#1080; &#1090;.&#1076;. &#1055;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1072; &#1077;&#1097;&#1105; &#1080; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1075;&#1076;&#1077;-&#1090;&#1086; &#1074; &#1094;&#1077;&#1087;&#1086;&#1095;&#1082;&#1077; &#1077;&#1089;&#1090;&#1100;
&#1082;&#1090;&#1086;-&#1090;&#1086;, &#1082;&#1090;&#1086; &#1079;&#1085;&#1072;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074;&#1072;&#1084;, &#1095;&#1090;&#1086; &#1072;) &#1101;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080;&#1083;&#1080; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1077;&#1084; MITRE, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1085;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083;&#1072;
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1077;&#1105;, &#1080;&#1083;&#1080; &#1095;&#1090;&#1086; &#1073;) &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1091;&#1078;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; CAN- &#1080;&#1083;&#1080; CVE-&#1085;&#1086;&#1084;&#1077;&#1088;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077;
&#1084;&#1086;&#1075;&#1083;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1072; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1085;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1082;&#1086;&#1085;&#1089;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072; <a class="ulink" href="http://www.cert.org/" target="_top">http://www.cert.org/</a> &#1080;&#1083;&#1080;
&#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; BugTraq &#1085;&#1072; <a class="ulink" href="http://www.securityfocus.com/" target="_top">http://www.securityfocus.com/</a>.
(&#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086;, &#1072; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084;
&#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1090;&#1086; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1100;&#1089;&#1103; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1077;&#1097;&#1105; &#1084;&#1086;&#1075;&#1083;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1086; &#1095;&#1105;&#1084; &#1074;&#1099; &#1085;&#1077;
&#1079;&#1085;&#1072;&#1077;&#1090;&#1077;.)</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1077; &#1085;&#1086;&#1084;&#1077;&#1088; CAN, &#1074;&#1099; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1085;&#1072; &#1088;&#1072;&#1085;&#1085;&#1080;&#1093;
&#1089;&#1090;&#1072;&#1076;&#1080;&#1103;&#1093; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1083;&#1080; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090;
&#1085;&#1086;&#1084;&#1077;&#1088;. &#1053;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; CAN &#1085;&#1072;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1084;&#1073;&#1072;&#1088;&#1075;&#1086; &#1076;&#1086; &#1076;&#1072;&#1090;&#1099; &#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1103;; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1091;&#1089;&#1090;&#1086;&#1075;&#1086; &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072; (&#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099; &#1085;&#1077; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1083;&#1080; &#1080;&#1084;&#1103;),
&#1085;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086; &#1090;&#1086;&#1075;&#1086; &#1076;&#1085;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;
&#1086;&#1073;&#1098;&#1103;&#1074;&#1080;&#1090;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077; &#1077;&#1105;.</p><p>&#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; CAN/CVE &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072;
<a class="ulink" href="http://cve.mitre.org/cve/identifiers/candidates_explained.html" target="_top">http://cve.mitre.org/cve/identifiers/candidates_explained.html</a>,
&#1080; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1074; CAN/CVE - &#1085;&#1072;
<a class="ulink" href="http://www.debian.org/security/cve-compatibility" target="_top">http://www.debian.org/security/cve-compatibility</a>.</p></div><div class="sect3" title="&#1055;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h4 class="title"><a name="security-prenotification"></a>&#1055;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</h4></div></div></div><p>&#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1096;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1090;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1085;&#1072; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1083;&#1080; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1089;&#1103; &#1074; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089;
&#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1084; &#1086;&#1090;&#1095;&#1105;&#1090;&#1086;&#1084;) &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1077;&#1075;&#1086;
&#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;.</p><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1099;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1077; &#1086;
&#1085;&#1105;&#1084; &#1084;&#1080;&#1088;&#1091;, &#1074;&#1099; &#1085;&#1072;&#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086;, &#1082;&#1090;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1096;&#1080;&#1084; &#1055;&#1054;, &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1087;&#1086;&#1076;&#1074;&#1077;&#1088;&#1075;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1088;&#1080;&#1089;&#1082;&#1091; &#1073;&#1099;&#1090;&#1100; &#1072;&#1090;&#1072;&#1082;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072;
&#1091;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; <em class="firstterm">&#1087;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</em> &#1076;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;. &#1069;&#1090;&#1086; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;
&#1074;&#1077;&#1088;&#1085;&#1086; &#1076;&#1083;&#1103; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077;
&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1086;&#1073;&#1083;&#1072;&#1079;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1094;&#1077;&#1083;&#1103;&#1084;&#1080; &#1076;&#1083;&#1103; &#1072;&#1090;&#1072;&#1082;&#1091;&#1102;&#1097;&#1080;&#1093;. &#1040;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099;
&#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1086;&#1094;&#1077;&#1085;&#1103;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1077;&#1085;&#1100;-&#1076;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1085;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;
&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1097;&#1080;&#1097;&#1105;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; &#1090;&#1086;&#1090; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1091;&#1075;&#1088;&#1086;&#1079;&#1072; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;
&#1076;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;&#1084;.</p><p>&#1055;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1087;&#1086;&#1089;&#1099;&#1083;&#1082;&#1091; email-&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1090;&#1072;&#1082;&#1080;&#1084; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084; &#1076;&#1086;
&#1076;&#1072;&#1090;&#1099; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1089; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1087;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077;&#1084; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;, &#1087;&#1086; &#1074;&#1072;&#1096;&#1077;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1085;&#1080;&#1102;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1099; &#1089;
&#1101;&#1090;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1088;&#1077;&#1076;-&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100;
&#1076;&#1074;&#1072;: &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1101;&#1082;&#1089;&#1087;&#1083;&#1091;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1074;&#1072;&#1078;&#1085;&#1099;&#1081; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;
&#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1077;&#1090;&#1072;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1099;&#1084; &#1076;&#1077;&#1083;&#1086;&#1084;, <span class="emphasis"><em>&#1087;&#1083;&#1102;&#1089;</em></span> &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085; &#1082;&#1072;&#1082;
&#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1086;&#1083;&#1090;&#1072;&#1090;&#1100; &#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086; &#1076;&#1085;&#1103; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</p><p>&#1055;&#1086;&#1089;&#1099;&#1083;&#1072;&#1081;&#1090;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;-&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086; &#1087;&#1086; <span class="emphasis"><em>&#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;</em></span> (&#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1079;&#1072; &#1088;&#1072;&#1079;)
&#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1102;. &#1053;&#1077; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1081;&#1090;&#1077; &#1074;&#1089;&#1077;&#1084;&#1091; &#1089;&#1087;&#1080;&#1089;&#1082;&#1091; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1089;&#1088;&#1072;&#1079;&#1091;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086;
&#1090;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1080; &#1091;&#1074;&#1080;&#1076;&#1103;&#1090; &#1080;&#1084;&#1077;&#1085;&#1072; &#1076;&#1088;&#1091;&#1075; &#1076;&#1088;&#1091;&#1075;&#1072; - &#1095;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1072;&#1077;&#1090;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086;
&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1095;&#1090;&#1086; &#1091; <span class="emphasis"><em>&#1076;&#1088;&#1091;&#1075;&#1080;&#1093;</em></span> &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1099;&#1088;&#1082;&#1080; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1055;&#1086;&#1089;&#1099;&#1083;&#1082;&#1072; &#1089;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; CC (BCC) &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077;&#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1079;&#1072;&#1097;&#1080;&#1097;&#1072;&#1102;&#1090; &#1089;&#1074;&#1086;&#1080; &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1077; &#1103;&#1097;&#1080;&#1082;&#1080; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089;&#1087;&#1072;&#1084;-&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1083;&#1080;&#1073;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1102;&#1090;, &#1083;&#1080;&#1073;&#1086; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1102;&#1090; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090; &#1087;&#1086;&#1095;&#1090;&#1099;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1095;&#1077;&#1088;&#1077;&#1079; BCC, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091;
&#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1072;&#1084;&#1072; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1085;&#1072;&#1096;&#1080; &#1076;&#1085;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; BCC.</p><p>&#1042;&#1086;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;-&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086;:</p><pre class="screen">
From: &#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; 
To: admin@large-famous-server.com
Reply-to: &#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1072;&#1096;&#1077; &#1080;&#1084;&#1103; (&#1085;&#1086; &#1085;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;) 
Subject: &#1050;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; Scanley.


&#1069;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; - &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;-&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074;
&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077; Scanley.

&#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, *&#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; forward* &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1091; &#1073;&#1099; &#1090;&#1086; &#1085;&#1080;
&#1073;&#1099;&#1083;&#1086;. &#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 19 &#1084;&#1072;&#1103;, &#1080; &#1084;&#1099; &#1073;&#1099; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1076;&#1086; &#1101;&#1090;&#1086;&#1081; &#1076;&#1072;&#1090;&#1099;.

&#1042;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1101;&#1090;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; (&#1084;&#1099; &#1085;&#1072;&#1076;&#1077;&#1077;&#1084;&#1089;&#1103;) &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;
Scanley &#1080; &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1085;&#1072;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1087;&#1072;&#1090;&#1095; &#1076;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1072; &#1076;&#1099;&#1088;&#1072; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090;
&#1076;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;&#1084; &#1075;&#1083;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; 19 &#1084;&#1072;&#1103;.

&#1057;&#1089;&#1099;&#1083;&#1082;&#1080;: 
======= 

CAN-2004-1771: &#1055;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072; Scanley &#1074; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;&#1093; 

&#1059;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;: 
=========== 

&#1057;&#1077;&#1088;&#1074;&#1077;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;
&#1089;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1086; &#1080; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;.

&#1057;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1089;&#1090;&#1100;: 
============ 

&#1054;&#1095;&#1077;&#1085;&#1100; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1074;&#1083;&#1077;&#1095;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;.

&#1054;&#1073;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1091;&#1090;&#1080;:
============== 

&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1086;&#1087;&#1094;&#1080;&#1080; 'natural-language-processing' &#1074; 'off' &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; scanley.conf
&#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;.

&#1055;&#1072;&#1090;&#1095;: 
=====

&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1081; &#1085;&#1080;&#1078;&#1077; &#1087;&#1072;&#1090;&#1095; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084; &#1082; Scanley 3.0, 3.1, &#1080; 3.2.

&#1053;&#1086;&#1074;&#1086;&#1077; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; (Scanley 3.2.1) &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1091;&#1097;&#1077;&#1085;&#1086; 19 &#1084;&#1072;&#1103; &#1080;&#1083;&#1080; &#1085;&#1072;&#1082;&#1072;&#1085;&#1091;&#1085;&#1077;,
&#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081;
&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1087;&#1072;&#1090;&#1095; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089;, &#1083;&#1080;&#1073;&#1086; &#1076;&#1086;&#1078;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086;
&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1077;&#1084; &#1084;&#1077;&#1078;&#1076;&#1091; 3.2 &#1080; 3.2.1 &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1090;&#1095;.

[...&#1079;&#1076;&#1077;&#1089;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1072;&#1090;&#1095;...]
</pre><p>&#1045;&#1089;&#1083;&#1080; &#1091; &#1074;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; &#1085;&#1086;&#1084;&#1077;&#1088; CAN, &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1087;&#1088;&#1077;&#1076;-&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077; (&#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;),
&#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1072; &#1080;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; MITRE &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077;
&#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090;. &#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; CAN &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1102; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;, &#1086;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1077;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1080;&#1083;&#1080;, &#1090;&#1072; &#1078;&#1077; &#1089;&#1072;&#1084;&#1072;&#1103;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1085; &#1079;&#1072;&#1090;&#1077;&#1084; &#1091;&#1079;&#1085;&#1072;&#1077;&#1090; &#1087;&#1086;
&#1086;&#1073;&#1097;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;&#1084;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1086;&#1085; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1090;&#1086;&#1084;, &#1085;&#1091;&#1078;&#1085;&#1099; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;
&#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1080;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1091;&#1090;&#1100; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1074; CAN/CVE.</p></div><div class="sect3" title="&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;"><div class="titlepage"><div><div><h4 class="title"><a name="security-announcing"></a>&#1055;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;</h4></div></div></div><p>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084; &#1096;&#1072;&#1075;&#1086;&#1084; &#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1090;&#1086;&#1080;&#1090; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;
&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1042; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084; &#1086;&#1073;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;,
&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; CAN/CVE, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1077;&#1089;&#1090;&#1100;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1093;&#1086;&#1076;&#1072; &#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;
&#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; "&#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;" ("fix") &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1089;&#1090;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;
&#1085;&#1086;&#1074;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1055;&#1054;, &#1093;&#1086;&#1090;&#1103; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1090;&#1095;&#1072;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1055;&#1054; &#1074;
&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080;
&#1085;&#1086;&#1074;&#1099;&#1081; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;, &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1072;&#1090;&#1095;&#1077;&#1084;
&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1082;&#1086;&#1085;&#1089;&#1077;&#1088;&#1074;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1089;&#1090;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1077;
&#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1103;&#1089;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1085;&#1072; &#1095;&#1090;&#1086; &#1077;&#1097;&#1105; &#1086;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1090;&#1100;; &#1086;&#1085;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;,
&#1073;&#1091;&#1076;&#1077;&#1090; &#1074; &#1085;&#1080;&#1093; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. (&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;
<a class="xref" href="release-lines.html#security-releases" title="Security Releases">«Security Releases»</a><span> &#1074;
<a class="xref" href="development-cycle.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 7. Packaging, Releasing, and Daily Development">&#1043;&#1083;&#1072;&#1074;&#1072; 7, <i>Packaging, Releasing, and Daily Development</i></a></span>.)</p><p>&#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077;
&#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1078;&#1077; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086; &#1085;&#1086;&#1074;&#1099;&#1081; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1083;&#1089;&#1103;: &#1087;&#1086;&#1096;&#1083;&#1080;&#1090;&#1077;
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; <code class="literal">announce</code> &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1087;&#1088;&#1077;&#1089;&#1089;-&#1088;&#1077;&#1083;&#1080;&#1079;, &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;
Freshmeat, &#1080; &#1090;.&#1076;. &#1061;&#1086;&#1090;&#1103; &#1074;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1099;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1077;&#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;
&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1079;&#1072;&#1073;&#1086;&#1090;&#1103;&#1089;&#1100; &#1086; &#1088;&#1077;&#1087;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;, &#1085;&#1077;&#1089;&#1086;&#1084;&#1085;&#1077;&#1085;&#1085;&#1086;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1090;&#1086;&#1085;
&#1080; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1045;&#1089;&#1083;&#1080;
&#1076;&#1099;&#1088;&#1072; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1085;&#1077;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1072;
&#1085;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;,
&#1090;&#1086; &#1086;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;. &#1042;&#1099; &#1076;&#1072;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1085;&#1077;
&#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1100; &#1101;&#1090;&#1080;&#1084; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; <code class="literal">announce</code>. &#1042; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;
&#1087;&#1086;&#1076;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1083;&#1086;&#1078;&#1085;&#1091;&#1102; &#1090;&#1088;&#1077;&#1074;&#1086;&#1075;&#1091;, &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090; &#1076;&#1091;&#1084;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1055;&#1054; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1086;,
&#1095;&#1077;&#1084; &#1101;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1087;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1074;&#1072;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1072;&#1085;&#1086;&#1085;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077;
&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;. &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072;
<a class="ulink" href="http://cve.mitre.org/about/terminology.html" target="_top">http://cve.mitre.org/about/terminology.html</a> &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1077; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1086;&#1089;&#1090;&#1080;.</p><p>&#1042; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077;
&#1082;&#1086;&#1075;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1086;&#1087;&#1099;&#1090;&#1085;&#1086;&#1075;&#1086; &#1080; &#1087;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1089; &#1085;&#1080;&#1084;. &#1054;&#1094;&#1077;&#1085;&#1082;&#1072; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;
&#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1086;&#1087;&#1099;&#1090;&#1072;, &#1080; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079; &#1083;&#1077;&#1075;&#1082;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1077;
&#1096;&#1072;&#1075;&#1080;.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-tracker-usage.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="development-cycle.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1053;&#1077;&#1090; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;&#1084; &#1074; &#1090;&#1088;&#1077;&#1082;&#1077;&#1088;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1043;&#1083;&#1072;&#1074;&#1072; 7. Packaging, Releasing, and Daily Development</td></tr></table></div></body></html>
