<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1047;&#1072;&#1076;&#1072;&#1074;&#1072;&#1103; &#1090;&#1086;&#1085;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;"><link rel="prev" href="license-quickstart.html" title="&#1042;&#1099;&#1073;&#1086;&#1088; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1080; &#1077;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;"><link rel="next" href="announcing.html" title="Announcing"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1047;&#1072;&#1076;&#1072;&#1074;&#1072;&#1103; &#1090;&#1086;&#1085;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="license-quickstart.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</th><td width="20%" align="right"> <a accesskey="n" href="announcing.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1047;&#1072;&#1076;&#1072;&#1074;&#1072;&#1103; &#1090;&#1086;&#1085;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="setting-tone"></a>&#1047;&#1072;&#1076;&#1072;&#1074;&#1072;&#1103; &#1090;&#1086;&#1085;</h2></div></div></div><p>&#1055;&#1086;&#1082;&#1072; &#1084;&#1099; &#1086;&#1087;&#1080;&#1089;&#1072;&#1083;&#1080; &#1086;&#1076;&#1085;&#1086;&#1088;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099; &#1088;&#1077;&#1096;&#1072;&#1077;&#1090;&#1077; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;: &#1074;&#1099;&#1073;&#1086;&#1088; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;,
&#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1077;&#1073;&#1089;&#1072;&#1081;&#1090;&#1072;, &#1080; &#1090;.&#1076;. &#1053;&#1086; &#1089;&#1072;&#1084;&#1099;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1077; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;.
&#1042;&#1099;&#1073;&#1086;&#1088; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1099; &#1074; &#1083;&#1080;&#1089;&#1090;&#1077; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; &#1090;&#1077;&#1084;&#1099;
&#1080; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1083;&#1077;&#1090; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081;,
&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;, &#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1099; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1089;&#1103; &#1080; &#1074;&#1072;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1100; &#1091;&#1078;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093;
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1082; &#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102;.</p><p>&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080; &#8212; &#1089;&#1072;&#1084;&#1099;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1077;&#1097;&#1077; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1086;&#1077;
&#1074; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;. &#1057;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;
&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086;&#1081; &#1074;&#1089;&#1077;&#1084;&#1080; &#1080; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1084;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1084;&#1091;&#1076;&#1088;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1063;&#1072;&#1089;&#1090;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103;
&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;, &#1085;&#1086; &#1086;&#1085;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1074; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1076;&#1080;&#1089;&#1090;&#1080;&#1083;&#1083;&#1103;&#1094;&#1080;&#1077;&#1081; &#1085;&#1077;&#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;, &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1081;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;. &#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1085;&#1077; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090; &#1077;&#1077;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1073;&#1083;&#1080;&#1079;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.</p><p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082;. &#1056;&#1086;&#1089;&#1090; &#1080; &#1074;&#1099;&#1089;&#1086;&#1082;&#1072;&#1103; &#1090;&#1077;&#1082;&#1091;&#1095;&#1077;&#1089;&#1090;&#1100; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074;
&#1085;&#1077; &#1089;&#1090;&#1086;&#1083;&#1100; &#1088;&#1072;&#1079;&#1088;&#1091;&#1096;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099; &#1076;&#1083;&#1103; &#1085;&#1072;&#1082;&#1086;&#1087;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1085;&#1086;&#1088;&#1084;, &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100;. &#1055;&#1086;&#1082;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; 
&#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1103;&#1090; <span class="emphasis"><em>&#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084;</em></span> &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;, &#1076;&#1083;&#1103; &#1074;&#1085;&#1086;&#1074;&#1100; &#1087;&#1088;&#1080;&#1073;&#1099;&#1074;&#1096;&#1080;&#1093; &#1077;&#1089;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1074;&#1089;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086;,
&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1080;  &#1091;&#1079;&#1085;&#1072;&#1102;&#1090;, &#1086;&#1085;&#1080; &#1089;&#1072;&#1084;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1100; &#1091;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1080;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1090;&#1080;&#1083;&#1103;. &#1055;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1076;&#1077;&#1090;&#1089;&#1082;&#1080;&#1077; &#1087;&#1077;&#1089;&#1085;&#1080;
&#1087;&#1077;&#1088;&#1077;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1089;&#1090;&#1086;&#1083;&#1077;&#1090;&#1080;&#1103;. &#1048; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1077;&#1089;&#1090;&#1100; &#1076;&#1077;&#1090;&#1080;, &#1085;&#1072;&#1087;&#1077;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1090;&#1077; &#1078;&#1077; &#1089;&#1072;&#1084;&#1099;&#1077; &#1088;&#1080;&#1092;&#1084;&#1099;, &#1095;&#1090;&#1086; &#1080; &#1076;&#1077;&#1090;&#1080; &#1089;&#1086;&#1090;&#1085;&#1080; &#1083;&#1077;&#1090; &#1085;&#1072;&#1079;&#1072;&#1076;,
&#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1080; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1077;&#1090; &#1074; &#1078;&#1080;&#1074;&#1099;&#1093; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1073;&#1077;&#1085;&#1082;&#1072;, &#1078;&#1080;&#1074;&#1096;&#1077;&#1075;&#1086; &#1090;&#1086;&#1075;&#1076;&#1072;. &#1052;&#1083;&#1072;&#1076;&#1096;&#1080;&#1077; &#1076;&#1077;&#1090;&#1080; &#1089;&#1083;&#1099;&#1096;&#1072;&#1090; &#1087;&#1077;&#1089;&#1085;&#1080;, &#1089;&#1087;&#1077;&#1090;&#1099;&#1077; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1084;&#1080;,
&#1080; &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1080; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1084;&#1080;, &#1086;&#1085;&#1080; &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1089;&#1087;&#1086;&#1102;&#1090; &#1080;&#1093; &#1087;&#1077;&#1088;&#1077;&#1076; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1084;&#1080;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1076;&#1077;&#1090;&#1080; &#1085;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074; &#1089;&#1086;&#1079;&#1085;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1077;, &#1085;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1077;&#1089;&#1085;&#1080; &#1074;&#1099;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;, &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086; &#1080; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;.
&#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1084;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1099; &#1089;&#1090;&#1086;&#1083;&#1077;&#1090;&#1080;&#1103;&#1084;&#1080; (&#1084;&#1099; &#1077;&#1097;&#1077; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1084;),
&#1085;&#1086; &#1076;&#1074;&#1080;&#1078;&#1091;&#1097;&#1080;&#1077; &#1089;&#1080;&#1083;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086;&#1084; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;. &#1057;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1090;&#1077;&#1082;&#1091;&#1095;&#1077;&#1089;&#1090;&#1080; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1074;&#1099;&#1096;&#1077; &#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1077;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; 
&#1079;&#1072; &#1089;&#1095;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1080; &#1090;&#1097;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1080;&#1083;&#1080;&#1081; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1077;.</p><p>&#1069;&#1090;&#1086; &#1091;&#1089;&#1080;&#1083;&#1080;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1084; &#1092;&#1072;&#1082;&#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;, &#1083;&#1102;&#1076;&#1080; &#1089;&#1082;&#1083;&#1086;&#1085;&#1085;&#1099; &#1082; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1102; &#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1091; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1085;&#1086;&#1088;&#1084;. &#1058;&#1072;&#1082; &#1091;&#1078;
&#1091;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099; &#1083;&#1102;&#1076;&#1080;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077;, &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1097;&#1080;&#1084; &#1076;&#1077;&#1083;&#1086;&#1084;, &#1083;&#1102;&#1076;&#1080;, &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1085;&#1077;&#1081;, &#1080;&#1085;&#1089;&#1090;&#1080;&#1085;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1080;&#1097;&#1091;&#1090; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;
&#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;. &#1062;&#1077;&#1083;&#1100;&#1102; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1094;&#1077;&#1076;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1088;&#1072;&#1085;&#1085;&#1080;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;
&#1101;&#1090;&#1080;&#1093; "&#1074;&#1085;&#1091;&#1090;&#1088;&#1080;-&#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1099;&#1093;" &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1076;&#1085;&#1072;&#1078;&#1076;&#1099;, &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1074; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1078;&#1080;&#1090;&#1100; &#1089;&#1072;&#1084;&#1080; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077;.</p><p>&#1044;&#1072;&#1083;&#1077;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1087;&#1088;&#1077;&#1094;&#1077;&#1076;&#1077;&#1085;&#1090;&#1099;.
&#1054;&#1085;&#1080; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1080;&#1089;&#1095;&#1077;&#1088;&#1087;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1084;&#1099;&#1089;&#1083;&#1080; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1091;&#1093;&#1072;
&#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1085;&#1072; &#1088;&#1072;&#1085;&#1085;&#1077;&#1081; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1095;&#1088;&#1077;&#1079;&#1074;&#1099;&#1095;&#1072;&#1081;&#1085;&#1086; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;. &#1060;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1077; &#1089;&#1072;&#1084;
&#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1074; &#1086;&#1076;&#1080;&#1085;&#1086;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;, &#1085;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1084;&#1085;&#1086;&#1075;&#1086;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1072;&#1090;&#1100; &#1080;&#1084; <span class="emphasis"><em>&#1087;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;</em></span>, &#1073;&#1091;&#1076;&#1090;&#1086; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077;
&#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1077;. &#1063;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1077;&#1073;&#1103; &#1090;&#1072;&#1082; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1086;&#1085;&#1080; &#1079;&#1072;&#1093;&#1086;&#1090;&#1103;&#1090; &#1087;&#1086;&#1089;&#1074;&#1103;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;. &#1071; &#1074;&#1099;&#1073;&#1088;&#1072;&#1083; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;,
&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1074;&#1089;&#1087;&#1083;&#1099;&#1083;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; Subversion (<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>), &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1103; &#1091;&#1095;&#1072;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083; &#1080;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072;&#1073;&#1083;&#1102;&#1076;&#1072;&#1083; &#1089; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072;. &#1053;&#1086; &#1086;&#1085;&#1080; &#1074;&#1077;&#1088;&#1085;&#1099; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; Subversion; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1091;&#1090; &#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1080;
&#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1082;&#1072;&#1082; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1089;&#1090;&#1072;&#1090;&#1100; &#1089; &#1090;&#1086;&#1081; &#1085;&#1086;&#1075;&#1080;.</p><div class="sect2" title="&#1048;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081;"><div class="titlepage"><div><div><h3 class="title"><a name="avoid-private-discussions"></a>&#1048;&#1079;&#1073;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081;</h3></div></div></div><p>&#1044;&#1072;&#1078;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1086;&#1073;&#1097;&#1080;&#1084;, &#1074;&#1099; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080;, &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1095;&#1072;&#1089;&#1090;&#1077;&#1085;&#1100;&#1082;&#1086; &#1093;&#1086;&#1090;&#1077;&#1090;&#1100;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1090;&#1088;&#1091;&#1076;&#1085;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;
&#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1074;&#1086;&#1077;&#1084; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1084; &#1082;&#1088;&#1091;&#1075;&#1077;. &#1069;&#1090;&#1086; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074;&#1077;&#1088;&#1085;&#1086; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; 
&#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1080;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;, &#1084;&#1072;&#1083;&#1086; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1077;&#1074; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1082;&#1074;&#1072;&#1083;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100;. &#1042;&#1089;&#1077; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1077; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1080; 
&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1083;&#1080;&#1089;&#1090;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1103;&#1089;&#1085;&#1086; &#1074;&#1099;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1072;&#1084;&#1080;: &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072;,&#1082;&#1072;&#1082; &#1085;&#1077;&#1086;&#1090;&#1098;&#1077;&#1084;&#1083;&#1077;&#1084;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1086;&#1074;
&#1087;&#1086; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1077;, &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1076;&#1083;&#1103; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1089;&#1087;&#1086;&#1088;&#1099; &#1089; &#1085;&#1072;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1072;&#1084;&#1080;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1091;&#1084;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1085;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1085;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; (&#1090;&#1072;&#1082;&#1080;&#1077; &#1077;&#1089;&#1090;&#1100; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072;
&#1101;&#1090;&#1086; &#1083;&#1091;&#1095;&#1096;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1075;&#1086;&#1076;&#1072;, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1080; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1074;&#1089;&#1077;&#1075;&#1076;&#1072;), &#1082;&#1090;&#1086;-&#1090;&#1086;, &#1082;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; X, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; Y &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1048;&#1089;&#1082;&#1091;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084;&#1080;
&#1076;&#1074;&#1077;&#1088;&#1100;&#1084;&#1080; &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1093; &#1082;&#1072;&#1082; <span class="foreignphrase"><em class="foreignphrase"> faits accomplis (&#1089;&#1074;&#1077;&#1088;&#1096;&#1080;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1092;&#1072;&#1082;&#1090;&#1099;) </em></span>, &#1080;&#1083;&#1080;, &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1103;&#1084;&#1099;&#1077;
&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080; &#1074;&#1083;&#1080;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072;, &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1074;&#1089;&#1077;&#1075;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;. </p><p>&#1053;&#1077; &#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;</p><p>&#1050;&#1072;&#1082;&#1080;&#1084;&#1080; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080; &#1090;&#1103;&#1075;&#1086;&#1089;&#1090;&#1085;&#1099;&#1084;&#1080; &#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1085;&#1080; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1077;&#1077; &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1080;&#1090;&#1086;&#1075;&#1077;. &#1055;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;
&#1095;&#1072;&#1089;&#1090;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1086;&#1093;&#1086;&#1078;&#1077; &#1085;&#1072; &#1088;&#1072;&#1089;&#1087;&#1099;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1087;&#1077;&#1083;&#1083;&#1077;&#1085;&#1090;&#1072; &#1086;&#1090; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074; &#1085;&#1072; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;. &#1053;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1089;&#1077;&#1088;&#1100;&#1077;&#1079;&#1085;&#1099;&#1081; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1077;&#1094; &#1085;&#1077; &#1079;&#1072;&#1093;&#1086;&#1090;&#1077;&#1083; &#1073;&#1099; &#1076;&#1086;&#1083;&#1075;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1083;&#1086;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103;
&#1087;&#1086;&#1073;&#1083;&#1080;&#1079;&#1086;&#1089;&#1090;&#1080; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1075;&#1076;&#1077; &#1090;&#1072;&#1081;&#1085;&#1099;&#1081; &#1089;&#1086;&#1074;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1091; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1077;&#1089;&#1090;&#1100; &#1073;&#1083;&#1072;&#1075;&#1086;&#1090;&#1074;&#1086;&#1088;&#1085;&#1099;&#1077; &#1087;&#1086;&#1073;&#1086;&#1095;&#1085;&#1099;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1099;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1076;&#1072;&#1083;&#1077;&#1082;&#1086; &#1079;&#1072; &#1088;&#1072;&#1084;&#1082;&#1080; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1101;&#1092;&#1077;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1099;&#1083; &#1089;&#1087;&#1086;&#1088;&#1085;&#1099;&#1084; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;:

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100; &#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1080; &#1086;&#1073;&#1091;&#1095;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;.
        &#1042;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1075;&#1083;&#1072;&#1079; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090; &#1079;&#1072; &#1073;&#1077;&#1089;&#1077;&#1076;&#1086;&#1081;;
        &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1083;&#1102;&#1076;&#1077;&#1081; &#1085;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1103;, &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090;
        &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100;, &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;.</p></li><li class="listitem"><p>&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1091;&#1095;&#1080;&#1090; <span class="emphasis"><em>&#1074;&#1072;&#1089;</em></span> &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1091; 
        &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1085;&#1077; &#1090;&#1072;&#1082; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;
        &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1082;&#1072;&#1082; &#1074;&#1099;. &#1069;&#1090;&#1086;&#1090; &#1085;&#1072;&#1074;&#1099;&#1082; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;
        &#1090;&#1088;&#1077;&#1085;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, &#1072; &#1074;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1088;&#1077;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1103;
        &#1089; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1102;&#1090; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1074;&#1099;.</p></li><li class="listitem"><p>&#1044;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1103; &#1080; &#1077;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1074; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1093;,
        &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1103; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;&#1093; &#1085;&#1077; &#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1086;&#1073;&#1089;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1083;&#1077;&#1076;&#1072;&#1084;.
        &#1057;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077;
        <a class="xref" href="growth.html#using-archives" title="&#1064;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;">«&#1064;&#1080;&#1088;&#1086;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1099;»</a><span>
        &#1074; <a class="xref" href="communications.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 6. &#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;">&#1043;&#1083;&#1072;&#1074;&#1072; 6, <i>&#1054;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;</i></a></span>.</p></li></ul></div><p>

</p><p>&#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1094;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1074; &#1073;&#1077;&#1089;&#1077;&#1076;&#1091;, &#1074;&#1099;&#1089;&#1090;&#1091;&#1087;&#1080;&#1074; &#1089; &#1080;&#1076;&#1077;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1080;
&#1085;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1083;&#1080;. &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1072;&#1082;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;;
&#1101;&#1090;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1083;&#1080;&#1096;&#1100; &#1086;&#1090; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1076;&#1072; &#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. 
&#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1080;&#1079; &#1078;&#1080;&#1079;&#1085;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1079;&#1074;&#1086;&#1083;&#1077;&#1085;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;,
&#1103; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083; &#1073;&#1099; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;, &#1095;&#1077;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1080;&#1085;&#1090;&#1091;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086; 
&#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100;. &#1042; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; Subversion &#1084;&#1099; (&#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080;) &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;
&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1099; &#1080;&#1085;&#1090;&#1077;&#1085;&#1089;&#1080;&#1074;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1099;&#1096;&#1083;&#1103;&#1083;&#1080; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1084;&#1077;&#1089;&#1103;&#1094;&#1077;&#1074;, &#1080; &#1084;&#1099; &#1080;&#1089;&#1082;&#1088;&#1077;&#1085;&#1085;&#1077; &#1089;&#1086;&#1084;&#1085;&#1077;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1090;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079; &#1085;&#1077;&#1076;&#1072;&#1074;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1089;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;,
&#1084;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1083;&#1080; &#1083;&#1077;&#1085;&#1080;&#1074;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1080; &#1089;&#1090;&#1072;&#1083;&#1080; &#1087;&#1080;&#1085;&#1072;&#1090;&#1100; &#1090;&#1091;&#1076;&#1072;-&#1089;&#1102;&#1076;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;
&#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1082;&#1077;, &#1076;&#1086; &#1090;&#1086;&#1075;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; 
<sup>[<a name="idp5326768" href="#ftn.idp5326768" class="footnote">10</a>]</sup>&#1087;&#1086;&#1085;&#1103;&#1083; 
&#1082;&#1091;&#1076;&#1072; &#1076;&#1091;&#1077;&#1090; &#1074;&#1077;&#1090;&#1077;&#1088; &#1080; &#1087;&#1086;&#1087;&#1088;&#1086;&#1089;&#1080;&#1083; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1102; &#1074; &#1086;&#1073;&#1097;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;. &#1055;&#1088;&#1080;&#1082;&#1088;&#1099;&#1074; &#1075;&#1083;&#1072;&#1079;&#1072; &#1084;&#1099; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1083;&#1080;
&#8212; &#1080; &#1073;&#1099;&#1083;&#1080; &#1086;&#1096;&#1077;&#1083;&#1086;&#1084;&#1083;&#1077;&#1085;&#1099; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1087;&#1088;&#1086;&#1085;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; 
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1083;&#1080;. &#1042;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1083;&#1102;&#1076;&#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1083;&#1080; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080; &#1085;&#1072;&#1084; &#1074; &#1075;&#1086;&#1083;&#1086;&#1074;&#1091;.
&#1054;&#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1085;&#1072;&#1096;&#1083;&#1086;&#1089;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; <span class="emphasis"><em>&#1086;&#1095;&#1077;&#1085;&#1100;</em></span> 
&#1091;&#1084;&#1085;&#1099;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;; &#1086;&#1085;&#1080; &#1083;&#1080;&#1096;&#1100; &#1078;&#1076;&#1072;&#1083;&#1080; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081; &#1085;&#1072;&#1078;&#1080;&#1074;&#1082;&#1080;. &#1044;&#1072;, &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;
&#1079;&#1072;&#1085;&#1103;&#1083;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1095;&#1077;&#1084; &#1086;&#1085;&#1080; &#1079;&#1072;&#1085;&#1103;&#1083;&#1080; &#1073;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1084;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083;&#1080; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1102; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081;,
&#1085;&#1086; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1089;&#1090;&#1086;&#1080;&#1083;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;.</p><p>&#1053;&#1077; &#1091;&#1075;&#1083;&#1091;&#1073;&#1083;&#1103;&#1103;&#1089;&#1100; &#1074; &#1086;&#1073;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1084;&#1072;&#1093;&#1085;&#1091;&#1090;&#1100; &#1088;&#1091;&#1082;&#1086;&#1081;, &#1090;&#1080;&#1087;&#1072; "&#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;
&#1091;&#1084;&#1085;&#1077;&#1077; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1072;" (&#1074;&#1089;&#1077; &#1084;&#1099; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1083;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1085;&#1072;&#1090;&#1100; &#1083;&#1091;&#1095;&#1096;&#1077;), &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1090;&#1100;,
&#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099; &#1076;&#1077;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1099;&#1089;&#1086;&#1090;&#1077;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;
&#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1090;&#1085;&#1072;&#1103; &#1086;&#1094;&#1077;&#1085;&#1082;&#1072; &#1082;&#1086;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1085;&#1080;&#1093;; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1075;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1080;&#1076;&#1077;&#1081;
&#1074; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; - &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;. &#1050;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1076;&#1077;&#1081;, &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1076;&#1091;&#1084;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086;, &#1074;&#1079;&#1103;&#1074;&#1096;&#1077;&#1075;&#1086;&#1089;&#1103; &#1079;&#1072; &#1085;&#1080;&#1093;,
&#1085;&#1086; &#1074;&#1099; &#1085;&#1077; &#1091;&#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1079;&#1072; &#1084;&#1099;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1088;&#1103;&#1076;&#1086;&#1084;, &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088; &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1089;&#1090;&#1080;&#1084;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1080;&#1093;
&#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1077;&#1081;.</p><p>&#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;;
&#1085;&#1072; &#1087;&#1088;&#1086;&#1090;&#1103;&#1078;&#1077;&#1085;&#1080;&#1080; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080; &#1084;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1084; &#1090;&#1072;&#1082;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;. &#1053;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1097;&#1080;&#1084; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1086;&#1084; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; 
&#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100;:<span class="emphasis"><em>&#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1090; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1083;&#1089;&#1103; &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;,
&#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;.</em></span></p><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1077;&#1083;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1076; &#1101;&#1090;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;. &#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1042;&#1072;&#1096;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072; &#1080;&#1076;&#1091;&#1090; &#1074; &#1086;&#1073;&#1097;&#1080;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;. &#1042;&#1072;&#1084; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1090;&#1080;
&#1074; &#1101;&#1090;&#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079;&#1083;&#1080;&#1096;&#1085;&#1077;&#1081;.
&#1045;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1080; &#1085;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1099; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1089;&#1090;&#1080;,
&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099; &#1079;&#1072; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1084;&#1077;&#1090;&#1072;-&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;. 
&#1044;&#1072;&#1078;&#1077; &#1085;&#1077; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1090;&#1077;&#1084;&#1091;, &#1087;&#1086;&#1082;&#1072; &#1074;&#1099; &#1080;&#1083;&#1080; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1085;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088; &#1074; &#1086;&#1073;&#1097;&#1077;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1077;
&#1088;&#1091;&#1089;&#1083;&#1086;, &#1080;&#1083;&#1080; &#1085;&#1077; &#1087;&#1088;&#1080;&#1096;&#1083;&#1080; &#1082; &#1074;&#1099;&#1074;&#1086;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1083;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082;, &#1090;&#1086; &#1083;&#1102;&#1076;&#1080; &#1091;&#1083;&#1086;&#1074;&#1103;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1080; &#1085;&#1072;&#1095;&#1085;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; 
&#1092;&#1086;&#1088;&#1091;&#1084;&#1099; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.</p></div><div class="sect2" title="&#1055;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1082;&#1086;&#1088;&#1085;&#1102;"><div class="titlepage"><div><div><h3 class="title"><a name="prevent-rudeness"></a>&#1055;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1081;&#1090;&#1077; &#1075;&#1088;&#1091;&#1073;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1082;&#1086;&#1088;&#1085;&#1102;</h3></div></div></div><p>&#1057; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1073;&#1097;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086;,
&#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1091; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072; &#1074; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1080; &#1075;&#1088;&#1091;&#1073;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1077;&#1075;&#1086; &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;&#1093;. &#1053;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082; &#1085;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1085;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086;.
&#1042;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1083;&#1102;&#1076;&#1077;&#1081; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1090;&#1086;&#1074; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1080; &#1075;&#1088;&#1091;&#1073;&#1103;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;
&#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1095;&#1080;&#1082;&#1072;&#1084;, &#1080;&#1083;&#1080; &#1083;&#1080;&#1096;&#1072;&#1090;&#1100; &#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1082;&#1086;&#1076;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1087;&#1080;&#1096;&#1091;&#1090;
&#1091;&#1085;&#1080;&#1095;&#1080;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080;. (&#1042; &#1090;&#1077;&#1086;&#1088;&#1080;&#1080; &#1042;&#1072;&#1084;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1089;&#1095;&#1077;&#1090;&#1077; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; 
&#1087;&#1088;&#1080;&#1073;&#1077;&#1075;&#1085;&#1091;&#1090;&#1100; &#1082; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;&#1084;, &#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1083;&#1102;&#1073;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1085;&#1077; &#1076;&#1072;&#1076;&#1091;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;&#8212;
&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1102;). &#1053;&#1091;&#1083;&#1077;&#1074;&#1086;&#1081; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1099;
&#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;&#1077; &#1087;&#1083;&#1086;&#1093;&#1086;&#1084;&#1091; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1079;&#1085;&#1091;&#1090;&#1100; &#1085;&#1077;&#1079;&#1072;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 
&#1082;&#1086;&#1075;&#1076;&#1072; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1083;&#1072;&#1085;&#1072; &#1074;&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1096;&#1082;&#1091; &#1089; <span class="foreignphrase"><em class="foreignphrase">ad hominem</em></span>
&#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074; &#1072;&#1076;&#1088;&#1077;&#1089; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;, &#1074;&#1072;&#1096; &#1086;&#1090;&#1074;&#1077;&#1090; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; 
<span class="emphasis"><em>&#1074; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;</em></span>, &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; <span class="foreignphrase"><em class="foreignphrase">ad hominem</em></span>
&#1082;&#1072;&#1082; &#1085;&#1072; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091; &#1089;&#1072;&#1084;&#1091; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077;, &#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1082; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;. 
</p><p>&#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102; &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086;, &#1080; &#1101;&#1090;&#1086; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1089;&#1082;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;
&#1074; &#1087;&#1077;&#1088;&#1077;&#1073;&#1088;&#1072;&#1085;&#1082;&#1080;. &#1042; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1077; &#1083;&#1102;&#1076;&#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1089;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080; &#1073;&#1099; &#1083;&#1080;&#1094;&#1086;&#1084; &#1082; &#1083;&#1080;&#1094;&#1091;. 
&#1058;&#1077;&#1084;&#1099; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1081; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1089;&#1080;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090; &#1101;&#1090;&#1086;&#1090; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;: &#1074; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;&#1093; &#1083;&#1102;&#1076;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1102;&#1090;,
&#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1080; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1090;&#1074;&#1077;&#1090;&#1091;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1086; &#1083;&#1080;&#1096;&#1100; &#1085;&#1077;&#1079;&#1085;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080;&#1083;&#1080; &#1075;&#1083;&#1091;&#1087;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1054;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1095;&#1100;&#1077;&#1075;&#1086;-&#1090;&#1086; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082; &#1075;&#1083;&#1091;&#1087;&#1086;&#1075;&#1086;,
&#1085;&#1077;&#1076;&#1072;&#1083;&#1077;&#1082;&#1086; &#1080; &#1076;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082; &#1075;&#1083;&#1091;&#1087;&#1086;&#1075;&#1086; &#1080; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;. &#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074;, &#1089;&#1083;&#1086;&#1078;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;,
&#1074; &#1082;&#1072;&#1082;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1089;&#1087;&#1086;&#1088;&#1099; &#1091;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1080; &#1077;&#1089;&#1090;&#1100; &#1090;&#1072; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;,
&#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1088;&#1077;&#1096;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099; &#1080;&#1083;&#1080; &#1085;&#1072;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1081; &#1084;&#1099;&#1089;&#1083;&#1100;&#1102;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1076;&#1091;&#1084;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086;  &#1074;&#1080;&#1076;&#1080;&#1090;&#1077;,
&#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;, &#1087;&#1086;&#1096;&#1083;&#1080;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1088;&#1091;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1086;&#1085;&#1072; &#1074; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080;,
&#1085;&#1077; &#1086;&#1073;&#1074;&#1080;&#1085;&#1103;&#1103; &#1085;&#1080;&#1082;&#1086;&#1075;&#1086; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1103;&#1079;&#1074;&#1080;&#1090;. &#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; "&#1061;&#1086;&#1088;&#1086;&#1096;&#1080;&#1093; &#1055;&#1086;&#1083;&#1080;&#1094;&#1077;&#1081;&#1089;&#1082;&#1080;&#1093;" &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1080;&#1084;&#1077;&#1102;&#1090; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1091;&#1102; &#1090;&#1077;&#1085;&#1076;&#1077;&#1085;&#1094;&#1080;&#1102; &#1079;&#1074;&#1091;&#1095;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1088;&#1077;&#1095;&#1100; &#1074;&#1086;&#1089;&#1087;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1103; &#1076;&#1077;&#1090;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1072;&#1076;&#1072;, &#1095;&#1080;&#1090;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; &#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1084; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072;,&#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1086;&#1090;&#1082;&#1072;&#1078;&#1077;&#1084;&#1089;&#1103; &#1086;&#1090; (&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093;)
      &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1072;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1091;&#1102; &#1044;&#1078;&#1077;&#1077;&#1084; 
      &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091; &#1089;&#1083;&#1086;&#1103; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; "&#1085;&#1072;&#1080;&#1074;&#1085;&#1086;&#1081; &#1080; &#1085;&#1077; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1102;&#1097;&#1077;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;&#1084;
      &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;". &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1087;&#1088;&#1072;&#1074;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;, &#1085;&#1086; &#1074;
      &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1090;&#1072;&#1082;&#1086;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1074;&#1086;&#1079;&#1074;&#1086;&#1084;&#1078;&#1085;&#1086;. &#1044;&#1078;&#1077;&#1081; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1083; &#1089;&#1074;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; 
      &#1087;&#1086; &#1076;&#1086;&#1073;&#1088;&#1086;&#1081; &#1074;&#1086;&#1083;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1091; &#1085;&#1077;&#1075;&#1086; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1080;, &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1080;&#1093; &#1080; &#1084;&#1099; &#1080;&#1093; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1084;
      &#1080;&#1083;&#1080; &#1089;&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1085;&#1086;&#1074;&#1091;&#1102; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091;. &#1071; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085; &#1095;&#1090;&#1086; &#1052;&#1077;&#1081; &#1085;&#1077; &#1093;&#1086;&#1090;&#1077;&#1083; &#1086;&#1089;&#1082;&#1086;&#1088;&#1073;&#1080;&#1090;&#1100;
      &#1083;&#1080;&#1095;&#1085;&#1086; &#1044;&#1078;&#1077;&#1103;, &#1085;&#1086; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1099;&#1084;, &#1072; &#1084;&#1099; &#1087;&#1099;&#1090;&#1072;&#1077;&#1084;&#1089;&#1103; &#1074;&#1077;&#1089;&#1090;&#1080; &#1079;&#1076;&#1077;&#1089;&#1100;
      &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;.</em></span></p><p><span class="emphasis"><em>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1071; &#1076;&#1091;&#1084;&#1072;&#1102; &#1052;&#1101;&#1081; &#1073;&#1099;&#1083; &#1087;&#1088;&#1072;&#1074;
      &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;, &#1095;&#1090;&#1086;...</em></span></p></blockquote></div><p>&#1050;&#1072;&#1082; &#1073;&#1099; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077; &#1079;&#1074;&#1091;&#1095;&#1072;&#1083;&#1080; &#1090;&#1072;&#1082;&#1080;&#1077; &#1086;&#1090;&#1074;&#1077;&#1090;&#1099;&#1074;, &#1086;&#1085;&#1080; &#1076;&#1072;&#1102;&#1090; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;.
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1089;&#1082;&#1086;&#1088;&#1077;&#1085;&#1103;&#1077;&#1090;&#1077; &#1087;&#1083;&#1086;&#1093;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1086; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1077; &#1080;&#1079;&#1074;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; 
&#1080;&#1083;&#1080; &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1086;&#1090; &#1074;&#1080;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1090;&#1086; &#1074;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077; &#1083;&#1102;&#1076;&#1103;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;
&#1086;&#1089;&#1090;&#1099;&#1090;&#1100; &#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1080;&#1093; &#1083;&#1091;&#1095;&#1096;&#1091;&#1102; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091;, &#1074;&#1077;&#1076;&#1103; &#1089;&#1077;&#1073;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1080;&#1083;&#1080;&#1095;&#1085;&#1086; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#8212;&#1080; &#1086;&#1085;&#1080; 
&#1089;&#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082;. &#1054;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1086;&#1074; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;&#8212;&#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; 
&#1101;&#1090;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1090;&#1077;&#1084;&#1086;&#1081;. &#1054;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077;,
&#1074;&#1088;&#1086;&#1076;&#1077; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1082; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072;. &#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1084;&#1080;&#1084;&#1086;&#1093;&#1086;&#1076;&#1086;&#1084;, 
&#1095;&#1090;&#1086; "&#1084;&#1099; &#1079;&#1076;&#1077;&#1089;&#1100; &#1090;&#1072;&#1082; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1084;", &#1085;&#1086; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077; &#1082; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1084;&#1091; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;, &#1090;&#1072;&#1082;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099; &#1076;&#1072;&#1083;&#1080; &#1083;&#1102;&#1076;&#1103;&#1084; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1090;&#1077;&#1084;&#1091;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1072;&#1076;&#1086; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1090;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1074;&#1086;&#1079;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; 
&#1086;&#1085;&#1080; &#1085;&#1077; &#1079;&#1072;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1083;&#1080; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1091;&#1087;&#1088;&#1077;&#1082;&#1072;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1090;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; &#1089;&#1087;&#1086;&#1088; &#1085;&#1072; &#1101;&#1090;&#1091; &#1090;&#1077;&#1084;&#1091;.
&#1058;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1081;&#1090;&#1077; (&#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1076;&#1091;&#1084;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090; &#1087;&#1072;&#1088; &#1080; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1072;), &#1080;&#1083;&#1080; &#1089;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077;,
&#1095;&#1090;&#1086; &#1074;&#1099; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1077;&#1090;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077;, &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1086;&#1089;&#1090;&#1088;&#1086; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080; &#1080; &#1095;&#1090;&#1086; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1085;&#1102;&#1072;&#1085;&#1089;&#1099; &#1074; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1077;, &#1072; 
&#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1090;&#1077;&#1084;&#1077;. &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072;, &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1085;&#1072;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1085;&#1072; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1085;&#1080;&#1080; &#1082;&#1077;&#1084;-&#1090;&#1086; &#1074;&#1080;&#1085;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;
&#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1072;&#1084;&#1080;&#1084; &#1089;&#1086;&#1073;&#1086;&#1081;, &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1074;&#1077;&#1083;&#1080; &#1089;&#1077;&#1073;&#1103; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1087;&#1086; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074;&#1086;&#1083;&#1077;
&#1079;&#1072;&#1093;&#1086;&#1090;&#1103;&#1090; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089;&#1090;&#1080; &#1080;&#1079;&#1074;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1101;&#1090;&#1086; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086;&#1083;&#1077;&#1087;&#1085;&#1086;, &#1085;&#1086; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;&#1090; &#1085;&#1077;&#1075;&#1086;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.</p><p>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1075;&#1086; &#1090;&#1086;&#1085;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;
"&#1074;&#1085;&#1091;&#1090;&#1088;&#1080;&#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1086;&#1075;&#1086;" &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1091;&#1081;&#1090;&#1080; &#1080;&#1079; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; (&#1076;&#1072;&#1078;&#1077; &#1080;&#1079; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1084; &#1085;&#1088;&#1072;&#1074;&#1103;&#1090;&#1089;&#1103; &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1085;&#1080; &#1093;&#1086;&#1090;&#1103;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;)
&#1080;&#1079;-&#1079;&#1072; &#1103;&#1079;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1080;&#1089;&#1077;&#1084;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1091;&#1096;&#1083;&#1080;; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; 
&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100; &#1079;&#1072; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081;, &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;
&#1090;&#1086;&#1083;&#1089;&#1090;&#1086;&#1082;&#1086;&#1078;&#1080;&#1084;, &#1080; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100;
&#1076;&#1086;&#1073;&#1088;&#1086;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1092;&#1086;&#1088;&#1091;&#1084;&#1077;&#8212;&#1101;&#1090;&#1086; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1103; &#1076;&#1083;&#1103; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1077;&#1077;
&#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1088;&#1080;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1087;&#1086;&#1082;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1072;&#1083;. &#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1101;&#1090;&#1086; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090;
&#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1099;, &#1074;&#1072;&#1084; &#1073;&#1086;&#1083;&#1100;&#1085;&#1077; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;
&#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;&#1084;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084; &#1077;&#1077;. &#1054;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1089;&#1077;&#1084;&#1080;.
</p></div><div class="sect2" title="&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1050;&#1086;&#1076;&#1072;"><div class="titlepage"><div><div><h3 class="title"><a name="code-review"></a>&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1050;&#1086;&#1076;&#1072;</h3></div></div></div><p>&#1054;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1083;&#1091;&#1095;&#1096;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1086;&#1097;&#1088;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1099; &#1083;&#1102;&#1076;&#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1083;&#1080; &#1085;&#1072; &#1082;&#1086;&#1076; &#1076;&#1088;&#1091;&#1075; &#1076;&#1088;&#1091;&#1075;&#1072;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1101;&#1090;&#1086; 
&#1087;&#1088;&#1086;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;&#8212;&#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099;; 
&#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1074; <a class="xref" href="vc.html#commit-emails" title="Commit emails">«Commit emails»</a>. &#1069;&#1092;&#1092;&#1077;&#1082;&#1090; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1093; &#1074; &#1090;&#1086;&#1084;,
&#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;, &#1086;&#1090;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086;,
&#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1079;&#1072;&#1085;&#1086;&#1089;&#1080;&#1084;&#1086;&#1077; &#1074; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;, &#1080; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1081; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1086;&#1090; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1081;
(&#1089;&#1084;. <a class="xref" href="vc.html#vc-vocabulary-diff"><em class="firstterm">diff</em></a>, &#1074;
<a class="xref" href="vc.html#vc-vocabulary" title="Version Control Vocabulary">«Version Control Vocabulary»</a>).  <em class="firstterm">&#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072;</em>
&#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1091;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1080;&#1081; &#1086; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1093; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089; &#1094;&#1077;&#1083;&#1100;&#1102;
&#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1081;.<sup>[<a name="idp5672320" href="#ftn.idp5672320" class="footnote">11</a>]</sup></p><p>&#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084; &#1094;&#1077;&#1083;&#1103;&#1084; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;. &#1069;&#1090;&#1086; &#1089;&#1072;&#1084;&#1099;&#1081; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;
&#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1090;&#1085;&#1086;&#1081; &#1086;&#1094;&#1077;&#1085;&#1082;&#1080; &#1074; &#1084;&#1080;&#1088;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1055;&#1054;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100;
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;,
&#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1091;&#1076;&#1072;, &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080; &#1085;&#1077; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081;; &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1095;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1075;&#1083;&#1072;&#1079; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;
&#1079;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1090;&#1077;&#1084; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1077;. &#1053;&#1086; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;
&#1080; &#1082;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1094;&#1077;&#1083;&#1080;: &#1086;&#1085;&#1086; &#1076;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1095;&#1090;&#1086; &#1090;&#1086; &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1076;&#1077;&#1083;&#1072;&#1102; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;,
&#1095;&#1090;&#1086; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1077;&#1075;&#1086; &#1085;&#1077; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090; &#1080;&#1093; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;.
&#1051;&#1102;&#1076;&#1080; &#1089;&#1090;&#1072;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080;&#1079;&#1086; &#1074;&#1089;&#1077;&#1093; &#1089;&#1080;&#1083;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090;, &#1095;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080; &#1087;&#1086;&#1090;&#1088;&#1072;&#1090;&#1103;&#1090; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; &#1086;&#1094;&#1077;&#1085;&#1082;&#1091;
&#1080;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.</p><p>&#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081;. &#1044;&#1072;&#1078;&#1077; &#1074; &#1090;&#1077;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1103; &#1089;&#1080;&#1076;&#1077;&#1083; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074; 
&#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1077; &#1089; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080;, &#1080; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1085;&#1072;&#1089; &#1074;&#1085;&#1086;&#1089;&#1080;&#1083; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1084;&#1099; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1083;&#1080;&#1089;&#1100; &#1086; &#1090;&#1086;&#1084;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1090;&#1100; &#1082;&#1086;&#1076; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1103; &#1074; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1077;, &#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;
&#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;. &#1054;&#1090; &#1090;&#1086;&#1075;&#1086; &#1092;&#1072;&#1082;&#1090;&#1072;, &#1095;&#1090;&#1086; &#1083;&#1102;&#1076;&#1080; &#1074;&#1080;&#1076;&#1103;&#1090; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;, &#1074;&#1099;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090; &#1074;&#1089;&#1077;. &#1051;&#1102;&#1076;&#1080;
&#1095;&#1080;&#1090;&#1072;&#1102;&#1090; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; &#1080; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074; &#1085;&#1080;&#1093; &#1085;&#1077;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080;  &#1085;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;, &#1089;&#1072;&#1084; &#1092;&#1072;&#1082;&#1090;
&#1074;&#1089;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090; &#1080;&#1084;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1086;&#1077;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1084;&#1099;&#1090;&#1100;&#1077; &#1087;&#1086;&#1089;&#1091;&#1076;&#1099;
&#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1080;&#1078;&#1082;&#1072; &#1075;&#1072;&#1079;&#1086;&#1085;&#1072;.</p><p>&#1042; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; Subversion, &#1084;&#1099; &#1087;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1091; &#1085;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;&#1089;&#1100; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1084; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1076;&#1072;.
&#1053;&#1077; &#1073;&#1099;&#1083;&#1086; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1080; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1086;, &#1093;&#1086;&#1090;&#1103;, &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1084;&#1086;&#1075; 
&#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1085; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1082;&#1086;&#1076;&#1072;. 
&#1055;&#1088;&#1086;&#1089;&#1082;&#1072;&#1083;&#1100;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; &#1090;&#1072;&#1082;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1083;&#1080; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1081;&#1084;&#1072;&#1085;&#1099;. &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;
&#1043;&#1088;&#1077;&#1075; &#1057;&#1090;&#1077;&#1081;&#1085;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1085;&#1072;&#1083; &#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072; &#1080;&#1079; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1075;&#1086; &#1086;&#1087;&#1099;&#1090;&#1072;, &#1088;&#1077;&#1096;&#1080;&#1083;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090;
&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1088;&#1072;&#1078;&#1072;&#1085;&#1080;&#1103;, &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1091;&#1103;  &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1091; <span class="emphasis"><em>&#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;</em></span>
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1085;&#1086;&#1089;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1082;&#1086;&#1076;&#1072;. &#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1085;&#1086;&#1089;&#1080;&#1083; &#1082;&#1090;&#1086; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086;, &#1074;&#1089;&#1082;&#1086;&#1088;&#1077; &#1089;&#1090;&#1072;&#1083;&#1086;
&#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086;&#1084; &#1086;&#1090; &#1043;&#1088;&#1077;&#1075;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1083;&#1080;&#1089;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;,
&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1080; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1093;&#1074;&#1072;&#1083;&#1080;&#1083;&#1080;&#1089;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1082;&#1091;&#1089;&#1082;&#1080; &#1082;&#1086;&#1076;&#1072;. &#1048; &#1089;&#1088;&#1072;&#1079;&#1091; &#1078;&#1077; &#1086;&#1085; &#1089;&#1090;&#1072;&#1083; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;
&#1080; &#1085;&#1077;&#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1077;&#1084;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;, &#1074; &#1080;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1087;&#1088;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1079;&#1085;&#1091;&#1083;&#1080; &#1073;&#1099; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077;&#1079;&#1072;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1054;&#1085; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1086; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072;
&#1085;&#1077; &#1078;&#1072;&#1083;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1103;&#1074;&#1083;&#1103;&#1083;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;&#1084;, &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080;
&#1101;&#1090;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1086; &#1087;&#1088;&#1080;&#1083;&#1080;&#1095;&#1085;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1085;&#1086; &#1086;&#1085; &#1087;&#1077;&#1083; &#1093;&#1074;&#1072;&#1083;&#1091; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1082;&#1086;&#1076;&#1072; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1072;&#1089;&#1100;
&#1090;&#1072;&#1082;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1044;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1083;&#1102;&#1076;&#1080;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1084;&#1077;&#1085;&#1103;, &#1090;&#1086;&#1078;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;.
&#1063;&#1090;&#1086; &#1085;&#1072;&#1084;&#1080; &#1076;&#1074;&#1080;&#1075;&#1072;&#1083;&#1086;? &#1053;&#1077; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1043;&#1088;&#1077;&#1075; &#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1089; &#1089;&#1090;&#1099;&#1076;&#1080;&#1083;. &#1053;&#1086; &#1086;&#1085; &#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072;
&#1073;&#1099;&#1083;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1081; &#1090;&#1088;&#1072;&#1090;&#1086;&#1081; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1080; &#1095;&#1090;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1078;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1099; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1087;&#1091;&#1090;&#1077;&#1084;
&#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1085;&#1086;&#1089;&#1080;&#1084;&#1099;&#1093; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080; &#1087;&#1091;&#1090;&#1077;&#1084; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;. &#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1085;
&#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;, &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1083;&#1086; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1099;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084;, &#1076;&#1086; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080;, &#1095;&#1090;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1085;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1083;&#1086; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1086; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072; &#1074;&#1086;&#1083;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080; &#1076;&#1072;&#1078;&#1077; &#1089;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;,
&#1089;&#1084;&#1086;&#1075; &#1083;&#1080; &#1091;&#1078;&#1077; &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1077;&#1075;&#1086; &#1086;&#1094;&#1077;&#1085;&#1080;&#1090;&#1100;. &#1055;&#1086;&#1079;&#1078;&#1077;, &#1043;&#1088;&#1077;&#1075; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1091;&#1078;&#1077; &#1085;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1072; &#1077;&#1084;&#1091; &#1084;&#1085;&#1086;&#1075;&#1086;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1085;&#1072; Subversion, &#1080; &#1077;&#1084;&#1091; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1077; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080;. &#1053;&#1086; &#1082; &#1090;&#1086;&#1084;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1101;&#1090;&#1072; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1082;&#1072;
&#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1082;&#1086;&#1088;&#1077;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1085;&#1072;&#1089;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100;, &#1073;&#1091;&#1076;&#1090;&#1086; &#1090;&#1072;&#1082; &#1080; &#1073;&#1099;&#1083;&#1086; &#1089; &#1085;&#1077;&#1079;&#1072;&#1087;&#1072;&#1084;&#1103;&#1090;&#1085;&#1099;&#1093; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;.</p><p>&#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1081;&#1090;&#1077; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;
&#1087;&#1088;&#1086;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1087;&#1086;&#1081;&#1084;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1082;&#1072;&#1082; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1091;&#1090;&#1077;&#1095;&#1082;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;,
&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1080;&#1083;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; API, &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1079;&#1072;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1079;&#1072;&#1085;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091;
(off-by-one), &#1085;&#1077;&#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086;/&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
&#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1086;&#1082;&#1088;&#1091;&#1078;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1076;&#1083;&#1103; &#1080;&#1093; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1076;&#1072;&#1078;&#1077; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1085;&#1099;&#1077;
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1085;&#1077;&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;,
&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1099;&#1084;&#1080;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1082;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1086; &#1087;&#1088;&#1086;&#1096;&#1083;&#1099;&#1093; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103;&#1093; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093;.</p><p>&#1053;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1090;&#1077;&#1089;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; 
&#1080;&#1083;&#1080; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099; &#1089; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1082;&#1086;&#1076;&#1072;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086;, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1077;&#1089;&#1090;&#1100; &#1095;&#1090;&#1086;
&#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1086; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;; &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1089;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;, &#1074;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1081;&#1090;&#1080; &#1095;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1093;&#1074;&#1072;&#1083;&#1080;&#1090;&#1100;. &#1042;&#1072;&#1078;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1077;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1077;&#1090;&#1082;&#1086; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091;,
&#1082;&#1090;&#1086; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1080;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1072; &#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1072;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072;
&#1085;&#1077; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074; &#1086;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1080; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1076;&#1086; &#1074;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1085;&#1072;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;
&#1090;&#1077;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1085; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1089;&#1072;&#1084;.</p></div><div class="sect2" title="&#1054;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1103; &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090; &#1041;&#1091;&#1076;&#1100;&#1090;&#1077; &#1042;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099; &#1082; &#1047;&#1085;&#1072;&#1095;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;"><div class="titlepage"><div><div><h3 class="title"><a name="opening-closed-projects"></a>&#1054;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1103; &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1055;&#1088;&#1086;&#1077;&#1082;&#1090; &#1041;&#1091;&#1076;&#1100;&#1090;&#1077; &#1042;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099; &#1082; &#1047;&#1085;&#1072;&#1095;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;</h3></div></div></div><p>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;, &#1090;&#1072;&#1082;&#1086;&#1081;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1091;&#1095;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;,
&#1087;&#1088;&#1080;&#1074;&#1099;&#1082;&#1096;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1074; &#1086;&#1073;&#1089;&#1090;&#1072;&#1085;&#1086;&#1082;&#1077; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;, &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090;,
&#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099; &#1075;&#1088;&#1103;&#1076;&#1091;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1099;&#8212;&#1080; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1089;&#1072;&#1084;&#1080; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1089; &#1080;&#1093; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103;.</p><p>&#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1074;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1072; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1076;&#1083;&#1103; &#1085;&#1080;&#1093;: &#1088;&#1072;&#1085;&#1100;&#1096;&#1077;
&#1074;&#1089;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082;&#1086;&#1076;&#1072; &#1080; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;&#1089;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1085;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1073;&#1086;&#1083;&#1077;&#1077; &#1080;&#1083;&#1080; &#1084;&#1077;&#1085;&#1077;&#1077; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1099;&#1090;&#1099;&#1074;&#1072;&#1083;&#1080;
&#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086;&#1077; &#1076;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1085;&#1072;&#1083;&#1080;
&#1089;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080; &#1089;&#1083;&#1072;&#1073;&#1099;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093;. &#1040; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1077; &#1086;&#1090;&#1076;&#1072;&#1090;&#1100; &#1080;&#1093; &#1082;&#1086;&#1076;
&#1085;&#1072; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1084; &#1083;&#1102;&#1076;&#1103;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;
&#1086;&#1089;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1103;&#1089;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072; &#1082;&#1086;&#1076;&#1077;, &#1073;&#1077;&#1079; &#1091;&#1095;&#1077;&#1090;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072; &#1084;&#1086;&#1075;&#1083;&#1086;
&#1076;&#1080;&#1082;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;.
&#1069;&#1090;&#1080; &#1085;&#1077;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1094;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1076;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1102;&#1090;
&#1085;&#1099;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1082; &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1085;&#1080;&#1102; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;, &#1085;&#1072;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1085;&#1080; &#1090;&#1072;&#1082; &#1090;&#1103;&#1078;&#1077;&#1083;&#1086; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1080;, <span class="emphasis"><em>&#1074;&#1089;&#1077; &#1077;&#1097;&#1077;</em></span> &#1085;&#1077; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084; (&#1080; &#1101;&#1090;&#1086; &#1085;&#1077;&#1080;&#1079;&#1073;&#1077;&#1078;&#1085;&#1086;). &#1048;, &#1095;&#1090;&#1086; &#1093;&#1091;&#1078;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086;,
&#1074;&#1085;&#1086;&#1074;&#1100; &#1087;&#1088;&#1080;&#1073;&#1099;&#1074;&#1096;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1077;, &#1073;&#1077;&#1079;&#1083;&#1080;&#1082;&#1080;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1074;&#1072;&#1096;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;
&#1091;&#1078;&#1077; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1089;&#1074;&#1086;&#1080;&#1093; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103;&#1093;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1072; &#1086;&#1073;&#1086;&#1089;&#1090;&#1088;&#1080;&#1090;&#1089;&#1103;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1080; &#1091;&#1082;&#1072;&#1078;&#1091;&#1090; &#1085;&#1072; &#1076;&#1099;&#1088;&#1099; &#1074; &#1082;&#1086;&#1076;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1085; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1093;&#1091;&#1078;&#1077;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1102;&#1090;
&#1101;&#1090;&#1086; &#1074; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1077;&#1075;&#1086; &#1082;&#1086;&#1083;&#1083;&#1077;&#1075;. &#1048; &#1101;&#1090;&#1086; &#1085;&#1077;&#1080;&#1079;&#1073;&#1077;&#1078;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1096;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086;&#1083;&#1077;&#1087;&#1085;&#1099;&#1093;
&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1086;&#1074;;&#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1078;&#1077;, &#1087;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1091; &#1090;&#1072;&#1082;&#1086;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080;. &#1042;&#1089;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1085;&#1077; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;,
&#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1087;&#1083;&#1086;&#1093;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099;; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1083;&#1102;&#1073;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;, &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1102;&#1097;&#1072;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;,
&#1080; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1090;&#1085;&#1072;&#1103; &#1086;&#1094;&#1077;&#1085;&#1082;&#1072; &#1074;&#1099;&#1103;&#1074;&#1080;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; (&#1089;&#1084;.
<a class="xref" href="setting-tone.html#code-review" title="&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1050;&#1086;&#1076;&#1072;">«&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1091;&#1081;&#1090;&#1077; &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1077; &#1056;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1050;&#1086;&#1076;&#1072;»</a><span>&#1088;&#1072;&#1085;&#1077;&#1077; &#1074; &#1101;&#1090;&#1086;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;</span>). &#1042; &#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;,
&#1089;&#1072;&#1084; &#1085;&#1086;&#1074;&#1086;&#1087;&#1088;&#1080;&#1073;&#1099;&#1074;&#1096;&#1080;&#1077; &#1087;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1091; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; &#1086;&#1094;&#1077;&#1085;&#1082;&#1080;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1082;&#1086;&#1076;,
&#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1087;&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1103;&#1090;&#1089;&#1103; &#1089; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1096;&#1077;. &#1044;&#1083;&#1103; &#1074;&#1072;&#1096;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1080;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1087;&#1086;&#1090;&#1086;&#1082; &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1080;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1076;&#1077;&#1090; &#1082; &#1085;&#1080;&#1084;, &#1085;&#1086; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1086;&#1090; &#1085;&#1080;&#1093;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1089;&#1090;&#1100; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1089;&#1088;&#1077;&#1076;&#1080; &#1089;&#1090;&#1072;&#1088;&#1086;&#1081; &#1075;&#1074;&#1072;&#1088;&#1076;&#1080;&#1080; 
&#1086;&#1073;&#1088;&#1072;&#1079;&#1072; &#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1085;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1091;&#1075;&#1086;&#1083; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;.</p><p>The best way to prevent this is to warn everyone about what's
coming, explain it, tell them that the initial discomfort is perfectly
normal, and reassure them that it's going to get better.  Some of
these warnings should take place privately, before the project is
opened.  But you may also find it helpful to remind people on the
public lists that this is a new way of development for the project,
and that it will take some time to adjust.  The very best thing you
can do is lead by example.  If you don't see your developers answering
enough newbie questions, then just telling them to answer more isn't
going to help.  They may not have a good sense of what warrants a
response and what doesn't yet, or it could be that they don't have a
feel for how to prioritize coding work against the new burden of
external communications.  The way to get them to participate is to
participate yourself.  Be on the public mailing lists, and make sure
to answer some questions there.  When you don't have the
expertise to field a question, then visibly hand it off to a developer
who does&#8212;and watch to make sure he follows up with an answer,
or at least a response.  It will naturally be tempting for the
longtime developers to lapse into private discussions, since that's
what they're used to.  Make sure you're subscribed to the internal
mailing lists on which this might happen, so you can ask that such
discussions be moved to the public lists right away.</p><p>There are other, longer-term concerns with opening up formerly
closed projects.  <a class="xref" href="money.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 5. Money">&#1043;&#1083;&#1072;&#1074;&#1072; 5, <i>Money</i></a> explores
techniques for mixing paid and unpaid developers successfully, and
<a class="xref" href="legal.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 9. Licenses, Copyrights, and Patents">&#1043;&#1083;&#1072;&#1074;&#1072; 9, <i>Licenses, Copyrights, and Patents</i></a> discusses the necessity of legal diligence
when opening up a private code base that may contain software written
or "owned" by other parties.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp5326768" href="#idp5326768" class="para">10</a>] </sup>&#1052;&#1099; &#1077;&#1097;&#1077; &#1085;&#1077; &#1076;&#1086;&#1096;&#1083;&#1080; &#1076;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1086; &#1076;&#1086;&#1074;&#1077;&#1088;&#1080;&#1080;, &#1085;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;
&#1090;&#1086;, &#1095;&#1090;&#1086; &#1103; &#1073;&#1091;&#1076;&#1091; &#1074; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1087;&#1086;&#1074;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100;: &#1080;&#1084;&#1103; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1073;&#1099;&#1083;&#1086; &#1041;&#1088;&#1072;&#1081;&#1077;&#1085; &#1041;&#1077;&#1093;&#1083;&#1077;&#1085;&#1076;&#1086;&#1088;&#1092;,
&#1080; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1085; &#1091;&#1082;&#1072;&#1079;&#1072;&#1083; &#1085;&#1072; &#1086;&#1073;&#1097;&#1091;&#1102; &#1079;&#1085;&#1072;&#1095;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;,
&#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1077;&#1090; &#1086;&#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1091;&#1078;&#1076;&#1099; &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1084; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1077;.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5672320" href="#idp5672320" class="para">11</a>] </sup>&#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1090;&#1072;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;
&#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;. &#1042; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1093;, "&#1088;&#1077;&#1094;&#1077;&#1085;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072;" &#1090;&#1072;&#1082; &#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1089;&#1080;&#1076;&#1103;&#1097;&#1080;&#1093; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1080; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1077;&#1095;&#1072;&#1090;&#1082;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1074; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072;&#1093;
&#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1080;&#1083;&#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="license-quickstart.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="announcing.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1042;&#1099;&#1073;&#1086;&#1088; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1080; &#1077;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> Announcing</td></tr></table></div></body></html>
