<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="prev" href="announcing.html" title="Announcing"><link rel="next" href="mailing-lists.html" title="&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1081; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="announcing.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="mailing-lists.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;"><div class="titlepage"><div><div><h2 class="title"><a name="technical-infrastructure"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;</h2></div></div></div><div class="toc"><p><b>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</b></p><dl><dt><span class="sect1"><a href="technical-infrastructure.html#tools-needed">&#1063;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;</a></span></dt><dt><span class="sect1"><a href="mailing-lists.html">&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1081; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</a></span></dt><dd><dl><dt><span class="sect2"><a href="mailing-lists.html#spam-prevention">Spam Prevention</a></span></dt><dd><dl><dt><span class="sect3"><a href="mailing-lists.html#spam-filtering">Filtering posts</a></span></dt><dt><span class="sect3"><a href="mailing-lists.html#address-hiding">Address hiding in archives</a></span></dt></dl></dd><dt><span class="sect2"><a href="mailing-lists.html#header-management">Identification and Header Management</a></span></dt><dt><span class="sect2"><a href="mailing-lists.html#reply-to">The Great Reply-to Debate</a></span></dt><dd><dl><dt><span class="sect3"><a href="mailing-lists.html#reply-fantasies">Two fantasies</a></span></dt></dl></dd><dt><span class="sect2"><a href="mailing-lists.html#archiving">Archiving</a></span></dt><dt><span class="sect2"><a href="mailing-lists.html#mailing-list-software">Software</a></span></dt></dl></dd><dt><span class="sect1"><a href="vc.html">Version Control</a></span></dt><dd><dl><dt><span class="sect2"><a href="vc.html#vc-vocabulary">Version Control Vocabulary</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-choosing">Choosing a Version Control System</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-using">Using the Version Control System</a></span></dt><dd><dl><dt><span class="sect3"><a href="vc.html#version-everything">Version everything</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-browsing">Browsability</a></span></dt><dt><span class="sect3"><a href="vc.html#commit-emails">Commit emails</a></span></dt><dt><span class="sect3"><a href="vc.html#branches">Use branches to avoid bottlenecks</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-singularity">Singularity of information</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-authz">Authorization</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="bug-tracker.html">Bug Tracker</a></span></dt><dd><dl><dt><span class="sect2"><a href="bug-tracker.html#bug-tracker-mailing-list-interaction">Interaction with Mailing Lists</a></span></dt><dt><span class="sect2"><a href="bug-tracker.html#bug-filtering">Pre-Filtering the Bug Tracker</a></span></dt></dl></dd><dt><span class="sect1"><a href="irc.html">IRC / Real-Time Chat Systems</a></span></dt><dd><dl><dt><span class="sect2"><a href="irc.html#bots">Bots</a></span></dt><dt><span class="sect2"><a href="irc.html#irc-archiving">Archiving IRC</a></span></dt></dl></dd><dt><span class="sect1"><a href="rss.html">RSS Feeds</a></span></dt><dt><span class="sect1"><a href="wikis.html">Wikis</a></span></dt><dt><span class="sect1"><a href="web-site.html">Web Site</a></span></dt><dd><dl><dt><span class="sect2"><a href="web-site.html#canned-hosting">Canned Hosting</a></span></dt><dd><dl><dt><span class="sect3"><a href="web-site.html#canned-hosting-choosing">Choosing a canned hosting site</a></span></dt><dt><span class="sect3"><a href="web-site.html#anonymity">Anonymity and involvement</a></span></dt></dl></dd></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1099; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077;
&#1089;&#1073;&#1086;&#1088; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1053;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;
&#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1101;&#1090;&#1080; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1080; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
&#1080;&#1093; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1078;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080; &#1074;&#1072;&#1096; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;. &#1048; &#1095;&#1077;&#1084; &#1096;&#1080;&#1088;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1096; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;,
&#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1103;&#1074;&#1085;&#1086;&#1081; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086;&#1089;&#1090;&#1100; &#1101;&#1090;&#1086;&#1075;&#1086; &#1091;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;. &#1061;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1101;&#1090;&#1086; &#1090;&#1086;,
&#1095;&#1090;&#1086; &#1085;&#1077; &#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1076;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1086;&#1076; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084;
&#1047;&#1072;&#1082;&#1086;&#1085;&#1072; &#1041;&#1088;&#1091;&#1082;&#1089;&#1072;,<sup>[<a name="idp5971952" href="#ftn.idp5971952" class="footnote">12</a>]</sup>
&#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1097;&#1077;&#1075;&#1086; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1082; &#1079;&#1072;&#1087;&#1072;&#1079;&#1076;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084;&#1091; &#1087;&#1086; &#1089;&#1088;&#1086;&#1082;&#1072;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1077;&#1097;&#1077; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1086;&#1090;&#1086;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1090; &#1089;&#1088;&#1086;&#1082;&#1080; &#1077;&#1075;&#1086; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1060;&#1088;&#1077;&#1076;&#1077;&#1088;&#1080;&#1082; &#1041;&#1088;&#1091;&#1082;&#1089;&#1072; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;
&#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086; <span class="emphasis"><em>&#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1091;</em></span> &#1095;&#1080;&#1089;&#1083;&#1072; &#1077;&#1075;&#1086;
&#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1083;&#1080;&#1096;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1086;&#1073;&#1089;&#1091;&#1076;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1078;&#1077; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1099; &#1089;&#1086;&#1090;&#1085;&#1080; &#1083;&#1102;&#1076;&#1077;&#1081;
&#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1073;&#1099;&#1090;&#1100; &#1074; &#1082;&#1091;&#1088;&#1089;&#1077;, &#1095;&#1077;&#1084; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1087;&#1088;&#1086;&#1095;&#1080;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080;. &#1048; &#1077;&#1089;&#1083;&#1080; &#1089; &#1090;.&#1079;. &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1076;&#1072;&#1090;&#1100;
&#1087;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1074;
&#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1077;, &#1090;&#1086; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;: &#1095;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1077;
&#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1095;&#1085;&#1091;&#1090; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1074; &#1101;&#1090;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1077;?</p><p>&#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1085;&#1077; &#1085;&#1086;&#1074;&#1072;. &#1044;&#1083;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1081; (&#1085;&#1077;&#1084;&#1077;&#1090;&#1072;&#1092;&#1086;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;) &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1099;
&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1090;&#1080;&#1087;&#1086;&#1074;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#8212; <em class="firstterm">&#1087;&#1072;&#1088;&#1083;&#1072;&#1084;&#1077;&#1085;&#1090;&#1089;&#1082;&#1072;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;</em>: &#1090;&#1086;&#1095;&#1085;&#1099;&#1077;
&#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1080; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1093; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1082;&#1072;&#1082;
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1085;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1103; &#1085;&#1077; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1083;&#1080;&#1089;&#1100; &#1074; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1073;&#1077;&#1089;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093;
&#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074;, &#1082;&#1072;&#1082; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; (&#1087;&#1086;&#1076;&#1082;&#1086;&#1084;&#1080;&#1090;&#1077;&#1090;&#1099;), &#1082;&#1072;&#1082; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;
&#1091;&#1078;&#1077; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1099;, &#1080; &#1090;.&#1076;. &#1042;&#1072;&#1078;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1087;&#1072;&#1088;&#1083;&#1072;&#1084;&#1077;&#1085;&#1090;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1082; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081;
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;. Some remarks are made "for the record", others are not.  The
record itself is subject to direct manipulation, and is understood to
be not a literal transcript of what occurred, but a representation of
what the group is willing to <span class="emphasis"><em>agree</em></span> occurred.  The
record is not monolithic, but takes different forms for different
purposes.  It comprises the minutes of individual meetings, the
complete collection of all minutes of all meetings, summaries, agendas
and their annotations, committee reports, reports from correspondents
not present, lists of action items, etc.</p><p>&#1041;&#1083;&#1072;&#1075;&#1086; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090; &#1085;&#1077; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1085;&#1072;&#1090;&#1072;, &#1080; &#1085;&#1072;&#1084; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1090;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1072;&#1088;&#1083;&#1072;&#1084;&#1077;&#1085;&#1090;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;
&#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; &#1086;&#1090; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074; &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;. &#1053;&#1086; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;
&#1087;&#1088;&#1080;&#1077;&#1084;&#1086;&#1074; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;
&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1080;&#1085;&#1090;&#1077;&#1085;&#1089;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1088;&#1083;&#1072;&#1084;&#1077;&#1085;&#1090;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1086;&#1081; (&#1087;&#1072;&#1088;&#1083;&#1072;&#1084;&#1077;&#1085;&#1090;&#1089;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1086;&#1081; &#1085;&#1072; &#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1072;&#1093;). &#1057; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077;
&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; &#1089;&#1074;&#1086;&#1076;&#1080;&#1083;&#1086;&#1089;&#1100; &#1082; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1082;&#1077;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077;
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1101;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1080; &#1076;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1084;&#1072;&#1088;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;; &#1076;&#1083;&#1103;
&#1084;&#1080;&#1085;&#1080;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1090;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1077;&#1077; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;; &#1076;&#1083;&#1103;
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1093; &#1087;&#1086; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1091;; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1077;&#1081;
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;; &#1080; &#1076;&#1083;&#1103; &#1089;&#1074;&#1103;&#1079;&#1080; &#1088;&#1072;&#1079;&#1088;&#1086;&#1079;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1082;&#1091;&#1089;&#1086;&#1095;&#1082;&#1086;&#1074; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1076;&#1088;&#1091;&#1075;
&#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1101;&#1090;&#1072; &#1089;&#1074;&#1103;&#1079;&#1100; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1040;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080;
&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1091;&#1089;&#1074;&#1086;&#1103;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1086;&#1074;, &#1080; &#1073;&#1091;&#1076;&#1091;&#1090;
 &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;
&#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;. &#1053;&#1086; &#1074;&#1089;&#1077; &#1089;&#1090;&#1072;&#1088;&#1072;&#1085;&#1080;&#1103; &#1074; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1089;&#1095;&#1077;&#1090;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090;
&#1087;&#1077;&#1088;&#1077;&#1076;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1053;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;,
&#1089;&#1088;&#1077;&#1076;&#1072; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1072;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1084;&#1072;&#1088;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, and
recording, &#1080; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074;
 &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077;. &#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1078;&#1077;, &#1074;&#1089;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086;
&#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1074;&#1084;&#1077;&#1096;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;, &#1080;
&#1074;&#1072;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1084;&#1077;&#1096;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;.

&#1042; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1089;&#1103; &#1086; &#1084;&#1072;&#1088;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1077; &#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1074;&#1074;&#1086;&#1076;&#1077; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1086; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1090;&#1100; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
&#1087;&#1086; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084;&#1091;.</p><p>&#1069;&#1090;&#1072; &#1075;&#1083;&#1072;&#1074;&#1072; &#1089;&#1091;&#1075;&#1091;&#1073;&#1086; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103;, &#1073;&#1072;&#1079;&#1080;&#1088;&#1091;&#1102;&#1097;&#1072;&#1103;&#1089;&#1103; &#1085;&#1072;
&#1086;&#1087;&#1099;&#1090;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1090;&#1080;&#1087;&#1086;&#1074;&#1099;&#1084;&#1080; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1072;&#1084;&#1080; &#1082; &#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102;. &#1053;&#1086; &#1089;&#1091;&#1090;&#1100; &#1077;&#1077;
&#1085;&#1077; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1085;&#1072;&#1073;&#1086;&#1088;&#1091; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1077;&#1084;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099;,
&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1086;&#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
 &#1086;&#1073;&#1097;&#1080;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;, &#1074;&#1077;&#1076;&#1091;&#1097;&#1080;&#1081; &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1085;&#1072;&#1074;&#1099;&#1082;&#1086;&#1074;
&#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1085;&#1072;&#1074;&#1099;&#1082;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;,
&#1087;&#1086;&#1074;&#1089;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;
(&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1084;. &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1082; &#1088;&#1077;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;
<a class="xref" href="bug-tracker.html#bug-filtering" title="Pre-Filtering the Bug Tracker">«Pre-Filtering the Bug Tracker»</a><span> &#1076;&#1072;&#1083;&#1077;&#1077;
&#1074; &#1101;&#1090;&#1086;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;</span>). &#1053;&#1072;&#1074;&#1099;&#1082;&#1080; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080; &#1090;&#1072;&#1082; &#1078;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;,
&#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;  &#1090;&#1072;&#1082; &#1078;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1088;&#1077;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;: it's not always
immediately obvious how to use these tools to full advantage, and in
some cases projects have conflicting conventions (for example, see the
discussion of setting <code class="systemitem">Reply-to</code> headers on
outgoing mailing list posts, in <a class="xref" href="mailing-lists.html" title="&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1081; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;">«&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1081; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;»</a>).


Everyone involved with the project will need to be encouraged, at the
right times and in the right ways, to do their part to keep the
project's information well organized.  The more involved the
contributor, the more complex and specialized the techniques she can
be expected to learn.</p><p>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1085;&#1099;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086;
&#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1085;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1072;&#1097;&#1080;&#1093; &#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;. &#1042; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074;, &#1076;&#1072;&#1078;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1077; &#1089;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;
&#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1080; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100;, &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1101;&#1090;&#1080;&#1084;, &#1085;&#1086;
&#1088;&#1086;&#1089;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; &#1085;&#1077;&#1087;&#1088;&#1080;&#1077;&#1084;&#1083;&#1077;&#1084;&#1099;&#1084;&#1080;. &#1048;&#1083;&#1080;
&#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1086;&#1089;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;, &#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;
&#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1084;&#1092;&#1086;&#1088;&#1090;&#1085;&#1099;&#1093; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103;&#1093; &#1089; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;
&#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081;, &#1082;&#1090;&#1086;-&#1090;&#1086; &#1074;&#1099;&#1088;&#1074;&#1077;&#1090;&#1089;&#1103; &#1074;&#1087;&#1077;&#1088;&#1077;&#1076; &#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1077;&#1090;&#1077;&#1090;
&#1085;&#1086;&#1074;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;, &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1089;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1074;&#1072;&#1096; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1077;&#1077; &#8212; &#1095;&#1090;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
&#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1084;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;, &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1080;&#1084;&#1080;&#1089;&#1103; &#1076;&#1086;
&#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; wiki (&#1089;&#1084;.
<a class="ulink" href="http://en.wikipedia.org/wiki/Wiki" target="_top">http://en.wikipedia.org/wiki/Wiki</a>). &#1052;&#1085;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#8212;
&#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1088;&#1086;&#1084;&#1080;&#1089;&#1089;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1086;&#1084; &#1076;&#1083;&#1103;
&#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1080; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1086;&#1084; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1083;&#1103;&#1077;&#1090; &#1077;&#1077;,
&#1080;&#1083;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1080;
&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1086;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089;&#1090;&#1080;.</p><p>&#1054;&#1089;&#1090;&#1077;&#1088;&#1077;&#1075;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1086;&#1090; &#1080;&#1089;&#1082;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103; "&#1087;&#1077;&#1088;&#1077;&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;" (&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1074;&#1089;&#1077;&#1075;&#1086;), &#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1090;&#1077;&#1093;
&#1074;&#1077;&#1097;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;. &#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;
&#1074;&#1072;&#1078;&#1085;&#1072;, &#1085;&#1086; &#1095;&#1090;&#1086; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;, &#1090;&#1072;&#1082; &#1101;&#1090;&#1086;
&#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1074; &#1085;&#1077;&#1084;
&#1083;&#1102;&#1076;&#1077;&#1081;. &#1043;&#1083;&#1072;&#1074;&#1085;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#8212; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1083;&#1102;&#1076;&#1103;&#1084;
&#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;.</p></div><div class="sect1" title="&#1063;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="tools-needed"></a>&#1063;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;</h2></div></div></div><p>&#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1074;&#1086;&#1077;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;, &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;, &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088;
&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;:</p><div class="variablelist"><dl><dt><span class="term">&#1057;&#1072;&#1081;&#1090;</span></dt><dd><p>&#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;, &#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1090;&#1088;&#1091;&#1073;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;
           &#1086;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1082; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;. &#1042;&#1077;&#1073;-&#1089;&#1072;&#1081;&#1090;
           &#1084;&#1086;&#1078;&#1077;&#1090; &#1090;&#1072;&#1082; &#1078;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; &#1076;&#1083;&#1103; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
           &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.</p></dd><dt><span class="term">&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</span></dt><dd><p>&#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1072;&#1084;&#1099;&#1081; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1082;&#1088;&#1091;&#1075; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; 
             &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1090;&#1072;&#1082; &#1078;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1088;&#1086;&#1083;&#1100; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; ("medium of record").</p></dd><dt><span class="term">&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;</span></dt><dd><p>&#1044;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1082;&#1086;&#1076;&#1072;&#1093;,
             &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1086;&#1090;&#1082;&#1072;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1080; "change porting".  &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;
             &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086; &#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1089;&#1103; &#1089; &#1082;&#1086;&#1076;&#1086;&#1084;.</p></dd><dt><span class="term">&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; (&#1073;&#1072;&#1075;-&#1090;&#1088;&#1077;&#1082;&#1077;&#1088;)</span></dt><dd><p>&#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100; &#1079;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;,
             &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1080; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;. &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;
             &#1074;&#1089;&#1077;&#1084; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1085;&#1086;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;
             &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;) &#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093;
             &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;.  &#1052;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1076;&#1083;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;, &#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077;
             &#1076;&#1083;&#1103; &#1086;&#1090;&#1089;&#1083;&#1077;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1086;&#1074; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1102; &#1085;&#1086;&#1074;&#1099;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1080; &#1090;.&#1076;.</p></dd><dt><span class="term">&#1054;&#1073;&#1084;&#1077;&#1085; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; (&#1095;&#1072;&#1090;)</span></dt><dd><p>&#1057;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1080;&#1081; &#1076;&#1083;&#1103;
             &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;-&#1086;&#1090;&#1074;&#1077;&#1090;.  &#1053;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083;
             &#1072;&#1088;&#1093;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1080;.</p></dd></dl></div><p>&#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1086; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1085;&#1091;&#1078;&#1076;, &#1085;&#1086; &#1074; &#1095;&#1077;&#1084;-&#1090;&#1086;
&#1080;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1080; &#1101;&#1090;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;.
&#1053;&#1080;&#1078;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1077;&#1085;&#1086;, &#1080;, &#1095;&#1090;&#1086; &#1089;&#1072;&#1084;&#1086;&#1077; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077;, &#1082;&#1072;&#1082;
&#1076;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1083;&#1102;&#1076;&#1103;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1080;&#1084;.  &#1042;&#1077;&#1073;-&#1089;&#1072;&#1081;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;,
&#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1074;&#1103;&#1079;&#1091;&#1102;&#1097;&#1080;&#1084; &#1079;&#1074;&#1077;&#1085;&#1086;&#1084; (&#1082;&#1083;&#1077;&#1077;&#1074;&#1086;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081;) &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1087;&#1088;&#1086;&#1095;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;, 
&#1095;&#1077;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1082;&#1072;&#1082; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084;.</p><p>&#1050;&#1089;&#1090;&#1089;&#1090;&#1080;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1075;&#1086;&#1083;&#1086;&#1074;&#1085;&#1086;&#1081; &#1073;&#1086;&#1083;&#1080; &#1087;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1091;
&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1101;&#1090;&#1080;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; <em class="firstterm">&#1090;&#1080;&#1087;&#1086;&#1074;&#1086;&#1081;
&#1093;&#1086;&#1089;&#1090;&#1080;&#1085;&#1075;</em>: &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1090;&#1080;&#1087;&#1086;&#1074;&#1086;&#1077;,
&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1085;&#1086;&#1077; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;
&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.  &#1063;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077;
<a class="xref" href="web-site.html#canned-hosting" title="Canned Hosting">«Canned Hosting»</a><span> &#1076;&#1072;&#1083;&#1077;&#1077;
&#1074; &#1101;&#1090;&#1086;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;</span> &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1086;&#1080;&#1085;&#1089;&#1090;&#1074; 
&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1086;&#1074; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp5971952" href="#idp5971952" class="para">12</a>] </sup><em class="citetitle">The Mythical Man
Month</em>, &#1060;. &#1041;&#1088;&#1091;&#1082;&#1089;, 1975. &#1057;&#1084;. &#1090;&#1072;&#1082;&#1078;&#1077; <a class="ulink" href="http://en.wikipedia.org/wiki/The_Mythical_Man-Month" target="_top">http://en.wikipedia.org/wiki/The_Mythical_Man-Month</a> &#1080; <a class="ulink" href="http://en.wikipedia.org/wiki/Brooks_Law" target="_top">http://en.wikipedia.org/wiki/Brooks_Law</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="announcing.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="mailing-lists.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">Announcing </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1086;&#1081; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;</td></tr></table></div></body></html>
