<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;"><link rel="up" href="introduction.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;"><link rel="prev" href="introduction.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;"><link rel="next" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="introduction.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><th width="60%" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</th><td width="20%" align="right"> <a accesskey="n" href="getting-started.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="sect1" title="&#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="today"></a>&#1057;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;</h2></div></div></div><p>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;, &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100;
&#1086;&#1073; &#1101;&#1090;&#1080;&#1093; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1092;&#1080;&#1083;&#1086;&#1089;&#1086;&#1092;&#1089;&#1082;&#1080;&#1093; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103;&#1093; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1076;&#1077;&#1085;&#1100;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1085;&#1077; &#1085;&#1072;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1102;&#1090;
&#1085;&#1072; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1089;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089; &#1080;&#1093; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1074;&#1089;&#1077;
(&#1090;&#1077; &#1082;&#1090;&#1086; &#1085;&#1072;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1102;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1103;&#1090; &#1082; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1080; &#1074;
&#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;). &#1053;&#1086; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; "&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081;"
&#1087;&#1088;&#1086;&#1090;&#1080;&#1074; "&#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;" &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1086;&#1090;&#1095;&#1072;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; 
&#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1090;&#1100; &#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1099;&#1093; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072;&#1084; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;,
&#1086;&#1090;&#1095;&#1072;&#1089;&#1090;&#1080;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1090;&#1080;&#1074;&#1086;&#1074; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1101;&#1090;&#1086; &#1083;&#1091;&#1095;&#1096;&#1080;&#1081; &#8212;&#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077;
<span class="emphasis"><em>&#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1081;</em></span>&#8212; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;.</p><p>&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#8212;&#1101;&#1090;&#1086; &#1082;&#1091;&#1083;&#1100;&#1090;&#1091;&#1088;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090;.
&#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1077;&#1077;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1074; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1095;&#1077;&#1084;&#1091;
&#1083;&#1102;&#1076;&#1080; &#1077;&#1077; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090;. &#1058;&#1077;&#1093;&#1085;&#1080;&#1082;&#1080; &#1087;&#1088;&#1080;&#1085;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1083;&#1102;&#1076;&#1080; &#1085;&#1077;&#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099; &#1085;&#1072;
&#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;, &#1086;&#1085;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1073;&#1077;&#1088;&#1091;&#1090;&#1089;&#1103; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;. &#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1072;&#1078;&#1077; &#1089;&#1088;&#1077;&#1076;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1077;&#1074;, &#1089;&#1074;&#1086;&#1077;&#1081; &#1083;&#1077;&#1075;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1074;. 
&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1083;&#1102;&#1076;&#1077;&#1081; &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1083;&#1080;&#1089;&#1100;
&#1083;&#1080;&#1094;&#1086;&#1084; &#1082; &#1083;&#1080;&#1094;&#1091; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080;, &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1077;&#1083;&#1080;&#1083;&#1080;&#1089;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1080;&#1084;
&#1101;&#1090;&#1086; &#1085;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;&#1089;&#1100;. &#1053;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1072;&#1085;&#1072;&#1083;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1083;&#1102;&#1076;&#1080; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1080;
&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1090; &#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1099;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1089;&#1091;&#1079;&#1080;&#1083;&#1089;&#1103; &#1076;&#1086; &#1090;&#1086;&#1085;&#1077;&#1085;&#1100;&#1082;&#1086;&#1075;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;: &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;,
&#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1099;&#1084; &#1089;&#1077;&#1090;&#1103;&#1084;. &#1048;&#1079;-&#1079;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1083;&#1086;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;
&#1094;&#1077;&#1083;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1075;&#1088;&#1091;&#1087;&#1087; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;. &#1053;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;
&#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1073;&#1088;&#1086;&#1074;&#1086;&#1083;&#1100;&#1094;&#1072; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1087;&#1103;&#1090;&#1100; &#1084;&#1080;&#1085;&#1091;&#1090; 
&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1093;&#1086;&#1088;&#1086;&#1096;&#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1103;,
&#1085;&#1086;&#1074;&#1080;&#1095;&#1082;&#1080; &#1088;&#1077;&#1076;&#1082;&#1086; &#1076;&#1072;&#1102;&#1090; &#1077;&#1084;&#1091; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1096;&#1072;&#1085;&#1089;.</p><p>&#1041;&#1099;&#1089;&#1090;&#1088;&#1086;&#1090;&#1077;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1080;&#1083;&#1080;, &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; <span class="emphasis"><em>&#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103;</em></span>
&#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1090;&#1077;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1086;&#1073;&#1077;&#1089;&#1082;&#1091;&#1088;&#1072;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1072;&#1103;
&#1079;&#1072;&#1076;&#1072;&#1095;&#1072;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;. &#1063;&#1090;&#1086; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090; &#1074;&#1089;&#1077;&#1093; &#1101;&#1090;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;
&#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1087;&#1083;&#1086;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1086;&#1083;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1095;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100;
&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;&#1077;? &#1054;&#1090;&#1074;&#1077;&#1090; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1086;&#1089;&#1090;&#1072;&#1074;&#1096;&#1091;&#1102;&#1089;&#1103;
&#1095;&#1072;&#1089;&#1090;&#1100; &#1101;&#1090;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1077;&#1075;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1074;&#1099;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1080;&#1084; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;,
&#1086;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1090;&#1072;&#1082;&#1080;&#1084;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1051;&#1102;&#1076;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1080;&#1093; &#1089;&#1074;&#1103;&#1079;&#1100;
	  &#1089; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1080; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086;, &#1087;&#1088;&#1103;&#1084;&#1086; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;
	  &#1080;&#1093; &#1074;&#1082;&#1083;&#1072;&#1076;&#1072;&#1084;.</em></span></p></blockquote></div><p>&#1053;&#1080; &#1086;&#1076;&#1085;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1080;&#1083;&#1080; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072;
&#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1086;&#1073;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1076;&#1080;&#1089;&#1082;&#1088;&#1080;&#1084;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086; &#1085;&#1077;-&#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;
&#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;. &#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099; &#1089;&#1087;&#1086;&#1085;&#1089;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1080;/&#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080;
&#1085;&#1072; &#1079;&#1072;&#1088;&#1087;&#1083;&#1072;&#1090;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1099; &#1074; &#1101;&#1090;&#1086;&#1084; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1080;. &#1043;&#1083;&#1072;&#1074;&#1072;  <a class="xref" href="money.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 5. Money">&#1043;&#1083;&#1072;&#1074;&#1072; 5, <i>Money</i></a>
&#1094;&#1077;&#1083;&#1080;&#1082;&#1086;&#1084; &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1072; &#1101;&#1090;&#1086;&#1084;&#1091;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1101;&#1090;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1086;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1090;,
&#1090;&#1086; &#1074;&#1072;&#1084; &#1085;&#1077; &#1086; &#1095;&#1077;&#1084; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1100;&#1089;&#1103;. &#1044;&#1077;&#1085;&#1100;&#1075;&#1080; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1090;&#1100; &#1085;&#1072; &#1091;&#1089;&#1087;&#1077;&#1093; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1045;&#1089;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;: &#1082;&#1072;&#1082;&#1086;&#1081; &#1103;&#1079;&#1099;&#1082; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1091;&#1102; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1102;,
&#1082;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;, &#1082;&#1072;&#1082;&#1091;&#1102; &#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;
&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1080; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086;&#1076;&#1085;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072; &#1085;&#1086;&#1075;&#1080; - &#1090;&#1077;&#1084;&#1072;
 <a class="link" href="getting-started.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;"> &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1099;.</a>.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="introduction.html">&#1055;&#1088;&#1077;&#1076;.</a> </td><td width="20%" align="center"><a accesskey="u" href="introduction.html">&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;</a></td><td width="40%" align="right"> <a accesskey="n" href="getting-started.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top"> &#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</td></tr></table></div></body></html>
