<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#35613;&#36766;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="preface.html" title="&#24207;&#25991;"><link rel="prev" href="sources.html" title="&#24773;&#22577;&#28304;"><link rel="next" href="disclaimer.html" title="&#20813;&#36012;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#35613;&#36766;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="sources.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#24207;&#25991;</th><td width="20%" align="right"> <a accesskey="n" href="disclaimer.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#35613;&#36766;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="acknowledgments"></a>&#35613;&#36766;</h2></div></div></div><p>
    &#26412;&#26360;&#12434;&#26360;&#12365;&#19978;&#12370;&#12427;&#12395;&#12399;&#12289;&#24403;&#21021;&#12398;&#20104;&#23450;&#12398;4&#20493;&#12367;&#12425;&#12356;&#12398;&#26178;&#38291;&#12364;&#12363;&#12363;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#12381;&#12398;&#38291;&#12398;&#33510;&#12375;&#12373;&#12392;&#12356;&#12387;&#12383;&#12425;&#12289;&#12414;&#12427;&#12391;&#26397;&#12363;&#12425;&#26217;&#12414;&#12391;&#38957;&#12398;&#19978;&#12395;&#12464;&#12521;&#12531;&#12489;&#12500;&#12450;&#12494;&#12364;&#12388;&#12427;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
    &#22810;&#12367;&#12398;&#26041;&#12293;&#12398;&#21161;&#12369;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;&#26412;&#26360;&#12434;&#26360;&#12365;&#19978;&#12370;&#12427;&#21069;&#12395;&#38957;&#12364;&#12362;&#12363;&#12375;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    O'Reilly&#12398;&#32232;&#38598;&#32773;&#12391;&#12354;&#12427;Andy Oram&#12399;&#12289;&#22519;&#31558;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;&#22818;&#12398;&#12424;&#12358;&#12394;&#23384;&#22312;&#12391;&#12375;&#12383;&#12290;
    &#24444;&#12399;&#12371;&#12398;&#20998;&#37326;&#12395;&#12388;&#12356;&#12390;&#29087;&#30693;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#65288;&#23455;&#38555;&#12289;&#26412;&#26360;&#12391;&#25201;&#12387;&#12383;&#12488;&#12500;&#12483;&#12463;&#12398;&#22810;&#12367;&#12399;&#24444;&#12398;&#21161;&#35328;&#12434;&#21442;&#32771;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#65289;&#12290;
    &#12414;&#12383;&#12289;&#12381;&#12428;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#24444;&#12399;&#12300;&#20154;&#12364;&#20309;&#12434;&#35328;&#12362;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#23519;&#30693;&#12375;&#12289;
    &#12381;&#12428;&#12434;&#12415;&#12435;&#12394;&#12395;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#20253;&#12360;&#12427;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#12434;&#21161;&#35328;&#12377;&#12427;&#12301;&#12392;&#12356;&#12358;&#39006;&#12414;&#12428;&#12394;&#25165;&#33021;&#12398;&#25345;&#12385;&#20027;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#24444;&#12392;&#20181;&#20107;&#12434;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12390;&#12289;&#22823;&#22793;&#20809;&#26628;&#12391;&#12375;&#12383;&#12290;
    &#12414;&#12383;&#12289;&#26412;&#26360;&#12398;&#20986;&#29256;&#12398;&#25552;&#26696;&#12434;Andy&#12395;&#12377;&#12368;&#20253;&#12360;&#12390;&#12367;&#12428;&#12383;Chuck Toporek&#12395;&#12418;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;
</p><p>
    Brian Fitzpatrick &#12399;&#31169;&#12364;&#26360;&#12356;&#12383;&#20869;&#23481;&#12434;&#36880;&#19968;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#12362;&#12363;&#12370;&#12391;&#26412;&#26360;&#12398;&#20869;&#23481;&#12364;&#12424;&#12426;&#12424;&#12356;&#12418;&#12398;&#12392;&#12394;&#12387;&#12383;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12393;&#12371;&#12363;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12398;&#12394;&#12356;&#12392;&#12371;&#12429;&#12408;&#34892;&#12387;&#12390;&#12375;&#12414;&#12356;&#12383;&#12356;&#12392;&#24605;&#12387;&#12383;&#12392;&#12365;&#12391;&#12418;&#12289;
    &#31169;&#12434;&#22519;&#31558;&#20316;&#26989;&#12395;&#12392;&#12393;&#12414;&#12425;&#12379;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    Ben Collins-Sussman &#12392; Mike Pilato &#12418;&#22519;&#31558;&#12398;&#36914;&#12415;&#20855;&#21512;&#12434;&#27671;&#12395;&#12363;&#12369;&#12390;&#12367;&#12428;&#12289;
    &#12381;&#12398;&#36913;&#12395;&#26360;&#12365;&#32066;&#12360;&#12424;&#12358;&#12392;&#24605;&#12387;&#12390;&#12356;&#12383;&#12354;&#12425;&#12422;&#12427;&#12488;&#12500;&#12483;&#12463;&#12395;&#38306;&#12375;&#12390;&#12289;&#12356;&#12388;&#12391;&#12418;&#21916;&#12435;&#12391;&#12289;
    &#12392;&#12365;&#12395;&#12399;&#38263;&#12293;&#12392;&#30456;&#35527;&#12395;&#20055;&#12387;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#12425;&#12399;&#12414;&#12383;&#12289;&#31169;&#12398;&#22519;&#31558;&#12506;&#12540;&#12473;&#12364;&#33853;&#12385;&#12383;&#12392;&#12365;&#12395;&#22768;&#12434;&#12363;&#12369;&#12390;&#12367;&#12428;&#12383;&#12426;&#12289;
    &#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#12399;&#20778;&#12375;&#12367;&#23567;&#35328;&#12434;&#35328;&#12387;&#12390;&#12367;&#12428;&#12383;&#12426;&#12375;&#12414;&#12375;&#12383;&#12290;&#12354;&#12426;&#12364;&#12392;&#12358;&#12290;&#21161;&#12363;&#12387;&#12383;&#12424;&#12290;
</p><p>
    &#31169;&#12364;&#26412;&#26360;&#12434;&#22519;&#31558;&#12375;&#12390;&#12356;&#12427;&#12398;&#12392;&#21516;&#12376;&#12371;&#12429;&#12289;Biella Coleman &#12399;&#33258;&#20998;&#12398;&#23398;&#20301;&#35542;&#25991;&#12434;&#20316;&#25104;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#27598;&#26085;&#12377;&#12431;&#12387;&#12390;&#22519;&#31558;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12393;&#12358;&#12356;&#12358;&#12371;&#12392;&#12363;&#12434;&#24444;&#22899;&#12399;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#24444;&#22899;&#12399;&#33258;&#20998;&#12398;&#35542;&#25991;&#12434;&#26360;&#12365;&#12388;&#12388;&#12289;&#31169;&#12395;&#12356;&#12429;&#12356;&#12429;&#12394;&#33288;&#21619;&#28145;&#12356;&#20363;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#12414;&#12383;&#12424;&#12356;&#30456;&#35527;&#30456;&#25163;&#12392;&#12394;&#12387;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;&#24444;&#22899;&#12399;&#12414;&#12383;&#12289;
    &#20154;&#39006;&#23398;&#32773;&#12392;&#12375;&#12390;&#12398;&#35222;&#28857;&#12363;&#12425;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#12395;&#38306;&#12377;&#12427;&#24847;&#35211;&#12434;&#36848;&#12409;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#22899;&#12364;&#25945;&#12360;&#12390;&#12367;&#12428;&#12383;&#12450;&#12452;&#12487;&#12450;&#12420;&#21442;&#32771;&#25991;&#29486;&#12399;&#12289;&#26412;&#26360;&#12434;&#22519;&#31558;&#12377;&#12427;&#19978;&#12391;&#22823;&#12365;&#12367;&#24441;&#31435;&#12385;&#12414;&#12375;&#12383;&#12290;
    Alex Golub&#8212;&#24444;&#12418;&#12414;&#12383;&#20154;&#39006;&#23398;&#32773;&#12391;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#27963;&#21205;&#12395;&#12418;&#36275;&#12434;&#36367;&#12415;&#20837;&#12428;&#12390;&#12362;&#12426;&#12289;
    &#21516;&#12376;&#12371;&#12429;&#12395;&#23398;&#20301;&#35542;&#25991;&#12434;&#26360;&#12356;&#12390;&#12414;&#12375;&#12383;&#8212;&#12418;&#12289;&#22519;&#31558;&#12434;&#38283;&#22987;&#12375;&#12383;&#24403;&#21021;&#12363;&#12425;&#12378;&#12387;&#12392;&#31169;&#12434;&#21161;&#12369;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
</p><p>
    Micah Anderson &#12399;&#12393;&#12358;&#12356;&#12358;&#12431;&#12369;&#12363;&#24444;&#33258;&#36523;&#12398;&#22519;&#31558;&#12395;&#12354;&#12414;&#12426;&#22311;&#36843;&#24863;&#12434;&#24863;&#12376;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#35211;&#12360;&#12394;&#12367;&#12390;&#12289;
    &#12381;&#12398;&#12371;&#12392;&#12364;&#30149;&#30340;&#12391;&#22956;&#12415;&#12434;&#29983;&#12416;&#12424;&#12358;&#12394;&#12420;&#12426;&#26041;&#12391;&#24433;&#38911;&#12434;&#19982;&#12360;&#12390;&#12367;&#12428;&#12383;&#12398;&#12384;&#12369;&#12393;&#12289;&#12391;&#12418;&#24444;&#12399;&#12356;&#12388;&#12391;&#12418;&#21451;&#22909;&#30340;&#12391;&#12289;
    &#20250;&#35441;&#12434;&#12375;&#12390;&#12367;&#12428;&#12390;&#12289;&#65288;&#23569;&#12394;&#12367;&#12392;&#12418;&#19968;&#24230;&#12399;&#65289;&#25216;&#34899;&#30340;&#12394;&#12469;&#12509;&#12540;&#12488;&#12418;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;&#12354;&#12426;&#12364;&#12392;&#12358;&#12289;Micah&#65281;
</p><p>
    Jon Trowbridge &#12392; Sander Striker &#12399;&#12289;&#31169;&#12434;&#21191;&#27671;&#20184;&#12369;&#12390;&#12367;&#12428;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#20855;&#20307;&#30340;&#12394;&#21161;&#35328;&#12418;&#12367;&#12428;&#12414;&#12375;&#12383;
    &#8212;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12362;&#12369;&#12427;&#24444;&#12425;&#12398;&#24133;&#24195;&#12356;&#32076;&#39443;&#12399;&#12289;&#12363;&#12369;&#12364;&#12360;&#12398;&#12394;&#12356;&#36039;&#26009;&#12434;&#25552;&#20379;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
</p><p>
    Greg Stein &#12395;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;&#12424;&#12365;&#21451;&#12392;&#12375;&#12390;&#31169;&#12434;&#21191;&#27671;&#20184;&#12369;&#12390;&#12367;&#12428;&#12383;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#24120;&#12395;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12434;&#12377;&#12427;&#12371;&#12392;&#12364;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12362;&#12356;&#12390;&#12393;&#12428;&#12384;&#12369;&#37325;&#35201;&#12391;&#12354;&#12427;&#12398;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31169;&#12395;&#25945;&#12360;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    Brian Behlendorf &#12395;&#12418;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;&#24444;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#20844;&#12398;&#22580;&#12391;&#35696;&#35542;&#12434;&#12377;&#12427;&#12371;&#12392;&#12398;&#37325;&#35201;&#24615;&#12434;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12371;&#12398;&#21407;&#21063;&#12364;&#26412;&#26360;&#20840;&#20307;&#12395;&#21453;&#26144;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#26395;&#12415;&#12414;&#12377;&#12290;
</p><p>
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12381;&#12398;&#25919;&#27835;&#30340;&#12394;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12356;&#12429;&#12356;&#12429;&#35486;&#12387;&#12390;&#12367;&#12428;&#12383;
    Benjamin "Mako" Hill &#12392; Seth Schoen&#12289;
    &#24537;&#12375;&#12356;&#20013;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12434;&#35519;&#25972;&#12375;&#12390;&#12452;&#12531;&#12479;&#12499;&#12517;&#12540;&#12395;&#24540;&#12376;&#12390;&#12367;&#12428;&#12383; Zack Urlocker
    &#12392; Louis Suarez-Potts&#12289;Slashcode &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;&#12434;&#24341;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#35377;&#21487;&#12375;&#12390;&#12367;&#12428;&#12383; Shane&#12289;
    &#12381;&#12375;&#12390;&#12373;&#12414;&#12374;&#12414;&#12394;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#27604;&#36611;&#12434;&#34892;&#12387;&#12390;&#12367;&#12428;&#12383;Haggen&#12289;&#12415;&#12394;&#12373;&#12435;&#12395;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;
</p><p>
    Alla Dekhtyar&#12289;Polina &#12381;&#12375;&#12390; Sonya&#12290;&#12415;&#12394;&#12373;&#12435;&#12398;&#12383;&#12422;&#12414;&#12396;&#21169;&#12414;&#12375;&#12395;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;
    &#31169;&#12399;&#12418;&#12358;&#12289;&#24112;&#23429;&#12375;&#12390;&#12300;&#26412;&#12301;&#12434;&#22519;&#31558;&#12377;&#12427;&#12383;&#12417;&#12395;&#12415;&#12435;&#12394;&#12392;&#12398;&#22812;&#12434;&#26089;&#12293;&#12392;&#25171;&#12385;&#12365;&#12427;
   &#65288;&#12354;&#12427;&#12356;&#12399;&#12416;&#12375;&#12429;&#12289;&#25171;&#12385;&#20999;&#12429;&#12358;&#12392;&#12375;&#12390;&#22833;&#25943;&#12377;&#12427;&#65289;&#24517;&#35201;&#12399;&#12394;&#12356;&#12435;&#12384;&#12290;&#12392;&#12387;&#12390;&#12418;&#23305;&#12375;&#12356;&#12424;&#12290;
</p><p>
    Jack Repenning&#12398;&#21451;&#24773;&#12392;&#21161;&#35328;&#12395;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;
    &#24444;&#12399;&#12289;&#31169;&#12364;&#23433;&#30452;&#12394;&#20998;&#26512;&#12395;&#12424;&#12387;&#12390;&#35492;&#12387;&#12383;&#32080;&#35542;&#12434;&#23566;&#12365;&#20986;&#12381;&#12358;&#12392;&#12375;&#12390;&#12356;&#12383;&#12392;&#12365;&#12395;&#21427;&#12375;&#12367;&#12381;&#12428;&#12434;&#25351;&#25688;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#12300;&#12385;&#12423;&#12387;&#12392;&#12375;&#12435;&#12393;&#12356;&#12369;&#12428;&#12393;&#12289;&#12418;&#12358;&#19968;&#24230;&#20998;&#26512;&#12375;&#30452;&#12375;&#12390;&#12415;&#12424;&#12358;&#12424;&#12290;&#12365;&#12387;&#12392;&#36949;&#12358;&#32080;&#35542;&#12395;&#12394;&#12427;&#12363;&#12425;&#12301;&#12392;&#12290;
    &#24444;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#12384;&#12369;&#12391;&#12394;&#12367;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29987;&#26989;&#12395;&#38306;&#12375;&#12390;&#12418;&#38263;&#12356;&#32076;&#39443;&#12398;&#25345;&#12385;&#20027;&#12391;&#12377;&#12290;
    &#24444;&#12398;&#32076;&#39443;&#12364;&#26412;&#26360;&#12395;&#21453;&#26144;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#39000;&#12356;&#12414;&#12377;&#12290;
</p><p>
    CollabNet &#12399;&#12289;&#31169;&#12364;&#26412;&#26360;&#12398;&#22519;&#31558;&#12398;&#12383;&#12417;&#12395;&#19981;&#35215;&#21063;&#12394;&#21220;&#21209;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12395;&#12394;&#12427;&#12371;&#12392;&#12434;&#29305;&#21029;&#12395;&#35469;&#12417;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#12381;&#12375;&#12390;&#24403;&#21021;&#12398;&#20104;&#23450;&#12424;&#12426;&#12381;&#12428;&#12364;&#38263;&#24341;&#12356;&#12383;&#12392;&#12365;&#12418;&#25991;&#21477;&#12402;&#12392;&#12388;&#35328;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
    &#32076;&#21942;&#38499;&#12364;&#12381;&#12428;&#12434;&#35377;&#12375;&#12390;&#12367;&#12428;&#12427;&#12414;&#12391;&#12395;&#12393;&#12435;&#12394;&#22256;&#38627;&#12394;&#36947;&#12398;&#12426;&#12364;&#12354;&#12387;&#12383;&#12398;&#12363;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    Sandhya Klute &#12420; Mahesh Murthy &#12399;&#12365;&#12387;&#12392;&#12356;&#12429;&#12356;&#12429;&#33510;&#21172;&#12375;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;2&#20154;&#12395;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;
</p><p>
    Subversion &#38283;&#30330;&#12481;&#12540;&#12512;&#12391;&#12398;&#36942;&#21435;5&#24180;&#12395;&#12431;&#12383;&#12427;&#32076;&#39443;&#12363;&#12425;&#12289;&#31169;&#12399;&#22810;&#22823;&#12394;&#24433;&#38911;&#12434;&#21463;&#12369;&#12414;&#12375;&#12383;&#12290;
    &#26412;&#26360;&#12398;&#20869;&#23481;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12398;&#32076;&#39443;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12513;&#12531;&#12496;&#12540;&#20840;&#21729;&#12398;&#21517;&#21069;&#12434;&#25369;&#12370;&#12427;&#12371;&#12392;&#12399;&#12375;&#12414;&#12379;&#12435;&#65288;&#20154;&#25968;&#12364;&#22810;&#12377;&#12366;&#12427;&#12398;&#12391;&#65289;&#12290;
    &#12364;&#12289;&#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#12393;&#12371;&#12363;&#12391; Subversion &#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#20986;&#20250;&#12387;&#12383;&#12425;&#12289;
    &#12362;&#33590;&#12398;1&#26479;&#12391;&#12418;&#12362;&#12372;&#12387;&#12390;&#12420;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#8212;&#31169;&#12418;&#12381;&#12358;&#12377;&#12427;&#12388;&#12418;&#12426;&#12391;&#12377;&#12290;
</p><p>
    &#26412;&#26360;&#12398;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#12289;Rachel Scollon &#12395;&#23550;&#12375;&#12390;&#12464;&#12481;&#12434;&#12371;&#12412;&#12377;&#12371;&#12392;&#12418;&#22810;&#12293;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#22899;&#12399;&#12356;&#12388;&#12418;&#12381;&#12428;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#22899;&#12392;&#12402;&#12392;&#12375;&#12365;&#12426;&#35441;&#12434;&#12375;&#12383;&#12354;&#12392;&#12399;&#12289;&#12356;&#12388;&#12418;&#12300;&#24605;&#12387;&#12390;&#12356;&#12383;&#12411;&#12393;&#12383;&#12356;&#12375;&#12383;&#21839;&#38988;&#12376;&#12419;&#12394;&#12363;&#12387;&#12383;&#12394;&#12301;&#12392;&#24863;&#12376;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#21161;&#12363;&#12387;&#12383;&#12424;&#12290;&#12354;&#12426;&#12364;&#12392;&#12358;&#12290;
</p><p>
    Noel Taylor&#12395;&#12399;&#24863;&#35613;&#12375;&#12390;&#12418;&#12375;&#12365;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#26412;&#26360;&#12398;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#31169;&#12364;&#25955;&#12293;&#12464;&#12481;&#12387;&#12390;&#12356;&#12383;&#12398;&#12434;&#32862;&#12356;&#12390;
   &#12300;&#21069;&#22238;&#12398;&#22519;&#31558;&#12398;&#12392;&#12365;&#25955;&#12293;&#12464;&#12481;&#12434;&#12371;&#12412;&#12375;&#12390;&#12362;&#12356;&#12390;&#12289;&#12394;&#12435;&#12391;&#12371;&#12356;&#12388;&#12399;&#12414;&#12383;&#21029;&#12398;&#26412;&#12434;&#26360;&#12371;&#12358;&#12392;&#12375;&#12390;&#12427;&#12435;&#12384;&#65311;&#12301;
    &#12392;&#24605;&#12387;&#12390;&#12356;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;&#24444;&#12398;&#21451;&#24773;&#12392; Golosá &#12398;&#12522;&#12540;&#12480;&#12540;&#12471;&#12483;&#12503;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;
    &#24537;&#12375;&#12367;&#12390;&#12383;&#12414;&#12425;&#12394;&#12356;&#12392;&#12365;&#12391;&#12418;&#38899;&#27005;&#12392;&#21451;&#24773;&#12384;&#12369;&#12399;&#24536;&#12428;&#12378;&#12395;&#12356;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
    Matthew Dean &#12392; Dorothea Samtleben &#12395;&#12418;&#24863;&#35613;&#12375;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#38263;&#24180;&#33510;&#27005;&#12434;&#12392;&#12418;&#12395;&#12375;&#12383;&#12511;&#12517;&#12540;&#12472;&#12471;&#12515;&#12531;&#20210;&#38291;&#12391;&#12377;&#12364;&#12289;
    &#32244;&#32722;&#12395;&#20184;&#12365;&#21512;&#12360;&#12394;&#12356;&#12392;&#12356;&#12358;&#31169;&#12398;&#35328;&#12356;&#35379;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    Megan Jennings &#12399;&#24120;&#12395;&#31169;&#12395;&#21332;&#21147;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#33258;&#20998;&#12395;&#12392;&#12387;&#12390;&#12354;&#12414;&#12426;&#12394;&#12376;&#12415;&#12398;&#12394;&#12356;&#12488;&#12500;&#12483;&#12463;&#12395;&#12388;&#12356;&#12390;&#12418;&#29105;&#24515;&#12395;&#27671;&#12395;&#12363;&#12369;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#24515;&#32048;&#12356;&#20316;&#23478;&#12395;&#12392;&#12387;&#12390;&#12289;&#12371;&#12428;&#12411;&#12393;&#21191;&#27671;&#20184;&#12369;&#12425;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#21451;&#12424;&#12289;&#12354;&#12426;&#12364;&#12392;&#12358;&#65281;
</p><p>
    Yoav Shapira&#12289;Andrew Stellman&#12289;Davanum Srinivas&#12289;Ben Hyde &#12398;4&#20154;&#12399;&#26412;&#26360;&#12398;&#20869;&#23481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#12425;&#12398;&#21161;&#35328;&#12364;&#12354;&#12387;&#12383;&#12371;&#12392;&#12391;&#12289;&#26412;&#26360;&#12399;&#12424;&#12426;&#12424;&#12356;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#12418;&#12375;&#24444;&#12425;&#12398;&#32032;&#26228;&#12425;&#12375;&#12356;&#21161;&#35328;&#12434;&#12377;&#12409;&#12390;&#21462;&#12426;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12390;&#12356;&#12428;&#12400;&#12289;&#12371;&#12398;&#26412;&#12399;&#12418;&#12387;&#12392;&#12424;&#12356;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12356;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#26178;&#38291;&#12398;&#21046;&#32004;&#12398;&#12383;&#12417;&#12356;&#12367;&#12388;&#12363;&#12500;&#12483;&#12463;&#12450;&#12483;&#12503;&#12375;&#12390;&#21462;&#12426;&#20837;&#12428;&#12374;&#12427;&#12434;&#24471;&#12394;&#12363;&#12387;&#12383;&#12392;&#12356;&#12358;&#12398;&#12364;&#29694;&#23455;&#12391;&#12377;&#12364;&#12289;
    &#12381;&#12428;&#12391;&#12418;&#25913;&#21892;&#12399;&#30446;&#12434;&#12415;&#12399;&#12427;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
</p><p>
    &#31169;&#12398;&#20001;&#35242;&#12391;&#12354;&#12427; Frances &#12392; Henry &#12399;&#12289;&#12356;&#12388;&#12418;&#36890;&#12426;&#31169;&#12434;&#28201;&#12363;&#12367;&#35211;&#23432;&#12387;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#21069;&#33879;&#12364;&#25216;&#34899;&#23492;&#12426;&#12384;&#12387;&#12383;&#12398;&#12395;&#23550;&#12375;&#12390;&#20170;&#22238;&#12399;&#25216;&#34899;&#38754;&#20197;&#22806;&#12398;&#20869;&#23481;&#12418;&#22810;&#12367;&#21547;&#12435;&#12391;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#12365;&#12387;&#12392;&#24444;&#12425;&#12418;&#27005;&#12375;&#12435;&#12391;&#35501;&#12435;&#12391;&#12367;&#12428;&#12427;&#12418;&#12398;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#26368;&#24460;&#12395;&#12289;Karen Underhill &#12392; Jim Blandy &#12395;&#35613;&#24847;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;
    Karen&#12398;&#21451;&#24773;&#12392;&#29702;&#35299;&#12399;&#12289;&#26412;&#26360;&#12398;&#22519;&#31558;&#20316;&#26989;&#12395;&#12392;&#12393;&#12414;&#12425;&#12378;&#12371;&#12398;7&#24180;&#38291;&#31169;&#12434;&#12378;&#12387;&#12392;&#25903;&#12360;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#22899;&#12398;&#21161;&#12369;&#12364;&#12394;&#12369;&#12428;&#12400;&#26412;&#26360;&#12434;&#20316;&#12426;&#19978;&#12370;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;
    Jim&#12418;&#21516;&#12376;&#12391;&#12377;&#12290;&#24444;&#12399;&#30495;&#12398;&#21451;&#20154;&#12289;&#12381;&#12375;&#12390;&#12495;&#12483;&#12459;&#12540;&#12398;&#20013;&#12398;&#12495;&#12483;&#12459;&#12540;&#12290;
    &#40165;&#12398;&#39131;&#12403;&#26041;&#12434;&#21442;&#32771;&#12395;&#12375;&#12390;&#39131;&#34892;&#27231;&#12364;&#30330;&#26126;&#12373;&#12428;&#12383;&#12398;&#12392;&#21516;&#27096;&#12395;&#12289;
    &#31169;&#12418;&#24444;&#12398;&#23039;&#12434;&#35211;&#12390;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20309;&#12383;&#12427;&#12363;&#12434;&#23398;&#12435;&#12384;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="sources.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="disclaimer.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24773;&#22577;&#28304; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20813;&#36012;</td></tr></table></div></body></html>
