<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24195;&#22577;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;"><link rel="prev" href="setting-tone.html" title="&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367;"><link rel="next" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24195;&#22577;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="setting-tone.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</th><td width="20%" align="right"> <a accesskey="n" href="technical-infrastructure.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#24195;&#22577;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="announcing"></a>&#24195;&#22577;</h2></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20154;&#12395;&#35211;&#12379;&#12425;&#12428;&#12427;&#29366;&#24907; (&#23436;&#20840;&#12394;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#21336;&#12395;&#12392;&#12426;&#12354;&#12360;&#12378;&#35211;&#12379;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#31243;&#24230;) &#12395;&#12394;&#12387;&#12383;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#20840;&#19990;&#30028;&#12395;&#21521;&#12369;&#12390;&#20844;&#38283;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#23455;&#38555;&#12395;&#12399;&#38750;&#24120;&#12395;&#31777;&#21336;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;&#12414;&#12378; <a class="ulink" href="http://freecode.com/" target="_top">http://freecode.com/</a>
  &#12395;&#34892;&#12387;&#12390;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12496;&#12540;&#12398; <span class="guimenuitem">Submit</span> &#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;
  &#12501;&#12457;&#12540;&#12512;&#12395;&#20869;&#23481;&#12434;&#20837;&#21147;&#12375;&#12373;&#12360;&#12377;&#12428;&#12400;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#23459;&#20253;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
  Freecode (&#20197;&#21069;&#12399; Freshmeat.net &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;2011 &#24180; 10 &#26376;&#12395;&#21517;&#21069;&#12364;&#22793;&#12431;&#12426;&#12414;&#12375;&#12383;)
  &#12399;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#27671;&#12395;&#12394;&#12427;&#25968;&#22810;&#12367;&#12398;&#20154;&#12364;&#35211;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12377;&#12427;&#12491;&#12517;&#12540;&#12473;&#12364;&#12381;&#12398;&#20013;&#12398;&#20309;&#20154;&#12363;&#12398;&#30446;&#12395;&#12392;&#12414;&#12428;&#12400;&#12289;
  &#24460;&#12399;&#21475;&#12467;&#12511;&#12391;&#12381;&#12398;&#24773;&#22577;&#12364;&#24195;&#12414;&#12387;&#12390;&#12356;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12377;&#12427;&#12362;&#30693;&#12425;&#12379;&#12434;&#25237;&#31295;&#12377;&#12427;&#12398;&#12395;&#36969;&#12375;&#12383;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;
  &#12491;&#12517;&#12540;&#12474;&#12464;&#12523;&#12540;&#12503;&#12364;&#12354;&#12427;&#12398;&#12394;&#12425;&#12289;&#12381;&#12371;&#12395;&#25237;&#31295;&#12377;&#12427;&#12398;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#25237;&#31295;&#12377;&#12427;&#12398;&#12399;&#12381;&#12428;&#12382;&#12428;&#12398;&#22580;&#25152;&#12391;&#19968;&#24230;&#12378;&#12388;&#12384;&#12369;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#24460;&#12398;&#35696;&#35542;&#12399;&#12289;(<code class="systemitem">Reply-to</code> &#12504;&#12483;&#12480;&#12434;&#35373;&#23450;&#12375;&#12390;)
  &#33258;&#20998;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20250;&#35696;&#23460;&#12391;&#32154;&#12369;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#25237;&#31295;&#20869;&#23481;&#12399;&#12289;&#35201;&#28857;&#12434;&#12414;&#12392;&#12417;&#12383;&#30701;&#12356;&#12418;&#12398;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><pre class="screen">
To: discuss@lists.example.org
Subject: [ANN] Scanley &#20840;&#25991;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#21270;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;
Reply-to: dev@scanley.org

Scanley &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#31435;&#12385;&#19978;&#12364;&#12387;&#12383;&#12371;&#12392;&#12434;&#12362;&#30693;&#12425;&#12379;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#20840;&#25991;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20316;&#25104;&#22120;&#12362;&#12424;&#12403;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12391;&#12289;
&#35914;&#23500;&#12394; API &#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;&#22823;&#12365;&#12394;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;
&#23550;&#35937;&#12392;&#12375;&#12383;&#20840;&#25991;&#26908;&#32034;&#27231;&#33021;&#12434;&#33258;&#20998;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#32068;&#12415;&#36796;&#12417;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
Scanley &#12399;&#12424;&#12358;&#12420;&#12367;&#12414;&#12392;&#12418;&#12395;&#21205;&#12367;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#29366;&#24907;&#12398;&#12418;&#12398;&#12391;&#12289;&#29694;&#22312;&#12418;&#27963;&#30330;&#12395;
&#38283;&#30330;&#12364;&#36914;&#12417;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#38283;&#30330;&#12420;&#12486;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12427;&#26041;&#12434;&#21215;&#38598;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;

&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;: http://www.scanley.org/

&#27231;&#33021;:
   - &#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12289;HTML &#12362;&#12424;&#12403; XML &#12398;&#26908;&#32034;
   - &#21336;&#35486;&#12354;&#12427;&#12356;&#12399;&#12501;&#12524;&#12540;&#12474;&#12395;&#12424;&#12427;&#26908;&#32034;
   - (&#20104;&#23450;) &#12354;&#12356;&#12414;&#12356;&#26908;&#32034;
   - (&#20104;&#23450;) &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#24046;&#20998;&#26356;&#26032;
   - (&#20104;&#23450;) &#12522;&#12514;&#12540;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#21270;

Requirements:
   - Python 2.2 &#20197;&#38477;
   - &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20316;&#25104;&#29992;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;
     (&#20803;&#12398;&#12487;&#12540;&#12479;&#12398;&#32004;&#65298;&#20493;&#12398;&#22823;&#12365;&#12373;)

&#35443;&#32048;&#12394;&#24773;&#22577;&#12399;&#12289;scanley.org &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;

&#12381;&#12428;&#12391;&#12399;&#12290;
-J. Random
</pre><p>
  (&#20844;&#38283;&#12398;&#12362;&#30693;&#12425;&#12379;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#38306;&#12377;&#12427;&#12362;&#30693;&#12425;&#12379;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span>
  &#12398; <a class="xref" href="publicity.html" title="&#23459;&#20253;&#12539;&#24195;&#22577;">&#12300;&#23459;&#20253;&#12539;&#24195;&#22577;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
</p><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20844;&#38283;&#12434;&#38283;&#22987;&#12377;&#12427;&#26178;&#26399;&#12395;&#12388;&#12356;&#12390;&#12289;
  &#12354;&#12427;&#31243;&#24230;&#21205;&#12367;&#12418;&#12398;&#12364;&#12391;&#12365;&#12354;&#12364;&#12387;&#12383;&#26178;&#28857;&#12391;&#20844;&#38283;&#12377;&#12409;&#12365;&#12394;&#12398;&#12363;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#35373;&#35336;&#27573;&#38542;&#12363;&#12425;&#20844;&#38283;&#12375;&#12390;&#12375;&#12414;&#12358;&#12409;&#12365;&#12394;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12399;&#12289;
  &#12414;&#12384;&#32080;&#35542;&#12364;&#20986;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#31169;&#12399;&#12289;
  &#12371;&#12428;&#12414;&#12391;&#12399;&#12300;&#23455;&#38555;&#12395;&#21205;&#12367;&#12467;&#12540;&#12489;&#12364;&#12354;&#12427;&#12371;&#12392;&#12301;&#12364;&#26368;&#12418;&#37325;&#35201;&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12428;&#12371;&#12381;&#12364;&#25104;&#21151;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#21336;&#12394;&#12427;&#12362;&#12418;&#12385;&#12419;&#12392;&#12434;&#21306;&#21029;&#12377;&#12427;&#12418;&#12398;&#12384;&#12392;&#24605;&#12387;&#12383;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#20855;&#20307;&#30340;&#12395;&#21205;&#12367;&#12418;&#12398;&#12364;&#12394;&#12356;&#12392;&#20182;&#12398;&#38283;&#30330;&#32773;&#12434;&#12402;&#12365;&#12388;&#12369;&#12425;&#12428;&#12394;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#26368;&#36817;&#12289;&#12371;&#12398;&#32771;&#12360;&#12364;&#22793;&#12431;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12395;&#12354;&#12387;&#12383;&#12398;&#12399;&#12289;
  &#35373;&#35336;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12392;&#20309;&#20154;&#12363;&#12398;&#27671;&#24515;&#12398;&#30693;&#12428;&#12383;&#38283;&#30330;&#32773;&#12289;
  &#12381;&#12375;&#12390;&#22823;&#12370;&#12373;&#12394;&#12501;&#12449;&#12531;&#12501;&#12449;&#12540;&#12524;&#12384;&#12369;&#12391;&#12375;&#12383;&#12290;&#23455;&#38555;&#12395;&#21205;&#12367;&#12467;&#12540;&#12489;&#12399;
  <span class="emphasis"><em>&#19968;&#20999;</em></span> &#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#39514;&#12356;&#12383;&#12371;&#12392;&#12395;&#12289;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#38283;&#22987;&#24403;&#21021;&#12363;&#12425;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#21442;&#21152;&#32773;&#12434;&#29554;&#24471;&#12377;&#12427;&#12371;&#12392;&#12395;&#25104;&#21151;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12375;&#12390;&#23455;&#38555;&#12395;&#21205;&#12367;&#12418;&#12398;&#12364;&#12391;&#12365;&#12399;&#12376;&#12417;&#12383;&#12371;&#12429;&#12395;&#12399;&#12289;&#12363;&#12394;&#12426;&#22810;&#12367;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#38283;&#30330;&#32773;&#12364;
  &#12467;&#12540;&#12489;&#12398;&#20869;&#37096;&#12414;&#12391;&#28145;&#12367;&#30693;&#12426;&#23613;&#12367;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#29366;&#24907;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  Subversion &#12384;&#12369;&#12364;&#20363;&#22806;&#30340;&#12394;&#23384;&#22312;&#12384;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  Mozilla &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#23455;&#38555;&#12395;&#21205;&#12367;&#12418;&#12398;&#12364;&#12394;&#12356;&#29366;&#24907;&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12375;&#12390;&#20170;&#12420;&#20154;&#27671;&#12398;&#12354;&#12427;&#12454;&#12455;&#12502;&#12502;&#12521;&#12454;&#12470;&#12392;&#12375;&#12390;&#22823;&#25104;&#21151;&#12434;&#21454;&#12417;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12398;&#20107;&#20363;&#12434;&#21069;&#12395;&#12375;&#12390;&#12289;&#31169;&#12399;&#12300;&#23455;&#38555;&#12395;&#21205;&#12367;&#12467;&#12540;&#12489;&#12371;&#12381;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#12395;&#24517;&#35201;&#12384;&#12301;
  &#12392;&#12356;&#12358;&#20027;&#24373;&#12434;&#26354;&#12370;&#12374;&#12427;&#12434;&#24471;&#12394;&#12367;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#21205;&#12367;&#12467;&#12540;&#12489;&#12364;&#12354;&#12427;&#12371;&#12392;&#12399;&#25104;&#21151;&#12398;&#12402;&#12392;&#12388;&#12398;&#35201;&#32032;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#32076;&#39443;&#19978;&#12399;&#12289;
  &#21205;&#12367;&#12418;&#12398;&#12364;&#12391;&#12365;&#12354;&#12364;&#12427;&#12414;&#12391;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20844;&#38283;&#12434;&#25511;&#12360;&#12383;&#12411;&#12358;&#12364;&#12424;&#12356;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12392;&#12426;&#12354;&#12360;&#12378;&#20808;&#12395;&#20844;&#38283;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26368;&#20302;&#38480;&#12289;&#12375;&#12387;&#12363;&#12426;&#12375;&#12383;&#35373;&#35336;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12363;&#20309;&#12425;&#12363;&#12398;&#12467;&#12540;&#12489;&#22522;&#30436;&#12399;&#24517;&#35201;&#12391;&#12377;
  &#8212;&#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12428;&#12399;&#20844;&#38283;&#24460;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12434;&#21463;&#12369;&#12390;&#25913;&#29256;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#20309;&#12363;&#20855;&#20307;&#30340;&#12394;&#12418;&#12398;&#12289;
  &#23455;&#38555;&#12395;&#35302;&#12387;&#12390;&#35430;&#12379;&#12427;&#12418;&#12398;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20844;&#38283;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#22823;&#37327;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12364;
  &#12377;&#12368;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#12364;&#12427;&#12392;&#12399;&#24605;&#12431;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#26222;&#36890;&#12399;&#12289;&#20844;&#38283;&#12375;&#12383;&#24460;&#12398;&#21453;&#24540;&#12392;&#12356;&#12360;&#12400;&#12418;&#12387;&#12392;&#12362;&#12392;&#12394;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#20309;&#20154;&#12363;&#12399;&#12383;&#12356;&#12375;&#12383;&#12371;&#12392;&#12398;&#12394;&#12356;&#21839;&#12356;&#21512;&#12431;&#12379;&#12434;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20309;&#20154;&#12363;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22823;&#21322;&#12398;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20844;&#38283;&#12373;&#12428;&#12383;&#12371;&#12392;&#12394;&#12435;&#12390;&#27671;&#12395;&#12418;&#12375;&#12390;&#12356;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#26178;&#38291;&#12364;&#12383;&#12388;&#12395;&#12388;&#12428;&#12390;&#12289;&#38283;&#30330;&#32773;&#12392;&#12375;&#12390;&#21442;&#21152;&#12375;&#12390;&#12367;&#12428;&#12427;&#20154;&#12420;
  &#23455;&#38555;&#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#21033;&#29992;&#12375;&#12390;&#12367;&#12428;&#12427;&#20154;&#12364;&#24464;&#12293;&#12395;&#22679;&#12360;&#12390;&#12356;&#12367;&#12371;&#12392;&#12395;&#27671;&#12389;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20844;&#38283;&#12398;&#30330;&#34920;&#12399;&#12289;&#31278;&#12414;&#12365;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12491;&#12517;&#12540;&#12473;&#12364;&#24195;&#12414;&#12427;&#12395;&#12399;&#12289;&#38263;&#12356;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#20154;&#12383;&#12385;&#12364;&#20309;&#12425;&#12363;&#12398;&#21033;&#30410;&#12434;&#24471;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12392;&#12289;
  &#12491;&#12517;&#12540;&#12473;&#12364;&#12424;&#12426;&#24195;&#12414;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#33258;&#20998;&#12364;&#35211;&#12388;&#12369;&#12383;&#12377;&#12400;&#12425;&#12375;&#12356;&#12418;&#12398;&#12434;&#12289;
  &#21608;&#12426;&#12395;&#12418;&#30693;&#12425;&#12379;&#12390;&#12354;&#12370;&#12424;&#12358;&#12392;&#12356;&#12358;&#27671;&#25345;&#12385;&#12364;&#20685;&#12367;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12364;&#12358;&#12414;&#12367;&#12356;&#12369;&#12400;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#25351;&#25968;&#38306;&#25968;&#30340;&#12395;&#22823;&#12365;&#12367;&#12394;&#12426;&#12289;
  &#35079;&#38609;&#12394;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#25104;&#38263;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12371;&#12414;&#12391;&#26469;&#12428;&#12400;&#12289;&#12418;&#12399;&#12420;&#20491;&#12293;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#21517;&#21069;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#24517;&#35201;&#12418;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12513;&#12531;&#12496;&#12540;&#38291;&#12398;&#20250;&#35441;&#12398;&#20869;&#23481;&#12434;&#12377;&#12409;&#12390;&#36861;&#12356;&#12363;&#12369;&#12427;&#12371;&#12392;&#12418;&#19981;&#21487;&#33021;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#27425;&#12398;&#31456;&#12391;&#12399;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#29872;&#22659;&#12434;&#36939;&#21942;&#12377;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="setting-tone.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="technical-infrastructure.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</td></tr></table></div></body></html>
