<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="long-term-developers.html" title="&#38283;&#30330;&#32773;&#12434;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#38599;&#29992;&#12377;&#12427;"><link rel="next" href="open-motives.html" title="&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="long-term-developers.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="open-motives.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="appear-as-many"></a>&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;</h2></div></div></div><p>
    &#12354;&#12394;&#12383;&#12364;&#38599;&#12387;&#12383;&#38283;&#30330;&#32773;&#12395;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20844;&#12398;&#12501;&#12457;&#12540;&#12521;&#12512;&#12391;&#19968;&#26522;&#23721;&#12398;&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12387;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12399;&#20225;&#26989;&#12364;&#38306;&#12431;&#12427;&#12371;&#12392;&#12391;&#12388;&#12356;&#12390;&#12414;&#12431;&#12427;&#21542;&#23450;&#30340;&#12394;&#24847;&#21619;&#21512;&#12356;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;(&#12414;&#12353;&#22810;&#20998;&#12354;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12381;&#12428;&#12399;&#12371;&#12398;&#26412;&#12391;&#12399;&#35302;&#12428;&#12414;&#12379;&#12435;)&#12290;
    &#12416;&#12375;&#12429;&#20491;&#20154;&#12371;&#12381;&#12364;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#27083;&#36896;&#30340;&#12395;&#25201;&#12360;&#12427;&#21807;&#19968;&#12398;&#23384;&#22312;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#20491;&#20154;&#12398;&#36002;&#29486;&#32773;&#12399;&#12289;&#35696;&#35542;&#12395;&#21442;&#21152;&#12375;&#12383;&#12426;&#12289;&#12497;&#12483;&#12481;&#12434;&#25552;&#20986;&#12375;&#12383;&#12426;&#12289;&#20449;&#38972;&#12434;&#24471;&#12383;&#12426;&#12289;
    &#25237;&#31080;&#12377;&#12427;&#12394;&#12393;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#20225;&#26989;&#12395;&#12399;&#12381;&#12428;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12381;&#12428;&#20197;&#19978;&#12395;&#12289;&#20998;&#25955;&#12375;&#12383;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;&#12371;&#12392;&#12391;&#12289;
    &#21453;&#24863;&#12364;&#19968;&#12534;&#25152;&#12395;&#38598;&#20013;&#12377;&#12427;&#12398;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#38599;&#12387;&#12383;&#38283;&#30330;&#32773;&#12395;&#12399;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12362;&#20114;&#12356;&#12364;&#21453;&#30446;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12425;&#12395;&#12362;&#20114;&#12356;&#12398;&#12467;&#12540;&#12489;&#12434;&#38971;&#32321;&#12395;&#12289;&#20844;&#12398;&#22580;&#12391;&#12289;&#36196;&#12398;&#20182;&#20154;&#12392;&#12375;&#12390;&#12524;&#12499;&#12517;&#12540;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12375;&#12390;&#12289;&#12356;&#12388;&#12418;&#24466;&#20826;&#12434;&#32068;&#12435;&#12391;&#25237;&#31080;&#12373;&#12379;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12394;&#12380;&#12394;&#12425;&#12381;&#12358;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    &#20182;&#12398;&#20154;&#12364;&#12300;&#12371;&#12356;&#12388;&#12425;&#12399;&#24466;&#20826;&#12434;&#32068;&#12435;&#12391;&#12356;&#12427;&#12301;&#12392;&#24863;&#12376;&#12414;&#12377;&#12375;&#12289;&#36947;&#24499;&#30340;&#12394;&#35211;&#22320;&#12363;&#12425;&#12289;
    &#24444;&#12425;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#32154;&#12369;&#12427;&#12383;&#12417;&#12395;&#32068;&#32340;&#30340;&#12394;&#21162;&#21147;&#12364;&#12394;&#12373;&#12428;&#12427;&#12409;&#12365;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#23455;&#38555;&#12395;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;&#12371;&#12392;&#12392;&#12289;&#12381;&#12358;&#12375;&#12424;&#12358;&#12392;&#21336;&#12395;&#21162;&#21147;&#12377;&#12427;&#12371;&#12392;&#12399;&#36949;&#12356;&#12414;&#12377;&#12290;
    &#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#38599;&#12387;&#12383;&#38283;&#30330;&#32773;&#36948;&#12395;&#19968;&#33268;&#12375;&#12383;&#34892;&#21205;&#12434;&#12392;&#12425;&#12379;&#12383;&#26041;&#12364;&#20415;&#21033;&#12394;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#24517;&#35201;&#12394;&#12392;&#12365;&#12399;&#35023;&#12391;&#21332;&#21147;&#12377;&#12427;&#28310;&#20633;&#12434;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#25552;&#26696;&#12434;&#12377;&#12427;&#12392;&#12365;&#12289;&#21512;&#24847;&#12364;&#24418;&#25104;&#12373;&#12428;&#12388;&#12388;&#12354;&#12427;&#12371;&#12392;&#12434;&#21360;&#35937;&#20184;&#12369;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#20309;&#20154;&#12363;&#12395;&#26089;&#12356;&#27573;&#38542;&#12363;&#12425;&#21516;&#24847;&#12398;&#24847;&#24535;&#12434;&#31034;&#12375;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#20182;&#12398;&#20154;&#12399;&#12289;&#12381;&#12398;&#25552;&#26696;&#12395;&#21218;&#12356;&#12364;&#12354;&#12427;&#12392;&#24863;&#12376;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;&#20206;&#12395;&#21453;&#23550;&#12377;&#12428;&#12400;&#12289;
    &#12381;&#12398;&#21218;&#12356;&#12434;&#21066;&#12356;&#12391;&#12375;&#12414;&#12358;&#12392;&#12418;&#24605;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#29702;&#30001;&#12364;&#12354;&#12427;&#22580;&#21512;&#12384;&#12369;&#12289;&#20154;&#12293;&#12399;&#21453;&#23550;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#21453;&#23550;&#24847;&#35211;&#12434;&#30495;&#25711;&#12395;&#21463;&#12369;&#27490;&#12417;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289;&#36059;&#25104;&#24847;&#35211;&#12434;&#32068;&#32340;&#21270;&#12377;&#12427;&#12371;&#12392;&#12399;&#38291;&#36949;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#36059;&#25104;&#24847;&#35211;&#12434;&#20844;&#12398;&#22580;&#12391;&#26126;&#12425;&#12363;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#12383;&#12392;&#12360;&#12381;&#12428;&#12364;&#20107;&#21069;&#12395;&#21332;&#21147;&#12375;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#30495;&#25711;&#12391;&#12354;&#12427;&#28857;&#12399;&#22793;&#12431;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#21453;&#23550;&#24847;&#35211;&#12434;&#23553;&#27578;&#12377;&#12427;&#12398;&#12395;&#20351;&#12431;&#12428;&#12394;&#12356;&#38480;&#12426;&#12289;&#23475;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#24444;&#12425;&#12398;&#30446;&#30340;&#12399;&#12289;&#21336;&#12395;&#20307;&#35009;&#12434;&#20445;&#12388;&#12383;&#12417;&#12384;&#12369;&#12395;&#21453;&#23550;&#12375;&#12383;&#12364;&#12427;&#39006;&#12398;&#20154;&#12434;&#25233;&#12360;&#12427;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12358;&#12356;&#12358;&#20154;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span> &#12398;
    <a class="xref" href="common-pitfalls.html#bikeshed" title="&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;">&#12300;&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="long-term-developers.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="open-motives.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#38283;&#30330;&#32773;&#12434;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#38599;&#29992;&#12377;&#12427; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;</td></tr></table></div></body></html>
