<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="bug-trackers.html" title="&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;"><link rel="next" href="bug-reporting.html" title="&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-trackers.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bug-reporting.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="appendix" title="&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;"><div class="titlepage"><div><div><h2 class="title"><a name="bikeshed-full"></a>&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>
  &#21029;&#12395;&#12381;&#12435;&#12394;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12384;&#12387;&#12390;&#12289;&#12381;&#12435;&#12394;&#12398;&#12393;&#12358;&#12391;&#12418;&#12356;&#12356;&#12371;&#12392;&#12376;&#12419;&#12394;&#12356;&#12391;&#12377;&#12363;&#12290;
  &#12381;&#12428;&#12395;&#12289;&#12418;&#12387;&#12392;&#12510;&#12471;&#12394;&#26178;&#38291;&#12398;&#20351;&#12356;&#26041;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#65311;
</p><p>
  Poul-Henning Kamp &#12395;&#12424;&#12427;&#12289;&#12363;&#12398;&#26377;&#21517;&#12394; "bikeshed" &#12513;&#12540;&#12523;
  (&#12381;&#12398;&#19968;&#37096;&#12434; <a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12391;&#21462;&#12426;&#19978;&#12370;&#12414;&#12375;&#12383;)
  &#12399;&#12289;&#38598;&#22243;&#12391;&#12398;&#35696;&#35542;&#12364;&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;&#12395;&#12388;&#12356;&#12390;&#38750;&#24120;&#12395;&#12358;&#12414;&#12367;&#35500;&#26126;&#12375;&#12383;&#35542;&#32771;&#12391;&#12377;&#12290;
  &#24444;&#12398;&#25215;&#35582;&#12434;&#24471;&#12390;&#12289;&#12371;&#12371;&#12395;&#12381;&#12428;&#12434;&#25522;&#36617;&#12375;&#12414;&#12377;&#12290;&#21407;&#25991;&#12398; URL &#12399;
  <a class="ulink" href="http://www.freebsd.org/cgi/getmsg.cgi?fetch=506636+517178+/usr/local/www/db/text/1999/freebsd-hackers/19991003.freebsd-hackers" target="_top">http://www.freebsd.org/cgi/getmsg.cgi?fetch=506636+517178+/usr/local/www/db/text/1999/freebsd-hackers/19991003.freebsd-hackers</a>
  &#12391;&#12377;&#12290;&#12522;&#12531;&#12463;&#12375;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12289;<a class="ulink" href="http://bikeshed.com" target="_top">bikeshed.com</a> &#12434;&#31034;&#12375;&#12390;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
Subject: A bike shed (any colour will do) on greener grass...
From: Poul-Henning Kamp &lt;phk@freebsd.org&gt;
Date: Sat, 02 Oct 1999 16:14:10 +0200
Message-ID: &lt;18238.938873650@critter.freebsd.dk&gt;
Sender: phk@critter.freebsd.dk
Bcc: Blind Distribution List: ;
MIME-Version: 1.0



[committers &#12392; hackers &#12395;&#12418; bcc &#12375;&#12390;&#12362;&#12356;&#12383;]


&#12371;&#12398;&#21069;&#36865;&#12387;&#12383;&#12497;&#12531;&#12501;&#12524;&#12483;&#12488;&#12399;&#12424;&#12367;&#21463;&#12369;&#21462;&#12387;&#12390;&#12418;&#12425;&#12360;&#12383;&#12375;&#12289;&#12414;&#12383;&#21029;&#12398;&#12434;&#36865;&#12387;&#12390;&#12418;
&#12356;&#12356;&#12363;&#12394;&#12387;&#12390;&#24605;&#12387;&#12390;&#12383;&#12290;&#12391;&#12289;&#20170;&#26085;&#12399;&#12381;&#12398;&#26178;&#38291;&#12392;&#27671;&#21147;&#12364;&#12354;&#12387;&#12383;&#12435;&#12391;&#12290;


&#12371;&#12398;&#25163;&#12398;&#35441;&#38988;&#12434;&#12393;&#12371;&#12395;&#36865;&#12428;&#12400;&#12356;&#12356;&#12398;&#12363;&#12385;&#12423;&#12387;&#12392;&#36855;&#12387;&#12383;&#12369;&#12428;&#12393;&#12289;&#32080;&#23616;
committers &#12392; hackers &#12395;&#12418; bcc &#12377;&#12427;&#12371;&#12392;&#12395;&#12375;&#12383;&#12290;&#12383;&#12406;&#12435;&#12371;&#12428;&#12391;&#12424;&#12363;&#12387;&#12383;&#12435;
&#12384;&#12429;&#12358;&#12290;&#23455;&#12399;&#31169;&#12399; hackers &#12434;&#36092;&#35501;&#12375;&#12390;&#12356;&#12394;&#12356;&#12435;&#12384;&#12364;&#12289;&#12381;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#12414;&#12383;&#24460;
&#12391;&#35500;&#26126;&#12377;&#12427;&#12290;


&#12371;&#12398;&#12513;&#12540;&#12523;&#12398;&#30330;&#31471;&#12392;&#12394;&#12387;&#12383;&#12398;&#12399;&#12300;sleep(1) &#12391;&#23567;&#25968;&#28857;&#20197;&#19979;&#12398;&#31186;&#12434;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;
&#12377;&#12409;&#12365;&#12301;&#12392;&#12356;&#12358;&#12473;&#12524;&#12483;&#12489;&#12384;&#12290;&#12371;&#12356;&#12388;&#12399;&#26368;&#36817;&#31169;&#12383;&#12385;&#12398;&#29983;&#27963;&#12434;&#33029;&#12363;&#12375;&#32154;&#12369;&#12390;&#12365;&#12383;&#12290;
&#12362;&#12381;&#12425;&#12367;&#25968;&#36913;&#38291;&#12411;&#12393;&#12290;&#38754;&#20498;&#12394;&#12398;&#12391;&#12365;&#12385;&#12435;&#12392;&#35519;&#12409;&#12390;&#12394;&#12356;&#12369;&#12393;&#12397;&#12290;


&#12300;&#12381;&#12435;&#12394;&#12473;&#12524;&#12483;&#12489;&#12354;&#12387;&#12383;&#12363;&#12394;&#12353;&#12301;&#12392;&#24605;&#12387;&#12383;&#12415;&#12394;&#12373;&#12435;&#12289;&#12354;&#12394;&#12383;&#12383;&#12385;&#12399;&#24184;&#12379;&#12418;&#12398;&#12384;&#12290;


&#28814;&#19978;&#12398;&#12365;&#12387;&#12363;&#12369;&#12392;&#12394;&#12387;&#12383;&#12398;&#12399;&#12300;sleep(1) &#12395;&#38750;&#25972;&#25968;&#12398;&#24341;&#25968;&#12434;&#28193;&#12375;&#12383;&#12392;&#12365;&#12395;&#12418;&#27491;
&#12375;&#12367;&#21205;&#20316;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12424;&#12358;&#12301;&#12392;&#12356;&#12358;&#25552;&#26696;&#12384;&#12387;&#12383;&#12290;&#12371;&#12371;&#12391;&#12399;&#12381;&#12428;&#20197;&#19978;&#12398;&#12371;&#12392;&#12399;&#35328;
&#12431;&#12394;&#12356;&#12290;&#12411;&#12435;&#12398;&#20123;&#32048;&#12394;&#25552;&#26696;&#12398;&#12383;&#12417;&#12395;&#12354;&#12398;&#12473;&#12524;&#12483;&#12489;&#12391;&#25955;&#12293;&#39442;&#12364;&#12428;&#32154;&#12369;&#12390;&#12383;&#12363;&#12425;&#12289;
&#12418;&#12358;&#12415;&#12435;&#12394;&#21313;&#20998;&#12395;&#30693;&#12426;&#12377;&#12366;&#12390;&#12356;&#12427;&#12371;&#12392;&#12384;&#12429;&#12358;&#12290;&#12381;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#12411;&#12435;&#12392;&#12358;&#12395;&#37325;&#35201;
&#12394;&#12300;&#21839;&#38988;&#12301;&#12383;&#12385;&#12364;&#12363;&#12377;&#12435;&#12391;&#12375;&#12414;&#12387;&#12390;&#12427;&#12424;&#12290;


&#12371;&#12398; sleep(1) &#12398;&#35441;&#12399;&#12289;FreeBSD &#12364;&#22987;&#12414;&#12387;&#12390;&#20197;&#26469;&#26368;&#12418;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#12300;&#33258;&#36578;&#36554;&#32622;&#22580;
&#12398;&#35696;&#35542;&#12301;&#12398;&#20363;&#12392;&#12356;&#12360;&#12427;&#12384;&#12429;&#12358;&#12290;&#12354;&#12398;&#25552;&#26696;&#12399;&#12392;&#12390;&#12418;&#12424;&#12367;&#32771;&#12360;&#12425;&#12428;&#12383;&#12418;&#12398;&#12384;&#12387;&#12383;
&#12375;&#12289;OpenBSD &#12420; NetBSD &#12392;&#12398;&#20114;&#25563;&#24615;&#12434;&#21521;&#19978;&#12373;&#12379;&#12427;&#12418;&#12398;&#12391;&#12418;&#12354;&#12387;&#12383;&#12290;&#12381;&#12375;&#12390;&#12289;&#12371;
&#12428;&#12414;&#12391;&#12395;&#26360;&#12363;&#12428;&#12390;&#12365;&#12383;&#12467;&#12540;&#12489;&#12392;&#12398;&#20114;&#25563;&#24615;&#12418;&#12414;&#12387;&#12383;&#12367;&#25613;&#12394;&#12431;&#12394;&#12356;&#12418;&#12398;&#12384;&#12387;&#12383;&#12435;&#12384;&#12290;


&#12394;&#12398;&#12395;&#12289;&#21453;&#35542;&#12420;&#21029;&#12398;&#25552;&#26696;&#12420;&#20462;&#27491;&#26696;&#12394;&#12393;&#12364;&#32154;&#20986;&#12375;&#12383;&#12290;&#12414;&#12427;&#12391;&#22900;&#12425;&#12399;&#12289;&#12371;&#12398;&#25552;&#26696;&#12364;
&#12300;&#12473;&#12452;&#12473;&#12481;&#12540;&#12474;&#12398;&#31348;&#12434;&#20840;&#37096;&#22475;&#12417;&#12390;&#12375;&#12414;&#12358;&#12301;&#12384;&#12392;&#12363;&#12300;&#12467;&#12459;&#12467;&#12540;&#12521;&#12398;&#21619;&#12434;&#22793;&#12360;&#12390;&#12375;
&#12414;&#12358;&#12301;&#12394;&#12393;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12377;&#12372;&#12367;&#37325;&#22823;&#12394;&#35441;&#12384;&#12392;&#24605;&#12356;&#36796;&#12435;&#12391;&#12356;&#12427;&#12424;&#12358;&#12384;&#12387;&#12383;&#12290;


&#12300;&#12392;&#12371;&#12429;&#12391;&#12289;&#12356;&#12387;&#12383;&#12356;&#33258;&#36578;&#36554;&#32622;&#22580;&#12387;&#12390;&#12393;&#12358;&#12356;&#12358;&#12371;&#12392;&#65311;&#12301;&#12392;&#24605;&#12387;&#12383;&#20154;&#12418;&#12356;&#12427;&#12371;&#12392;
&#12384;&#12429;&#12358;&#12290;


&#35441;&#12379;&#12400;&#38263;&#12367;&#12394;&#12427;&#26132;&#35441;&#12384;&#12369;&#12393;&#12289;&#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12399;&#21336;&#32020;&#12394;&#35441;&#12384;&#12290;C&#12539;&#12494;&#12540;&#12473;&#12467;&#12540;&#12488;&#12539;
&#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12364; 1960 &#24180;&#20195;&#21021;&#26399;&#12395;&#26360;&#12356;&#12383;&#12300;&#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12398;&#27861;&#21063;&#12301;&#12392;&#12356;&#12358;&#26412;&#12364;&#12354;&#12387;
&#12390;&#12289;&#12381;&#12371;&#12395;&#12399;&#12418;&#12398;&#12372;&#12392;&#12398;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#12373;&#12414;&#12374;&#12414;&#12394;&#27934;&#23519;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12383;&#12435;&#12384;&#12290;


&#20170;&#12391;&#12418;&#12450;&#12510;&#12478;&#12531;&#12391;&#36023;&#12360;&#12427;&#12375;&#12289;&#21531;&#12383;&#12385;&#12398;&#29238;&#35242;&#12398;&#26412;&#26842;&#12395;&#12418;&#20837;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12290;
&#12371;&#12398;&#26412;&#12399;&#12289;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#36092;&#20837;&#12375;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#35501;&#12416;&#12384;&#12369;&#12398;&#20385;&#20516;&#12364;&#12354;&#12427;&#12418;&#12398;&#12384;&#12290;&#12487;&#12451;
&#12523;&#12496;&#12540;&#12488;&#12364;&#22909;&#12365;&#12394;&#20154;&#12394;&#12425;&#12289;&#12365;&#12387;&#12392;&#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12418;&#27671;&#12395;&#20837;&#12427;&#12371;&#12392;&#12384;&#12429;&#12358;&#12290;


&#12363;&#12388;&#12390;&#12371;&#12398;&#26412;&#12434;&#35501;&#12435;&#12384;&#35504;&#12363;&#12364;&#12300;&#29694;&#20195;&#12376;&#12419;&#12371;&#12398;&#26412;&#12395;&#26360;&#12363;&#12428;&#12390;&#12427;&#12371;&#12392;&#12398; 50% &#12367;&#12425;
&#12356;&#12375;&#12363;&#12354;&#12390;&#12399;&#12414;&#12425;&#12394;&#12356;&#12397;&#12301;&#12392;&#35328;&#12387;&#12390;&#12383;&#12290;&#19978;&#31561;&#12376;&#12419;&#12394;&#12356;&#12363;&#12290;&#12356;&#12414;&#12393;&#12365;&#12398;&#26412;&#12394;&#12435;&#12363;&#12289;
&#12418;&#12387;&#12392;&#24808;&#12417;&#12394;&#12418;&#12435;&#12384;&#12290;&#12375;&#12363;&#12418;&#12371;&#12398;&#26412;&#12289;35&#24180;&#20197;&#19978;&#21069;&#12398;&#12418;&#12398;&#12394;&#12435;&#12384;&#12380;&#65311;


&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#20363;&#12395;&#12391;&#12390;&#12367;&#12427;&#12418;&#12358;&#19968;&#26041;&#12398;&#24441;&#32773;&#12364;&#12289;&#21407;&#23376;&#28809;&#12384;&#12290;&#12394;&#12435;&#12384;&#12363;&#12289;&#12356;&#12363;&#12395;&#12418;
&#26178;&#20195;&#12434;&#24863;&#12376;&#12373;&#12379;&#12427;&#12394;&#12353;&#12290;


&#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12399;&#12289;&#22996;&#21729;&#20250;&#12395;&#20055;&#12426;&#36796;&#12435;&#12391;&#25968;&#30334;&#19975;&#12363;&#12425;&#25968;&#20740;&#12489;&#12523;&#12418;&#12398;&#21407;&#23376;&#28809;&#24314;&#35373;&#35336;&#30011;
&#12434;&#25215;&#35469;&#12373;&#12379;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12390;&#12356;&#12427;&#12290;&#12375;&#12363;&#12375;&#12289;&#21407;&#23376;&#28809;&#12391;&#12399;&#12394;&#12367;&#33258;&#36578;&#36554;&#32622;&#22580;&#12434;&#20316;&#12426;
&#12383;&#12356;&#12392;&#24605;&#12387;&#12383;&#12425;&#32066;&#12431;&#12426;&#12398;&#12394;&#12356;&#35696;&#35542;&#12395;&#24059;&#12365;&#36796;&#12414;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12384;&#12429;&#12358;&#12392;&#12418;&#35328;&#12387;&#12390;
&#12356;&#12427;&#12290;


&#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12395;&#12424;&#12427;&#12392;&#12289;&#21407;&#23376;&#28809;&#12399;&#12354;&#12414;&#12426;&#12395;&#24040;&#22823;&#12391;&#39640;&#20385;&#12381;&#12375;&#12390;&#35079;&#38609;&#12391;&#12354;&#12427;&#12383;&#12417;&#12395;
&#12415;&#12435;&#12394;&#12364;&#12381;&#12398;&#20869;&#23481;&#12434;&#25226;&#25569;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12290;&#32771;&#12360;&#12424;&#12358;&#12392;&#12418;&#12379;&#12378;&#12395;&#24605;&#32771;
&#20572;&#27490;&#12375;&#12390;&#12375;&#12414;&#12356;&#12289;&#12300;&#12414;&#12353;&#12371;&#12371;&#12414;&#12391;&#26469;&#12427;&#21069;&#12395;&#35504;&#12363;&#20182;&#12398;&#20154;&#12364;&#19968;&#37096;&#22987;&#32066;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;
&#12383;&#12384;&#12429;&#12358;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12290;&#12522;&#12481;&#12515;&#12540;&#12488;&#12539;P&#12539;&#12501;&#12449;&#12452;&#12531;&#12510;&#12531;&#12398;&#33879;&#26360;&#12395;
&#12399;&#12289;&#12371;&#12428;&#12395;&#38306;&#36899;&#12377;&#12427;&#12525;&#12473;&#12539;&#12450;&#12521;&#12514;&#12473;&#12391;&#12398;&#33288;&#21619;&#28145;&#12356;&#20107;&#20363;&#12364;&#12356;&#12367;&#12388;&#12363;&#32057;&#20171;&#12373;&#12428;&#12390;&#12356;
&#12427;&#12290;


&#12373;&#12353;&#19968;&#26041;&#33258;&#36578;&#36554;&#32622;&#22580;&#12384;&#12290;&#36913;&#26411;&#12434;&#12388;&#12406;&#12379;&#12400;&#12384;&#12428;&#12391;&#12418;&#20316;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#20313;&#12387;&#12383;&#26178;&#38291;
&#12395;&#12486;&#12524;&#12499;&#12391;&#35430;&#21512;&#12434;&#35211;&#12390;&#27005;&#12375;&#12416;&#12371;&#12392;&#12373;&#12360;&#12391;&#12365;&#12427;&#12384;&#12429;&#12358;&#12290;&#12393;&#12435;&#12394;&#12395;&#29992;&#24847;&#21608;&#21040;&#12391;&#12354;&#12387;
&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12393;&#12435;&#12394;&#12395;&#22949;&#24403;&#12394;&#25552;&#26696;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12384;&#12428;&#12363;&#12364;&#27231;&#20250;&#12434;&#12392;&#12425;&#12360;&#12390;&#12399;&#12289;
&#33258;&#20998;&#12418;&#12394;&#12395;&#12363;&#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12383;&#12426;&#12289;&#33258;&#20998;&#12418;&#12381;&#12428;&#12395;&#27880;&#30446;&#12375;&#12390;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;
&#12383;&#12426;&#12289;&#12300;&#20474;&#12434;&#24536;&#12428;&#12427;&#12394;&#12301;&#12392;&#35328;&#12387;&#12383;&#12426;&#12377;&#12427;&#12384;&#12429;&#12358;&#12290;


&#12487;&#12531;&#12510;&#12540;&#12463;&#12391;&#12399;&#12289;&#12371;&#12358;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#12300;&#25351;&#32011;&#12434;&#12388;&#12369;&#12427;&#12301;&#12387;&#12390;&#35328;&#12358;&#12435;&#12384;&#12290;&#20491;&#20154;&#30340;&#12394;
&#12503;&#12521;&#12452;&#12489;&#12420;&#35211;&#26628;&#12398;&#12383;&#12417;&#12395;&#20309;&#12363;&#12434;&#12375;&#12390;&#12289;&#12354;&#12392;&#12363;&#12425;&#12381;&#12398;&#35388;&#25312;&#12434;&#35211;&#12379;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;
&#12427;&#12290;&#12300;&#12411;&#12425;&#35211;&#12429;&#12424;&#12290;&#12371;&#12428;&#12289;&#20474;&#12364;&#12420;&#12387;&#12383;&#12435;&#12384;&#12301;&#12390;&#12394;&#20855;&#21512;&#12395;&#12397;&#12290;&#25919;&#27835;&#23478;&#12393;&#12418;&#12398;&#12424;&#12367;
&#12420;&#12426;&#12381;&#12358;&#12394;&#12371;&#12392;&#12391;&#12418;&#12354;&#12427;&#12364;&#12289;&#19968;&#33324;&#20154;&#12384;&#12387;&#12390;&#27231;&#20250;&#12364;&#12354;&#12428;&#12400;&#12420;&#12426;&#12381;&#12358;&#12384;&#12424;&#12290;&#12411;&#12425;&#12289;
&#12424;&#12367;&#29983;&#20094;&#12365;&#12398;&#12475;&#12513;&#12531;&#12488;&#12395;&#36275;&#36321;&#12364;&#12388;&#12356;&#12390;&#12383;&#12426;&#12377;&#12427;&#12384;&#12429;&#12358;&#65311;


&#26368;&#21021;&#12395;&#12371;&#12398;&#25552;&#26696;&#12434;&#12375;&#12383;&#20154;&#12395;&#12399;&#25964;&#24847;&#12434;&#34920;&#12375;&#12383;&#12356;&#12290;&#12384;&#12387;&#12390;&#12289;&#12367;&#12384;&#12425;&#12396;&#25209;&#35413;&#23478;&#12383;&#12385;&#12398;
&#22952;&#23475;&#34892;&#28858;&#12395;&#12418;&#12417;&#12370;&#12378;&#33258;&#20998;&#12398;&#20449;&#24565;&#12434;&#36011;&#12365;&#36890;&#12375;&#12390;&#12289;&#12381;&#12398;&#22793;&#26356;&#12364;&#12356;&#12414;&#12420;&#12484;&#12522;&#12540;&#12395;&#21462;&#12426;
&#36796;&#12414;&#12428;&#12390;&#12427;&#12431;&#12369;&#12384;&#12363;&#12425;&#12290;&#31169;&#12394;&#12425;&#12354;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#19968;&#25569;&#12426;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12377;&#12425;&#21463;&#12369;&#21462;
&#12427;&#21069;&#12395;&#35558;&#12417;&#12390;&#36867;&#12370;&#12390;&#12383;&#12384;&#12429;&#12358;&#12397;&#12290;


&#12373;&#12353;&#12289;&#12381;&#12375;&#12390;&#12373;&#12387;&#12365;&#35328;&#12387;&#12390;&#12383;&#35441;&#12290;&#12394;&#12380;&#31169;&#12364; -hackers &#12434;&#36092;&#35501;&#12375;&#12390;&#12356;&#12394;&#12356;&#12398;&#12363;&#12290;


&#31169;&#12364;&#25968;&#24180;&#21069;&#12395; -hackers &#12398;&#36092;&#35501;&#12434;&#12420;&#12417;&#12383;&#29702;&#30001;&#12399;&#12289;&#22823;&#37327;&#12398;&#12513;&#12540;&#12523;&#12434;&#12373;&#12400;&#12365;&#12365;&#12428;&#12394;
&#12367;&#12394;&#12387;&#12383;&#12363;&#12425;&#12384;&#12290;&#12354;&#12428;&#20197;&#26469;&#12289;&#21516;&#12376;&#29702;&#30001;&#12391;&#20182;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12418;&#12356;&#12367;&#12388;&#12363;&#36092;&#35501;
&#12434;&#12420;&#12417;&#12390;&#12356;&#12427;&#12290;


&#12381;&#12428;&#12391;&#12418;&#12414;&#12384;&#22823;&#37327;&#12398;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12387;&#12390;&#12356;&#12427;&#12290;&#12414;&#12353;&#22810;&#12367;&#12398;&#12513;&#12540;&#12523;&#12399;&#12501;&#12451;&#12523;&#12479;&#12522;
&#12531;&#12464;&#12375;&#12390; /dev/null &#34892;&#12365;&#12395;&#12375;&#12390;&#12427;&#12369;&#12393;&#12394;&#12290;(&#20491;&#20154;&#21517;&#30465;&#30053;) &#12415;&#12383;&#12356;&#12394;&#37326;&#37070;&#12363;&#12425;&#12398;
&#12513;&#12540;&#12523;&#12399;&#31169;&#12398;&#30011;&#38754;&#19978;&#12395;&#12399;&#27770;&#12375;&#12390;&#12354;&#12425;&#12431;&#12428;&#12394;&#12356;&#12290;&#22806;&#22269;&#35486;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12408;&#12398;&#12467;&#12511;&#12483;
&#12488;&#12392;&#12363; ports &#12408;&#12398;&#12467;&#12511;&#12483;&#12488;&#12392;&#12363;&#12398;&#36890;&#30693;&#12513;&#12540;&#12523;&#12418;&#21516;&#12376;&#12384;&#12290;&#12381;&#12358;&#12356;&#12387;&#12383;&#12513;&#12540;&#12523;&#12399;&#12289;
&#31169;&#12398;&#30446;&#12395;&#35302;&#12428;&#12427;&#12371;&#12392;&#12394;&#12367;&#12393;&#12371;&#12363;&#12395;&#34892;&#12387;&#12390;&#12375;&#12414;&#12358;&#12387;&#12390;&#12431;&#12369;&#12384;&#12290;


&#12391;&#12418;&#12289;&#12371;&#12428;&#12384;&#12369;&#24517;&#27515;&#12395;&#12394;&#12387;&#12390;&#21463;&#20449;&#31665;&#12434;&#23432;&#12429;&#12358;&#12392;&#12375;&#12390;&#12427;&#12387;&#12390;&#12398;&#12395;&#12289;&#12356;&#12414;&#12391;&#12418;&#22823;&#37327;
&#12395;&#12513;&#12540;&#12523;&#12364;&#23626;&#12356;&#12390;&#12356;&#12427;&#12290;


&#12394;&#12395;&#12363;&#12356;&#12356;&#26696;&#12399;&#12394;&#12356;&#12384;&#12429;&#12358;&#12363;&#65311;


&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12363;&#12425;&#20313;&#35336;&#12394;&#12494;&#12452;&#12474;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#28187;&#12425;&#12375;&#12383;&#12356;&#12435;&#12384;&#12290;&#33258;&#36578;&#36554;&#32622;&#22580;
&#12434;&#20316;&#12426;&#12383;&#12356;&#20154;&#12399;&#27671;&#20860;&#12397;&#12379;&#12378;&#12395;&#20316;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12354;&#12370;&#12383;&#12356;&#12435;&#12384;&#12290;&#33258;&#36578;&#36554;&#32622;&#22580;&#12434;&#20309;
&#33394;&#12395;&#22615;&#12427;&#12363;&#12394;&#12435;&#12390;&#12356;&#12385;&#12356;&#12385;&#27671;&#12395;&#12375;&#12394;&#12367;&#12390;&#12418;&#12356;&#12356;&#12376;&#12419;&#12394;&#12356;&#12363;&#12290;


&#26368;&#21021;&#12398;&#20214;&#12399;&#12289;&#12513;&#12540;&#12523;&#12434;&#20351;&#12358;&#12392;&#12365;&#12395;&#12415;&#12435;&#12394;&#12418;&#12387;&#12392;&#31036;&#20736;&#12434;&#32771;&#12360;&#12424;&#12358;&#12387;&#12390;&#12371;&#12392;&#12384;&#12290;&#12418;
&#12358;&#23569;&#12375;&#27671;&#12434;&#20351;&#12362;&#12358;&#12376;&#12419;&#12394;&#12356;&#12363;&#12290;&#12418;&#12358;&#23569;&#12375;&#38957;&#12434;&#20351;&#12362;&#12358;&#12376;&#12419;&#12394;&#12356;&#12363;&#12290;


&#12513;&#12540;&#12523;&#12395;&#36820;&#20449;&#12377;&#12409;&#12365;&#12392;&#12365;/&#12377;&#12409;&#12365;&#12391;&#12394;&#12356;&#12392;&#12365;&#12434;&#12289;&#12415;&#12435;&#12394;&#12364;&#32013;&#24471;&#12377;&#12427;&#24418;&#12391;&#31777;&#28500;&#12363;
&#12388;&#27491;&#30906;&#12395;&#23450;&#32681;&#12391;&#12365;&#12383;&#12425;&#12393;&#12435;&#12394;&#12395;&#24184;&#12379;&#12394;&#12371;&#12392;&#12384;&#12429;&#12358;&#12290;&#12391;&#12418;&#31169;&#12399;&#12289;&#12391;&#12365;&#12418;&#12375;&#12394;&#12356;&#12371;
&#12392;&#12434;&#35430;&#12415;&#12427;&#12411;&#12393;&#12398;&#12496;&#12459;&#12376;&#12419;&#12394;&#12356;&#12290;


&#12391;&#12418;&#12289;&#12371;&#12435;&#12394;&#27231;&#33021;&#12364;&#12354;&#12387;&#12383;&#12425;&#12356;&#12356;&#12394;&#12353;&#12392;&#24605;&#12387;&#12390;&#12427;&#12290;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;
&#12395;&#36820;&#20449;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12364;&#33258;&#21205;&#30340;&#12395;&#12371;&#12435;&#12394;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#12454;&#12451;&#12531;&#12489;
&#12454;&#12434;&#34920;&#31034;&#12377;&#12427;&#12435;&#12384;&#12290;&#12393;&#12358;&#12384;&#12429;&#12358;&#65311;


      +------------------------------------------------------------+
      | &#20170;&#12354;&#12394;&#12383;&#12364;&#36865;&#12429;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12513;&#12540;&#12523;&#12399;&#20309;10&#19975;&#20154;&#12418;&#12398;&#20154;&#12395;&#23626;&#12365;&#12414;&#12377;.|
      | &#21463;&#12369;&#21462;&#12387;&#12383;&#20154;&#12364;&#12381;&#12428;&#12434;&#35501;&#12416;&#12409;&#12365;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#12398;&#12395;&#23569;&#12394;&#12367;&#12392; |
      | &#12418;10&#31186;&#12399;&#12363;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12388;&#12414;&#12426;&#12289;&#12354;&#12394;&#12383;&#12398;&#12513;&#12540;&#12523;&#12434;&#35501;&#12416;&#12383;&#12417;&#12395; |
      | &#23569;&#12394;&#12367;&#12392;&#12418;0.5&#20154;&#26376;&#12364;&#36027;&#12420;&#12373;&#12428;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;&#12373;&#12425;&#12395;&#12289;&#22810;&#12367;&#12398;&#20154;&#12399;  |
      | &#12513;&#12540;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12398;&#12395;&#12362;&#37329;&#12434;&#25173;&#12431;&#12394;&#12356;&#12392;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;   |
      |                                                            |
      | &#12354;&#12394;&#12383;&#12398;&#12513;&#12540;&#12523;&#12399;&#12289;&#12411;&#12435;&#12392;&#12358;&#12395;&#12415;&#12435;&#12394;&#12364;&#12381;&#12428;&#12384;&#12369;&#12398;&#25163;&#38291;&#12434;&#12363;&#12369;&#12390; |
      | &#12391;&#12418;&#35501;&#12416;&#20385;&#20516;&#12398;&#12354;&#12427;&#12418;&#12398;&#12391;&#12377;&#12363;&#65311;                             |
      |                                                            |
      |              [&#12399;&#12356;]  [&#26360;&#12365;&#30452;&#12377;]  [&#12461;&#12515;&#12531;&#12475;&#12523;]              |
      +------------------------------------------------------------+


      +------------------------------------------------------------+
      | &#35686;&#21578;&#65306;&#12354;&#12394;&#12383;&#12399;&#12414;&#12384;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#12513;&#12540;&#12523;&#12434;&#20840;&#37096;&#35501;&#12415;&#32066;&#12360;&#12390;&#12356;&#12414; |
      | &#12379;&#12435;&#12290;&#20170;&#12354;&#12394;&#12383;&#12364;&#26360;&#12356;&#12390;&#12356;&#12427;&#20869;&#23481;&#12434;&#12289;&#20182;&#12398;&#35504;&#12363;&#12364;&#26082;&#12395;&#35328;&#12387;&#12390;&#12356;&#12427; |
      | &#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12378;&#12473;&#12524;&#12483;&#12489;&#12434;&#20840;&#37096;&#35501;&#12435;&#12391;&#12363;&#12425;&#36820;&#20449;&#12434;&#26360;&#12367;&#12424;&#12358; |
      | &#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;                                             |
      |                                                            |
      |                    [&#12461;&#12515;&#12531;&#12475;&#12523;]                            |
      +------------------------------------------------------------+


      +------------------------------------------------------------+
      | &#35686;&#21578;&#65306;&#12414;&#12384;&#12371;&#12398;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#19978;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#20840;&#20307;&#12434;&#34920;&#31034;&#12375;&#32066;&#12360;&#12390; |
      | &#12356;&#12414;&#12379;&#12435;&#12290;&#35542;&#29702;&#30340;&#12395;&#32771;&#12360;&#12390;&#12289;&#12354;&#12394;&#12383;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20869;&#23481;&#12434;&#12377;&#12409;&#12390; |
      | &#35501;&#12435;&#12391;&#29702;&#35299;&#12377;&#12427;&#12398;&#12399;&#19981;&#21487;&#33021;&#12394;&#12399;&#12378;&#12391;&#12377;&#12290;                       |
      |                                                            |
      | &#12513;&#12540;&#12523;&#12434;&#20840;&#37096;&#35501;&#12435;&#12391;&#12385;&#12419;&#12435;&#12392;&#32771;&#12360;&#12390;&#12363;&#12425;&#36820;&#20449;&#12375;&#12394;&#12356;&#12392;&#30456;&#25163;&#12395;&#22833;&#31036; |
      | &#12391;&#12377;&#12290;                                                     |
      |                                                            |
      | &#12354;&#12394;&#12383;&#12395;&#38957;&#12434;&#20919;&#12420;&#12375;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12398;&#12479;&#12452;&#12510;&#12540;&#12364;&#30330;&#21205;&#12375;&#12414;&#12375;&#12383;&#12290;&#20170; |
      | &#24460;&#65297;&#26178;&#38291;&#12289;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#12356;&#12363;&#12394;&#12427;&#12513;&#12540;&#12523;&#12395;&#12418;&#36820;&#20449;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;.|
      |                                                            |
      |                     [&#12461;&#12515;&#12531;&#12475;&#12523;]                           |
      +------------------------------------------------------------+


      +------------------------------------------------------------+
      | &#12354;&#12394;&#12383;&#12399;&#12371;&#12398;&#12513;&#12540;&#12523;&#12434;&#31186;&#36895; N.NN &#25991;&#23383;&#20197;&#19978;&#12398;&#36895;&#12373;&#12391;&#26360;&#12365;&#32066;&#12360;&#12414;&#12375; |
      | &#12383;&#12290;&#19968;&#33324;&#12395;&#12289;&#12365;&#12385;&#12435;&#12392;&#32771;&#12360;&#12390;&#26360;&#12356;&#12390;&#12356;&#12383;&#12394;&#12425;&#31186;&#36895; A.AA &#25991;&#23383;&#12434;&#12371; |
      | &#12360;&#12427;&#12371;&#12392;&#12399;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;&#12362;&#12381;&#12425;&#12367;&#12289;&#12354;&#12394;&#12383;&#12364;&#20170;&#26360;&#12356;&#12383;&#36820;&#20449;&#12399;&#25903;&#38626; |
      | &#28357;&#35010;&#12391;&#24847;&#21619;&#19981;&#26126;&#12363;&#12388;&#24863;&#24773;&#30340;&#12394;&#12418;&#12398;&#12384;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;             |
      |                                                            |
      | &#12354;&#12394;&#12383;&#12395;&#38957;&#12434;&#20919;&#12420;&#12375;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12398;&#12479;&#12452;&#12510;&#12540;&#12364;&#30330;&#21205;&#12375;&#12414;&#12375;&#12383;&#12290;&#20170; |
      | &#24460;&#65297;&#26178;&#38291;&#12289;&#19968;&#20999;&#12513;&#12540;&#12523;&#12399;&#36865;&#20449;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;                     |
      |                                                            |
      |                     [&#12461;&#12515;&#12531;&#12475;&#12523;]                           |
      +------------------------------------------------------------+


&#31169;&#12398;&#39000;&#12356;&#12398;&#65298;&#30058;&#30446;&#12399;&#12418;&#12387;&#12392;&#24863;&#24773;&#30340;&#12394;&#12418;&#12398;&#12384;&#12290;sleep(1) &#12473;&#12524;&#12483;&#12489;&#12391;&#25973;&#23550;&#30340;&#12394;&#25209;&#21028;
&#12434;&#12375;&#12383;&#21476;&#21442;&#12383;&#12385;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#21152;&#27508;&#12364;&#38263;&#12356;&#12392;&#12356;&#12358;&#12398;&#12395;&#12289;&#12371;&#12398;&#12385;&#12423;&#12387;&#12392;
&#12375;&#12383;&#12371;&#12392;&#12434;&#12420;&#12429;&#12358;&#12392;&#12394;&#12435;&#12390;&#24605;&#12431;&#12394;&#12363;&#12387;&#12383;&#12290;&#26126;&#12425;&#12363;&#12395;&#12397;&#12290;&#12381;&#12428;&#12394;&#12398;&#12395;&#12289;&#33258;&#20998;&#12424;&#12426;
&#12363;&#12394;&#12426;&#19979;&#12398;&#24460;&#36649;&#12364;&#12381;&#12428;&#12434;&#12420;&#12429;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#12394;&#12380;&#12356;&#12365;&#12394;&#12426;&#24444;&#12425;&#12399;&#12377;&#12372;&#12356;&#21218;&#12356;&#12391;&#29123;
&#12360;&#19978;&#12364;&#12427;&#12435;&#12384;&#12429;&#12358;&#12363;&#65311;


&#12431;&#12363;&#12387;&#12390;&#12356;&#12428;&#12400;&#12394;&#12353;&#12290;


&#12431;&#12363;&#12387;&#12390;&#12427;&#12392;&#12418;&#12290;&#12356;&#12367;&#12425;&#12371;&#12435;&#12394;&#20998;&#26512;&#12434;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;&#12354;&#12435;&#12394;&#12300;&#21453;&#21205;&#20445;&#23432;&#20027;&#32681;&#32773;&#12301;
&#12393;&#12418;&#12398;&#25233;&#27490;&#21147;&#12395;&#12399;&#12394;&#12425;&#12394;&#12356;&#12387;&#12390;&#12371;&#12392;&#12367;&#12425;&#12356;&#12290;&#12383;&#12406;&#12435;&#22900;&#12425;&#12399;&#12289;&#26368;&#36817;&#33258;&#20998;&#12364;&#20309;&#12418;&#36002;
&#29486;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#12356;&#12425;&#12388;&#12356;&#12390;&#12356;&#12427;&#12435;&#12384;&#12429;&#12358;&#12290;&#12354;&#12427;&#12356;&#12399;&#12300;&#12431;&#12375;&#12425;&#24180;&#38263;&#32773;&#12371;&#12381;
&#12364;&#12289;&#33509;&#36896;&#12383;&#12385;&#12434;&#27491;&#12375;&#12367;&#23566;&#12356;&#12390;&#12420;&#12425;&#12397;&#12400;&#12394;&#12425;&#12396;&#12301;&#12394;&#12393;&#12392;&#20553;&#12406;&#12387;&#12390;&#12427;&#12435;&#12384;&#12429;&#12358;&#12290;


&#12393;&#12387;&#12385;&#12395;&#12379;&#12424;&#12381;&#12428;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12414;&#12387;&#12383;&#12367;&#38750;&#29983;&#29987;&#30340;&#12394;&#12371;&#12392;&#12391;&#12354;&#12427;&#12431;&#12369;
&#12384;&#12364;&#12289;&#31169;&#12395;&#12399;&#12381;&#12428;&#12434;&#12420;&#12417;&#12373;&#12379;&#12427;&#26041;&#27861;&#12364;&#12431;&#12363;&#12425;&#12394;&#12356;&#12290;&#12392;&#12426;&#12354;&#12360;&#12378;&#35328;&#12360;&#12427;&#12371;&#12392;&#12399;&#12289;
&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#28508;&#12416;&#12514;&#12531;&#12473;&#12479;&#12540;&#12393;&#12418;&#12395;&#39180;&#12434;&#19982;&#12360;&#12427;&#12398;&#12399;&#12420;&#12417;&#12429;&#12387;&#12390;&#12371;&#12392;&#12384;&#12290;
&#12392;&#12395;&#12363;&#12367;&#28961;&#35222;&#12377;&#12427;&#12290;&#27770;&#12375;&#12390;&#36820;&#20449;&#12375;&#12394;&#12356;&#12290;&#22900;&#12425;&#12364;&#12381;&#12371;&#12395;&#12356;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12427;&#12435;&#12384;&#12290;


&#31169;&#12399;&#12289;FreeBSD &#12408;&#12398;&#36002;&#29486;&#32773;&#12364;&#12418;&#12387;&#12392;&#22679;&#12360;&#12390;&#12418;&#12387;&#12392;&#21147;&#24375;&#12367;&#12394;&#12427;&#12371;&#12392;&#12434;&#39000;&#12387;&#12390;&#12356;&#12427;&#12290;
&#12381;&#12375;&#12390;&#12289;&#24444;&#12425;&#12434;&#27671;&#38627;&#12375;&#12356;&#29242;&#12373;&#12435;&#12393;&#12418;&#12420; (&#20491;&#20154;&#21517;&#30465;&#30053;) &#12415;&#12383;&#12356;&#12394;&#22900;&#12425;&#12363;&#12425;&#23432;&#12427;&#12435;
&#12384;&#12290;&#12354;&#12356;&#12388;&#12425;&#12364;&#12371;&#12398;&#19990;&#30028;&#12395;&#36275;&#12434;&#36367;&#12415;&#20837;&#12428;&#12390;&#24444;&#12425;&#12434;&#33029;&#12363;&#12375;&#12289;&#36861;&#12356;&#20986;&#12375;&#12390;&#12375;&#12414;&#12358;&#12424;
&#12358;&#12394;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12290;


&#12460;&#12540;&#12468;&#12452;&#12523;&#12393;&#12418;&#12395;&#12362;&#12403;&#12360;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#21152;&#12434;&#36490;&#36487;&#12375;&#12390;&#12356;&#12427;&#30342;&#12373;&#12435;&#12408;&#12290;&#12383;
&#12384;&#12383;&#12384;&#12372;&#12417;&#12435;&#12394;&#12373;&#12356;&#12392;&#12375;&#12363;&#35328;&#12356;&#12424;&#12358;&#12364;&#12394;&#12356;&#12290;&#20309;&#12392;&#12363;&#20210;&#38291;&#12395;&#21152;&#12431;&#12387;&#12390;&#27442;&#12375;&#12356;&#12290;&#20170;
&#12398;&#29366;&#27841;&#12399;&#12289;&#27770;&#12375;&#12390;&#31169;&#12398;&#26395;&#12435;&#12384;&#29366;&#27841;&#12391;&#12399;&#12394;&#12356;&#12435;&#12384;&#12290;

Poul-Henning
</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-trackers.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bug-reporting.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;</td></tr></table></div></body></html>
