<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="bikeshed-full.html" title="&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;"><link rel="next" href="producingoss.ja.afterwords.html" title="&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bikeshed-full.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="producingoss.ja.afterwords.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="appendix" title="&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;"><div class="titlepage"><div><div><h2 class="title"><a name="bug-reporting"></a>&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>
    &#20197;&#19979;&#12395;&#31034;&#12377;&#12398;&#12399;&#12289;Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26032;&#12375;&#12356;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12395;&#20316;&#12387;&#12383;&#12289;
    &#12496;&#12464;&#22577;&#21578;&#12395;&#38306;&#12377;&#12427;&#35500;&#26126;&#26360;&#12434;&#12385;&#12423;&#12387;&#12392;&#32232;&#38598;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#35500;&#26126;&#26360;&#12364;&#12394;&#12380;&#37325;&#35201;&#12394;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    <span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398; </span>
    <a class="xref" href="managing-volunteers.html#users-to-volunteers" title="&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;">&#12300;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#25991;&#26360;&#12399;&#12289;
    <a class="ulink" href="http://svn.collab.net/repos/svn/trunk/www/bugs.html" target="_top">http://svn.collab.net/repos/svn/trunk/www/bugs.html</a>
    &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><pre class="screen">



                    Subversion &#12395;&#38306;&#12377;&#12427;&#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;

&#12371;&#12398;&#25991;&#26360;&#12399;&#12289;&#12393;&#12371;&#12395;&#12289;&#12393;&#12358;&#12420;&#12387;&#12390;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12428;&#12400;&#12356;&#12356;&#12363;&#12434;&#35500;&#26126;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;(&#26410;&#35299;&#27770;&#12398;&#12496;&#12464;&#12434;&#12377;&#12409;&#12390;&#19968;&#35239;
&#12395;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435; &#12540; &#12381;&#12398;&#12363;&#12431;&#12426;&#12289;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#26041;&#27861;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;)



&#12393;&#12371;&#12395;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12409;&#12365;&#12363;
------------------------

    * &#12496;&#12464;&#12364; Subversion &#12381;&#12398;&#12418;&#12398;&#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12394;&#12425;&#12289;users@subversion.tigris.org &#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12387;&#12390;&#12367;
      &#12384;&#12373;&#12356;&#12290;&#12381;&#12428;&#12364;&#12496;&#12464;&#12384;&#12392;&#30906;&#35469;&#12375;&#12383;&#12425;&#12289;&#35504;&#12363;&#12364; (&#12383;&#12406;&#12435;&#12354;&#12394;&#12383;&#12364;) &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
      (&#12496;&#12464;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#20449;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#31169;&#36948;&#12398;&#38283;&#30330;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488; dev@subversion.tiglis.org
      &#12395;&#30452;&#25509;&#12513;&#12540;&#12523;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12375;&#12363;&#12375;&#12289;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#33258;&#20449;&#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;users@subversion.tigris.org
      &#12395;&#12399;&#12376;&#12417;&#12395;&#12513;&#12540;&#12523;&#12375;&#12383;&#26041;&#12364;&#12424;&#12356;&#12391;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12371;&#12395;&#12356;&#12427;&#35504;&#12363;&#12364;&#12289;&#12354;&#12394;&#12383;&#12364;&#36973;&#36935;&#12375;&#12383; subversion &#12398;
      &#25369;&#21205;&#12364;&#27491;&#12375;&#12356;&#12363;&#12381;&#12358;&#12391;&#12394;&#12356;&#12363;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;)

    * &#12496;&#12464;&#12364; APR &#12521;&#12452;&#12502;&#12521;&#12522;&#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12394;&#12425;&#12289;&#20197;&#19979;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#20001;&#26041;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;:
      dev@apr.apache.org, dev@subversion.tigris.org

    * &#12496;&#12464;&#12364; Neon HTTP&#12521;&#12452;&#12502;&#12521;&#12522;&#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12394;&#12425;&#12289;&#20197;&#19979;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;:
      neon@webdav.org, dev@subversion.tigris.org

    * &#12496;&#12464;&#12364; Apache HTTPD 2.0 &#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12363;&#12425;&#12289;&#20197;&#19979;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#20001;&#26041;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;:
      dev@httpd.apache.org, dev@subversion.tigris.org
      Apache httpd &#21521;&#12369;&#12398;&#38283;&#30330;&#32773;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#38750;&#24120;&#12395;&#12383;&#12367;&#12373;&#12435;&#12398;&#12513;&#12540;&#12523;&#12364;&#27969;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12354;
      &#12394;&#12383;&#12398;&#12496;&#12464;&#22577;&#21578;&#12398;&#12513;&#12540;&#12523;&#12399;&#35211;&#33853;&#12392;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#12496;&#12464;&#22577;&#21578;&#12434; 
      http://httpd.apache.org/bug_report.html &#12395;&#25237;&#31295;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;

    * &#12496;&#12464;&#12364;&#25975;&#29289;(rug)&#12398;&#19979;&#12395;&#12354;&#12387;&#12383;&#12425;&#12289;&#25265;&#12365;&#12375;&#12417;&#12390;(hug)&#12354;&#12370;&#12390;&#12289;&#24555;&#36969;&#12394;&#12418;&#12398;(snug)&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;



&#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;
----------------

&#12414;&#12378;&#12289;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;Subversion &#12364;&#12354;&#12394;&#12383;&#12398;&#24605;&#12387;&#12383;&#12424;&#12358;&#12395;&#21205;&#12363;&#12394;&#12356;&#12394;&#12425;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;
&#12392;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#35519;&#12409;&#12390;&#12289;subversion &#12364;&#12354;&#12394;&#12383;&#12398;&#24605;&#12387;&#12383;&#12424;&#12358;&#12395;&#21205;&#12367;&#12399;&#12378;&#12289;&#12392;&#12356;&#12358;&#35388;&#25312;&#12434;&#25506;
&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#21247;&#35542;&#12289;subversion &#12364;&#12354;&#12394;&#12383;&#12398;&#12487;&#12540;&#12479;&#12434;&#22730;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12392;&#12363;&#12289;&#12514;&#12491;&#12479;&#12540;&#12363;&#12425;&#29017;&#12364;&#20986;&#12390;&#12365;&#12383;&#12289;&#12394;
&#12393;&#24120;&#35672;&#12398;&#31684;&#22258;&#12391;&#12354;&#12428;&#12400;&#12289;&#12354;&#12394;&#12383;&#12398;&#21028;&#26029;&#12434;&#20449;&#12376;&#12390;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;&#33258;&#20449;&#12364;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;&#12414;&#12378;&#12399;&#12518;&#12540;&#12470;
&#12540;&#21521;&#12369;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12289;users@subversion.tigris.org &#12363;&#12289;irc.freenode.net &#12398; IRC &#12481;&#12515;&#12531;&#12493;&#12523; #svn
&#12391;&#32862;&#12356;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;

&#12356;&#12387;&#12383;&#12435;&#12381;&#12428;&#12364;&#12496;&#12464;&#12384;&#12392;&#12431;&#12363;&#12387;&#12383;&#12425;&#12289;&#12418;&#12387;&#12392;&#12418;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12496;&#12464;&#12395;&#38306;&#12377;&#12427;&#31777;&#21336;&#12394;&#35500;&#26126;&#12392;&#20877;&#29694;&#26041;&#27861;&#12434;&#32771;&#12360;&#12427;&#12371;&#12392;
&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#20206;&#12395;&#12496;&#12464;&#12391;&#12354;&#12428;&#12400;&#12289;&#12399;&#12376;&#12417;&#12395;&#35211;&#12388;&#12369;&#12383;&#12392;&#12365;&#12395;&#12399;5&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;10&#22238;&#20197;&#19978;&#12398;&#12467;&#12511;&#12483;&#12488;
&#12434;&#12375;&#12390;&#12356;&#12383;&#22580;&#21512;&#12289;1&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;1&#22238;&#12384;&#12369;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#29694;&#35937;&#12434;&#20877;&#29694;&#12373;&#12379;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#20877;&#29694;&#25163;&#38918;&#12364;&#31777;&#21336;&#12394;&#12418;
&#12398;&#12391;&#12354;&#12428;&#12400;&#12354;&#12427;&#12411;&#12393;&#12289;&#38283;&#30330;&#32773;&#12364;&#12496;&#12464;&#12434;&#20877;&#29694;&#12375;&#12289;&#20462;&#27491;&#12377;&#12427;&#30906;&#29575;&#12364;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;

<span class="emphasis"><em>&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12398;&#31777;&#26131;&#12481;&#12455;&#12483;&#12463;: Subversion &#12398;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12414;&#12377;&#12363;? &#12507;&#12531;&#12488;&#12395;? :-) &#12381;
&#12398;&#12496;&#12464;&#12399;&#26082;&#12395;&#20462;&#27491;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12424;&#12290;&#26368;&#26032;&#12398; Subversion &#38283;&#30330;&#12484;&#12522;&#12540;&#12391;&#12418;&#12354;&#12394;&#12383;&#12398;&#12496;&#12464;&#12398;&#20877;&#29694;&#25163;&#38918;
&#12364;&#20877;&#29694;&#12391;&#12365;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;</em></span>

&#20877;&#29694;&#25163;&#38918;&#12395;&#21152;&#12360;&#12390;&#12289;&#12381;&#12398;&#12496;&#12464;&#12434;&#20877;&#29694;&#12373;&#12379;&#12383;&#29872;&#22659;&#12434;&#23436;&#29863;&#12395;&#35500;&#26126;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#24773;&#22577;&#12391;&#12377;:

    * &#12354;&#12394;&#12383;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;
    * Subversion &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12289;&#12363;&#12388;/&#12414;&#12383;&#12399; &#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;
    * &#12499;&#12523;&#12489;&#12395;&#20351;&#12387;&#12383;&#12467;&#12531;&#12497;&#12452;&#12521;&#12392;&#12289;&#12499;&#12523;&#12489;&#12398;&#35373;&#23450;&#12458;&#12503;&#12471;&#12519;&#12531;
    * &#12354;&#12394;&#12383;&#12364;&#29420;&#33258;&#12395;&#21152;&#12360;&#12383;&#12354;&#12425;&#12422;&#12427;&#22793;&#26356;
    * &#12418;&#12375;&#12354;&#12428;&#12400;&#12289;&#19968;&#32210;&#12395;&#20351;&#12387;&#12390;&#12356;&#12427; Barkley DB &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;
    * &#38306;&#36899;&#12364;&#12354;&#12426;&#12381;&#12358;&#12394;&#12381;&#12398;&#20182;&#20840;&#12390;&#12398;&#24773;&#22577;&#12290;&#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#12398;&#24773;&#22577;&#12434;&#21547;&#12435;&#12384;&#12456;&#12521;&#12540;&#24773;&#22577;&#12290;

&#12371;&#12398;&#24773;&#22577;&#12364;&#20840;&#12390;&#25539;&#12360;&#12400;&#12289;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12434;&#26360;&#12367;&#28310;&#20633;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;&#12393;&#12435;&#12394;&#12496;&#12464;&#12391;&#12354;&#12427;&#12363;&#12398;&#35500;&#26126;&#12434;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#26360;
&#12367;&#12371;&#12392;&#12363;&#12425;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;&#12388;&#12414;&#12426;&#12289;Subversion &#12364;&#12393;&#12358;&#21205;&#12356;&#12390;&#12411;&#12375;&#12356;&#12398;&#12363;&#12289;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#23455;&#38555;&#12399;&#12393;&#12358;&#21205;&#12356;&#12390;&#12356;
&#12427;&#12398;&#12363;&#12434;&#26360;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;&#12354;&#12394;&#12383;&#12395;&#12392;&#12387;&#12390;&#12399;&#26126;&#12425;&#12363;&#12395;&#12496;&#12464;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#20182;&#12398;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12381;&#12358;&#12391;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;
&#12379;&#12435;&#12290;&#12424;&#12387;&#12390;&#12289;&#25512;&#28204;&#12466;&#12540;&#12512;&#12395;&#12394;&#12427;&#12398;&#12434;&#36991;&#12369;&#12427;&#12398;&#12364;&#12505;&#12473;&#12488;&#12391;&#12377;&#12290;&#27425;&#12395;&#20877;&#29694;&#12375;&#12383;&#29872;&#22659;&#12395;&#38306;&#12377;&#12427;&#35500;&#26126;&#12434;&#12375;&#12390;&#12289;&#20877;&#29694;&#25163;
&#38918;&#12434;&#26360;&#12365;&#12414;&#12377;&#12290;&#12496;&#12464;&#12398;&#21407;&#22240;&#12395;&#38306;&#12377;&#12427;&#32771;&#23519;&#12420;&#12289;&#12381;&#12428;&#12434;&#20462;&#27491;&#12377;&#12427;&#12383;&#12417;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#21547;&#12417;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;&#12381;&#12428;&#12399;&#32032;&#26228;
&#12425;&#12375;&#12356;&#65281; &#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#36865;&#12426;&#26041;&#12434; http://subversion.apache.org/docs/community-guide/#patches 
&#12391;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;

&#12371;&#12428;&#12425;&#20840;&#12390;&#12398;&#24773;&#22577;&#12434; dev@subversion.tigris.org &#12395;&#25237;&#31295;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#26082;&#12395;&#12381;&#12358;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;&#12496;
&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12377;&#12427;&#12424;&#12358;&#12395;&#38972;&#12414;&#12428;&#12383;&#12398;&#12394;&#12425;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12506;&#12540;&#12472;&#12395;&#34892;&#12365;&#12289;&#12381;&#12371;&#12398;&#25351;&#31034;&#12395;&#24467;&#12387;&#12390;&#12367;
&#12384;&#12373;&#12356;&#12290;

&#12371;&#12371;&#12414;&#12391;&#35501;&#12435;&#12391;&#12367;&#12428;&#12390;&#12354;&#12426;&#12364;&#12392;&#12358;&#12290;&#20778;&#12428;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#34892;&#12358;&#12395;&#12399;&#12289;&#12383;&#12367;&#12373;&#12435;&#12398;&#21162;&#21147;&#12364;&#24517;&#35201;&#12394;&#12398;&#12399;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12375;&#12363;&#12375;&#12289;&#20778;&#12428;&#12383;&#22577;&#21578;&#12399;&#38283;&#30330;&#32773;&#12398;&#26178;&#38291;&#12434;&#22810;&#12367;&#31680;&#32004;&#12391;&#12365;&#12289;&#12496;&#12464;&#12364;&#20462;&#27491;&#12373;&#12428;&#12427;&#30906;&#29575;&#12434;&#19968;&#23652;&#39640;&#12417;&#12427;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;

</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bikeshed-full.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="producingoss.ja.afterwords.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;</td></tr></table></div></body></html>
