<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="vc-systems.html" title="&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;"><link rel="next" href="bikeshed-full.html" title="&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="vc-systems.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bikeshed-full.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="appendix" title="&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;"><div class="titlepage"><div><div><h2 class="title"><a name="bug-trackers"></a>&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12393;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#25505;&#29992;&#12375;&#12390;&#12356;&#12390;&#12418;&#12289;
    &#25991;&#21477;&#12434;&#35328;&#12358;&#38283;&#30330;&#32773;&#12399;&#24517;&#12378;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#20670;&#21521;&#12399;&#20182;&#12398;&#27161;&#28310;&#30340;&#12394;&#38283;&#30330;&#12484;&#12540;&#12523;&#12424;&#12426;&#12418;&#24375;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
    &#31169;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#20351;&#12358;&#20154;&#12398;&#30446;&#12395;&#35211;&#12360;&#12427;&#12371;&#12392;&#12392;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12392;&#38283;&#30330;&#32773;&#12364;&#12420;&#12426;&#12392;&#12426;&#12434;&#21452;&#26041;&#21521;&#12395;&#34892;&#12358;&#12484;&#12540;&#12523;&#12391;&#12354;&#12427;&#12371;&#12392;&#12363;&#12425;&#12289;
    (&#26178;&#38291;&#12364;&#12354;&#12428;&#12400;)&#25913;&#21892;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#28857;&#12364;&#24819;&#20687;&#12375;&#12420;&#12377;&#12356;&#12371;&#12392;&#12289;
    &#12381;&#12375;&#12390;&#12381;&#12428;&#12434;&#21475;&#12395;&#20986;&#12375;&#12390;&#35500;&#26126;&#12375;&#12420;&#12377;&#12356;&#12398;&#12364;&#29702;&#30001;&#12384;&#12392;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#19981;&#24179;&#19981;&#28288;&#12399;&#35441;&#21322;&#20998;&#12395;&#32862;&#12356;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358; &#8212;
    &#20197;&#19979;&#12395;&#31034;&#12377;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#22810;&#12367;&#12399;&#12392;&#12390;&#12418;&#20778;&#12428;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12377;&#12290;
</p><p>
    &#20197;&#19979;&#12398;&#19968;&#35239;&#12391;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#36861;&#36321;&#12377;&#12427;&#12418;&#12398;&#12392;&#12375;&#12390;&#12300;&#21839;&#38988;&#12301;&#12392;&#12356;&#12358;&#29992;&#35486;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;
    &#12371;&#12428;&#12395;&#23550;&#24540;&#12377;&#12427;&#12418;&#12398;&#12392;&#12375;&#12390;&#12300;&#27424;&#38501;&#12301;&#12420;&#12300;&#12496;&#12464;&#12301;&#12354;&#12427;&#12356;&#12399;&#12300;&#12481;&#12465;&#12483;&#12488;&#12301;&#12394;&#12393;&#12398;&#29420;&#33258;&#12398;&#29992;&#35486;&#12434;&#20351;&#12358;&#12371;&#12392;&#12418;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
    <span class="emphasis"><em>
        &#27880;&#24847;: &#12371;&#12398;&#35519;&#26619;&#12364;&#26368;&#21021;&#12395;&#34892;&#12431;&#12428;&#12383;&#12398;&#12399; 2005 &#24180;&#12391;&#12354;&#12426;&#12289;
        &#12381;&#12428;&#20197;&#38477;&#12395;&#12418;&#12356;&#12367;&#12388;&#12363;&#26032;&#12383;&#12395;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#20316;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
        2011 &#24180;&#24460;&#21322;&#12395;&#20197;&#19979;&#12398;&#35352;&#36848;&#12434;&#22810;&#23569;&#26356;&#26032;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#35519;&#26619;&#33258;&#20307;&#12398;&#20840;&#20307;&#30340;&#12394;&#26356;&#26032;&#12399;&#12391;&#12365;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
        <a class="ulink" href="http://en.wikipedia.org/wiki/Comparison_of_issue-tracking_systems" target="_top">Wikipedia &#12391;&#12398;&#21839;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#27604;&#36611;</a> &#12420;
        <a class="ulink" href="http://www.dmoz.org/Computers/Software/Configuration_Management/Bug_Tracking/Free/" target="_top">DMOZ &#12395;&#12424;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#35519;&#26619;</a>&#12289;
        <a class="ulink" href="http://ask.slashdot.org/story/12/07/12/1431210/ask-slashdot-how-do-you-track-bugs-for-personal-software-projects" target="_top">Ask Slashdot: How do you track bugs for personal software projects?</a> &#12398;&#35352;&#20107; (&#12392;&#12467;&#12513;&#12531;&#12488;)&#12289;
        &#12354;&#12427;&#12356;&#12399;
        <a class="ulink" href="http://www.webresourcesdepot.com/9-free-and-open-source-bug-tracking-softwares/" target="_top">WebResourcesDepot &#12395;&#12424;&#12427;&#19968;&#35239;</a>
        &#12418;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;
    </em></span>
</p><div class="sect2" title="Redmine &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-redmine"></a><span class="bold"><strong>Redmine</strong></span> &#8212; <a class="ulink" href="http://www.redmine.org/" target="_top">http://www.redmine.org/</a></h3></div></div></div><p>
    Redmine &#12399; (2011 &#24180;&#12398;&#26178;&#28857;&#12391;)&#12289;&#27604;&#36611;&#30340;&#26368;&#36817;&#12395;&#35477;&#29983;&#12375;&#12383;
    &#38750;&#24120;&#12395;&#27927;&#32244;&#12373;&#12428;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
    &#21336;&#12394;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12392;&#12393;&#12414;&#12425;&#12378;&#12289;
    Wiki &#12420;&#12487;&#12451;&#12473;&#12459;&#12483;&#12471;&#12519;&#12531;&#29992;&#12501;&#12457;&#12540;&#12521;&#12512;&#12394;&#12393;&#12398;&#27231;&#33021;&#12418;&#20633;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12392;&#12399;&#12356;&#12360;&#12289;&#12381;&#12398;&#20027;&#35201;&#12394;&#27231;&#33021;&#12399;&#12420;&#12399;&#12426;&#12496;&#12464;&#31649;&#29702;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#26997;&#12417;&#12390;&#30452;&#24863;&#30340;&#12394;&#12454;&#12455;&#12502;&#12505;&#12540;&#12473;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12289;&#26580;&#36575;&#12394;&#35373;&#23450;
    (&#35079;&#25968;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#12420;&#12525;&#12540;&#12523;&#12505;&#12540;&#12473;&#12398;&#12450;&#12463;&#12475;&#12473;&#21046;&#24481;&#12289;&#12459;&#12473;&#12479;&#12512;&#12501;&#12451;&#12540;&#12523;&#12489;&#12394;&#12393;)&#12289;
    &#12460;&#12531;&#12488;&#12481;&#12515;&#12540;&#12488;&#12289;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#35519;&#25972;&#12289;&#21452;&#26041;&#21521;&#12398;&#12513;&#12540;&#12523;&#12391;&#12398;&#12420;&#12426;&#12392;&#12426;&#12394;&#12393;&#12398;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#12392;&#12365;&#12395;&#20309;&#12363;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#24517;&#35201;&#12394;&#12425;&#12289;
    Redmine &#12434;&#36984;&#12406;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="Bugzilla &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-bugzilla"></a><span class="bold"><strong>Bugzilla</strong></span> &#8212; <a class="ulink" href="http://www.bugzilla.org/" target="_top">http://www.bugzilla.org/</a></h3></div></div></div><p>
    Bugzilla &#12399;&#12392;&#12390;&#12418;&#20154;&#27671;&#12364;&#12354;&#12426;&#12289;&#27963;&#30330;&#12395;&#38283;&#30330;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12390;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12434;&#12392;&#12390;&#12418;&#28288;&#36275;&#12373;&#12379;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12424;&#12358;&#12391;&#12377;&#12290;
    &#31169;&#12399;&#12371;&#12428;&#12434;&#25913;&#36896;&#12375;&#12383;&#12418;&#12398;&#12434;&#65300;&#24180;&#12411;&#12393;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#28288;&#36275;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    Bugzilla &#12399;&#25369;&#21205;&#12434;&#22823;&#12365;&#12367;&#22793;&#12360;&#12425;&#12428;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#22855;&#22937;&#12394;&#12371;&#12392;&#12395;&#12289;
    &#12381;&#12428;&#12364;&#12454;&#12522;&#12398;&#19968;&#12388;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;Bugzilla &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12392;&#12289;
    &#12393;&#12371;&#12395;&#34892;&#12387;&#12390;&#12418;&#25369;&#21205;&#12420;&#35211;&#12383;&#30446;&#12364;&#21516;&#12376;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#22810;&#12367;&#12398;&#38283;&#30330;&#32773;&#12364;&#12381;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12395;&#26082;&#12395;&#24931;&#12428;&#12390;&#12356;&#12390;&#12289;
    &#33258;&#20998;&#12383;&#12385;&#12364;&#35242;&#12375;&#12435;&#12384;&#19990;&#30028;&#12395;&#12356;&#12427;&#12392;&#24863;&#12376;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="GNATS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-gnats"></a><span class="bold"><strong>GNATS</strong></span> &#8212; <a class="ulink" href="http://www.gnu.org/software/gnats/" target="_top">http://www.gnu.org/software/gnats/</a></h3></div></div></div><p>
    GNU GNATS &#12399;&#12289;&#12418;&#12387;&#12392;&#12418;&#21476;&#12356;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12358;&#12385;&#12398;&#12402;&#12392;&#12388;&#12391;&#12354;&#12426;&#12289;
    &#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12418;&#12387;&#12392;&#12418;&#22823;&#12365;&#12394;&#24375;&#12415;&#12399;&#12289;
    &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12364;&#22810;&#27096;&#12394;&#12371;&#12392; (GNATS &#12399;&#12454;&#12455;&#12502;&#12502;&#12521;&#12454;&#12470;&#12363;&#12425;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#38651;&#23376;&#12513;&#12540;&#12523;&#12420;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#32076;&#30001;&#12391;&#12418;&#20351;&#12360;&#12414;&#12377;) &#12392;&#12289;
    &#21839;&#38988;&#12398;&#24773;&#22577;&#12364;&#12486;&#12461;&#12473;&#12488;&#12391;&#26684;&#32013;&#12373;&#12428;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20840;&#12390;&#12398;&#21839;&#38988;&#12364;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12391;&#12487;&#12451;&#12473;&#12463;&#12395;&#26684;&#32013;&#12373;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
    (&#32113;&#35336;&#12524;&#12509;&#12540;&#12488;&#12398;&#29983;&#25104;&#12398;&#12424;&#12358;&#12394;)
    &#12487;&#12540;&#12479;&#12434;&#36208;&#26619;&#12375;&#12383;&#12426;&#35299;&#37320;&#12377;&#12427;&#29420;&#33258;&#12398;&#12484;&#12540;&#12523;&#12434;&#26360;&#12367;&#12398;&#12364;&#31777;&#21336;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12414;&#12383;&#12289;GNATS &#12399;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#33258;&#21205;&#30340;&#12395;&#12356;&#12429;&#12356;&#12429;&#12394;&#25163;&#27573;&#12391;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
    &#38651;&#23376;&#12513;&#12540;&#12523;&#12398;&#12504;&#12483;&#12480;&#12398;&#24418;&#24335;&#12395;&#24540;&#12376;&#12390;&#12289;&#36969;&#20999;&#12394;&#21839;&#38988;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12518;&#12540;&#12470;&#12540;&#12392;&#38283;&#30330;&#32773;&#12398;&#23550;&#35441;&#12364;&#12392;&#12390;&#12418;&#23481;&#26131;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="RequestTracker (RT) &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-rt"></a><span class="bold"><strong>RequestTracker (RT)</strong></span> &#8212; <a class="ulink" href="http://www.bestpractical.com/rt/" target="_top">http://www.bestpractical.com/rt/</a></h3></div></div></div><p>
    RT &#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12399;&#12381;&#12398;&#27010;&#35201;&#12392;&#12375;&#12390;&#12300;&#20225;&#26989;&#12524;&#12505;&#12523;&#12391;&#12418;&#20351;&#12360;&#12427;&#12481;&#12465;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#20986;&#12375;&#12390;&#12367;&#12427;&#20181;&#20107;&#12420;&#21839;&#38988;&#12289;&#35201;&#26395;&#12434;&#30693;&#30340;&#12395;&#12289;&#12363;&#12388;&#21177;&#29575;&#30340;&#12395;&#31649;&#29702;&#12391;&#12365;&#12414;&#12377;&#12301;
    &#12392;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
    RT &#12399;&#26997;&#12417;&#12390;&#27927;&#32244;&#12373;&#12428;&#12383;&#12454;&#12455;&#12502;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#25345;&#12385;&#12289;&#22810;&#12367;&#12398;&#29872;&#22659;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
    &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399;&#12385;&#12423;&#12387;&#12392;&#35211;&#12383;&#30446;&#35079;&#38609;&#12391;&#12377;&#12364;&#12289;&#24931;&#12428;&#12428;&#12400;&#27671;&#12395;&#12394;&#12425;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    RT &#12399; GNU GPL &#12391;&#12521;&#12452;&#12475;&#12531;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;(&#12356;&#12367;&#12388;&#12363;&#29702;&#30001;&#12364;&#12354;&#12387;&#12390;&#12289;
    RT &#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12391;&#12399;&#12371;&#12398;&#12371;&#12392;&#12434;&#22823;&#12387;&#12404;&#12425;&#12395;&#12399;&#35328;&#12387;&#12390;&#12356;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;)
</p></div><div class="sect2" title="Trac &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-trac"></a><span class="bold"><strong>Trac</strong></span> &#8212; <a class="ulink" href="http://trac.edgewall.com/" target="_top">http://trac.edgewall.com/</a></h3></div></div></div><p>
    Trac &#12399;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#20197;&#19978;&#12398;&#24441;&#21106;&#12434;&#26524;&#12383;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    Trac &#12399;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12392; wiki &#12364;&#32113;&#21512;&#12373;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#21839;&#38988;&#12420;&#12501;&#12449;&#12452;&#12523;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12398;&#24046;&#20998;&#12289;&#12381;&#12375;&#12390; wiki &#12398;&#12506;&#12540;&#12472;&#12434;&#32080;&#12403;&#20184;&#12369;&#12394;&#12364;&#12425; wiki &#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    Trac &#12434;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12398;&#20316;&#26989;&#12399;&#31777;&#21336;&#12391;&#12289;Subversion &#12392;&#32113;&#21512;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    (<a class="xref" href="vc-systems.html" title="&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;">&#20184;&#37682;B <i>&#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</i></a> &#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
</p></div><div class="sect2" title="Roundup &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-roundup"></a><span class="bold"><strong>Roundup</strong></span> &#8212; <a class="ulink" href="http://roundup.sourceforge.net/" target="_top">http://roundup.sourceforge.net/</a></h3></div></div></div><p>
    Roundup &#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#12392;&#12390;&#12418;&#31777;&#21336;
    (&#24517;&#35201;&#12394;&#12398;&#12399;Python 2.1 &#20197;&#38477;&#12384;&#12369;&#12391;&#12377;) &#12391;&#12289;&#20351;&#12358;&#12398;&#12418;&#23481;&#26131;&#12391;&#12377;&#12290;
    &#12454;&#12455;&#12502;&#12289;&#38651;&#23376;&#12513;&#12540;&#12523;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#21839;&#38988;&#12398;&#12487;&#12540;&#12479;&#12398;&#38619;&#24418;&#12392;&#12289;&#12454;&#12455;&#12502;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399;&#22793;&#12360;&#12425;&#12428;&#12414;&#12377;&#12375;&#12289;
    (&#20445;&#30041;&#20013; &#8594; &#35386;&#26029;&#28168;&#12415; &#8594; &#20462;&#27491;&#28168;&#12415; &#8594; &#23436;&#20102; &#12398;&#12424;&#12358;&#12394;) &#21839;&#38988;&#12398;&#29366;&#24907;&#36983;&#31227;&#12418;&#22793;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="Mantis &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-mantis"></a><span class="bold"><strong>Mantis</strong></span> &#8212; <a class="ulink" href="http://www.mantisbt.org/" target="_top">http://www.mantisbt.org/</a></h3></div></div></div><p>
    Mantis &#12399;&#12289;&#12454;&#12455;&#12502;&#12505;&#12540;&#12473;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;PHP&#12391;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#12289;&#21839;&#38988;&#12434;&#26684;&#32013;&#12377;&#12427;&#22580;&#25152;&#12392;&#12375;&#12390;&#12289;MySQL &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    Mantis &#12395;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#26399;&#24453;&#12377;&#12427;&#27231;&#33021;&#12364;&#20633;&#12431;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#20491;&#20154;&#30340;&#12395;&#12399;&#12289;
    &#12454;&#12455;&#12502;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12364;&#32186;&#40599;&#12391;&#12289;&#30452;&#24863;&#30340;&#12391;&#12289;&#35211;&#12420;&#12377;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="Flyspray &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-flyspray"></a><span class="bold"><strong>Flyspray</strong></span> &#8212; <a class="ulink" href="http://www.flyspray.org/" target="_top">http://www.flyspray.org/</a></h3></div></div></div><p>
    Flyspray &#12399;&#12289;PHP &#12391;&#26360;&#12363;&#12428;&#12383;&#12454;&#12455;&#12502;&#12505;&#12540;&#12473;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
    Flyspray &#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12395;&#12399;&#12300;&#35079;&#38609;&#12391;&#12394;&#12356;&#12301;&#12392;&#35500;&#26126;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;
    &#27425;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;: &#35079;&#25968;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12471;&#12473;&#12486;&#12512;
    (&#29694;&#29366;&#12399; MySQL &#12392; PostgreSQL)&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;&#35079;&#25968;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;
    &#12479;&#12473;&#12463;&#12434;&#12300;&#35211;&#24373;&#12427;&#12301;&#27231;&#33021;&#12289;&#22793;&#26356;&#12364;&#12354;&#12428;&#12400; (Jabber &#12414;&#12383;&#12399;&#38651;&#23376;&#12513;&#12540;&#12523;&#12391;) &#36890;&#30693;&#12377;&#12427;&#27231;&#33021;&#12289;
    &#12479;&#12473;&#12463;&#12398;&#23653;&#27508;&#12434;&#21253;&#25324;&#30340;&#12395;&#35211;&#12427;&#27231;&#33021;&#12289;CSS&#12395;&#12424;&#12427;&#22806;&#35211;&#12398;&#22793;&#26356;&#27231;&#33021;&#12289;&#12501;&#12449;&#12452;&#12523;&#28155;&#20184;&#27231;&#33021;&#12289;
    &#39640;&#24230;&#12394;(&#20351;&#12356;&#12420;&#12377;&#12356;)&#26908;&#32034;&#27231;&#33021;&#12289;RSS/Atom &#12501;&#12451;&#12540;&#12489;&#37197;&#20449;&#27231;&#33021;&#12289;
    wiki &#12392;&#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12395;&#12424;&#12427;&#20837;&#21147;&#27231;&#33021;&#12289;&#25237;&#31080;&#27231;&#33021;&#12289;&#12479;&#12473;&#12463;&#12398;&#20381;&#23384;&#12464;&#12521;&#12501;&#12434;&#34920;&#31034;&#12377;&#12427;&#27231;&#33021;
</p></div><div class="sect2" title="Scarab &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-scarab"></a><span class="bold"><strong>Scarab</strong></span> &#8212; <a class="ulink" href="http://scarab.tigris.org/" target="_top">http://scarab.tigris.org/</a></h3></div></div></div><p>
    Scarab &#12399;&#22810;&#12367;&#12398;&#21205;&#20316;&#12434;&#22793;&#26356;&#12391;&#12365;&#12289;&#24517;&#35201;&#12394;&#27231;&#33021;&#12364;&#12377;&#12409;&#12390;&#25539;&#12387;&#12383;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;
    &#20182;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#27231;&#33021;&#12434;&#22810;&#12363;&#12428;&#23569;&#12394;&#12363;&#12428;&#32113;&#21512;&#12375;&#12390;&#12356;&#12414;&#12377;:
    &#12388;&#12414;&#12426;&#12289;&#12487;&#12540;&#12479;&#20837;&#21147;&#12289;&#21839;&#12356;&#21512;&#12431;&#12379;&#12289;&#12524;&#12509;&#12540;&#12488;&#12289;&#38306;&#24515;&#12364;&#12354;&#12427;&#20154;&#12293;&#12408;&#12398;&#36890;&#30693;&#12289;
    &#12467;&#12513;&#12531;&#12488;&#12398;&#21454;&#38598;&#12289;&#21839;&#38988;&#12398;&#20381;&#23384;&#12464;&#12521;&#12501;&#12434;&#34920;&#31034;&#12377;&#12427;&#27231;&#33021;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    Scarab &#12399;&#12289;&#12454;&#12455;&#12502;&#19978;&#12398;&#31649;&#29702;&#12506;&#12540;&#12472;&#12391;&#21205;&#20316;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#35079;&#25968;&#12398;&#12300;&#12514;&#12472;&#12517;&#12540;&#12523;(&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;)&#12301;&#12434;&#12402;&#12392;&#12388;&#12398; Scarab &#12391;&#31649;&#29702;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;&#12289;&#21839;&#38988;&#12398;&#31278;&#39006; (&#27424;&#38501;&#12289;&#27231;&#33021;&#36861;&#21152;&#12289;&#12479;&#12473;&#12463;&#12289;&#12469;&#12509;&#12540;&#12488;&#35201;&#26395;&#12394;&#12393;)
    &#12434;&#26032;&#12375;&#12367;&#20316;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#12381;&#12428;&#12395;&#20219;&#24847;&#12398;&#23646;&#24615;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#29305;&#23450;&#12398;&#35201;&#27714;&#12395;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#36969;&#24540;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    2004 &#24180;&#12398;&#24460;&#21322;&#12395;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#12398;&#12522;&#12522;&#12540;&#12473;&#12364;&#38291;&#36817;&#12391;&#12375;&#12383;&#12290;
</p></div><div class="sect2" title="Debian Bug Tracking System (DBTS) &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-dbts"></a><span class="bold"><strong>Debian Bug Tracking System (DBTS)</strong></span> &#8212; <a class="ulink" href="http://www.chiark.greenend.org.uk/~ian/debbugs/" target="_top">http://www.chiark.greenend.org.uk/~ian/debbugs/</a></h3></div></div></div><p>
    Debian &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512; (DBTS) &#12399;&#12289;
    &#21839;&#38988;&#12398;&#20837;&#21147;&#12392;&#31649;&#29702;&#12377;&#12409;&#12390;&#12434;&#38651;&#23376;&#12513;&#12540;&#12523;&#32076;&#30001;&#12391;&#34892;&#12358;&#12392;&#12371;&#12429;&#12364;&#29420;&#29305;&#12391;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#21839;&#38988;&#12395;&#12399;&#23554;&#29992;&#12398;&#38651;&#23376;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
    DBTS &#12399;&#22823;&#35215;&#27169;&#21270;&#12375;&#12390;&#12418;&#12392;&#12390;&#12418;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;<a class="ulink" href="http://bugs.debian.org/" target="_top">http://bugs.debian.org/</a> &#12395;&#12399; 277,741&#20214;&#12398;&#12496;&#12464;&#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;<sup>[<a name="idp3510896" href="#ftn.idp3510896" class="footnote">46</a>]</sup>&#12290;
</p><p>
    &#12420;&#12426;&#12392;&#12426;&#12399;&#26222;&#36890;&#12398;&#38651;&#23376;&#12513;&#12540;&#12523;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12395;&#39348;&#26579;&#12415;&#12364;&#12354;&#12426;&#12289;&#31777;&#21336;&#12395;&#20351;&#12360;&#12427;&#29872;&#22659;&#12391;&#34892;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    DBTS &#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#37327;&#12398;&#22577;&#21578;&#12434;&#32032;&#26089;&#12367;&#25972;&#29702;&#12375;&#12289;
    &#24540;&#31572;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#29366;&#27841;&#19979;&#12391;&#20778;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#12289;&#27424;&#28857;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#38651;&#23376;&#12513;&#12540;&#12523;&#12398;&#12467;&#12510;&#12531;&#12489;&#12471;&#12473;&#12486;&#12512;&#12434;&#23398;&#12406;&#12398;&#12395;&#26178;&#38291;&#12434;&#20351;&#12431;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12393;&#12435;&#12394;&#24773;&#22577;&#12434;&#26360;&#12367;&#12409;&#12365;&#12363;&#12434;&#36984;&#12406;&#12460;&#12452;&#12489;&#12392;&#12394;&#12427;&#12454;&#12455;&#12502;&#19978;&#12398;&#12501;&#12457;&#12540;&#12512;&#12394;&#12375;&#12391;
    &#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12434;&#26360;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    Emacs &#21521;&#12369;&#12398; <code class="systemitem">debbugs-el</code> &#12497;&#12483;&#12465;&#12540;&#12472; &#12420;&#12289;
    <span class="command"><strong>reportbug</strong></span> &#12467;&#12510;&#12531;&#12489; &#12398;&#12424;&#12358;&#12394;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12395;&#12424;&#12426;&#12424;&#12356;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12434;&#36865;&#12387;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12398;&#12484;&#12540;&#12523;&#12418;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12371;&#12428;&#12425;&#12398;&#12484;&#12540;&#12523;&#12434;&#20351;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#24444;&#12425;&#12399;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#25163;&#21205;&#12391;&#26360;&#12367;&#12384;&#12369;&#12391;&#12377;&#12375;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12496;&#12464;&#22577;&#21578;&#12395;&#38306;&#12377;&#12427;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#24467;&#12358;&#20154;&#12418;&#12356;&#12428;&#12400;&#12289;&#24467;&#12431;&#12394;&#12356;&#20154;&#12418;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    DBTS &#12399;&#21839;&#38988;&#12434;&#21442;&#29031;&#12375;&#12383;&#12426;&#12289;&#26908;&#32034;&#12377;&#12427;&#30446;&#30340;&#12391;&#12354;&#12428;&#12400;&#12289;
    &#12502;&#12521;&#12454;&#12470;&#12391;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#35501;&#12415;&#21462;&#12426;&#23554;&#29992;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="Trouble-Ticket Trackers"><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-trouble-ticket-trackers"></a><span class="bold"><strong>Trouble-Ticket Trackers</strong></span></h3></div></div></div><p>
    &#12371;&#12371;&#12395;&#25369;&#12370;&#12427;&#19968;&#36899;&#12398;&#12477;&#12501;&#12488;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12496;&#12464;&#12434;&#36861;&#36321;&#12377;&#12427;&#12371;&#12392;&#12424;&#12426;&#12399;&#12289;
    &#12504;&#12523;&#12503;&#12487;&#12473;&#12463;&#12395;&#12354;&#12364;&#12387;&#12390;&#12365;&#12383;&#22577;&#21578;&#12434;&#36861;&#36321;&#12377;&#12427;&#12371;&#12392;&#12434;&#37325;&#35222;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#26222;&#36890;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#26041;&#12364;&#22810;&#20998;&#12358;&#12414;&#12367;&#12356;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12425;&#12399;&#23436;&#20840;&#12434;&#26399;&#12377;&#12383;&#12417;&#12395;&#25369;&#12370;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12402;&#12423;&#12387;&#12392;&#12375;&#12383;&#12425;&#12289;
    &#20253;&#32113;&#30340;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12424;&#12426;&#12399;&#12371;&#12358;&#12375;&#12383;&#12471;&#12473;&#12486;&#12512;&#12398;&#26041;&#12364;&#12424;&#12367;&#21512;&#12358;&#12289;
    &#39080;&#22793;&#12431;&#12426;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>WebCall</strong></span> &#8212; <a class="ulink" href="http://myrapid.com/webcall/" target="_top">http://myrapid.com/webcall/</a></p></li></ul></div><p>
</p></div><div class="sect2" title="Bluetail Ticket Tracker (BTT) &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-bluetail"></a><span class="bold"><strong>Bluetail Ticket Tracker (BTT)</strong></span> &#8212; <a class="ulink" href="http://btt.sourceforge.net/" target="_top">http://btt.sourceforge.net/</a></h3></div></div></div><p>
    BTT &#12399;&#12289;&#12488;&#12521;&#12502;&#12523;&#12434;&#12481;&#12465;&#12483;&#12488;&#12392;&#12375;&#12390;&#31649;&#29702;&#12377;&#12427;&#12471;&#12473;&#12486;&#12512;&#12392;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#38291;&#12395;&#20301;&#32622;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    BTT &#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#12391;&#12399;&#12289;
    &#24190;&#20998;&#22793;&#12431;&#12387;&#12383;&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    BTT &#20869;&#37096;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12473;&#12479;&#12483;&#12501;&#12289;&#21451;&#36948;&#12289;&#39015;&#23458;&#12289;&#21311;&#21517;&#12518;&#12540;&#12470;&#12540;&#12395;&#20998;&#39006;&#12373;&#12428;&#12289;
    &#12487;&#12540;&#12479;&#12399;&#22810;&#12363;&#12428;&#23569;&#12394;&#12363;&#12428;&#12381;&#12398;&#20998;&#39006;&#12395;&#24540;&#12376;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#38651;&#23376;&#12513;&#12540;&#12523;&#12392;&#12398;&#32113;&#21512;&#12420;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12289;
    &#12381;&#12375;&#12390;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#12481;&#12465;&#12483;&#12488;&#12395;&#22793;&#25563;&#12377;&#12427;&#20181;&#32068;&#12415;&#12418;&#20633;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12481;&#12465;&#12483;&#12488;&#12392;&#12399;&#38306;&#20418;&#12394;&#12356;&#24773;&#22577;&#12289;&#12383;&#12392;&#12360;&#12400;&#20869;&#37096;&#25991;&#26360;&#12420; FAQ &#12434;&#31649;&#29702;&#12377;&#12427;&#20181;&#32068;&#12415;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3510896" href="#idp3510896" class="para">46</a>] </sup>&#12371;&#12398;&#25968;&#12399;&#21407;&#33879;&#20986;&#29256;&#24403;&#26178;(2005&#24180;)&#12398;&#12418;&#12398;&#12392;&#24605;&#12431;&#12428;&#12427;&#12290;2009&#24180;3&#26376;&#29694;&#22312;&#12391;&#12399;&#12289;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12464;&#12398;&#25968;&#12399;51&#19975;&#20214;&#12434;&#36229;&#12360;&#12390;&#12356;&#12427;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="vc-systems.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bikeshed-full.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;</td></tr></table></div></body></html>
