<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="vc.html" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;"><link rel="next" href="irc.html" title="IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="vc.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="irc.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="bug-tracker"></a>&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</h2></div></div></div><p>
    &#12496;&#12464;&#36861;&#36321; &#12364;&#25201;&#12358;&#31684;&#22258;&#12399;&#22810;&#23696;&#12395;&#12431;&#12383;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#26412;&#12391;&#12399;&#12496;&#12464;&#36861;&#36321;&#12395;&#12388;&#12356;&#12390;&#12398;&#27096;&#12293;&#12394;&#20596;&#38754;&#12434;&#35696;&#35542;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12399; &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#12371;&#12392;&#12392;&#12289;
    &#12381;&#12398;&#20316;&#26989;&#12395;&#38306;&#12377;&#12427;&#25216;&#34899;&#30340;&#12394;&#32771;&#23519;&#12395;&#38598;&#20013;&#12375;&#12424;&#12358;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#35441;&#38988;&#12395;&#20837;&#12427;&#21069;&#12395;&#12289;&#12496;&#12464;&#36861;&#36321;&#12398;&#26041;&#37341;&#12395;&#38306;&#12377;&#12427;&#36074;&#21839;&#12363;&#12425;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#20855;&#20307;&#30340;&#12395;&#12393;&#12398;&#24773;&#22577;&#12434;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#20445;&#23384;&#12377;&#12409;&#12365;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;?
</p><p>
    <em class="firstterm">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</em> &#12399;&#12289;&#35492;&#35299;&#12434;&#25307;&#12365;&#12420;&#12377;&#12356;&#29992;&#35486;&#12391;&#12377;&#12290;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#26032;&#12375;&#12356;&#27231;&#33021;&#35201;&#26395;&#12420;&#12289;&#19968;&#24230;&#38480;&#12426;&#12398;&#12479;&#12473;&#12463;&#12289;
    &#36865;&#12425;&#12428;&#12390;&#12365;&#12383;&#12497;&#12483;&#12481; &#8212; &#12399;&#12376;&#12414;&#12426;&#12392;&#32066;&#12431;&#12426;&#12398;&#29366;&#24907;&#12364;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12418;&#12398;&#12289;
    &#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#38291;&#12395;&#24773;&#22577;&#12364;&#30330;&#29983;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12418;&#12398;&#12434;&#36861;&#36321;&#12377;&#12427;&#12383;&#12417;&#12395;&#12424;&#12367;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12383;&#12417;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;
    <em class="firstterm">&#21839;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</em>&#12289;
    <em class="firstterm">&#19981;&#20855;&#21512;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</em>&#12289;
    <em class="firstterm">&#24433;&#38911;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</em>&#12289;
    <em class="firstterm">&#35201;&#26395;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</em>&#12289;
    <em class="firstterm">&#12481;&#12465;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;</em> &#12394;&#12393;&#12392;&#12418;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19968;&#35239;&#12399;&#12289;<a class="xref" href="bug-trackers.html" title="&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;">&#20184;&#37682;C <i>&#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</i></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
    &#12371;&#12398;&#26412;&#12391;&#12399; "&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;" &#12392;&#12356;&#12358;&#29992;&#35486;&#12434;&#12289;
    &#12496;&#12464;&#12434;&#36861;&#36321;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25351;&#12377;&#12418;&#12398;&#12392;&#12375;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#27526;&#12393;&#12398;&#20154;&#12364;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12392;&#21628;&#12435;&#12391;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12427;&#20491;&#12293;&#12398;&#12450;&#12452;&#12486;&#12512;&#12434;&#25351;&#12377;&#12418;&#12398;&#12392;&#12375;&#12390;&#12289;
    <em class="firstterm">&#21839;&#38988;</em> &#12392;&#12356;&#12358;&#29992;&#35486;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12518;&#12540;&#12470;&#12540;&#12364;&#36973;&#36935;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22793;&#12394;&#25391;&#12427;&#33310;&#12356;&#65288;&#12388;&#12414;&#12426;&#12289;&#12496;&#12464;&#12391;&#12377;&#65289;&#12392;&#12289;
    &#12496;&#12464;&#12398;&#30330;&#35211;&#12289;&#35386;&#26029;&#12289;&#35299;&#27770;&#12398; <span class="emphasis"><em>&#35352;&#37682;</em></span> &#12434;&#21306;&#21029;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#27526;&#12393;&#12398;&#21839;&#38988;&#12399;&#23455;&#38555;&#12395;&#36215;&#12371;&#12387;&#12383;&#12496;&#12464;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#20182;&#12398;&#12479;&#12473;&#12463;&#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12391;&#12418;&#21839;&#38988;&#12392;&#12356;&#12358;&#29992;&#35486;&#12364;&#20351;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>&#21839;&#38988;&#12398;&#20856;&#22411;&#30340;&#12394;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;

</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#35504;&#12363;&#12364;&#21839;&#38988;&#12434;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#35352;&#37682;&#12375;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#35352;&#37682;&#12395;&#12399;&#12289;&#21839;&#38988;&#12398;&#35201;&#28857;&#12289;&#21839;&#38988;&#12398;&#35500;&#26126;(&#12418;&#12375;&#12354;&#12428;&#12400;&#12289;
            &#21839;&#38988;&#12434;&#20877;&#29694;&#12373;&#12379;&#12427;&#12383;&#12417;&#12398;&#25163;&#38918;&#12418;&#12290;
            &#12518;&#12540;&#12470;&#12540;&#12395;&#20778;&#12428;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#12373;&#12379;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
            <span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a></span> &#12398; <a class="xref" href="managing-volunteers.html#users-to-volunteers" title="&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;">&#12300;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
            &#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#27714;&#12417;&#12390;&#12356;&#12427;&#12381;&#12398;&#20182;&#12398;&#24773;&#22577;&#12364;&#20840;&#12390;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12383;&#20154;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#20840;&#12367;&#30693;&#12425;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#8212;
            &#12518;&#12540;&#12470;&#12540;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#38283;&#30330;&#32773;&#36948;&#12363;&#12425;&#12289;&#21516;&#12376;&#12367;&#12425;&#12356;&#12398;&#21106;&#21512;&#12391;&#12496;&#12464;&#22577;&#21578;&#12420;&#27231;&#33021;&#35201;&#26395;&#12364;&#12354;&#12364;&#12387;&#12390;&#12365;&#12414;&#12377;&#12290;</p><p>&#12356;&#12387;&#12383;&#12435;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12427;&#12392;&#12289;&#12381;&#12398;&#21839;&#38988;&#12399; <em class="firstterm">&#20445;&#30041;&#20013;</em> &#12398;&#29366;&#24907;&#12395;&#12354;&#12427;&#12392;&#12356;&#12356;&#12414;&#12377;&#12290;
            &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#20309;&#12425;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#12392;&#12425;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
            &#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
            <em class="firstterm">&#26410;&#30906;&#35469;</em> &#12392;&#12363; <em class="firstterm">&#26410;&#30528;&#25163;</em> &#12392;&#12356;&#12387;&#12383;&#12521;&#12505;&#12523;&#12434;&#20184;&#19982;&#12377;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12414;&#12384;&#35504;&#12418;&#12371;&#12398;&#21839;&#38988;&#12434;&#25285;&#24403;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
            &#25285;&#24403;&#12364;&#27770;&#12414;&#12387;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#34920;&#12377;&#12383;&#12417;&#12395;&#12480;&#12511;&#12540;&#12398;&#25285;&#24403;&#32773;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#26178;&#28857;&#12391;&#12399;&#12289;&#21839;&#38988;&#12399;&#19968;&#26178;&#30340;&#12394;&#38936;&#22495;&#12395;&#32622;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
            &#12471;&#12473;&#12486;&#12512;&#12395;&#35352;&#37682;&#12373;&#12428;&#12390;&#12399;&#12356;&#12427;&#12364;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12414;&#12384;&#38306;&#24515;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;</p></li><li class="listitem"><p>
            &#35504;&#12363;&#20182;&#12398;&#20154;&#12364;&#21839;&#38988;&#12434;&#35501;&#12415;&#12289;&#12467;&#12513;&#12531;&#12488;&#12434;&#20184;&#12369;&#12414;&#12377;&#12290;
            &#12362;&#12381;&#12425;&#12367;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12383;&#20154;&#12395;&#12289;&#19981;&#26126;&#12394;&#28857;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12434;&#27714;&#12417;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
            </p></li><li class="listitem"><p>
            &#21839;&#38988;&#12399;&#12420;&#12364;&#12390; <em class="firstterm">&#20877;&#29694;&#28168;&#12415;</em> &#12392;&#12356;&#12358;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#21839;&#38988;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12398;&#20013;&#12391;&#26368;&#12418;&#37325;&#35201;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12289;
            &#12414;&#12384;&#35299;&#27770;&#12373;&#12428;&#12383;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12364;&#12289;
            &#22577;&#21578;&#12375;&#12383;&#20154;&#20197;&#22806;&#12398;&#35504;&#12363;&#12364;&#21839;&#38988;&#12434;&#20877;&#29694;&#12391;&#12365;&#12289;
            &#12371;&#12398;&#21839;&#38988;&#12364;&#26412;&#29289;&#12384;&#12392;&#35388;&#26126;&#12375;&#12383;&#12371;&#12392;&#12434;&#12356;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12375;&#12390;&#21516;&#12376;&#12367;&#12425;&#12356;&#37325;&#35201;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
            &#22577;&#21578;&#12375;&#12383;&#20154;&#12364;&#26412;&#29289;&#12398;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
            &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36002;&#29486;&#12375;&#12383;&#12392;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            </p></li><li class="listitem"><p>
            &#12381;&#12375;&#12390; <em class="firstterm">&#35386;&#26029;&#28168;&#12415;</em> &#12392;&#12356;&#12358;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            &#21839;&#38988;&#12398;&#21407;&#22240;&#12364;&#29305;&#23450;&#12373;&#12428;&#12289;&#21487;&#33021;&#12394;&#12425;&#35299;&#27770;&#12395;&#24517;&#35201;&#12394;&#21172;&#21147;&#12364;&#35211;&#31309;&#12418;&#12425;&#12428;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12425;&#12398;&#12371;&#12392;&#12399;&#24517;&#12378;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#35352;&#37682;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;    
            &#21407;&#22240;&#12434;&#35519;&#12409;&#12383;&#20154;&#12364;&#31361;&#28982;&#12375;&#12400;&#12425;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38626;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#65288;&#12371;&#12428;&#12399;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12395;&#12399;&#12424;&#12367;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#65289;&#22580;&#21512;&#12395;&#12289;
            &#35504;&#12363;&#12364;&#31348;&#12434;&#22475;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
            </p><p>
            &#12371;&#12398;&#27573;&#38542;&#12363;&#12289;&#12418;&#12358;&#12402;&#12392;&#12388;&#21069;&#12398;&#27573;&#38542;&#12391;&#12289;
            &#38283;&#30330;&#32773;&#12364;&#21839;&#38988;&#12434; "&#33258;&#20998;&#12364;&#35299;&#27770;&#12377;&#12427;&#12371;&#12392;&#12395;&#12375;&#12390;"&#12289; &#33258;&#20998;&#33258;&#36523;&#12434; <em class="firstterm">&#25285;&#24403;&#32773;&#12395;&#12377;&#12427;</em> &#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            (&#25285;&#24403;&#32773;&#12434;&#27770;&#12417;&#12427;&#25163;&#32154;&#12365;&#12434;&#12373;&#12425;&#12395;&#35443;&#32048;&#12395;&#35519;&#12409;&#12427;&#12395;&#12399;
            <span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398; </span>&#12289;
            <a class="xref" href="managing-volunteers.html#delegation-assignment" title="&#20316;&#26989;&#20381;&#38972;&#12392;&#25285;&#24403;&#32773;&#12398;&#27770;&#23450;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;">&#12300;&#20316;&#26989;&#20381;&#38972;&#12392;&#25285;&#24403;&#32773;&#12398;&#27770;&#23450;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
            &#12371;&#12398;&#27573;&#38542;&#12391;&#12289;&#21839;&#38988;&#12395;<em class="firstterm">&#20778;&#20808;&#24230;</em> &#12418;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            &#12383;&#12392;&#12360;&#12400;&#12289;&#21839;&#38988;&#12364;&#12392;&#12390;&#12418;&#28145;&#21051;&#12394;&#12398;&#12391;&#35299;&#27770;&#12399;&#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#12414;&#12431;&#12377;&#12409;&#12365;&#22580;&#21512;&#12289;
            &#12381;&#12398;&#20107;&#23455;&#12399;&#26089;&#12356;&#27573;&#38542;&#12391;&#30906;&#35469;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12424;&#12387;&#12390;&#12289;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12381;&#12428;&#12434;&#35352;&#37682;&#12377;&#12427;&#20309;&#12425;&#12363;&#12398;&#26041;&#27861;&#12434;&#20633;&#12360;&#12427;&#12409;&#12365;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            </p></li><li class="listitem"><p>
            &#21839;&#38988;&#12434;&#12356;&#12388;&#35299;&#27770;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#20104;&#23450;&#12364;&#31435;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
            &#20104;&#23450;&#12434;&#27770;&#12417;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
            &#12356;&#12388;&#12414;&#12391;&#12395;&#30452;&#12377;&#12392;&#12356;&#12358;&#26085;&#31243;&#12434;&#27770;&#12417;&#12427;&#12371;&#12392;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#23558;&#26469;&#12398;&#12393;&#12398;&#12522;&#12522;&#12540;&#12473;&#65288;&#27425;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#65289;&#12391;&#30452;&#12377;&#12363;&#12434;&#27770;&#12417;&#12427;&#12384;&#12369;&#12398;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
            &#29305;&#23450;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#30452;&#12377;&#12392;&#27770;&#12417;&#12394;&#12356;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12496;&#12464;&#12364;&#32032;&#26089;&#12367;&#30452;&#12379;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#20104;&#23450;&#12434;&#31435;&#12390;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            </p></li><li class="listitem"><p>
            &#21839;&#38988;&#12364;&#35299;&#27770;&#12373;&#12428;&#12414;&#12377;&#12290;&#65288;&#12479;&#12473;&#12463;&#12364;&#32066;&#20102;&#12375;&#12383;&#12426;&#12289;
            &#12497;&#12483;&#12481;&#12364;&#36969;&#29992;&#12373;&#12428;&#12383;&#12426;&#12392;&#12363;&#12289;&#12381;&#12358;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#65289;
            &#34892;&#12387;&#12383;&#22793;&#26356;&#12399;&#12289;&#21839;&#38988;&#12398; <em class="firstterm">&#20966;&#29702;&#12364;&#28168;&#12435;&#12384;</em> &#12426;&#12289;
            <em class="firstterm">&#35299;&#27770;&#28168;&#12415;</em> &#12392;&#12510;&#12540;&#12463;&#12373;&#12428;&#12383;&#12354;&#12392;&#12395;&#12289;
            &#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#35352;&#37682;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
            </p></li></ol></div><p>

</p><p>
    &#21839;&#38988;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12395;&#12399;&#20849;&#36890;&#12398;&#12496;&#12522;&#12456;&#12540;&#12471;&#12519;&#12531;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#21839;&#38988;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12496;&#12464;&#12391;&#12399;&#12394;&#12367;&#12518;&#12540;&#12470;&#12540;&#20596;&#12364;&#35492;&#35299;&#12375;&#12390;&#12356;&#12383;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12377;&#12368;&#12395;&#20966;&#29702;&#28168;&#12415;&#12392;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22810;&#12367;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#29554;&#24471;&#12377;&#12427;&#12395;&#12388;&#12428;&#12289;
    &#12496;&#12464;&#12391;&#12399;&#12394;&#12356;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12427;&#22238;&#25968;&#12418;&#22679;&#12360;&#12390;&#12356;&#12365;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#27425;&#31532;&#12395;&#12406;&#12387;&#12365;&#12425;&#12412;&#12358;&#12394;&#36820;&#20107;&#12434;&#12375;&#12390;&#21839;&#38988;&#12434;&#20966;&#29702;&#28168;&#12415;&#12392;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#39080;&#28526;&#12395;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#21162;&#21147;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12406;&#12387;&#12365;&#12425;&#12412;&#12358;&#12395;&#21839;&#38988;&#12434;&#20966;&#29702;&#28168;&#12415;&#12395;&#12375;&#12390;&#12418;&#12356;&#12356;&#12371;&#12392;&#12399;&#20309;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12496;&#12464;&#12391;&#12399;&#12394;&#12356;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12383;&#12518;&#12540;&#12470;&#65293;&#12399;&#12289;&#20197;&#21069;&#22577;&#21578;&#12373;&#12428;&#12383;&#21839;&#38988;&#12395;&#12399;&#20309;&#12398;&#36012;&#20219;&#12418;&#12394;&#12356;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
    &#12381;&#12428;&#12395;&#22577;&#21578;&#12373;&#12428;&#12427;&#21839;&#38988;&#12364;&#32113;&#35336;&#30340;&#12395;&#12393;&#12358;&#12356;&#12387;&#12383;&#20670;&#21521;&#12395;&#12354;&#12427;&#12363;&#12399;&#12289;
    &#38283;&#30330;&#32773;&#12398;&#12415;&#12431;&#12363;&#12427;&#12371;&#12392;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12395;&#12399;&#12431;&#12363;&#12425;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
    (<span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span> <a class="xref" href="bug-tracker.html#bug-filtering" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;">&#12300;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;&#12301;</a> &#12391;&#12289;
    &#12496;&#12464;&#12391;&#12399;&#12394;&#12356;&#21839;&#38988;&#12398;&#25968;&#12434;&#28187;&#12425;&#12377;&#12486;&#12463;&#12491;&#12483;&#12463;&#12395;&#12388;&#12356;&#12390;&#35211;&#12390;&#12356;&#12365;&#12414;&#12377;)
    &#12414;&#12383;&#12289;&#30064;&#12394;&#12387;&#12383;&#12518;&#12540;&#12470;&#12540;&#12364;&#32368;&#12426;&#36820;&#12375;&#21516;&#12376;&#12424;&#12358;&#12394;&#35492;&#35299;&#12434;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#35492;&#35299;&#12434;&#29983;&#12416;&#37096;&#20998;&#12434;&#20877;&#35373;&#35336;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#25163;&#12398;&#12497;&#12479;&#12540;&#12531;&#12399;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#30435;&#35222;&#12377;&#12427;&#21839;&#38988;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#12354;&#12428;&#12400;&#31777;&#21336;&#12395;&#35211;&#12388;&#12363;&#12426;&#12414;&#12377;&#12290;
    <span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398;</span>&#12289;
    <a class="xref" href="share-management.html#issue-manager" title="&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;">&#12300;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
    &#21029;&#12398;&#12496;&#12522;&#12456;&#12540;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#12289;
    1. &#12398;&#12377;&#12368;&#24460;&#12391;&#21839;&#38988;&#12364; <em class="firstterm">&#37325;&#35079;&#12375;&#12390;&#12356;&#12427;</em> &#12392;&#12375;&#12390;&#20966;&#29702;&#28168;&#12415;&#12395;&#12373;&#12428;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#37325;&#35079;&#12375;&#12383;&#21839;&#38988;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26082;&#12395;&#35469;&#35672;&#12375;&#12390;&#12356;&#12427;&#21839;&#38988;&#12434;&#35504;&#12363;&#12364;&#12414;&#12383;&#22577;&#21578;&#12377;&#12427;&#12392;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
    &#37325;&#35079;&#12375;&#12383;&#29366;&#24907;&#12399; &#20445;&#30041;&#20013; &#12398;&#21839;&#38988;&#12391;&#30330;&#29983;&#12377;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#35299;&#27770;&#12375;&#12383;&#12354;&#12392;&#12391;&#20877;&#12403;&#22577;&#21578;&#12373;&#12428;&#12427;(&#12371;&#12398;&#29366;&#24907;&#12434; <em class="firstterm">&#12522;&#12464;&#12524;&#12483;&#12471;&#12519;&#12531;&#65288;&#22238;&#24112;&#65289;</em> &#12392;&#21628;&#12403;&#12414;&#12377;)&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#22580;&#21512;&#12399;&#12289;&#37325;&#35079;&#12398;&#20803;&#12392;&#12394;&#12387;&#12383;&#21839;&#38988;&#12434; &#20877;&#24230;&#20445;&#30041;&#20013;&#12398;&#29366;&#24907;&#12395;&#12375;&#12390;&#12289;
    &#37325;&#35079;&#12375;&#12383;&#21839;&#38988;&#12399;&#20966;&#29702;&#28168;&#12415;&#12395;&#12375;&#12390;&#12375;&#12414;&#12358;&#12398;&#12364;&#26222;&#36890;&#12399;&#26395;&#12414;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;
    &#21839;&#38988;&#12434;&#20877;&#29694;&#12377;&#12427;&#24773;&#22577;&#12399;&#12399;&#12376;&#12417;&#12395;&#22577;&#21578;&#12373;&#12428;&#12383;&#21839;&#38988;&#12391;&#35211;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#65288;&#36870;&#12418;&#21516;&#27096;&#65289;&#12289;
    &#21839;&#38988;&#21516;&#22763;&#12398;&#38306;&#36899;&#12434;&#36861;&#36321;&#12375;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><p>
    &#38283;&#30330;&#32773;&#12364;&#21839;&#38988;&#12434;&#20966;&#29702;&#28168;&#12415;&#12395;&#12377;&#12427;3&#12388;&#30446;&#12398;&#12496;&#12522;&#12456;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;
    &#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12383;&#12392;&#24605;&#12356;&#36796;&#12435;&#12391;&#20966;&#29702;&#28168;&#12415;&#12395;&#12377;&#12427;&#12497;&#12479;&#12540;&#12531;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#32080;&#23616;&#12289;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12383;&#20154;&#12364;&#12381;&#12428;&#12434;&#25298;&#12435;&#12391;&#20877;&#24230;&#20445;&#30041;&#20013;&#12395;&#12377;&#12427;&#32080;&#26524;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#38283;&#30330;&#32773;&#12364;&#21336;&#12395;&#12496;&#12464;&#12434;&#20877;&#29694;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#29872;&#22659;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#12363;&#12289;
    &#21839;&#38988;&#12434;&#20877;&#29694;&#12377;&#12427;&#25163;&#38918;&#12395;&#27491;&#30906;&#12395;&#24467;&#12387;&#12390;&#12486;&#12473;&#12488;&#12434;&#12375;&#12394;&#12363;&#12387;&#12383;&#12383;&#12417;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12428;&#12425;&#12398;&#12496;&#12522;&#12456;&#12540;&#12471;&#12519;&#12531;&#12398;&#12411;&#12363;&#12395;&#12418;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#32048;&#12363;&#12356;&#37096;&#20998;&#12364;&#22793;&#12431;&#12427;&#22580;&#21512;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#22522;&#26412;&#30340;&#12394;&#12497;&#12479;&#12540;&#12531;&#12399;&#21516;&#12376;&#12391;&#12377;&#12290;
    &#21839;&#38988;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12381;&#12398;&#12418;&#12398;&#12418;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#29305;&#26377;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#20351;&#12356;&#26041;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    1. &#12364;&#26263;&#12395;&#31034;&#12377;&#12392;&#12362;&#12426;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12392;&#21516;&#27096;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38996;&#12391;&#12377;&#12290;
    &#35504;&#12391;&#12418;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12289;&#35519;&#12409;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;&#29694;&#22312;&#20445;&#30041;&#20013;&#12392;&#12373;&#12428;&#12390;&#12356;&#12427;&#21839;&#38988;&#12398;&#19968;&#35239;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12427;&#21839;&#38988;&#12398;&#36914;&#25431;&#12434;&#20309;&#20154;&#12398;&#20154;&#12364;&#30693;&#12426;&#12383;&#12364;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12364;&#12289;
    &#38283;&#30330;&#32773;&#12395;&#12399;&#12431;&#12363;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#21839;&#38988;&#12364;&#35299;&#27770;&#12373;&#12428;&#12427;&#21106;&#21512;&#12399;&#38283;&#30330;&#32773;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#35215;&#27169;&#12420;&#12473;&#12461;&#12523;&#12395;&#24038;&#21491;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12383;&#12425;&#12377;&#12368;&#12395;&#12381;&#12428;&#12434;&#35469;&#35672;&#12375;&#12424;&#12358;&#12392;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#21839;&#38988;&#12364;&#35299;&#27770;&#12373;&#12428;&#12378;&#12395;&#12375;&#12400;&#12425;&#12367;&#27531;&#12426;&#32154;&#12369;&#12390;&#12418;&#12289;
    &#38283;&#30330;&#32773;&#12364;&#36820;&#31572;&#12377;&#12427;&#12392;&#12289;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12383;&#20154;&#12399;&#24341;&#12365;&#32154;&#12365;&#21442;&#21152;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#33258;&#20998;&#12364;&#12420;&#12387;&#12383;&#12371;&#12392;&#12364;&#35469;&#12417;&#12425;&#12428;&#12383;&#12392;&#24863;&#12376;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;(&#21839;&#38988;&#12434;&#22577;&#21578;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#12383;&#12392;&#12360;&#12400;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#36865;&#12427;&#12371;&#12392;&#20197;&#19978;&#12395;&#21172;&#21147;&#12364;&#12356;&#12427;&#12371;&#12392;&#12434;&#24605;&#12356;&#20986;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
    &#12381;&#12428;&#20197;&#19978;&#12395;&#12289;&#21839;&#38988;&#12434;&#12356;&#12387;&#12383;&#12435;&#38283;&#30330;&#32773;&#12364;&#35211;&#12428;&#12400;&#12289;
    &#22577;&#21578;&#12373;&#12428;&#12383;&#21839;&#38988;&#12398;&#20182;&#12398;&#20107;&#20363;&#12395;&#27880;&#24847;&#12434;&#25173;&#12387;&#12383;&#12426;&#12289;&#20182;&#12398;&#38283;&#30330;&#32773;&#12392;&#35441;&#12375;&#21512;&#12360;&#12427;&#12289;&#12394;&#12393;&#12398;&#24847;&#21619;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21839;&#38988;&#12434;&#35469;&#35672;&#12375;&#12383;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#36969;&#20999;&#12394;&#12479;&#12452;&#12511;&#12531;&#12464;&#12391;&#21839;&#38988;&#12395;&#24540;&#31572;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#20108;&#12388;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
        &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12392;&#25509;&#32154;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
        &#12371;&#12428;&#12399;&#12289;&#21839;&#38988;&#12434;&#22577;&#21578;&#12377;&#12427;&#12371;&#12392;&#12434;&#21547;&#12417;&#12383;&#12289;&#21839;&#38988;&#12398;&#29366;&#24907;&#12434;&#22793;&#26356;&#12377;&#12427;&#12354;&#12425;&#12422;&#12427;&#34892;&#21205;&#12364;&#12289;
        &#12513;&#12540;&#12523;&#12391;&#25237;&#31295;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
        &#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#36890;&#24120;&#20351;&#12358;&#38283;&#30330;&#29992;&#12398;&#12418;&#12398;&#12392;&#12399;&#36949;&#12358;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
        &#12394;&#12380;&#12394;&#12425;&#12289;&#38283;&#30330;&#32773;&#20840;&#21729;&#12364;&#33258;&#21205;&#36865;&#20449;&#12373;&#12428;&#12427;&#12496;&#12464;&#22577;&#21578;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12426;&#12383;&#12356;&#12392;&#12399;&#38480;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
        &#12375;&#12363;&#12375;&#12289;(&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12392;&#21516;&#27096;&#12395;) Reply-to &#12504;&#12483;&#12480;&#12399;&#38283;&#30330;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#35373;&#23450;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    </p></li><li class="listitem"><p>
        &#21839;&#38988;&#12434;&#22577;&#21578;&#12377;&#12427;&#12392;&#12365;&#12398;&#35352;&#20837;&#12501;&#12457;&#12540;&#12512;&#12399;&#12289;
        &#22577;&#21578;&#12377;&#12427;&#20154;&#12398;&#38651;&#23376;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#27396;&#12395;&#12501;&#12457;&#12540;&#12459;&#12473;&#12434;&#24403;&#12390;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
        (&#12375;&#12363;&#12375;&#12289;&#21311;&#21517;&#12391;&#22577;&#21578;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#20154;&#12418;&#12356;&#12427;&#12398;&#12391;&#12289;
        &#38651;&#23376;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434; <span class="emphasis"><em>&#24517;&#38920;</em></span> &#12395;&#12377;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        &#21311;&#21517;&#12398;&#37325;&#35201;&#24615;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
        <span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12395;&#12354;&#12427;</span> <a class="xref" href="web-site.html#anonymity" title="&#21311;&#21517;&#24615;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21442;&#21152;">&#12300;&#21311;&#21517;&#24615;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21442;&#21152;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></li></ul></div><p>

</p><div class="sect2" title="&#35696;&#35542;&#12398;&#22580;&#12392;&#12375;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#20351;&#12358;"><div class="titlepage"><div><div><h3 class="title"><a name="bug-tracker-mailing-list-interaction"></a>&#35696;&#35542;&#12398;&#22580;&#12392;&#12375;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#20351;&#12358;</h3></div></div></div><p>
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#12487;&#12451;&#12473;&#12459;&#12483;&#12471;&#12519;&#12531;&#12501;&#12457;&#12540;&#12521;&#12512;&#12395;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#20154;&#38291;&#12364;&#38996;&#12434;&#20986;&#12375;&#32154;&#12369;&#12427;&#12371;&#12392;&#12399;&#22823;&#20107;&#12391;&#12377;&#12364;&#12289;
    &#12381;&#12428;&#12364;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#35696;&#35542;&#12377;&#12427;&#12398;&#12395;&#36969;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#36215;&#12371;&#12387;&#12383;&#20107;&#23455;&#12420;&#20182;&#12398;&#35696;&#35542;&#12395;&#23550;&#12377;&#12427;&#21442;&#29031;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#36215;&#12365;&#12383;&#35696;&#35542;&#12434;&#12414;&#12392;&#12417;&#12427;&#12450;&#12540;&#12459;&#12452;&#12496;&#12392;&#32771;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#21306;&#21029;&#12434;&#12377;&#12427;&#12398;&#12399;&#12405;&#12383;&#12388;&#12398;&#29702;&#30001;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12417;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#27604;&#12409;&#12390;&#65288;&#12388;&#12356;&#12391;&#12395;&#12356;&#12358;&#12392;&#12289;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#20250;&#35441;&#12364;&#12391;&#12365;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;&#12392;&#27604;&#12409;&#12390;&#12418;&#65289;&#20351;&#12356;&#12395;&#12367;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#35373;&#35336;&#12364;&#24746;&#12356;&#12363;&#12425;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#21336;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;&#12364;&#12289;&#36899;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#29366;&#24907;&#12289;&#12388;&#12414;&#12426;&#33258;&#30001;&#12395;&#27969;&#12428;&#12390;&#12356;&#12367;&#35696;&#35542;&#12434;&#21462;&#12426;&#36796;&#12417;&#12427;&#12424;&#12358;&#12395;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12399;&#12289;&#12354;&#12427;&#35696;&#35542;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#35211;&#12390;&#12356;&#12427;&#12392;&#12399;&#38480;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12424;&#12356;&#21839;&#38988;&#31649;&#29702;&#12398;&#12420;&#12426;&#26041;(<span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398;&#12289;</span> <a class="xref" href="share-management.html" title="&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;">&#12300;&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12399;&#12289;
    &#38283;&#30330;&#32773;&#20840;&#21729;&#12395;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#21839;&#38988;&#20840;&#37096;&#12434;&#36861;&#12356;&#12363;&#12369;&#12373;&#12379;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#36969;&#20999;&#12394;&#20154;&#12398;&#27880;&#24847;&#12434;&#12402;&#12367;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12398;</span> <a class="xref" href="bug-tracker-usage.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356;">&#12300;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356;&#12301;</a>&#12391;&#12399;&#12289;
    &#36969;&#20999;&#12394;&#12501;&#12457;&#12540;&#12521;&#12512;&#20197;&#22806;&#12395;&#20598;&#28982;&#35696;&#35542;&#12364;&#27874;&#21450;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#26041;&#27861;&#12420;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#35696;&#35542;&#12434;&#25345;&#12385;&#36796;&#12414;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#26041;&#27861;&#12434;&#35211;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#12514;&#12491;&#12479;&#12375;&#12289;
    &#26082;&#30693;&#12398;&#21839;&#38988;&#12395;&#38306;&#12377;&#12427;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#20840;&#12390;&#33258;&#21205;&#30340;&#12395;&#35352;&#37682;&#12377;&#12427;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#36890;&#24120;&#12289;&#12371;&#12358;&#12375;&#12383;&#12471;&#12473;&#12486;&#12512;&#12399;&#12513;&#12540;&#12523;&#12398;&#20214;&#21517;&#12398;&#34892;&#12395;&#12354;&#12427;&#21839;&#38988;&#12398;&#30058;&#21495;&#12434;&#12289;
    &#29305;&#21029;&#12394;&#25991;&#23383;&#21015;&#12392;&#12375;&#12390;&#35469;&#35672;&#12377;&#12427;&#12371;&#12392;&#12391;&#12371;&#12428;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#36948;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#27880;&#24847;&#12434;&#24341;&#12367;&#12383;&#12417;&#12395;&#12289;
    &#38651;&#23376;&#12513;&#12540;&#12523;&#12395;&#12371;&#12358;&#12375;&#12383;&#25991;&#23383;&#21015;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#38651;&#23376;&#12513;&#12540;&#12523;&#20840;&#20307;&#12434;&#35352;&#37682;&#12373;&#12379;&#12390;&#12418;&#12356;&#12356;&#12391;&#12377;&#12375;&#12289;
    (&#12424;&#12426;&#12424;&#12356;&#12398;&#12399;)&#36890;&#24120;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12354;&#12427;&#12513;&#12540;&#12523;&#12408;&#12398;&#12522;&#12531;&#12463;&#12434;&#35352;&#37682;&#12373;&#12379;&#12390;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12393;&#12385;&#12425;&#12398;&#26041;&#27861;&#12391;&#12418;&#12289;&#12371;&#12428;&#12399;&#12392;&#12390;&#12418;&#24441;&#12395;&#31435;&#12388;&#27231;&#33021;&#12391;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12364;&#20351;&#12387;&#12390;&#12356;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12371;&#12398;&#27231;&#33021;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;
    &#12381;&#12428;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#20154;&#12293;&#12364;&#21033;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#30693;&#12425;&#12379;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="bug-filtering"></a>&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;</h3></div></div></div><p>
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#32080;&#23616;&#21516;&#12376;&#35506;&#38988;&#12395;&#24745;&#12414;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#12496;&#12464;&#12434;&#22577;&#21578;&#12375;&#12383;&#32076;&#39443;&#12364;&#23569;&#12394;&#12363;&#12387;&#12383;&#12426;&#12289;
    &#32925;&#24515;&#12394;&#37096;&#20998;&#12434;&#30693;&#12425;&#12394;&#12356;&#21892;&#24847;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#12289;
    &#26082;&#12395;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12427;&#21839;&#38988;&#12420;&#12496;&#12464;&#12391;&#12399;&#12394;&#12356;&#21839;&#38988;&#12434;&#22823;&#37327;&#12395;&#22577;&#21578;&#12375;&#12390;&#12367;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#20670;&#21521;&#12395;&#23550;&#20966;&#12377;&#12427;&#12399;&#12376;&#12417;&#12398;&#12473;&#12486;&#12483;&#12503;&#12392;&#12375;&#12390;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12395;&#30446;&#31435;&#12388;&#12424;&#12358;&#12395;&#27880;&#24847;&#26360;&#12365;&#12434;&#32622;&#12356;&#12390;&#12362;&#12367;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12371;&#12391;&#26412;&#24403;&#12395;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12434;&#21306;&#21029;&#12377;&#12427;&#26041;&#27861;&#12420;&#12289;
    &#26082;&#12395;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12427;&#21839;&#38988;&#12363;&#12393;&#12358;&#12363;&#12434;&#26908;&#32034;&#12377;&#12427;&#26041;&#27861;&#12289;
    &#12381;&#12375;&#12390;&#26368;&#24460;&#12395;&#12289;&#26412;&#24403;&#12395;&#26032;&#35215;&#12398;&#12496;&#12464;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#12395;&#21177;&#26524;&#30340;&#12395;&#22577;&#21578;&#12377;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12390;&#12362;&#12367;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12400;&#12425;&#12367;&#12399;&#22577;&#21578;&#12373;&#12428;&#12390;&#12367;&#12427;&#21839;&#38988;&#12398;&#12494;&#12452;&#12474;&#12399;&#19979;&#12370;&#12425;&#12428;&#12414;&#12377;&#12364;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#22679;&#12360;&#12390;&#12367;&#12427;&#12395;&#12388;&#12428;&#12390;&#12371;&#12398;&#35506;&#38988;&#12399;&#32080;&#23616;&#20877;&#29123;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12371;&#12392;&#12391;&#12518;&#12540;&#12470;&#12540;&#12434;&#36012;&#12417;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12402;&#12392;&#12426;&#12402;&#12392;&#12426;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12383;&#12384;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12424;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;&#36002;&#29486;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12377;&#12375;&#12289;
    &#12383;&#12392;&#12360;&#24444;&#12425;&#12398;&#12496;&#12464;&#22577;&#21578;&#12364;&#12399;&#12376;&#12417;&#12399;&#24441;&#12395;&#31435;&#12383;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12354;&#12394;&#12383;&#12399;&#24444;&#12425;&#12395;&#12402;&#12365;&#32154;&#12365;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12418;&#12425;&#12387;&#12390;&#12289;
    &#23558;&#26469;&#12399;&#12424;&#12426;&#12424;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#27442;&#12375;&#12356;&#12392;&#24605;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12400;&#12425;&#12367;&#12398;&#38291;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#33258;&#30001;&#12395;&#12496;&#12464;&#12434;&#22577;&#21578;&#12373;&#12379;&#32154;&#12369;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#35506;&#38988;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#20309;&#12424;&#12426;&#23455;&#34892;&#12377;&#12409;&#12365;&#12371;&#12392;&#12364;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12496;&#12464;&#12391;&#12399;&#12394;&#12356;&#21839;&#38988;&#12420;&#12289;
    &#37325;&#35079;&#12375;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#22577;&#21578;&#12373;&#12428;&#12383;&#12425;&#12377;&#12368;&#12395; &#20966;&#29702;&#28168;&#12415;&#12392;&#12510;&#12540;&#12463;&#12391;&#12365;&#12427;&#21313;&#20998;&#12394;&#30693;&#35672;&#12364;&#12354;&#12427;&#20154;&#12395;&#12496;&#12464;&#22577;&#21578;&#12471;&#12473;&#12486;&#12512;&#12434;&#35211;&#24373;&#12387;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12290;
    &#12381;&#12375;&#12390;&#12496;&#12464;&#22577;&#21578;&#12471;&#12473;&#12486;&#12512;&#12395;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#21069;&#12395;&#12289;
    &#20182;&#12398;&#20154;&#12392;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12424;&#12358;&#12518;&#12540;&#12470;&#12540;&#12395;&#27714;&#12417;&#12427;&#65288;&#12414;&#12383;&#12399;&#24375;&#12367;&#21223;&#12417;&#12427;&#65289;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12399;&#12376;&#12417;&#12398;&#12486;&#12463;&#12491;&#12483;&#12463;&#12399;&#12354;&#12425;&#12422;&#12427;&#12392;&#12371;&#12429;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
    &#24040;&#22823;&#12394;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#25345;&#12388;&#65288;&#12383;&#12392;&#12360;&#12400; <a class="ulink" href="http://bugs.debian.org/" target="_top">http://bugs.debian.org/</a> &#12395;&#12354;&#12427; Debian &#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#22519;&#31558;&#26178;&#28857;&#12391; 315,929&#20491; &#12398;&#12496;&#12464;&#24773;&#22577;&#12364;&#12354;&#12426;&#12414;&#12377;&#65289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12289;&#12496;&#12464;&#12364;&#22577;&#21578;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395; <span class="emphasis"><em>&#35504;&#12363;&#12364;</em></span> &#35211;&#24373;&#12427;&#12424;&#12358;&#12395;&#12471;&#12473;&#12486;&#12512;&#12434;&#25913;&#36896;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#21839;&#38988;&#12398;&#12459;&#12486;&#12468;&#12522;&#12395;&#12424;&#12387;&#12390;&#35211;&#24373;&#12427;&#20154;&#12399;&#36949;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12392;&#12360;&#12400;Debian&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#38598;&#21512;&#20307;&#12394;&#12398;&#12391;&#12289;
    &#33258;&#21205;&#30340;&#12395;&#12381;&#12428;&#12382;&#12428;&#12398;&#21839;&#38988;&#12434;&#36969;&#20999;&#12394;&#12497;&#12483;&#12465;&#12540;&#12472;&#12513;&#12531;&#12486;&#12490;&#12540;&#12395;&#36578;&#36865;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12392;&#12365;&#12393;&#12365;&#21839;&#38988;&#12398;&#12459;&#12486;&#12468;&#12522;&#12434;&#35492;&#35299;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12360;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12356;&#12358;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12496;&#12464;&#12399;&#12399;&#12376;&#12417;&#12399;&#38291;&#36949;&#12387;&#12383;&#20154;&#12395;&#36578;&#36865;&#12373;&#12428;&#12427;&#12398;&#12391;&#12289;
    &#36578;&#36865;&#12373;&#12428;&#12383;&#20154;&#12364;&#20877;&#24230;&#36578;&#36865;&#12375;&#30452;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12381;&#12398;&#36000;&#25285;&#12364;&#20849;&#26377;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;
    &#8212; &#12518;&#12540;&#12470;&#12540;&#12364;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#12392;&#12365;&#12395;&#27491;&#12375;&#12356;&#12363;&#38291;&#36949;&#12387;&#12390;&#12356;&#12427;&#12363;&#12434;&#25512;&#28204;&#12375;&#12424;&#12358;&#12364;&#12377;&#12414;&#12356;&#12364;&#12289;
    &#22577;&#21578;&#12373;&#12428;&#12383;&#12496;&#12464;&#12434;&#35211;&#24373;&#12427;&#24441;&#30446;&#12399;&#22810;&#12363;&#12428;&#23569;&#12394;&#12363;&#12428;&#38283;&#30330;&#32773;&#12395;&#20998;&#25955;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#21839;&#38988;&#12364;&#22577;&#21578;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;&#12289;&#36969;&#20999;&#12394;&#12479;&#12452;&#12511;&#12531;&#12464;&#12391;&#24540;&#31572;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12405;&#12383;&#12388;&#12417;&#12398;&#12486;&#12463;&#12491;&#12483;&#12463;&#12399;&#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12371;&#12428;&#12399;&#12362;&#12381;&#12425;&#12367;&#33258;&#21205;&#21270;&#12364;&#38627;&#12375;&#12356;&#12363;&#12425;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12450;&#12452;&#12487;&#12451;&#12450;&#12398;&#35201;&#28857;&#12399;&#12289;&#26032;&#12375;&#12367;&#22577;&#21578;&#12373;&#12428;&#12390;&#12367;&#12427;&#21839;&#38988;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#30331;&#37682;&#12377;&#12427;&#21069;&#12395;&#12289;
    "&#20210;&#38291;&#12434;" &#24059;&#12365;&#36796;&#12416;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#21839;&#38988;&#12434;&#35211;&#12388;&#12369;&#12383;&#12392;&#24605;&#12387;&#12383;&#12392;&#12365;&#12399;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12363;IRC&#12391;&#35500;&#26126;&#12377;&#12427;&#12424;&#12358;&#12395;&#27714;&#12417;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#35504;&#12363;&#12364;&#26412;&#24403;&#12395;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#21029;&#12398;&#20154;&#12398;&#30446;&#12395;&#26089;&#12417;&#12395;&#26194;&#12377;&#12371;&#12392;&#12391;&#12289;&#12383;&#12367;&#12373;&#12435;&#12398;&#38291;&#36949;&#12387;&#12383;&#22577;&#21578;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#21029;&#12398;&#20154;&#12364;&#12381;&#12398;&#25391;&#12427;&#33310;&#12356;&#12399;&#12496;&#12464;&#12391;&#12399;&#12394;&#12356;&#12392;&#12431;&#12363;&#12387;&#12383;&#12426;&#12289;
    &#26368;&#36817;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#35299;&#27770;&#28168;&#12415;&#12384;&#12392;&#12431;&#12363;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12399;&#12289;&#21029;&#12398;&#20154;&#12364;&#20197;&#21069;&#22577;&#21578;&#12373;&#12428;&#12383;&#21839;&#38988;&#12363;&#12425;&#22577;&#21578;&#12373;&#12428;&#12427;&#12496;&#12464;&#12398;&#20806;&#20505;&#12395;&#31934;&#36890;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#21476;&#12356;&#21839;&#38988;&#12391;&#12354;&#12427;&#12392;&#12518;&#12540;&#12470;&#12540;&#12395;&#25351;&#25688;&#12377;&#12427;&#12371;&#12392;&#12391;&#37325;&#35079;&#12375;&#12383;&#22577;&#21578;&#12434;&#38450;&#12368;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    "&#26082;&#12395;&#22577;&#21578;&#12373;&#12428;&#12383;&#21839;&#38988;&#12363;&#12393;&#12358;&#12363;&#12434;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#26908;&#32034;&#12375;&#12383;&#12363;&#12356;?"
    &#12392;&#12518;&#12540;&#12470;&#12540;&#12395;&#32862;&#12367;&#12384;&#12369;&#12391;&#21313;&#20998;&#12394;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#20154;&#12399;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#12418;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#35504;&#12363;&#12364;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12434; <span class="emphasis"><em>&#26399;&#24453;&#12375;&#12390;&#12356;&#12427;</em></span> &#12392;&#12431;&#12363;&#12428;&#12400;&#12289;
    &#21916;&#12435;&#12391;&#26908;&#32034;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#20210;&#38291;&#12434;&#24059;&#12365;&#36796;&#12416;&#20181;&#32068;&#12415;&#12399;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#12365;&#12428;&#12356;&#12395;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;&#12364;&#12289;
    &#27424;&#28857;&#12418;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#20154;&#12364;&#12289;&#26032;&#12375;&#12367;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#12392;&#12365;&#12395;&#20210;&#38291;&#12434;&#35211;&#12388;&#12369;&#12394;&#12373;&#12356;&#12392;&#12356;&#12358;&#25351;&#31034;&#12434;&#35211;&#12394;&#12356;&#12363;&#12289;
    &#36605;&#35222;&#12377;&#12427;&#12363;&#12375;&#12390;&#12289;&#32080;&#23616;&#12402;&#12392;&#12426;&#12391;&#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12395;&#12399;&#12420;&#12399;&#12426;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#35211;&#24373;&#12387;&#12390;&#12418;&#12425;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12373;&#12425;&#12395;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#26032;&#12375;&#12356;&#22577;&#21578;&#32773;&#12399;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#32173;&#25345;&#12377;&#12427;&#12398;&#12364;&#12393;&#12428;&#12384;&#12369;&#38627;&#12375;&#12356;&#12363;&#12434;&#30693;&#12425;&#12394;&#12356;&#12398;&#12391;&#12289;
    &#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#28961;&#35222;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#21427;&#12375;&#12367;&#27880;&#24847;&#12377;&#12427;&#12398;&#12399;&#12501;&#12455;&#12450;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12424;&#12387;&#12390;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12399;&#12289;
    &#35504;&#12395;&#12418;&#35211;&#12390;&#12418;&#12425;&#12387;&#12390;&#12356;&#12394;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#22577;&#21578;&#32773;&#12395;&#12393;&#12358;&#24046;&#12375;&#25147;&#12377;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#29992;&#24515;&#28145;&#12367;&#12289;&#12394;&#12362;&#12363;&#12388;&#24910;&#37325;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#21839;&#38988;&#12434;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;&#20181;&#32068;&#12415;&#12434;&#29702;&#35299;&#12377;&#12427;&#20154;&#12293;&#12434;&#22679;&#12420;&#12379;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12422;&#12367;&#12422;&#12367;&#12399;&#20210;&#38291;&#12434;&#24059;&#12365;&#36796;&#12435;&#12391;&#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12364;&#30446;&#30340;&#12391;&#12377;&#12290;
    &#35504;&#12395;&#12418;&#35211;&#12390;&#12418;&#12425;&#12387;&#12390;&#12356;&#12394;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#35211;&#12388;&#12369;&#12383;&#12425;&#12289;
    &#12392;&#12427;&#12409;&#12365;&#29702;&#24819;&#30340;&#12394;&#23550;&#20966;&#12398;&#12473;&#12486;&#12483;&#12503;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
    &#12377;&#12368;&#12395;&#12496;&#12464;&#22577;&#21578;&#12395;&#24540;&#31572;&#12375;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#12367;&#12428;&#12383;&#12371;&#12392;&#12395;&#19969;&#23527;&#12395;&#12362;&#31036;&#12434;&#35328;&#12356;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12434;&#35504;&#12363;&#12395;&#35211;&#12390;&#12418;&#12425;&#12358;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#25351;&#25688;&#12375;&#12414;&#12377;&#12290;&#65288;&#12371;&#12428;&#12399;&#12418;&#12385;&#12429;&#12435;&#12289;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#30446;&#31435;&#12388;&#12424;&#12358;&#12395;&#25237;&#31295;&#12377;&#12409;&#12365;&#12391;&#12377;&#65289;
    </p></li><li class="listitem"><p>
    &#22577;&#21578;&#12373;&#12428;&#12383;&#21839;&#38988;&#12364;&#26126;&#12425;&#12363;&#12395;&#27491;&#12375;&#12356;&#12418;&#12398;&#12391;&#37325;&#35079;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#12392;&#12426;&#12354;&#12360;&#12378;&#12381;&#12428;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#36890;&#24120;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;
    &#32080;&#23616;&#12289;&#22577;&#21578;&#12375;&#12383;&#20154;&#12399;&#12496;&#12464;&#12363;&#12393;&#12358;&#12363;&#12434;&#35504;&#12363;&#12395;&#35211;&#12390;&#12418;&#12425;&#12358;&#12409;&#12365;&#12384;&#12392;&#35328;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#27491;&#12375;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#20966;&#29702;&#28168;&#12415;&#12395;&#12377;&#12427;&#12414;&#12391;&#21172;&#21147;&#12434;&#28961;&#39364;&#12395;&#12377;&#12427;&#28857;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    </p></li><li class="listitem"><p>
    &#12381;&#12358;&#12391;&#12394;&#12356;&#22580;&#21512;&#12289;&#12388;&#12414;&#12426;&#22577;&#21578;&#12373;&#12428;&#12383;&#26126;&#12425;&#12363;&#12395;&#27491;&#12375;&#12367;&#12394;&#12356;&#22580;&#21512;&#12399;&#20966;&#29702;&#28168;&#12415;&#12392;&#12510;&#12540;&#12463;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#22577;&#21578;&#12375;&#12383;&#20154;&#12395;&#12399;&#35504;&#12363;&#12395;&#12496;&#12464;&#12391;&#12354;&#12427;&#12363;&#12434;&#30906;&#35469;&#12375;&#12383;&#19978;&#12391;&#22577;&#21578;&#12375;&#12383;&#12398;&#12394;&#12425;&#12289;&#20877;&#24230;&#20445;&#30041;&#20013;&#12395;&#12375;&#12390;&#27442;&#12375;&#12356;&#12392;&#20253;&#12360;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#22580;&#21512;&#12289;&#22577;&#21578;&#12375;&#12383;&#20154;&#12399;&#30906;&#35469;&#12434;&#12392;&#12387;&#12383;&#12473;&#12524;&#12483;&#12489;&#12408;&#12398;&#21442;&#29031;&#65288;e.g. &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12450;&#12540;&#12459;&#12452;&#12502;&#12408;&#12398;URL&#12394;&#12393;&#65289;&#12434;&#25522;&#36617;&#12377;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
    </p></li></ol></div><p>
    &#12371;&#12398;&#26041;&#27861;&#12399;&#12356;&#12378;&#12428;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398; S/N&#27604;&#12434;&#25913;&#21892;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#38291;&#36949;&#12387;&#12383;&#12496;&#12464;&#22577;&#21578;&#12399;&#27770;&#12375;&#12390;&#12394;&#12367;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#38291;&#36949;&#12387;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#26681;&#32118;&#12377;&#12427;&#21807;&#19968;&#12398;&#26041;&#27861;&#12399;&#12289;
    &#38283;&#30330;&#32773;&#20197;&#22806;&#12398;&#20154;&#12395;&#12399;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12431;&#12379;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377; &#8212;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#26041;&#27861;&#12391;&#12424;&#12356;&#32080;&#26524;&#12364;&#20986;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#38291;&#36949;&#12387;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#21462;&#12426;&#38500;&#12367;&#12371;&#12392;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12523;&#12540;&#12481;&#12531;&#12527;&#12540;&#12463;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#21463;&#12369;&#20837;&#12428;&#12289;
    &#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#12398;&#20154;&#36948;&#12398;&#21161;&#12369;&#12434;&#24471;&#12424;&#12358;&#12392;&#12375;&#12383;&#26041;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p><span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398; </span><a class="xref" href="share-management.html#issue-manager" title="&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;">&#12300;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;</a> &#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="vc.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="irc.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;</td></tr></table></div></body></html>
