<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;"><link rel="prev" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;"><link rel="next" href="difficult-people.html" title="&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="communications.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</th><td width="20%" align="right"> <a accesskey="n" href="difficult-people.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="common-pitfalls"></a>&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;</h2></div></div></div><div class="sect2" title="&#30446;&#30340;&#12398;&#12394;&#12356;&#25237;&#31295;&#12434;&#12375;&#12394;&#12356;"><div class="titlepage"><div><div><h3 class="title"><a name="post-with-purpose"></a>&#30446;&#30340;&#12398;&#12394;&#12356;&#25237;&#31295;&#12434;&#12375;&#12394;&#12356;</h3></div></div></div><p>
  &#12458;&#12531;&#12521;&#12452;&#12531;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12402;&#12392;&#12383;&#12385;&#12364;&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;&#12398;&#12402;&#12392;&#12388;&#12395;
  &#12300;&#12377;&#12409;&#12390;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#36820;&#20449;&#12375;&#12394;&#12369;&#12428;&#12400;&#65281;&#12301;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#31532;&#19968;&#12289;&#25968;&#12534;&#26376;&#12434;&#32076;&#12390;&#12354;&#12427;&#31243;&#24230;&#12398;&#35215;&#27169;&#12395;&#12394;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#35696;&#35542;&#12434;&#36861;&#12356;&#12363;&#12369;&#12427;&#12394;&#12435;&#12390;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#33258;&#20998;&#12364;&#27880;&#30446;&#12375;&#12390;&#12356;&#12427;&#12473;&#12524;&#12483;&#12489;&#12395;&#12388;&#12356;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#25237;&#31295;&#12398;&#22810;&#12367;&#12399;&#21029;&#12395;&#36820;&#20449;&#12434;&#35201;&#27714;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#38283;&#30330;&#31995;&#12398;&#12501;&#12457;&#12540;&#12521;&#12512;&#12391;&#12399;&#29305;&#12395;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#22810;&#12367;&#12394;&#12427;&#20670;&#21521;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#35211;&#36942;&#12372;&#12379;&#12394;&#12356;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12398;&#24847;&#35211;</p></li><li class="listitem"><p>&#35504;&#12363;&#12364;&#35328;&#12387;&#12383;&#12371;&#12392;&#12395;&#38306;&#12377;&#12427;&#36059;&#25104;&#24847;&#35211;&#12354;&#12427;&#12356;&#12399;&#21453;&#23550;&#24847;&#35211;</p></li><li class="listitem"><p>&#12371;&#12428;&#12414;&#12391;&#12398;&#35696;&#35542;&#12398;&#12414;&#12392;&#12417;</p></li></ol></div><p>
  &#12371;&#12428;&#12425;&#12398;&#12356;&#12378;&#12428;&#12395;&#12388;&#12356;&#12390;&#12418;&#12289;<span class="emphasis"><em>&#26412;&#36074;&#30340;&#12395;&#12399;</em></span>
  &#36820;&#20449;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;&#27880;&#24847;&#28145;&#12367;&#12473;&#12524;&#12483;&#12489;&#12434;&#35251;&#23519;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
  &#12354;&#12394;&#12383;&#12364;&#35328;&#12356;&#12383;&#12356;&#12371;&#12392;&#12399;&#12365;&#12387;&#12392;&#20182;&#12398;&#12384;&#12428;&#12363;&#12364;&#35328;&#12387;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;
  (&#12415;&#12435;&#12394;&#12364;&#21516;&#12376;&#12424;&#12358;&#12395;&#32771;&#12360;&#12390;&#12356;&#12383;&#12425;&#12289;&#32080;&#23616;&#12384;&#12428;&#12418;&#30330;&#35328;&#12375;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12435;&#12376;&#12419;&#12394;&#12356;&#12398;&#65311;
  &#12392;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12289;&#20309;&#12363;&#35328;&#12431;&#12378;&#12395;&#12399;&#12356;&#12425;&#12428;&#12394;&#12356;&#20154;&#12364;
  <span class="emphasis"><em>&#35504;&#12363;&#12375;&#12425;</em></span> &#23384;&#22312;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;)&#12290;
  &#26126;&#30906;&#12394;&#30446;&#30340;&#12364;&#12354;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#36820;&#20449;&#12434;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12378;&#12399;&#33258;&#20998;&#12395;&#21839;&#12356;&#12363;&#12369;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12300;&#12381;&#12398;&#36820;&#20449;&#12391;&#20309;&#12434;&#36948;&#25104;&#12375;&#12383;&#12356;&#12398;&#12363;&#12289;&#12365;&#12385;&#12435;&#12392;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#65311;&#12301;
  &#12300;&#12381;&#12398;&#30446;&#30340;&#12399;&#12289;&#33258;&#20998;&#12364;&#36820;&#20449;&#12375;&#12394;&#12356;&#38480;&#12426;&#36948;&#25104;&#12391;&#12365;&#12394;&#12356;&#12418;&#12398;&#12394;&#12398;&#12363;&#65311;&#12301;
</p><p>
  &#12354;&#12394;&#12383;&#12364;&#12473;&#12524;&#12483;&#12489;&#12395;&#21475;&#20986;&#12375;&#12434;&#12377;&#12427;&#12398;&#12395;&#36969;&#20999;&#12394;&#22580;&#38754;&#12399;&#27425;&#12398;&#12405;&#12383;&#12388;&#12391;&#12377;&#12290;
  a) &#25552;&#26696;&#20869;&#23481;&#12398;&#19981;&#20633;&#12395;&#27671;&#12389;&#12356;&#12383;&#12364;&#12289;&#12362;&#12381;&#12425;&#12367;&#20182;&#12398;&#35504;&#12418;&#12381;&#12428;&#12395;&#27671;&#12389;&#12356;&#12390;&#12356;&#12394;&#12356;&#12392;&#24605;&#12431;&#12428;&#12427;&#12392;&#12365;&#12289;
  &#12381;&#12375;&#12390; b) &#35504;&#12363;&#12392;&#35504;&#12363;&#12398;&#38291;&#12398;&#24847;&#24605;&#30094;&#36890;&#12364;&#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12395;&#12289;
  &#25237;&#31295;&#20869;&#23481;&#12434;&#25972;&#29702;&#12375;&#12390;&#20108;&#20154;&#12398;&#38306;&#20418;&#12434;&#20462;&#24489;&#12375;&#12390;&#12354;&#12370;&#12425;&#12428;&#12381;&#12358;&#12394;&#12392;&#12365;&#12290;
  &#12354;&#12392;&#12399;&#12289;&#35504;&#12363;&#12364;&#20309;&#12363;&#12434;&#12375;&#12390;&#12367;&#12428;&#12383;&#12371;&#12392;&#12395;&#23550;&#12377;&#12427;&#24863;&#35613;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12420;
  &#12383;&#12384;&#21336;&#12395; "&#31169;&#12418;&#12381;&#12358;&#24605;&#12356;&#12414;&#12377;&#65281;" &#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12394;&#12393;&#12434;&#36865;&#20449;&#12375;&#12390;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12381;&#12358;&#12356;&#12387;&#12383;&#25237;&#31295;&#12434;&#12377;&#12428;&#12400;&#12381;&#12398;&#12513;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#36820;&#20449;&#12364;&#19981;&#35201;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12399;&#12387;&#12365;&#12426;&#12377;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12391;&#26368;&#24460;&#12395;&#12513;&#12540;&#12523;&#12434;&#25237;&#31295;&#12375;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;
  &#12300;&#12473;&#12524;&#12483;&#12489;&#12364;&#12365;&#12428;&#12356;&#12395;&#12414;&#12392;&#12414;&#12387;&#12383;&#12301;&#12392;&#12356;&#12358;&#23433;&#24515;&#24863;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12435;&#12394;&#25237;&#31295;&#12398;&#38555;&#12395;&#12418;&#12289;&#25237;&#31295;&#12398;&#21069;&#12395;&#12424;&#12367;&#32771;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#12385;&#12423;&#12387;&#12392;&#25237;&#31295;&#12375;&#12377;&#12366;&#12376;&#12419;&#12394;&#12356;&#65311;&#12301;&#12392;&#24605;&#12431;&#12428;&#12427;&#12424;&#12426;
  &#12300;&#12418;&#12358;&#12385;&#12423;&#12387;&#12392;&#30330;&#35328;&#12375;&#12390;&#12411;&#12375;&#12356;&#12394;&#12301;&#12392;&#24605;&#12431;&#12428;&#12427;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#12510;&#12471;&#12391;&#12377;
  (&#27963;&#30330;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12393;&#12398;&#12424;&#12358;&#12395;&#25391;&#33310;&#12360;&#12400;&#12356;&#12356;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12398;&#24847;&#35211;&#12399;&#12289;
  <a class="xref" href="bikeshed-full.html" title="&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;">&#20184;&#37682;D <i>&#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;</i></a> &#12398;&#24460;&#21322;&#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12290;
</p></div><div class="sect2" title="&#29983;&#29987;&#30340;&#12394;&#12473;&#12524;&#12483;&#12489;&#12392;&#12381;&#12358;&#12391;&#12394;&#12356;&#12473;&#12524;&#12483;&#12489;"><div class="titlepage"><div><div><h3 class="title"><a name="productive-threads"></a>&#29983;&#29987;&#30340;&#12394;&#12473;&#12524;&#12483;&#12489;&#12392;&#12381;&#12358;&#12391;&#12394;&#12356;&#12473;&#12524;&#12483;&#12489;</h3></div></div></div><p>
  &#27963;&#30330;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#27424;&#12363;&#12379;&#12394;&#12356;&#12398;&#12399;&#12289;&#27425;&#12398; 2 &#28857;&#12391;&#12377;&#12290;
  &#12414;&#12378;&#26126;&#12425;&#12363;&#12394;&#12398;&#12399;&#12289;&#27880;&#30446;&#12377;&#12409;&#12365;&#12418;&#12398;&#12392;&#12393;&#12358;&#12391;&#12418;&#12356;&#12356;&#12418;&#12398;&#12434;&#35211;&#20998;&#12369;&#12427;&#12371;&#12392;&#12289;
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#12494;&#12452;&#12474;&#12398; <span class="emphasis"><em>&#21407;&#22240;</em></span>
  &#12392;&#12394;&#12427;&#12371;&#12392;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#33258;&#20998;&#33258;&#36523;&#12398;&#25237;&#31295;&#12398; S/N &#27604;&#12434;&#39640;&#12367;&#20445;&#12388;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#20182;&#12398;&#21442;&#21152;&#32773;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398; S/N &#27604;&#12418;&#21516;&#27096;&#12395;&#39640;&#12367;&#12375;&#12383;&#12356;&#12290;
  &#12381;&#12428;&#12364;&#12391;&#12365;&#12394;&#12356;&#12394;&#12425;&#12356;&#12387;&#12381;&#12398;&#12371;&#12392;&#25237;&#31295;&#12375;&#12394;&#12356;&#12391;&#12411;&#12375;&#12356;&#12290;
</p><p>
  &#12393;&#12358;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12363;&#12434;&#32771;&#12360;&#12427;&#12383;&#12417;&#12395;&#12289;&#12414;&#12378;&#12399;&#29366;&#27841;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#20013;&#12391;&#12289;&#29983;&#29987;&#30340;&#12391;&#12394;&#12356;&#12473;&#12524;&#12483;&#12489;&#12392;&#12356;&#12360;&#12427;&#12398;&#12399;&#12393;&#12428;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#12377;&#12391;&#12395;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#35696;&#35542;&#12434;&#12418;&#12358;&#19968;&#24230;&#32368;&#12426;&#36820;&#12377;&#12290;
            &#12414;&#12427;&#12391;&#12289;&#26368;&#21021;&#12395;&#25237;&#31295;&#12375;&#12383;&#20869;&#23481;&#12434;
            &#35504;&#12418;&#35501;&#12435;&#12391;&#12356;&#12394;&#12356;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#24605;&#12431;&#12428;&#12427;&#12424;&#12358;&#12394;&#29366;&#24907;&#12290;</p></li><li class="listitem"><p>&#35441;&#12364;&#12393;&#12435;&#12393;&#12435;&#35463;&#24373;&#12373;&#12428;&#12390;&#12356;&#12365;&#12289;
            &#12381;&#12398;&#35696;&#35542;&#12395;&#12363;&#12363;&#12431;&#12427;&#20154;&#12364;&#12393;&#12435;&#12393;&#12435;&#28187;&#12387;&#12390;&#12356;&#12367;&#29366;&#24907;&#12290;</p></li><li class="listitem"><p>&#23455;&#38555;&#12395;&#12399;&#20309;&#12418;&#12375;&#12394;&#12356;&#20154;&#12383;&#12385;&#12400;&#12363;&#12426;&#12364;&#22823;&#39442;&#12366;&#12375;&#12289;
            &#23455;&#38555;&#12395;&#21205;&#12367;&#12371;&#12392;&#12395;&#12394;&#12427;&#20154;&#12364;&#40665;&#12426;&#36796;&#12435;&#12384;&#12414;&#12414;&#12398;&#29366;&#24907;&#12290;</p></li><li class="listitem"><p>&#12399;&#12387;&#12365;&#12426;&#12392;&#12375;&#12383;&#25552;&#26696;&#12434;&#20986;&#12373;&#12394;&#12356;&#12414;&#12414;&#12289;
            &#22810;&#12367;&#12398;&#12450;&#12452;&#12487;&#12450;&#12364;&#35696;&#35542;&#12373;&#12428;&#12390;&#12356;&#12427;&#29366;&#24907;
            (&#12418;&#12385;&#12429;&#12435;&#12289;&#12393;&#12435;&#12394;&#33288;&#21619;&#28145;&#12356;&#12450;&#12452;&#12487;&#12450;&#12384;&#12387;&#12390;
            &#26368;&#21021;&#12399;&#12412;&#12435;&#12420;&#12426;&#12392;&#12375;&#12383;&#24819;&#20687;&#12363;&#12425;&#22987;&#12414;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
            &#12371;&#12371;&#12391;&#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#12381;&#12371;&#12363;&#12425;&#12393;&#12358;&#33192;&#12425;&#12414;&#12379;&#12427;&#12363;&#12391;&#12377;&#12290;
            &#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12399;&#12289;&#12412;&#12435;&#12420;&#12426;&#12392;&#12375;&#12383;&#31354;&#24819;&#12524;&#12505;&#12523;&#12398;&#12450;&#12452;&#12487;&#12450;&#12434;
            &#20855;&#20307;&#30340;&#12395;&#12414;&#12392;&#12417;&#12354;&#12370;&#12427;&#27969;&#12428;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12363;&#65311;
            &#12381;&#12428;&#12392;&#12418;&#12289;&#21029;&#12398;&#24819;&#20687;&#12420;&#38306;&#20418;&#12398;&#12394;&#12356;&#24819;&#20687;&#12394;&#12393;&#12398;
            &#12393;&#12358;&#12391;&#12418;&#12356;&#12356;&#12371;&#12392;&#12395;&#25391;&#12426;&#22238;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12363;&#65311;)</p></li></ul></div><p>
  &#12358;&#12414;&#12367;&#27231;&#33021;&#12375;&#12390;&#12356;&#12394;&#12356;&#12473;&#12524;&#12483;&#12489;&#12364;&#12377;&#12409;&#12390;&#28961;&#39364;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20013;&#12395;&#12399;&#37325;&#35201;&#12394;&#35441;&#38988;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12364;&#30427;&#12426;&#19978;&#12364;&#12387;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#33258;&#20307;&#12364;&#21839;&#38988;&#12391;&#12377;&#12290;
</p><p>
  &#12354;&#12414;&#12426;&#25276;&#12375;&#20184;&#12369;&#12364;&#12414;&#12375;&#12367;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12473;&#12524;&#12483;&#12489;&#12398;&#27969;&#12428;&#12434;&#12424;&#12356;&#26041;&#21521;&#12395;&#25345;&#12387;&#12390;&#12356;&#12367;&#12398;&#12399;&#12289;
  &#12354;&#12427;&#31278;&#12398;&#33464;&#34899;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;&#21336;&#12395;&#12300;&#28961;&#39364;&#12394;&#35441;&#12434;&#12377;&#12427;&#12398;&#12399;&#12420;&#12417;&#12424;&#12358;&#12301;&#12392;&#12363;
  &#12300;&#12418;&#12387;&#12392;&#21069;&#21521;&#12365;&#12394;&#12371;&#12392;&#12434;&#25237;&#31295;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12424;&#12358;&#12424;&#12301;&#12392;&#12363;&#35328;&#12358;&#12384;&#12369;&#12391;&#12399;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12425;&#12434;&#20491;&#20154;&#30340;&#12395;&#34892;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12385;&#12423;&#12387;&#12392;&#24375;&#12367;&#35328;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#25915;&#25731;&#30340;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;&#21069;&#12395;&#36914;&#12416;&#12383;&#12417;&#12395;&#12399;&#27425;&#12395;&#20309;&#12434;&#12377;&#12409;&#12365;&#12394;&#12398;&#12363;&#12434;&#25552;&#26696;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#26395;&#12416;&#32080;&#26524;&#12364;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12394;&#36947;&#31563;&#12434;
  (&#28961;&#29702;&#12420;&#12426;&#25351;&#31034;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#27969;&#12428;&#12395;&#12394;&#12427;&#12398;&#12434;&#36991;&#12369;&#12388;&#12388;)
  &#31034;&#12375;&#12390;&#12354;&#12370;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#25552;&#26696;&#12398;&#12424;&#12375;&#12354;&#12375;&#12434;&#21306;&#21029;&#12377;&#12427;&#12398;&#12399;&#12289;&#20027;&#12395;&#21475;&#35519;&#12398;&#21839;&#38988;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12371;&#12435;&#12394;&#12420;&#12426;&#26041;&#12399;&#12424;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
       &#12371;&#12428;&#20197;&#19978;&#35696;&#35542;&#12375;&#12390;&#12418;&#12289;&#21454;&#26463;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
       &#12392;&#12426;&#12354;&#12360;&#12378;&#12289;&#12384;&#12428;&#12363;&#12364;&#12371;&#12398;&#25552;&#26696;&#12434;&#23455;&#29694;&#12377;&#12427;&#12497;&#12483;&#12481;&#12434;&#26360;&#12367;&#12414;&#12391;&#12371;&#12398;&#35441;&#38988;&#12399;&#12420;&#12417;&#12427;&#12371;&#12392;&#12395;&#12375;&#12414;&#12379;&#12435;&#12363;&#65311;
       &#21516;&#12376;&#35696;&#35542;&#12434;&#20309;&#24230;&#12418;&#32368;&#12426;&#36820;&#12377;&#12394;&#12435;&#12390;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
       &#12372;&#12385;&#12419;&#12372;&#12385;&#12419;&#35328;&#12358;&#12424;&#12426;&#12289;&#32080;&#23616;&#12399;&#12467;&#12540;&#12489;&#12391;&#12375;&#12423;&#65311;
     </em></span></p></blockquote></div><p>
  &#12381;&#12428;&#12424;&#12426;&#12399;&#12289;&#12371;&#12385;&#12425;&#12398;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
       &#12356;&#12367;&#12388;&#12363;&#12398;&#25552;&#26696;&#12399;&#12354;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;&#32080;&#23616;&#12393;&#12428;&#12418;&#12358;&#12414;&#12367;&#33192;&#12425;&#12414;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12378;&#12289;
       &#22810;&#25968;&#27770;&#12434;&#12392;&#12427;&#27573;&#38542;&#12414;&#12391;&#12399;&#12356;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
       &#12414;&#12383;&#12289;&#20170;&#12420;&#26032;&#12375;&#12356;&#24847;&#35211;&#12418;&#20986;&#12390;&#12371;&#12394;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#21336;&#12395;&#12371;&#12428;&#12414;&#12391;&#12398;&#35696;&#35542;&#12434;&#32368;&#12426;&#36820;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
       &#20170;&#31169;&#12383;&#12385;&#12395;&#24517;&#35201;&#12394;&#12398;&#12399;&#12289;&#12371;&#12398;&#25552;&#26696;&#12395;&#38306;&#12377;&#12427;&#23436;&#20840;&#12394;&#20181;&#27096;&#12363;
       &#12354;&#12427;&#12356;&#12399;&#12497;&#12483;&#12481;&#12434;&#21547;&#12416;&#25237;&#31295;&#12391;&#12375;&#12423;&#12358;&#12397;&#12290;&#12381;&#12358;&#12377;&#12428;&#12400;&#12289;
       &#23569;&#12394;&#12367;&#12392;&#12418;&#12394;&#12435;&#12425;&#12363;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;
       (&#12381;&#12398;&#20181;&#27096;&#12395;&#12388;&#12356;&#12390;&#21512;&#24847;&#12434;&#12392;&#12387;&#12383;&#12426;&#12497;&#12483;&#12481;&#12434;&#12486;&#12473;&#12488;&#12375;&#12383;&#12426;)
       &#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
     </em></span></p></blockquote></div><p>
  &#24460;&#32773;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#26368;&#21021;&#12398;&#12418;&#12398;&#12392;&#27604;&#12409;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#26368;&#21021;&#12398;&#12411;&#12358;&#12399;&#12300;&#31169;&#12301;&#12392;&#12300;&#12381;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12301;&#12398;&#38291;&#12395;&#19968;&#32218;&#12364;&#24341;&#12363;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#24460;&#12398;&#12411;&#12358;&#12399;&#36949;&#12356;&#12414;&#12377;&#12290;&#12415;&#12435;&#12394;&#12434;&#12358;&#12414;&#12367;&#35696;&#35542;&#12395;&#24059;&#12365;&#36796;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#35696;&#35542;&#12395;&#26368;&#21021;&#12363;&#12425;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12383;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#20418;&#12394;&#12367;&#12289;
  &#20027;&#35486;&#12434;&#12300;&#31169;&#12383;&#12385;&#12301;&#12392;&#12377;&#12427;&#12371;&#12392;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;
  &#12381;&#12428;&#12414;&#12391;&#12473;&#12524;&#12483;&#12489;&#12434;&#12415;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#20309;&#12418;&#30330;&#35328;&#12375;&#12394;&#12363;&#12387;&#12383;&#20154;&#12383;&#12385;&#12395;&#23550;&#12375;&#12390;&#12418;
  &#12300;&#12415;&#12435;&#12394;&#12395;&#12363;&#12363;&#12431;&#12427;&#35441;&#12394;&#12435;&#12384;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#30906;&#35469;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12473;&#12524;&#12483;&#12489;&#12364;&#29038;&#35440;&#12414;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#21407;&#22240;&#12395;&#12388;&#12356;&#12390;&#12399;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#35504;&#12363;&#12434;&#12398;&#12398;&#12375;&#12387;&#12383;&#12426;&#33258;&#20998;&#12398;&#24847;&#35211;&#12434;&#25276;&#12375;&#20184;&#12369;&#12383;&#12426;&#12399;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#28129;&#12293;&#12392;&#20107;&#23455;&#12434;&#36848;&#12409;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#26368;&#12418;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#21069;&#21521;&#12365;&#12395;&#36914;&#12417;&#12427;&#12383;&#12417;&#12395;&#27425;&#12395;&#34892;&#12358;&#12409;&#12365;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12427;&#28857;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12383;&#12384;&#21336;&#12395;&#35696;&#35542;&#12434;&#25171;&#12385;&#20999;&#12425;&#12379;&#12427;
  (&#12381;&#12435;&#12394;&#21046;&#38480;&#12434;&#12375;&#12390;&#12418;&#12289;&#12384;&#12428;&#12418;&#23432;&#12387;&#12390;&#12367;&#12428;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;)
  &#12398;&#12391;&#12399;&#12394;&#12367;&#12424;&#12426;&#24314;&#35373;&#30340;&#12394;&#26041;&#21521;&#12395;&#20250;&#35441;&#12434;&#25345;&#12387;&#12390;&#12356;&#12371;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#12418;&#12387;&#12392;&#33192;&#12425;&#12414;&#12379;&#12383;&#12356;&#12392;&#12356;&#12387;&#12383;&#29366;&#27841;&#12400;&#12363;&#12426;&#12391;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26178;&#12395;&#12399;&#12289;&#12371;&#12435;&#12394;&#12473;&#12524;&#12483;&#12489;&#12399;&#12373;&#12387;&#12373;&#12392;&#25171;&#12385;&#20999;&#12387;&#12390;&#12375;&#12414;&#12356;&#12383;&#12356;&#12392;&#24605;&#12358;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12395;&#12399;&#12289;&#12473;&#12524;&#12483;&#12489;&#12434;&#32066;&#20102;&#12373;&#12379;&#12427;&#12383;&#12417;&#12398;&#25237;&#31295;&#12434;&#12375;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12364;&#26082;&#12395;&#12415;&#12435;&#12394;&#12395;&#24536;&#12428;&#21435;&#12425;&#12428;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12394;&#12425;&#12289;
  &#12354;&#12394;&#12383;&#12364;&#25237;&#31295;&#12377;&#12427;&#12384;&#12369;&#12391;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12399;&#20107;&#23455;&#19978;&#32066;&#20102;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12473;&#12524;&#12483;&#12489;&#12434;&#25171;&#12385;&#20999;&#12427;&#12383;&#12417;&#12398;&#23436;&#29863;&#12394;&#26041;&#27861;&#12394;&#12435;&#12390;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#12381;&#12435;&#12394;&#12398;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#20351;&#12356;&#12383;&#12356;&#12392;&#12399;&#24605;&#12431;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12300;&#20309;&#12363;&#30446;&#12395;&#35211;&#12360;&#12427;&#25104;&#26524;&#12434;&#20986;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12391;&#12394;&#12369;&#12428;&#12400;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#32066;&#20102;&#12375;&#12414;&#12377;&#12301;&#12392;&#12362;&#39000;&#12356;&#12377;&#12427;&#12392;&#12289;&#12358;&#12414;&#12367;&#12356;&#12367;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12384;&#12289;&#12473;&#12524;&#12483;&#12489;&#12434;&#32066;&#20102;&#12373;&#12379;&#12427;&#12398;&#12399;&#21313;&#20998;&#12395;&#32771;&#12360;&#12383;&#24460;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#35441;&#38988;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#38609;&#35527;&#12398;&#20013;&#12363;&#12425;&#29983;&#29987;&#30340;&#12394;&#20869;&#23481;&#12395;&#30330;&#23637;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12414;&#12426;&#12395;&#25305;&#36895;&#12395;&#25171;&#12385;&#20999;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#12354;&#12394;&#12383;&#12399;&#12379;&#12387;&#12363;&#12385;&#12394;&#20154;&#12392;&#24605;&#12431;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12393;&#12435;&#12394;&#12473;&#12524;&#12483;&#12489;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#12377;&#12368;&#12395;&#32066;&#20102;&#12377;&#12427;&#12392;&#12399;&#26399;&#24453;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#25237;&#31295;&#12375;&#12383;&#24460;&#12395;&#12418;&#12289;&#12362;&#12381;&#12425;&#12367;&#12356;&#12367;&#12388;&#12363;&#12398;&#25237;&#31295;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#12513;&#12540;&#12523;&#12364;&#12414;&#12384;&#23626;&#12356;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12426;&#12289;&#12354;&#12427;&#12356;&#12399;&#12356;&#12431;&#12422;&#12427;
  &#12300;&#26368;&#24460;&#12395;&#12402;&#12392;&#12371;&#12392;&#12301;&#12364;&#35328;&#12356;&#12383;&#12363;&#12387;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#20154;&#12383;&#12385;&#12395;&#12424;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#24515;&#37197;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12377;&#12375;&#12289;&#20808;&#12411;&#12393;&#12398;&#25237;&#31295;&#12434;&#32368;&#12426;&#36820;&#12377;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12473;&#12524;&#12483;&#12489;&#12364;&#21454;&#26463;&#12377;&#12427; (&#12354;&#12427;&#12356;&#12399;&#12373;&#12425;&#12395;&#33192;&#12425;&#12435;&#12391;&#12356;&#12367;) &#12398;&#12434;&#40665;&#12387;&#12390;&#35211;&#23432;&#12387;&#12390;&#12356;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#23436;&#20840;&#12395;&#12473;&#12524;&#12483;&#12489;&#12434;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12394;&#12435;&#12390;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12384;&#12289;&#12354;&#12394;&#12383;&#12399;&#22810;&#12367;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#20309;&#12425;&#12363;&#12398;&#21177;&#26524;&#12434;&#21450;&#12412;&#12379;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;"><div class="titlepage"><div><div><h3 class="title"><a name="bikeshed"></a>&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;</h3></div></div></div><p>
  &#12393;&#12435;&#12394;&#35696;&#38988;&#12391;&#12354;&#12387;&#12390;&#12418;&#35696;&#35542;&#12399;&#32006;&#20313;&#26354;&#25240;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#25216;&#34899;&#30340;&#12394;&#38627;&#24230;&#12364;&#20302;&#12356;&#35441;&#38988;&#12395;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;
  &#35696;&#35542;&#12364;&#30330;&#25955;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12364;&#12426;&#12414;&#12377;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#25216;&#34899;&#30340;&#12394;&#38627;&#24230;&#12364;&#39640;&#12356;&#35441;&#38988;&#12395;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;
  &#12381;&#12398;&#35441;&#38988;&#12395;&#12388;&#12356;&#12390;&#12356;&#12369;&#12427;&#20154;&#12398;&#25968;&#12364;&#23569;&#12394;&#12367;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#35441;&#38988;&#12395;&#12388;&#12356;&#12390;&#12356;&#12369;&#12427;&#20154;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#12383;&#12356;&#12390;&#12356;&#12399;&#38263;&#24180;&#32076;&#39443;&#12434;&#31309;&#12435;&#12384;&#38283;&#30330;&#32773;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12371;&#12428;&#12414;&#12391;&#12395;&#20309;&#24230;&#12392;&#12394;&#12367;&#12381;&#12398;&#12424;&#12358;&#12394;&#35696;&#35542;&#12395;&#21442;&#21152;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#20840;&#21729;&#12364;&#32013;&#24471;&#12398;&#12356;&#12367;&#21512;&#24847;&#12434;&#24471;&#12427;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12289;&#21512;&#24847;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#26368;&#12418;&#38627;&#12375;&#12356;&#12398;&#12399;&#12289;
  &#35504;&#12395;&#12391;&#12418;&#12431;&#12363;&#12427; (&#35504;&#12391;&#12418;&#24847;&#35211;&#12364;&#35328;&#12360;&#12427;) &#12524;&#12505;&#12523;&#12398;&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#21516;&#27096;&#12395;&#12289;&#32068;&#32340;&#35542;&#12420;&#24195;&#22577;&#27963;&#21205;&#12289;&#36039;&#37329;&#35519;&#36948;&#12394;&#12393;&#12398; "&#12420;&#12431;&#12425;&#12363;&#12417;"
  &#12394;&#35441;&#38988;&#12418;&#21512;&#24847;&#12434;&#24471;&#12395;&#12367;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#35441;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#20154;&#12399;&#12356;&#12388;&#12391;&#12418;&#27671;&#12398;&#28168;&#12416;&#12414;&#12391;&#35696;&#35542;&#12395;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#35696;&#35542;&#12395;&#21442;&#21152;&#12377;&#12427;&#12383;&#12417;&#12398;&#21069;&#25552;&#26465;&#20214;&#12418;&#12394;&#12369;&#12428;&#12400;
  &#20309;&#12364;&#27491;&#12375;&#12367;&#12390;&#20309;&#12364;&#38291;&#36949;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434; (&#24460;&#12395;&#12394;&#12387;&#12390;&#12418;) &#27770;&#12417;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12394;&#12356;&#12289;
  &#12381;&#12375;&#12390;&#12289;&#20182;&#20154;&#12398;&#24847;&#35211;&#12434;&#32862;&#12356;&#12390;&#12363;&#12425;&#12300;&#24460;&#20986;&#12375;&#12301;&#12391;&#35696;&#35542;&#12395;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#35696;&#35542;&#12398;&#37327;&#12392;&#35441;&#38988;&#12398;&#35079;&#38609;&#12373;&#12364;&#21453;&#27604;&#20363;&#12377;&#12427;&#12392;&#12356;&#12358;&#21407;&#21063;&#12399;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12362;&#12426;&#12289;&#20439;&#12395;
  <em class="firstterm">Bikeshed Effect (&#33258;&#36578;&#36554;&#32622;&#22580;&#21177;&#26524;)</em> &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12289;Poul-Henning Kamp &#12395;&#12424;&#12427;&#35500;&#26126;&#12434;&#35211;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12392;&#12418;&#12392;&#12399; BSD &#38283;&#30330;&#32773;&#21521;&#12369;&#12395;&#25237;&#31295;&#12373;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;&#20170;&#12420;&#36229;&#26377;&#21517;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
  &#35441;&#12379;&#12400;&#38263;&#12367;&#12394;&#12427;&#26132;&#35441;&#12384;&#12369;&#12393;&#12289;&#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12399;&#21336;&#32020;&#12394;&#35441;&#12384;&#12290;C&#12539;&#12494;&#12540;&#12473;&#12467;&#12540;&#12488;&#12539;
  &#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12364; 1960 &#24180;&#20195;&#21021;&#26399;&#12395;&#26360;&#12356;&#12383;&#12300;&#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12398;&#27861;&#21063;&#12301;&#12392;&#12356;&#12358;&#26412;&#12364;&#12354;&#12387;&#12390;&#12289;
  &#12381;&#12371;&#12395;&#12399;&#12418;&#12398;&#12372;&#12392;&#12398;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#12373;&#12414;&#12374;&#12414;&#12394;&#27934;&#23519;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12383;&#12435;&#12384;&#12290;
</p><p>[...]</p><p>
  &#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#20363;&#12395;&#12391;&#12390;&#12367;&#12427;&#12418;&#12358;&#19968;&#26041;&#12398;&#24441;&#32773;&#12364;&#12289;&#21407;&#23376;&#28809;&#12384;&#12290;&#12394;&#12435;&#12384;&#12363;&#12289;
  &#12356;&#12363;&#12395;&#12418;&#26178;&#20195;&#12434;&#24863;&#12376;&#12373;&#12379;&#12427;&#12394;&#12353;&#12290;
</p><p>
  &#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12399;&#12289;&#22996;&#21729;&#20250;&#12395;&#20055;&#12426;&#36796;&#12435;&#12391;&#25968;&#30334;&#19975;&#12363;&#12425;&#25968;&#20740;&#12489;&#12523;&#12418;&#12398;&#21407;&#23376;&#28809;&#24314;&#35373;&#35336;&#30011;&#12434;&#25215;&#35469;&#12373;&#12379;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12390;&#12356;&#12427;&#12290;
  &#12375;&#12363;&#12375;&#12289;
  &#21407;&#23376;&#28809;&#12391;&#12399;&#12394;&#12367;&#33258;&#36578;&#36554;&#32622;&#22580;&#12434;&#20316;&#12426;&#12383;&#12356;&#12392;&#24605;&#12387;&#12383;&#12425;&#32066;&#12431;&#12426;&#12398;&#12394;&#12356;&#35696;&#35542;&#12395;&#24059;&#12365;&#36796;&#12414;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12384;&#12429;&#12358;&#12392;&#12418;&#35328;&#12387;&#12390;&#12356;&#12427;&#12290;
</p><p>
  &#12497;&#12540;&#12461;&#12531;&#12477;&#12531;&#12395;&#12424;&#12427;&#12392;&#12289;&#21407;&#23376;&#28809;&#12399;&#12354;&#12414;&#12426;&#12395;&#24040;&#22823;&#12391;&#39640;&#20385;&#12381;&#12375;&#12390;&#35079;&#38609;&#12391;&#12354;&#12427;&#12383;&#12417;&#12395;
  &#12415;&#12435;&#12394;&#12364;&#12381;&#12398;&#20869;&#23481;&#12434;&#25226;&#25569;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12290;&#32771;&#12360;&#12424;&#12358;&#12392;&#12418;&#12379;&#12378;&#12395;&#24605;&#32771;&#20572;&#27490;&#12375;&#12390;&#12375;&#12414;&#12356;&#12289;
  &#12300;&#12414;&#12353;&#12371;&#12371;&#12414;&#12391;&#26469;&#12427;&#21069;&#12395;&#35504;&#12363;&#20182;&#12398;&#20154;&#12364;&#19968;&#37096;&#22987;&#32066;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12383;&#12384;&#12429;&#12358;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12290;&#12522;&#12481;&#12515;&#12540;&#12488;&#12539;P&#12539;&#12501;&#12449;&#12452;&#12531;&#12510;&#12531;&#12398;&#33879;&#26360;&#12395;&#12399;&#12289;
  &#12371;&#12428;&#12395;&#38306;&#36899;&#12377;&#12427;&#12525;&#12473;&#12539;&#12450;&#12521;&#12514;&#12473;&#12391;&#12398;&#33288;&#21619;&#28145;&#12356;&#20107;&#20363;&#12364;&#12356;&#12367;&#12388;&#12363;&#32057;&#20171;&#12373;&#12428;&#12390;&#12356;&#12427;&#12290;
</p><p>
  &#12373;&#12353;&#19968;&#26041;&#33258;&#36578;&#36554;&#32622;&#22580;&#12384;&#12290;&#36913;&#26411;&#12434;&#12388;&#12406;&#12379;&#12400;&#12384;&#12428;&#12391;&#12418;&#20316;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
  &#20313;&#12387;&#12383;&#26178;&#38291;&#12395;&#12486;&#12524;&#12499;&#12391;&#35430;&#21512;&#12434;&#35211;&#12390;&#27005;&#12375;&#12416;&#12371;&#12392;&#12373;&#12360;&#12391;&#12365;&#12427;&#12384;&#12429;&#12358;&#12290;
  &#12393;&#12435;&#12394;&#12395;&#29992;&#24847;&#21608;&#21040;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12393;&#12435;&#12394;&#12395;&#22949;&#24403;&#12394;&#25552;&#26696;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12384;&#12428;&#12363;&#12364;&#27231;&#20250;&#12434;&#12392;&#12425;&#12360;&#12390;&#12399;&#12289;
  &#33258;&#20998;&#12418;&#12394;&#12395;&#12363;&#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12383;&#12426;&#12289;&#33258;&#20998;&#12418;&#12381;&#12428;&#12395;&#27880;&#30446;&#12375;&#12390;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12383;&#12426;&#12289;
  &#12300;&#20474;&#12434;&#24536;&#12428;&#12427;&#12394;&#12301;&#12392;&#35328;&#12387;&#12383;&#12426;&#12377;&#12427;&#12384;&#12429;&#12358;&#12290;
</p><p>
  &#12487;&#12531;&#12510;&#12540;&#12463;&#12391;&#12399;&#12289;&#12371;&#12358;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#12300;&#25351;&#32011;&#12434;&#12388;&#12369;&#12427;&#12301;&#12387;&#12390;&#35328;&#12358;&#12435;&#12384;&#12290;
  &#20491;&#20154;&#30340;&#12394;&#12503;&#12521;&#12452;&#12489;&#12420;&#35211;&#26628;&#12398;&#12383;&#12417;&#12395;&#20309;&#12363;&#12434;&#12375;&#12390;&#12289;&#12354;&#12392;&#12363;&#12425;&#12381;&#12398;&#35388;&#25312;&#12434;&#35211;&#12379;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12290;
  &#12300;&#12411;&#12425;&#35211;&#12429;&#12424;&#12290;&#12371;&#12428;&#12289;<span class="emphasis"><em>&#20474;</em></span>&#12364;&#12420;&#12387;&#12383;&#12435;&#12384;&#12301;&#12390;&#12394;&#20855;&#21512;&#12395;&#12397;&#12290;
  &#25919;&#27835;&#23478;&#12393;&#12418;&#12398;&#12424;&#12367;&#12420;&#12426;&#12381;&#12358;&#12394;&#12371;&#12392;&#12391;&#12418;&#12354;&#12427;&#12364;&#12289;&#19968;&#33324;&#20154;&#12384;&#12387;&#12390;&#27231;&#20250;&#12364;&#12354;&#12428;&#12400;&#12420;&#12426;&#12381;&#12358;&#12384;&#12424;&#12290;&#12411;&#12425;&#12289;
  &#12424;&#12367;&#29983;&#20094;&#12365;&#12398;&#12475;&#12513;&#12531;&#12488;&#12395;&#36275;&#36321;&#12364;&#12388;&#12356;&#12390;&#12383;&#12426;&#12377;&#12427;&#12384;&#12429;&#12358;&#65311;
</p></blockquote></div><p>
  (&#24444;&#12398;&#25237;&#31295;&#12398;&#23436;&#20840;&#29256;&#12399;&#12363;&#12394;&#12426;&#38263;&#12367;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#19968;&#35501;&#12398;&#20385;&#20516;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;
  <a class="xref" href="bikeshed-full.html" title="&#20184;&#37682;D &#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;">&#20184;&#37682;D <i>&#12394;&#12435;&#12391;&#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#33394;&#12414;&#12391;&#27671;&#12395;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12398;&#65311;</i></a> &#12391;&#12372;&#30906;&#35469;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;
  <a class="ulink" href="http://bikeshed.com" target="_top">http://bikeshed.com</a> &#12418;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;)
</p><p>
  &#12371;&#12428;&#12414;&#12391;&#12395;&#12464;&#12523;&#12540;&#12503;&#12391;&#12398;&#35696;&#35542;&#12395;&#21442;&#21152;&#12375;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#20154;&#12394;&#12425;&#35504;&#12391;&#12418;
  Kamp &#12398;&#35328;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12424;&#12367;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#33258;&#36578;&#36554;&#32622;&#22580;&#12395;&#33394;&#12434;&#22615;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#36991;&#12369;&#12427;&#12424;&#12358;
  <span class="emphasis"><em>&#20840;&#21729;</em></span> &#12434;&#35500;&#24471;&#12377;&#12427;&#12398;&#12399;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#12391;&#12365;&#12427;&#12371;&#12392;&#12392;&#12356;&#12360;&#12400;&#12289;&#12381;&#12435;&#12394;&#29366;&#27841;&#12434;&#35211;&#12388;&#12369;&#12383;&#12392;&#12365;&#12395;
  &#12300;&#12371;&#12358;&#12356;&#12358;&#29366;&#24907;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12435;&#12376;&#12419;&#12394;&#12356;&#65311;&#12301;&#12392;&#25351;&#25688;&#12377;&#12427;&#12367;&#12425;&#12356;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#24433;&#38911;&#21147;&#12398;&#24375;&#12356;&#38283;&#30330;&#32773;&#12383;&#12385;&#12395;&#23550;&#12375;&#12390;
  &#12300;&#26089;&#12417;&#12395;&#31558;&#12434;&#12362;&#12429;&#12375;&#12390;&#12367;&#12428;&#12414;&#12379;&#12435;&#12363;&#65311;&#12301;&#12392;&#12362;&#39000;&#12356;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#24444;&#12425;&#12399;&#12494;&#12452;&#12474;&#12398;&#21407;&#22240;&#12392;&#12399;&#12394;&#12425;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#22615;&#35013;&#22823;&#20250;&#12434;&#23436;&#20840;&#12395;&#12420;&#12417;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25991;&#21270;&#12434;&#12358;&#12414;&#12367;&#32946;&#12390;&#12390;&#12356;&#12369;&#12400;&#12381;&#12435;&#12394;&#32701;&#30446;&#12395;&#12394;&#12427;&#38971;&#24230;&#12434;&#19979;&#12370;&#12427; 
  (&#12381;&#12375;&#12390;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12418;&#26089;&#12367;&#21454;&#26463;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;) &#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#23447;&#25945;&#35542;&#20105;&#12434;&#22238;&#36991;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="holy-wars"></a>&#23447;&#25945;&#35542;&#20105;&#12434;&#22238;&#36991;&#12377;&#12427;</h3></div></div></div><p>
  <em class="firstterm">&#23447;&#25945;&#35542;&#20105; (holy war: &#32854;&#25126;)</em> &#12392;&#12399;&#12354;&#12427;&#31278;&#12398;&#35542;&#20105;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#26178;&#12395;&#12399;&#35441;&#12375;&#21512;&#12356;&#12391;&#35299;&#27770;&#12391;&#12365;&#12394;&#12356;&#12411;&#12393;&#22823;&#12365;&#12394;&#21839;&#38988;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12362;&#20114;&#12356;&#12289;&#30456;&#25163;&#20596;&#12434;&#25171;&#12385;&#12398;&#12417;&#12377;&#12414;&#12391;&#35696;&#35542;&#12434;&#32154;&#12369;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#20808;&#12411;&#12393;&#12398;&#12356;&#12431;&#12422;&#12427;&#12300;&#33258;&#36578;&#36554;&#32622;&#22580;&#21839;&#38988;&#12301;&#12392;&#12399;&#22810;&#23569;&#30064;&#12394;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#33258;&#36578;&#36554;&#32622;&#22580;&#12398;&#35696;&#35542;&#12395;&#21152;&#12431;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;&#12289;&#20808;&#12434;&#31478;&#12387;&#12390;&#33258;&#20998;&#12398;&#24847;&#35211;&#12434;&#34920;&#26126;&#12375;&#12414;&#12377;
  (&#12384;&#12387;&#12390;&#31777;&#21336;&#12395;&#24847;&#35211;&#12434;&#35328;&#12360;&#12427;&#12363;&#12425;)&#12290;
  &#12391;&#12418;&#12289;&#24444;&#12425;&#12399;&#24517;&#12378;&#12375;&#12418;&#12381;&#12428;&#12434;&#24375;&#12367;&#20027;&#24373;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26178;&#12395;&#12399;&#30456;&#25163;&#12398;&#24847;&#35211;&#12395;&#29702;&#35299;&#12434;&#31034;&#12377;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12300;&#23447;&#25945;&#35542;&#20105;&#12301;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#30456;&#25163;&#12398;&#24847;&#35211;&#12395;&#32819;&#12434;&#20670;&#12369;&#12383;&#26178;&#28857;&#12391;&#36000;&#12369;&#12391;&#12377;&#12290;
  &#12415;&#12435;&#12394;&#12300;&#27491;&#35299;&#12399;&#12383;&#12387;&#12383;&#12402;&#12392;&#12388;&#12391;&#12354;&#12427;&#12301;&#12392;&#12356;&#12358;&#28857;&#12391;&#12399;&#21512;&#24847;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#12383;&#12384;&#12300;&#27491;&#35299;&#12364;&#12393;&#12428;&#12363;&#12301;&#12392;&#12356;&#12358;&#28857;&#12391;&#20105;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12356;&#12387;&#12383;&#12435;&#23447;&#25945;&#35542;&#20105;&#12364;&#22987;&#12414;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#12289;
  &#12415;&#12435;&#12394;&#12364;&#28288;&#36275;&#12377;&#12427;&#12424;&#12358;&#12394;&#12363;&#12383;&#12385;&#12391;&#12381;&#12428;&#12434;&#21454;&#26463;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#28814;&#19978;&#12375;&#12390;&#12356;&#12427;&#30495;&#12387;&#21482;&#20013;&#12391;&#12300;&#12371;&#12428;&#12387;&#12390;&#23447;&#25945;&#35542;&#20105;&#12376;&#12419;&#12394;&#12356;&#65311;&#12301;
  &#12392;&#25351;&#25688;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12289;&#12415;&#12435;&#12394;&#12392;&#12387;&#12367;&#12395;&#30693;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12394;&#12435;&#12384;&#12363;&#12425;&#12290;
  &#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#12289;&#23447;&#25945;&#35542;&#20105;&#12398;&#22810;&#12367;&#12399;
  &#12300;&#12371;&#12398;&#21839;&#38988;&#12399;&#35441;&#12375;&#21512;&#12356;&#12434;&#32154;&#12369;&#12428;&#12400;&#35299;&#27770;&#12391;&#12365;&#12427;&#12398;&#12363;&#12301;
  &#12392;&#12356;&#12358;&#28857;&#12395;&#23550;&#12375;&#12390;&#12418;&#24847;&#35211;&#12398;&#23550;&#31435;&#12364;&#30330;&#29983;&#12377;&#12427;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#31532;&#19977;&#32773;&#12363;&#12425;&#12415;&#12428;&#12400;&#12289;&#12393;&#12385;&#12425;&#20596;&#12418;&#30456;&#25163;&#12434;&#35500;&#24471;&#12391;&#12365;&#12381;&#12358;&#12395;&#12394;&#12356;&#12398;&#12399;&#26126;&#12425;&#12363;&#12391;&#12377;&#12290;
  &#24403;&#20107;&#32773;&#12383;&#12385;&#12399;&#12300;&#30456;&#25163;&#20596;&#12399;&#20309;&#12418;&#12431;&#12363;&#12387;&#12385;&#12419;&#12356;&#12394;&#12356;&#12290;
  &#12358;&#12414;&#12367;&#35500;&#24471;&#12377;&#12428;&#12400;&#12365;&#12387;&#12392;&#31169;&#12383;&#12385;&#12398;&#32771;&#12360;&#12434;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12427;&#12384;&#12429;&#12358;&#12301;&#12392;&#12362;&#20114;&#12356;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#31169;&#12399;&#12300;&#12371;&#12435;&#12394;&#20105;&#12356;&#12395;&#12399;&#27491;&#35299;&#12394;&#12435;&#12390;&#12394;&#12356;&#12301;&#12392;&#12399; <span class="emphasis"><em>&#35328;&#12356;&#12414;&#12379;&#12435;</em></span>&#12290;
  &#26178;&#12395;&#12399;&#27491;&#35299;&#12364;&#12354;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#31169;&#12418;&#36942;&#21435;&#12395;&#20309;&#24230;&#12363;&#23447;&#25945;&#35542;&#20105;&#12395;&#24059;&#12365;&#36796;&#12414;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#12381;&#12398;&#12392;&#12365;&#12399;&#12356;&#12388;&#12418;&#31169;&#12383;&#12385;&#12398;&#12411;&#12358;&#12364;&#27491;&#35542;&#12391;&#12375;&#12383;&#12290;
  &#12392;&#12399;&#12356;&#12360;&#12289;&#12381;&#12435;&#12394;&#12398;&#12399;&#12393;&#12358;&#12391;&#12418;&#12356;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12393;&#12385;&#12425;&#12364;&#27491;&#12375;&#12356;&#12398;&#12363;&#12434;&#32013;&#24471;&#12356;&#12367;&#12424;&#12358;&#12395;&#35500;&#26126;&#12377;&#12427;&#26041;&#27861;&#12394;&#12435;&#12390;&#12394;&#12356;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
</p><p>
  &#23447;&#25945;&#35542;&#20105;&#12434;&#35299;&#27770;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12420;&#12426;&#12364;&#12385;&#12394;&#12371;&#12392;&#12399;
  &#12300;&#12371;&#12435;&#12394;&#12371;&#12392;&#12434;&#12356;&#12388;&#12414;&#12391;&#12418;&#32154;&#12369;&#12390;&#12356;&#12390;&#12418;&#26178;&#38291;&#12398;&#12512;&#12480;&#12376;&#12419;&#12394;&#12356;&#12363;&#65281;
  &#12418;&#12358;&#12356;&#12356;&#21152;&#28187;&#12420;&#12417;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#65311;&#12301;
  &#12392;&#35328;&#12358;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;&#12371;&#12428;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12420;&#12426;&#12363;&#12383;&#12395;&#12399; 2 &#12388;&#12398;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12371;&#12428;&#12414;&#12391;&#35696;&#35542;&#12395;&#36027;&#12420;&#12375;&#12390;&#12365;&#12383;&#26178;&#38291;&#12420;&#27671;&#21147;&#12399;&#21462;&#12426;&#25147;&#12379;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12356;&#12414;&#22823;&#20107;&#12394;&#12398;&#12399;&#12300;&#12354;&#12392;&#12393;&#12428;&#12384;&#12369;&#35696;&#35542;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12363;&#65311;&#12301;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12300;&#12418;&#12358;&#12385;&#12423;&#12387;&#12392;&#35441;&#12434;&#12377;&#12428;&#12400;&#35299;&#27770;&#12391;&#12365;&#12381;&#12358;&#12384;&#12301;&#12392;&#24863;&#12376;&#12390;&#12356;&#12427;&#20154;&#12364;&#20309;&#20154;&#12363;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  (&#23569;&#12394;&#12367;&#12392;&#12418;&#24444;&#12425;&#12398;&#35222;&#28857;&#12363;&#12425;&#12399;) &#35696;&#35542;&#12434;&#32154;&#12369;&#12427;&#12398;&#12399;&#29702;&#12395;&#12363;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#21839;&#38988;&#12399;&#12289;
  &#12381;&#12371;&#12391;&#35696;&#35542;&#12434;&#12420;&#12417;&#12390;&#12375;&#12414;&#12358; (&#29694;&#29366;&#32173;&#25345;&#12392;&#12377;&#12427;) &#12371;&#12392;&#12364;&#12289;
  &#12393;&#12385;&#12425;&#12363;&#19968;&#26041;&#12395;&#20107;&#23455;&#19978;&#12398;&#21213;&#21033;&#23459;&#35328;&#12434;&#12377;&#12427;&#12398;&#12395;&#31561;&#12375;&#12356;&#12371;&#12392;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#26178;&#12395;&#12399;&#12300;&#12392;&#12395;&#12363;&#12367;&#29694;&#29366;&#12434;&#12393;&#12358;&#12395;&#12363;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#28857;&#12391;&#12399;&#21512;&#24847;&#12375;&#12390;&#12356;&#12427;&#12364;
  &#12300;&#12393;&#12398;&#12424;&#12358;&#12395;&#22793;&#12360;&#12427;&#12398;&#12363;&#12301;&#12391;&#20105;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#35696;&#35542;&#12434;&#25171;&#12385;&#20999;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#35504;&#12398;&#24471;&#12395;&#12418;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12371;&#12392;&#12399;&#12415;&#12435;&#12394;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12371;&#12398;&#22580;&#21512;&#12399;&#35696;&#35542;&#12434;&#32154;&#12369;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12376;&#12419;&#12354;&#12289;&#12356;&#12387;&#12383;&#12356;&#12393;&#12398;&#12424;&#12358;&#12395;&#20966;&#29702;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;
</p><p>
  &#12414;&#12378;&#35328;&#12360;&#12427;&#12371;&#12392;&#12399;&#12289;&#12381;&#12435;&#12394;&#35696;&#35542;&#12364;&#36215;&#12371;&#12426;&#12360;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#30342;&#12373;&#12435;&#12364;&#24605;&#12387;&#12390;&#12356;&#12427;&#12411;&#12393;&#38627;&#12375;&#12356;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#23447;&#25945;&#35542;&#20105;&#12395;&#12394;&#12426;&#12364;&#12385;&#12394;&#12493;&#12479;&#12399;&#12289;&#12384;&#12356;&#12383;&#12356;&#20104;&#24819;&#12364;&#12388;&#12365;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12395;&#12388;&#12356;&#12390;&#12384;&#12387;&#12383;&#12426;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#12388;&#12356;&#12390;&#12384;&#12387;&#12383;&#12426;
  (<span><a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a></span> &#12398;
  <a class="xref" href="license-compatibility.html" title="GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;">&#12300;GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12289;
  &#12354;&#12427;&#12356;&#12399; reply-to &#12398;&#20966;&#29702;&#12395;&#12388;&#12356;&#12390;&#12384;&#12387;&#12383;&#12426;
  (<span> in <a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="mailing-lists.html#reply-to" title="Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;">&#12300;Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;) &#12394;&#12393;&#12391;&#12377;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#19968;&#24230;&#12420;&#20108;&#24230;&#12399;&#12371;&#12358;&#12356;&#12358;&#32076;&#39443;&#12434;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#38283;&#30330;&#32773;&#12383;&#12385;&#12398;&#32080;&#26463;&#12364;&#24613;&#36895;&#12395;&#28145;&#12414;&#12387;&#12383;&#12426;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#20105;&#12356;&#12434;&#12420;&#12417;&#12373;&#12379;&#12383;&#12426;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#34987;&#23475;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#25233;&#12360;&#12383;&#12426;&#12377;&#12427;&#12383;&#12417;&#12398;&#26041;&#27861;&#12399;&#12289;&#12393;&#12371;&#12395;&#34892;&#12387;&#12390;&#12418;&#21516;&#12376;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#33258;&#20998;&#20596;&#12398;&#24847;&#35211;&#12364;&#27491;&#12375;&#12356;&#12392;&#30906;&#20449;&#12375;&#12390;&#12356;&#12427;&#12398;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;
  <span class="emphasis"><em>&#12392;&#12426;&#12354;&#12360;&#12378;&#12399;</em></span> &#30456;&#25163;&#20596;&#12398;&#24847;&#35211;&#12395;&#12418;&#32819;&#12434;&#20670;&#12369;&#12289;
  &#29702;&#35299;&#12434;&#31034;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12371;&#12398;&#25163;&#12398;&#20105;&#12356;&#12391;&#12424;&#12367;&#12354;&#12427;&#21839;&#38988;&#12399;&#12289;
  &#12381;&#12428;&#12382;&#12428;&#12398;&#20596;&#12364;&#21487;&#33021;&#12394;&#38480;&#12426;&#25975;&#23621;&#12434;&#39640;&#12367;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;
  &#33258;&#20998;&#12383;&#12385;&#20197;&#22806;&#12398;&#32771;&#12360;&#12399;&#12415;&#12435;&#12394;&#12414;&#12387;&#12383;&#12367;&#12400;&#12363;&#12370;&#12390;&#12356;&#12427;&#12392;&#35328;&#12356;&#20999;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;&#30456;&#25163;&#20596;&#12434;&#35500;&#24471;&#12375;&#12383;&#12426;&#24847;&#35211;&#12434;&#22793;&#12360;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12377;&#12427;&#12398;&#12418;
  &#38627;&#12375;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#21336;&#12395;&#30456;&#25163;&#12395;&#12300;&#12414;&#12385;&#12364;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12301;
  &#12392;&#35469;&#12417;&#12373;&#12379;&#12427;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12300;<span class="emphasis"><em>&#24515;&#12363;&#12425;</em></span>
  &#12414;&#12385;&#12364;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#65281;&#12301;&#12392;&#35469;&#12417;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#30456;&#25163;&#20596;&#12395;&#35500;&#24471;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12418;&#12425;&#12356;&#12420;&#12377;&#12367;&#12377;&#12427;&#12395;&#12399;&#12289;
  &#12414;&#12378;&#12354;&#12394;&#12383;&#33258;&#36523;&#12398;&#30906;&#20449;&#12434;&#25276;&#12375;&#20184;&#12369;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#29694;&#22312;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#35696;&#35542;&#12398;&#20869;&#23481;&#12434;&#12365;&#12385;&#12435;&#12392;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#35500;&#24471;&#21147;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12392;&#12418;&#12363;&#12367;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#20998;&#21029;&#12399;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#30456;&#25163;&#12364;&#36820;&#20107;&#12434;&#36820;&#12377;&#20313;&#22320;&#12364;&#12354;&#12427;&#12424;&#12358;&#12394;&#24847;&#24605;&#34920;&#31034;&#12434;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#29366;&#27841;&#12399;&#25913;&#21892;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#32080;&#26524;&#12392;&#12375;&#12390;&#12354;&#12394;&#12383;&#12364;&#26395;&#12435;&#12391;&#12356;&#12383;&#12381;&#12398;&#12418;&#12398;&#12399;&#24471;&#12425;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22763;&#27671;&#12395;&#24433;&#38911;&#12434;&#21450;&#12412;&#12377;&#12424;&#12358;&#12394;&#24059;&#12365;&#28155;&#12360;&#34987;&#23475;&#12399;&#38450;&#12368;&#12367;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#23447;&#25945;&#35542;&#20105;&#12364;&#36991;&#12369;&#12425;&#12428;&#12394;&#12356;&#29366;&#27841;&#12395;&#12394;&#12387;&#12383;&#12425;&#12289;
  &#12354;&#12394;&#12383;&#12364;&#12393;&#12398;&#31243;&#24230;&#12381;&#12428;&#12395;&#12363;&#12363;&#12431;&#12427;&#12398;&#12363;&#12434;&#26089;&#12417;&#12395;&#27770;&#26029;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12394;&#12435;&#12384;&#12387;&#12383;&#12425;&#12289;&#12381;&#12398;&#25163;&#12398;&#35696;&#35542;&#12434;&#27491;&#24335;&#12395;&#25918;&#26820;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#30382;&#32905;&#12434;&#35328;&#12387;&#12383;&#12426;
  &#21453;&#23550;&#24847;&#35211;&#12395;&#23550;&#12375;&#12390;&#25448;&#12390;&#12476;&#12522;&#12501;&#12434;&#27531;&#12375;&#12383;&#12426;&#12379;&#12378;&#12395;
  &#12365;&#12428;&#12356;&#12395;&#23447;&#25945;&#35542;&#20105;&#12363;&#12425;&#36523;&#12434;&#24341;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#35696;&#35542;&#12434;&#25918;&#26820;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#28500;&#12367;&#34892;&#12358;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12395;&#38306;&#12377;&#12427;&#23447;&#25945;&#35542;&#20105;&#12399;&#12289;&#23569;&#12375;&#20107;&#24773;&#12364;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#24444;&#12425;&#12399;&#25216;&#34899;&#30340;&#12395;&#39640;&#12356;&#12524;&#12505;&#12523;&#12395;&#12354;&#12427;&#20154;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#22810;&#12367;&#12289;
  &#12414;&#12383;&#22810;&#12367;&#12398;&#20154;&#12364;&#20309;&#12425;&#12363;&#12398;&#24847;&#35211;&#12434;&#25345;&#12387;&#12390;&#12362;&#12426;&#12289;&#21033;&#23475;&#38306;&#20418;&#12364;&#38750;&#24120;&#12395;&#39640;&#12367;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#20105;&#12356;&#12398;&#32080;&#26524;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12377;&#12427;&#20027;&#35201;&#12394;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12364;&#27770;&#12414;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#19968;&#30058;&#12356;&#12356;&#26041;&#27861;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21021;&#26399;&#27573;&#38542;&#12398;&#12358;&#12385;&#12395;
  &#38283;&#30330;&#32773;&#38291;&#12391;&#35328;&#35486;&#12434;&#36984;&#25246;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12375;&#12390;
  &#12356;&#12387;&#12383;&#12435;&#27770;&#12417;&#12383;&#38283;&#30330;&#35328;&#35486;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12300;&#12381;&#12428;&#12364;&#20182;&#12398;&#35328;&#35486;&#12424;&#12426;&#20778;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12301;
  &#12392;&#12356;&#12358;&#29702;&#30001; <span class="emphasis"><em>&#12391;&#12399;&#12394;&#12367;</em></span>&#12289;
  &#12300;&#12381;&#12428;&#12364;&#12356;&#12385;&#12400;&#12435;&#26360;&#12365;&#24931;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12301;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#23432;&#12387;&#12390;&#12356;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#27770;&#12375;&#12390;&#12300;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12434;&#23398;&#34899;&#30340;&#12395;&#27604;&#36611;&#12377;&#12427;&#12301;&#12392;&#12356;&#12387;&#12383;&#26041;&#21521;&#12395;&#38501;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;
  (&#12394;&#12380;&#12384;&#12363;&#12424;&#12367;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#35504;&#12363;&#12364; Perl &#12434;&#25345;&#12385;&#20986;&#12375;&#12383;&#12392;&#12383;&#12435;&#12395;
  &#12371;&#12398;&#26041;&#21521;&#12395;&#35441;&#12364;&#36914;&#12416;&#12371;&#12392;&#12364;&#22810;&#12356;&#12424;&#12358;&#12391;&#12377;)&#12290;
  &#12371;&#12398;&#25163;&#12398;&#35441;&#38988;&#12399;&#12414;&#12387;&#12383;&#12367;&#28961;&#39364;&#12394;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;&#36991;&#12369;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#25163;&#12398;&#35696;&#35542;&#12395;&#38306;&#12377;&#12427;&#27508;&#21490;&#30340;&#12394;&#32972;&#26223;&#12395;&#12388;&#12356;&#12390;&#12399;
  <a class="ulink" href="http://catb.org/~esr/jargon/html/H/holy-wars.html" target="_top">http://catb.org/~esr/jargon/html/H/holy-wars.html</a>
  &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;&#12289;Danny Cohen &#12395;&#12424;&#12427;&#12424;&#12426;&#31777;&#21336;&#12394;&#35299;&#35500;&#12364;
  <a class="ulink" href="http://www.ietf.org/rfc/ien/ien137.txt" target="_top">http://www.ietf.org/rfc/ien/ien137.txt</a>
  &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title='"&#21475;&#12420;&#12363;&#12414;&#12375;&#12356;&#23569;&#25968;&#27966;" &#12395;&#12388;&#12356;&#12390;'><div class="titlepage"><div><div><h3 class="title"><a name="noisy-minority"></a>"&#21475;&#12420;&#12363;&#12414;&#12375;&#12356;&#23569;&#25968;&#27966;" &#12395;&#12388;&#12356;&#12390;</h3></div></div></div><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12398;&#35696;&#35542;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;
  &#23569;&#25968;&#27966;&#12398;&#24847;&#35211;&#12364;&#12356;&#12363;&#12395;&#12418;&#22823;&#12365;&#12394;&#30064;&#35696;&#12391;&#12354;&#12427;&#12424;&#12358;&#12395;&#35211;&#12379;&#12427;&#12371;&#12392;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
  &#38263;&#12293;&#12392;&#12375;&#12383;&#12513;&#12540;&#12523;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#22823;&#37327;&#12395;&#25237;&#31295;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#35696;&#20107;&#36914;&#34892;&#22952;&#23475;&#12392;&#20284;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#21453;&#23550;&#24847;&#35211;&#12364;&#22823;&#12365;&#12367;&#12394;&#12387;&#12390;&#12356;&#12427;&#12392;&#24605;&#12356;&#36796;&#12414;&#12379;&#12427;&#12371;&#12392;&#12395;&#12399;&#12424;&#12426;&#24375;&#21147;&#12394;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12354;&#12414;&#12426;&#12395;&#12383;&#12367;&#12373;&#12435;&#12398;&#24847;&#35211;&#12364;&#34892;&#12365;&#12363;&#12358;&#12392;
  &#12300;&#35504;&#12364;&#12356;&#12388;&#20309;&#12434;&#35328;&#12387;&#12383;&#12398;&#12363;&#12301;&#12434;&#36861;&#12356;&#12363;&#12369;&#12427;&#12398;&#12364;&#38754;&#20498;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12300;&#12424;&#12367;&#12431;&#12363;&#12425;&#12394;&#12356;&#12369;&#12393;&#12289;&#20309;&#12384;&#12363;&#37325;&#35201;&#12394;&#12371;&#12392;&#12434;&#35696;&#35542;&#12375;&#12390;&#12356;&#12427;&#12435;&#12384;&#12394;&#12301;
  &#12392;&#26412;&#33021;&#30340;&#12395;&#24863;&#12376;&#12289;&#39442;&#12366;&#12364;&#12362;&#12373;&#12414;&#12427;&#12414;&#12391;&#12375;&#12400;&#12425;&#12367;&#12362;&#12392;&#12394;&#12375;&#12367;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#22810;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12394;&#21177;&#26524;&#12434;&#12358;&#12385;&#28040;&#12377;&#26368;&#12418;&#12424;&#12356;&#26041;&#27861;&#12399;&#12289;&#20309;&#12425;&#12363;&#12398;&#35388;&#25312;&#12434;&#12418;&#12387;&#12390;
  &#12300;&#30064;&#35696;&#12434;&#30003;&#12375;&#31435;&#12390;&#12390;&#12356;&#12427;&#20154;&#12364;&#12393;&#12428;&#12384;&#12369;&#23569;&#25968;&#12391;&#12354;&#12427;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12301;
  &#12300;&#20182;&#12398;&#22823;&#21322;&#12398;&#20154;&#12383;&#12385;&#12364;&#21512;&#24847;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12301;
  &#12434;&#26126;&#30906;&#12395;&#25351;&#25688;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12424;&#12426;&#29366;&#27841;&#12434;&#26126;&#30906;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
  &#26126;&#30906;&#12395;&#24847;&#35211;&#12399;&#34920;&#26126;&#12375;&#12390;&#12356;&#12394;&#12356;&#12364;&#12362;&#12381;&#12425;&#12367;&#22810;&#25968;&#27966;&#12395;&#21512;&#24847;&#12377;&#12427;&#12391;&#12354;&#12429;&#12358;&#12392;&#24605;&#12431;&#12428;&#12427;&#20154;&#12383;&#12385;&#12395;
  &#20491;&#21029;&#12395;&#24847;&#35211;&#12434;&#32862;&#12356;&#12390;&#12415;&#12390;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21453;&#23550;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12364;&#33258;&#20998;&#12398;&#24847;&#35211;&#12434;&#25925;&#24847;&#12395;&#33192;&#12425;&#12414;&#12379;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;
  &#25351;&#25688;&#12377;&#12427;&#12398;&#12399;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;&#22810;&#20998;&#24444;&#12425;&#12399;&#12381;&#12435;&#12394;&#27671;&#25345;&#12385;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#24847;&#22259;&#30340;&#12395;&#12375;&#12390;&#12356;&#12427;&#12398;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12434;&#25351;&#25688;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#25126;&#30053;&#19978;&#12394;&#12435;&#12398;&#21033;&#28857;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12377;&#12409;&#12365;&#12371;&#12392;&#12399;&#12289;&#21336;&#12395;&#23455;&#25968;&#12434;&#27604;&#36611;&#12375;&#12390;&#31034;&#12377;&#12371;&#12392;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#20182;&#12398;&#20154;&#12383;&#12385;&#12399;&#33258;&#20998;&#12398;&#23455;&#24863;&#12392;&#12378;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12398;&#25163;&#27861;&#12399;&#12289;&#36059;&#25104;&#12363;&#21453;&#23550;&#12363;&#12364;&#12399;&#12387;&#12365;&#12426;&#12377;&#12427;&#12424;&#12358;&#12394;&#35696;&#35542;&#12395;&#38306;&#12375;&#12390;&#12399;&#36969;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#26041;&#27861;&#12364;&#12358;&#12414;&#12367;&#12356;&#12367;&#12398;&#12399;&#12289;&#35504;&#12363;&#12364;&#22823;&#39442;&#12366;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12398;
  &#22823;&#21322;&#12398;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12381;&#12428;&#12364;&#35696;&#35542;&#12377;&#12409;&#12365;&#21839;&#38988;&#12394;&#12398;&#12363;&#12393;&#12358;&#12363;&#21028;&#26029;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12387;&#12383;&#22580;&#21512;&#12391;&#12377;&#12290;
  &#35696;&#35542;&#12434;&#12375;&#12400;&#12425;&#12367;&#35211;&#12390;&#12356;&#12390;&#12289;&#12381;&#12428;&#12364;
  (&#12513;&#12540;&#12523;&#12398;&#25968;&#12398;&#12431;&#12426;&#12395;&#12399;) &#12354;&#12414;&#12426;&#20154;&#12293;&#12398;&#27671;&#12434;&#24341;&#12356;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;
  &#12393;&#12358;&#12391;&#12418;&#12356;&#12356;&#35696;&#35542;&#12391;&#12354;&#12427;&#12392;&#21028;&#26029;&#12375;&#12383;&#12425;&#12289;&#12381;&#12428;&#12434;&#12399;&#12387;&#12365;&#12426;&#12392;&#31034;&#12375;&#12390;&#12354;&#12370;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12356;&#12431;&#12422;&#12427; "&#21475;&#12358;&#12427;&#12373;&#12356;&#23569;&#25968;&#27966;" &#12364;&#30446;&#31435;&#12387;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#25237;&#31295;&#12364;&#19968;&#26381;&#12398;&#28165;&#28092;&#21092;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12435;&#12394;&#22580;&#21512;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#12385;&#12423;&#12387;&#12392;&#33853;&#12385;&#36796;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;&#12300;&#12394;&#12435;&#12390;&#12371;&#12387;&#12383;&#12290;
  &#22823;&#37327;&#12398;&#25237;&#31295;&#12364;&#12354;&#12427;&#12398;&#12391;&#22810;&#20998;&#37325;&#35201;&#12394;&#12371;&#12392;&#12434;&#35441;&#12375;&#12390;&#12356;&#12427;&#12435;&#12384;&#12429;&#12358;&#12369;&#12393;&#12289;
  &#12356;&#12387;&#12383;&#12356;&#20309;&#12364;&#12393;&#12358;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12385;&#12387;&#12392;&#12418;&#12431;&#12363;&#12426;&#12419;&#12375;&#12394;&#12356;&#12301;&#12392;&#12356;&#12387;&#12383;&#27671;&#20998;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12398;&#35696;&#35542;&#12364;&#24517;&#35201;&#20197;&#19978;&#12395;&#22823;&#12370;&#12373;&#12395;&#12394;&#12426;&#12377;&#12366;&#12390;&#12356;&#12383;&#12371;&#12392;&#12434;&#35500;&#26126;&#12377;&#12428;&#12400;&#12289;
  &#24444;&#12425;&#12399;&#12381;&#12428;&#12414;&#12391;&#12398;&#27969;&#12428;&#12434;&#35211;&#30452;&#12375;&#12390;
  &#20309;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12383;&#12398;&#12363;&#12434;&#29702;&#35299;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="communications.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="difficult-people.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;</td></tr></table></div></body></html>
