<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="bounties.html" title="Bounties"><link rel="next" href="common-pitfalls.html" title="&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bounties.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="common-pitfalls.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;"><div class="titlepage"><div><div><h2 class="title"><a name="communications"></a>&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="communications.html#you-are-what-you-write">&#26360;&#12356;&#12383;&#12371;&#12392;&#12364;&#12377;&#12409;&#12390;</a></span></dt><dd><dl><dt><span class="sect2"><a href="communications.html#structure-and-formatting">&#27083;&#25104;&#12420;&#20307;&#35009;</a></span></dt><dt><span class="sect2"><a href="communications.html#writing-content">&#20013;&#36523;</a></span></dt><dt><span class="sect2"><a href="communications.html#writing-tone">&#21475;&#35519;</a></span></dt><dt><span class="sect2"><a href="communications.html#rudeness">&#20309;&#12364;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12398;&#12363;</a></span></dt><dt><span class="sect2"><a href="communications.html#face">&#38996;</a></span></dt></dl></dd><dt><span class="sect1"><a href="common-pitfalls.html">&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;</a></span></dt><dd><dl><dt><span class="sect2"><a href="common-pitfalls.html#post-with-purpose">&#30446;&#30340;&#12398;&#12394;&#12356;&#25237;&#31295;&#12434;&#12375;&#12394;&#12356;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#productive-threads">&#29983;&#29987;&#30340;&#12394;&#12473;&#12524;&#12483;&#12489;&#12392;&#12381;&#12358;&#12391;&#12394;&#12356;&#12473;&#12524;&#12483;&#12489;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#bikeshed">&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#holy-wars">&#23447;&#25945;&#35542;&#20105;&#12434;&#22238;&#36991;&#12377;&#12427;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#noisy-minority">"&#21475;&#12420;&#12363;&#12414;&#12375;&#12356;&#23569;&#25968;&#27966;" &#12395;&#12388;&#12356;&#12390;</a></span></dt></dl></dd><dt><span class="sect1"><a href="difficult-people.html">&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;</a></span></dt><dd><dl><dt><span class="sect2"><a href="difficult-people.html#handling-difficult-people">&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;&#12408;&#12398;&#23550;&#24540;</a></span></dt><dt><span class="sect2"><a href="difficult-people.html#difficult-people-case-study">&#23455;&#20363;</a></span></dt></dl></dd><dt><span class="sect1"><a href="growth.html">&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;</a></span></dt><dd><dl><dt><span class="sect2"><a href="growth.html#using-archives">&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;</a></span></dt><dd><dl><dt><span class="sect3"><a href="growth.html#all-as-archives">&#20840;&#12522;&#12477;&#12540;&#12473;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#21516;&#27096;&#12395;&#25201;&#12358;</a></span></dt></dl></dd><dt><span class="sect2"><a href="growth.html#codifying-tradition">&#12375;&#12365;&#12383;&#12426;&#12398;&#25104;&#25991;&#21270;</a></span></dt></dl></dd><dt><span class="sect1"><a href="bug-tracker-usage.html">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356;</a></span></dt><dt><span class="sect1"><a href="publicity.html">&#23459;&#20253;&#12539;&#24195;&#22577;</a></span></dt><dd><dl><dt><span class="sect2"><a href="publicity.html#security">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;</a></span></dt><dd><dl><dt><span class="sect3"><a href="publicity.html#security-receiving">&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#12427;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-finding-a-fix">&#22823;&#33267;&#24613;&#12381;&#12428;&#12434;&#20462;&#27491;&#12377;&#12427;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-cve">CAN/CVE &#30058;&#21495;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-prenotification">&#20107;&#21069;&#36890;&#30693;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-announcing">&#20462;&#27491;&#12434;&#19968;&#33324;&#12395;&#20844;&#38283;&#12377;&#12427;</a></span></dt></dl></dd></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>
  &#26126;&#30637;&#12395;&#12289;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#26360;&#12367;&#12392;&#12356;&#12358;&#25216;&#34899;&#12399;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#30028;&#12391;&#26286;&#12425;&#12377;&#19978;&#12391;&#26368;&#12418;&#37325;&#35201;&#12394;&#12418;&#12398;&#12398;&#12402;&#12392;&#12388;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12427;&#24847;&#21619;&#12391;&#12399;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#25216;&#34899;&#12424;&#12426;&#12418;&#37325;&#35201;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12398;&#25216;&#34899;&#12399;&#20778;&#12428;&#12390;&#12356;&#12427;&#12364;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12473;&#12461;&#12523;&#12395;&#27424;&#12369;&#12427;&#20154;&#12399;&#12289;
  &#19968;&#24230;&#12395;&#12402;&#12392;&#12388;&#12378;&#12388;&#12398;&#12371;&#12392;&#12375;&#12363;&#12371;&#12394;&#12379;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#21608;&#12426;&#12398;&#20154;&#12398;&#27671;&#12434;&#24341;&#12367;&#12371;&#12392;&#12395;&#12418;&#33510;&#21172;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#36870;&#12395;&#12289;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#12375;&#12390;&#12399;&#20108;&#27969;&#12384;&#12364;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12473;&#12461;&#12523;&#12364;&#20778;&#12428;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;
  &#21608;&#12426;&#12398;&#20154;&#12434;&#12358;&#12414;&#12367;&#24059;&#12365;&#36796;&#12435;&#12391;&#12373;&#12414;&#12374;&#12414;&#12394;&#20316;&#26989;&#12434;&#12371;&#12394;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#32080;&#26524;&#12392;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12424;&#12356;&#26041;&#21521;&#12395;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12387;&#12390;&#12367;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#33021;&#21147;&#12398;&#12354;&#12427;&#20154;&#12364;&#12289;
  &#24517;&#12378;&#12375;&#12418;&#20182;&#20154;&#12392;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12367;&#12383;&#12417;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#33021;&#21147;&#12364;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12424;&#12356;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#26360;&#12367;&#33021;&#21147;&#12392;&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12434;&#12358;&#12414;&#12367;&#35500;&#26126;&#12377;&#12427;&#33021;&#21147;&#12392;&#12395;&#12399;
  &#12381;&#12428;&#12394;&#12426;&#12398;&#30456;&#38306;&#38306;&#20418;&#12399;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12300;&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12434;&#35500;&#26126;&#12377;&#12427;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12362;&#12369;&#12427;&#12411;&#12435;&#12398;&#19968;&#37096;&#12398;&#12371;&#12392;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12424;&#12426;&#12418;&#12378;&#12387;&#12392;&#22823;&#20107;&#12394;&#12371;&#12392;&#12399;&#12289;&#27425;&#12398;&#65299;&#12388;&#12290;
  &#12414;&#12378;&#32862;&#12365;&#25163;&#12398;&#27671;&#25345;&#12385;&#12395;&#12394;&#12387;&#12390;&#32771;&#12360;&#12427;&#12371;&#12392;&#12289;
  &#33258;&#20998;&#12398;&#25237;&#31295;&#12420;&#12467;&#12513;&#12531;&#12488;&#12434;&#23458;&#35251;&#30340;&#12395;&#35211;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#20182;&#20154;&#12395;&#12418;&#33258;&#20998;&#33258;&#36523;&#12398;&#25237;&#31295;&#12420;&#12467;&#12513;&#12531;&#12488;&#12434;&#23458;&#35251;&#30340;&#12395;&#35211;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#8230;&#8230;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#21475;&#12391;&#35328;&#12358;&#12398;&#12399;&#31777;&#21336;&#12391;&#12377;&#12364;&#12289;&#23455;&#38555;&#12395;&#12420;&#12387;&#12390;&#12415;&#12427;&#12392;
  &#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#38627;&#12375;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12395;&#12399;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#20154;&#12383;&#12385;&#12364;&#21442;&#21152;&#12375;&#12390;&#12362;&#12426;&#12289;&#24444;&#12425;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#26041;&#27861;&#12418;&#12381;&#12428;&#12382;&#12428;&#30064;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#20309;&#12363;&#24847;&#35211;&#12434;&#36848;&#12409;&#12383;&#12356;&#12392;&#12365;&#12399;&#12393;&#12358;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#25237;&#31295;&#12377;&#12427;&#65311; &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12377;&#12427;&#65311;
  &#12381;&#12428;&#12392;&#12418;&#12467;&#12540;&#12489;&#12398;&#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#35352;&#36848;&#12377;&#12427;&#65311;
  &#25522;&#31034;&#26495;&#12391;&#12398;&#36074;&#21839;&#12395;&#22238;&#31572;&#12377;&#12427;&#12392;&#12365;&#12289;&#30456;&#25163;&#12364;&#12393;&#12428;&#12367;&#12425;&#12356;&#12398;&#30693;&#35672;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12392;&#24819;&#23450;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;
  &#24403;&#28982;&#12289;&#12371;&#12371;&#12391;&#12356;&#12358;&#12300;&#30456;&#25163;&#12301;&#12392;&#12399;&#12289;&#36074;&#21839;&#12398;&#24403;&#20107;&#32773;&#12384;&#12369;&#12391;&#12394;&#12367;
  &#24460;&#12391;&#12354;&#12394;&#12383;&#12398;&#22238;&#31572;&#12434;&#35501;&#12416;&#12391;&#12354;&#12429;&#12358;&#31532;&#19977;&#32773;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#12392;&#21033;&#29992;&#32773;&#12398;&#38306;&#20418;&#12434;&#33391;&#22909;&#12394;&#29366;&#24907;&#12395;&#20445;&#12388;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;
  &#21033;&#29992;&#32773;&#12363;&#12425;&#12398;&#27231;&#33021;&#36861;&#21152;&#35201;&#27714;&#12420;&#21208;&#36949;&#12356;&#12398;&#12496;&#12464;&#22577;&#21578;&#12289;
  &#12381;&#12398;&#20182;&#12398;&#38609;&#35527;&#12394;&#12393;&#12395;&#38283;&#30330;&#32773;&#12383;&#12385;&#12364;&#24745;&#12414;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#65311;
  &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#25163;&#27573;&#12364;&#23613;&#12365;&#12383;&#12425;&#30456;&#25163;&#12395;&#12393;&#12358;&#20253;&#12360;&#12383;&#12425;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
  &#12414;&#12383;&#12289;&#12393;&#12358;&#23550;&#20966;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
</p><p>
  &#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12395;&#23550;&#12377;&#12427;&#35299;&#27770;&#31574;&#12399;&#12289;&#36890;&#24120;&#12399;&#19968;&#26178;&#30340;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12289;
  &#12393;&#12435;&#12394;&#35299;&#27770;&#31574;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12367;&#12394;&#12387;&#12383;&#12426;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20307;&#21046;&#12364;&#22793;&#12431;&#12387;&#12383;&#12426;&#12377;&#12428;&#12400;&#24847;&#21619;&#12364;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12371;&#12428;&#12425;&#12398;&#35299;&#27770;&#31574;&#12399;&#12383;&#12356;&#12390;&#12356;&#12381;&#12398;&#22580;&#12375;&#12398;&#12366;&#12398;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#21051;&#12293;&#12392;&#22793;&#21270;&#12377;&#12427;&#29366;&#27841;&#12395;&#12354;&#12431;&#12379;&#12390;&#21363;&#33288;&#12391;&#23550;&#24540;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#19981;&#20840;&#12395;&#38501;&#12387;&#12390;&#12356;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#24120;&#12395;&#27671;&#12395;&#12363;&#12369;&#12289;
  &#12381;&#12428;&#12395;&#23550;&#24540;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#34892;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;&#12371;&#12392;&#12418;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36939;&#21942;&#12398;&#22823;&#20107;&#12394;&#19968;&#37096;&#12391;&#12377;&#12290;
  &#20197;&#19979;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#12358;&#12414;&#12367;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#34892;&#12358;&#26041;&#27861;&#12434;&#25201;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#20870;&#28369;&#12394;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32173;&#25345;&#12377;&#12427;&#12383;&#12417;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12418;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  <sup>[<a name="idp1561456" href="#ftn.idp1561456" class="footnote">25</a>]</sup>
</p></div><div class="sect1" title="&#26360;&#12356;&#12383;&#12371;&#12392;&#12364;&#12377;&#12409;&#12390;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="you-are-what-you-write"></a>&#26360;&#12356;&#12383;&#12371;&#12392;&#12364;&#12377;&#12409;&#12390;</h2></div></div></div><p>
  &#32771;&#12360;&#12390;&#12418;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12391;&#12399;&#12289;&#12354;&#12394;&#12383;&#12364;&#20309;&#32773;&#12391;&#12354;&#12427;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#22522;&#28310;&#12399;
  &#12300;&#12354;&#12394;&#12383;&#12364;&#20309;&#12434;&#26360;&#12356;&#12383;&#12363;&#12301;&#12300;&#20182;&#20154;&#12364;&#12354;&#12394;&#12383;&#12398;&#12371;&#12392;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#26360;&#12356;&#12383;&#12363;&#12301;
  &#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#12354;&#12394;&#12383;&#12364;&#38957;&#33075;&#26126;&#26224;&#12391;&#27934;&#23519;&#21147;&#12395;&#20778;&#12428;&#12289;
  &#12459;&#12522;&#12473;&#12510;&#24615;&#12398;&#12354;&#12427;&#20154;&#29289;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#26360;&#12356;&#12383;&#12513;&#12540;&#12523;&#12364;&#20013;&#36523;&#12398;&#12394;&#12356;&#20081;&#38609;&#12394;&#12418;&#12398;&#12384;&#12387;&#12383;&#12425;
  &#20182;&#12398;&#20154;&#12383;&#12385;&#12399;&#12354;&#12394;&#12383;&#12398;&#12371;&#12392;&#12434;&#12300;&#20013;&#36523;&#12398;&#12394;&#12356;&#20081;&#38609;&#12394;&#20154;&#12301;&#12392;&#12415;&#12394;&#12377;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#36870;&#12395;&#12289;&#23455;&#38555;&#12398;&#12354;&#12394;&#12383;&#12364;&#20013;&#36523;&#12398;&#12394;&#12356;&#20081;&#38609;&#12394;&#20154;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#25237;&#31295;&#12377;&#12427;&#20869;&#23481;&#12364;&#26126;&#24555;&#12391;&#26377;&#30410;&#12394;&#12418;&#12398;&#12394;&#12425;&#12289;
  &#20182;&#12398;&#20154;&#12383;&#12385;&#12399;&#23455;&#38555;&#12398;&#12354;&#12394;&#12383;&#12364;&#12393;&#12358;&#12391;&#12354;&#12427;&#12363;&#12394;&#12435;&#12390;&#27671;&#12395;&#12375;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#33258;&#20998;&#12364;&#20309;&#12363;&#12434;&#26360;&#12367;&#12392;&#12365;&#12395;&#12399;&#21313;&#20998;&#27880;&#24847;&#12434;&#25173;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#27770;&#12375;&#12390;&#25613;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12495;&#12483;&#12459;&#12540;&#12392;&#12375;&#12390;&#38263;&#24180;&#12398;&#32076;&#39443;&#12434;&#25345;&#12388;
  Jim Blandy &#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#35441;&#12434;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
    &#12354;&#12428;&#12399; 1993 &#24180;&#12398;&#12371;&#12392;&#12290;&#24403;&#26178;&#31169;&#12399; Free Software Foundation &#12391;&#20685;&#12356;&#12390;&#12362;&#12426;&#12289;
    GNU Emacs &#12398;&#12496;&#12540;&#12472;&#12519;&#12531; 19 &#12398;&#12505;&#12540;&#12479;&#12486;&#12473;&#12488;&#12434;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#31169;&#12383;&#12385;&#12399;&#12384;&#12356;&#12383;&#12356;&#36913;&#12395;&#19968;&#24230;&#12398;&#12506;&#12540;&#12473;&#12391;&#12505;&#12540;&#12479;&#29256;&#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12289;
    &#12381;&#12428;&#12434;&#35430;&#12375;&#12383;&#12518;&#12540;&#12470;&#12540;&#12363;&#12425;&#12496;&#12464;&#22577;&#21578;&#12434;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#30452;&#25509;&#20250;&#12387;&#12383;&#12371;&#12392;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12356;&#12388;&#12418;&#12377;&#12400;&#12425;&#12375;&#12356;&#20181;&#20107;&#12434;&#12375;&#12390;&#12367;&#12428;&#12427;&#12518;&#12540;&#12470;&#12540;&#12364;&#19968;&#20154;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#24444;&#12398;&#12496;&#12464;&#22577;&#21578;&#12399;&#24120;&#12395;&#26126;&#24555;&#12391;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#12289;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#22823;&#12365;&#12394;&#21161;&#12369;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#26178;&#12395;&#12399;&#24444;&#33258;&#36523;&#12364;&#12496;&#12464;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;
    &#12381;&#12428;&#12418;&#12414;&#12383;&#30340;&#30906;&#12394;&#12418;&#12398;&#12364;&#12411;&#12392;&#12435;&#12393;&#12391;&#12375;&#12383;&#12290;&#12414;&#12373;&#12395;&#26368;&#39640;&#12398;&#22900;&#12384;&#12387;&#12383;&#12435;&#12391;&#12377;&#12290;
  </p><p>
    FSF &#12391;&#12399;&#12289;&#35504;&#12363;&#12364;&#26360;&#12356;&#12383;&#12467;&#12540;&#12489;&#12434;&#21462;&#12426;&#36796;&#12416;&#21069;&#12395;&#12399;&#12289;
    &#12381;&#12398;&#12467;&#12540;&#12489;&#12398;&#33879;&#20316;&#27177;&#12434; FSF &#12395;&#28193;&#12377;&#12383;&#12417;&#12398;&#27861;&#30340;&#25163;&#32154;&#12365;&#12434;&#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#35211;&#30693;&#12425;&#12396;&#35504;&#12363;&#12373;&#12435;&#12363;&#12425;&#12418;&#12425;&#12387;&#12383;&#12467;&#12540;&#12489;&#12434;&#12381;&#12398;&#12414;&#12414;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12399;&#12289;
    &#30772;&#28357;&#12408;&#12398;&#31532;&#19968;&#27497;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  </p><p>
    &#12381;&#12371;&#12391;&#31169;&#12399;&#12289;&#24444;&#12395;&#12513;&#12540;&#12523;&#12391;&#26360;&#39006;&#12434;&#36865;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#12300;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#20107;&#21209;&#25163;&#32154;&#12365;&#12364;&#24517;&#35201;&#12394;&#12435;&#12384;&#12290;&#20869;&#23481;&#12399;&#12371;&#12371;&#12395;&#35500;&#26126;&#12375;&#12390;&#12354;&#12427;&#12398;&#12391;&#12289;
    &#12414;&#12378;&#21531;&#12364;&#12371;&#12371;&#12395;&#32626;&#21517;&#12375;&#12390;&#12411;&#12375;&#12356;&#12290;&#12381;&#12375;&#12390;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#26360;&#39006;&#12395;&#21531;&#12398;&#38599;&#29992;&#20027;&#12398;&#32626;&#21517;&#12434;&#12418;&#12425;&#12387;&#12390;&#12411;&#12375;&#12356;&#12290;
    &#12381;&#12358;&#12375;&#12383;&#12425;&#21531;&#12398;&#12496;&#12464;&#12501;&#12451;&#12483;&#12463;&#12473;&#12434;&#21462;&#12426;&#36796;&#12417;&#12427;&#12384;&#12429;&#12358;&#12290;&#12356;&#12388;&#12418;&#12354;&#12426;&#12364;&#12392;&#12358;&#12290;&#24863;&#35613;&#12375;&#12390;&#12427;&#12424;&#12290;&#12301;
    &#12371;&#12435;&#12394;&#20869;&#23481;&#12391;&#12375;&#12383;&#12290;
  </p><p>
    &#24444;&#12363;&#12425;&#36820;&#12387;&#12390;&#12365;&#12383;&#36820;&#20107;&#12399;&#12300;&#31169;&#12395;&#12399;&#38599;&#29992;&#20027;&#12399;&#12356;&#12414;&#12379;&#12435;&#12301;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  </p><p>
    &#12391;&#12289;&#31169;&#12399;&#35328;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#12300;&#12354;&#12354;&#12289;&#12381;&#12358;&#12363;&#12356;&#12290;&#12381;&#12428;&#12394;&#12425;&#12289;&#20195;&#12431;&#12426;&#12395;&#21531;&#12398;&#36890;&#12358;&#22823;&#23398;&#12395;&#32626;&#21517;&#12434;&#12418;&#12425;&#12387;&#12390;&#36865;&#12426;&#36820;&#12375;&#12390;&#12367;&#12428;&#12394;&#12356;&#12363;&#12394;&#65311;&#12301;
  </p><p>
    &#12375;&#12400;&#12425;&#12367;&#12375;&#12390;&#12289;&#24444;&#12363;&#12425;&#20877;&#12403;&#36820;&#20107;&#12364;&#36820;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12300;&#12354;&#12289;&#12354;&#12398;&#8230;&#8230;&#12290;&#20693;&#12289;&#23455;&#12399;&#12414;&#12384; 13 &#25165;&#12391;&#12289;&#35242;&#12392;&#21516;&#23621;&#12375;&#12390;&#12356;&#12427;&#12435;&#12391;&#12377;&#12369;&#12393;&#8230;&#8230;&#12301;
  </p></blockquote></div><p>
  &#24444;&#12398;&#25991;&#38754;&#12364;&#12392;&#12390;&#12418; 13 &#25165;&#12398;&#12460;&#12461;&#12364;&#26360;&#12356;&#12383;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12395;&#12399;&#35211;&#12360;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12289;
  &#35504;&#12418;&#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#24819;&#20687;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#30342;&#12395;&#27671;&#12395;&#20837;&#12425;&#12428;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12398;&#26360;&#12365;&#26041;&#12395;&#12388;&#12356;&#12390;&#12289;&#12371;&#12428;&#12363;&#12425;&#12415;&#12390;&#12356;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect2" title="&#27083;&#25104;&#12420;&#20307;&#35009;"><div class="titlepage"><div><div><h3 class="title"><a name="structure-and-formatting"></a>&#27083;&#25104;&#12420;&#20307;&#35009;</h3></div></div></div><p>
  &#12465;&#12540;&#12479;&#12452;&#12398;&#12513;&#12540;&#12523;&#12376;&#12419;&#12394;&#12356;&#12435;&#12384;&#12363;&#12425;&#12289;
  &#20309;&#12418;&#32771;&#12360;&#12378;&#12395;&#12383;&#12384;&#12384;&#12425;&#12384;&#12425;&#26360;&#12365;&#36899;&#12397;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12399;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12385;&#12419;&#12435;&#12392;&#12375;&#12383;&#25991;&#12434;&#26360;&#12365;&#12289;&#21336;&#35486;&#12398;&#20808;&#38957;&#12399;&#12385;&#12419;&#12435;&#12392;&#22823;&#25991;&#23383;&#12395;&#12375;&#12390;&#12289;
  &#36969;&#20999;&#12395;&#27573;&#33853;&#20998;&#12369;&#12434;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12513;&#12540;&#12523;&#12384;&#12369;&#12391;&#12394;&#12367;&#12381;&#12398;&#20182;&#12398;&#12385;&#12419;&#12435;&#12392;&#12375;&#12383;&#25991;&#26360;&#12395;&#12362;&#12356;&#12390;&#12418;&#26368;&#12418;&#37325;&#35201;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
  IRC &#12398;&#12424;&#12358;&#12394;&#12381;&#12398;&#22580;&#38480;&#12426;&#12398;&#12420;&#12426;&#12392;&#12426;&#12398;&#22580;&#21512;&#12399;&#12289;
  &#12354;&#12414;&#12426;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#27671;&#12395;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#30053;&#35486;&#12434;&#20351;&#12356;&#12414;&#12367;&#12387;&#12383;&#12426;&#12375;&#12390;&#12418;&#22823;&#19976;&#22827;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#27491;&#24335;&#12394;&#25522;&#31034;&#26495;&#19978;&#12394;&#12393;&#12395;&#12399;&#12381;&#12435;&#12394;&#32722;&#24931;&#12434;&#25345;&#12385;&#36796;&#12414;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12513;&#12540;&#12523;&#12420;&#12510;&#12491;&#12517;&#12450;&#12523;&#12289;&#12496;&#12464;&#22577;&#21578;&#12394;&#12393;&#12398;&#12424;&#12358;&#12395;&#24460;&#12395;&#27531;&#12427;&#12371;&#12392;&#12364;&#21069;&#25552;&#12398;&#25991;&#26360;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#27161;&#28310;&#30340;&#12394;&#25991;&#27861;&#12420;&#12473;&#12506;&#12523;&#12391;&#26360;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12365;&#12385;&#12435;&#12392;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12399;&#27770;&#12375;&#12390;&#12300;&#12392;&#12426;&#12354;&#12360;&#12378;&#38263;&#12356;&#12418;&#12398;&#12395;&#12399;&#24059;&#12363;&#12428;&#12390;&#12362;&#12369;&#12301;
  &#12392;&#12363;&#12356;&#12358;&#39006;&#12398;&#35441;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12371;&#12391;&#25369;&#12370;&#12383;&#35215;&#21063;&#12399;&#12289;
  &#21336;&#12394;&#12427;&#12375;&#12365;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#25991;&#26360;&#12434;&#35501;&#12415;&#12420;&#12377;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;&#36914;&#12417;&#12390;&#12365;&#12383;&#32080;&#26524;&#12364;&#12371;&#12428;&#12394;&#12398;&#12391;&#12289;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#12381;&#12428;&#12434;&#23562;&#37325;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#35501;&#12415;&#12420;&#12377;&#12367;&#26360;&#12367;&#12424;&#12358;&#12395;&#12377;&#12427;&#29702;&#30001;&#12399;&#12289;
  &#20182;&#20154;&#12364;&#29702;&#35299;&#12375;&#12420;&#12377;&#12367;&#12394;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12354;&#12394;&#12383;&#12364;&#12300;&#20182;&#20154;&#12392;&#12375;&#12387;&#12363;&#12426;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12488;&#12377;&#12427;&#12388;&#12418;&#12426;&#12398;&#12354;&#12427;&#20154;&#12384;&#12301;
  &#12392;&#35469;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#38754;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12513;&#12540;&#12523;&#12434;&#26360;&#12367;&#38555;&#12395;&#12399;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38283;&#30330;&#32773;&#12398;&#38291;&#12391;&#26263;&#40665;&#12398;&#20102;&#35299;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#27770;&#12414;&#12426;&#12372;&#12392;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12513;&#12540;&#12523;&#12391;&#12399;&#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#12415;&#12434;&#20351;&#29992;&#12375;&#12289;
  HTML &#12420;&#12522;&#12483;&#12481;&#12486;&#12461;&#12473;&#12488;&#12392;&#12356;&#12387;&#12383;&#24418;&#24335;&#12399;&#36991;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12486;&#12461;&#12473;&#12488;&#12395;&#12398;&#12415;&#23550;&#24540;&#12375;&#12383;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12391;&#12399;&#12289;
  &#20182;&#12398;&#24418;&#24335;&#12398;&#12513;&#12540;&#12523;&#12364;&#12358;&#12414;&#12367;&#35211;&#12360;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#21322;&#35282; 72 &#25991;&#23383;&#31243;&#24230;&#12391;&#25913;&#34892;&#12434;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  1 &#34892;&#12364; 80 &#25991;&#23383;&#12434;&#36229;&#12360;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428; (80 &#25991;&#23383;) &#12399;&#12289;&#31471;&#26411;&#12398;&#30011;&#38754;&#19978;&#12391; 1 &#34892;&#12395;&#34920;&#31034;&#12391;&#12365;&#12427;&#26689;&#25968;&#12398;&#27161;&#28310;&#20516;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12424;&#12426;&#24195;&#12356;&#24133;&#12398;&#31471;&#26411;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12371;&#12428;&#12424;&#12426;&#29421;&#12356;&#12418;&#12398;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12399;&#12356;&#12414;&#12379;&#12435;&#12290;
  80 &#25991;&#23383;&#12366;&#12426;&#12366;&#12426;&#12391;&#12399;&#12394;&#12367;&#12418;&#12358;&#23569;&#12375;&#20313;&#35029;&#12434;&#25345;&#12387;&#12390;&#25913;&#34892;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12289;
  &#36820;&#20449;&#26178;&#12395;&#24341;&#29992;&#31526;&#12434;&#36861;&#21152;&#12375;&#12390;&#12418;&#25913;&#34892;&#20301;&#32622;&#12434;&#27671;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  <span class="emphasis"><em>&#23455;&#38555;&#12395;&#25913;&#34892;&#12377;&#12427;&#12371;&#12392;&#12290;</em></span>
  &#12513;&#12540;&#12521;&#12540;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12513;&#12540;&#12523;&#12398;&#20316;&#25104;&#26178;&#12395;&#12399;&#12356;&#12363;&#12395;&#12418;&#25913;&#34892;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#35211;&#12379;&#12390;&#12356;&#12390;&#12418;&#12289;
  &#23455;&#38555;&#12398;&#12513;&#12540;&#12523;&#12391;&#12399;&#25913;&#34892;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12414;&#12414;&#36865;&#20449;&#12377;&#12427;&#12392;&#12289;&#12354;&#12394;&#12383;&#12398;&#24847;&#22259;&#12375;&#12383;&#12392;&#12371;&#12429;&#12395;&#25913;&#34892;&#12364;&#20837;&#12387;&#12390;&#12356;&#12394;&#12356;&#29366;&#24907;&#12398;
  &#12513;&#12540;&#12523;&#12364;&#36865;&#20449;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#21463;&#12369;&#21462;&#12387;&#12383;&#20596;&#12398;&#30011;&#38754;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
  &#25913;&#34892;&#12398;&#20301;&#32622;&#12364;&#12362;&#12363;&#12375;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#12381;&#12398;&#12424;&#12358;&#12394;&#12513;&#12540;&#12521;&#12540;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12513;&#12540;&#12523;&#20316;&#25104;&#26178;&#12395;&#23455;&#38555;&#12398;&#25913;&#34892;&#12434;&#35211;&#12379;&#12427;&#12424;&#12358;&#12394;&#35373;&#23450;&#38917;&#30446;&#12364;&#12394;&#12356;&#12363;&#25506;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#30011;&#38754;&#12398;&#20986;&#21147;&#12420;&#12467;&#12540;&#12489;&#12398;&#19968;&#37096;&#12289;&#12381;&#12398;&#20182;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#28168;&#12415;&#12398;&#12486;&#12461;&#12473;&#12488;&#12434;&#35352;&#36848;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
  &#12399;&#12387;&#12365;&#12426;&#12392;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#20301;&#32622;&#12434;&#12378;&#12425;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12393;&#12371;&#12363;&#12425;&#12393;&#12371;&#12414;&#12391;&#12364;&#22320;&#12398;&#25991;&#12391;&#12393;&#12371;&#12363;&#12425;&#12393;&#12371;&#12414;&#12391;&#12364;&#24341;&#29992;&#12394;&#12398;&#12363;&#12434;&#26126;&#30906;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;
  (&#26412;&#26360;&#12434;&#22519;&#31558;&#12375;&#12399;&#12376;&#12417;&#12383;&#24403;&#21021;&#12399;&#12289;&#12371;&#12435;&#12394;&#12371;&#12392;&#12434;&#35500;&#26126;&#12377;&#12427;&#12388;&#12418;&#12426;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12373;&#12414;&#12374;&#12414;&#12394;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38306;&#36899;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#35211;&#12390;&#12356;&#12367;&#12358;&#12385;&#12395;&#12289;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#31278;&#39006;&#12398;&#12486;&#12461;&#12473;&#12488;&#12434;&#21306;&#21029;&#12379;&#12378;&#12372;&#12385;&#12419;&#12372;&#12385;&#12419;&#12395;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#22810;&#12356;&#12371;&#12392;&#12395;&#27671;&#12389;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12428;&#12399;&#12381;&#12428;&#12399;&#38750;&#24120;&#12395;&#35501;&#12415;&#12389;&#12425;&#12356;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12362;&#12363;&#12370;&#12391;&#24444;&#12425;&#12398;&#25237;&#31295;&#12398;&#20869;&#23481;&#12434;&#12388;&#12363;&#12415;&#12395;&#12367;&#12367;&#12394;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#29575;&#30452;&#12395;&#35328;&#12387;&#12390;&#24444;&#12425;&#12399;&#12385;&#12423;&#12387;&#12392;&#12384;&#12425;&#12375;&#12394;&#12356;&#20154;&#12383;&#12385;&#12384;&#12394;&#12392;&#24863;&#12376;&#12414;&#12375;&#12383;)&#12290;
</p><p>
  &#20182;&#20154;&#12398;&#12513;&#12540;&#12523;&#12434;&#24341;&#29992;&#12375;&#12390;&#36820;&#20449;&#12377;&#12427;&#38555;&#12399;&#12289;
  &#36969;&#20999;&#12394;&#22580;&#25152;&#12395;&#36820;&#20449;&#20869;&#23481;&#12434;&#26360;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#24517;&#35201;&#12394;&#12425;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#22580;&#25152;&#12395;&#20998;&#12369;&#12390;&#26360;&#12367;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#19981;&#35201;&#12394;&#37096;&#20998;&#12399;&#24341;&#29992;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#25237;&#31295;&#20840;&#20307;&#12395;&#23550;&#12375;&#12390;&#19968;&#35328;&#12467;&#12513;&#12531;&#12488;&#12375;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;
  &#25237;&#31295;&#12398;&#20808;&#38957; (&#12388;&#12414;&#12426;&#12289;&#12354;&#12394;&#12383;&#12398;&#36820;&#20449;&#12434;&#26360;&#12356;&#12383;&#24460;&#12395;
  &#12513;&#12540;&#12523;&#12398;&#24341;&#29992;&#12364;&#32154;&#12367;&#24418;&#24335;) &#12395;&#12381;&#12428;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12289;&#12414;&#12378;&#38306;&#36899;&#12377;&#12427;&#31623;&#25152;&#12434;&#24341;&#29992;&#12375;&#12383;&#12358;&#12360;&#12391;&#12289;
  &#12381;&#12398;&#24460;&#12395;&#36820;&#20449;&#12434;&#26360;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#12513;&#12540;&#12523;&#12398;&#20214;&#21517;&#12399;&#12424;&#12367;&#32771;&#12360;&#12390;&#12388;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12513;&#12540;&#12523;&#12398;&#20013;&#12391;&#12418;&#12387;&#12392;&#12418;&#37325;&#35201;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;
  &#12381;&#12398;&#12513;&#12540;&#12523;&#12434;&#35501;&#12416;&#12363;&#12393;&#12358;&#12363;&#12434;&#20214;&#21517;&#12391;&#21028;&#26029;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12356;&#12414;&#12393;&#12365;&#12398;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12399;&#12289;&#38306;&#36899;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12473;&#12524;&#12483;&#12489;&#12395;&#12414;&#12392;&#12417;&#12427;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12473;&#12524;&#12483;&#12489;&#12395;&#12414;&#12392;&#12417;&#12427;&#12383;&#12417;&#12398;&#22522;&#28310;&#12399;&#12289;
  &#20214;&#21517;&#12364;&#21516;&#12376;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12381;&#12398;&#20182;&#12398;&#12504;&#12483;&#12480;&#12398;&#20869;&#23481;&#12418;&#20351;&#29992;&#12375;&#12414;&#12377;
  (&#12371;&#12398;&#12504;&#12483;&#12480;&#12398;&#20869;&#23481;&#12399;&#12289;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
  &#12418;&#12375;&#12402;&#12392;&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#20869;&#12391;&#35441;&#38988;&#12364;&#22793;&#12431;&#12427;&#12392;&#12365;&#12399;&#12289;
  &#36820;&#20449;&#12398;&#38555;&#12395;&#20214;&#21517;&#12434;&#36969;&#20999;&#12395;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377; (&#22793;&#26356;&#12377;&#12409;&#12365;&#12391;&#12377;)&#12290;
  &#12381;&#12398;&#20182;&#12398;&#12504;&#12483;&#12480;&#12398;&#20869;&#23481;&#12395;&#12424;&#12387;&#12390;&#12473;&#12524;&#12483;&#12489;&#12398;&#27083;&#25104;&#12399;&#12381;&#12398;&#12414;&#12414;&#20445;&#25345;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;
  &#20214;&#21517;&#12434;&#22793;&#12360;&#12390;&#12362;&#12367;&#12392;&#12289;&#12381;&#12371;&#12391;&#35441;&#38988;&#12364;&#22793;&#12431;&#12387;&#12383;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#26412;&#24403;&#12395;&#26032;&#12375;&#12356;&#35441;&#38988;&#12434;&#22987;&#12417;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;&#26032;&#12375;&#12356;&#12513;&#12540;&#12523;&#12392;&#12375;&#12390;&#36865;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#26082;&#23384;&#12398;&#12513;&#12540;&#12523;&#12395;&#12300;&#36820;&#20449;&#12301;&#12375;&#12390;&#20214;&#21517;&#12384;&#12369;&#12434;&#22793;&#12360;&#12427;&#12392;&#12356;&#12358;&#12398;&#12391;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12373;&#12418;&#12394;&#12356;&#12392;&#12289;&#12354;&#12394;&#12383;&#12398;&#20986;&#12375;&#12383;&#12513;&#12540;&#12523;&#12364;&#12473;&#12524;&#12483;&#12489;&#12395;&#32027;&#12428;&#36796;&#12435;&#12391;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12395;&#12424;&#12427;&#25613;&#22833;&#12399;&#12289;&#21336;&#12395;&#26178;&#38291;&#12434;&#28010;&#36027;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12300;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12484;&#12540;&#12523;&#12434;&#12358;&#12414;&#12367;&#20351;&#12356;&#12371;&#12394;&#12379;&#12427;&#20154;&#12301;
  &#12392;&#12356;&#12358;&#12354;&#12394;&#12383;&#12398;&#35413;&#21028;&#12418;&#33853;&#12385;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#20013;&#36523;"><div class="titlepage"><div><div><h3 class="title"><a name="writing-content"></a>&#20013;&#36523;</h3></div></div></div><p>
  &#12365;&#12428;&#12356;&#12395;&#20307;&#35009;&#12434;&#25972;&#12360;&#12383;&#12513;&#12540;&#12523;&#12399;&#35501;&#32773;&#12398;&#27671;&#12434;&#24341;&#12367;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23455;&#38555;&#12395;&#35501;&#12435;&#12391;&#12418;&#12425;&#12358;&#12395;&#12399;&#20013;&#36523;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12300;&#12371;&#12428;&#12373;&#12360;&#23432;&#12428;&#12400;&#20013;&#36523;&#12398;&#12354;&#12427;&#20869;&#23481;&#12434;&#26360;&#12369;&#12427;&#12301;&#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#12523;&#12540;&#12523;&#12399;&#12418;&#12385;&#12429;&#12435;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12395;&#36817;&#12389;&#12367;&#12383;&#12417;&#12398;&#21407;&#21063;&#12394;&#12425;&#12356;&#12367;&#12388;&#12363;&#12354;&#12370;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#35501;&#12416;&#20154;&#12398;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#26360;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#27963;&#30330;&#12395;&#27963;&#21205;&#12375;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#24773;&#22577;&#12364;&#20184;&#12365;&#12414;&#12392;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12513;&#12540;&#12523;&#12398;&#35501;&#12415;&#25163;&#12364;&#12289;
  &#12381;&#12428;&#12425;&#12398;&#24773;&#22577;&#12434;&#12377;&#12409;&#12390;&#30693;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#26399;&#24453;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#24444;&#12425;&#12399;&#12381;&#12435;&#12394;&#24773;&#22577;&#12394;&#12393;&#30693;&#12429;&#12358;&#12392;&#12418;&#12375;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#21487;&#33021;&#12394;&#38480;&#12426;&#12289;&#35501;&#12415;&#25163;&#12395;&#12392;&#12387;&#12390;&#20415;&#21033;&#12394;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12411;&#12435;&#12398;&#25968;&#20998;&#26178;&#38291;&#12434;&#20351;&#12358;&#12384;&#12369;&#12391;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#29305;&#23450;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#34920;&#12377; URL &#12434;&#35519;&#12409;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12289;&#35501;&#12415;&#25163;&#12364;&#21516;&#12376;&#12371;&#12392;&#12434;&#12377;&#12427;&#25163;&#38291;&#12434;&#30465;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12373;&#12425;&#12395; 5 &#20998;&#12363;&#12425; 10 &#20998;&#12411;&#12393;&#20313;&#35336;&#12395;&#26178;&#38291;&#12434;&#21106;&#12369;&#12400;&#12289;
  &#35079;&#38609;&#12395;&#12394;&#12387;&#12383;&#12473;&#12524;&#12483;&#12489;&#12398;&#31777;&#21336;&#12394;&#12414;&#12392;&#12417;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#25237;&#31295;&#12398;&#32972;&#26223;&#12395;&#12354;&#12427;&#35441;&#12398;&#27969;&#12428;&#12434;&#20253;&#12360;&#12427;&#12398;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;
  &#12371;&#12435;&#12394;&#39080;&#12395;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12358;&#12414;&#12367;&#12356;&#12369;&#12400;&#12356;&#12367;&#12411;&#12393;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#25522;&#31034;&#26495;&#12398;&#26360;&#12365;&#25163;&#12395;&#23550;&#12377;&#12427;&#35501;&#12415;&#25163;&#12398;&#27604;&#29575;&#12364;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#25237;&#31295;&#12377;&#12427;&#20869;&#23481;&#12364; <span class="emphasis"><em>n</em></span> &#20154;&#12395;&#35501;&#12414;&#12428;&#12390;&#12356;&#12427;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#12354;&#12394;&#12383;&#12364;&#12385;&#12423;&#12387;&#12392;&#26178;&#38291;&#12434;&#20351;&#12387;&#12390;&#20316;&#26989;&#12434;&#12377;&#12427;&#12384;&#12369;&#12391; <span class="emphasis"><em>n</em></span>
  &#20154;&#12406;&#12435;&#12398;&#21516;&#12376;&#26178;&#38291;&#12434;&#31680;&#32004;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;<span class="emphasis"><em>n</em></span>
  &#12364;&#22823;&#12365;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;&#12371;&#12398;&#20385;&#20516;&#12399;&#21521;&#19978;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12354;&#12394;&#12383;&#12364;&#12381;&#12358;&#12375;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#12428;&#12400;&#12289;&#20182;&#12398;&#20154;&#12383;&#12385;&#12418;&#21516;&#12376;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#32080;&#26524;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12398;&#21177;&#29575;&#12364;&#21521;&#19978;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<span class="emphasis"><em>n</em></span>
  &#20154;&#12364;&#33510;&#21172;&#12377;&#12427;&#12398;&#12392;&#19968;&#20154;&#12364;&#33510;&#21172;&#12377;&#12427;&#12398;&#12392;&#12393;&#12385;&#12425;&#12364;&#12356;&#12356;&#12363;&#12392;&#12356;&#12360;&#12400;&#12289;&#24460;&#32773;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#29289;&#20107;&#12434;&#35463;&#24373;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12458;&#12531;&#12521;&#12452;&#12531;&#12398;&#25237;&#31295;&#12391;&#12399;&#12289;&#35441;&#12364;&#22823;&#12370;&#12373;&#12395;&#12394;&#12426;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#20154;&#12399;&#12289;&#38283;&#30330;&#32773;&#12383;&#12385;&#12398;&#27671;&#12434;&#24341;&#12367;&#12424;&#12358;&#12395;
  &#12431;&#12374;&#12392;&#22823;&#12370;&#12373;&#12395;&#35441;&#12377;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12385;&#12423;&#12387;&#12392;&#27671;&#12395;&#12394;&#12427;&#28857;&#12364;&#35211;&#12388;&#12363;&#12387;&#12383;&#12392;&#12365;&#12395;
  &#12300;&#12371;&#12398;&#28145;&#21051;&#12394;&#21839;&#38988;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#31169; (&#12381;&#12375;&#12390;&#21451;&#20154;&#12420;&#21516;&#20698;&#12420;&#35242;&#25114;&#19968;&#21516;)
  &#12399;&#12414;&#12392;&#12418;&#12395;&#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12395;&#22577;&#21578;&#12377;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#21839;&#38988;&#12399;&#12518;&#12540;&#12470;&#12540;&#12363;&#12425;&#12398;&#22577;&#21578;&#12395;&#38480;&#12387;&#12383;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12383;&#12385;&#12384;&#12387;&#12390;&#12289;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12434;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#21516;&#12376;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#29305;&#12395;&#12289;&#12393;&#12385;&#12425;&#12364;&#27491;&#12375;&#12356;&#12363;&#12392;&#12356;&#12358;&#21839;&#38988;&#12424;&#12426;
  &#21508;&#33258;&#12398;&#22909;&#12415;&#12395;&#12363;&#12363;&#12431;&#12427;&#12424;&#12358;&#12394;&#21839;&#38988;&#12434;&#25201;&#12358;&#38555;&#12395;&#12381;&#12398;&#20670;&#21521;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
       "&#12381;&#12398;&#12420;&#12426;&#12363;&#12383;&#12384;&#12392;&#12289;&#12467;&#12540;&#12489;&#12364;&#35501;&#12415;&#12395;&#12367;&#12367;&#12394;&#12387;&#12385;&#12419;&#12358;&#12424;&#12290;
       &#20445;&#23432;&#12377;&#12427;&#20154;&#12399;&#12383;&#12414;&#12387;&#12383;&#12418;&#12435;&#12376;&#12419;&#12394;&#12356;&#12384;&#12429;&#12358;&#12394;&#12290;&#12381;&#12428;&#12395;&#24341;&#12365;&#25563;&#12360;
       J. Random &#12398;&#25552;&#26696;&#12375;&#12383;&#26041;&#27861;&#12399;..."
     </p></blockquote></div><p>
  &#12418;&#12358;&#23569;&#12375;&#25511;&#12360;&#12417;&#12394;&#35328;&#12356;&#12363;&#12383;&#12395;&#12375;&#12383;&#12411;&#12358;&#12364;&#12289;&#23455;&#38555;&#12398;&#27671;&#25345;&#12385;&#12399;&#20253;&#12431;&#12426;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
       "&#12383;&#12375;&#12363;&#12395;&#12381;&#12428;&#12391;&#12418;&#21205;&#12367;&#12424;&#12290;&#12391;&#12418;&#12289;&#21487;&#35501;&#24615;&#12420;&#20445;&#23432;&#24615;&#12434;&#32771;&#12360;&#12427;&#12392;&#12289;
       &#12381;&#12428;&#12399;&#29702;&#24819;&#30340;&#12394;&#12420;&#12426;&#12363;&#12383;&#12391;&#12399;&#12394;&#12356;&#12392;&#24605;&#12358;&#12435;&#12384;&#12290;J. Random
       &#12398;&#25552;&#26696;&#12377;&#12427;&#26041;&#27861;&#12384;&#12392;&#12381;&#12435;&#12394;&#21839;&#38988;&#12399;&#30330;&#29983;&#12375;&#12394;&#12356;&#12290;&#12394;&#12380;&#12394;&#12425;..."
     </p></blockquote></div><p>
  &#35463;&#22823;&#34920;&#29694;&#12434;&#23436;&#20840;&#12395;&#12394;&#12367;&#12377;&#12371;&#12392;&#12399;&#19981;&#21487;&#33021;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;&#12414;&#12383;&#19968;&#33324;&#12395;&#12381;&#12358;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20182;&#12398;&#35492;&#35299;&#12395;&#27604;&#12409;&#12427;&#12392;&#12289;&#35463;&#22823;&#34920;&#29694;&#12364;&#21450;&#12412;&#12377;&#34987;&#23475;&#12399;&#12381;&#12428;&#12411;&#12393;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20027;&#12395;&#26360;&#12365;&#25163;&#20596;&#12364;&#25613;&#12434;&#12377;&#12427;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#35501;&#12415;&#25163;&#20596;&#12399;&#12381;&#12428;&#12434;&#35036;&#27491;&#12375;&#12390;&#35501;&#12417;&#12427;&#12398;&#12391;&#12289;&#21336;&#12395;&#26360;&#12365;&#25163;&#12364;&#23569;&#12375;&#20449;&#38972;&#24615;&#12434;&#22833;&#12358;&#12392;&#12356;&#12358;&#12384;&#12369;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#12354;&#12394;&#12383;&#12398;&#24433;&#38911;&#21147;&#12434;&#32771;&#12360;&#12427;&#12392;&#12289;
  &#19981;&#35201;&#12394;&#35463;&#22823;&#34920;&#29694;&#12399;&#36991;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12392;&#12289;<span class="emphasis"><em>&#12354;&#12360;&#12390;</em></span>&#12461;&#12484;&#12417;&#12395;&#34920;&#29694;&#12377;&#12427;&#24517;&#35201;&#12364;&#29983;&#12376;&#12383;&#22580;&#21512;&#12395;
  &#21608;&#12426;&#12398;&#20154;&#12383;&#12385;&#12395;&#12381;&#12428;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12418;&#12425;&#12356;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12424;&#12367;&#35211;&#30452;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12427;&#31243;&#24230;&#20197;&#19978;&#12398;&#37327;&#12398;&#25991;&#31456;&#12434;&#26360;&#12356;&#12383;&#22580;&#21512;&#12399;&#12289;&#23436;&#25104;&#12375;&#12383;&#25991;&#31456;&#12434;&#23455;&#38555;&#12395;&#36865;&#20449;&#12377;&#12427;&#21069;&#12395;
  &#12418;&#12358;&#19968;&#24230;&#38957;&#12363;&#12425;&#35501;&#12415;&#30452;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#20316;&#25991;&#12398;&#25480;&#26989;&#12391;&#12418;&#21516;&#12376;&#12371;&#12392;&#12434;&#25945;&#12431;&#12387;&#12383;&#12363;&#12392;&#24605;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12371;&#12428;&#12399;&#12458;&#12531;&#12521;&#12452;&#12531;&#12398;&#35696;&#35542;&#12391;&#12418;&#29305;&#12395;&#37325;&#35201;&#12391;&#12377;&#12290;&#12458;&#12531;&#12521;&#12452;&#12531;&#12398;&#35696;&#35542;&#12399;&#26029;&#32154;&#30340;&#12394;&#12418;&#12398;&#12395;&#12394;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#12398;&#12391;
  (&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#36884;&#20013;&#12391;&#36942;&#21435;&#12398;&#12513;&#12540;&#12523;&#12434;&#35501;&#12415;&#30452;&#12375;&#12383;&#12426;&#12289;&#20309;&#12363;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#30906;&#35469;&#12375;&#12383;&#12426;&#12289;
  &#20309;&#12425;&#12363;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12487;&#12496;&#12483;&#12464;&#20986;&#21147;&#12434;&#21462;&#12426;&#36796;&#12435;&#12384;&#12426;&#12289;&#8230;&#8230;)&#12289;&#12388;&#12356;&#12388;&#12356;&#35542;&#26088;&#12434;&#35211;&#22833;&#12356;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#26029;&#32154;&#30340;&#12395;&#26360;&#12365;&#19978;&#12370;&#12383;&#12354;&#12392;&#12391;&#19968;&#20999;&#12481;&#12455;&#12483;&#12463;&#12379;&#12378;&#12395;&#36865;&#20449;&#12375;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;
  &#35501;&#12415;&#25163;&#12395;&#12418;&#12381;&#12398;&#12424;&#12358;&#12395;&#21463;&#12369;&#21462;&#12425;&#12428;&#12390;&#12375;&#12414;&#12356;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#26360;&#12365;&#25163;&#12395;&#12392;&#12387;&#12390;&#12418;&#12358;&#12428;&#12375;&#12356;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12365;&#12385;&#12435;&#12392;&#26178;&#38291;&#12434;&#12392;&#12387;&#12390;&#12289;&#26360;&#12356;&#12383;&#20869;&#23481;&#12434;&#35211;&#30452;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#25237;&#31295;&#20869;&#23481;&#12364;&#12365;&#12385;&#12435;&#12392;&#12414;&#12392;&#12414;&#12387;&#12390;&#12356;&#12428;&#12400;&#12356;&#12427;&#12411;&#12393;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35501;&#12435;&#12391;&#12418;&#12425;&#12356;&#12420;&#12377;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#21475;&#35519;"><div class="titlepage"><div><div><h3 class="title"><a name="writing-tone"></a>&#21475;&#35519;</h3></div></div></div><p>
  &#32368;&#12426;&#36820;&#12375;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20316;&#25104;&#12375;&#12390;&#12356;&#12427;&#12358;&#12385;&#12395;&#12289;
  &#12362;&#12381;&#12425;&#12367;&#33258;&#20998;&#12398;&#25991;&#38754;&#12364;&#12363;&#12394;&#12426;&#32032;&#12387;&#27671;&#12394;&#12356;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12356;&#12367;&#12371;&#12392;&#12395;&#27671;&#12389;&#12367;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12411;&#12392;&#12435;&#12393;&#12398;&#25216;&#34899;&#31995;&#12501;&#12457;&#12540;&#12521;&#12512;&#12391;&#12354;&#12426;&#12364;&#12385;&#12394;&#35441;&#12391;&#12377;&#12375;&#12289;&#12381;&#12428;&#33258;&#20307;&#12395;&#12399;&#29305;&#12395;&#21839;&#38988;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#19968;&#33324;&#31038;&#20250;&#12391;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12354;&#12426;&#12360;&#12394;&#12356;&#12424;&#12358;&#12394;&#32032;&#12387;&#27671;&#28961;&#12356;&#12420;&#12426;&#21462;&#12426;&#12364;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12495;&#12483;&#12459;&#12540;&#12383;&#12385;&#12398;&#38291;&#12391;&#12399;&#12372;&#12367;&#26222;&#36890;&#12394;&#12398;&#12391;&#12377;&#12290;&#20197;&#19979;&#12395;&#24341;&#29992;&#12377;&#12427;&#12398;&#12399;&#12289;
  &#12392;&#12354;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#31649;&#29702;&#12477;&#12501;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12363;&#12388;&#12390;&#31169;&#12364;&#25237;&#31295;&#12375;&#12383;&#12392;&#12365;&#12395;
  &#21463;&#12369;&#21462;&#12387;&#12383;&#36820;&#20449;&#12391;&#12377;&#12290;
</p><pre class="screen">
&#12393;&#12435;&#12394;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12383;&#12398;&#12363;&#12289;&#12418;&#12358;&#12385;&#12423;&#12387;&#12392;&#35443;&#12375;&#12367;&#27491;&#30906;&#12395;&#35500;&#26126;&#12375;&#12390;&#12367;&#12428;&#12414;&#12379;&#12435;&#12363;&#65311;

&#12381;&#12428;&#12363;&#12425;&#12290;

&#12362;&#20351;&#12356;&#12398; Slash &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#20309;&#12391;&#12377;&#12363;&#65311;
&#20803;&#12398;&#25237;&#31295;&#12363;&#12425;&#12399;&#12381;&#12428;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;

apache/mod_perl &#12398;&#12477;&#12540;&#12473;&#12434;&#12499;&#12523;&#12489;&#12375;&#12383;&#25163;&#38918;&#12434;&#27491;&#30906;&#12395;&#25945;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;

slashcode.com &#12395;&#25237;&#31295;&#12373;&#12428;&#12383; Apache 2.0 &#12398;&#12497;&#12483;&#12481;&#12434;&#35430;&#12375;&#12390;&#12415;&#12414;&#12375;&#12383;&#12363;&#65311;

  Shane
</pre><p>
  &#12414;&#12373;&#12395;&#31777;&#28500;&#12381;&#12398;&#12418;&#12398;&#12391;&#12377;&#65281; &#25384;&#25334;&#12418;&#12394;&#12369;&#12428;&#12400;&#32626;&#21517;&#12399;&#33258;&#20998;&#12398;&#21517;&#21069;&#12384;&#12369;&#12290;
  &#12381;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26412;&#25991;&#12399;&#12392;&#35328;&#12360;&#12400;
  &#19968;&#36899;&#12398;&#36074;&#21839;&#20107;&#38917;&#12434;&#21487;&#33021;&#12394;&#38480;&#12426;&#31777;&#28500;&#12395;&#20006;&#12409;&#12383;&#12384;&#12369;&#12290;
  &#21807;&#19968;&#12354;&#12387;&#12383;&#36074;&#21839;&#20197;&#22806;&#12398;&#25991;&#12399;&#12392;&#12356;&#12360;&#12400;&#12289;&#31169;&#12398;&#20803;&#12398;&#25237;&#31295;&#12395;&#23550;&#12377;&#12427;&#38291;&#25509;&#30340;&#12394;&#25209;&#21028;&#12391;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#31169;&#12399; Shane &#12398;&#12513;&#12540;&#12523;&#12434;&#35211;&#12390;&#27671;&#12434;&#24746;&#12367;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#24444;&#12398;&#32032;&#12387;&#27671;&#12394;&#12356;&#36820;&#31572;&#12434;&#35211;&#12390;&#12418;&#12300;&#12354;&#12354;&#12289;&#24537;&#12375;&#12356;&#20154;&#12394;&#12435;&#12384;&#12429;&#12358;&#12394;&#12301;
  &#12392;&#12356;&#12358;&#12367;&#12425;&#12356;&#12398;&#12371;&#12392;&#12375;&#12363;&#24605;&#12431;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12399;&#31169;&#12398;&#25237;&#31295;&#12434;&#28961;&#35222;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12383;&#12398;&#12395;&#12289;&#12354;&#12360;&#12390;&#36074;&#21839;&#12434;&#36820;&#12375;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12371;&#12428;&#12399;&#12289;&#24444;&#12364;&#31169;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12377;&#12409;&#12390;&#12398;&#35501;&#12415;&#25163;&#12364;&#12371;&#12398;&#12424;&#12358;&#12395;&#22909;&#24847;&#30340;&#12395;&#21463;&#12369;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
  &#24517;&#12378;&#12375;&#12418;&#12381;&#12358;&#12391;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12381;&#12428;&#12399;&#12381;&#12398;&#20154;&#12420;&#29366;&#27841;&#12395;&#12424;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12427;&#20154;&#12364;&#33258;&#20998;&#12398;&#29359;&#12375;&#12383;&#38291;&#36949;&#12356; (&#12362;&#12381;&#12425;&#12367;&#24444;&#22899;&#12399;&#12496;&#12464;&#12434;&#26360;&#12356;&#12390;&#12375;&#12414;&#12387;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;)
  &#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12377;&#12427;&#25237;&#31295;&#12434;&#12375;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12398;&#32076;&#39443;&#12363;&#12425;&#12289;&#12354;&#12394;&#12383;&#12399;&#24444;&#22899;&#12364;&#27671;&#12398;&#23567;&#12373;&#12356;&#20154;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#12418;&#12385;&#12429;&#12435;&#31777;&#28500;&#12394;&#36820;&#20449;&#12434;&#26360;&#12367;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12364;
  &#23569;&#12375;&#12399;&#24444;&#22899;&#12398;&#27671;&#25345;&#12385;&#12434;&#27671;&#12395;&#12363;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#36820;&#20449;&#12398;&#22823;&#37096;&#20998;&#12399;&#12289;&#31777;&#28500;&#12395;&#25216;&#34899;&#32773;&#12398;&#35222;&#28857;&#12391;&#35211;&#12383;&#20998;&#26512;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12363;&#12394;&#12426;&#32032;&#12387;&#27671;&#12394;&#12356;&#12418;&#12398;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12381;&#12435;&#12394;&#22580;&#21512;&#12391;&#12418;
  &#12300;&#31777;&#28500;&#12395;&#26360;&#12356;&#12390;&#12356;&#12427;&#12398;&#12399;&#27770;&#12375;&#12390;&#21531;&#12434;&#20919;&#12420;&#12420;&#12363;&#12394;&#30446;&#12391;&#35211;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12399;&#12394;&#12356;&#12435;&#12384;&#12424;&#12301;
  &#12392;&#12431;&#12363;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#26368;&#24460;&#12395;&#20309;&#12363;&#31034;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12496;&#12464;&#12434;&#20462;&#27491;&#12377;&#12427;&#12383;&#12417;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12434;&#12402;&#12392;&#12392;&#12362;&#12426;&#24544;&#21578;&#12375;&#12383;&#24460;&#12398;&#32224;&#12417;&#12398;&#35328;&#33865;&#12392;&#12375;&#12390;
  &#12300;&#12376;&#12419;&#12289;&#12364;&#12435;&#12400;&#12387;&#12390;&#12397;&#12290;&lt;&#12354;&#12394;&#12383;&#12398;&#21517;&#21069;&gt;&#12424;&#12426;&#12301;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#26360;&#12356;&#12390;&#12362;&#12369;&#12400;&#12289;
  &#27770;&#12375;&#12390;&#12354;&#12394;&#12383;&#12395;&#24746;&#27671;&#12364;&#12354;&#12427;&#12431;&#12369;&#12376;&#12419;&#12394;&#12356;&#12371;&#12392;&#12364;&#20253;&#12431;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#24847;&#22259;&#30340;&#12395;&#32117;&#25991;&#23383;&#12434;&#20351;&#12387;&#12390;&#12415;&#12383;&#12426;&#12375;&#12390;
  &#30456;&#25163;&#12395;&#23433;&#24515;&#24863;&#12434;&#19982;&#12360;&#12427;&#12392;&#12356;&#12358;&#20316;&#25126;&#12418;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;
</p><p>
  &#21442;&#21152;&#32773;&#12364;&#12393;&#12358;&#24863;&#12376;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#12356;&#12385;&#12356;&#12385;&#27671;&#12395;&#12377;&#12427;&#12398;&#12434;&#22793;&#12395;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12418;&#12289;&#12406;&#12387;&#12385;&#12419;&#12369;&#12383;&#35441;&#12289;&#20154;&#12398;&#24863;&#24773;&#12392;&#12356;&#12358;&#12418;&#12398;&#12399;&#29983;&#29987;&#24615;&#12395;&#22823;&#12365;&#12394;&#24433;&#38911;&#12434;&#21450;&#12412;&#12375;&#12414;&#12377;&#12290;
  &#24863;&#24773;&#12399;&#20182;&#12398;&#24847;&#21619;&#12391;&#12418;&#37325;&#35201;&#12391;&#12377;&#12364;&#12289;&#12354;&#12360;&#12390;&#23455;&#30410;&#12398;&#31684;&#22258;&#12395;&#30340;&#12434;&#32094;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#19981;&#28288;&#12434;&#24863;&#12376;&#12390;&#12356;&#12427;&#20154;&#12399;&#12424;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26360;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#38651;&#23376;&#12513;&#12487;&#12451;&#12450;&#12395;&#12399;&#22810;&#12367;&#12398;&#21046;&#32004;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;
  &#20154;&#12364;&#20309;&#12434;&#24863;&#12376;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#30693;&#12427;&#25163;&#12364;&#12363;&#12426;&#12434;&#24120;&#12395;&#24471;&#12425;&#12428;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12371;&#12391;&#12289;a) &#12371;&#12435;&#12394;&#22580;&#21512;&#12395;&#26222;&#36890;&#12398;&#20154;&#12399;&#12393;&#12435;&#12394;&#12405;&#12358;&#12395;&#24863;&#12376;&#12427;&#12384;&#12429;&#12358;&#12363;&#65311;
  b) &#36942;&#21435;&#12398;&#12420;&#12426;&#12392;&#12426;&#12363;&#12425;&#12289;&#12371;&#12398;&#20154;&#12399;&#12393;&#12435;&#12394;&#20154;&#29289;&#12384;&#12392;&#32771;&#12360;&#12425;&#12428;&#12427;&#12384;&#12429;&#12358;&#12363;&#65311;
  &#12392;&#12356;&#12387;&#12383;&#20869;&#23481;&#12434;&#12418;&#12392;&#12395;&#32076;&#39443;&#12363;&#12425;&#25512;&#28204;&#12377;&#12427;&#24517;&#35201;&#12364;&#12391;&#12390;&#12365;&#12414;&#12377;&#12290;
  &#20013;&#12395;&#12399;&#12418;&#12387;&#12392;&#31361;&#12365;&#25918;&#12375;&#12383;&#24907;&#24230;&#12391;&#12289;&#21336;&#32020;&#12395;&#38989;&#38754;&#36890;&#12426;&#12398;&#23550;&#24540;&#12434;&#12377;&#12427;&#12371;&#12392;&#12434;&#22909;&#12416;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#24444;&#22899;&#12364;&#33258;&#20998;&#12391;&#12300;&#31169;&#12289;&#12371;&#12358;&#24605;&#12358;&#12435;&#12391;&#12377;&#12301;&#12392;&#35328;&#12431;&#12394;&#12356;&#38480;&#12426;&#12399;
  &#27770;&#12375;&#12390;&#12381;&#12428;&#12395;&#23550;&#12377;&#12427;&#23550;&#24540;&#12434;&#12375;&#12394;&#12356;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#20491;&#20154;&#30340;&#12395;&#12399;&#12371;&#12398;&#26041;&#27861;&#12399;&#12362;&#12377;&#12377;&#12417;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12395;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#29702;&#30001;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#29694;&#23455;&#12398;&#19990;&#30028;&#12391;&#12399;&#12415;&#12435;&#12394;&#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#65311;
  &#20309;&#12391;&#12458;&#12531;&#12521;&#12452;&#12531;&#12384;&#12392;&#12381;&#12358;&#12394;&#12427;&#12435;&#12391;&#12377;&#12363;&#65311;
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12290;&#12383;&#12356;&#12390;&#12356;&#12398;&#12420;&#12426;&#12392;&#12426;&#12399;&#20844;&#38283;&#12398;&#22580;&#25152;&#12391;&#34892;&#12431;&#12428;&#12427;&#12398;&#12391;&#12289;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#12503;&#12521;&#12452;&#12505;&#12540;&#12488;&#12394;&#22580;&#25152;&#12395;&#27604;&#12409;&#12390;&#33258;&#20998;&#12398;&#24863;&#24773;&#12434;&#25233;&#12360;&#12364;&#12385;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12358;&#23569;&#12375;&#27491;&#30906;&#12395;&#35328;&#12358;&#12392;&#12289;&#20182;&#20154;&#12395;&#23550;&#12377;&#12427;&#24863;&#24773; (&#24863;&#35613;&#12420;&#24594;&#12426;&#12394;&#12393;)
  &#12399;&#34920;&#29694;&#12375;&#12390;&#12418;&#12363;&#12414;&#12431;&#12394;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12364;&#12289;&#20869;&#24515; (&#19981;&#23433;&#12420;&#12503;&#12521;&#12452;&#12489;&#12394;&#12393;)
  &#12399;&#30693;&#12425;&#12428;&#12383;&#12367;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#22823;&#21322;&#12398;&#20154;&#12383;&#12385;&#12399;
  &#21608;&#22258;&#12398;&#20154;&#12364;&#33258;&#20998;&#12398;&#12371;&#12392;&#12434;&#12424;&#12367;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12392;&#24863;&#12376;&#12390;&#12356;&#12428;&#12400;&#12424;&#12356;&#20181;&#20107;&#12434;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
  &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12371;&#12392;&#12434;&#27671;&#12395;&#12363;&#12369;&#12427;&#12384;&#12369;&#12391;&#12289;&#29366;&#27841;&#12434;&#12358;&#12414;&#12367;&#21028;&#26029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#20170;&#20197;&#19978;&#12395;&#20154;&#12434;&#12420;&#12427;&#27671;&#12395;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12459;&#12454;&#12531;&#12475;&#12521;&#12540;&#12395;&#12394;&#12428;&#12301;
  &#12300;&#30342;&#12364;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12369;&#12427;&#12424;&#12358;&#24120;&#12395;&#25163;&#21161;&#12369;&#12375;&#12390;&#12420;&#12428;&#12301;
  &#12392;&#35328;&#12356;&#12383;&#12356;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#30342;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#25391;&#33310;&#12387;&#12390;&#12356;&#12427;&#12363;&#12434;&#27880;&#24847;&#28145;&#12367;&#27671;&#12395;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
  &#23455;&#38555;&#12395;&#38754;&#12392;&#21521;&#12363;&#12387;&#12390;&#20250;&#12387;&#12383;&#12371;&#12392;&#12398;&#12394;&#12356;&#20154;&#12391;&#12418;
  &#12393;&#12435;&#12394;&#20154;&#12394;&#12398;&#12363;&#12364;&#12394;&#12435;&#12392;&#12394;&#12367;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#33258;&#20998;&#12364;&#20309;&#12363;&#26360;&#12367;&#12392;&#12365;&#12398;&#21475;&#35519;&#12395;&#27671;&#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12377;&#12428;&#12400;&#12289;
  &#12354;&#12394;&#12383;&#12395;&#23550;&#12377;&#12427;&#21608;&#12426;&#12398;&#21360;&#35937;&#12399;&#39514;&#12367;&#12411;&#12393;&#12424;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12395;&#12392;&#12387;&#12390;&#12418;&#12424;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#20309;&#12364;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12398;&#12363;"><div class="titlepage"><div><div><h3 class="title"><a name="rudeness"></a>&#20309;&#12364;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12398;&#12363;</h3></div></div></div><p>
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#25991;&#21270;&#12398;&#29305;&#24615;&#12398;&#12402;&#12392;&#12388;&#12395;&#12289;
  &#20309;&#12364;&#22833;&#31036;&#12391;&#20309;&#12364;&#22833;&#31036;&#12391;&#12394;&#12356;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#38306;&#12377;&#12427;&#29420;&#29305;&#12398;&#22522;&#28310;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#20197;&#19979;&#12391;&#35500;&#26126;&#12377;&#12427;&#20869;&#23481;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#12420;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#20840;&#33324;&#12395;&#29305;&#26377;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;
  (&#25968;&#23398;&#12420;&#33258;&#28982;&#31185;&#23398;&#12289;&#24037;&#23398;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12394;&#12425;&#12362;&#12394;&#12376;&#12415;&#12398;&#12418;&#12398;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12399;&#20154;&#26448;&#12398;&#20986;&#20837;&#12426;&#12364;&#38971;&#32321;&#12395;&#34892;&#12431;&#12428;&#12289;
  &#26032;&#12375;&#12356;&#20154;&#12383;&#12385;&#12364;&#24120;&#12395;&#27969;&#20837;&#12375;&#12390;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12358;&#12356;&#12358;&#32771;&#12360;&#26041;&#12395;&#12394;&#12376;&#12415;&#12398;&#12394;&#12356;&#20154;&#12383;&#12385;&#12364;&#27969;&#20837;&#12375;&#12390;&#12367;&#12427;&#12371;&#12392;&#12418;&#22823;&#12356;&#12395;&#12354;&#12426;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12414;&#12378;&#12399;&#12289;&#22833;&#31036;&#12391;&#12399; <span class="emphasis"><em>&#12394;&#12356;</em></span> &#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#25216;&#34899;&#30340;&#12394;&#25209;&#35413;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#12383;&#12392;&#12360;&#12381;&#12428;&#12364;&#30452;&#25509;&#30340;&#12391;&#27503;&#12395;&#34915;&#30528;&#12379;&#12396;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;&#12418;&#22833;&#31036;&#12395;&#12399;&#12354;&#12383;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#36870;&#12395;&#12381;&#12428;&#12399;&#12411;&#12417;&#35328;&#33865;&#12392;&#12418;&#12392;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#25209;&#35413;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#12381;&#12428;&#12364;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#30495;&#21091;&#12395;&#35696;&#35542;&#12377;&#12427;&#20385;&#20516;&#12364;&#12354;&#12427;&#12418;&#12398;&#12384;&#12392;&#26263;&#12395;&#35469;&#12417;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12364;&#12358;&#12414;&#12367;&#25104;&#38263;&#12377;&#12427;&#12392;&#12289;&#25209;&#21028;&#12424;&#12426;&#12418;&#36062;&#36059;&#12398;&#12411;&#12358;&#12364;&#22810;&#12367;&#12394;&#12387;&#12390;&#12367;&#12427;&#12431;&#12369;&#12391;&#12377;
  (&#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12398;&#25209;&#35413;&#12364;&#20491;&#20154;&#25915;&#25731;&#12395;&#25104;&#12426;&#19979;&#12364;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12426;
  &#12381;&#12398;&#20182;&#12398;&#26126;&#12425;&#12363;&#12395;&#22833;&#31036;&#12394;&#20869;&#23481;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12360;&#12414;&#12377;)&#12290;
</p><p>
  &#12406;&#12387;&#12365;&#12425;&#12412;&#12358;&#12391;&#32032;&#12387;&#27671;&#12394;&#12356;&#36074;&#21839;&#12289;&#12383;&#12392;&#12360;&#12400;&#20808;&#12411;&#12393;&#24341;&#29992;&#12375;&#12383; Shane
  &#12398;&#12513;&#12540;&#12523;&#12398;&#12424;&#12358;&#12394;&#36074;&#21839;&#12399;&#22833;&#31036;&#12395;&#12399;&#12354;&#12383;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#12399;&#12385;&#12423;&#12387;&#12392;&#38750;&#24773;&#12395;&#35211;&#12360;&#12383;&#12426;&#39340;&#40575;&#12395;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24863;&#12376;&#12425;&#12428;&#12427;&#12424;&#12358;&#12394;&#36074;&#21839;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12399;&#30495;&#21091;&#12395;&#12394;&#12373;&#12428;&#12383;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#24517;&#35201;&#12394;&#24773;&#22577;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#25163;&#26089;&#12367;&#24341;&#12365;&#20986;&#12375;&#12383;&#12356;&#12392;&#12356;&#12358;&#20197;&#22806;&#12395;&#38560;&#12373;&#12428;&#12383;&#24847;&#22259;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12469;&#12509;&#12540;&#12488;&#12475;&#12531;&#12479;&#12540;&#12398;&#26377;&#21517;&#12394;&#36074;&#21839;&#12391;&#12354;&#12427;&#12300;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#12467;&#12531;&#12475;&#12531;&#12488;&#12399;&#12385;&#12419;&#12435;&#12392;&#12373;&#12373;&#12387;&#12390;&#12356;&#12414;&#12377;&#12363;&#65311;&#12301;
  &#12392;&#12356;&#12358;&#12398;&#12399;&#20856;&#22411;&#30340;&#12394;&#20363;&#12391;&#12377;&#12290;&#12469;&#12509;&#12540;&#12488;&#20418;&#12398;&#20154;&#12399;&#12289;
  &#12383;&#12384;&#21336;&#12395;&#12467;&#12531;&#12475;&#12531;&#12488;&#12364;&#12373;&#12373;&#12387;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30693;&#12426;&#12383;&#12356;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#20181;&#20107;&#12434;&#22987;&#12417;&#12383;&#12400;&#12363;&#12426;&#12398;&#12371;&#12429;&#12399;&#12371;&#12398;&#36074;&#21839;&#12398;&#21069;&#12395;&#12356;&#12385;&#12356;&#12385;&#19969;&#23527;&#12394;&#21069;&#32622;&#12365;
  ("&#12377;&#12415;&#12414;&#12379;&#12435;&#12364;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#21487;&#33021;&#24615;&#12434;&#25490;&#38500;&#12377;&#12427;&#12383;&#12417;&#12395;&#23569;&#12293;&#36074;&#21839;&#12373;&#12379;&#12390;&#12356;&#12383;&#12384;&#12356;&#12390;&#12424;&#12429;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
  &#20013;&#12395;&#12399;&#22522;&#26412;&#30340;&#12377;&#12366;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#25105;&#24930;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12397;&#8230;&#8230;")
  &#12434;&#12375;&#12390;&#12356;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12381;&#12428;&#12395;&#12418;&#30130;&#12428;&#12390;&#12365;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20170;&#12420;&#12289;&#24444;&#22899;&#12399;&#21336;&#20992;&#30452;&#20837;&#12395;&#12300;&#12373;&#12373;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12356;&#12394;&#12356;&#12398;&#12363;&#12301;&#12434;&#32862;&#12367;&#12384;&#12369;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12418;&#12289;&#21516;&#27096;&#12398;&#36074;&#21839;&#12364;&#25955;&#12293;&#34892;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#27770;&#12375;&#12390;&#30456;&#25163;&#12434;&#20398;&#36785;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26368;&#12418;&#26126;&#12425;&#12363;&#12394; (&#12381;&#12375;&#12390;&#12362;&#12381;&#12425;&#12367;&#26368;&#12418;&#12354;&#12426;&#12364;&#12385;&#12394;)
  &#21487;&#33021;&#24615;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#26089;&#12356;&#27573;&#38542;&#12391;&#25490;&#38500;&#12375;&#12390;&#12362;&#12365;&#12383;&#12356;&#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#12424;&#12367;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;&#25991;&#21477;&#12418;&#35328;&#12431;&#12378;&#12395;&#12381;&#12398;&#36074;&#21839;&#12395;&#24467;&#12356;&#12289;
  &#12424;&#12426;&#12424;&#12356;&#32080;&#26524;&#12434;&#24471;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12375;&#25991;&#21477;&#12434;&#35328;&#12358;&#20154;&#12364;&#12356;&#12390;&#12418;&#12381;&#12428;&#12434;&#12369;&#12394;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#21336;&#12394;&#12427;&#25991;&#21270;&#12398;&#30456;&#36949;&#12391;&#12354;&#12426;&#12289;&#12393;&#12385;&#12425;&#12364;&#24746;&#12356;&#12392;&#12363;&#12356;&#12358;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#36074;&#21839; (&#12354;&#12427;&#12356;&#12399;&#25209;&#35413;) &#12395;&#12399;&#38560;&#12428;&#12383;&#24847;&#21619;&#12399;&#12414;&#12387;&#12383;&#12367;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35500;&#26126;&#12375;&#12390;&#12354;&#12370;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#21336;&#12395;&#24773;&#22577;&#12434;&#21177;&#29575;&#30340;&#12395;&#21462;&#24471;&#12375;&#12383;&#12363;&#12387;&#12383; (&#12354;&#12427;&#12356;&#12399;&#20253;&#12360;&#12383;&#12363;&#12387;&#12383;) &#12384;&#12369;&#12391;&#12354;&#12426;&#12289;
  &#12381;&#12428;&#20197;&#19978;&#12391;&#12418;&#20197;&#19979;&#12391;&#12418;&#12394;&#12356;&#12392;&#35328;&#12360;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>&#12391;&#12399;&#12289;&#20309;&#12364;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;</p><p>
  &#20808;&#12411;&#12393;&#12289;&#25216;&#34899;&#30340;&#12394;&#25209;&#35413;&#12434;&#12377;&#12427;&#12371;&#12392;&#12399;&#19968;&#31278;&#12398;&#12411;&#12417;&#35328;&#33865;&#12395;&#12354;&#12383;&#12427;&#12392;&#35328;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#35251;&#28857;&#12363;&#12425;&#35328;&#12358;&#12392;&#12289;&#30495;&#21091;&#12394;&#25209;&#35413;&#12434;&#12375;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#19968;&#31278;&#12398;&#20398;&#36785;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#35504;&#12363;&#12398;&#20316;&#26989; (&#20309;&#12425;&#12363;&#12398;&#25552;&#26696;&#12420;&#12467;&#12540;&#12489;&#12398;&#22793;&#26356;&#12289;&#12496;&#12464;&#12398;&#22577;&#21578;&#12394;&#12393;)
  &#12434;&#21336;&#12395;&#28961;&#35222;&#12377;&#12427;&#12371;&#12392;&#12434;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12392;&#12391;&#12365;&#12385;&#12435;&#12392;&#36820;&#20107;&#12434;&#12377;&#12427;&#12392;&#32004;&#26463;&#12375;&#12383;&#12398;&#12391;&#12394;&#12356;&#38480;&#12426;&#12289;
  &#20309;&#12418;&#21453;&#24540;&#12375;&#12394;&#12367;&#12390;&#12418;&#19968;&#21521;&#12395;&#21839;&#38988;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21608;&#12426;&#12398;&#20154;&#12418;&#12289;&#21336;&#12395;&#20309;&#12363;&#35328;&#12358;&#12384;&#12369;&#12398;&#26178;&#38291;&#12364;&#12394;&#12363;&#12387;&#12383;&#12435;&#12384;&#12392;&#12415;&#12394;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12375;&#20309;&#12363;&#21453;&#24540;&#12434;&#36820;&#12377;&#12398;&#12394;&#12425;&#12289;&#27770;&#12375;&#12390;&#25163;&#25244;&#12365;&#12434;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#12375;&#12387;&#12363;&#12426;&#20998;&#26512;&#12375;&#12289;&#24517;&#35201;&#12394;&#12425;&#36969;&#20999;&#12394;&#12469;&#12531;&#12503;&#12523;&#12434;&#29992;&#24847;&#12375;&#12289;
  &#36942;&#21435;&#12525;&#12464;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12363;&#12425;&#38306;&#36899;&#12377;&#12427;&#35696;&#35542;&#12434;&#25506;&#12377;&#12392;&#12356;&#12387;&#12383;&#20316;&#26989;&#12434;&#27424;&#12363;&#12373;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12427;&#26178;&#38291;&#12399;&#12394;&#12356;&#12364;&#12289;&#12391;&#12418;&#19968;&#35328;&#12384;&#12369;&#12356;&#12387;&#12390;&#12362;&#12365;&#12383;&#12356;&#12392;&#12356;&#12358;&#22580;&#21512;&#12399;&#12289;
  &#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20013;&#12395;&#37320;&#26126;&#12434;&#12356;&#12428;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;
  ("&#12371;&#12428;&#12289;&#12383;&#12375;&#12363;&#12496;&#12464;&#12392;&#12375;&#12390;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12383;&#12399;&#12378;&#12394;&#12435;&#12384;&#12369;&#12393;&#12289;
  &#20170;&#12385;&#12423;&#12387;&#12392;&#25506;&#12375;&#12390;&#12356;&#12427;&#12498;&#12510;&#12364;&#12394;&#12356;&#12435;&#12384;&#12290;&#12372;&#12417;&#12435;&#12397;" &#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12395;)&#12290;
  &#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#25991;&#21270;&#30340;&#12394;&#22522;&#28310;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#35469;&#35672;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#22522;&#28310;&#12399;&#23432;&#12427;&#12371;&#12392;&#12290;&#12381;&#12375;&#12390;&#12418;&#12375;&#23432;&#12428;&#12394;&#12356;&#20107;&#24773;&#12364;&#12354;&#12427;&#12392;&#12365;&#12399;&#12289;
  &#23432;&#12428;&#12394;&#12356;&#12371;&#12392;&#12434;&#35469;&#35672;&#12375;&#12390;&#12356;&#12427;&#12392;&#30693;&#12425;&#12379;&#12427;&#12371;&#12392;&#12290;
  &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;&#22522;&#28310;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#22522;&#28310;&#12434;&#23432;&#12428;&#12394;&#12363;&#12387;&#12383;&#19978;&#12395;&#12381;&#12398;&#29702;&#30001;&#12418;&#35500;&#26126;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12394;&#12427;&#12392;&#12289;&#12381;&#12398;&#35441;&#38988; (&#12381;&#12375;&#12390;&#38306;&#20418;&#32773;&#12383;&#12385;)
  &#12395;&#23550;&#12375;&#12390;&#21313;&#20998;&#12395;&#26178;&#38291;&#12434;&#12363;&#12369;&#12427;&#12384;&#12369;&#12398;&#20385;&#20516;&#12364;&#12394;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24605;&#12431;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#24608;&#12369;&#32773;&#12391;&#12354;&#12427;&#12392;&#24605;&#12431;&#12428;&#12427;&#12424;&#12426;&#12418;&#12289;
  &#21336;&#12395;&#26178;&#38291;&#12364;&#12394;&#12356;&#12384;&#12369;&#12394;&#12435;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#29575;&#30452;&#12395;&#35500;&#26126;&#12375;&#12390;&#12362;&#12367;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#20197;&#22806;&#12395;&#12418;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12371;&#12392;&#12399;&#22810;&#12293;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12381;&#12398;&#22810;&#12367;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#12395;&#38480;&#12387;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#19968;&#33324;&#24120;&#35672;&#12398;&#31684;&#22258;&#12391;&#21028;&#26029;&#12391;&#12365;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12414;&#12384;&#12372;&#35239;&#12395;&#12394;&#12387;&#12390;&#12356;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;<span>
  <a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a></span> &#12398;
  <a class="xref" href="setting-tone.html#prevent-rudeness" title="&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;">&#12300;&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;&#12301;</a> &#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="&#38996;"><div class="titlepage"><div><div><h3 class="title"><a name="face"></a>&#38996;</h3></div></div></div><p>
  &#20154;&#38291;&#12398;&#33075;&#12395;&#12399;&#12289;&#34920;&#24773;&#12434;&#35469;&#30693;&#12377;&#12427;&#12383;&#12417;&#12398;&#38936;&#22495;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#36890;&#31216;&#12399; "fusiform face area" &#12391;&#12377;&#12290;
  &#12381;&#12398;&#27231;&#33021;&#12398;&#22823;&#21322;&#12399;&#20808;&#22825;&#30340;&#12394;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;&#24460;&#12363;&#12425;&#36523;&#12395;&#12388;&#12369;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20491;&#12293;&#12398;&#20154;&#29289;&#12434;&#35211;&#20998;&#12369;&#12427;&#12392;&#12356;&#12358;&#25216;&#33021;&#12399;&#29983;&#12365;&#24310;&#12403;&#12427;&#12383;&#12417;&#12395;&#12365;&#12431;&#12417;&#12390;&#37325;&#35201;&#12394;&#12418;&#12398;&#12394;&#12398;&#12391;&#12289;
  &#23554;&#29992;&#12398;&#29305;&#21029;&#12394;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12364;&#30330;&#36948;&#12375;&#12390;&#12365;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12434;&#20351;&#29992;&#12375;&#12383;&#20849;&#21516;&#20316;&#26989;&#12399;&#12289;&#24515;&#29702;&#23398;&#30340;&#12395;&#12399;&#12385;&#12423;&#12387;&#12392;&#22855;&#22937;&#12394;&#12418;&#12398;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12384;&#12387;&#12390;&#12289;&#32202;&#23494;&#12394;&#36899;&#25658;&#12434;&#12392;&#12387;&#12390;&#12356;&#12427;&#30456;&#25163;&#12398;&#12371;&#12392;&#12434;&#12289;
  &#33258;&#28982;&#12391;&#30452;&#24863;&#30340;&#12394;&#26041;&#27861;&#12391;&#12399;&#27770;&#12375;&#12390;&#35469;&#35672;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12393;&#12435;&#12394;&#38996;&#12394;&#12398;&#12363;&#12418;&#12431;&#12363;&#12425;&#12394;&#12369;&#12428;&#12400;&#12393;&#12435;&#12394;&#22768;&#12394;&#12398;&#12363;&#12418;&#12431;&#12363;&#12425;&#12394;&#12356;&#12289;
  &#12381;&#12375;&#12390;&#12393;&#12435;&#12394;&#32972;&#26684;&#22909;&#12394;&#12398;&#12363;&#12418;&#12431;&#12363;&#12425;&#12394;&#12356;&#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12434;&#35036;&#12358;&#12395;&#12399;&#12289;&#29305;&#23450;&#12398; <em class="firstterm">&#12473;&#12463;&#12522;&#12540;&#12531;&#12493;&#12540;&#12512;</em>
  &#12434;&#27770;&#12417;&#12390;&#12354;&#12425;&#12422;&#12427;&#22580;&#25152;&#12391;&#12381;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#24515;&#12364;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20808;&#38957; (@ &#35352;&#21495;&#12424;&#12426;&#21069;) &#12398;&#37096;&#20998;&#12420; IRC &#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12289;
  &#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#21517;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12394;&#12393;&#12394;&#12393;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#22580;&#25152;&#12391;&#12371;&#12398;&#12473;&#12463;&#12522;&#12540;&#12531;&#12493;&#12540;&#12512;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#21517;&#21069;&#12364;&#12289;&#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#12398;&#12354;&#12394;&#12383;&#12398; "&#38996;" &#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#30701;&#12356;&#25991;&#23383;&#21015;&#12391;&#12289;&#23455;&#38555;&#12398;&#38996;&#12392;&#21516;&#12376;&#20685;&#12365;&#12434;&#12373;&#12379;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#27531;&#24565;&#12394;&#12364;&#12425;&#31169;&#12383;&#12385;&#12398;&#33075;&#12395;&#12399;&#12371;&#12428;&#12395;&#30452;&#25509;&#21453;&#24540;&#12377;&#12427;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12399;&#20869;&#34101;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12431;&#12369;&#12391;&#12377;&#12364;&#12290;
</p><p>
  &#12473;&#12463;&#12522;&#12540;&#12531;&#12493;&#12540;&#12512;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#23455;&#21517;&#12363;&#12425;&#30452;&#24863;&#30340;&#12395;&#24471;&#12425;&#12428;&#12427;&#12418;&#12398;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;
  (&#12383;&#12392;&#12360;&#12400;&#31169;&#12399; "kfogel" &#12395;&#12375;&#12390;&#12356;&#12414;&#12377;)&#12290;&#12513;&#12540;&#12523;&#12504;&#12483;&#12480;&#12394;&#12393;&#12289;
  &#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#23455;&#21517;&#12434;&#23455;&#38555;&#12395;&#34920;&#35352;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
From: "Karl Fogel" &lt;kfogel@whateverdomain.com&gt;
</pre><p>
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12371;&#12398;&#20363;&#12395;&#12399; 2 &#12388;&#12398;&#20869;&#23481;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  &#20808;&#12411;&#12393;&#35500;&#26126;&#12375;&#12383;&#12424;&#12358;&#12395;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12493;&#12540;&#12512;&#12399;&#23455;&#21517;&#12392;&#30452;&#24863;&#30340;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23455;&#21517;&#12399; <span class="emphasis"><em>&#23455;&#38555;&#12398;</em></span>&#21517;&#21069;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12371;&#12428;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#20309;&#12425;&#12363;&#12398;&#20316;&#12426;&#19978;&#12370;&#12383;&#21517;&#31216;&#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><pre class="screen">
From: "Wonder Hacker" &lt;wonderhacker@whateverdomain.com&gt;
</pre><p>
  <em class="citetitle">The New Yorker</em> &#12398; 1993 &#24180; 7 &#26376; 5 &#26085;&#21495;&#12395;&#25522;&#36617;&#12373;&#12428;&#12383;
  Paul Steiner &#12398;&#26377;&#21517;&#12394;&#28459;&#30011;&#12391;&#12289;&#12354;&#12427;&#29356;&#12364;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#31471;&#26411;&#12395;&#12525;&#12464;&#12452;&#12531;&#12377;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#24433;&#12398;&#22768;&#12364;&#12371;&#12358;&#35328;&#12356;&#12414;&#12377;&#12290;"&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12391;&#12399;&#12289;&#35504;&#12418;&#21531;&#12364;&#29356;&#12384;&#12394;&#12435;&#12390;&#24605;&#12431;&#12394;&#12356;&#12384;&#12429;&#12358;"
  &#12371;&#12398;&#25163;&#12398;&#12371;&#12392;&#12434;&#32771;&#12360;&#12427;&#20154;&#12383;&#12385;&#12398;&#38957;&#12398;&#20013;&#12395;&#12399;&#12365;&#12387;&#12392;&#12300;&#12458;&#12531;&#12521;&#12452;&#12531;&#19978;&#12391;&#12398;&#31435;&#22580;&#12434;&#12424;&#12426;&#12424;&#12367;&#12375;&#12383;&#12356;&#12301;
  &#12300;&#12458;&#12531;&#12521;&#12452;&#12531;&#19978;&#12391;&#26377;&#21517;&#12395;&#12394;&#12426;&#12383;&#12356;&#12301;&#12392;&#12356;&#12387;&#12383;&#27671;&#25345;&#12385;&#12364;&#12354;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  "Wonder Hacker" &#12392;&#21517;&#20055;&#12387;&#12390;&#12362;&#12369;&#12400;&#21608;&#12426;&#12398;&#20154;&#12383;&#12385;&#12395; <span class="emphasis"><em>&#26412;&#24403;&#12395;</em></span>
  &#20932;&#33109;&#12398;&#12495;&#12483;&#12459;&#12540; (wonderful hacker) &#12384;&#12392;&#20449;&#12376;&#12390;&#12418;&#12425;&#12360;&#12427;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#12384;&#12369;&#12393;&#20107;&#23455;&#12399;&#20107;&#23455;&#12290;&#12383;&#12392;&#12360;&#35504;&#12418;&#27671;&#12389;&#12363;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#21531;&#12364;&#29356;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#12399;&#22793;&#12431;&#12426;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#20206;&#24819;&#20154;&#26684;&#12434;&#20316;&#12426;&#19978;&#12370;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;&#35501;&#32773;&#12434;&#24863;&#21205;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#21608;&#12426;&#12398;&#20154;&#12383;&#12385;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#12371;&#12392;&#12434;&#21336;&#12394;&#12427;&#22818;&#24819;&#23478;&#12363;&#12354;&#12427;&#12356;&#12399;&#33222;&#30149;&#32773;&#12392;&#12415;&#12394;&#12377;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21608;&#22258;&#12392;&#12398;&#12420;&#12426;&#12392;&#12426;&#12395;&#12399;&#23455;&#21517;&#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#21311;&#21517;&#12391;&#12356;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;
  &#12356;&#12363;&#12395;&#12418;&#26412;&#21517;&#12387;&#12413;&#12356;&#12495;&#12531;&#12489;&#12523;&#12434;&#20316;&#25104;&#12375;&#12390;&#12381;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#19968;&#36011;&#12375;&#12383; "&#38996;" &#12434;&#20351;&#29992;&#12375;&#32154;&#12369;&#12427;&#12371;&#12392;&#12395;&#21152;&#12360;&#12390;&#12289;
  &#12354;&#12394;&#12383;&#12434;&#12424;&#12426;&#35469;&#35672;&#12375;&#12390;&#12418;&#12425;&#12356;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#20309;&#12425;&#12363;&#12398;&#32937;&#26360;&#12365; ("&#21307;&#24107;"&#12289;"&#25945;&#25480;"&#12289;"&#30435;&#30563;" &#12394;&#12393;) &#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12354;&#12414;&#12426;&#12381;&#12428;&#12434;&#35211;&#12379;&#12403;&#12425;&#12363;&#12373;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#30452;&#25509;&#12381;&#12428;&#12395;&#38306;&#12377;&#12427;&#35441;&#38988;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12399;&#21029;&#12395;&#12375;&#12390;&#12289;
  &#32937;&#26360;&#12365;&#12395;&#12388;&#12356;&#12390;&#35328;&#21450;&#12377;&#12427;&#12371;&#12392;&#12418;&#36991;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12495;&#12483;&#12459;&#12540;&#30028;&#12289;&#12381;&#12375;&#12390;&#29305;&#12395;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#25991;&#21270;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;
  &#32937;&#26360;&#12365;&#12395;&#38972;&#12427;&#20154;&#12399;&#25490;&#20182;&#30340;&#12394;&#33222;&#30149;&#32773;&#12392;&#12415;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12513;&#12540;&#12523;&#12398;&#26368;&#24460;&#12395;&#26360;&#12367;&#32626;&#21517;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#32937;&#26360;&#12365;&#12364;&#30331;&#22580;&#12377;&#12427;&#12367;&#12425;&#12356;&#12394;&#12425;&#21839;&#38988;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12384;&#12289;&#35696;&#35542;&#12398;&#38555;&#12395;&#33258;&#20998;&#12398;&#31435;&#22580;&#12434;&#12424;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;&#12381;&#12398;&#32937;&#26360;&#12365;&#12434;&#20351;&#12358;&#12398;&#12399;&#36991;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#38291;&#36949;&#12356;&#12394;&#12367;&#12381;&#12428;&#12399;&#35023;&#30446;&#12395;&#20986;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12384;&#12387;&#12390;&#12289;&#32937;&#26360;&#12365;&#12394;&#12435;&#12363;&#12376;&#12419;&#12394;&#12367;&#12354;&#12394;&#12383;&#33258;&#36523;&#12434;&#35469;&#12417;&#12390;&#12418;&#12425;&#12356;&#12383;&#12356;&#12391;&#12375;&#12423;&#12358;&#65311;
</p><p>
  &#12513;&#12540;&#12523;&#12398;&#32626;&#21517;&#27396;&#12395;&#12388;&#12356;&#12390;&#35036;&#36275;&#12375;&#12414;&#12377;&#12290;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#23567;&#12373;&#12367;&#12390;&#19978;&#21697;&#12394;&#12418;&#12398;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#20309;&#12394;&#12425;&#32626;&#21517;&#12394;&#12435;&#12390;&#12394;&#12367;&#12387;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12425;&#12422;&#12427;&#12513;&#12540;&#12523;&#12398;&#26411;&#23614;&#12395;&#27861;&#30340;&#12394;&#27880;&#24847;&#26360;&#12365;&#12434;&#12391;&#12363;&#12391;&#12363;&#12392;&#25522;&#36617;&#12377;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#36991;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#29305;&#12395;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#21152;&#12392;&#20001;&#31435;&#12375;&#12394;&#12356;&#24847;&#35211;&#12434;&#36848;&#12409;&#12427;&#12424;&#12358;&#12394;&#12392;&#12365;&#12395;&#12289;
  &#12371;&#12428;&#12399;&#33268;&#21629;&#30340;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#31169;&#12364;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;
  &#12354;&#12427;&#20844;&#38283;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12398;&#20013;&#12395;&#12399;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12398;&#26411;&#23614;&#12395;&#12371;&#12435;&#12394;&#27096;&#24335;&#12398;&#25991;&#26360;&#12434;&#12388;&#12369;&#12390;&#12367;&#12427;&#20154;&#12364;&#12356;&#12414;&#12377;&#12290;
</p><pre class="screen">
&#37325;&#35201;&#12394;&#36890;&#30693;:

&#12354;&#12394;&#12383;&#12364;&#35492;&#12387;&#12390;&#12371;&#12398;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12426;&#12289;&#25105;&#12293;&#12398;&#12513;&#12540;&#12523;&#12395;&#38306;&#12377;&#12427;
&#20813;&#36012;&#26465;&#38917;&#12398;&#22768;&#26126;&#12420;&#30435;&#35222;&#12509;&#12522;&#12471;&#12540;&#12434;&#35501;&#12415;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;&#20197;&#19979;&#12398;&#22768;&#26126;&#25991;&#12434;&#35501;&#12416;&#12363;&#12289;
&#12371;&#12398;&#12513;&#12540;&#12523;&#12398;&#36865;&#20449;&#32773;&#12392;&#36899;&#32097;&#12434;&#21462;&#12387;&#12390;&#19979;&#12373;&#12356;&#12290;

&#12371;&#12398;&#12513;&#12540;&#12523;&#12391;&#12398;&#12420;&#12426;&#12392;&#12426;&#12399; Deloitte &amp; Touche LLP &#12363;&#12425;&#30330;&#20449;&#12373;&#12428;&#12383;&#12418;&#12398;
&#12391;&#12377;&#12290;Deloitte &amp; Touche LLP &#12399; &#30331;&#37682;&#30058;&#21495; OC303675 &#12391;&#12452;&#12531;&#12464;&#12521;&#12531;&#12489;&#12392;
&#12454;&#12455;&#12540;&#12523;&#12474;&#22320;&#26041;&#12395;&#30331;&#37682;&#12373;&#12428;&#12383;&#26377;&#38480;&#20107;&#26989;&#32068;&#21512;&#12391;&#12377;&#12290;&#32068;&#21512;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#21517;&#21069;&#12399;&#20197;&#19979;
&#12398;&#20303;&#25152;&#12391;&#38322;&#35239;&#21487;&#33021;&#12391;&#12377;&#12290;Stonecutter Court,1 Stonecutter Street, London
 EC4A 4TR, United Kingdom. &#12371;&#12371;&#12399;&#32068;&#21512;&#12398;&#20027;&#12383;&#12427;&#21942;&#26989;&#25152;&#12391;&#12354;&#12426;&#12289;&#30331;&#37682;&#28168;&#12415;&#12398;
&#20107;&#21209;&#25152;&#12391;&#12377;&#12290;Deloitte &amp; Touche LLP &#12399;&#12289;&#37329;&#34701;&#12469;&#12540;&#12499;&#12473;&#27231;&#27083;(FSA) &#12364;&#35469;&#35388;
&#12375;&#12289;&#31649;&#36676;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;

&#12371;&#12398;&#12513;&#12540;&#12523;&#12392;&#28155;&#20184;&#12373;&#12428;&#12383;&#20869;&#23481;&#12399;&#31192;&#23494;&#12398;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;&#38322;&#35239;&#12395;&#29305;&#21029;&#12394;&#35377;&#21487;&#12364;&#24517;&#35201;&#12394;
&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#36865;&#20449;&#32773;&#12364;&#24847;&#22259;&#12375;&#12383;&#21463;&#20449;&#32773;&#12398;&#12415;&#12364;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#20206;&#12395;&#12354;
&#12394;&#12383;&#12364;&#12381;&#12358;&#12375;&#12383;&#20154;&#12391;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12420;&#12426;&#12392;&#12426;&#12420;&#24773;&#22577;&#12434;&#38283;
&#31034;&#12375;&#12383;&#12426;&#12289;&#12467;&#12500;&#12540;&#12375;&#12383;&#12426;&#12289;&#21033;&#29992;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399;&#24375;&#12367;&#31105;&#12376;&#12425;&#12428;&#12390;&#12362;&#12426;&#12289;&#36949;&#27861;&#34892;
&#28858;&#12391;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#20206;&#12395;&#12371;&#12398;&#12513;&#12540;&#12523;&#12434;&#35492;&#12387;&#12390;&#21463;&#12369;&#21462;&#12387;&#12383;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;"&#38291;&#36949;&#12387;&#12390;&#21463;
&#12369;&#12392;&#12426;&#12414;&#12375;&#12383;" &#12392;&#12356;&#12358;&#12479;&#12452;&#12488;&#12523;&#12434;&#12388;&#12369;&#12390; IT.SECURITY.UK@deloitte.co.uk &#12395;&#36820;
&#36865;&#12377;&#12427;&#12392;&#12392;&#12418;&#12395;&#12289;&#12371;&#12398;&#12513;&#12540;&#12523;&#12392;&#12381;&#12398;&#12467;&#12500;&#12540;&#12434;&#30772;&#26820;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;

&#38651;&#23376;&#12513;&#12540;&#12523;&#12395;&#12424;&#12427;&#12420;&#12426;&#12392;&#12426;&#12399;&#12289;&#30423;&#32884;&#12373;&#12428;&#12383;&#12426;&#12289;&#30772;&#25613;&#12375;&#12383;&#12426;&#12289;&#25913;&#31428;&#12373;&#12428;&#12383;&#12426;&#12289;&#37197;
&#36865;&#12398;&#36884;&#20013;&#12391;&#22833;&#12431;&#12428;&#12383;&#12426;&#12289;&#37197;&#36865;&#12364;&#36933;&#24310;&#12375;&#12383;&#12426;&#12289;&#20013;&#36523;&#12364;&#19981;&#23436;&#20840;&#12394;&#22580;&#21512;&#12364;&#12354;&#12387;&#12383;&#12426;&#12289;
&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12454;&#12452;&#12523;&#12473;&#12364;&#21547;&#12414;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#12456;&#12521;&#12540;&#12364;&#12394;&#12367;&#23433;&#20840;&#12391;&#12354;&#12427;
&#12392;&#12356;&#12358;&#20445;&#35388;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#31169;&#12383;&#12385;&#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#20107;&#24907;&#12420;&#12381;&#12428;&#12364;&#24341;&#12365;&#36215;&#12371;&#12375;&#12383;&#32080;&#26524;
&#29983;&#12376;&#12427;&#19981;&#21033;&#30410;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12399;&#20986;&#26469;&#12414;&#12379;&#12435;&#12290;&#38651;&#23376;&#12513;&#12540;&#12523;&#12391;&#31169;&#12383;&#12385;&#12392;&#36899;&#32097;&#12434;&#12392;
&#12426;&#12354;&#12358;&#26041;&#12293;&#12399;&#12289;&#20840;&#21729;&#12364;&#12371;&#12398;&#12522;&#12473;&#12463;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12356;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;

&#31169;&#12383;&#12385;&#12398;&#39015;&#23458;&#12392;&#36899;&#32097;&#12434;&#21462;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12540;&#12523;&#12392;&#28155;&#20184;&#12373;&#12428;&#12427;&#20869;&#23481;&#12395;&#21547;&#12414;&#12428;&#12427;&#12356;&#12363;
&#12394;&#12427;&#24847;&#35211;&#12420;&#12450;&#12489;&#12496;&#12452;&#12473;&#12418;&#12289;Deloitte &amp; Touche LLP &#39015;&#23458;&#22865;&#32004;&#26360;&#12391;&#31034;&#12373;&#12428;&#12390;
&#12356;&#12427;&#35576;&#26465;&#20214;&#12395;&#12424;&#12387;&#12390;&#21046;&#32004;&#12434;&#21463;&#12369;&#12414;&#12377;&#12290;

&#31169;&#12383;&#12385;&#12398;&#12499;&#12472;&#12493;&#12473;&#12395;&#38306;&#20418;&#12394;&#12356;&#24847;&#35211;&#12420;&#12450;&#12489;&#12496;&#12452;&#12473;&#12289;&#12381;&#12398;&#20182;&#12398;&#24773;&#22577;&#12364;&#12371;&#12398;&#12513;&#12540;&#12523;&#12395;
&#35352;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12428;&#12399;&#31169;&#12383;&#12385;&#12364;&#30330;&#20449;&#12375;&#12383;&#12418;&#12398;&#12391;&#12418;&#12289;&#35469;&#12417;&#12383;&#12418;&#12398;&#12391;&#12418;&#12354;&#12426;&#12414;
&#12379;&#12435;&#12290;

</pre><p>
  &#12383;&#12414;&#12395;&#20986;&#12390;&#12365;&#12390;&#12385;&#12423;&#12387;&#12392;&#36074;&#21839;&#12377;&#12427;&#12384;&#12369;&#12392;&#12356;&#12358;&#20154;&#12364;&#12371;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12427;&#12398;&#12384;&#12387;&#12383;&#12425;&#12289;
  &#39340;&#40575;&#12425;&#12375;&#12356;&#12392;&#12399;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12381;&#12428;&#12411;&#12393;&#12398;&#23475;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12375;&#12371;&#12398;&#20154;&#29289;&#12364;&#26412;&#26684;&#30340;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#12356;&#12392;&#35328;&#12356;&#20986;&#12375;&#12383;&#12425;&#12393;&#12358;&#12375;&#12414;&#12375;&#12423;&#12358;&#65311;
  &#12371;&#12398;&#27861;&#30340;&#25991;&#26360;&#12364;&#12365;&#12387;&#12392;&#21839;&#38988;&#12395;&#12394;&#12387;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12397;&#12290;
  &#12371;&#12371;&#12395;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12405;&#12383;&#12388;&#12398;&#21361;&#38522;&#20449;&#21495;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12371;&#12398;&#20154;&#29289;&#12399;&#33258;&#20998;&#12398;&#12484;&#12540;&#12523;&#12434;&#23436;&#20840;&#12395;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12391;&#12365;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
  &#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#12289;&#31038;&#20869;&#12398;&#12513;&#12540;&#12523;&#12469;&#12540;&#12496;&#12364;&#24375;&#21046;&#30340;&#12395;&#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12513;&#12540;&#12523;&#12395;&#20184;&#21152;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#12381;&#12428;&#12434;&#36802;&#22238;&#12377;&#12427;&#25163;&#27573;&#12364;&#12394;&#12356;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12381;&#12375;&#12390;&#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;
  &#24444;&#12398;&#25152;&#23646;&#12377;&#12427;&#32068;&#32340;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#27963;&#21205;&#12395;&#38306;&#12377;&#12427;&#29702;&#35299;&#12364;&#12411;&#12392;&#12435;&#12393; (&#12354;&#12427;&#12356;&#12399;&#12414;&#12387;&#12383;&#12367;) &#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12398;&#32068;&#32340;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;&#12434;&#26126;&#30906;&#12395;&#31105;&#27490;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#24444;&#12398;&#25237;&#31295;&#12399;&#26126;&#12425;&#12363;&#12395;&#27475;&#36814;&#12373;&#12428;&#12374;&#12427;&#12418;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12427;&#12391;&#12289;&#27231;&#23494;&#24773;&#22577;&#12364;&#22806;&#37096;&#12395;&#12418;&#12428;&#12427;&#12522;&#12473;&#12463;&#12398;&#22238;&#36991;&#12364;&#26368;&#20778;&#20808;&#12373;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
</p><p>
  &#12300;&#22806;&#21521;&#12369;&#12398;&#12513;&#12540;&#12523;&#12395;&#12399;&#24517;&#12378;&#12371;&#12358;&#12356;&#12387;&#12383;&#25991;&#26360;&#12434;&#12388;&#12369;&#12390;&#12362;&#12369;&#12301;
  &#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#27770;&#12414;&#12426;&#12398;&#12354;&#12427;&#20250;&#31038;&#12391;&#20685;&#12356;&#12390;&#12356;&#12427;&#26041;&#12399;&#12289;
  &#28961;&#26009;&#12398;&#12513;&#12540;&#12523;&#12450;&#12459;&#12454;&#12531;&#12488;&#12434;&#21462;&#24471;&#12375;&#12390;&#12381;&#12398;&#12450;&#12489;&#12524;&#12473;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12434;&#26908;&#35342;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#28961;&#26009;&#12398;&#12513;&#12540;&#12523;&#12450;&#12459;&#12454;&#12531;&#12488;&#12399;&#12289;&#12383;&#12392;&#12360;&#12400; <a class="ulink" href="http://gmail.google.com/" target="_top">gmail.google.com</a> &#12420; <a class="ulink" href="http://www.hotmail.com/" target="_top">www.hotmail.com</a>&#12289;&#12381;&#12375;&#12390; <a class="ulink" href="http://www.yahoo.com/" target="_top">www.yahoo.com</a> &#12394;&#12393;&#12391;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1561456" href="#idp1561456" class="para">25</a>] </sup>
      &#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12356;&#12367;&#12388;&#12363;&#33288;&#21619;&#28145;&#12356;&#30740;&#31350;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;
      Gutwin&#12289;Penner &#12362;&#12424;&#12403; Schneider &#12395;&#12424;&#12427;
      <em class="citetitle">Group Awareness in Distributed Software Development</em>
      &#12418;&#12381;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;&#12371;&#12398;&#35542;&#25991;&#12399;&#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;
      &#19968;&#26178;&#12375;&#12400;&#12425;&#12367;&#35211;&#12360;&#12394;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#12381;&#12398;&#24460;&#12289;&#25913;&#12417;&#12390;
      <a class="ulink" href="http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf" target="_top">http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf</a>
      &#12391;&#20844;&#38283;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#12418;&#12375;&#12371;&#12398; URL &#12391;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
      &#12414;&#12383;&#21029;&#12398;&#22580;&#25152;&#12395;&#31227;&#21205;&#12375;&#12383;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12434;&#20351;&#12387;&#12390;&#25506;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bounties.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="common-pitfalls.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">Bounties </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#38501;&#12426;&#12364;&#12385;&#12394;&#32608;</td></tr></table></div></body></html>
