<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12467;&#12511;&#12483;&#12479;&#12540;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><link rel="prev" href="transitions.html" title="&#24341;&#12365;&#32153;&#12366;"><link rel="next" href="credit.html" title="&#12463;&#12524;&#12472;&#12483;&#12488;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12467;&#12511;&#12483;&#12479;&#12540;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="transitions.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</th><td width="20%" align="right"> <a accesskey="n" href="credit.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12467;&#12511;&#12483;&#12479;&#12540;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="committers"></a>&#12467;&#12511;&#12483;&#12479;&#12540;</h2></div></div></div><p>
  &#12354;&#12425;&#12422;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#21807;&#19968;&#20844;&#24335;&#12395;&#35672;&#21029;&#21487;&#33021;&#12394;&#12398;&#12399;&#12289;
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12363;&#12381;&#12358;&#12391;&#12394;&#12356;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12300;&#12467;&#12511;&#12483;&#12479;&#12540;&#12301;&#12395;&#12388;&#12356;&#12390;&#27880;&#30446;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12531;&#12496;&#12540;&#12434;&#12391;&#12365;&#12427;&#38480;&#12426;&#24179;&#31561;&#12395;&#25201;&#12358;&#12371;&#12392;&#12434;&#24515;&#12364;&#12369;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12384;&#12369;&#12399;&#21029;&#12395;&#25201;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#36991;&#12369;&#12425;&#12428;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#21029;&#12395;&#25201;&#12358;&#12301;&#12392;&#12356;&#12387;&#12390;&#12418;&#12289;&#29305;&#12395;&#24046;&#21029;&#30340;&#12394;&#24847;&#21619;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#24441;&#21106;&#12399;&#27424;&#12363;&#12379;&#12394;&#12356;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#12381;&#12428;&#12394;&#12375;&#12391;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12358;&#12414;&#12367;&#22238;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12392;&#32771;&#12360;&#12414;&#12377;&#12290;
  &#21697;&#36074;&#31649;&#29702;&#12398;&#12383;&#12417;&#12395;&#12399;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#33258;&#20998;&#12395;&#12399;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#33021;&#21147;&#12364;&#12354;&#12427;&#12392;&#32771;&#12360;&#12427;&#20154;&#12399;&#22810;&#12367;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#23455;&#38555;&#12395;&#34892;&#12358;&#12398;&#12399;&#12381;&#12398;&#12358;&#12385;&#12398;&#19968;&#37096;&#12398;&#20154;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#21508;&#20491;&#20154;&#12398;&#33258;&#24049;&#21028;&#26029;&#12395;&#20381;&#23384;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#20309;&#12425;&#12363;&#12398;&#22522;&#28310;&#12434;&#35373;&#12369;&#12289;&#12381;&#12428;&#12434;&#28288;&#12383;&#12375;&#12383;&#20154;&#12395;&#12398;&#12415;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12427;&#12409;&#12365;&#12391;&#12377;
  <sup>[<a name="idp2940992" href="#ftn.idp2940992" class="footnote">34</a>]</sup>&#12290;
  &#19968;&#26041;&#12289;&#22793;&#26356;&#12434;&#30452;&#25509;&#12467;&#12511;&#12483;&#12488;&#12391;&#12365;&#12427;&#27177;&#38480;&#12434;&#25345;&#12388;&#20154;&#12383;&#12385;&#12398;&#12414;&#12431;&#12426;&#12395;&#12399;
  &#12381;&#12358;&#12391;&#12394;&#12356;&#20154;&#12383;&#12385;&#12418;&#22810;&#12367;&#12356;&#12414;&#12377;&#12290;&#24444;&#12425;&#12395;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#32771;&#12360;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12434;&#12358;&#12414;&#12367;&#31649;&#29702;&#12375;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12358;&#12414;&#12367;&#21205;&#12363;&#12375;&#12390;&#12356;&#12367;&#12371;&#12392;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
</p><p>
  <span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a> &#12398;</span>
  <a class="xref" href="consensus-democracy.html#electorate" title="&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?">&#12300;&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?&#12301;</a> &#12391;&#12289;
  &#26032;&#12383;&#12394;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#27770;&#12417;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#26082;&#12395;&#35500;&#26126;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12289;&#26032;&#12467;&#12511;&#12483;&#12479;&#12540;&#20505;&#35036;&#12398;&#33021;&#21147;&#12434;&#35211;&#26997;&#12417;&#12427;&#26041;&#27861;&#12420;
  &#22823;&#35215;&#27169;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#21516;&#12376;&#25163;&#32154;&#12365;&#12434;&#36914;&#12417;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect2" title="&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#36984;&#12403;&#12363;&#12383;"><div class="titlepage"><div><div><h3 class="title"><a name="choosing-committers"></a>&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#36984;&#12403;&#12363;&#12383;</h3></div></div></div><p>
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#27770;&#12417;&#12427;&#38555;&#12395;&#12399;
  &#12498;&#12509;&#12463;&#12521;&#12486;&#12473;&#20027;&#32681; <span class="emphasis"><em>first, do no harm
  (&#20309;&#12424;&#12426;&#12418;&#12414;&#12378;&#12289;&#24739;&#32773;&#12395;&#23475;&#12434;&#19982;&#12360;&#12394;&#12356;&#12371;&#12392;)</em></span> &#12434;&#37325;&#35222;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#12473;&#12461;&#12523;&#12420; Subversion &#12398;&#12467;&#12540;&#12489;&#12395;&#38306;&#12377;&#12427;&#30693;&#35672;&#12424;&#12426;&#12418;&#12289;
  &#21336;&#12395;&#12424;&#12426;&#12424;&#12356;&#21028;&#26029;&#12364;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#37325;&#12365;&#12434;&#32622;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12300;&#21028;&#26029;&#12364;&#12391;&#12365;&#12427;&#12301;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#21336;&#12395;&#12300;&#12377;&#12409;&#12365;&#12391;&#12394;&#12356;&#12371;&#12392;&#12399;&#20309;&#12363;&#12301;
  &#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#12384;&#12428;&#12363;&#12364;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12497;&#12483;&#12481;&#12434;&#36865;&#12387;&#12390;&#12365;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12399;&#12289;&#12467;&#12540;&#12489;&#12398;&#20013;&#12398;&#12411;&#12435;&#12398;&#20123;&#32048;&#12394;&#21839;&#38988;&#12434;&#20462;&#27491;&#12377;&#12427;&#12384;&#12369;&#12398;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12497;&#12483;&#12481;&#12399;&#12358;&#12414;&#12367;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12390;&#12496;&#12464;&#12418;&#12394;&#12367;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#35215;&#32004;&#12420;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#35215;&#32004;&#12418;&#23432;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#12497;&#12483;&#12481;&#12434;&#25968;&#22810;&#12367;&#36865;&#12387;&#12390;&#12365;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;&#12289;
  &#26082;&#23384;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12383;&#12385;&#12364;&#12300;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#12354;&#12370;&#12383;&#12425;&#12393;&#12358;?&#12301;&#12392;&#25552;&#26696;&#12375;&#12414;&#12377;&#12290;
  &#23569;&#12394;&#12367;&#12392;&#12418; 3 &#20154;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12364;&#36059;&#25104;&#12375;&#12289;
  &#12363;&#12388;&#21453;&#23550;&#12377;&#12427;&#20154;&#12364;&#35504;&#12418;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;&#27491;&#24335;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12398;&#20154;&#12364;&#12467;&#12540;&#12489;&#20840;&#20307;&#12434;&#25226;&#25569;&#12375;&#12390;&#12356;&#12390;&#35079;&#38609;&#12394;&#21839;&#38988;&#12418;&#35299;&#27770;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#35388;&#25312;&#12394;&#12435;&#12390;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#38306;&#20418;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;&#12399;&#12387;&#12365;&#12426;&#12392;&#35328;&#12360;&#12427;&#12371;&#12392;&#12399;&#12289;
  &#24444;&#12399;&#33258;&#20998;&#33258;&#36523;&#12398;&#33021;&#21147;&#12434;&#12365;&#12385;&#12435;&#12392;&#21028;&#26029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#12371;&#12392;&#12399;&#12289;&#24460;&#12363;&#12425;&#12391;&#12418;&#21193;&#24375;&#12391;&#12365;&#12414;&#12377; (&#12375;&#12289;&#25945;&#12360;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;)
  &#12364;&#12289;&#21028;&#26029;&#21147;&#12395;&#12388;&#12356;&#12390;&#12399;&#12394;&#12363;&#12394;&#12363;&#12381;&#12358;&#12399;&#12356;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12427;&#38555;&#12395;&#12399;&#21028;&#26029;&#21147;&#12398;&#26377;&#28961;&#12434;&#37325;&#35222;&#12375;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#26032;&#12383;&#12395;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#36861;&#21152;&#12375;&#12424;&#12358;&#12392;&#12356;&#12358;&#25552;&#26696;&#12364;&#35696;&#35542;&#12434;&#21628;&#12406;&#22580;&#21512;&#12289;
  &#12381;&#12398;&#21407;&#22240;&#12364;&#25216;&#34899;&#30340;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#12354;&#12414;&#12426;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12393;&#12385;&#12425;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420; IRC
  &#19978;&#12391;&#12398;&#12381;&#12398;&#20154;&#12398;&#12405;&#12427;&#12414;&#12356;&#12364;&#21839;&#38988;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#12383;&#12414;&#12395;&#12289;&#25216;&#34899;&#30340;&#12395;&#12399;&#21839;&#38988;&#12364;&#12394;&#12367;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20844;&#24335;&#25351;&#37341;&#12395;&#12375;&#12383;&#12364;&#12387;&#12390;&#20685;&#12367;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12369;&#12428;&#12393;&#12418;&#12289;
  &#25522;&#31034;&#26495;&#12391;&#12399;&#12420;&#12383;&#12425;&#12369;&#12435;&#12363;&#33136;&#12384;&#12387;&#12383;&#12426;&#38750;&#21332;&#21147;&#30340;&#12384;&#12387;&#12383;&#12426;&#12377;&#12427;&#20154;&#12364;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12385;&#12423;&#12387;&#12392;&#28145;&#21051;&#12394;&#21839;&#38988;&#12391;&#12377;&#12290;
  &#20309;&#24230;&#12363;&#21161;&#35328;&#12434;&#12375;&#12383;&#19978;&#12391;&#12414;&#12384;&#24444;&#12364;&#12381;&#12398;&#12424;&#12358;&#12394;&#24907;&#24230;&#12434;&#12392;&#12426;&#32154;&#12369;&#12427;&#12424;&#12358;&#12394;&#12425;&#12289;
  &#12383;&#12392;&#12360;&#24444;&#12398;&#25216;&#34899;&#12364;&#20778;&#12428;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#31169;&#12383;&#12385;&#12399;&#24444;&#12434;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12399;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38598;&#12414;&#12426;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#12356;&#12431;&#12422;&#12427;&#12477;&#12540;&#12471;&#12515;&#12523;&#12473;&#12461;&#12523;&#12289;
  &#12388;&#12414;&#12426;&#12300;&#38598;&#22243;&#12398;&#20013;&#12391;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12367;&#33021;&#21147;&#12301;&#12399;&#25216;&#34899;&#21147;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#37325;&#35201;&#12391;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12394;&#12398;&#12391;&#12289;
  &#20206;&#12395;&#12405;&#12373;&#12431;&#12375;&#12367;&#12394;&#12356;&#20154;&#12434;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;
  &#12467;&#12540;&#12489;&#12395;&#12399;&#12381;&#12428;&#12411;&#12393;&#34987;&#23475;&#12399;&#21450;&#12403;&#12414;&#12379;&#12435; (&#20309;&#12363;&#21839;&#38988;&#12364;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12467;&#12540;&#12489;&#12398;&#12524;&#12499;&#12517;&#12540;&#12391;&#12377;&#12368;&#12395;&#35211;&#12388;&#12363;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#12377;&#12415;&#12420;&#12363;&#12395;&#12381;&#12398;&#20154;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#21093;&#22890;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#27770;&#12375;&#12390;&#27671;&#25345;&#12385;&#12398;&#12356;&#12356;&#12371;&#12392;&#12391;&#12399;&#12394;&#12367;&#12289;&#12392;&#12365;&#12395;&#12399;&#23550;&#31435;&#12364;&#36215;&#12371;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#37325;&#35201;&#12394;&#12497;&#12483;&#12481;&#12434;&#20309;&#22238;&#12363;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12391;
  &#12399;&#12376;&#12417;&#12390;&#12467;&#12511;&#12483;&#12479;&#12540;&#20505;&#35036;&#12392;&#12375;&#12390;&#35469;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12394;&#20181;&#32068;&#12415;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#21336;&#12395;&#12381;&#12398;&#20154;&#12364;&#21608;&#12426;&#12395;&#23475;&#12434;&#19982;&#12360;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#35211;&#12427;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;
  &#12381;&#12398;&#20154;&#12364;&#12467;&#12540;&#12489;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#38306;&#12431;&#12387;&#12390;&#12356;&#12367;&#12363;&#12434;&#35211;&#12427;&#12392;&#12356;&#12358;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12371;&#12428;&#12391;&#12356;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#24471;&#12427;&#12398;&#12364;&#12414;&#12427;&#12391;
  &#20250;&#21729;&#21046;&#12398;&#39640;&#32026;&#12463;&#12521;&#12502;&#12395;&#20837;&#20250;&#12377;&#12427;&#12363;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12371;&#12391;&#21839;&#12358;&#12409;&#12365;&#12371;&#12392;&#12399;&#12300;&#12467;&#12540;&#12489;&#12395;&#12392;&#12387;&#12390;&#12418;&#12387;&#12392;&#12418;&#12424;&#12356;&#32080;&#26524;&#12434;&#12418;&#12383;&#12425;&#12377;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;?&#12301;
  &#12391;&#12354;&#12426;&#12289;&#27770;&#12375;&#12390;
  &#12300;&#12371;&#12356;&#12388;&#12434;&#20210;&#38291;&#12395;&#20837;&#12428;&#12427;&#12392;&#12467;&#12511;&#12483;&#12479;&#12540;&#12383;&#12385;&#12398;&#31038;&#20250;&#30340;&#12394;&#35413;&#21028;&#12364;&#12362;&#12385;&#12427;&#12435;&#12376;&#12419;&#12394;&#12356;&#12363;?&#12301;
  &#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12427;&#12398;&#12399;&#20491;&#20154;&#12398;&#33258;&#23562;&#24515;&#12434;&#39640;&#12417;&#12427;&#12383;&#12417;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12467;&#12540;&#12489;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#38555;&#12398;&#25163;&#38291;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#28187;&#12425;&#12377;&#12383;&#12417;&#12391;&#12377;&#12290;
  100 &#20154;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#12358;&#12385;&#23450;&#26399;&#30340;&#12395;&#22823;&#35215;&#27169;&#12394;&#22793;&#26356;&#12434;&#34892;&#12358;&#12398;&#12364; 10 &#20154;&#12384;&#12369;&#12391;&#12289;
  &#27531;&#12426;&#12398; 90 &#20154;&#12399;&#35492;&#26893;&#12420;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12496;&#12464;&#12398;&#20462;&#27491;&#12434;&#24180;&#12395;&#25968;&#24230;&#34892;&#12358;&#12384;&#12369;&#12384;&#12387;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12391;&#12418;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434; 10 &#20154;&#12384;&#12369;&#12395;&#12375;&#12390;&#12362;&#12367;&#12424;&#12426;&#12418;&#12424;&#12387;&#12413;&#12393;&#12414;&#12375;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#21093;&#22890;"><div class="titlepage"><div><div><h3 class="title"><a name="revoking-committers"></a>&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#21093;&#22890;</h3></div></div></div><p>
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#21093;&#22890;&#12395;&#38306;&#12375;&#12390;&#12414;&#12378;&#12402;&#12392;&#12371;&#12392;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#32701;&#30446;&#12395;&#38501;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12289;
  &#26368;&#21021;&#12363;&#12425;&#21313;&#20998;&#27880;&#24847;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#35504;&#12398;&#12301;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#12300;&#12394;&#12380;&#12301;&#21093;&#22890;&#12377;&#12427;&#12398;&#12363;
  &#12392;&#12356;&#12387;&#12383;&#35696;&#35542;&#12399;&#32027;&#31998;&#12375;&#12420;&#12377;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#30342;&#12398;&#24847;&#35211;&#12364;&#19968;&#33268;&#12375;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12435;&#12394;&#20316;&#26989;&#12399;&#20840;&#12367;&#29983;&#29987;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#12393;&#12358;&#12375;&#12390;&#12418;&#12381;&#12358;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#29366;&#27841;&#12395;&#12394;&#12387;&#12383;&#12425;&#12289;
  &#12414;&#12378;&#12399;&#12381;&#12398;&#20154;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434; <span class="emphasis"><em>&#19982;&#12360;&#12383;</em></span>
  &#12392;&#12365;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#38291;&#12391;&#38750;&#20844;&#38283;&#12391;&#35696;&#35542;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21839;&#38988;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#20154;&#33258;&#36523;&#12399;&#12381;&#12398;&#35696;&#35542;&#12395;&#21152;&#12360;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#36890;&#24120;&#12399;&#31192;&#23494;&#20027;&#32681;&#12399;&#21542;&#23450;&#12373;&#12428;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#12381;&#12398;&#26041;&#37341;&#12395;&#12399;&#21453;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12371;&#12398;&#22580;&#21512;&#12399;&#38750;&#20844;&#38283;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#24517;&#35201;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#31532;&#19968;&#12398;&#29702;&#30001;&#12392;&#12375;&#12390;&#12289;&#12381;&#12358;&#12391;&#12394;&#12356;&#12392;&#33258;&#30001;&#12395;&#24847;&#35211;&#12434;&#20132;&#25563;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12358;&#19968;&#12388;&#12398;&#29702;&#30001;&#12399;&#12289;&#12418;&#12375;&#12467;&#12511;&#12483;&#12488;&#27177;&#21093;&#22890;&#12398;&#35430;&#12415;&#12364;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12395;
  &#12300;&#12381;&#12358;&#12356;&#12358;&#32771;&#12360;&#12364;&#12354;&#12387;&#12383;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24403;&#20107;&#32773;&#12395;&#30693;&#12425;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#30693;&#12425;&#12428;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#12365;&#12387;&#12392;&#12300;&#21093;&#22890;&#12395;&#36059;&#25104;&#12375;&#12383;&#12398;&#12399;&#35504;?
  &#31169;&#12398;&#21619;&#26041;&#12395;&#12394;&#12387;&#12390;&#12367;&#12428;&#12383;&#12398;&#12399;&#35504;?&#12301;&#12392;&#12356;&#12358;&#30097;&#21839;&#12364;&#38957;&#12395;&#28014;&#12363;&#12406;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12418;&#12387;&#12392;&#12418;&#12383;&#12385;&#12398;&#24746;&#12356;&#27966;&#38309;&#20105;&#12356;&#12398;&#21407;&#22240;&#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12372;&#12367;&#12414;&#12428;&#12395;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#21093;&#22890;&#12377;&#12427; (&#12354;&#12427;&#12356;&#12399;&#12375;&#12424;&#12358;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;)
  &#12371;&#12392;&#12434;&#35686;&#21578;&#12392;&#12375;&#12390;&#30693;&#12425;&#12379;&#12383;&#12356;&#12392;&#12356;&#12358;&#29366;&#27841;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#24517;&#12378;&#12464;&#12523;&#12540;&#12503;&#20840;&#20307;&#12398;&#21516;&#24847;&#12434;&#12392;&#12387;&#12390;&#12363;&#12425;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#38750;&#20844;&#38283;&#12391;&#34892;&#12387;&#12383;&#35696;&#35542;&#12420;&#25237;&#31080;&#12398;&#20869;&#23481;&#12399;&#12289;&#21442;&#21152;&#32773;&#20840;&#21729;&#12364;&#20102;&#35299;&#12375;&#12394;&#12356;&#38480;&#12426;&#20844;&#38283;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12384;&#12428;&#12363;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#21093;&#22890;&#12375;&#12383;&#12425;&#12289;&#12381;&#12398;&#20107;&#23455;&#12434;&#20844;&#34920;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;
  (<span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span>
  <a class="xref" href="committers.html#commit-access-openness" title="&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;">&#12300;&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;&#12301;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;)&#12290;
  &#19968;&#33324;&#21521;&#12369;&#12408;&#12398;&#20844;&#34920;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#12381;&#12388;&#12394;&#12367;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;"><div class="titlepage"><div><div><h3 class="title"><a name="partial-committers"></a>&#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#12395;&#20309;&#27573;&#38542;&#12363;&#12398;&#21306;&#21029;&#12434;&#12388;&#12369;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#33258;&#30001;&#12395;&#22793;&#26356;&#12391;&#12365;&#12427;&#12369;&#12428;&#12393;&#12418;
  &#12467;&#12540;&#12489;&#12381;&#12398;&#12418;&#12398;&#12395;&#12399;&#12467;&#12511;&#12483;&#12488;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12387;&#12383;&#27177;&#38480;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12300;&#19968;&#37096;&#12384;&#12369;&#12395;&#38480;&#23450;&#12301;&#12375;&#12383;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12427;&#22580;&#38754;&#12392;&#12375;&#12390;&#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12289;&#32763;&#35379;&#12289;&#20182;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12392;&#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12289;
  &#12497;&#12483;&#12465;&#12540;&#12472;&#20316;&#25104;&#29992;&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523; (RedHat &#12398; RPM &#12473;&#12506;&#12483;&#12463;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;)
  &#12394;&#12393;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12399;&#12289;&#20309;&#12363;&#38291;&#36949;&#12356;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12450;&#12395;&#12399;
  &#12354;&#12414;&#12426;&#24433;&#38911;&#12434;&#21450;&#12412;&#12373;&#12394;&#12356;&#12392;&#12371;&#12429;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12399;&#12289;&#21336;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12371;&#12392;&#12384;&#12369;&#12391;&#12394;&#12367;&#25237;&#31080;&#27177;
  (<span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a> &#12398;</span>
  <a class="xref" href="consensus-democracy.html#electorate" title="&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?">&#12300;&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?&#12301;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;) &#12395;&#12418;&#12363;&#12425;&#12435;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12388;&#20154;&#12398;&#25201;&#12356;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;?
  &#27491;&#35299;&#12399;&#12402;&#12392;&#12388;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12393;&#12398;&#12424;&#12358;&#12395;&#37096;&#20998;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12427;&#12363;&#12395;&#12424;&#12387;&#12390;&#22793;&#12431;&#12426;&#12414;&#12377;&#12290;
  Subversion &#12391;&#12399;&#12365;&#12431;&#12417;&#12390;&#12471;&#12531;&#12503;&#12523;&#12395;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12388;&#12467;&#12511;&#12483;&#12479;&#12540;&#12399;&#12289;
  &#33258;&#20998;&#12364;&#12363;&#12425;&#12435;&#12391;&#12356;&#12427;&#31684;&#22258;&#12398;&#20107;&#38917;&#12395;&#12388;&#12356;&#12390;&#12399;&#25237;&#31080;&#12391;&#12365;&#12427;&#12364;
  &#12381;&#12428;&#20197;&#22806;&#12398;&#31684;&#22258;&#12395;&#12388;&#12356;&#12390;&#12398;&#25237;&#31080;&#27177;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#21442;&#32771;&#24847;&#35211;&#12392;&#12375;&#12390;&#12398;&#25237;&#31080; (advisory vote) &#12392;&#12356;&#12358;&#20181;&#32068;&#12415;&#12399;&#23384;&#22312;&#12375;&#12414;&#12377;
  (&#35201;&#12377;&#12427;&#12395;&#12289;&#25237;&#31080;&#29992;&#32025;&#12395;&#21336;&#12395; "+1" &#12392;&#26360;&#12367;&#12398;&#12391;&#12399;&#12394;&#12367; "+0"
  &#12354;&#12427;&#12356;&#12399; "+1 (&#25304;&#26463;&#21147;&#12394;&#12375;)" &#12392;&#26360;&#12367;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;)&#12290;
  &#20844;&#24335;&#12394;&#21177;&#21147;&#12364;&#12394;&#12356;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#24444;&#12425;&#12434;&#23436;&#20840;&#12395;&#40665;&#12425;&#12379;&#12390;&#12375;&#12414;&#12358;&#29702;&#30001;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12399;&#12289;&#12354;&#12425;&#12422;&#12427;&#12371;&#12392;&#12395;&#38306;&#12375;&#12390;&#25237;&#31080;&#27177;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
  &#12385;&#12423;&#12358;&#12393;&#24444;&#12425;&#12364;&#12393;&#12398;&#37096;&#20998;&#12395;&#12391;&#12418;&#12467;&#12511;&#12483;&#12488;&#12391;&#12365;&#12427;&#12398;&#12392;&#21516;&#12376;&#12424;&#12358;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#12415;&#12364;&#26032;&#35215;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#36861;&#21152;&#12395;&#38306;&#12377;&#12427;&#25237;&#31080;&#27177;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#29694;&#23455;&#30340;&#12395;&#12399;&#12289;&#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#36861;&#21152;&#12377;&#12427;&#25163;&#32154;&#12365;&#12395;&#12388;&#12356;&#12390;&#12399;&#27177;&#38480;&#12434;&#22996;&#35698;&#12377;&#12427;&#12371;&#12392;&#12418;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12364;&#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398; "&#20445;&#35388;&#20154;" &#12392;&#12394;&#12426;&#12289;
  &#12381;&#12398;&#20998;&#37326;&#12384;&#12369;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12388;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12388;&#12356;&#12390;&#12399;&#24444;&#12425;&#12395;&#36984;&#12400;&#12379;&#12427;&#12398;&#12391;&#12377;
  (&#12371;&#12428;&#12399;&#12289;&#29305;&#12395;&#32763;&#35379;&#20316;&#26989;&#12394;&#12393;&#12434;&#20870;&#28369;&#12395;&#36914;&#12417;&#12427;&#12383;&#12417;&#12395;&#20415;&#21033;&#12391;&#12377;)&#12290;
</p><p>
  &#20316;&#26989;&#12398;&#20869;&#23481;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#27770;&#12414;&#12426;&#12434;
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12381;&#12398;&#12414;&#12414;&#21462;&#12426;&#20837;&#12428;&#12427;&#12431;&#12369;&#12395;&#12399;&#12356;&#12363;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;
  &#12300;&#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12399;&#33258;&#20998;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#21450;&#12406;&#31684;&#22258;&#12395;&#38306;&#12377;&#12427;&#27770;&#23450;&#12408;&#12398;&#25237;&#31080;&#27177;&#12434;&#25345;&#12385;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#21450;&#12400;&#12394;&#12356;&#31684;&#22258;&#12395;&#38306;&#12375;&#12390;&#12399;&#25237;&#31080;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12301;
  &#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36914;&#12417;&#26041;&#12395;&#38306;&#12377;&#12427;&#25237;&#31080;&#12399;&#12289;&#22522;&#26412;&#30340;&#12395;&#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#12415;&#12364;&#34892;&#12358;&#12371;&#12392;&#12301;
  &#12300;&#12383;&#12384;&#12375;&#12289;&#12418;&#12358;&#23569;&#12375;&#25237;&#31080;&#12391;&#12365;&#12427;&#20154;&#12398;&#31684;&#22258;&#12434;&#24195;&#12417;&#12427;&#12424;&#12358;&#12395;&#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12364;&#27770;&#12417;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12301;
  &#12392;&#12356;&#12358;&#22823;&#12414;&#12363;&#12394;&#32771;&#12360;&#12363;&#12383;&#12399;&#12377;&#12409;&#12390;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36969;&#29992;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#20184;&#19982;&#12395;&#38306;&#12377;&#12427;&#27880;&#24847;:
  &#37096;&#20998;&#30340;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12427;&#27231;&#33021;&#12434;&#20206;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#25345;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12391;&#12365;&#12428;&#12400;&#12381;&#12428;&#12399;&#20351;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12381;&#12398;&#29702;&#30001;&#12395;&#12388;&#12356;&#12390;&#12399;
  <span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12398;</span>
  <a class="xref" href="vc.html#vc-authz" title="&#25215;&#35469;">&#12300;&#25215;&#35469;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="&#20241;&#30496;&#29366;&#24907;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;"><div class="titlepage"><div><div><h3 class="title"><a name="dormant-committers"></a>&#20241;&#30496;&#29366;&#24907;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12354;&#12427;&#31243;&#24230;&#12398;&#26399;&#38291; (&#12383;&#12392;&#12360;&#12400;&#19968;&#24180;&#38291;)
  &#12356;&#12385;&#12393;&#12418;&#12467;&#12511;&#12483;&#12488;&#12364;&#12394;&#12363;&#12387;&#12383;&#20154;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#33258;&#21205;&#30340;&#12395;&#21066;&#38500;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#31169;&#12399;&#12371;&#12428;&#12399;&#12354;&#12414;&#12426;&#12513;&#12522;&#12483;&#12488;&#12364;&#12394;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12363;&#12416;&#12375;&#12429;&#36870;&#21177;&#26524;&#12391;&#12375;&#12423;&#12358;&#12290;&#29702;&#30001;&#12399;&#27425;&#12398;&#12405;&#12383;&#12388;&#12391;&#12377;&#12290;
</p><p>
  &#12414;&#12378;&#12289;&#21336;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#26377;&#21177;&#26399;&#38480;&#20999;&#12428;&#12434;&#38450;&#12368;&#12383;&#12417;&#12384;&#12369;&#12398;&#30446;&#30340;&#12391;&#12289;
  &#12354;&#12414;&#12426;&#24847;&#21619;&#12398;&#12394;&#12356;&#19981;&#35201;&#12394;&#12467;&#12511;&#12483;&#12488;&#12434;&#12377;&#12427;&#20154;&#12364;&#22679;&#12360;&#12390;&#12367;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#27425;&#12395;&#12289;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#20309;&#12398;&#24847;&#21619;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12427;&#12363;&#21542;&#12363;&#12434;&#27770;&#12417;&#12427;&#20027;&#35201;&#12394;&#26465;&#20214;&#12399;&#12289;
  &#12381;&#12398;&#20154;&#12364;&#27491;&#12375;&#12356;&#29366;&#27841;&#21028;&#26029;&#12434;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12391;&#12377;&#12290;
  &#21336;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12398;&#27963;&#21205;&#12363;&#12425;&#19968;&#26178;&#38626;&#12428;&#12390;&#12356;&#12383;&#12384;&#12369;&#12391;
  &#21028;&#26029;&#21147;&#12364;&#20302;&#19979;&#12375;&#12383;&#12392;&#35211;&#12394;&#12377;&#12371;&#12392;&#12394;&#12435;&#12390;&#12391;&#12365;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;?
  &#20206;&#12395;&#25968;&#24180;&#12398;&#38291;&#23436;&#20840;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#38626;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#12381;&#12398;&#38291;&#12467;&#12540;&#12489;&#12418;&#19968;&#20999;&#35211;&#12378;&#12395;&#38283;&#30330;&#38306;&#36899;&#12398;&#35696;&#35542;&#12395;&#12418;&#30446;&#12434;&#36890;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12391;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24489;&#24112;&#12375;&#12383;&#24444;&#12399;
  &#33258;&#20998;&#12398;&#29366;&#27841;&#12434;&#12365;&#12385;&#12435;&#12392;&#25226;&#25569;&#12375;&#12289;&#36969;&#20999;&#12395;&#25391;&#12427;&#33310;&#12387;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12398;&#21028;&#26029;&#21147;&#12434;&#20449;&#12376;&#12383;&#12363;&#12425;&#12371;&#12381;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12383;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12384;&#12387;&#12383;&#12425;&#26368;&#24460;&#12414;&#12391;&#20449;&#38972;&#12375;&#12390;&#12354;&#12370;&#12414;&#12375;&#12423;&#12358;&#12424;&#12290;
  &#12495;&#12452;&#12473;&#12463;&#12540;&#12523;&#12398;&#21330;&#26989;&#35388;&#26360;&#12364;&#26399;&#38480;&#20999;&#12428;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12394;&#12356;&#12398;&#12392;&#21516;&#27096;&#12395;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12395;&#12384;&#12387;&#12390;&#26377;&#21177;&#26399;&#38480;&#12394;&#12435;&#12363;&#12356;&#12425;&#12394;&#12356;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><p>
  &#26178;&#12395;&#12399;&#12289;&#12467;&#12511;&#12483;&#12479;&#12540;&#33258;&#36523;&#12363;&#12425;&#12300;&#31169;&#12434;&#21066;&#38500;&#12375;&#12390;&#12411;&#12375;&#12356;&#12301;
  &#12300;&#20241;&#30496;&#29366;&#24907;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#12467;&#12511;&#12483;&#12479;&#12540;&#19968;&#35239;
  (&#12371;&#12398;&#19968;&#35239;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399; <span>&#19979;&#12398;</span>
  <a class="xref" href="committers.html#commit-access-openness" title="&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;">&#12300;&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
  &#12395;&#26126;&#31034;&#12375;&#12390;&#12411;&#12375;&#12356;&#12301;&#12392;&#12362;&#39000;&#12356;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#24403;&#28982;&#12381;&#12398;&#12362;&#39000;&#12356;&#12434;&#21463;&#12369;&#20837;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect2" title="&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="commit-access-openness"></a>&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;</h3></div></div></div><p>
  &#35504;&#12363;&#12434;&#26032;&#12375;&#12356;&#12467;&#12511;&#12483;&#12479;&#12540;&#12392;&#12375;&#12390;&#35469;&#12417;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12399;&#20869;&#23494;&#12395;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#35469;&#12417;&#12427;&#22522;&#28310;&#12420;&#12381;&#12398;&#25163;&#32154;&#12365;&#12395;&#12388;&#12356;&#12390;&#12399;&#29305;&#12395;&#38560;&#12377;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12392;&#12356;&#12358;&#12363;&#12289;&#20844;&#34920;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12414;&#12427;&#12391;&#26143;&#23460;&#24193; (Star Chamber)
  &#12398;&#12424;&#12358;&#12394;&#35598;&#12417;&#12356;&#12383;&#32068;&#32340;&#12384;&#12392;&#35211;&#12425;&#12428;&#12427;&#12371;&#12392;&#12418;&#12394;&#12367;&#12394;&#12426;&#12289;
  &#12424;&#12356;&#12497;&#12483;&#12481;&#12434;&#25237;&#31295;&#12375;&#12390;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20869;&#12391;&#35469;&#12417;&#12425;&#12428;&#12373;&#12360;&#12377;&#12428;&#12400;
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12394;&#12428;&#12427;&#12398;&#12384;&#12392;&#29702;&#35299;&#12375;&#12390;&#12418;&#12425;&#12360;&#12414;&#12377;&#12290;
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
  &#12371;&#12398;&#24773;&#22577;&#12434;&#38283;&#30330;&#32773;&#12416;&#12369;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#35352;&#36617;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#21462;&#24471;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12427;&#20154;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399;&#12289;
  &#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36002;&#29486;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12391;&#12354;&#12429;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12394;&#12427;&#25163;&#38918;&#12434;&#20844;&#38283;&#12377;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#29694;&#22312;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;<span class="emphasis"><em>&#19968;&#35239;</em></span>
  &#12418;&#20844;&#38283;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#24773;&#22577;&#12434;&#20844;&#38283;&#12377;&#12427;&#22580;&#25152;&#12392;&#12375;&#12390;&#26132;&#12363;&#12425;&#12424;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12484;&#12522;&#12540;&#12398;&#26368;&#19978;&#20301;&#12395;&#12354;&#12427;
  <code class="filename">MAINTAINERS</code> &#12354;&#12427;&#12356;&#12399;
  <code class="filename">COMMITTERS</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#12414;&#12378;&#12501;&#12523;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12388;&#12513;&#12531;&#12496;&#12540;&#12398;&#19968;&#35239;&#12434;&#35352;&#36617;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#24460;&#12395;&#12289;&#21508;&#20998;&#37326;&#21029;&#12395;&#37096;&#20998;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12388;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#19968;&#35239;&#12434;&#32154;&#12369;&#12414;&#12377;&#12290;
  &#21508;&#12513;&#12531;&#12496;&#12540;&#12395;&#12388;&#12356;&#12390;&#21517;&#21069;&#12392;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#35352;&#36617;&#12375;&#12414;&#12377;&#12364;&#12289;
  &#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12395;&#12388;&#12356;&#12390;&#12399;&#12513;&#12531;&#12496;&#12540;&#12398;&#24076;&#26395;&#12395;&#24540;&#12376;&#12390;&#12473;&#12497;&#12512;&#23550;&#31574;&#12398;&#12456;&#12531;&#12467;&#12540;&#12489;&#12434;&#26045;&#12377;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;
  (<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12398;</span>
  <a class="xref" href="mailing-lists.html#address-hiding" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;">&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12290;
</p><p>
  &#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12392;&#37096;&#20998;&#12467;&#12511;&#12483;&#12479;&#12540;&#12399;&#26126;&#30906;&#12394;&#22522;&#28310;&#12391;&#21306;&#21029;&#12391;&#12365;&#12427;&#12418;&#12398;&#12394;&#12398;&#12391;&#12289;
  &#19968;&#35239;&#19978;&#12391;&#12418;&#21306;&#21029;&#12375;&#12390;&#12362;&#12367;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12384;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#24517;&#28982;&#30340;&#12395;&#30330;&#29983;&#12377;&#12427;&#38750;&#20844;&#24335;&#12394;&#21306;&#21029;
  (&#24433;&#38911;&#21147;&#12398;&#22823;&#12365;&#12356;&#20154;&#12399;&#35504;&#12363;&#12394;&#12393;) &#12414;&#12391;&#12418;&#19968;&#35239;&#12395;&#21453;&#26144;&#12373;&#12379;&#12424;&#12358;&#12392;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#19968;&#35239;&#12399;&#20844;&#24335;&#12394;&#35352;&#37682;&#12394;&#12398;&#12391;&#12354;&#12426;&#12289;&#35226;&#12360;&#26360;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#20006;&#12403;&#38918;&#12399;&#12289;&#21336;&#32020;&#12395;&#12450;&#12523;&#12501;&#12449;&#12505;&#12483;&#12488;&#38918;&#12395;&#12377;&#12427;&#12363;
  &#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12394;&#12387;&#12383;&#26178;&#26399;&#12398;&#38918;&#12395;&#12375;&#12414;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2940992" href="#idp2940992" class="para">34</a>] </sup>
      &#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#32771;&#12360;&#26041;&#12399;&#12289;&#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;
      &#22810;&#23569;&#30064;&#12394;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;
      &#21508;&#20491;&#20154;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12522;&#12531;&#12463;&#12375;&#12383;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
      &#20316;&#25104;&#12375;&#12383;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#23550;&#12377;&#12427;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
      &#12381;&#12428;&#12391;&#12418;&#12394;&#12362;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#12392;&#12356;&#12358; <span class="emphasis"><em>&#32771;&#12360;&#26041;</em></span>
      &#33258;&#20307;&#12399;&#26377;&#21177;&#12391;&#12377;&#12290;&#12300;&#12467;&#12511;&#12483;&#12488;&#27177;&#12301;&#12392;&#12399;&#35201;&#12377;&#12427;&#12395;
      &#12300;&#12381;&#12398;&#12464;&#12523;&#12540;&#12503;&#12364;&#20316;&#25104;&#12375;&#12289;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12540;&#12489;&#12395;
      &#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#27177;&#38480;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#20013;&#22830;&#31649;&#29702;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;
      &#12371;&#12428;&#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#12408;&#12398;&#30452;&#25509;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
      &#20998;&#25955;&#22411;&#12398;&#22580;&#21512;&#12399;&#12289;&#33258;&#20998;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#37197;&#24067;&#12501;&#12449;&#12452;&#12523;&#26412;&#20307;&#12395;
      pull &#12391;&#12365;&#12427;&#27177;&#38480;&#12398;&#12371;&#12392;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
      &#12356;&#12378;&#12428;&#12395;&#12375;&#12390;&#12418;&#32771;&#12360;&#26041;&#12399;&#21516;&#12376;&#12391;&#12377;&#12290;&#35023;&#20596;&#12398;&#31649;&#29702;&#26041;&#24335;&#12399;&#12381;&#12428;&#12411;&#12393;&#37325;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="transitions.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="credit.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24341;&#12365;&#32153;&#12366; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12463;&#12524;&#12472;&#12483;&#12488;</td></tr></table></div></body></html>
