<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;"><link rel="prev" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;"><link rel="next" href="written-rules.html" title="&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="social-infrastructure.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</th><td width="20%" align="right"> <a accesskey="n" href="written-rules.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="consensus-democracy"></a>&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;</h2></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#32154;&#12356;&#12390;&#12356;&#12367;&#12392;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12514;&#12487;&#12523;&#12363;&#12425;&#38626;&#12428;&#12289;
    &#12424;&#12426;&#38283;&#12363;&#12428;&#12383;&#27665;&#20027;&#20027;&#32681;&#30340;&#12394;&#12503;&#12525;&#12475;&#12473;&#12395;&#31227;&#34892;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#29305;&#23450;&#12398;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12395;&#24517;&#12378;&#12375;&#12418;&#28288;&#36275;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#21336;&#12395;&#12464;&#12523;&#12540;&#12503;&#20027;&#20307;&#12398;&#32113;&#27835;&#12398;&#26041;&#12364;&#12289;
    &#29983;&#29289;&#23398;&#12398;&#12513;&#12479;&#12501;&#12449;&#12540;&#12434;&#20511;&#12426;&#12390;&#35328;&#12360;&#12400; "&#36914;&#21270;&#30340;&#12395;&#23433;&#23450;&#12375;&#12390;&#12356;&#12427;" &#12363;&#12425;&#12391;&#12377;&#12290;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#36523;&#12434;&#24341;&#12356;&#12383;&#12426;&#12289;
    &#27770;&#23450;&#12377;&#12427;&#27177;&#38480;&#12434;&#22810;&#12367;&#12398;&#20154;&#12395;&#24179;&#31561;&#12395;&#19982;&#12360;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12365;&#12399;&#12356;&#12388;&#12391;&#12418;&#12289;
    &#12464;&#12523;&#12540;&#12503;&#12364;&#26032;&#12375;&#12356;&#12289;&#29420;&#35009;&#30340;&#12391;&#12394;&#12356;&#20181;&#32068;&#12415;&#12395;&#31227;&#34892;&#12377;&#12427;&#27231;&#20250;&#12395;&#12394;&#12426;&#12414;&#12377; &#8212;
    &#12371;&#12428;&#12399;&#35328;&#12387;&#12390;&#12415;&#12428;&#12400;&#32068;&#32340;&#21270;&#12434;&#34892;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12398;&#12464;&#12523;&#12540;&#12503;&#12399;&#26368;&#21021;&#12398;1&#12289;2&#22238;&#12399;&#12371;&#12398;&#27231;&#20250;&#12434;&#21033;&#29992;&#12375;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#32080;&#23616;&#12399;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12356;&#12387;&#12383;&#12435;&#12381;&#12358;&#12375;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;
    &#12418;&#12392;&#12398;&#20181;&#32068;&#12415;&#12395;&#25147;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20309;&#25925;&#12363;&#12399;&#24120;&#35672;&#12391;&#12431;&#12363;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20206;&#12395; N&#20154; &#12363;&#12425;&#12394;&#12427;&#12464;&#12523;&#12540;&#12503;&#12364;&#12289;&#12354;&#12427;&#20154;&#12395;&#29305;&#21029;&#12394;&#27177;&#38480;&#12434;&#19982;&#12360;&#12390;&#12356;&#12427;&#12392;&#20206;&#23450;&#12377;&#12427;&#12392;&#12289;
    N - 1 &#20154;&#12364;&#33258;&#20998;&#12398;&#24433;&#38911;&#21147;&#12434;&#24369;&#12417;&#12427;&#12371;&#12392;&#12395;&#21512;&#24847;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#29420;&#35009;&#30340;&#12391;&#12394;&#12356;&#20181;&#32068;&#12415;&#12391;&#12399;&#12289;&#26222;&#36890;&#29305;&#21029;&#12394;&#27177;&#38480;&#12434;&#29305;&#23450;&#12398;&#20154;&#12395;&#19982;&#12360;&#12383;&#12356;&#12392;&#12399;&#24605;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12392;&#12360;&#26395;&#12435;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;&#32080;&#26524;&#12392;&#12375;&#12390;&#34892;&#20351;&#12391;&#12365;&#12427;&#27177;&#21147;&#12399;&#26465;&#20214;&#20184;&#12365;&#12398;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12434;&#20219;&#21629;&#12375;&#12390;&#12418;&#12289;&#12371;&#12428;&#12399;&#26126;&#12425;&#12363;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
    &#12464;&#12523;&#12540;&#12503;&#12364;&#24460;&#12395;&#36766;&#12417;&#12373;&#12379;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12422;&#12360;&#12395;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12356;&#12387;&#12383;&#12435;&#12459;&#12522;&#12473;&#12510;&#30340;&#12394;&#20154;&#12398;&#12522;&#12540;&#12480;&#12540;&#12471;&#12483;&#12503;&#12434;&#12392;&#12427;&#20181;&#32068;&#12415;&#12363;&#12425;&#12289;
    &#12424;&#12426;&#22411;&#12395;&#12399;&#12414;&#12387;&#12383;&#12464;&#12523;&#12540;&#12503;&#12505;&#12540;&#12473;&#12398;&#20181;&#32068;&#12415;&#12395;&#31227;&#34892;&#12377;&#12428;&#12400;&#12289;&#28357;&#22810;&#12395;&#20803;&#12395;&#25147;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#20181;&#32068;&#12415;&#12364;&#12393;&#12358;&#27231;&#33021;&#12377;&#12427;&#12363;&#12434;&#35443;&#32048;&#12395;&#35211;&#12390;&#12356;&#12367;&#12392;&#12289;
    &#20013;&#36523;&#12399;&#22793;&#21270;&#12395;&#23500;&#12435;&#12391;&#12356;&#12414;&#12377;&#12364;&#12289;&#20849;&#36890;&#12375;&#12383;&#35201;&#32032;&#12364;&#20108;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12399;&#12289;&#12464;&#12523;&#12540;&#12503;&#12399;&#12411;&#12392;&#12435;&#12393;&#12356;&#12388;&#12418;&#21512;&#24847;&#12395;&#22522;&#12389;&#12356;&#12390;&#21205;&#12367;&#12371;&#12392;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12399;&#12289;&#21512;&#24847;&#12395;&#36948;&#12375;&#12394;&#12356;&#12392;&#12365;&#12395;&#25237;&#31080;&#12398;&#20181;&#32068;&#12415;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    <em class="firstterm">&#21512;&#24847;</em> &#12392;&#12399;&#12289;&#30342;&#12364;&#21463;&#12369;&#20837;&#12428;&#12424;&#12358;&#12392;&#19968;&#33268;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12354;&#12356;&#12414;&#12356;&#12394;&#29366;&#24907;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#35504;&#12363;&#12364;&#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12435;&#12376;&#12419;&#12394;&#12356;&#12363;&#12392;&#25552;&#26696;&#12375;&#12289;
    &#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#35504;&#12418;&#21453;&#23550;&#12434;&#34920;&#26126;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12354;&#12427;&#12464;&#12523;&#12540;&#12503;&#12399;&#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
    &#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12435;&#12376;&#12419;&#12394;&#12356;&#12363;&#12392;&#25552;&#26696;&#12377;&#12427;&#20154;&#12399;&#12289;
    &#21512;&#24847;&#12392;&#12399;&#20309;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12392;&#12289;
    &#20206;&#12395;&#26126;&#12425;&#12363;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#21512;&#24847;&#12398;&#32080;&#26524;&#12393;&#12398;&#12424;&#12358;&#12394;&#34892;&#21205;&#12434;&#12392;&#12427;&#12398;&#12363;&#12434;&#20855;&#20307;&#30340;&#12395;&#36848;&#12409;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20132;&#12431;&#12373;&#12428;&#12427;&#12411;&#12392;&#12435;&#12393;&#12398;&#20250;&#35441;&#12399;&#25216;&#34899;&#30340;&#12394;&#35441;&#38988;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#27491;&#12375;&#12367;&#12496;&#12464;&#12434;&#30452;&#12377;&#26041;&#27861;&#12392;&#12363;&#12289;
    &#12354;&#12427;&#27231;&#33021;&#12434;&#36861;&#21152;&#12377;&#12427;&#12363;&#12289;&#12375;&#12394;&#12356;&#12363;&#12289;
    &#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#12393;&#12398;&#31243;&#24230;&#21427;&#23494;&#12395;&#25991;&#26360;&#21270;&#12377;&#12427;&#12363;&#12289;&#12394;&#12393;&#12391;&#12377;&#12290;
    &#21512;&#24847;&#12434;&#22522;&#26412;&#12392;&#12375;&#12383;&#32113;&#27835;&#12399;&#12289;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12381;&#12398;&#12418;&#12398;&#12392;&#12424;&#12367;&#21512;&#12358;&#12398;&#12391;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12377;&#12290;
    &#35696;&#35542;&#12364;&#32066;&#12431;&#12427;&#12414;&#12391;&#12395;&#12289;&#12393;&#12398;&#26041;&#21521;&#24615;&#12434;&#12392;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#21512;&#24847;&#12364;&#12424;&#12367;&#25104;&#31435;&#12375;&#12414;&#12377;&#12290;
    &#36890;&#24120;&#12399;&#35696;&#35542;&#12434;&#32066;&#20102;&#12377;&#12427;&#12392;&#12356;&#12358;&#25237;&#31295;&#12434;&#12375;&#12289;
    &#21516;&#26178;&#12395;&#20309;&#12364;&#27770;&#12414;&#12427;&#12398;&#12363;&#12434;&#12414;&#12392;&#12417;&#12383;&#19978;&#12391;&#12289;&#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12424;&#12397;&#12392;&#26263;&#12395;&#25552;&#26696;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12364; "&#24453;&#12387;&#12383;&#65281; &#20474;&#12399;&#21453;&#23550;&#12384;&#12290;&#12418;&#12358;&#23569;&#12375;&#24505;&#24213;&#30340;&#12395;&#35441;&#12375;&#21512;&#12358;&#24517;&#35201;&#12364;&#12354;&#12427;&#12397;&#12290;"
    &#12392;&#35328;&#12360;&#12427;&#26368;&#24460;&#12398;&#27231;&#20250;&#12434;&#19982;&#12360;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#35215;&#27169;&#12364;&#23567;&#12373;&#12367;&#12289;&#35696;&#35542;&#12395;&#20516;&#12375;&#12394;&#12356;&#20107;&#26564;&#12434;&#27770;&#12417;&#12427;&#12392;&#12365;&#12399;&#12289;
    &#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12392;&#12356;&#12358;&#25552;&#26696;&#12418;&#26263;&#40665;&#12395;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#38283;&#30330;&#32773;&#12364;&#12496;&#12464;&#20462;&#27491;&#12434;&#33258;&#30330;&#30340;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#22580;&#21512;&#12289;
    &#12381;&#12398;&#12467;&#12511;&#12483;&#12488;&#33258;&#20307;&#12364;&#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12371;&#12392;&#12434;&#25552;&#26696;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;"&#12371;&#12398;&#12496;&#12464;&#12399;&#30452;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12289;
    &#12371;&#12398;&#20462;&#27491;&#12364;&#27491;&#12375;&#12356;&#12420;&#12426;&#26041;&#12384;&#12392;&#30342;&#12364;&#21512;&#24847;&#12375;&#12383;&#12392;&#35211;&#20570;&#12377;&#12424;" &#12392;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#38283;&#30330;&#32773;&#12399;&#23455;&#38555;&#12395;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#35328;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#24444;&#12399;&#12383;&#12384;&#20462;&#27491;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12384;&#12369;&#12391;&#12377;&#12375;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12399;&#12431;&#12374;&#12431;&#12374;&#21516;&#24847;&#12377;&#12427;&#12392;&#21475;&#12395;&#20986;&#12375;&#12390;&#35328;&#12387;&#12383;&#12426;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#40665;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#21512;&#24847;&#12377;&#12427;&#12371;&#12392;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12383;&#20462;&#27491;&#12364;&#12289;&#21512;&#24847;&#12434;&#24471;&#12425;&#12428;&#12394;&#12356;&#12392;&#21028;&#26126;&#12375;&#12383;&#22580;&#21512;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12381;&#12428;&#12364;&#12414;&#12384;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12398;&#12424;&#12358;&#12395;&#35696;&#35542;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12420;&#12426;&#26041;&#12364;&#12358;&#12414;&#12367;&#34892;&#12367;&#29702;&#30001;&#12399;&#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#36848;&#12409;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12434;&#34892;&#12394;&#12358;&#12392;&#22533;&#12367;&#12394;&#12425;&#12378;&#12395;&#28168;&#12416;"><div class="titlepage"><div><div><h3 class="title"><a name="version-control-relaxation"></a>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12434;&#34892;&#12394;&#12358;&#12392;&#22533;&#12367;&#12394;&#12425;&#12378;&#12395;&#28168;&#12416;</h3></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#27770;&#23450;&#12364;&#20803;&#12395;&#25147;&#12379;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
    &#22793;&#26356;&#12434;&#20803;&#12395;&#25147;&#12377;&#21407;&#22240;&#12392;&#12375;&#12390;&#12424;&#12367;&#12354;&#12427;&#12398;&#12364;&#12289;
    &#30342;&#12395;&#12392;&#12387;&#12390;&#33391;&#12356;&#12418;&#12398;&#12384;&#12392;&#38291;&#36949;&#12387;&#12390;&#24605;&#12356;&#36796;&#12415;&#12289;&#22793;&#26356;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12371;&#12428;&#12399;&#32080;&#23616;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#24460;&#12395;&#21453;&#23550;&#24847;&#35211;&#12364;&#20986;&#12390;&#12367;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#21453;&#23550;&#24847;&#35211;&#12399;&#27770;&#12414;&#12387;&#12390;&#12289;
    &#20197;&#21069;&#12398;&#35696;&#35542;&#12434;&#35211;&#36867;&#12375;&#12383;&#12371;&#12392;&#12434;&#35435;&#12403;&#12427;&#12371;&#12392;&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#21453;&#23550;&#12377;&#12427;&#20154;&#12364;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12371;&#12428;&#12395;&#12354;&#12383;&#12427;&#35696;&#35542;&#12434;&#35211;&#12388;&#12369;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#30465;&#30053;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#12289;&#22793;&#26356;&#12364;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12427;&#21069;&#12392;&#24460;&#12392;&#12391;&#35696;&#35542;&#12398;&#21475;&#35519;&#12434;&#22793;&#12360;&#12427;&#29702;&#30001;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#23569;&#12394;&#12367;&#12392;&#12418;&#12289;&#12354;&#12427;&#12467;&#12511;&#12483;&#12488;&#12395;&#20381;&#23384;&#12377;&#12427;&#22793;&#26356;&#12364;&#34892;&#12431;&#12428;&#12383;&#26178;&#28857;
    &#65288;i.e. &#12418;&#12392;&#12418;&#12392;&#21152;&#12360;&#12425;&#12428;&#12390;&#12356;&#12383;&#22793;&#26356;&#12364;&#31361;&#28982;&#21066;&#38500;&#12373;&#12428;&#12289;&#26032;&#12375;&#12356;&#22793;&#26356;&#12364;&#12381;&#12428;&#12434;&#22730;&#12375;&#12390;&#12356;&#12383;&#22580;&#21512;&#65289;
    &#12414;&#12391;&#12289;&#22793;&#26356;&#12399;&#21462;&#12426;&#28040;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12424;&#12367;&#12394;&#12356;&#12289;
    &#12414;&#12383;&#12399;&#24615;&#24613;&#12394;&#21028;&#26029;&#12363;&#12425;&#29983;&#12376;&#12383;&#32080;&#26524;&#12434;&#20803;&#12395;&#25147;&#12377;&#25163;&#27573;&#12434;&#19982;&#12360;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#35328;&#12356;&#26367;&#12360;&#12428;&#12400;&#12289;&#38283;&#30330;&#32773;&#12364;&#20309;&#12363;&#12434;&#12377;&#12427;&#21069;&#12395;&#12393;&#12398;&#12367;&#12425;&#12356;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12364;&#24517;&#35201;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12289;
    &#33258;&#20998;&#12398;&#30452;&#24863;&#12434;&#20449;&#38972;&#12375;&#12390;&#21028;&#26029;&#12375;&#12390;&#12424;&#12356;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#12371;&#12392;&#12399;&#12289;&#21512;&#24847;&#12434;&#24471;&#12427;&#25163;&#32154;&#12365;&#12434;&#22411;&#12395;&#12399;&#12417;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12371;&#12398;&#25163;&#32154;&#12365;&#12434;&#24863;&#35226;&#12391;&#25201;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#23567;&#12373;&#12394;&#22793;&#26356;&#12399;&#12289;&#35696;&#35542;&#12434;&#12375;&#12394;&#12356;&#12363;&#12289;&#26368;&#23567;&#38480;&#12398;&#35696;&#35542;&#12384;&#12369;&#12375;&#12390;&#12289;2&#12289;3&#12398;&#36059;&#25104;&#12364;&#12354;&#12387;&#12383;&#12354;&#12392;&#12395;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;
    &#12424;&#12426;&#37325;&#35201;&#12394;&#22793;&#26356;&#12289;&#29305;&#12395;&#22810;&#12367;&#12398;&#12467;&#12540;&#12489;&#12434;&#19981;&#23433;&#23450;&#12395;&#12373;&#12379;&#12427;&#22793;&#26356;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#38283;&#30330;&#32773;&#36948;&#12399;&#21512;&#24847;&#12395;&#36948;&#12375;&#12383;&#12289;
    &#12388;&#12414;&#12426;&#21336;&#12395;&#12513;&#12540;&#12523;&#12434;&#38971;&#32321;&#12395;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12384;&#12369;&#12398;&#29702;&#30001;&#12391;&#37325;&#35201;&#12394;&#35696;&#35542;&#12434;&#12394;&#12356;&#12364;&#12375;&#12429;&#12395;&#12375;&#12383;&#12516;&#12484;&#12399;&#12356;&#12394;&#12356;&#12399;&#12378;&#12384;&#12289;
    &#12392;&#12356;&#12358;&#21512;&#29702;&#30340;&#12394;&#26681;&#25312;&#12364;&#12354;&#12427;&#12392;&#12415;&#12394;&#12377;&#21069;&#12395;&#12289;&#65297;&#26085;&#12363;&#65298;&#26085;&#12398;&#38291;&#12434;&#32622;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
    &#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12289;&#33258;&#20998;&#12364;&#12420;&#12427;&#12409;&#12365;&#12371;&#12392;&#12434;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
    &#21336;&#12395;&#20316;&#26989;&#12434;&#36914;&#12417;&#12390;&#12420;&#12426;&#36930;&#12370;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20462;&#27491;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#26356;&#26032;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#22793;&#26356;&#12289;
    &#12381;&#12375;&#12390;&#35696;&#35542;&#12395;&#12394;&#12426;&#12381;&#12358;&#12395;&#12394;&#12356;&#20182;&#12398;&#12354;&#12425;&#12422;&#12427;&#12371;&#12392;&#12395;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
    &#36890;&#24120;&#12289;&#12392;&#12425;&#12428;&#12383;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#20803;&#12395;&#25147;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#20107;&#20363;&#12399;&#23569;&#12375;&#12375;&#12363;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
    &#12381;&#12358;&#12375;&#12383;&#20107;&#20363;&#12399;&#12465;&#12540;&#12473;&#12496;&#12452;&#12465;&#12540;&#12473;&#12391;&#25201;&#12360;&#12414;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#32862;&#12367;&#32819;&#12434;&#25345;&#12383;&#12394;&#12356;&#12371;&#12392;&#12434;&#22888;&#21169;&#12377;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#35696;&#35542;&#20013;&#12398;&#20107;&#38917;&#12392;&#12289;&#26082;&#12395;&#23455;&#34892;&#12373;&#12428;&#12390;&#21177;&#26524;&#12364;&#34920;&#12428;&#12390;&#12356;&#12427;&#27770;&#23450;&#20107;&#38917;&#12398;&#38291;&#12395;&#12399;&#12289;
    &#12356;&#12367;&#12425;&#25216;&#34899;&#30340;&#12395;&#20803;&#12395;&#25147;&#12379;&#12427;&#12392;&#12399;&#12356;&#12387;&#12390;&#12418;&#31934;&#31070;&#30340;&#12394;&#24046;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#36948;&#12399;&#21218;&#12356;&#12364;&#34892;&#21205;&#12395;&#32331;&#12364;&#12427;&#12392;&#12356;&#12388;&#12418;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12375;&#12289;
    &#23455;&#38555;&#12395;&#34892;&#12431;&#12428;&#12383;&#22793;&#26356;&#12434;&#20803;&#12395;&#25147;&#12377;&#12398;&#12399;&#12289;
    &#12399;&#12376;&#12417;&#12395;&#22793;&#26356;&#12377;&#12427;&#12398;&#12434;&#12420;&#12417;&#12373;&#12379;&#12427;&#12411;&#12393;&#12289;&#27671;&#12364;&#36914;&#12414;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12354;&#12427;&#38283;&#30330;&#32773;&#12364;&#12371;&#12398;&#20107;&#23455;&#12434;&#24746;&#29992;&#12375;&#12289;&#35696;&#35542;&#12364;&#24517;&#35201;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#22793;&#26356;&#12434;&#24613;&#12356;&#12391;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#22580;&#21512;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#36948;&#12399;&#25991;&#21477;&#12434;&#35328;&#12360;&#12414;&#12377;&#12375;&#12289;&#35328;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#20107;&#24907;&#12364;&#22909;&#36578;&#12377;&#12427;&#12414;&#12391;&#12289;&#12424;&#12426;&#21427;&#12375;&#12356;&#22522;&#28310;&#12434;&#12381;&#12398;&#38283;&#30330;&#32773;&#12395;&#23432;&#12425;&#12379;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#21512;&#24847;&#12395;&#33267;&#12425;&#12394;&#12369;&#12428;&#12400;&#25237;&#31080;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="voting"></a>&#21512;&#24847;&#12395;&#33267;&#12425;&#12394;&#12369;&#12428;&#12400;&#25237;&#31080;&#12377;&#12427;</h3></div></div></div><p>
    &#35696;&#35542;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#32080;&#35542;&#12364;&#12391;&#12394;&#12356;&#12371;&#12392;&#12364;&#24517;&#12378;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#34892;&#12365;&#35440;&#12414;&#12387;&#12383;&#29366;&#24907;&#12434;&#25171;&#38283;&#12377;&#12427;&#12354;&#12425;&#12422;&#12427;&#25163;&#27573;&#12364;&#22833;&#25943;&#12395;&#32066;&#12431;&#12387;&#12383;&#22580;&#21512;&#12289;
    &#25237;&#31080;&#12364;&#25171;&#38283;&#31574;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#25237;&#31080;&#12434;&#34892;&#12358;&#21069;&#12395;&#12399;&#12289;&#32080;&#35542;&#12398;&#20505;&#35036;&#12392;&#12394;&#12427;&#36984;&#25246;&#32930;&#12434;&#26126;&#30906;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12371;&#12391;&#12289;&#26222;&#27573;&#12420;&#12387;&#12390;&#12356;&#12427;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12434;&#12375;&#12390;&#12415;&#12427;&#12392;&#12289;
    &#32080;&#35542;&#12434;&#20986;&#12377;&#25163;&#32154;&#12365;&#12392;&#24847;&#22806;&#12395;&#12424;&#12367;&#21512;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#20877;&#12403;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#25237;&#31080;&#12395;&#12394;&#12427;&#35542;&#28857;&#12399;&#12289;&#35079;&#38609;&#12391;&#22810;&#38754;&#30340;&#12394;&#21839;&#38988;&#12434;&#21547;&#12416;&#12371;&#12392;&#12364;&#12383;&#12403;&#12383;&#12403;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#35079;&#38609;&#12394;&#35696;&#35542;&#12391;&#12399;&#12289;
    <em class="firstterm">&#20210;&#35009;&#20154;</em> &#12398;&#24441;&#21106;&#12434;&#26524;&#12383;&#12377;&#20154;&#12364;&#26222;&#36890;&#12402;&#12392;&#12426;&#12363;&#12405;&#12383;&#12426;&#12399;&#12356;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#23450;&#26399;&#30340;&#12395;&#12373;&#12414;&#12374;&#12414;&#12394;&#20027;&#24373;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12434;&#12509;&#12473;&#12488;&#12375;&#12289;
    &#21453;&#23550;&#65288;&#36059;&#25104;&#65289;&#24847;&#35211;&#12398;&#26680;&#12364;&#12393;&#12371;&#12395;&#12354;&#12427;&#12398;&#12363;&#12434;&#36861;&#12356;&#12363;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#12414;&#12392;&#12417;&#12399;&#12289;&#35696;&#35542;&#12364;&#12393;&#12398;&#20301;&#36914;&#12435;&#12391;&#12356;&#12427;&#12398;&#12363;&#12434;&#30693;&#12387;&#12383;&#12426;&#12289;
    &#12393;&#12358;&#12356;&#12358;&#21839;&#38988;&#12395;&#21462;&#12426;&#32068;&#12435;&#12391;&#12356;&#12427;&#12398;&#12363;&#12434;&#35226;&#12360;&#12390;&#12362;&#12367;&#12398;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#23455;&#38555;&#12395;&#25237;&#31080;&#12364;&#24517;&#35201;&#12395;&#12394;&#12387;&#12383;&#22580;&#21512;&#12395;&#12289;&#25237;&#31080;&#29992;&#32025;&#12398;&#12402;&#12394;&#22411;&#12392;&#12375;&#12390;&#24441;&#31435;&#12388;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#20210;&#35009;&#20154;&#12364;&#20181;&#20107;&#12434;&#12358;&#12414;&#12367;&#12371;&#12394;&#12379;&#12400;&#12289;
    &#26178;&#12364;&#26469;&#12428;&#12400;&#30342;&#12395;&#25237;&#31080;&#12375;&#12414;&#12375;&#12423;&#12358;&#12392;&#21628;&#12403;&#12363;&#12369;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#24444;&#12425;&#12364;&#20316;&#12387;&#12383;&#12414;&#12392;&#12417;&#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12383;&#25237;&#31080;&#29992;&#32025;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#20210;&#35009;&#20154;&#33258;&#36523;&#12399;&#12289;&#35696;&#35542;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#23550;&#31435;&#12377;&#12427;&#20154;&#12398;&#24847;&#35211;&#12434;&#29702;&#35299;&#12375;&#12289;&#20013;&#31435;&#30340;&#12395;&#34920;&#29694;&#12391;&#12365;&#12289;
    &#33258;&#20998;&#12398;&#21516;&#24535;&#12398;&#27671;&#25345;&#12385;&#12364;&#35696;&#35542;&#12434;&#20013;&#31435;&#30340;&#12395;&#12414;&#12392;&#12417;&#12427;&#12398;&#12434;&#22952;&#12370;&#12394;&#12369;&#12428;&#12400;&#12289;
    &#36059;&#25104;&#12289;&#21453;&#23550;&#12398;&#31435;&#22580;&#12434;&#36229;&#36234;&#12375;&#12383;&#31435;&#22580;&#12395;&#12356;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#25237;&#31080;&#29992;&#32025;&#12398;&#23455;&#38555;&#12398;&#20869;&#23481;&#12399;&#12289;&#35696;&#35542;&#12398;&#20313;&#22320;&#12364;&#12394;&#12356;&#12418;&#12398;&#12395;&#12394;&#12427;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#25237;&#31080;&#12364;&#23455;&#38555;&#12395;&#34892;&#12431;&#12428;&#12427;&#12414;&#12391;&#12395;&#12289;&#21453;&#23550;&#24847;&#35211;&#12399;&#65298;&#12289;&#65299;&#12398;&#12461;&#12540;&#12392;&#12394;&#12427;&#21839;&#38988;&#12395;&#12414;&#12392;&#12417;&#12425;&#12428;&#12289;
    &#29702;&#35299;&#12391;&#12365;&#12427;&#12521;&#12505;&#12523;&#12420;&#31777;&#21336;&#12394;&#35500;&#26126;&#12364;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12364;&#25237;&#31080;&#29992;&#32025;&#12398;&#24418;&#24335;&#12381;&#12398;&#12418;&#12398;&#12395;&#21453;&#23550;&#12377;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12356;&#12358;&#20154;&#12399;&#12289;&#12383;&#12392;&#12360;&#12400;&#37325;&#35201;&#12394;&#36984;&#25246;&#32930;&#12364;&#25244;&#12369;&#12390;&#12356;&#12383;&#12426;&#12289;
    &#36984;&#25246;&#32930;&#12395;&#23550;&#12377;&#12427;&#27491;&#30906;&#12394;&#35500;&#26126;&#12364;&#12394;&#12356;&#12392;&#12356;&#12387;&#12383;&#12289;
    &#25237;&#31080;&#12364;&#27491;&#12375;&#12356;&#12418;&#12398;&#12363;&#12393;&#12358;&#12363;&#12434;&#24515;&#37197;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#25237;&#31080;&#12395;&#12424;&#12387;&#12390;&#20986;&#12427;&#32080;&#35542;&#12364;&#33258;&#20998;&#12398;&#26395;&#12416;&#12418;&#12398;&#12395;&#32118;&#23550;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#22810;&#20998;&#30693;&#12387;&#12390;&#12356;&#12390;&#12289;
    &#25237;&#31080;&#12434;&#36991;&#12369;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12398;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#25163;&#12398;&#22952;&#23475;&#34892;&#28858;&#12434;&#12393;&#12358;&#25201;&#12358;&#12363;&#12399;&#12289;
    <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span> &#12398;&#12289;
    <a class="xref" href="difficult-people.html" title="&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;">&#12300;&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
    &#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#24517;&#12378;&#27770;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
    &#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12395;&#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#31278;&#39006;&#12364;&#12354;&#12426;&#12289;&#12393;&#12358;&#12356;&#12387;&#12383;&#25163;&#32154;&#12365;&#12364;&#12392;&#12425;&#12428;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;
    &#21442;&#21152;&#32773;&#12364;&#38291;&#36949;&#12387;&#12383;&#24819;&#23450;&#12434;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12395;&#36969;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399; <em class="firstterm">&#35469;&#23450;&#25237;&#31080;</em> &#12391;&#12377;&#12290;
    &#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#25237;&#31080;&#32773;&#12364;&#33258;&#20998;&#12364;&#22909;&#12416;&#36984;&#25246;&#32930;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#25237;&#31080;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#35469;&#23450;&#25237;&#31080;&#12399;&#35500;&#26126;&#12377;&#12427;&#12398;&#12418;&#12289;&#24471;&#31080;&#25968;&#12434;&#25968;&#12360;&#12427;&#12398;&#12418;&#31777;&#21336;&#12391;&#12377;&#12375;&#12289;&#20182;&#12398;&#26041;&#27861;&#12392;&#30064;&#12394;&#12426;&#12289;
    &#19968;&#22238;&#12398;&#25237;&#31080;&#12391;&#28168;&#12415;&#12414;&#12377;&#12290;&#35469;&#23450;&#25237;&#31080;&#12392;&#20182;&#12398;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    <a class="ulink" href="http://en.wikipedia.org/wiki/Voting_system#List_of_systems" target="_top">http://en.wikipedia.org/wiki/Voting_system#List_of_systems</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12393;&#12398;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;&#38263;&#12367;&#35696;&#35542;&#12377;&#12427;&#12398;&#12399;&#36991;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#65288;&#24403;&#28982;&#12289;
    &#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#27770;&#12417;&#12427;&#12398;&#12395;&#12393;&#12398;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12358;&#12363;&#12434;&#35696;&#35542;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#65281;&#65289;
    &#35469;&#23450;&#25237;&#31080;&#12364;&#20778;&#12428;&#12383;&#36984;&#25246;&#12392;&#12394;&#12427;&#29702;&#30001;&#12399;&#12289;&#21453;&#23550;&#24847;&#35211;&#12434;&#34920;&#26126;&#12377;&#12427;&#12371;&#12392;&#12364;&#38627;&#12375;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#8212; &#12388;&#12414;&#12426;&#12289;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12399;&#12391;&#12365;&#12427;&#12384;&#12369;&#20844;&#24179;&#12391;&#12354;&#12427;&#12409;&#12365;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#26368;&#24460;&#12395;&#12289;&#25237;&#31080;&#12399;&#20844;&#38283;&#12398;&#22580;&#12391;&#34892;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#12289;&#20844;&#38283;&#12398;&#22580;&#12391;&#35696;&#35542;&#12375;&#12383;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12289;
    &#31192;&#23494;&#25237;&#31080;&#12395;&#12375;&#12383;&#12426;&#12289;&#21311;&#21517;&#25237;&#31080;&#12395;&#12375;&#12383;&#12426;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12458;&#12502;&#12470;&#12540;&#12496;&#12364;&#25237;&#31080;&#12434;&#35352;&#37682;&#12375;&#12289;&#32080;&#26524;&#12434;&#12481;&#12455;&#12483;&#12463;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12381;&#12375;&#12390;&#12377;&#12409;&#12390;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#35352;&#37682;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#25237;&#31080;&#12398;&#21442;&#21152;&#32773;&#12395;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#33258;&#20998;&#12398;&#25237;&#31080;&#12434;&#12509;&#12473;&#12488;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#12356;&#12388;&#25237;&#31080;&#12434;&#34892;&#12394;&#12358;&#12409;&#12365;&#12363;?"><div class="titlepage"><div><div><h3 class="title"><a name="when-to-vote"></a>&#12356;&#12388;&#25237;&#31080;&#12434;&#34892;&#12394;&#12358;&#12409;&#12365;&#12363;?</h3></div></div></div><p>
    &#25237;&#31080;&#12391;&#26368;&#12418;&#38627;&#12375;&#12356;&#12398;&#12399;&#12289;&#12356;&#12388;&#25237;&#31080;&#12434;&#34892;&#12358;&#12363;&#12391;&#12377;&#12290;&#19968;&#33324;&#30340;&#12395;&#12399;&#12289;
    &#25237;&#31080;&#12395;&#23455;&#38555;&#12395;&#36367;&#12415;&#20999;&#12427;&#12371;&#12392;&#12399;&#28357;&#22810;&#12395;&#12377;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#8212;
    &#12388;&#12414;&#12426;&#12289;&#20182;&#12398;&#12354;&#12425;&#12422;&#12427;&#25163;&#27573;&#12364;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12398;&#26368;&#24460;&#12398;&#25163;&#27573;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#25237;&#31080;&#12364;&#35696;&#35542;&#12434;&#35299;&#27770;&#12377;&#12427;&#32032;&#26228;&#12425;&#12375;&#12356;&#25163;&#27573;&#12384;&#12392;&#30475;&#20570;&#12373;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#23455;&#38555;&#12289;&#12381;&#12358;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;&#25237;&#31080;&#12399;&#35696;&#35542;&#12434;&#32066;&#32080;&#12373;&#12379;&#12289;
    &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#21109;&#36896;&#30340;&#12395;&#32771;&#12360;&#12427;&#12371;&#12392;&#12418;&#12420;&#12417;&#12373;&#12379;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
    &#35696;&#35542;&#12364;&#32154;&#12356;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289;&#30342;&#12364;&#22909;&#12416;&#26032;&#12375;&#12356;&#35299;&#27770;&#31574;&#12434;&#35504;&#12363;&#12364;&#24605;&#12356;&#20184;&#12367;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#39514;&#12367;&#12411;&#12393;&#12383;&#12403;&#12383;&#12403;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;&#27963;&#30330;&#12394;&#35696;&#35542;&#12399;&#12289;
    &#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#26032;&#12375;&#12356;&#32771;&#12360;&#26041;&#12434;&#29983;&#12415;&#20986;&#12375;&#12414;&#12377;&#12375;&#12289;&#32080;&#23616;&#30342;&#12434;&#28288;&#36275;&#12373;&#12379;&#12427;&#25552;&#26696;&#12395;&#12418;&#32331;&#12364;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#26032;&#12375;&#12356;&#25552;&#26696;&#12364;&#29983;&#12414;&#12428;&#12394;&#12367;&#12390;&#12418;&#12289;&#25237;&#31080;&#12434;&#34892;&#12358;&#12424;&#12426;&#12399;&#12289;
    &#22949;&#21332;&#26696;&#12434;&#20210;&#20171;&#12375;&#12390;&#12418;&#12425;&#12387;&#12383;&#26041;&#12364;&#36890;&#24120;&#12399;&#12414;&#12384;&#12510;&#12471;&#12391;&#12377;&#12290;
    &#22949;&#21332;&#12375;&#12383;&#12354;&#12392;&#12399;&#12289;&#30342;&#12364;&#12385;&#12423;&#12387;&#12392;&#24754;&#12375;&#12356;&#24605;&#12356;&#12434;&#12375;&#12414;&#12377;&#12290;
    &#19968;&#26041;&#12391;&#12289;&#25237;&#31080;&#12434;&#12375;&#12383;&#12354;&#12392;&#12399;&#21916;&#12406;&#20154;&#12364;&#12356;&#12427;&#19968;&#26041;&#12391;&#12289;&#24754;&#12375;&#12356;&#24605;&#12356;&#12434;&#12377;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
    &#25919;&#27835;&#30340;&#12394;&#35251;&#28857;&#12363;&#12425;&#12399;&#12289;&#21069;&#32773;&#12398;&#26041;&#12364;&#22909;&#12414;&#12375;&#12356;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12402;&#12392;&#12426;&#12402;&#12392;&#12426;&#12364;&#33258;&#20998;&#12398;&#24754;&#12375;&#12356;&#24605;&#12356;&#12395;&#23550;&#12375;&#12390;&#23550;&#20385;&#12434;&#25903;&#25173;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#28288;&#36275;&#12399;&#12375;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12428;&#12399;&#20182;&#12398;&#35504;&#12418;&#12364;&#21516;&#12376;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#25237;&#31080;&#12398;&#20027;&#12394;&#21033;&#28857;&#12399;&#12289;&#30342;&#12364;&#27425;&#12395;&#36914;&#12417;&#12427;&#24418;&#12391;&#21839;&#38988;&#12434;&#26368;&#32066;&#30340;&#12395;&#35299;&#27770;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#25237;&#31080;&#12399;&#30342;&#12434;&#29702;&#24615;&#30340;&#12394;&#23550;&#35441;&#12395;&#12424;&#12387;&#12390;&#21516;&#12376;&#32080;&#35542;&#12395;&#23566;&#12367;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#38957;&#25968;&#12391;&#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#31169;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#32076;&#39443;&#12434;&#31309;&#12417;&#12400;&#31309;&#12416;&#12411;&#12393;&#12289;
    &#20154;&#12293;&#12364;&#21839;&#38988;&#12434;&#25237;&#31080;&#12395;&#12424;&#12387;&#12390;&#35299;&#27770;&#12375;&#12383;&#12364;&#12425;&#12394;&#12367;&#12394;&#12427;&#12398;&#12364;&#12431;&#12363;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12416;&#12375;&#12429;&#12289;&#20197;&#21069;&#32771;&#12360;&#12383;&#12371;&#12392;&#12418;&#12394;&#12356;&#35299;&#27770;&#31574;&#12434;&#25506;&#12387;&#12383;&#12426;&#12289;
    &#12418;&#12392;&#12418;&#12392;&#12398;&#35336;&#30011;&#12424;&#12426;&#12418;&#21427;&#12375;&#12356;&#22949;&#21332;&#12434;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;
    &#26089;&#12414;&#12387;&#12383;&#25237;&#31080;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#27096;&#12293;&#12394;&#12486;&#12463;&#12491;&#12483;&#12463;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12418;&#12387;&#12392;&#12418;&#26126;&#30333;&#12394;&#12420;&#12426;&#26041;&#12399;&#12289;
    "&#12414;&#12384;&#25237;&#31080;&#12434;&#23455;&#26045;&#12377;&#12427;&#27573;&#38542;&#12391;&#12399;&#12394;&#12356;&#12392;&#24605;&#12358;&#12424;&#12290;" &#12392;&#12356;&#12387;&#12390;&#12289;&#20309;&#25925;&#12363;&#12434;&#35500;&#26126;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#21029;&#12398;&#12420;&#12426;&#26041;&#12392;&#12375;&#12390;&#12289;&#38750;&#20844;&#24335;&#12395;&#36059;&#25104;&#12398;&#20154;&#12399;&#25163;&#12434;&#25369;&#12370;&#12390;&#12418;&#12425;&#12358;&#65288;&#25304;&#26463;&#21147;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#65289;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#21453;&#24540;&#12364;&#26126;&#12425;&#12363;&#12395;&#19968;&#26041;&#12395;&#20559;&#12387;&#12390;&#12356;&#12383;&#12425;&#12289;
    &#27491;&#24335;&#12395;&#25237;&#31080;&#12434;&#34892;&#12358;&#12398;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#12289;&#31309;&#26997;&#30340;&#12395;&#22949;&#21332;&#12377;&#12427;&#12371;&#12392;&#12434;&#20154;&#12293;&#12395;&#20419;&#12377;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#21177;&#29575;&#30340;&#12394;&#12420;&#12426;&#26041;&#12399;&#12289;&#20154;&#12293;&#12364;&#21516;&#12376;&#20027;&#24373;&#12434;&#32368;&#12426;&#36820;&#12373;&#12378;&#12395;&#21839;&#38988;&#12395;&#20877;&#12403;&#21462;&#12426;&#32068;&#12417;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#26032;&#12375;&#12356;&#35299;&#27770;&#31574;&#12420;&#12289;&#20197;&#21069;&#12398;&#25552;&#26696;&#12395;&#22522;&#12389;&#12356;&#12383;&#26032;&#12375;&#12356;&#35222;&#28857;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12414;&#12428;&#12394;&#12465;&#12540;&#12473;&#12392;&#12375;&#12390;&#12289;&#31034;&#12373;&#12428;&#12383;&#20840;&#12390;&#12398;&#22949;&#21332;&#26696;&#12399;&#12289;
    &#22949;&#21332;&#12375;&#12390;&#12356;&#12394;&#12356;&#20840;&#12390;&#12398;&#26696;&#12424;&#12426;&#12418;&#21155;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#20840;&#21729;&#12364;&#19968;&#33268;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#22580;&#21512;&#12289;&#25237;&#31080;&#12434;&#23455;&#26045;&#12377;&#12427;&#12371;&#12392;&#12395;&#21453;&#23550;&#12375;&#12395;&#12367;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
    &#25237;&#31080;&#12398;&#26041;&#12364;&#12424;&#12426;&#20778;&#12428;&#12383;&#35299;&#27770;&#12395;&#32331;&#12364;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#12393;&#12398;&#12424;&#12358;&#12394;&#32080;&#26524;&#12395;&#12394;&#12387;&#12390;&#12418;&#20840;&#21729;&#12364;&#36942;&#24230;&#12395;&#24754;&#12375;&#12356;&#24605;&#12356;&#12434;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12381;&#12358;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#25237;&#31080;&#12434;&#24613;&#12368;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#25237;&#31080;&#12395;&#33267;&#12427;&#12414;&#12391;&#12398;&#35696;&#35542;&#12399;&#26377;&#27177;&#32773;&#12395;&#12356;&#12429;&#12356;&#12429;&#12394;&#12371;&#12392;&#12434;&#25945;&#12360;&#12427;&#12398;&#12391;&#12289;
    &#35696;&#35542;&#12434;&#26089;&#12356;&#27573;&#38542;&#12391;&#12420;&#12417;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#25237;&#31080;&#12398;&#32080;&#26524;&#20986;&#12390;&#12367;&#12427;&#12418;&#12398;&#12398;&#36074;&#12364;&#24746;&#12367;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#65288;&#25237;&#31080;&#12434;&#12375;&#12383;&#12364;&#12427;&#12394;&#12392;&#12356;&#12358;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12289;
    <span><a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a></span> &#12398; <a class="xref" href="stabilizing-a-release.html" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12390;&#12356;&#12427;&#12289;
    &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#22823;&#24133;&#12394;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#25237;&#31080;&#12395;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12371;&#12391;&#12399;&#12289;&#25237;&#31080;&#12399;&#23550;&#35441;&#12398;&#12513;&#12459;&#12491;&#12474;&#12512;&#12392;&#12375;&#12390;&#20685;&#12365;&#12289;
    &#26377;&#27177;&#32773;&#12434;&#22793;&#26356;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#25163;&#32154;&#12365;&#12395;&#21442;&#21152;&#12373;&#12379;&#12427;&#25163;&#27573;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;
    &#26377;&#27177;&#32773;&#12399;&#19982;&#12360;&#12425;&#12428;&#12383;&#22793;&#26356;&#12364;&#12393;&#12398;&#31243;&#24230;&#12398;&#12524;&#12499;&#12517;&#12540;&#12434;&#32076;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#21306;&#21029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;&#65289;
</p></div><div class="sect2" title="&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?"><div class="titlepage"><div><div><h3 class="title"><a name="electorate"></a>&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?</h3></div></div></div><p>
    &#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12358;&#12392;&#12394;&#12427;&#12392;&#12289;&#26377;&#27177;&#32773;&#12395;&#38306;&#12377;&#12427;&#30097;&#21839;&#12364;&#20986;&#12390;&#12365;&#12414;&#12377;&#12290;
    &#35504;&#12364;&#25237;&#31080;&#27177;&#12434;&#24471;&#12427;&#12398;&#12363;&#12289;&#12392;&#12356;&#12358;&#21839;&#38988;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#32330;&#32048;&#12394;&#21839;&#38988;&#12392;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12393;&#12398;&#20154;&#12364;&#29105;&#24515;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12363;&#12392;&#12363;&#12289;
    &#12393;&#12398;&#20154;&#12364;&#12424;&#12426;&#12424;&#12356;&#21028;&#26029;&#12434;&#19979;&#12379;&#12427;&#12363;&#12289;
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20844;&#24335;&#12395;&#35469;&#12417;&#12373;&#12379;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#19968;&#30058;&#12424;&#12356;&#12398;&#12399;&#12289;&#26082;&#12395;&#12354;&#12427;&#27177;&#38480;&#12398;&#21306;&#21029;&#12289;
    &#12388;&#12414;&#12426;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#21336;&#32020;&#12395;&#21033;&#29992;&#12375;&#12289;&#12381;&#12398;&#27177;&#38480;&#12395;&#25237;&#31080;&#27177;&#38480;&#12418;&#20184;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#23436;&#20840;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12392;&#12289;&#38480;&#23450;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12289;
    &#38480;&#23450;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#25345;&#12388;&#20154;&#12395;&#25237;&#31080;&#27177;&#12434;&#19982;&#12360;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#25163;&#32154;&#12365;&#12364;&#12393;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12363;&#12395;&#22823;&#12365;&#12367;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
    &#12383;&#12367;&#12373;&#12435;&#12398;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#12484;&#12540;&#12523;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12391;&#31649;&#29702;&#12373;&#12379;&#12427;&#12424;&#12358;&#12394;&#12420;&#12426;&#26041;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#27671;&#21069;&#12424;&#12367;&#37197;&#20998;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;
    &#38480;&#23450;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12364;&#21336;&#12395;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#27177;&#38480;&#12384;&#12369;&#12391;&#12289;
    &#25237;&#31080;&#27177;&#38480;&#12399;&#12394;&#12356;&#12371;&#12392;&#12434;&#26126;&#30906;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#36870;&#12395;&#32771;&#12360;&#12427;&#12392;&#12289;&#21516;&#12376;&#12371;&#12392;&#12364;&#24403;&#28982;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#23436;&#20840;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#25345;&#12388;&#20154;&#12395;&#12399;&#25237;&#31080;&#27177;&#38480;&#12418;&#12354;&#12427;&#12398;&#12384;&#12363;&#12425;&#12289;
    &#24444;&#12425;&#12399;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#25237;&#31080;&#27177;&#38480;&#12398;&#12354;&#12427;&#12513;&#12531;&#12496;&#12540;&#12392;&#12375;&#12390;&#36984;&#12400;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12290;
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#30772;&#22730;&#30340;&#12394;&#30330;&#35328;&#12434;&#12375;&#12383;&#12426;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22952;&#23475;&#12377;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#20154;&#12364;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12383;&#12392;&#12360;&#12381;&#12398;&#20154;&#12364;&#25216;&#34899;&#30340;&#12395;&#20778;&#12428;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#38555;&#12395;&#27880;&#24847;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#23436;&#20840;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12395;&#12379;&#12424;&#12289;&#38480;&#23450;&#30340;&#12394;&#12418;&#12398;&#12395;&#12379;&#12424;&#12289;
    &#26032;&#12375;&#12356;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#36984;&#12406;&#12395;&#12399;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12364;&#12289;
    &#12371;&#12398;&#22580;&#21512;&#12399;&#31192;&#23494;&#25237;&#31080;&#12364;&#36969;&#20999;&#12395;&#12394;&#12427;&#12414;&#12428;&#12394;&#20107;&#20363;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
    &#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#20154;&#12395;&#12388;&#12356;&#12390;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#25237;&#31080;&#12434;&#34892;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#20505;&#35036;&#32773;&#12398;&#24863;&#24773;(&#35413;&#21028;&#65289;&#12434;&#20663;&#12388;&#12369;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#20195;&#12431;&#12426;&#12395;&#26222;&#36890;&#20351;&#12431;&#12428;&#12427;&#12398;&#12399;&#12289;
    &#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#12415;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12503;&#12521;&#12452;&#12505;&#12540;&#12488;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12289;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#25552;&#26696;&#12434;&#12375;&#12289;
    &#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#26082;&#12395;&#12356;&#12427;&#12467;&#12511;&#12483;&#12479;&#12540;&#12364;&#25237;&#31080;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;
    &#20182;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12399;&#12381;&#12371;&#12391;&#34892;&#12431;&#12428;&#12427;&#35696;&#35542;&#12364;&#12503;&#12521;&#12452;&#12505;&#12540;&#12488;&#12394;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#33258;&#20998;&#12398;&#24605;&#12358;&#12392;&#12371;&#12429;&#12434;&#33258;&#30001;&#12395;&#36848;&#12409;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12371;&#12391;&#21453;&#23550;&#24847;&#35211;&#12364;&#20986;&#12394;&#12356;&#12383;&#12417;&#12395;&#12289;&#25237;&#31080;&#12364;&#24517;&#35201;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#20182;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#21453;&#23550;&#24847;&#35211;&#12434;&#36848;&#12409;&#12427;&#12481;&#12515;&#12531;&#12473;&#12434;&#24517;&#12378;&#19982;&#12360;&#12427;&#12383;&#12417;&#12395;&#65298;&#12289;&#65299;&#26085;&#24453;&#12387;&#12383;&#12354;&#12392;&#12289;
    &#25552;&#26696;&#32773;&#12399;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12394;&#12427;&#20505;&#35036;&#32773;&#12395;&#12513;&#12540;&#12523;&#12375;&#12390;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12414;&#12377;&#12290;
    &#21453;&#23550;&#24847;&#35211;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#20182;&#12398;&#21839;&#38988;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#35696;&#35542;&#12364;&#34892;&#12431;&#12428;&#12289;&#12362;&#12381;&#12425;&#12367;&#25237;&#31080;&#12364;&#34892;&#12431;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#12458;&#12540;&#12503;&#12531;&#12363;&#12388;&#29575;&#30452;&#12394;&#12418;&#12398;&#12395;&#12377;&#12427;&#12395;&#12379;&#12424;&#12289;
    &#35696;&#35542;&#12399;&#12392;&#12395;&#12363;&#12367;&#38750;&#20844;&#38283;&#12391;&#34892;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12424;&#12358;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#20154;&#12364;&#12289;&#20309;&#12364;&#36215;&#12365;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#30693;&#12387;&#12390;&#12356;&#12390;&#12289;
    &#27177;&#38480;&#12434;&#36016;&#12360;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#33258;&#20998;&#12399;&#25237;&#31080;&#27177;&#12418;&#22833;&#12387;&#12383;&#12435;&#12384;&#12392;&#27770;&#12417;&#12388;&#12369;&#12390;&#12375;&#12414;&#12387;&#12383;&#12426;&#12289;
    &#20663;&#12388;&#12356;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#35504;&#12363;&#12364;&#26126;&#31034;&#30340;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12364;&#27442;&#12375;&#12356;&#12392;&#38972;&#12435;&#12391;&#12365;&#12383;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#25552;&#26696;&#12395;&#12388;&#12356;&#12390;&#26908;&#35342;&#12375;&#12289;
    &#21463;&#12369;&#20837;&#12428;&#12427;&#12363;&#25298;&#12416;&#12363;&#12398;&#22238;&#31572;&#12434;&#26126;&#31034;&#30340;&#12395;&#34892;&#12358;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20206;&#12395;&#25298;&#12416;&#22580;&#21512;&#12399;&#12289;&#12399;&#12387;&#12365;&#12426;&#12392;&#35500;&#26126;&#12434;&#27839;&#12360;&#12390;&#12391;&#12365;&#12427;&#12384;&#12369;&#19969;&#23527;&#12395;&#26029;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400; "&#38283;&#30330;&#32773;&#12481;&#12540;&#12512;&#12399;&#21531;&#12398;&#12497;&#12483;&#12481;&#12434;&#27671;&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#12369;&#12428;&#12393;&#12418;&#12289;&#37327;&#12364;&#12414;&#12384;&#21313;&#20998;&#12391;&#12394;&#12356;&#12290;" &#12392;&#12363;&#12289;
    "&#38283;&#30330;&#12481;&#12540;&#12512;&#12399;&#21531;&#12398;&#12497;&#12483;&#12481;&#12434;&#20840;&#12390;&#39640;&#12367;&#35413;&#20385;&#12375;&#12390;&#12356;&#12427;&#12369;&#12393;&#12289;&#36969;&#29992;&#12377;&#12427;&#21069;&#12395;&#12363;&#12394;&#12426;&#35519;&#25972;&#12364;&#24517;&#35201;&#12394;&#12435;&#12384;&#12290;
    &#12384;&#12363;&#12425;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#12398;&#12364;&#22909;&#12414;&#12375;&#12356;&#12392;&#24605;&#12360;&#12394;&#12356;&#12290;
    &#12371;&#12398;&#12371;&#12392;&#12399;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#25913;&#21892;&#12375;&#12390;&#27442;&#12375;&#12356;&#12392;&#39000;&#12387;&#12390;&#12356;&#12427;&#12290;" &#12392;&#12356;&#12358;&#24863;&#12376;&#12391;&#12377;&#12290;
    &#12383;&#12384;&#12289;&#12381;&#12398;&#20154;&#12392;&#12398;&#20449;&#38972;&#38306;&#20418;&#12398;&#24230;&#21512;&#12395;&#12424;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12354;&#12394;&#12383;&#12398;&#30330;&#35328;&#12364;&#30456;&#25163;&#12395;&#12471;&#12519;&#12483;&#12463;&#12434;&#19982;&#12360;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12290;
    &#12513;&#12540;&#12523;&#12434;&#26360;&#12367;&#12392;&#12365;&#12399;&#12289;&#30456;&#25163;&#12398;&#35222;&#28857;&#12363;&#12425;&#12513;&#12540;&#12523;&#12434;&#30522;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#26032;&#12375;&#12356;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#21152;&#12360;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#20182;&#12398;&#12411;&#12392;&#12435;&#12393;&#12398;&#19968;&#24230;&#38480;&#12426;&#12398;&#27770;&#23450;&#12424;&#12426;&#12418;&#12424;&#12426;&#37325;&#22823;&#12394;&#12398;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#25237;&#31080;&#12395;&#29305;&#21029;&#12394;&#35201;&#20214;&#12434;&#35506;&#12377;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12381;&#12398;&#25552;&#26696;&#12395;&#12399; &#23569;&#12394;&#12367;&#12392;&#12418; <span class="emphasis"><em>n</em></span> &#31080;&#12398;&#36059;&#25104;&#31080;&#12364;&#24517;&#38920;&#12391;&#12289;
    &#21453;&#23550;&#31080;&#12364;&#12354;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12363;&#12289;&#22311;&#20498;&#30340;&#22810;&#25968;&#12398;&#36059;&#25104;&#31080;&#12364;&#24517;&#38920;&#12289;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#27491;&#30906;&#12394;&#36059;&#25104;&#31080;&#12398;&#25968;&#12399;&#37325;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20013;&#24515;&#12392;&#12394;&#12427;&#32771;&#12360;&#26041;&#12399;&#12289;&#38283;&#30330;&#12481;&#12540;&#12512;&#12364;&#26032;&#12375;&#12356;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#21152;&#12360;&#12427;&#12398;&#12395;&#24910;&#37325;&#12391;&#12354;&#12427;&#12409;&#12365;&#12289;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434; <span class="emphasis"><em>&#22890;&#12358;</em></span> &#22580;&#21512;&#12395;&#12418;&#12289;&#25237;&#31080;&#12395;&#12399;&#20284;&#12383;&#12424;&#12358;&#12394;&#12289;
    &#12354;&#12427;&#12356;&#12399;&#12418;&#12387;&#12392;&#21427;&#26684;&#12394;&#35201;&#20214;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
    &#12414;&#12353;&#12375;&#12363;&#12375;&#12289;&#12371;&#12435;&#12394;&#12523;&#12540;&#12523;&#12434;&#24517;&#35201;&#12392;&#12375;&#12394;&#12356;&#12398;&#12364;&#26395;&#12414;&#12375;&#12356;&#12398;&#12391;&#12377;&#12364;&#12290;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12383;&#12426;&#12289;&#22890;&#12387;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12398;&#12289;&#25237;&#31080;&#20197;&#22806;&#12398;&#20596;&#38754;&#12395;&#38306;&#12377;&#12427;&#35443;&#12375;&#12356;&#24773;&#22577;&#12399;&#12289;
    <span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a></span> &#12398; <a class="xref" href="committers.html" title="&#12467;&#12511;&#12483;&#12479;&#12540;">&#12300;&#12467;&#12511;&#12483;&#12479;&#12540;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="&#19990;&#35542;&#35519;&#26619; v.s &#25237;&#31080;"><div class="titlepage"><div><div><h3 class="title"><a name="polls"></a>&#19990;&#35542;&#35519;&#26619; v.s &#25237;&#31080;</h3></div></div></div><p>
    &#12354;&#12427;&#31278;&#12398;&#25237;&#31080;&#12391;&#12399;&#12289;&#26377;&#27177;&#32773;&#12434;&#24195;&#12370;&#12383;&#26041;&#12364;&#12356;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;
    &#19982;&#12360;&#12425;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12364;&#12518;&#12540;&#12470;&#12540;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20351;&#12356;&#26041;&#12392;&#21512;&#12358;&#12363;&#12393;&#12358;&#12363;&#12434;&#12289;
    &#38283;&#30330;&#32773;&#12364;&#27770;&#12417;&#12425;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#36092;&#35501;&#12375;&#12390;&#12356;&#12427;&#20154;&#20840;&#21729;&#12395;&#23563;&#12397;&#12390;&#12415;&#12427;&#12398;&#12364;&#12402;&#12392;&#12388;&#12398;&#35299;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#25237;&#31080;&#12392;&#12356;&#12358;&#12424;&#12426;&#12416;&#12375;&#12429; <em class="firstterm">&#19990;&#35542;&#35519;&#26619;</em> &#12391;&#12377;&#12364;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#12381;&#12398;&#32080;&#26524;&#12434;&#25304;&#26463;&#21147;&#12398;&#12354;&#12427;&#12418;&#12398;&#12392;&#12375;&#12390;&#25201;&#12387;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12393;&#12358;&#12356;&#12387;&#12383;&#35519;&#26619;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
    &#19982;&#12360;&#12425;&#12428;&#12390;&#12356;&#12427;&#36984;&#25246;&#32930;&#20197;&#22806;&#12398;&#22238;&#31572;&#12434;&#35352;&#20837;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#24517;&#12378;&#21442;&#21152;&#32773;&#12395;&#26126;&#31034;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#35519;&#26619;&#12398;&#36074;&#21839;&#12392;&#12375;&#12390;&#19982;&#12360;&#12425;&#12428;&#12383;&#36984;&#25246;&#32930;&#12424;&#12426;&#12418;&#20778;&#12428;&#12383;&#22238;&#31572;&#12434;&#32771;&#12360;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12427;&#22580;&#21512;&#12289;
    &#35519;&#26619;&#12398;&#32080;&#26524;&#12289;&#12381;&#12398;&#22238;&#31572;&#12364;&#12418;&#12387;&#12392;&#12418;&#37325;&#35201;&#12384;&#12392;&#12431;&#12363;&#12427;&#22580;&#21512;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#25298;&#21542;&#27177;"><div class="titlepage"><div><div><h3 class="title"><a name="veto"></a>&#25298;&#21542;&#27177;</h3></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
    <em class="firstterm">&#25298;&#21542;&#27177;</em> &#12392;&#12375;&#12390;&#30693;&#12425;&#12428;&#12427;&#29305;&#21029;&#12394;&#25237;&#31080;&#27177;&#12434;&#35377;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#25298;&#21542;&#27177;&#12399;&#24615;&#24613;&#12395;&#12289;&#12414;&#12383;&#12399;&#24605;&#12356;&#12388;&#12365;&#12391;&#34892;&#12431;&#12428;&#12383;&#22793;&#26356;&#12391;&#12289;
    &#23569;&#12394;&#12367;&#12392;&#12418;&#30342;&#12391;&#12418;&#12387;&#12392;&#35696;&#35542;&#12377;&#12427;&#26178;&#38291;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#12289;
    &#38283;&#30330;&#32773;&#12364;&#12381;&#12428;&#12434;&#12420;&#12417;&#12373;&#12379;&#12427;&#25163;&#27573;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#25298;&#21542;&#27177;&#12399;&#12289;&#12392;&#12390;&#12418;&#24375;&#12356;&#21453;&#23550;&#12392;&#12289;
    &#35696;&#20107;&#12398;&#36914;&#34892;&#12434;&#22952;&#23475;&#12377;&#12427;&#12371;&#12392;&#12398;&#20013;&#38291;&#12395;&#20301;&#32622;&#12377;&#12427;&#12392;&#32771;&#12360;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#27491;&#30906;&#12394;&#24847;&#21619;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#25298;&#21542;&#27177;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12398;&#12364;&#12392;&#12390;&#12418;&#38627;&#12375;&#12356;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#12362;&#12381;&#12425;&#12367;&#12399;&#12289;
    &#12418;&#12387;&#12392;&#35696;&#35542;&#12434;&#12377;&#12427;&#12383;&#12417;&#12395;&#24375;&#21046;&#30340;&#12395;&#26178;&#38291;&#12434;&#32622;&#12356;&#12383;&#12354;&#12392;&#12391;&#12289;
    &#36890;&#24120;&#12398;&#25237;&#31080;&#27177;&#12391;&#22810;&#25968;&#12398;&#24471;&#31080;&#12434;&#24471;&#12428;&#12400;&#12289;
    &#25298;&#21542;&#27177;&#12434;&#28961;&#21177;&#12395;&#12391;&#12365;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12393;&#12435;&#12394;&#25298;&#21542;&#27177;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#35500;&#26126;&#12364;&#19968;&#36890;&#12426;&#34892;&#12431;&#12428;&#12390;&#12363;&#12425;&#34892;&#20351;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#35500;&#26126;&#12418;&#12373;&#12428;&#12394;&#12356;&#12398;&#12395;&#34892;&#20351;&#12373;&#12428;&#12383;&#25298;&#21542;&#27177;&#12399;&#28961;&#21177;&#12394;&#12418;&#12398;&#12392;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#25298;&#21542;&#27177;&#12434;&#35377;&#12377;&#12392;&#12289;&#12381;&#12428;&#12364;&#28651;&#29992;&#12373;&#12428;&#12427;&#12392;&#12356;&#12358;&#21839;&#38988;&#12364;&#36215;&#12365;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12383;&#12385;&#12399;&#12289;&#12418;&#12387;&#12392;&#35696;&#35542;&#12364;&#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12522;&#12473;&#12463;&#12434;&#22679;&#12420;&#12375;&#12383;&#12367;&#12394;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12399;&#12289;&#33258;&#20998;&#33258;&#36523;&#12364;&#25298;&#21542;&#27177;&#12434;&#12392;&#12390;&#12418;&#24910;&#37325;&#12395;&#34892;&#20351;&#12375;&#12289;
    &#12381;&#12375;&#12390;&#25298;&#21542;&#27177;&#12434;&#22810;&#12367;&#34892;&#20351;&#12375;&#32154;&#12369;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12427;&#22580;&#21512;&#12395;&#12289;
    &#19969;&#23527;&#12395;&#12381;&#12428;&#12434;&#25351;&#25688;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#25298;&#21542;&#27177;&#12398;&#28651;&#29992;&#12434;&#38450;&#12368;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#24517;&#35201;&#12392;&#12354;&#12425;&#12400;&#12289;&#38283;&#30330;&#32773;&#12383;&#12385;&#12364;&#25298;&#21542;&#27177;&#12395;&#25304;&#26463;&#21147;&#12364;&#12354;&#12427;&#12392;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#36059;&#21516;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12384;&#12369;&#12289;
    &#25298;&#21542;&#27177;&#12395;&#25304;&#26463;&#21147;&#12434;&#25345;&#12383;&#12379;&#12427;&#12424;&#12358;&#27714;&#12417;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377; &#8212;
    &#32080;&#23616;&#12399;&#12289;&#26126;&#12425;&#12363;&#12395;&#22823;&#22810;&#25968;&#12398;&#38283;&#30330;&#32773;&#12364; X &#12434;&#26395;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12381;&#12398; X &#12364;&#23558;&#26469;&#20309;&#12363;&#12395;&#12388;&#12369;&#30330;&#29983;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
    &#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12375;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12364;&#12381;&#12428;&#12434;&#21462;&#12426;&#19979;&#12370;&#12427;&#12363;&#12289;
    &#12464;&#12523;&#12540;&#12503;&#12364;&#25298;&#21542;&#27177;&#12398;&#21147;&#12434;&#24369;&#12367;&#12377;&#12427;&#27770;&#23450;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12377;&#12427;&#12398;&#12395; "-1" &#12392;&#26360;&#12367;&#20154;&#12434;&#35211;&#12363;&#12369;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#20351;&#12356;&#26041;&#12399;&#12289;&#39640;&#24230;&#12395;&#32068;&#32340;&#21270;&#12373;&#12428;&#12383;&#25237;&#31080;&#12392;&#25298;&#21542;&#27177;&#12471;&#12473;&#12486;&#12512;&#12434;&#25345;&#12388; Apache Software Foundation &#12391;&#29983;&#12414;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399; <a class="ulink" href="http://www.apache.org/foundation/voting.html" target="_top">http://www.apache.org/foundation/voting.html</a> &#12395;&#35500;&#26126;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    Apache &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22522;&#28310;&#12399;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12418;&#24195;&#12414;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#30028;&#12398;&#22810;&#12367;&#12398;&#22580;&#25152;&#12391;&#12289;
    &#24444;&#12425;&#12398;&#35215;&#32004;&#12364;&#24418;&#12434;&#22793;&#12360;&#12390;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#25216;&#34899;&#30340;&#12395;&#12399;&#12289;Apache &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22522;&#28310;&#12395;&#29031;&#12425;&#12375;&#12390;&#12418;&#12289;
    "-1" &#12392;&#12356;&#12358;&#34920;&#29694;&#12364;&#27491;&#24335;&#12395;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24517;&#12378;&#12375;&#12418;&#34920;&#12377;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#38750;&#20844;&#24335;&#12395;&#12399;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12375;&#12390;&#12356;&#12427;&#12289;
    &#12418;&#12375;&#12367;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#24375;&#12356;&#21453;&#23550;&#12398;&#24847;&#24535;&#12434;&#31034;&#12375;&#12390;&#12356;&#12427;&#12392;&#26222;&#36890;&#12399;&#21463;&#12369;&#21462;&#12425;&#12428;&#12414;&#12377;&#12290;
</p><p>
    &#25237;&#31080;&#12392;&#21516;&#12376;&#12367;&#12289;&#25298;&#21542;&#27177;&#12398;&#21177;&#26524;&#12399;&#36961;&#12387;&#12390;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#30097;&#21839;&#12364;&#25345;&#12383;&#12428;&#12390;&#12356;&#12427;&#22793;&#26356;&#12364;&#26082;&#12395;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12289;
    &#12418;&#12375;&#12367;&#12399;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#26082;&#12395;&#36215;&#12371;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12289;
   &#65288;&#26082;&#12395;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12364;&#20986;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12424;&#12358;&#12395;&#12289;
    &#21462;&#12426;&#36820;&#12375;&#12364;&#20184;&#12363;&#12394;&#12356;&#12418;&#12398;&#12391;&#12394;&#12369;&#12428;&#12400;&#65289; &#25298;&#21542;&#27177;&#12395;&#23550;&#12375;&#12390;&#30064;&#12434;&#21809;&#12360;&#12427;&#12398;&#12399;&#12424;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#35328;&#12356;&#12363;&#12360;&#12428;&#12400;&#12289;&#20309;&#36913;&#38291;&#12289;&#20309;&#12534;&#26376;&#12418;&#12383;&#12387;&#12383;&#12354;&#12392;&#12395;&#25298;&#21542;&#27177;&#12364;&#34892;&#20351;&#12373;&#12428;&#12390;&#12418;&#12289;
    &#12381;&#12428;&#12364;&#30495;&#38754;&#30446;&#12395;&#21462;&#12426;&#19978;&#12370;&#12425;&#12428;&#12427;&#21487;&#33021;&#24615;&#12399;&#23569;&#12394;&#12356;&#12391;&#12377;&#12375;&#12289;
    &#30495;&#38754;&#30446;&#12395;&#21462;&#12426;&#19978;&#12370;&#12427;&#12409;&#12365;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="social-infrastructure.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="social-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="written-rules.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;</td></tr></table></div></body></html>
