<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#22865;&#32004;&#12377;&#12427;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="money-vs-love.html" title="&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;"><link rel="next" href="funding-non-programming.html" title="&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22865;&#32004;&#12377;&#12427;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="money-vs-love.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="funding-non-programming.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#22865;&#32004;&#12377;&#12427;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="contracting"></a>&#22865;&#32004;&#12377;&#12427;</h2></div></div></div><p>
    &#22865;&#32004;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12391;&#12399;&#27880;&#24847;&#28145;&#12367;&#25201;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#22865;&#32004;&#12434;&#32080;&#12435;&#12391;&#20316;&#26989;&#12375;&#12383;&#20154;&#12398;&#25104;&#26524;&#29289;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12289;
    &#20844;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#12398;&#12364;&#26395;&#12414;&#12375;&#12356;&#12391;&#12377;&#12290;&#29702;&#23624;&#12398;&#19978;&#12391;&#12399;&#12289;
    &#25104;&#26524;&#29289;&#12398;&#21697;&#36074;&#12364;&#33391;&#12367;&#12289;&#12381;&#12428;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289;
    &#35504;&#12392;&#22865;&#32004;&#12375;&#12424;&#12358;&#12364;&#21839;&#38988;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#29702;&#23624;&#12392;&#23455;&#38555;&#12399;&#19968;&#33268;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#12381;&#12358;&#12391;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#21697;&#36074;&#12364;&#33391;&#12356;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12394;&#12425;&#12289;&#12381;&#12428;&#12364;&#20840;&#12367;&#30693;&#12425;&#12394;&#12356;&#20154;&#12364;&#26360;&#12356;&#12383;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
    &#19968;&#33324;&#30340;&#12395;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12364; <span class="emphasis"><em>&#12391;&#12365;&#12427;</em></span> &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#22256;&#12427;&#12398;&#12399;&#12289;&#37325;&#35201;&#12394;&#25913;&#33391;&#12420;&#26032;&#27231;&#33021;&#12398;&#36861;&#21152;&#12434;&#34892;&#12358;&#33391;&#36074;&#12398;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20840;&#12367;&#30693;&#12425;&#12394;&#12356;&#20154;&#12395;&#20316;&#12387;&#12390;&#12418;&#12425;&#12358;&#12398;&#12399;&#12392;&#12390;&#12418;&#38627;&#12375;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20316;&#26989;&#12434;&#35531;&#12369;&#36000;&#12358;&#20154;&#12395;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12414;&#12378;&#35696;&#35542;&#12375;&#12390;&#12418;&#12425;&#12431;&#12394;&#12356;&#12392;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#35696;&#35542;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12399;&#27491;&#30906;&#12395;&#20104;&#28204;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#26178;&#32102;&#21336;&#20301;&#12391;&#12362;&#37329;&#12434;&#25173;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
    &#20104;&#24819;&#20197;&#19978;&#12398;&#12362;&#37329;&#12434;&#25903;&#25173;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#36870;&#12395;&#22266;&#23450;&#32102;&#12391;&#12354;&#12428;&#12400;&#12289;&#12381;&#12398;&#20154;&#12399;&#36016;&#12358;&#37329;&#38989;&#12395;&#35211;&#21512;&#12431;&#12394;&#12356;&#37327;&#12398;&#20181;&#20107;&#12434;&#12377;&#12427;&#32701;&#30446;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12371;&#12398;&#21839;&#38988;&#12395;&#23550;&#20966;&#12377;&#12427;&#26041;&#27861;&#12364;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;&#26395;&#12414;&#12375;&#12356;&#12398;&#12399;&#12289;
    &#36942;&#21435;&#12398;&#32076;&#39443;&#12395;&#29031;&#12425;&#12375;&#12390;&#35696;&#35542;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12434;&#25512;&#28204;&#12375;&#12289;&#35492;&#24046;&#12434;&#23569;&#12375;&#36275;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#20516;&#12395;&#22522;&#12389;&#12356;&#12390;&#22865;&#32004;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#21839;&#38988;&#12434;&#29420;&#31435;&#12375;&#12383;&#22810;&#12367;&#12398;&#23567;&#12373;&#12394;&#26029;&#29255;&#12395;&#12391;&#12365;&#12427;&#12384;&#12369;&#20998;&#21106;&#12375;&#12289;
    &#12381;&#12428;&#12382;&#12428;&#12398;&#26029;&#29255;&#12398;&#20104;&#28204;&#21487;&#33021;&#24615;&#12434;&#22679;&#12420;&#12377;&#12398;&#12395;&#12418;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;&#21029;&#12398;&#12420;&#12426;&#26041;&#12392;&#12375;&#12390;&#12289;
    &#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12384;&#12369;&#12434;&#20316;&#12387;&#12390;&#12418;&#12425;&#12358;&#22865;&#32004;&#12434;&#20132;&#12431;&#12375;&#12289;
    &#12381;&#12428;&#12434;&#20844;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21462;&#12426;&#36796;&#12435;&#12391;&#12418;&#12425;&#12358;&#12371;&#12392;&#12434;&#21029;&#12398;&#21839;&#38988;&#12392;&#12375;&#12390;&#25201;&#12358;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12377;&#12427;&#12392;&#22865;&#32004;&#26360;&#12434;&#26360;&#12367;&#12398;&#12399;&#27005;&#12395;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12354;&#12394;&#12383;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20381;&#23384;&#12377;&#12427;&#38291;&#12289;
    &#12414;&#12383;&#12399;&#12381;&#12428;&#12392;&#21516;&#27096;&#12398;&#27231;&#33021;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26412;&#27969;&#12395;&#21462;&#12426;&#36796;&#12435;&#12391;&#12418;&#12425;&#12358;&#12414;&#12391;&#12398;&#38291;&#12289;
    &#22865;&#32004;&#12391;&#20316;&#12425;&#12428;&#12383;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#32173;&#25345;&#12377;&#12427;&#12398;&#12395;&#22235;&#33510;&#20843;&#33510;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#21069;&#32773;&#12398;&#26395;&#12414;&#12375;&#12356;&#26041;&#27861;&#12434;&#12392;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#12371;&#12392;&#12434;&#22865;&#32004;&#12398;&#26465;&#20214;&#12395;&#12399;&#20986;&#26469;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12371;&#12428;&#12399;&#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#12399;&#22770;&#12387;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12434;&#22770;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    (&#12418;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23550;&#35937;&#12392;&#12394;&#12427;&#27231;&#33021;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#12392;&#27770;&#12417;&#12383;&#12425;&#12393;&#12358;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#65311;)
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#22793;&#26356;&#12434;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#21463;&#12369;&#20837;&#12428;&#12390;&#12418;&#12425;&#12356;&#12289;
    &#24444;&#12425;&#12364;&#25215;&#30693;&#12377;&#12428;&#12400;&#12381;&#12428;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12424;&#12358;&#12289;
    <span class="foreignphrase"><em class="foreignphrase">&#35488;&#24847;&#12434;&#12418;&#12387;&#12390;</em></span> &#21162;&#21147;&#12377;&#12427;&#12371;&#12392;&#12434;&#22865;&#32004;&#12398;&#26465;&#20214;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12467;&#12540;&#12489;&#22793;&#26356;&#12395;&#38306;&#12377;&#12427;&#22522;&#28310;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#22865;&#32004;&#12391;&#12381;&#12358;&#12375;&#12383;&#22522;&#28310;&#12434;&#21442;&#29031;&#12375;&#12383;&#19978;&#12391;&#12289;&#25104;&#26524;&#29289;&#12399;&#12381;&#12428;&#12434;&#28288;&#12383;&#12377;&#12424;&#12358;&#12395;&#21462;&#12426;&#27770;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#23455;&#38555;&#12289;&#12371;&#12398;&#12420;&#12426;&#26041;&#12391;&#22865;&#32004;&#12398;&#24403;&#20107;&#32773;&#20840;&#21729;&#12364;&#26395;&#12416;&#32080;&#26524;&#12364;&#26222;&#36890;&#12399;&#20986;&#12390;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#22865;&#32004;&#12434;&#25104;&#21151;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#26368;&#12418;&#33391;&#12356;&#25126;&#30053;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12434;&#38599;&#12358;&#12371;&#12392;&#12391;&#12377;
    &#8212; &#22865;&#32004;&#12398;&#30456;&#25163;&#12392;&#12375;&#12390;&#12399;&#12467;&#12511;&#12483;&#12479;&#12540;&#12364;&#26395;&#12414;&#12375;&#12356;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#24433;&#38911;&#21147;&#12434;&#36023;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#35211;&#12360;&#12414;&#12377;&#12375;&#12289;&#23455;&#38555;&#12381;&#12358;&#12391;&#12377;&#12364;&#12289;
    &#35211;&#12383;&#30446;&#12411;&#12393;&#30772;&#32187;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12399;&#12289;&#20027;&#12395;&#12467;&#12540;&#12489;&#12398;&#36074;&#12364;&#39640;&#12356;&#12371;&#12392;&#12392;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12392;&#20132;&#27969;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12371;&#12381;&#12289;&#24433;&#38911;&#21147;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#25104;&#12375;&#36930;&#12370;&#12427;&#22865;&#32004;&#12434;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
    &#24444;&#12398;&#12381;&#12358;&#12375;&#12383;&#22320;&#20301;&#12434;&#39640;&#12417;&#12427;&#12371;&#12392;&#12395;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;&#20663;&#12388;&#12369;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12384;&#12289;&#22865;&#32004;&#12434;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#21608;&#22258;&#12398;&#20154;&#12364;&#24444;&#12398;&#12371;&#12392;&#12434;&#12354;&#12428;&#12371;&#12428;&#35438;&#32034;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#38283;&#30330;&#32773;&#12399;&#12289;&#19981;&#36969;&#20999;&#12289;&#12414;&#12383;&#12399;&#22810;&#12367;&#12398;&#20154;&#12364;&#23244;&#12387;&#12390;&#12356;&#12427;&#26032;&#27231;&#33021;&#12398;&#23566;&#20837;&#12434;&#25903;&#25588;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#38263;&#12356;&#26178;&#38291;&#12363;&#12369;&#12390;&#31689;&#12356;&#12390;&#12365;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#22320;&#20301;&#12434;&#21361;&#38522;&#12395;&#26194;&#12375;&#12383;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12358;&#12356;&#12358;&#30446;&#30340;&#12391;&#23455;&#38555;&#12395;&#38283;&#30330;&#32773;&#12434;&#38599;&#12358;&#12392;&#12365;&#12399;&#12289;
    &#12393;&#12358;&#12356;&#12358;&#22793;&#26356;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12420;&#12377;&#12356;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;&#12354;&#12394;&#12383;&#12399;&#12450;&#12489;&#12496;&#12452;&#12473;&#12434;&#36016;&#12358;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#20778;&#20808;&#38918;&#20301;&#12434;&#12431;&#12378;&#12363;&#12394;&#12364;&#12425;&#22793;&#26356;&#12373;&#12379;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#20778;&#20808;&#38918;&#20301;&#20184;&#12369;&#12399;&#12289;&#38283;&#30330;&#32773;&#12364;&#20309;&#12395;&#26178;&#38291;&#12434;&#25499;&#12369;&#12427;&#12363;&#12398;&#21839;&#38988;&#12395;&#12377;&#12366;&#12394;&#12356;&#12398;&#12391;&#12289;
    &#38283;&#30330;&#32773;&#12398;&#26178;&#38291;&#12434;&#22865;&#32004;&#12391;&#36023;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#24444;&#12398;&#20181;&#20107;&#12398;&#20778;&#20808;&#24230;&#12364;&#23569;&#12375;&#22793;&#12431;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#32076;&#39443;&#12434;&#31309;&#12435;&#12384;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#36991;&#12369;&#38627;&#12356;&#29694;&#23455;&#12391;&#12377;&#12375;&#12289;
    &#38599;&#12356;&#20027;&#12364;&#35506;&#12377;&#20181;&#20107;&#12434;&#21336;&#12395;&#12381;&#12428;&#12364; <span class="emphasis"><em>&#20808;&#12395;&#29255;&#20184;&#12369;&#12425;&#12428;&#12381;&#12358;</em></span> &#12384;&#12392;&#12356;&#12358;&#29702;&#30001;&#12384;&#12369;&#12391;&#12289;
    &#12381;&#12428;&#12384;&#12369;&#12395;&#27880;&#24847;&#12434;&#21521;&#12369;&#12427;&#38283;&#30330;&#32773;&#12418;&#23569;&#12394;&#12363;&#12425;&#12378;&#12356;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#12381;&#12398;&#20181;&#20107;&#12434;&#26089;&#12367;&#29255;&#20184;&#12369;&#12427;&#24460;&#25276;&#12375;&#12434;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#20840;&#12367;&#12467;&#12540;&#12489;&#12434;&#26360;&#12363;&#12378;&#12289;&#35373;&#35336;&#12395;&#12388;&#12356;&#12390;&#35696;&#35542;&#12375;&#12383;&#12426;&#12289;
    &#12467;&#12540;&#12489;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12383;&#12426;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12428;&#12425;&#12399;&#12392;&#12390;&#12418;&#24441;&#12395;&#31435;&#12388;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12414;&#12391;&#36848;&#12409;&#12390;&#12365;&#12383;&#12377;&#12409;&#12390;&#12398;&#29702;&#30001;&#12363;&#12425;&#12289;&#22865;&#32004;&#30456;&#25163;&#12395;&#12394;&#12427;&#38283;&#30330;&#32773;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#26082;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12434;&#12521;&#12531;&#12463;&#20184;&#12369;&#12375;&#12390;&#36984;&#12406;&#12398;&#12364;&#19968;&#30058;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12434;&#38599;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#30097;&#21839;&#12364;&#20108;&#12388;&#20986;&#12390;&#12365;&#12414;&#12377;&#12290;
    &#22865;&#32004;&#12434;&#20844;&#12395;&#12375;&#12394;&#12356;&#26041;&#12364;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12414;&#12383;&#12289;&#20206;&#12395;&#20844;&#12395;&#12377;&#12427;&#12392;&#12375;&#12390;&#12289;
    &#29305;&#23450;&#12398;&#38283;&#30330;&#32773;&#20197;&#22806;&#12398;&#20154;&#12392;&#22865;&#32004;&#12375;&#12394;&#12356;&#12371;&#12392;&#12391;&#12289;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#32202;&#24373;&#38306;&#20418;&#12434;&#20316;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12434;&#27671;&#12395;&#12363;&#12369;&#12427;&#12409;&#12365;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;
</p><p>
    &#21487;&#33021;&#12391;&#12354;&#12428;&#12400;&#12289;&#22865;&#32004;&#12377;&#12427;&#12371;&#12392;&#12434;&#20844;&#12395;&#12377;&#12427;&#12398;&#12364;&#12505;&#12473;&#12488;&#12391;&#12377;&#12290;&#20206;&#12395;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12289;
    &#22865;&#32004;&#12375;&#12383;&#38283;&#30330;&#32773;&#12398;&#25391;&#12427;&#33310;&#12356;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#12513;&#12531;&#12496;&#12540;&#12363;&#12425;&#12399;&#19981;&#33258;&#28982;&#12395;&#35211;&#12360;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#8212;
    &#12362;&#12381;&#12425;&#12367;&#12289;&#24444;&#12399;&#12393;&#12358;&#12356;&#12358;&#12431;&#12369;&#12363;&#20170;&#12414;&#12391;&#20840;&#12367;&#33288;&#21619;&#12434;&#31034;&#12373;&#12394;&#12363;&#12387;&#12383;&#27231;&#33021;&#12395;&#12289;
    &#31361;&#28982;&#39640;&#12356;&#20778;&#20808;&#24230;&#12434;&#35373;&#23450;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12364;&#12381;&#12398;&#27231;&#33021;&#12434;&#27442;&#12375;&#12364;&#12427;&#29702;&#30001;&#12434;&#23563;&#12397;&#12425;&#12428;&#12383;&#12392;&#12365;&#12289;
    &#22865;&#32004;&#12434;&#12375;&#12390;&#12356;&#12427;&#20107;&#23455;&#12434;&#35441;&#12379;&#12394;&#12356;&#12398;&#12384;&#12392;&#12375;&#12383;&#12425;&#12289;
    &#12393;&#12358;&#12420;&#12387;&#12390;&#12381;&#12398;&#29702;&#30001;&#12434;&#12418;&#12387;&#12392;&#12418;&#12425;&#12375;&#12367;&#35500;&#26126;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;
</p><p>
    &#12414;&#12383;&#12289;&#12354;&#12394;&#12383;&#12364;&#38306;&#12431;&#12387;&#12390;&#12356;&#12427;&#20316;&#26989;&#12364;&#12373;&#12418;&#37325;&#35201;&#12394;&#12371;&#12392;&#12398;&#12424;&#12358;&#12395;&#25391;&#12427;&#33310;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#38283;&#30330;&#32773;&#12434;&#38599;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#29702;&#30001;&#12391;&#12289;
    &#33258;&#20998;&#12398;&#25237;&#31295;&#12434;&#37325;&#12367;&#25201;&#12358;&#12409;&#12365;&#12392;&#12356;&#12358;&#21402;&#12363;&#12414;&#12375;&#12356;&#24907;&#24230;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12392;&#12427;&#20154;&#12364;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#24907;&#24230;&#12399;&#12289;&#38283;&#30330;&#32773;&#12434;&#38599;&#12358;&#20154;&#12364; &#8212; <span class="emphasis"><em> &#22865;&#32004;&#12377;&#12427;&#12371;&#12392;&#12391;&#29983;&#12415;&#20986;&#12373;&#12428;&#12427;</em></span>
    &#12467;&#12540;&#12489;&#12391;&#12399;&#12394;&#12367;&#12289;&#22865;&#32004;&#12375;&#12390;&#12356;&#12427;&#20107;&#23455;&#12434;&#37325;&#35222;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12363;&#12425;&#12377;&#12428;&#12400;&#12289;&#12467;&#12540;&#12489;&#12384;&#12369;&#12364;&#37325;&#35201;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#12393;&#12435;&#12394;&#12392;&#12365;&#12391;&#12418;&#12289;&#35504;&#12364;&#35504;&#12395;&#12362;&#37329;&#12434;&#25173;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12395;&#27880;&#24847;&#12434;&#25173;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#22865;&#32004;&#12395;&#12414;&#12388;&#12431;&#12427;&#21839;&#38988;&#12434;&#12358;&#12414;&#12367;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#20966;&#29702;&#12375;&#12390;&#12356;&#12427;&#12289;
    Subversion &#12398;&#38283;&#30330;&#32773;&#12434;&#20363;&#12395;&#25369;&#12370;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12364;&#33258;&#20998;&#12398;&#12467;&#12540;&#12489;&#22793;&#26356;&#12395;&#12388;&#12356;&#12390;IRC&#12391;&#35696;&#35542;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12289;
    &#24444;&#12399;&#23567;&#22768;&#12391; (IRC &#12398; <em class="firstterm">privmsg</em> &#12392;&#12356;&#12358;&#12503;&#12521;&#12452;&#12505;&#12540;&#12488;&#12394;&#20250;&#35441;&#12434;&#20351;&#12387;&#12390;)
    &#20170;&#26360;&#12356;&#12390;&#12356;&#12427;&#27231;&#33021;&#12420;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#26360;&#12367;&#12398;&#12395;&#12289;
    &#12362;&#37329;&#12434;&#12418;&#12425;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#20182;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#20253;&#12360;&#12414;&#12377;&#12290;
    &#24444;&#12399;&#12381;&#12398;&#22793;&#26356;&#12434;&#12378;&#12387;&#12392;&#26395;&#12435;&#12391;&#12356;&#12383;&#12375;&#12289;
    &#12381;&#12398;&#20316;&#26989;&#12434;&#12375;&#12390;&#12362;&#37329;&#12434;&#36016;&#12360;&#12427;&#12398;&#12364;&#24184;&#12379;&#12391;&#12354;&#12427;&#12363;&#12398;&#12424;&#12358;&#12395;&#19968;&#36011;&#12375;&#12390;&#25391;&#12427;&#33310;&#12356;&#12414;&#12377;&#12290;
    &#24444;&#12399;&#22865;&#32004;&#30456;&#25163;&#12398;&#36523;&#20803;&#12434;&#26126;&#12363;&#12377;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12375;&#12289;&#26126;&#12363;&#12373;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#22865;&#32004;&#12398;&#35443;&#32048;&#12395;&#31435;&#12385;&#20837;&#12387;&#12383;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#22865;&#32004;&#12398;&#35441;&#12399;&#12289;&#12393;&#12358;&#12420;&#12387;&#12390;&#20316;&#26989;&#12434;&#25104;&#12375;&#36930;&#12370;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#12398;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12434;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;
    &#35036;&#36275;&#30340;&#12395;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#20363;&#12399;&#12289;&#22865;&#32004;&#12434;&#20844;&#12395;&#12375;&#12383;&#26041;&#12364;&#12356;&#12356;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#29702;&#30001;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#22865;&#32004;&#12395;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#32068;&#32340;&#12364;&#35079;&#25968;&#12354;&#12387;&#12383;&#22580;&#21512;&#12289;
    &#19968;&#26041;&#12364;&#20309;&#12434;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12364;&#12431;&#12363;&#12428;&#12400;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#20849;&#21516;&#12391;&#20986;&#36039;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#19978;&#12398;&#22580;&#21512;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#26368;&#22823;&#12398;&#20986;&#36039;&#32773; (CollabNet) &#12399;&#12371;&#12358;&#12375;&#12383;&#20986;&#26469;&#39640;&#25173;&#12356;&#12398;&#22865;&#32004;&#12395;&#38306;&#12431;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#35504;&#12363;&#20182;&#12398;&#32068;&#32340;&#12364;&#12354;&#12427;&#12496;&#12464;&#20462;&#27491;&#12395;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
    CollabNet &#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#20182;&#12398;&#12496;&#12464;&#12395;&#25391;&#12426;&#21521;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12398;&#21177;&#29575;&#12364;&#19978;&#12364;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#22865;&#32004;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12427;&#12371;&#12392;&#12434;&#23244;&#12364;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
    &#19968;&#33324;&#30340;&#12395;&#12399; NO &#12391;&#12377;&#12290;&#29305;&#12395;&#12289;&#12362;&#37329;&#12434;&#12418;&#12425;&#12387;&#12390;&#12356;&#12427;&#20154;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20869;&#12391;&#22320;&#20301;&#12434;&#30906;&#31435;&#12375;&#12289;
    &#23562;&#25964;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12531;&#12496;&#12540;&#12391;&#12354;&#12427;&#12392;&#12365;&#12399;&#29305;&#12395;&#12381;&#12358;&#12391;&#12377;&#12290;
    &#22865;&#32004;&#12364;&#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#24179;&#31561;&#12395;&#34892;&#12365;&#28193;&#12427;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#20154;&#12394;&#12435;&#12390;&#35504;&#12418;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;&#12473;&#12509;&#12531;&#12469;&#12540;&#12392;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#38306;&#20418;&#12434;&#31689;&#12367;&#12371;&#12392;&#12364;&#37325;&#35201;&#12384;&#12392;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#19981;&#23433;&#12394;&#12398;&#12399;&#12289;&#19968;&#24230;&#12354;&#12394;&#12383;&#12364;&#20449;&#38972;&#12391;&#12365;&#12427;&#20154;&#12434;&#35211;&#12388;&#12369;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#12289;
    &#20844;&#24179;&#12373;&#12434;&#20445;&#12388;&#12383;&#12417;&#12395;&#20182;&#12398;&#20154;&#12395;&#20181;&#20107;&#12434;&#25391;&#12426;&#12383;&#12364;&#12425;&#12394;&#12356;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;:
    &#12399;&#12376;&#12417;&#12395;&#35504;&#12363;&#12434;&#38599;&#12358;&#12392;&#12365;&#12289;&#24517;&#12378; <span class="emphasis"><em>&#35504;&#12363;&#12434;</em></span> &#36984;&#12400;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12384;&#12363;&#12425;&#12289;
    &#21453;&#23550;&#12399;&#12391;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358; &#8212; &#20206;&#12395;&#35504;&#12418;&#38599;&#12431;&#12394;&#12367;&#12390;&#12418;&#12354;&#12394;&#12383;&#12398;&#33853;&#12385;&#24230;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#24460;&#12395;&#12289;2&#24230;&#30446;&#12395;&#12394;&#12387;&#12390;&#21516;&#12376;&#20154;&#12434;&#38599;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12381;&#12428;&#12399;&#24120;&#35672;&#12363;&#12425;&#22806;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12354;&#12394;&#12383;&#12399;&#24444;&#12434;&#30693;&#12387;&#12390;&#12356;&#12390;&#12289;&#30452;&#36817;&#12398;&#20181;&#20107;&#12399;&#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12393;&#12358;&#12375;&#12390;&#12522;&#12473;&#12463;&#12434;&#12392;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12371;&#12358;&#12375;&#12383;&#29702;&#30001;&#12363;&#12425;&#12289;
    &#20181;&#20107;&#12434;&#30342;&#12395;&#24179;&#31561;&#12395;&#25391;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12390;&#12289;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20869;&#12395;&#31361;&#20986;&#12375;&#12383;&#20154;&#12364;&#12402;&#12392;&#12426;&#12420;&#12405;&#12383;&#12426;&#20986;&#12390;&#12365;&#12383;&#12387;&#12390;&#12362;&#12363;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><div class="sect2" title="&#12524;&#12499;&#12517;&#12540;&#12434;&#34892;&#12356;&#12289;&#22793;&#26356;&#12434;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#21462;&#12426;&#20837;&#12428;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="community-review-acceptance"></a>&#12524;&#12499;&#12517;&#12540;&#12434;&#34892;&#12356;&#12289;&#22793;&#26356;&#12434;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#21462;&#12426;&#20837;&#12428;&#12427;</h3></div></div></div><p>
    &#22865;&#32004;&#12375;&#12390;&#20181;&#20107;&#12434;&#12358;&#12414;&#12367;&#36930;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#26524;&#12383;&#12377;&#24441;&#21106;&#12399;&#20381;&#28982;&#12392;&#12375;&#12390;&#37325;&#35201;&#12391;&#12377;&#12290;
    &#22793;&#26356;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12356;&#27231;&#33021;&#35373;&#35336;&#12420;&#12524;&#12499;&#12517;&#12540;&#12398;&#36942;&#31243;&#12395;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#24460;&#20184;&#12369;&#12391;&#38306;&#12431;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#21442;&#21152;&#12377;&#12427;&#12398;&#12399;&#20181;&#20107;&#12398;&#19968;&#37096;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#12371;&#12392;&#12399;&#20181;&#20107;&#12434;&#21463;&#12369;&#12427;&#20154;&#12418;&#24517;&#12378;&#21463;&#12369;&#20837;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#38306;&#12431;&#12427;&#12371;&#12392;&#12364;&#20181;&#20107;&#12398;&#37034;&#39764;&#12395;&#12394;&#12427;&#12392;&#32771;&#12360;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356; &#8212;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12434;&#20181;&#20107;&#12392;&#12399;&#29420;&#31435;&#12375;&#12383;&#35373;&#35336;&#12420;&#21697;&#36074;&#20445;&#35388;&#12398;&#37096;&#32626;&#12392;&#12375;&#12390;&#25417;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#38306;&#12431;&#12427;&#12398;&#12434;&#25105;&#24930;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#21033;&#30410;&#12395;&#12394;&#12427;&#12371;&#12392;&#12392;&#12375;&#12390;&#24375;&#12367;&#36861;&#27714;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><div class="sect3" title="&#12465;&#12540;&#12473;&#12473;&#12479;&#12487;&#12451;: CVS &#12497;&#12473;&#12527;&#12540;&#12489;&#35469;&#35388;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#22580;&#21512;"><div class="titlepage"><div><div><h4 class="title"><a name="cvs-pserver"></a>&#12465;&#12540;&#12473;&#12473;&#12479;&#12487;&#12451;: CVS &#12497;&#12473;&#12527;&#12540;&#12489;&#35469;&#35388;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#22580;&#21512;</h4></div></div></div><p>
    1995&#24180;&#12289;&#31169;&#12399; CVS (Concurrent Versions System : <a class="ulink" href="http://www.cvshome.org/" target="_top">http://www.cvshome.org/</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12398;&#12469;&#12509;&#12540;&#12488;&#12392;&#27231;&#33021;&#24375;&#21270;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#20108;&#20154;&#12391;&#12481;&#12540;&#12512;&#12434;&#32068;&#12435;&#12391;&#12356;&#12414;&#12375;&#12383;&#12290;&#12497;&#12540;&#12488;&#12490;&#12540;&#12398;&#12472;&#12512;&#12392;&#31169;&#12399;&#12289;&#12381;&#12398;&#26178;&#28857;&#12391;&#12399;&#38750;&#20844;&#24335;&#12394;&#12364;&#12425; CVS &#12398;&#12513;&#12531;&#12486;&#12490;&#12540;&#12391;&#12375;&#12383;&#12290;&#12375;&#12363;&#12375;&#12289;&#31169;&#12383;&#12385;&#12399;&#26082;&#12395;&#12356;&#12427; CVS &#12398;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#12393;&#12358;&#36899;&#25658;&#12375;&#12390;&#12356;&#12367;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;&#12354;&#12414;&#12426;&#28145;&#12367;&#32771;&#12360;&#12383;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#12383;&#12384;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#20154;&#12383;&#12385;&#12364;&#12497;&#12483;&#12481;&#12434;&#36865;&#12387;&#12390;&#12367;&#12428;&#12400;&#12289;&#33258;&#20998;&#12383;&#12385;&#12399;&#12381;&#12428;&#12434;&#36969;&#29992;&#12377;&#12427;&#12384;&#12369;&#12289;&#12392;&#12356;&#12387;&#12383;&#24863;&#12376;&#12391;&#12375;&#12383;&#12290;
</p><p>
    &#12381;&#12398;&#12392;&#12365;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12434;&#20171;&#12375;&#12390; CVS &#12434;&#25805;&#20316;&#12377;&#12427;&#12395;&#12399;&#12289;<code class="literal">rsh</code> &#12398;&#12424;&#12358;&#12394;&#12522;&#12514;&#12540;&#12488;&#12525;&#12464;&#12452;&#12531;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20351;&#12358;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;CVS &#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12398;&#12395;&#12525;&#12464;&#12452;&#12531;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20351;&#12358;&#12398;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#12522;&#12473;&#12463;&#12364;&#12354;&#12427;&#12398;&#12364;&#26126;&#12425;&#12363;&#12391;&#12375;&#12383;&#12290;&#26032;&#12375;&#12356;&#35469;&#35388;&#27231;&#27083;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;CVS &#12434;&#38626;&#12428;&#12383;&#12458;&#12501;&#12451;&#12473;&#12363;&#12425;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#36234;&#12375;&#12395;&#23433;&#20840;&#12395;&#25805;&#20316;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12354;&#12427;&#25237;&#36039;&#37504;&#34892;&#12364;&#31169;&#12383;&#12385;&#12434;&#38599;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    Jim &#12392;&#31169;&#12399;&#22865;&#32004;&#12434;&#32080;&#12403;&#12289;&#26032;&#12375;&#12356;&#35469;&#35388;&#27231;&#27083;&#12434;&#35373;&#35336;&#12377;&#12427;&#20316;&#26989;&#12395;&#33136;&#12434;&#25454;&#12360;&#12390;&#21462;&#12426;&#32068;&#12415;&#12414;&#12375;&#12383;&#12290;&#31169;&#12383;&#12385;&#12364;&#24605;&#12356;&#12388;&#12356;&#12383;&#12398;&#12399;&#12392;&#12390;&#12418;&#21336;&#32020;&#12394;&#12418;&#12398; (&#12450;&#12513;&#12522;&#12459;&#21512;&#34886;&#22269;&#12399;&#12289;&#24403;&#26178;&#26263;&#21495;&#21270;&#12395;&#38306;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#36664;&#20986;&#35215;&#21046;&#12434;&#12363;&#12369;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#12424;&#12387;&#12390;&#12289;&#26263;&#21495;&#21270;&#12398;&#24375;&#24230;&#12364;&#39640;&#12356;&#35469;&#35388;&#27231;&#27083;&#12434;&#23455;&#35013;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12364;&#12289;&#12371;&#12398;&#12371;&#12392;&#12399;&#39015;&#23458;&#12418;&#29702;&#35299;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;) &#12391;&#12375;&#12383;&#12364;&#12289;&#12371;&#12398;&#25163;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;&#35373;&#35336;&#12375;&#12383;&#12371;&#12392;&#12364;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12289;&#23554;&#38272;&#23478;&#12363;&#12425;&#35211;&#12428;&#12400;&#26126;&#12425;&#12363;&#12394;&#38291;&#36949;&#12356;&#12364;&#27531;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#25163;&#12398;&#38291;&#36949;&#12356;&#12399;&#12289;&#35373;&#35336;&#12434;&#25552;&#26696;&#12377;&#12427;&#25991;&#26360;&#12434;&#26360;&#12356;&#12390;&#12289;&#20182;&#12398;&#38283;&#30330;&#32773;&#12395;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#36016;&#12360;&#12400;&#23481;&#26131;&#12395;&#30330;&#35211;&#12391;&#12365;&#12427;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;&#12375;&#12363;&#12375;&#12289;&#24403;&#26178;&#12398;&#31169;&#12383;&#12385;&#12395;&#12399;&#38283;&#30330;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#12522;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#12358;&#12392;&#12356;&#12358;&#32771;&#12360;&#12364;&#12394;&#12363;&#12387;&#12383;&#12383;&#12417;&#12289;&#12381;&#12358;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#20154;&#12383;&#12385;&#12399;&#31169;&#12383;&#12385;&#12364;&#20309;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12418;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12375;&#12289;&#12381;&#12428;&#12395; &#8212; &#33258;&#20998;&#12383;&#12385;&#12364;&#28961;&#30693;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391; &#8212; &#33258;&#20998;&#12383;&#12385;&#12364;&#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#20182;&#20154;&#12364;&#35211;&#12360;&#12427;&#24418;&#12395;&#12399;&#12375;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#38971;&#32321;&#12395;&#25237;&#31295;&#12375;&#12383;&#12426;&#12289;&#23567;&#12373;&#12394;&#29702;&#35299;&#12375;&#12420;&#12377;&#12356;&#21336;&#20301;&#12391;&#29305;&#21029;&#12394;&#12502;&#12521;&#12531;&#12481;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12426;&#12377;&#12427;&#12394;&#12393;&#12289;&#12391;&#12377;&#12290;&#32080;&#26524;&#12392;&#12375;&#12390;&#12391;&#12365;&#12383;&#35469;&#35388;&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;&#12289;&#12354;&#12414;&#12426;&#20986;&#26469;&#12364;&#12424;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12375;&#12289;&#19968;&#24230;&#20316;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#12289;&#20114;&#25563;&#24615;&#12398;&#21839;&#38988;&#12434;&#32771;&#12360;&#12427;&#12392;&#25913;&#33391;&#12418;&#38627;&#12375;&#12356;&#12418;&#12398;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#21839;&#38988;&#12398;&#26681;&#26412;&#12399;&#12289;&#32076;&#39443;&#19981;&#36275;&#12391;&#12375;&#12383;&#12290;&#31169;&#12383;&#12385;&#12399;&#30693;&#12427;&#12409;&#12365;&#12371;&#12392;&#12434;&#23481;&#26131;&#12395;&#23398;&#12406;&#12371;&#12392;&#12364;&#12391;&#12365;&#12383;&#12399;&#12378;&#12394;&#12398;&#12395;&#12289;&#23398;&#12412;&#12358;&#12392;&#12375;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#23550;&#12377;&#12427;&#24907;&#24230;&#12395;&#12418;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;&#31169;&#12383;&#12385;&#12399;&#12289;&#12524;&#12499;&#12517;&#12540;&#12434;&#12375;&#12390;&#36016;&#12387;&#12383;&#19978;&#12391;&#22793;&#26356;&#12434;&#21462;&#12426;&#20837;&#12428;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12434;&#22793;&#26356;&#12398;&#36074;&#12434;&#19978;&#12370;&#12427;&#12383;&#12417;&#12398;&#12503;&#12525;&#12475;&#12473;&#12392;&#12356;&#12358;&#12424;&#12426;&#12399;&#12289;&#38556;&#23475;&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;&#33258;&#20998;&#12383;&#12385;&#12364;&#12420;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#20840;&#12390;&#21463;&#12369;&#20837;&#12428;&#12390;&#12418;&#12425;&#12360;&#12427;&#12392;(&#24403;&#26178;&#12399;)&#24605;&#12356;&#36796;&#12435;&#12391;&#12356;&#12383;&#12398;&#12391;&#12289;&#20182;&#12398;&#20154;&#12434;&#24059;&#12365;&#36796;&#12418;&#12358;&#12392;&#12377;&#12427;&#21162;&#21147;&#12434;&#12375;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p></div><p>
    &#22865;&#32004;&#12377;&#12427;&#30456;&#25163;&#12434;&#36984;&#12406;&#12392;&#12365;&#12399;&#12289;&#36969;&#20999;&#12394;&#25216;&#34899;&#12473;&#12461;&#12523;&#12392;&#32076;&#39443;&#12434;&#25345;&#12387;&#12383;&#20154;&#12434;&#36984;&#12403;&#12383;&#12356;&#12398;&#12399;&#26126;&#12425;&#12363;&#12391;&#12377;&#12364;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12356;&#12427;&#20182;&#12398;&#38283;&#30330;&#32773;&#12392;&#24314;&#35373;&#30340;&#12394;&#12420;&#12426;&#12392;&#12426;&#12434;&#12375;&#12383;&#23455;&#32318;&#12364;&#12354;&#12427;&#20154;&#12434;&#36984;&#12406;&#12371;&#12392;&#12418;&#37325;&#35201;&#12391;&#12377;&#12290;&#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#23455;&#36074;&#30340;&#12395;&#12402;&#12392;&#12426;&#20998;&#20197;&#19978;&#12398;&#25104;&#26524;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#22533;&#22266;&#12391;&#32173;&#25345;&#12375;&#12420;&#12377;&#12356;&#12420;&#12426;&#26041;&#12391;&#20181;&#20107;&#12434;&#12375;&#12390;&#12367;&#12428;&#12427;&#12289;&#23554;&#38272;&#23478;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12392;&#32331;&#12364;&#12426;&#12434;&#25345;&#12387;&#12383;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12434;&#38599;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="money-vs-love.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="funding-non-programming.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;</td></tr></table></div></body></html>
