<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;"><link rel="prev" href="license-choosing.html" title="&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36984;&#12406;"><link rel="next" href="dual-licensing.html" title="&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="license-choosing.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</th><td width="20%" align="right"> <a accesskey="n" href="dual-licensing.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="copyright-assignment"></a>&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193;</h2></div></div></div><p>
    &#22810;&#12367;&#12398;&#20154;&#12398;&#36002;&#29486;&#12395;&#12424;&#12387;&#12390;&#25104;&#12426;&#31435;&#12387;&#12390;&#12356;&#12427;&#12289;
    &#12501;&#12522;&#12540;&#12394;&#12467;&#12540;&#12489;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#33879;&#20316;&#27177;&#12434;&#12358;&#12414;&#12367;&#25201;&#12358;&#26041;&#27861;&#12399;3&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12417;&#12399;&#12289;(&#31169;&#12399;&#12362;&#21223;&#12417;&#12375;&#12414;&#12379;&#12435;&#12364;) &#33879;&#20316;&#27177;&#12395;&#12414;&#12388;&#12431;&#12427;&#21839;&#38988;&#12434;&#12377;&#12409;&#12390;&#28961;&#35222;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12399;&#12289;<em class="firstterm">contributor license agreement</em>
    (&#36002;&#29486;&#32773;&#12521;&#12452;&#12475;&#12531;&#12473;&#21516;&#24847;&#26360;&#12289;&#20197;&#19979; <em class="firstterm">CLA</em>)
    &#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20685;&#12367;&#20154;&#36948;&#12363;&#12425;&#38598;&#12417;&#12289;
    &#20491;&#20154;&#12364;&#34892;&#12387;&#12383;&#36002;&#29486;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20351;&#12358;&#27177;&#21033;&#12434;&#26126;&#31034;&#30340;&#12395;&#19982;&#12360;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#36890;&#24120;&#12371;&#12428;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;&#35009;&#21028;&#12398;&#31649;&#36676;&#21306;&#22495;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
    CLA &#12399;&#38651;&#23376;&#12513;&#12540;&#12523;&#12391;&#36865;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12418;&#20778;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#19977;&#12388;&#12417;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488; (&#36890;&#24120;&#12399;&#38750;&#21942;&#21033;&#12394;&#27861;&#30340;&#20027;&#20307;)
    &#12364;&#20840;&#12390;&#12398;&#33879;&#20316;&#27177;&#12434;&#20445;&#25345;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#36002;&#29486;&#12377;&#12427;&#20154;&#12363;&#12425;&#33879;&#20316;&#27177;&#12434;&#23455;&#38555;&#12395;&#35698;&#12387;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12364;&#12418;&#12387;&#12392;&#12418;&#27861;&#30340;&#12395;&#12399;&#38553;&#12398;&#12394;&#12356;&#26041;&#27861;&#12391;&#12377;&#12364;&#12289;&#36002;&#29486;&#12377;&#12427;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12418;&#12387;&#12392;&#12418;&#21380;&#20171;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12371;&#12398;&#26041;&#27861;&#12434;&#27714;&#12417;&#12390;&#12367;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12431;&#12378;&#12363;&#12391;&#12377;&#12290;
</p><p>
    &#33879;&#20316;&#27177;&#12434;&#19968;&#12534;&#25152;&#12395;&#38598;&#12417;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12467;&#12540;&#12489;<sup>[<a name="idp3129856" href="#ftn.idp3129856" class="footnote">40</a>]</sup>
    &#12399;&#12501;&#12522;&#12540;&#12398;&#12414;&#12414;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;
    &#33879;&#20316;&#27177;&#12434;&#25345;&#12388;&#20154;&#12395;&#12467;&#12540;&#12489;&#12398;&#12467;&#12500;&#12540;&#12434;&#36942;&#21435;&#12395;&#36961;&#12387;&#12390;&#29420;&#21344;&#30340;&#12394;&#12467;&#12540;&#12489;&#12395;&#12377;&#12427;&#27177;&#21033;&#12434;&#35469;&#12417;&#12390;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12383;&#12392;&#12360;&#27861;&#30340;&#12394;&#20027;&#20307;&#12392;&#12375;&#12390;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#31361;&#28982;&#26041;&#37341;&#12434;&#36578;&#25563;&#12375;&#12289;
    &#12377;&#12409;&#12390;&#12398;&#12467;&#12540;&#12489;&#12434;&#21046;&#38480;&#12364;&#24375;&#12356;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#37197;&#24067;&#12375;&#22987;&#12417;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12392;&#12387;&#12390;&#27770;&#12375;&#12390;&#21839;&#38988;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12399;&#21336;&#12395;&#26368;&#26032;&#12398;&#12501;&#12522;&#12540;&#12394;&#12467;&#12540;&#12489;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12289;
    &#20309;&#20107;&#12418;&#12394;&#12363;&#12387;&#12383;&#12363;&#12398;&#12424;&#12358;&#12395;&#38283;&#30330;&#12399;&#32154;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;&#12381;&#12358;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12371;&#12381;&#12289;
    &#36002;&#29486;&#12377;&#12427;&#20154;&#36948;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399; CLA &#12408;&#12398;&#12469;&#12452;&#12531;&#12420;&#12289;&#33879;&#20316;&#27177;&#12398;&#35698;&#28193;&#12434;&#27714;&#12417;&#12425;&#12428;&#12383;&#12392;&#12365;&#12395;&#21332;&#21147;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#20309;&#12418;&#23550;&#20966;&#12375;&#12394;&#12356;"><div class="titlepage"><div><div><h3 class="title"><a name="copyright-assignment-none"></a>&#20309;&#12418;&#23550;&#20966;&#12375;&#12394;&#12356;</h3></div></div></div><p>
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#36002;&#29486;&#12377;&#12427;&#20154;&#12363;&#12425; CLA &#12434;&#38598;&#12417;&#12383;&#12426;&#12289;
    &#33879;&#20316;&#27177;&#12434;&#35698;&#12387;&#12390;&#12418;&#12425;&#12387;&#12383;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;&#12381;&#12398;&#12363;&#12431;&#12426;&#12289;
    &#36002;&#29486;&#12377;&#12427;&#20154;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21462;&#12426;&#20837;&#12428;&#12390;&#12418;&#12425;&#12356;&#12383;&#12356;&#12392;&#12356;&#12358;&#24847;&#24535;&#12364;&#12289;
    &#36969;&#24230;&#12395;&#26126;&#30906;&#12391;&#12354;&#12427;&#22580;&#21512;&#12395;&#12399;&#12356;&#12388;&#12391;&#12418;&#12467;&#12540;&#12489;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#36890;&#24120;&#12398;&#29366;&#24907;&#12391;&#12399;&#12371;&#12428;&#12391;&#27083;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;&#35504;&#12363;&#12364;&#33258;&#20998;&#12371;&#12381;&#12364;&#21839;&#38988;&#12392;&#12394;&#12427;&#12467;&#12540;&#12489;&#12398;&#30495;&#12398;&#25345;&#12385;&#20027;&#12391;&#12354;&#12426;&#12289;
    &#33258;&#20998;&#12383;&#12385;&#12399;&#12381;&#12398;&#12467;&#12540;&#12489;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#19979;&#12391;&#37197;&#24067;&#12377;&#12427;&#12371;&#12392;&#12434;&#35469;&#12417;&#12394;&#12356;&#12392;&#20027;&#24373;&#12375;&#12390;&#12289;
    &#33879;&#20316;&#27177;&#27861;&#36949;&#21453;&#12391;&#35009;&#21028;&#12434;&#36215;&#12371;&#12377;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;SCO &#12464;&#12523;&#12540;&#12503;&#12399;&#12371;&#12428;&#12392;&#20284;&#12383;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;
    Linux&#12459;&#12540;&#12493;&#12523;&#38283;&#30330;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488; &#12395;&#23550;&#12375;&#12390;&#34892;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#35443;&#12375;&#12367;&#12399;&#12289;<a class="ulink" href="http://en.wikipedia.org/wiki/SCO-Linux_controversies" target="_top">http://en.wikipedia.org/wiki/SCO-Linux_controversies</a>
    &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12371;&#12435;&#12394;&#12371;&#12392;&#12364;&#36215;&#12365;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#36002;&#29486;&#12375;&#12383;&#20154;&#12363;&#12425;&#27491;&#24335;&#12395;&#12467;&#12540;&#12489;&#12434;&#20351;&#12358;&#27177;&#21033;&#12434;&#24471;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#35388;&#26126;&#12377;&#12427;&#25991;&#26360;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12358;&#12394;&#12427;&#12392;&#12289;&#27861;&#30340;&#12394;&#38450;&#24481;&#12364;&#38627;&#12375;&#12367;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect2" title="&#36002;&#29486;&#32773;&#12521;&#12452;&#12475;&#12531;&#12473;&#21516;&#24847;&#26360;(CLA)"><div class="titlepage"><div><div><h3 class="title"><a name="copyright-assignment-cla"></a>&#36002;&#29486;&#32773;&#12521;&#12452;&#12475;&#12531;&#12473;&#21516;&#24847;&#26360;(CLA)</h3></div></div></div><p>
    CLA &#12399;&#12362;&#12381;&#12425;&#12367;&#12289;&#27861;&#30340;&#12394;&#23433;&#20840;&#24615;&#12392;&#21033;&#20415;&#24615;&#12398;&#12488;&#12524;&#12540;&#12489;&#12458;&#12501;&#12434;&#35299;&#27770;&#12377;&#12427;&#26368;&#33391;&#12398;&#12418;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
    CLA &#12399;&#38283;&#30330;&#32773;&#12364;&#20869;&#23481;&#12434;&#35352;&#20837;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36865;&#20184;&#12377;&#12427;&#38651;&#23376;&#30340;&#12394;&#26360;&#24335;&#12364;&#20856;&#22411;&#30340;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#35009;&#21028;&#12398;&#31649;&#36676;&#22320;&#22495;&#12391;&#12399;&#12289;&#38651;&#23376;&#12513;&#12540;&#12523;&#12391;&#36865;&#20184;&#12377;&#12428;&#12400;&#21313;&#20998;&#12391;&#12377;&#12290;
    &#23433;&#20840;&#12394;&#38651;&#23376;&#32626;&#21517;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12393;&#12398;&#26041;&#27861;&#12364;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21512;&#12387;&#12390;&#12356;&#12427;&#12363;&#12434;&#30693;&#12427;&#12395;&#12399;&#12289;&#24321;&#35703;&#22763;&#12395;&#30456;&#35527;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
    &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12405;&#12383;&#12388;&#12398;&#12385;&#12423;&#12387;&#12392;&#30064;&#12394;&#12427; CLA &#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12399;&#20491;&#20154;&#29992;&#12289;&#12381;&#12375;&#12390;&#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#20225;&#26989;&#29992;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12393;&#12385;&#12425;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#20013;&#24515;&#12392;&#12394;&#12427;&#25991;&#35328;&#12399;&#21516;&#12376;&#12391;&#12377;:
    &#36002;&#29486;&#12377;&#12427;&#20154;(&#32068;&#32340;) &#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395; <span class="emphasis"><em>"... 
    &#12354;&#12394;&#12383;&#12398;&#36002;&#29486;&#12434;&#35079;&#35069;&#12375;&#12383;&#12426;&#12289;&#27966;&#29983;&#29289;&#12434;&#28310;&#20633;&#12375;&#12383;&#12426;&#12289;&#20844;&#12395;&#34920;&#31034;&#12375;&#12383;&#12426;&#12289;&#20844;&#12395;&#23455;&#34892;&#12375;&#12383;&#12426;&#12289;
    &#12469;&#12502;&#12521;&#12452;&#12475;&#12531;&#12473;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12300;&#21322;&#27704;&#20037;&#30340;&#12391;&#12289;&#20840;&#19990;&#30028;&#35215;&#27169;&#12391;&#12289;&#38750;&#29420;&#21344;&#30340;&#12391;&#12289;
    &#28961;&#20767;&#12391;&#12289;&#12525;&#12452;&#12516;&#12522;&#12486;&#12451;&#12540;&#12364;&#12394;&#12367;&#12289;&#21462;&#12426;&#28040;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12521;&#12452;&#12475;&#12531;&#12473;&#12301;"</em></span>
    &#12434;&#19982;&#12360;&#12427;&#12290;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#32368;&#12426;&#36820;&#12375;&#12414;&#12377;&#12364;&#12289;&#12393;&#12435;&#12394; CLA &#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#22580;&#21512;&#12391;&#12418;&#24321;&#35703;&#22763;&#12395;&#30456;&#35527;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12354;&#12394;&#12383;&#12364;&#12371;&#12428;&#12425;&#12398;&#25991;&#35328;&#12395;&#24931;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#12362;&#12381;&#12425;&#12367;&#21839;&#38988;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    CLA &#12408;&#12398;&#12469;&#12452;&#12531;&#12434;&#12289;&#36002;&#29486;&#12377;&#12427;&#20154;&#12395;&#38972;&#12416;&#12392;&#12365;&#12399;&#12289;
    &#23455;&#38555;&#12395;&#33879;&#20316;&#27177;&#12434;&#35698;&#28193;&#12377;&#12427;&#12424;&#12358;&#27714;&#12417;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;
    <span class="emphasis"><em>&#12394;&#12356;</em></span> &#12371;&#12392;&#12434;&#24517;&#12378;&#24375;&#35519;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#23455;&#38555;&#12289;&#22810;&#12367;&#12398; CLA &#12399;&#12469;&#12452;&#12531;&#12377;&#12427;&#20154;&#12395;&#12371;&#12398;&#12371;&#12392;&#12434;&#24565;&#25276;&#12375;&#12377;&#12427;&#25991;&#35328;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
<span class="emphasis"><em>
    &#12371;&#12428;&#12399;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#21516;&#24847;&#12377;&#12427;&#12384;&#12369;&#12398;&#25991;&#26360;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#33879;&#20316;&#27177;&#12434;&#35698;&#28193;&#12375;&#12383;&#12426;&#12289;&#12354;&#12394;&#12383;&#12398;&#36002;&#29486;&#12434;&#20182;&#12398;&#30446;&#30340;&#12395;&#20351;&#12358;&#12383;&#12417;&#12395;&#12354;&#12394;&#12383;&#12398;&#27177;&#21033;&#12434;&#22793;&#26356;&#12375;&#12383;&#12426;&#12375;&#12414;&#12379;&#12435;&#12290;
</em></span>
</p></blockquote></div><p>&#20197;&#19979;&#12395;&#12356;&#12367;&#12388;&#12363;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#20491;&#20154;&#21521;&#12369;&#12398; CLA:</p><div class="itemizedlist"><ul class="itemizedlist" type="circle"><li class="listitem"><p><a class="ulink" href="http://apache.org/licenses/icla.txt" target="_top">http://apache.org/licenses/icla.txt</a>
      </p></li><li class="listitem"><p><a class="ulink" href="http://code.google.com/legal/individual-cla-v1.0.html" target="_top">http://code.google.com/legal/individual-cla-v1.0.html</a>
      </p></li></ul></div></li><li class="listitem"><p>&#20225;&#26989;&#21521;&#12369;&#12398; CLA:</p><div class="itemizedlist"><ul class="itemizedlist" type="circle"><li class="listitem"><p><a class="ulink" href="http://apache.org/licenses/cla-corporate.txt" target="_top">http://apache.org/licenses/cla-corporate.txt</a>
      </p></li><li class="listitem"><p><a class="ulink" href="http://code.google.com/legal/corporate-cla-v1.0.html" target="_top">http://code.google.com/legal/corporate-cla-v1.0.html</a>
      </p></li></ul></div></li></ul></div></div><div class="sect2" title="&#33879;&#20316;&#27177;&#12398;&#35698;&#28193;"><div class="titlepage"><div><div><h3 class="title"><a name="copyright-assignment-transfer"></a>&#33879;&#20316;&#27177;&#12398;&#35698;&#28193;</h3></div></div></div><p>
    &#33879;&#20316;&#27177;&#12398;&#35698;&#28193;&#12392;&#12399;&#12289;&#36002;&#29486;&#12377;&#12427;&#20154;&#12364;&#12289;&#33258;&#20998;&#12364;&#34892;&#12387;&#12383;&#36002;&#29486;&#12398;&#33879;&#20316;&#27177;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#35698;&#12426;&#28193;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#26360;&#38754;&#12434;&#37109;&#36865;&#12377;&#12427;&#12363;&#12289;&#12501;&#12449;&#12483;&#12463;&#12473;&#12377;&#12427;&#12371;&#12392;&#12391;&#34892;&#12358;&#12398;&#12364;&#26395;&#12414;&#12375;&#12356;&#12391;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
    &#33879;&#20316;&#27177;&#12434;&#23436;&#20840;&#12395;&#35698;&#28193;&#12377;&#12427;&#12424;&#12358;&#27714;&#12417;&#12427;&#12392;&#12371;&#12429;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12540;&#12489;&#12398;&#33879;&#20316;&#27177;&#12434;&#12402;&#12392;&#12388;&#12398;&#27861;&#30340;&#20027;&#20307;&#12364;&#25345;&#12387;&#12390;&#12356;&#12383;&#26041;&#12364;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#26465;&#20214;&#12395;&#36949;&#21453;&#12375;&#12383;&#20154;&#12434;&#35380;&#12360;&#12427;&#22580;&#21512;&#12395;&#20415;&#21033;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#33879;&#20316;&#27177;&#12434;&#35698;&#12387;&#12390;&#12418;&#12425;&#12358;&#12392;&#12365;&#12395;&#12393;&#12398;&#31243;&#24230;&#12398;&#21427;&#23494;&#12373;&#12434;&#27714;&#12417;&#12427;&#12398;&#12363;&#12399;&#12289;
    &#32068;&#32340;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;
    &#12300;&#31169;&#12399;&#12371;&#12371;&#12391;&#12289;&#12371;&#12398;&#12467;&#12540;&#12489;&#12398;&#33879;&#20316;&#27177;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#35698;&#12426;&#12289;
    &#12371;&#12398;&#12467;&#12540;&#12489;&#20197;&#22806;&#12398;&#12418;&#12398;&#12392;&#21516;&#12376;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12373;&#12379;&#12414;&#12377;&#12290;&#12301;
    &#12392;&#35328;&#12358;&#12371;&#12392;&#12392;&#21516;&#12376;&#21177;&#26524;&#12364;&#12354;&#12427;&#12289;&#38750;&#20844;&#24335;&#12394;&#22768;&#26126;&#12434;&#38598;&#12417;&#12427;&#12384;&#12369;&#12398;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#31169;&#12364;&#35441;&#12434;&#12375;&#12383;&#24321;&#35703;&#22763;&#12398;&#12358;&#12385;&#23569;&#12394;&#12367;&#12392;&#12418;&#12402;&#12392;&#12426;&#12399;&#12289;
    &#12371;&#12428;&#12391;&#21313;&#20998;&#12384;&#12392;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;&#12362;&#12381;&#12425;&#12367;&#12371;&#12428;&#12399;&#12289;
    &#33879;&#20316;&#27177;&#12398;&#35698;&#28193;&#12364;&#36890;&#24120;&#26399;&#24453;&#12373;&#12428;&#12427;&#29366;&#27841;&#19979;&#12391;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12289;
    &#12381;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#38283;&#30330;&#32773;&#12398;&#26412;&#24403;&#12398;&#24847;&#24535;&#12434;&#30906;&#23450;&#12373;&#12379;&#12424;&#12358;&#12392;&#12377;&#12427;&#21162;&#21147;&#12364;
    <span class="foreignphrase"><em class="foreignphrase">&#26412;&#29289;&#12391;&#12354;&#12427;</em></span>
    &#12371;&#12392;&#12434;&#34920;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12384;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;&#19968;&#26041;&#12391;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243; (FSF)&#12399;&#12289;&#20840;&#12367;&#36870;&#12398;&#31435;&#22580;&#12434;&#12392;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#33879;&#20316;&#27177;&#12434;&#35698;&#28193;&#12377;&#12427;&#27491;&#24335;&#12394;&#22768;&#26126;&#25991;&#12364;&#26360;&#12363;&#12428;&#12383;&#19968;&#26522;&#12398;&#32025;&#20999;&#12428;&#12395;&#30452;&#25509;&#12469;&#12452;&#12531;&#12375;&#12289;
    &#37109;&#36865; (&#12354;&#12427;&#12356;&#12399; FAX) &#12377;&#12427;&#12371;&#12392;&#12434;&#27714;&#12417;&#12390;&#12365;&#12414;&#12377;&#12290;
    &#12383;&#12387;&#12383;&#19968;&#24230;&#36002;&#29486;&#12375;&#12383;&#12384;&#12369;&#12391;&#12418;FSF&#12399;&#12371;&#12428;&#12434;&#35201;&#27714;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#29694;&#22312;&#12289;&#12381;&#12375;&#12390;&#23558;&#26469;&#12377;&#12427;&#12391;&#12354;&#12429;&#12358;&#36002;&#29486;&#12395;&#23550;&#12375;&#12390;&#35201;&#27714;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#23550;&#35937;&#12392;&#12394;&#12427;&#38283;&#30330;&#32773;&#12364;&#38599;&#12431;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12289;&#38599;&#29992;&#20027;&#12418;&#12469;&#12452;&#12531;&#12434;&#27714;&#12417;&#12425;&#12428;&#12414;&#12377;&#12290;
</p><p>
    FSF &#12364;&#28500;&#30294;&#12394;&#12398;&#12399;&#29702;&#35299;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#20206;&#12395;&#35504;&#12363;&#12364; FSF &#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#29420;&#21344;&#30340;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#32068;&#12415;&#36796;&#12435;&#12391;
    GPL &#12398;&#26465;&#20214;&#12395;&#36949;&#21453;&#12375;&#12383;&#22580;&#21512;&#12289;FSF &#12399;&#35009;&#21028;&#12391;&#20105;&#12358;&#24517;&#35201;&#12364;&#20986;&#12390;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12375;&#12383;&#20107;&#24907;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#12289;
    FSF&#12399;&#33258;&#12425;&#12364;&#25345;&#12388;&#33879;&#20316;&#27177;&#12434;&#20840;&#12367;&#38553;&#12364;&#12394;&#12356;&#29366;&#24907;&#12395;&#12375;&#12383;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    FSF &#12399;&#22810;&#12367;&#12398;&#20154;&#27671;&#12364;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#33879;&#20316;&#27177;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#24444;&#12425;&#12399;&#12371;&#12358;&#12375;&#12383;&#21487;&#33021;&#24615;&#12364;&#23455;&#38555;&#12395;&#12354;&#12426;&#24471;&#12427;&#12371;&#12392;&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12364;&#21516;&#12376;&#12424;&#12358;&#12395;&#32048;&#24515;&#12398;&#27880;&#24847;&#12434;&#25173;&#12358;&#12409;&#12365;&#12363;&#12399;&#12289;
    &#24321;&#35703;&#22763;&#12395;&#30456;&#35527;&#12375;&#12390;&#12363;&#12425;&#27770;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#19968;&#33324;&#30340;&#12395;&#12399;&#12289;&#33879;&#20316;&#27177;&#12434;&#23436;&#20840;&#12395;&#35698;&#12387;&#12390;&#12418;&#12425;&#12358;&#29702;&#30001;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;
    CLA &#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#30342;&#12364;&#25201;&#12356;&#12420;&#12377;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3129856" href="#idp3129856" class="para">40</a>] </sup>&#12371;&#12371;&#12363;&#12425;&#31169;&#12399;&#12289;&#12300;&#12467;&#12540;&#12489;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#12300;&#12503;&#12525;&#12464;&#12521;&#12512;&#12392;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20001;&#26041;&#12301;
    &#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#20351;&#12356;&#12414;&#12377;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="license-choosing.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="dual-licensing.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36984;&#12406; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;</td></tr></table></div></body></html>
