<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20184;&#37682;G &#33879;&#20316;&#27177;&#34920;&#31034;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="producingoss.ja.afterwords.html" title="&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20184;&#37682;G &#33879;&#20316;&#27177;&#34920;&#31034;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="producingoss.ja.afterwords.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> </td></tr></table><hr></div><div class="appendix" title="&#20184;&#37682;G &#33879;&#20316;&#27177;&#34920;&#31034;"><div class="titlepage"><div><div><h2 class="title"><a name="copyright"></a>&#20184;&#37682;G &#33879;&#20316;&#27177;&#34920;&#31034;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><pre class="programlisting">


&#12371;&#12398;&#26412;&#12398;&#20869;&#23481;&#12399;&#12289;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12467;&#12514;&#12531;&#12474; Attribution-ShareAlike (&#34920;&#31034;-&#32153;&#25215;) &#12521;&#12452;&#12475;&#12531;&#12473;
&#12395;&#12424;&#12387;&#12390;&#12521;&#12452;&#12475;&#12531;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12467;&#12500;&#12540;&#12434;&#35211;&#12427;&#12395;&#12399;&#12289;http://creativecommons.org/licenses/by-sa/2.1/ &#12434;
&#35211;&#12427;&#12363;&#12289;&#20197;&#19979;&#12398;&#20303;&#25152;&#12395;&#37109;&#20415;&#12434;&#36865;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;<sup>[<a name="idp3599936" href="#ftn.idp3599936" class="footnote">49</a>]</sup>&#12290;
Creative Commons, 559 Nathan Abbott Way, Stanford, California 94305, USA. 
&#20197;&#19979;&#12391;&#12399;&#12399;&#12376;&#12417;&#12395;&#12371;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#35201;&#32004;&#12434;&#31034;&#12375;&#12289;&#23436;&#20840;&#12394;&#26465;&#25991;&#12364;&#12381;&#12398;&#24460;&#12395;&#32154;&#12365;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;
&#12364;&#12371;&#12398;&#26412;&#12398;&#20840;&#37096;&#12414;&#12383;&#12399;&#19968;&#37096;&#12434;&#21029;&#12398;&#26465;&#20214;&#12391;&#20877;&#37197;&#24067;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;&#20316;&#32773;&#12395;&#36899;&#32097;&#12434;&#12392;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
Karl Fogel &lt;kfogel@red-bean.com&gt;

-*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*-



&#12354;&#12394;&#12383;&#12399;&#20197;&#19979;&#12398;&#26465;&#20214;&#12395;&#24467;&#12358;&#22580;&#21512;&#12395;&#38480;&#12426;&#12289;&#33258;&#30001;&#12395;:

    * &#26412;&#20316;&#21697;&#12434;&#35079;&#35069;&#12289;&#38930;&#24067;&#12289;&#23637;&#31034;&#12289;&#23455;&#28436;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    * &#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;



&#12354;&#12394;&#12383;&#12398;&#24467;&#12358;&#12409;&#12365;&#26465;&#20214;&#12399;&#20197;&#19979;&#12398;&#36890;&#12426;&#12391;&#12377;&#12290;:

    * &#34920;&#31034;. &#12354;&#12394;&#12383;&#12399;&#21407;&#33879;&#20316;&#32773;&#12398;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#34920;&#31034;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;

    * &#32153;&#25215;. &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#12371;&#12398;&#20316;&#21697;&#12434;&#25913;&#22793;&#12289;&#22793;&#24418;&#12414;&#12383;&#12399;&#21152;&#24037;&#12375;&#12383;&#22580;&#21512;&#12289;&#12354;&#12394;&#12383;
      &#12399;&#12381;&#12398;&#32080;&#26524;&#29983;&#12376;&#12383;&#20316;&#21697;&#12434;&#12371;&#12398;&#20316;&#21697;&#12392;&#21516;&#19968;&#12398;&#35377;&#35582;&#26465;&#20214;&#12398;&#19979;&#12391;&#12398;&#12415;&#38930;&#24067;&#12377;&#12427;
      &#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;

    * &#20877;&#21033;&#29992;&#12420;&#38930;&#24067;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;&#12371;&#12398;&#20316;&#21697;&#12398;&#20351;&#29992;&#35377;&#35582;&#26465;&#20214;&#12434;&#20182;&#12398;&#20154;&#12293;&#12395;&#26126;&#12425;
      &#12363;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;

    * &#33879;&#20316;[&#27177;]&#32773;&#12363;&#12425;&#35377;&#21487;&#12434;&#24471;&#12427;&#12392;&#12289;&#12371;&#12428;&#12425;&#12398;&#26465;&#20214;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;

    * &#12371;&#12398;&#35377;&#35582;&#26465;&#20214;&#12399;&#12289;&#21407;&#33879;&#20316;&#32773;&#12398;&#33879;&#20316;&#32773;&#20154;&#26684;&#27177;&#12434;&#25613;&#12397;&#12383;&#12426;&#12289;&#21046;&#38480;&#12377;&#12427;&#12418;&#12398;&#12391;
      &#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;

-*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*- -*-

   Creative Commons Legal Code: &#12450;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#8212;&#12471;&#12455;&#12450;&#12450;&#12521;&#12452;&#12463; 2.1
                                &#65288;&#24112;&#23646;&#8212;&#21516;&#19968;&#26465;&#20214;&#35377;&#35582;&#65289;

&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#21450;&#12403;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12539;&#12472;&#12515;&#12497;&#12531;&#12399;&#27861;&#24459;&#20107;&#21209;&#25152;&#12391;&#12399;&#12354;&#12426;&#12414;
&#12379;&#12435;&#12290;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#26465;&#38917;&#12398;&#38930;&#24067;&#12399;&#27861;&#30340;&#12450;&#12489;&#12496;&#12452;&#12473;&#12381;&#12398;&#20182;&#12398;&#27861;&#24459;&#26989;&#21209;&#12434;&#34892;&#12358;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#21450;&#12403;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12539;&#12472;&#12515;&#12497;&#12531;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#24403;&#20107;
&#32773;&#12391;&#12399;&#12394;&#12367;&#12289;&#12371;&#12371;&#12395;&#25552;&#20379;&#12377;&#12427;&#24773;&#22577;&#21450;&#12403;&#26412;&#20316;&#21697;&#12395;&#38306;&#12375;&#12356;&#12363;&#12394;&#12427;&#20445;&#35388;&#12418;&#34892;&#12356;&#12414;&#12379;&#12435;&#12290;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;
&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#21450;&#12403;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12539;&#12472;&#12515;&#12497;&#12531;&#12399;&#12289;&#12356;&#12363;&#12394;&#12427;&#27861;&#20196;&#12395;&#22522;&#12389;&#12371;&#12358;&#12392;&#12418;&#12289;&#12354;
&#12394;&#12383;&#21448;&#12399;&#12356;&#12363;&#12394;&#12427;&#31532;&#19977;&#32773;&#12398;&#25613;&#23475;&#65288;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#38306;&#36899;&#12377;&#12427;&#36890;&#24120;&#25613;&#23475;&#12289;&#29305;&#21029;&#25613;&#23475;&#12434;&#21547;&#12415;&#12414;&#12377;&#12364;&#12371;
&#12428;&#12425;&#12395;&#38480;&#12425;&#12428;&#12414;&#12379;&#12435;&#65289;&#12395;&#12388;&#12356;&#12390;&#36012;&#20219;&#12434;&#36000;&#12356;&#12414;&#12379;&#12435;&#12290;

&#21033;&#29992;&#35377;&#35582;:

&#26412;&#20316;&#21697;&#65288;&#19979;&#35352;&#12395;&#23450;&#32681;&#12377;&#12427;&#65289;&#12399;&#12289;&#12371;&#12398;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#65381;&#12497;&#12502;&#12522;&#12483;&#12463;&#65381;&#12521;&#12452;&#12475;&#12531;&#12473;&#26085;&#26412;&#29256;
&#65288;&#20197;&#19979;&#12300;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12301;&#12392;&#12356;&#12358;&#65289;&#12398;&#26465;&#38917;&#12398;&#19979;&#12391;&#25552;&#20379;&#12373;&#12428;&#12427;&#12290;&#26412;&#20316;&#21697;&#12399;&#12289;&#33879;&#20316;&#27177;&#27861;&#21450;&#12403;&#65295;&#21448;&#12399;&#20182;
&#12398;&#36969;&#29992;&#27861;&#12395;&#12424;&#12387;&#12390;&#20445;&#35703;&#12373;&#12428;&#12427;&#12290;&#26412;&#20316;&#21697;&#12434;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#21448;&#12399;&#33879;&#20316;&#27177;&#27861;&#12398;&#19979;&#12391;&#25480;&#27177;&#12373;&#12428;&#12383;&#20197;&#22806;&#12398;&#26041;
&#27861;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#31105;&#27490;&#12377;&#12427;&#12290;

&#35377;&#35582;&#32773;&#12399;&#12289;&#12363;&#12363;&#12427;&#26465;&#38917;&#12434;&#12354;&#12394;&#12383;&#12364;&#25215;&#35582;&#12377;&#12427;&#12371;&#12392;&#12392;&#12402;&#12365;&#12363;&#12360;&#12395;&#12289;&#12371;&#12371;&#12395;&#35215;&#23450;&#12373;&#12428;&#12427;&#27177;&#21033;&#12434;&#12354;&#12394;&#12383;
&#12395;&#20184;&#19982;&#12377;&#12427;&#12290;&#26412;&#20316;&#21697;&#12395;&#38306;&#12375;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#19979;&#12391;&#35469;&#12417;&#12425;&#12428;&#12427;&#12356;&#12378;&#12428;&#12363;&#12398;&#21033;&#29992;&#12434;&#34892;&#12358;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;
&#12354;&#12394;&#12383;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#65288;&#26465;&#38917;&#65289;&#12395;&#25304;&#26463;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#25215;&#35582;&#12375;&#21516;&#24847;&#12375;&#12383;&#12371;&#12392;&#12392;&#12394;&#12427;&#12290;

&#31532;1&#26465;&#12288;&#23450;&#32681;

&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#20013;&#12398;&#29992;&#35486;&#12434;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#23450;&#32681;&#12377;&#12427;&#12290;&#12381;&#12398;&#20182;&#12398;&#29992;&#35486;&#12399;&#12289;&#33879;&#20316;&#27177;&#27861;&#12381;&#12398;&#20182;&#12398;&#27861;&#20196;&#12391;&#23450;
&#12417;&#12427;&#24847;&#21619;&#12434;&#25345;&#12388;&#12418;&#12398;&#12392;&#12377;&#12427;&#12290;

   a. &#12300;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12301;&#12392;&#12399;&#12289;&#33879;&#20316;&#29289;&#12434;&#32763;&#35379;&#12375;&#12289;&#32232;&#26354;&#12375;&#12289;&#33509;&#12375;&#12367;&#12399;&#22793;&#24418;&#12375;&#12289;
      &#12414;&#12383;&#12399;&#33050;&#33394;&#12375;&#12289;&#26144;&#30011;&#21270;&#12375;&#12289;&#12381;&#12398;&#20182;&#32763;&#26696;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#21109;&#20316;&#12375;&#12383;&#33879;&#20316;
      &#29289;&#12434;&#12356;&#12358;&#12290;&#12383;&#12384;&#12375;&#12289;&#32232;&#38598;&#33879;&#20316;&#29289;&#21448;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#33879;&#20316;&#29289;&#65288;&#20197;&#19979;&#12289;
      &#12371;&#12398;&#20108;&#12388;&#12434;&#20341;&#12379;&#12390;&#12300;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12301;&#12392;&#12356;&#12358;&#12290;&#65289;&#12434;&#27083;&#25104;&#12377;&#12427;&#33879;&#20316;&#29289;&#12399;&#12289;
      &#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12392;&#12415;&#12394;&#12373;&#12428;&#12394;&#12356;&#12290;&#12414;&#12383;&#12289;&#21407;&#33879;&#20316;&#32773;&#21450;&#12403;&#23455;&#28436;&#23478;&#12398;&#21517;&#35465;&#21448;
      &#12399;&#22768;&#26395;&#12434;&#23475;&#12377;&#12427;&#26041;&#27861;&#12391;&#21407;&#33879;&#20316;&#29289;&#12434;&#25913;&#20316;&#12289;&#22793;&#24418;&#12418;&#12375;&#12367;&#12399;&#32763;&#26696;&#12375;&#12390;&#29983;&#12376;
      &#12427;&#33879;&#20316;&#29289;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#30446;&#30340;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12395;&#21547;&#12414;
      &#12428;&#12394;&#12356;&#12290; 

   b. &#12300;&#35377;&#35582;&#32773;&#12301;&#12392;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12398;&#19979;&#12391;&#26412;&#20316;&#21697;&#12434;&#25552;&#20379;&#12377;&#12427;&#20491;&#20154;
       &#21448;&#12399;&#22243;&#20307;&#12434;&#12356;&#12358;&#12290;

   c. &#12300;&#12354;&#12394;&#12383;&#12301;&#12392;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12367;&#27177;&#21033;&#12434;&#34892;&#20351;&#12377;&#12427;&#20491;&#20154;&#21448;&#12399;&#22243;
       &#20307;&#12434;&#12356;&#12358;&#12290; 

   d. &#12300;&#21407;&#33879;&#20316;&#32773;&#12301;&#12392;&#12399;&#12289;&#26412;&#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#33879;&#20316;&#29289;&#12434;&#21109;&#20316;&#12375;&#12383;&#20491;&#20154;&#21448;&#12399;&#22243;
       &#20307;&#12434;&#12356;&#12358;&#12290; 

   e. &#12300;&#26412;&#20316;&#21697;&#12301;&#12392;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#22522;&#12389;&#12356;&#12390;&#21033;&#29992;&#12377;&#12427;&#27177;&#21033;&#12364;&#20184;
       &#19982;&#12373;&#12428;&#12427;&#23550;&#35937;&#12383;&#12427;&#28961;&#20307;&#29289;&#12434;&#12356;&#12356;&#12289;&#33879;&#20316;&#29289;&#12289;&#23455;&#28436;&#12289;&#12524;&#12467;&#12540;&#12489;&#12289;&#25918;&#36865;&#12395;
       &#12363;&#12363;&#12427;&#38899;&#21448;&#12399;&#24433;&#20687;&#12289;&#12418;&#12375;&#12367;&#12399;&#26377;&#32218;&#25918;&#36865;&#12395;&#12363;&#12363;&#12427;&#38899;&#21448;&#12399;&#24433;&#20687;&#12434;&#12377;&#12409;&#12390;
       &#21547;&#12416;&#12418;&#12398;&#12392;&#12377;&#12427;&#12290; 
   
   f. &#12300;&#12521;&#12452;&#12475;&#12531;&#12473;&#35201;&#32032;&#12301;&#12392;&#12399;&#12289;&#35377;&#35582;&#32773;&#12364;&#36984;&#25246;&#12375;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#34920;&#31034;&#12373;
       &#12428;&#12390;&#12356;&#12427;&#12289;&#20197;&#19979;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#23646;&#24615;&#12434;&#12356;&#12358;&#65306;&#24112;&#23646;&#12539;&#21516;&#19968;&#26465;&#20214;&#35377;&#35582; 

&#31532;2&#26465;&#12288;&#33879;&#20316;&#27177;&#31561;&#12395;&#23550;&#12377;&#12427;&#21046;&#38480;

&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#21547;&#12414;&#12428;&#12427;&#12356;&#12363;&#12394;&#12427;&#26465;&#38917;&#12395;&#12424;&#12387;&#12390;&#12418;&#12289;&#35377;&#35582;&#32773;&#12399;&#12289;&#12354;&#12394;&#12383;&#12364;&#33879;&#20316;&#27177;&#12398;&#21046;&#38480;&#65288;&#33879;&#20316;&#27177;
&#27861;&#31532;30&#26465;&#12316;49&#26465;&#65289;&#12289;&#33879;&#20316;&#32773;&#20154;&#26684;&#27177;&#12395;&#23550;&#12377;&#12427;&#21046;&#38480;&#65288;&#33879;&#20316;&#27177;&#27861;&#31532; 18&#26465;2&#38917;&#12316;4&#38917;&#12289;&#31532;19&#26465;2&#38917;&#12316;4&#38917;&#12289;
&#31532;20&#26465;2&#38917;&#65289;&#12289;&#33879;&#20316;&#38563;&#25509;&#27177;&#12395;&#23550;&#12377;&#12427;&#21046;&#38480;&#65288;&#33879;&#20316;&#27177;&#27861;&#31532;102&#26465;&#65289;&#12381;&#12398;&#20182;&#12289;&#33879;&#20316;&#27177;&#27861;&#21448;&#12399;&#12381;&#12398;&#20182;&#12398;&#36969;
&#29992;&#27861;&#12395;&#22522;&#12389;&#12356;&#12390;&#35469;&#12417;&#12425;&#12428;&#12427;&#12371;&#12392;&#12392;&#12394;&#12427;&#26412;&#20316;&#21697;&#12398;&#21033;&#29992;&#12434;&#31105;&#27490;&#12375;&#12394;&#12356;&#12290;

&#31532;3&#26465;&#12288;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20184;&#19982;

&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#24467;&#12356;&#12289;&#35377;&#35582;&#32773;&#12399;&#12354;&#12394;&#12383;&#12395;&#12289;&#26412;&#20316;&#21697;&#12395;&#38306;&#12375;&#12289;&#12377;&#12409;&#12390;&#12398;&#22269;&#12391;&#12289;&#12525;&#12452;&#12516;&#12522;&#12486;&#12451;
&#12539;&#12501;&#12522;&#12540;&#12289;&#38750;&#25490;&#20182;&#30340;&#12391;&#12289;&#65288;&#31532;7&#26465;b&#12395;&#23450;&#12417;&#12427;&#26399;&#38291;&#65289;&#32153;&#32154;&#30340;&#12394;&#20197;&#19979;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#20184;&#19982;&#12377;&#12427;&#12290;&#12383;&#12384;
&#12375;&#12289;&#12354;&#12394;&#12383;&#12364;&#20197;&#21069;&#12395;&#26412;&#20316;&#21697;&#12395;&#38306;&#12377;&#12427;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#36949;&#21453;&#12375;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#12289;
&#20197;&#21069;&#12395;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#36949;&#21453;&#12375;&#12383;&#12364;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12367;&#27177;&#21033;&#12434;&#34892;&#20351;&#12377;&#12427;&#12383;&#12417;&#12395;&#35377;&#35582;&#32773;&#12363;
&#12425;&#26126;&#31034;&#30340;&#12394;&#35377;&#21487;&#12434;&#24471;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#38480;&#12427;&#12290;

   a. &#26412;&#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#33879;&#20316;&#29289;&#65288;&#20197;&#19979;&#12300;&#26412;&#33879;&#20316;&#29289;&#12301;&#12392;&#12356;&#12358;&#12290;&#65289;&#12434;&#35079;&#35069;&#12377;&#12427;&#12371;
      &#12392;&#65288;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12395;&#32068;&#12415;&#36796;&#12415;&#35079;&#35069;&#12377;&#12427;&#12371;&#12392;&#12434;&#21547;&#12416;&#12290;&#20197;&#19979;&#12289;&#21516;&#12376;&#12290;&#65289;
   
   b. &#26412;&#33879;&#20316;&#29289;&#12434;&#32763;&#26696;&#12375;&#12390;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12434;&#21109;&#20316;&#12375;&#12289;&#35079;&#35069;&#12377;&#12427;&#12371;&#12392;

   c. &#26412;&#33879;&#20316;&#29289;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12398;&#35079;&#35069;&#29289;&#12434;&#38930;&#24067;&#12377;&#12427;&#12371;&#12392;&#65288;&#35698;&#28193;&#12414;&#12383;&#12399;
      &#36024;&#19982;&#12395;&#12424;&#12426;&#20844;&#34886;&#12395;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12434;&#21547;&#12416;&#12290;&#20197;&#19979;&#21516;&#12376;&#12290;&#65289;&#12289;&#19978;&#28436;&#12377;&#12427;&#12371;&#12392;&#12289;
      &#28436;&#22863;&#12377;&#12427;&#12371;&#12392;&#12289;&#19978;&#26144;&#12377;&#12427;&#12371;&#12392;&#12289;&#20844;&#34886;&#36865;&#20449;&#12434;&#34892;&#12358;&#12371;&#12392;&#65288;&#36865;&#20449;&#21487;&#33021;&#21270;&#12434;&#21547;
      &#12416;&#12290;&#20197;&#19979;&#12289;&#21516;&#12376;&#12290;&#65289;&#12289;&#20844;&#12395;&#21475;&#36848;&#12377;&#12427;&#12371;&#12392;&#12289;&#20844;&#12395;&#23637;&#31034;&#12377;&#12427;&#12371;&#12392;&#12289;
   
   d. &#26412;&#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#23455;&#28436;&#12434;&#12289;&#37682;&#38899;&#12539;&#37682;&#30011;&#12377;&#12427;&#12371;&#12392;&#65288;&#37682;&#38899;&#65381;&#37682;&#30011;&#29289;&#12434;&#22679;&#35069;
      &#12377;&#12427;&#12371;&#12392;&#12434;&#21547;&#12416;&#65289;&#12289;&#37682;&#38899;&#65381;&#37682;&#30011;&#29289;&#12395;&#12424;&#12426;&#38930;&#24067;&#12377;&#12427;&#12371;&#12392;&#12289;&#20844;&#34886;&#36865;&#20449;&#12434;&#34892;
      &#12358;&#12371;&#12392;

   e. &#26412;&#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#12524;&#12467;&#12540;&#12489;&#12434;&#12289;&#35079;&#35069;&#12377;&#12427;&#12371;&#12392;&#12289;&#38930;&#24067;&#12377;&#12427;&#12371;&#12392;&#12289;&#20844;&#34886;&#36865;
      &#20449;&#12434;&#34892;&#12358;&#12371;&#12392;

   f. &#26412;&#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#12289;&#25918;&#36865;&#12395;&#20418;&#12427;&#38899;&#21448;&#12399;&#24433;&#20687;&#12434;&#12289;&#35079;&#35069;&#12377;&#12427;&#12371;&#12392;&#12289;&#12381;&#12398;&#25918;
      &#36865;&#12434;&#21463;&#20449;&#12375;&#12390;&#20877;&#25918;&#36865;&#12377;&#12427;&#12371;&#12392;&#21448;&#12399;&#26377;&#32218;&#25918;&#36865;&#12377;&#12427;&#12371;&#12392;&#12289;&#12381;&#12398;&#25918;&#36865;&#21448;&#12399;&#12371;
      &#12428;&#12434;&#21463;&#20449;&#12375;&#12390;&#34892;&#12358;&#26377;&#32218;&#25918;&#36865;&#12434;&#21463;&#20449;&#12375;&#12390;&#36865;&#20449;&#21487;&#33021;&#21270;&#12377;&#12427;&#12371;&#12392;&#12289;&#12381;&#12398;&#12486;&#12524;
      &#12499;&#12472;&#12519;&#12531;&#25918;&#36865;&#21448;&#12399;&#12371;&#12428;&#12434;&#21463;&#20449;&#12375;&#12390;&#34892;&#12358;&#26377;&#32218;&#25918;&#36865;&#12434;&#21463;&#20449;&#12375;&#12390;&#12289;&#24433;&#20687;&#12434;&#25313;
      &#22823;&#12377;&#12427;&#29305;&#21029;&#12398;&#35013;&#32622;&#12434;&#29992;&#12356;&#12390;&#20844;&#12395;&#20253;&#36948;&#12377;&#12427;&#12371;&#12392;

   g. &#26412;&#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#12289;&#26377;&#32218;&#25918;&#36865;&#12395;&#20418;&#12427;&#38899;&#21448;&#12399;&#24433;&#20687;&#12434;&#12289;&#35079;&#35069;&#12377;&#12427;&#12371;&#12392;&#12289;&#12381;
      &#12398;&#26377;&#32218;&#25918;&#36865;&#12434;&#21463;&#20449;&#12375;&#12390;&#25918;&#36865;&#12375;&#12289;&#21448;&#12399;&#20877;&#26377;&#32218;&#25918;&#36865;&#12377;&#12427;&#12371;&#12392;&#12289;&#12381;&#12398;&#26377;&#32218;&#25918;
      &#36865;&#12434;&#21463;&#20449;&#12375;&#12390;&#36865;&#20449;&#21487;&#33021;&#21270;&#12377;&#12427;&#12371;&#12392;&#12289;&#12381;&#12398;&#26377;&#32218;&#12486;&#12524;&#12499;&#12472;&#12519;&#12531;&#25918;&#36865;&#12434;&#21463;&#20449;
      &#12375;&#12390;&#12289;&#24433;&#20687;&#12434;&#25313;&#22823;&#12377;&#12427;&#29305;&#21029;&#12398;&#35013;&#32622;&#12434;&#29992;&#12356;&#12390;&#20844;&#12395;&#20253;&#36948;&#12377;&#12427;&#12371;&#12392;

&#19978;&#35352;&#12395;&#23450;&#12417;&#12425;&#12428;&#12383;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12398;&#21033;&#29992;&#12399;&#12289;&#29694;&#22312;&#21450;&#12403;&#23558;&#26469;&#12398;&#12377;&#12409;&#12390;&#12398;&#23186;&#20307;&#12539;&#24418;&#24335;
&#12391;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12290;&#12354;&#12394;&#12383;&#12399;&#12289;&#20182;&#12398;&#23186;&#20307;&#21450;&#12403;&#24418;&#24335;&#12391;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12434;&#21033;&#29992;&#12377;&#12427;
&#12398;&#12395;&#25216;&#34899;&#30340;&#12395;&#24517;&#35201;&#12394;&#22793;&#26356;&#12434;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12290;&#35377;&#35582;&#32773;&#12399;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12395;&#38306;&#12375;&#12390;&#12289;
&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#24467;&#12387;&#12383;&#21033;&#29992;&#12395;&#12388;&#12356;&#12390;&#12399;&#33258;&#24049;&#12364;&#26377;&#12377;&#12427;&#33879;&#20316;&#32773;&#20154;&#26684;&#27177;&#21450;&#12403;&#23455;&#28436;&#23478;&#20154;&#26684;&#27177;&#12434;&#34892;&#20351;&#12375;&#12394;
&#12356;&#12290;&#35377;&#35582;&#32773;&#12395;&#12424;&#12387;&#12390;&#26126;&#31034;&#30340;&#12395;&#20184;&#19982;&#12373;&#12428;&#12394;&#12356;&#20840;&#12390;&#12398;&#27177;&#21033;&#12399;&#12289;&#30041;&#20445;&#12373;&#12428;&#12427;&#12290;

&#31532;4&#26465;&#12288;&#21463;&#38936;&#32773;&#12408;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#25552;&#20379;

&#12354;&#12394;&#12383;&#12364;&#26412;&#20316;&#21697;&#12434;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12356;&#12390;&#21033;&#29992;&#12377;&#12427;&#24230;&#27598;&#12395;&#12289;&#35377;&#35582;&#32773;&#12399;&#26412;&#20316;&#21697;&#21448;&#12399;&#26412;&#20316;&#21697;&#12398;&#20108;&#27425;
&#30340;&#33879;&#20316;&#29289;&#12398;&#21463;&#38936;&#32773;&#12395;&#23550;&#12375;&#12390;&#12289;&#30452;&#25509;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#19979;&#12391;&#12354;&#12394;&#12383;&#12395;&#35377;&#21487;&#12373;&#12428;&#12383;&#21033;&#29992;&#35377;&#35582;&#12392;&#21516;&#12376;&#26465;
&#20214;&#12398;&#26412;&#20316;&#21697;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#12290;

&#31532;5&#26465;&#12288;&#21046;&#38480;

&#19978;&#35352;&#31532;3&#26465;&#21450;&#12403;&#31532;4&#26465;&#12395;&#12424;&#12426;&#20184;&#19982;&#12373;&#12428;&#12383;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;&#20197;&#19979;&#12398;&#21046;&#38480;&#12395;&#26126;&#31034;&#30340;&#12395;&#24467;&#12356;&#12289;&#21046;&#32004;&#12373;&#12428;&#12427;&#12290;

   a. &#12354;&#12394;&#12383;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#22522;&#12389;&#12356;&#12390;&#12398;&#12415;&#12289;&#26412;&#20316;&#21697;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;
      &#12392;&#12364;&#12391;&#12365;&#12427;&#12290;

   b. &#12354;&#12394;&#12383;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#21448;&#12399;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12392;&#21516;&#19968;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#35201;&#32032;&#12434;
      &#21547;&#12416;&#12411;&#12363;&#12398;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#65381;&#12467;&#12514;&#12531;&#12474;&#12539;&#12521;&#12452;&#12475;&#12531;&#12473;&#65288;&#20363;&#12360;&#12400;&#12289;&#12371;&#12398;&#21033;
      &#29992;&#35377;&#35582;&#12398;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12289;&#21448;&#12399;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12392;&#21516;&#19968;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#35201;
      &#32032;&#12398;&#20182;&#22269;&#31821;&#12521;&#12452;&#12475;&#12531;&#12473;&#12394;&#12393;&#65289;&#12395;&#22522;&#12389;&#12356;&#12390;&#12398;&#12415;&#12289;&#26412;&#20316;&#21697;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;
      &#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12290; 

   c. &#12354;&#12394;&#12383;&#12399;&#12289;&#26412;&#20316;&#21697;&#12434;&#21033;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#20889;&#12375;&#21448;&#12399;URI
     &#65288;Uniform Resource Identifier&#65289;&#12434;&#26412;&#20316;&#21697;&#12398;&#35079;&#35069;&#29289;&#12395;&#28155;&#20184;&#21448;&#12399;&#34920;&#31034;&#12375;
      &#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12290;

   d. &#12354;&#12394;&#12383;&#12399;&#12289;&#26412;&#20316;&#21697;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12434;&#21033;&#29992;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#21448;
      &#12399;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12392;&#21516;&#19968;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#35201;&#32032;&#12434;&#21547;&#12416;&#12411;&#12363;&#12398;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#65381;
      &#12467;&#12514;&#12531;&#12474;&#65381;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20889;&#12375;&#21448;&#12399;URI&#12434;&#26412;&#20316;&#21697;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12398;&#35079;&#35069;&#29289;
      &#12395;&#28155;&#20184;&#12414;&#12383;&#12399;&#34920;&#31034;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12290;

   e. &#12354;&#12394;&#12383;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#26465;&#38917;&#21450;&#12403;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#12424;&#12387;&#12390;&#20184;&#19982;&#12373;&#12428;&#12427;&#21033;
      &#29992;&#35377;&#35582;&#21463;&#38936;&#32773;&#12398;&#27177;&#21033;&#12398;&#34892;&#20351;&#12434;&#22793;&#26356;&#21448;&#12399;&#21046;&#38480;&#12377;&#12427;&#12424;&#12358;&#12394;&#12289;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;
      &#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12395;&#20418;&#12427;&#26465;&#20214;&#12434;&#25552;&#26696;&#12375;&#12383;&#12426;&#35506;&#12375;&#12383;&#12426;&#12375;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;&#12290;

   f. &#12354;&#12394;&#12383;&#12399;&#12289;&#26412;&#20316;&#21697;&#12434;&#20877;&#21033;&#29992;&#35377;&#35582;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12290;

   g. &#12354;&#12394;&#12383;&#12399;&#12289;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12398;&#21033;&#29992;&#12395;&#12354;&#12383;&#12387;&#12390;&#12289;&#12371;&#12398;&#21033;&#29992;
      &#35377;&#35582;&#21450;&#12403;&#12381;&#12398;&#20813;&#36012;&#26465;&#38917;&#12395;&#38306;&#12377;&#12427;&#27880;&#24847;&#26360;&#12365;&#12398;&#20869;&#23481;&#12434;&#22793;&#26356;&#12379;&#12378;&#12289;&#35211;&#12420;&#12377;&#12356;
      &#24907;&#27096;&#12391;&#12381;&#12398;&#12414;&#12414;&#25522;&#36617;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12290; 

   h. &#12354;&#12394;&#12383;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#26465;&#38917;&#12392;&#30683;&#30462;&#12377;&#12427;&#26041;&#27861;&#12391;&#26412;&#33879;&#20316;&#29289;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;
      &#21448;&#12399;&#20351;&#29992;&#12434;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12377;&#12427;&#12424;&#12358;&#12394;&#25216;&#34899;&#30340;&#20445;&#35703;&#25163;&#27573;&#12434;&#29992;&#12356;&#12390;&#12289;&#26412;&#20316;&#21697;
      &#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12434;&#21033;&#29992;&#12375;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;&#12290; 

   i. &#26412;&#26465;&#12398;&#21046;&#38480;&#12399;&#12289;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12364;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12395;&#32068;&#12415;&#36796;
      &#12414;&#12428;&#12383;&#22580;&#21512;&#12395;&#12418;&#12289;&#12381;&#12398;&#32068;&#12415;&#36796;&#12414;&#12428;&#12383;&#20316;&#21697;&#12395;&#38306;&#12375;&#12390;&#12399;&#36969;&#29992;&#12373;&#12428;&#12427;&#12290;&#12375;&#12363;
      &#12375;&#12289;&#26412;&#20316;&#21697;&#21448;&#12399;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12364;&#32068;&#12415;&#36796;&#12414;&#12428;&#12383;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12381;&#12398;&#12418;
      &#12398;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#24467;&#12358;&#24517;&#35201;&#12399;&#12394;&#12356;&#12290;

   j. &#12354;&#12394;&#12383;&#12399;&#12289;&#26412;&#20316;&#21697;&#12289;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#21448;&#12399;&#26412;&#20316;&#21697;&#12434;&#32068;&#12415;&#36796;&#12435;&#12384;&#32232;&#38598;&#33879;
      &#20316;&#29289;&#31561;&#12434;&#21033;&#29992;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#65288;1&#65289;&#26412;&#20316;&#21697;&#12395;&#20418;&#12427;&#12377;&#12409;&#12390;&#12398;&#33879;&#20316;&#27177;&#34920;&#31034;&#12434;
      &#12381;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;&#65288;2&#65289;&#21407;&#33879;&#20316;&#32773;&#21450;&#12403;&#23455;&#28436;&#23478;&#12398;&#12463;&#12524;
      &#12472;&#12483;&#12488;&#12434;&#12289;&#21512;&#29702;&#30340;&#12394;&#26041;&#24335;&#12391;&#12289;&#65288;&#12418;&#12375;&#31034;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#21407;&#33879;&#20316;&#32773;&#21450;&#12403;&#23455;&#28436;
      &#23478;&#12398;&#21517;&#21069;&#21448;&#12399;&#22793;&#21517;&#12434;&#20253;&#12360;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#65289;&#34920;&#31034;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;
      &#65288;3&#65289;&#26412;&#20316;&#21697;&#12398;&#12479;&#12452;&#12488;&#12523;&#12364;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12381;&#12398;&#12479;&#12452;&#12488;&#12523;&#12434;&#34920;&#31034;
      &#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;&#65288;4&#65289;&#35377;&#35582;&#32773;&#12364;&#26412;&#20316;&#21697;&#12395;&#28155;&#20184;&#12377;&#12427;&#12424;&#12358;&#25351;&#23450;&#12375;&#12383;URI
      &#12364;&#12354;&#12428;&#12400;&#12289;&#21512;&#29702;&#30340;&#12395;&#23455;&#34892;&#21487;&#33021;&#12394;&#31684;&#22258;&#12391;&#12289;&#12381;&#12398;URI&#12434;&#34920;&#31034;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;
      &#12378;&#65288;&#12383;&#12384;&#12375;&#12289;&#12381;&#12398;URI&#12364;&#26412;&#20316;&#21697;&#12398;&#33879;&#20316;&#27177;&#34920;&#31034;&#12414;&#12383;&#12399;&#12521;&#12452;&#12475;&#12531;&#12473;&#24773;&#22577;&#12434;&#21442;
      &#29031;&#12377;&#12427;&#12418;&#12398;&#12391;&#12394;&#12356;&#12392;&#12365;&#12399;&#12371;&#12398;&#38480;&#12426;&#12391;&#12394;&#12356;&#12290;&#65289;&#65288;5&#65289;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12398;&#22580;&#21512;
      &#12395;&#12399;&#12289;&#24403;&#35442;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#20013;&#12398;&#21407;&#33879;&#20316;&#29289;&#12398;&#21033;&#29992;&#12434;&#31034;&#12377;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#34920;&#31034;
      &#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#12463;&#12524;&#12472;&#12483;&#12488;&#12399;&#12289;&#21512;&#29702;&#30340;&#12391;&#12354;&#12428;&#12400;&#12393;&#12435;&#12394;
      &#26041;&#27861;&#12391;&#12418;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12290;&#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#21448;&#12399;&#32232;&#38598;&#33879;
      &#20316;&#29289;&#31561;&#12398;&#22580;&#21512;&#12395;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#20182;&#12398;&#21516;&#27096;&#12398;&#33879;&#20316;&#32773;&#12398;&#12463;&#12524;&#12472;&#12483;&#12488;&#12364;&#34920;&#31034;
      &#12373;&#12428;&#12427;&#31623;&#25152;&#12391;&#24403;&#35442;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#34920;&#31034;&#12375;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#20182;&#12398;&#21516;&#27096;&#12398;&#33879;&#20316;&#32773;
      &#12398;&#12463;&#12524;&#12472;&#12483;&#12488;&#12392;&#21516;&#31243;&#24230;&#12395;&#30446;&#31435;&#12388;&#26041;&#27861;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#35201;&#12377;&#12427;&#12290; 

   k. &#12418;&#12375;&#12289;&#12354;&#12394;&#12383;&#12364;&#12289;&#26412;&#20316;&#21697;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#12289;&#21448;&#12399;&#26412;&#20316;&#21697;&#12418;&#12375;&#12367;&#12399;&#12381;&#12398;&#20108;
      &#27425;&#30340;&#33879;&#20316;&#29289;&#12434;&#32068;&#12415;&#36796;&#12435;&#12384;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12434;&#21109;&#20316;&#12375;&#12383;&#22580;&#21512;&#12289;&#12354;&#12394;&#12383;&#12399;&#12289;&#35377;
      &#35582;&#32773;&#12363;&#12425;&#12398;&#36890;&#30693;&#12364;&#12354;&#12428;&#12400;&#12289;&#23455;&#34892;&#21487;&#33021;&#12394;&#31684;&#22258;&#12391;&#12289;&#35201;&#27714;&#12395;&#24540;&#12376;&#12390;&#12289;&#20108;&#27425;&#30340;
      &#33879;&#20316;&#29289;&#21448;&#12399;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12363;&#12425;&#12289;&#35377;&#35582;&#32773;&#21448;&#12399;&#21407;&#33879;&#20316;&#32773;&#12408;&#12398;&#35328;&#21450;&#12434;&#12377;&#12409;&#12390;
      &#38500;&#21435;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12290;

&#31532;6&#26465;&#12288;&#36012;&#20219;&#21046;&#38480;

&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#20001;&#24403;&#20107;&#32773;&#12364;&#26360;&#38754;&#12395;&#12390;&#21029;&#36884;&#21512;&#24847;&#12375;&#12394;&#12356;&#38480;&#12426;&#12289;&#35377;&#35582;&#32773;&#12399;&#26412;&#20316;&#21697;&#12434;&#29694;&#29366;&#12398;&#12414;&#12414;&#25552;&#20379;&#12377;
&#12427;&#12418;&#12398;&#12392;&#12375;&#12289;&#26126;&#31034;&#12539;&#40665;&#31034;&#12434;&#21839;&#12431;&#12378;&#12289;&#26412;&#20316;&#21697;&#12395;&#38306;&#12375;&#12390;&#12356;&#12363;&#12394;&#12427;&#20445;&#35388;&#65288;&#29305;&#23450;&#12398;&#21033;&#29992;&#30446;&#30340;&#12408;&#12398;&#36969;&#21512;&#24615;&#12289;
&#31532;&#19977;&#32773;&#12398;&#27177;&#21033;&#12398;&#38750;&#20405;&#23475;&#12289;&#27424;&#38501;&#12398;&#19981;&#23384;&#22312;&#12434;&#21547;&#12416;&#12364;&#12289;&#12371;&#12428;&#12395;&#38480;&#12425;&#12428;&#12394;&#12356;&#12290;&#65289;&#12418;&#12375;&#12394;&#12356;&#12290;

&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#21448;&#12399;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12367;&#26412;&#20316;&#21697;&#12398;&#21033;&#29992;&#12363;&#12425;&#30330;&#29983;&#12377;&#12427;&#12289;&#12356;&#12363;&#12394;&#12427;&#25613;&#23475;&#65288;&#35377;&#35582;&#32773;&#12364;&#12289;
&#26412;&#20316;&#21697;&#12395;&#12363;&#12363;&#12427;&#33879;&#20316;&#27177;&#12289;&#33879;&#20316;&#38563;&#25509;&#27177;&#12289;&#33879;&#20316;&#32773;&#20154;&#26684;&#27177;&#12289;&#23455;&#28436;&#23478;&#20154;&#26684;&#27177;&#12289;&#21830;&#27161;&#27177;&#12289;&#12497;&#12502;&#12522;&#12471;&#12486;&#12451;&#27177;&#12289;
&#19981;&#27491;&#31478;&#20105;&#38450;&#27490;&#27861;&#12381;&#12398;&#20182;&#38306;&#36899;&#27861;&#35215;&#19978;&#20445;&#35703;&#12373;&#12428;&#12427;&#21033;&#30410;&#12434;&#26377;&#12377;&#12427;&#32773;&#12363;&#12425;&#12398;&#35377;&#35582;&#12434;&#24471;&#12427;&#12371;&#12392;&#12394;&#12367;&#26412;&#20316;&#21697;
&#12398;&#21033;&#29992;&#35377;&#35582;&#12434;&#34892;&#12387;&#12383;&#12371;&#12392;&#12395;&#12424;&#12426;&#30330;&#29983;&#12377;&#12427;&#25613;&#23475;&#12289;&#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#20405;&#23475;&#21448;&#12399;&#21517;&#35465;&#27584;&#25613;&#12363;&#12425;&#30330;&#29983;&#12377;&#12427;&#25613;
&#23475;&#31561;&#12398;&#36890;&#24120;&#25613;&#23475;&#12289;&#21450;&#12403;&#29305;&#21029;&#25613;&#23475;&#12434;&#21547;&#12416;&#12364;&#12289;&#12371;&#12428;&#12395;&#38480;&#12425;&#12394;&#12356;&#12290;&#65289;&#12395;&#12388;&#12356;&#12390;&#12418;&#12289;&#35377;&#35582;&#32773;&#12395;&#25925;&#24847;&#21448;&#12399;
&#37325;&#22823;&#12394;&#36942;&#22833;&#12364;&#12354;&#12427;&#22580;&#21512;&#12434;&#38500;&#12365;&#12289;&#35377;&#35582;&#32773;&#12364;&#12381;&#12398;&#12424;&#12358;&#12394;&#25613;&#23475;&#30330;&#29983;&#12398;&#21487;&#33021;&#24615;&#12434;&#30693;&#12425;&#12373;&#12428;&#12383;&#12363;&#21542;&#12363;&#12434;&#21839;
&#12431;&#12378;&#12289;&#35377;&#35582;&#32773;&#12399;&#12289;&#12354;&#12394;&#12383;&#12395;&#23550;&#12375;&#12289;&#12371;&#12428;&#12434;&#36064;&#20767;&#12377;&#12427;&#36012;&#20219;&#12434;&#36000;&#12431;&#12394;&#12356;&#12290; 

&#31532;7&#26465;&#12288;&#32066;&#20102;

   a. &#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#12289;&#12354;&#12394;&#12383;&#12364;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12395;&#36949;&#21453;&#12377;&#12427;&#12392;&#33258;&#21205;&#30340;&#12395;
      &#32066;&#20102;&#12377;&#12427;&#12290;&#12375;&#12363;&#12375;&#12289;&#26412;&#20316;&#21697;&#12289;&#12381;&#12398;&#20108;&#27425;&#30340;&#33879;&#20316;&#29289;&#21448;&#12399;&#32232;&#38598;&#33879;&#20316;&#29289;&#31561;&#12434;&#12354;
      &#12394;&#12383;&#12363;&#12425;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12365;&#21463;&#38936;&#12375;&#12383;&#31532;&#19977;&#32773;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#12381;&#12398;&#21463;&#38936;
      &#32773;&#12364;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12434;&#36981;&#23432;&#12375;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#32066;&#20102;&#12375;&#12394;&#12356;&#12290;
      &#31532;1&#26465;&#12289;&#31532;2&#26465;&#12289;&#31532;4&#26465;&#12363;&#12425;&#31532;9&#26465;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12364;&#32066;&#20102;&#12375;&#12390;&#12418;&#12394;&#12362;&#26377;
      &#21177;&#12395;&#23384;&#32154;&#12377;&#12427;&#12290;

   b. &#19978;&#35352;a&#12395;&#23450;&#12417;&#12427;&#22580;&#21512;&#12434;&#38500;&#12365;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12367;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;&#26412;
      &#20316;&#21697;&#12395;&#21547;&#12414;&#12428;&#12427;&#33879;&#20316;&#27177;&#27861;&#19978;&#12398;&#27177;&#21033;&#12364;&#23384;&#32154;&#12377;&#12427;&#12363;&#12366;&#12426;&#32153;&#32154;&#12377;&#12427;&#12290;

   c. &#35377;&#35582;&#32773;&#12399;&#12289;&#19978;&#35352;a&#12362;&#12424;&#12403;b&#12395;&#38306;&#12431;&#12425;&#12378;&#12289;&#12356;&#12388;&#12391;&#12418;&#12289;&#26412;&#20316;&#21697;&#12434;&#12371;&#12398;&#21033;&#29992;&#35377;
      &#35582;&#12395;&#22522;&#12389;&#12356;&#12390;&#38930;&#24067;&#12377;&#12427;&#12371;&#12392;&#12434;&#23558;&#26469;&#12395;&#21521;&#12363;&#12387;&#12390;&#20013;&#27490;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12290;
      &#12383;&#12384;&#12375;&#12289;&#35377;&#35582;&#32773;&#12364;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12367;&#38930;&#24067;&#12434;&#23558;&#26469;&#12395;&#21521;&#12363;&#12387;&#12390;&#20013;&#27490;&#12375;
      &#12383;&#22580;&#21512;&#12391;&#12418;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12356;&#12390;&#12377;&#12391;&#12395;&#26412;&#20316;&#21697;&#12434;&#21463;&#38936;&#12375;&#12383;&#21033;&#29992;&#32773;
      &#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12395;&#22522;&#12389;&#12356;&#12390;&#36942;&#21435;&#21450;&#12403;&#23558;&#26469;&#12395;&#19982;&#12360;&#12425;&#12428;&#12427;&#12356;&#12363;
      &#12394;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12418;&#32066;&#20102;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12290;&#12414;&#12383;&#12289;&#19978;&#35352;&#12395;&#12424;&#12387;&#12390;&#32066;&#20102;&#12375;&#12394;
      &#12356;&#38480;&#12426;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#12289;&#20840;&#38754;&#30340;&#12395;&#26377;&#21177;&#12394;&#12418;&#12398;&#12392;&#12375;&#12390;&#32153;&#32154;&#12377;&#12427;&#12290; 

&#31532;8&#26465;&#12288;&#12381;&#12398;&#20182;

   a. &#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#35215;&#23450;&#12364;&#12289;&#36969;&#29992;&#27861;&#12398;&#19979;&#12391;&#28961;&#21177;&#21450;&#12403;&#65295;&#21448;&#12399;&#22519;&#34892;
      &#19981;&#33021;&#12398;&#22580;&#21512;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#20182;&#12398;&#26465;&#38917;&#12398;&#26377;&#21177;&#24615;&#21450;&#12403;&#22519;&#34892;&#21487;
      &#33021;&#24615;&#12395;&#12399;&#24433;&#38911;&#12375;&#12394;&#12356;&#12290; 

   b. &#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26465;&#38917;&#12398;&#20840;&#37096;&#21448;&#12399;&#19968;&#37096;&#12398;&#25918;&#26820;&#21448;&#12399;&#12381;&#12398;&#36949;&#21453;&#12395;&#38306;&#12377;&#12427;&#25215;&#35582;
      &#12399;&#12289;&#12371;&#12428;&#12364;&#26360;&#38754;&#12395;&#12373;&#12428;&#12289;&#24403;&#35442;&#25918;&#26820;&#21448;&#12399;&#25215;&#35582;&#12395;&#36012;&#20219;&#12434;&#36000;&#12358;&#24403;&#20107;&#32773;&#12395;&#12424;&#12427;
      &#32626;&#21517;&#21448;&#12399;&#35352;&#21517;&#25276;&#21360;&#12364;&#12394;&#12373;&#12428;&#12394;&#12356;&#38480;&#12426;&#12289;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12290; 

   c. &#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#12289;&#24403;&#20107;&#32773;&#12364;&#26412;&#20316;&#21697;&#12395;&#38306;&#12375;&#12390;&#34892;&#12387;&#12383;&#26368;&#32066;&#12363;&#12388;&#21807;&#19968;&#12398;&#21512;&#24847;
      &#12398;&#20869;&#23481;&#12391;&#12354;&#12427;&#12290;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#12289;&#35377;&#35582;&#32773;&#12392;&#12354;&#12394;&#12383;&#12392;&#12398;&#30456;&#20114;&#12398;&#26360;&#38754;&#12395;&#12424;
      &#12427;&#21512;&#24847;&#12394;&#12367;&#20462;&#27491;&#12373;&#12428;&#12394;&#12356;&#12290;

   d. &#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#26085;&#26412;&#35486;&#12395;&#12424;&#12426;&#25552;&#20379;&#12373;&#12428;&#12427;&#12290;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#33521;&#35486;&#12381;&#12398;&#20182;
      &#12398;&#35328;&#35486;&#12408;&#12398;&#32763;&#35379;&#12399;&#21442;&#29031;&#12398;&#12383;&#12417;&#12398;&#12418;&#12398;&#12395;&#36942;&#12366;&#12378;&#12289;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12398;&#26085;&#26412;&#35486;
      &#29256;&#12392;&#32763;&#35379;&#12392;&#12398;&#38291;&#12395;&#20309;&#12425;&#12363;&#12398;&#40799;&#40812;&#12364;&#12354;&#12427;&#22580;&#21512;&#12395;&#12399;&#26085;&#26412;&#35486;&#29256;&#12364;&#20778;&#20808;&#12377;&#12427;&#12290;

&#31532;9&#26465;&#12288;&#28310;&#25312;&#27861;

&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#12399;&#12289;&#26085;&#26412;&#27861;&#12395;&#22522;&#12389;&#12365;&#35299;&#37320;&#12373;&#12428;&#12427;&#12290;

&#26412;&#20316;&#21697;&#12364;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12539;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#22522;&#12389;&#12365;&#21033;&#29992;&#35377;&#35582;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#20844;&#34886;&#12395;&#31034;&#12377;&#12392;
&#12356;&#12358;&#38480;&#23450;&#12373;&#12428;&#12383;&#30446;&#30340;&#12398;&#22580;&#21512;&#12434;&#38500;&#12365;&#12289;&#35377;&#35582;&#32773;&#12418;&#34987;&#35377;&#35582;&#32773;&#12418;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12398;&#20107;&#21069;&#12398;&#26360;
&#38754;&#12395;&#12424;&#12427;&#21516;&#24847;&#12394;&#12375;&#12395;&#12300;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12301;&#12398;&#21830;&#27161;&#33509;&#12375;&#12367;&#12399;&#38306;&#36899;&#21830;&#27161;&#21448;&#12399;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;
&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12398;&#12525;&#12468;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12418;&#12398;&#12392;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#12364;&#35377;&#21487;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;
&#12514;&#12531;&#12474;&#12362;&#12424;&#12403;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#65381;&#12467;&#12514;&#12531;&#12474;&#65381;&#12472;&#12515;&#12497;&#12531;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#19978;&#12395;&#20844;&#34920;&#12373;&#12428;&#12427;&#12289;&#21448;&#12399;&#12381;&#12398;&#20182;
&#38543;&#26178;&#35201;&#27714;&#12395;&#24467;&#12356;&#21033;&#29992;&#21487;&#33021;&#12392;&#12394;&#12427;&#12289;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12398;&#24403;&#35442;&#26178;&#28857;&#12395;&#12362;&#12369;&#12427;&#21830;&#27161;&#20351;&#29992;&#25351;&#37341;
&#12434;&#36981;&#23432;&#12377;&#12427;&#12418;&#12398;&#12392;&#12375;&#12414;&#12377;&#12290;&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12399; http://creativecommons.org/&#12363;&#12425;&#12289;
&#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12539;&#12467;&#12514;&#12531;&#12474;&#12539;&#12472;&#12515;&#12497;&#12531;&#12399;http: //www.creativecommons.jp/&#12363;&#12425;&#36899;&#32097;&#12377;&#12427;&#12371;&#12392;
&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;

</pre></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3599936" href="#idp3599936" class="para">49</a>] </sup>&#20803;&#12293;&#26412;&#26360;&#12399; &#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12467;&#12514;&#12531;&#12474; Attribution ShareAlike 3.0 &#12395;&#22522;&#12389;&#12356;&#12390;&#12521;&#12452;&#12475;&#12531;&#12473;&#12373;&#12428;&#12390;&#12356;&#12383;&#12364;&#12289;2009&#24180;2&#26376;17&#26085;&#29694;&#22312; &#26085;&#26412;&#12391;&#26368;&#26032;&#12392;&#12373;&#12428;&#12390;&#12356;&#12383; 2.1 &#12391;&#12418; OK &#12392;&#12398;&#35377;&#21487;&#12434;&#33879;&#32773;&#12363;&#12425;&#38914;&#12356;&#12383;&#12290;&#12424;&#12387;&#12390;&#12289;&#12371;&#12371;&#12391;&#12399; &#12496;&#12540;&#12472;&#12519;&#12531; 2.1 &#12398;&#26085;&#26412;&#35486;&#29256;&#12434;&#25522;&#36617;&#12375;&#12390;&#12356;&#12427;&#12290;<a class="ulink" href="http://creativecommons.org/licenses/by-sa/2.1/jp/" target="_top">http://creativecommons.org/licenses/by-sa/2.1/jp/</a> &#12418;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="producingoss.ja.afterwords.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> </td></tr><tr><td width="40%" align="left" valign="top">&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
