<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12463;&#12524;&#12472;&#12483;&#12488;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><link rel="prev" href="committers.html" title="&#12467;&#12511;&#12483;&#12479;&#12540;"><link rel="next" href="forks.html" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12463;&#12524;&#12472;&#12483;&#12488;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="committers.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</th><td width="20%" align="right"> <a accesskey="n" href="forks.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12463;&#12524;&#12472;&#12483;&#12488;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="credit"></a>&#12463;&#12524;&#12472;&#12483;&#12488;</h2></div></div></div><p>
    &#12463;&#12524;&#12472;&#12483;&#12488;<sup>[<a name="idp2895616" href="#ftn.idp2895616" class="footnote">35</a>]</sup> &#12399;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12395;&#12362;&#12369;&#12427;&#36890;&#36008;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#21205;&#27231;&#12364;&#20309;&#12391;&#12354;&#12428;&#12289;
    &#21311;&#21517;&#12420;&#20182;&#20154;&#12398;&#21517;&#21069;&#12391;&#20181;&#20107;&#12434;&#12375;&#12390;&#21916;&#12435;&#12391;&#12356;&#12427;&#38283;&#30330;&#32773;&#12434;&#31169;&#12399;&#30693;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12428;&#12395;&#12399;&#26126;&#30906;&#12394;&#29702;&#30001;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#23562;&#25964;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;&#12381;&#12371;&#12391;&#34892;&#20351;&#12391;&#12365;&#12427;&#24433;&#38911;&#21147;&#12434;&#12418;&#24038;&#21491;&#12375;&#12414;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#23653;&#27508;&#26360;&#12391;&#35413;&#20385;&#12377;&#12427;&#32076;&#21942;&#32773;&#12418;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#12381;&#12398;&#12371;&#12392;&#12364;&#30452;&#25509;&#12391;&#12399;&#12394;&#12356;&#12395;&#12375;&#12429;&#38283;&#30330;&#32773;&#12398;&#24066;&#22580;&#20385;&#20516;&#12395;&#21453;&#26144;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#26126;&#30906;&#12391;&#12289;&#35500;&#24471;&#21147;&#12398;&#12354;&#12427;&#29702;&#30001;&#12364;&#12418;&#12358;&#19968;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;&#20154;&#12399;&#20182;&#20154;&#12363;&#12425;&#35413;&#20385;&#12373;&#12428;&#12383;&#12356;&#12391;&#12377;&#12375;&#12289;
    &#28961;&#24847;&#35672;&#12398;&#12358;&#12385;&#12395;&#20182;&#20154;&#12364;&#33258;&#20998;&#12398;&#20181;&#20107;&#12434;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12427;&#35388;&#12434;&#27714;&#12417;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12463;&#12524;&#12472;&#12483;&#12488;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#12418;&#12387;&#12392;&#12418;&#24375;&#12356;&#21205;&#27231;&#20184;&#12369;&#12398;&#12402;&#12392;&#12388;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#23567;&#12373;&#12394;&#36002;&#29486;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#35469;&#12417;&#12390;&#12367;&#12428;&#12427;&#12392;&#12289;
    &#35469;&#12417;&#12425;&#12428;&#12383;&#20154;&#12399;&#12418;&#12387;&#12392;&#22823;&#12365;&#12394;&#36002;&#29486;&#12434;&#12377;&#12427;&#12383;&#12417;&#12395;&#25147;&#12387;&#12390;&#12367;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#20849;&#21516;&#12391;&#38283;&#30330;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;(<a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
    &#12364;&#25345;&#12388;&#37325;&#35201;&#12394;&#29305;&#24500;&#12398;&#12402;&#12392;&#12388;&#12392;&#12375;&#12390;&#12289;&#35504;&#12364;&#12356;&#12388;&#12289;
    &#20309;&#12434;&#12375;&#12383;&#12363;&#12434;&#27491;&#30906;&#12395;&#35352;&#37682;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12354;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;
    &#21487;&#33021;&#12394;&#12425;&#12356;&#12388;&#12418;&#12289;&#12371;&#12398;&#35352;&#37682;&#12434;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#36969;&#20999;&#12395;&#35352;&#12377;&#30446;&#30340;&#12395;&#20351;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12375;&#12390;&#12289;&#34892;&#12387;&#12383;&#36002;&#29486;&#12398;&#31278;&#39006;&#12434;&#26126;&#30906;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    "&#12354;&#12426;&#12364;&#12392;&#12358;&#12289;J. Random &lt;jrandom@example.com&gt;" &#12398;&#12424;&#12358;&#12394;&#26360;&#12365;&#26041;&#12399;&#12379;&#12378;&#12289;
    "&#12496;&#12464;&#22577;&#21578;&#12392;&#20877;&#29694;&#25163;&#38918;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12383; J. Random &lt;jrandom@example.com&gt;&#12289;
    &#12354;&#12426;&#12364;&#12392;&#12358;" &#12392;&#35352;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><p>
    Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#35352;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12464;&#22577;&#21578;&#12420;&#12289;
    &#35352;&#37682;&#12364;&#12394;&#12367;&#12390;&#12418;&#12467;&#12511;&#12483;&#12488;&#12525;&#12464;&#12395;&#27531;&#12387;&#12390;&#12356;&#12427;&#22577;&#21578;&#32773;&#12395;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12427;&#12420;&#12426;&#26041;&#12395;&#12388;&#12356;&#12390;&#12289;
    &#38750;&#20844;&#24335;&#12391;&#12377;&#12364;&#19968;&#36011;&#12375;&#12383;&#12509;&#12522;&#12471;&#12540;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12522;&#12499;&#12472;&#12519;&#12531; 14525 &#12414;&#12391;&#12398; Subversion &#12398;&#12467;&#12511;&#12483;&#12488;&#12525;&#12464;&#12434;&#12374;&#12387;&#12392;&#35519;&#26619;&#12375;&#12383;&#12392;&#12371;&#12429;&#12289;
    10%&#12398;&#12467;&#12511;&#12483;&#12488;&#12395;&#23550;&#12375;&#12390;&#21517;&#21069;&#12392;&#38651;&#23376;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#35352;&#37682;&#12377;&#12427;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12425;&#12428;&#12383;&#12398;&#12399;&#12289;&#12496;&#12464;&#12434;&#22577;&#21578;&#12375;&#12383;&#12426;&#12289;
    &#12381;&#12398;&#12467;&#12511;&#12483;&#12488;&#12391;&#20462;&#27491;&#12373;&#12428;&#12383;&#12496;&#12464;&#12434;&#20998;&#26512;&#12375;&#12383;&#12426;&#12375;&#12383;&#20154;&#12391;&#12354;&#12427;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#36016;&#12358;&#20154;&#12383;&#12385;&#12399;&#12289;&#23455;&#38555;&#12395;&#12467;&#12511;&#12483;&#12488;&#12434;&#34892;&#12387;&#12383;&#38283;&#30330;&#32773;&#12392;&#12399;&#36949;&#12356;&#12414;&#12377;&#12375;&#12289;
    &#38283;&#30330;&#32773;&#12398;&#21517;&#21069;&#12399;&#12356;&#12388;&#12418;&#33258;&#21205;&#30340;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#35352;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;80&#25968;&#20154;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#12358;&#12385;55&#20154;&#12364;&#12289;
    &#33258;&#36523;&#12364;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12394;&#12427;&#21069;&#12395;(&#36890;&#24120;&#12399;&#35079;&#25968;&#22238;)&#12467;&#12511;&#12483;&#12488;&#12525;&#12464;&#12391;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#36016;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#36016;&#12358;&#12371;&#12392;&#12364;&#12289;
    &#32153;&#32154;&#12375;&#12390;&#38283;&#30330;&#12395;&#21442;&#21152;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12390;&#12367;&#12428;&#12427;&#12431;&#12369;&#12391;&#12399;&#12418;&#12385;&#12429;&#12435;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#23569;&#12394;&#12367;&#12392;&#12418;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#36002;&#29486;&#12434;&#35469;&#12417;&#12427;&#12371;&#12392;&#12434;&#26399;&#24453;&#12391;&#12365;&#12427;&#38640;&#22258;&#27671;&#12434;&#20316;&#12426;&#20986;&#12377;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#36002;&#29486;&#12395;&#23550;&#12375;&#12390;&#12362;&#31036;&#12434;&#12356;&#12358;&#12371;&#12392;&#12392;&#12289;&#29305;&#21029;&#12394;&#12362;&#31036;&#12399;&#21306;&#21029;&#12377;&#12427;&#12371;&#12392;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;
    &#29305;&#23450;&#12398;&#12467;&#12540;&#12489;&#12420;&#12289;&#12467;&#12540;&#12489;&#20197;&#22806;&#12398;&#36002;&#29486;&#12434;&#35696;&#35542;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12381;&#12428;&#12425;&#12398;&#20181;&#20107;&#12395;&#23550;&#12375;&#12390;
    &#24863;&#35613;&#12398;&#24847;&#12434;&#31034;&#12377;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;"&#25105;&#12293;&#12364;&#27231;&#33021;X&#12434;&#23455;&#35013;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;
    &#12480;&#12491;&#12456;&#12523;&#12373;&#12435;&#12364;&#26368;&#36817;&#12375;&#12390;&#12367;&#12428;&#12383;&#12487;&#12523;&#12479;&#12467;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#20462;&#27491;&#12398;&#12362;&#12363;&#12370;&#12384;" &#12392;&#12356;&#12358;&#12392;&#12289;
    &#24444;&#12398;&#20181;&#20107;&#12398;&#12393;&#12398;&#20462;&#27491;&#12395;&#12388;&#12356;&#12390;&#35441;&#12375;&#12390;&#12356;&#12427;&#12363;&#12364;&#21516;&#26178;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#19968;&#26041;&#12391;&#12289;&#12480;&#12491;&#12456;&#12523;&#12395;&#21336;&#12395;&#12362;&#31036;&#12434;&#35328;&#12358;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#20986;&#12377;&#12384;&#12369;&#12391;&#12399;&#12289;&#23455;&#38555;&#12377;&#12368;&#12395;&#24441;&#12395;&#31435;&#12385;&#12414;&#12379;&#12435;&#12290;
    &#21336;&#12395;&#38651;&#23376;&#12513;&#12540;&#12523;&#12391;&#12362;&#31036;&#12434;&#35328;&#12358;&#12384;&#12369;&#12391;&#12399;&#12289;&#24773;&#22577;&#12364;&#12394;&#12395;&#12418;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12394;&#12393;&#12398;&#20181;&#32068;&#12415;&#12364;&#12289;
    &#22793;&#26356;&#12434;&#34892;&#12387;&#12383;&#20107;&#23455;&#12434;&#26082;&#12395;&#35352;&#37682;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#20309;&#12395;&#23550;&#12375;&#12390;&#12418;&#12362;&#31036;&#12434;&#36848;&#12409;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#20154;&#12293;&#12398;&#33288;&#21619;&#12364;&#20998;&#25955;&#12375;&#12390;&#12375;&#12414;&#12356;&#12289;
    &#26368;&#32066;&#30340;&#12395;&#12399;&#20385;&#20516;&#12364;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
    &#12362;&#31036;&#12399;&#26222;&#27573;&#12375;&#12390;&#12356;&#12427;&#21069;&#21521;&#12365;&#12394;&#12467;&#12513;&#12531;&#12488;&#12424;&#12426;&#30446;&#31435;&#12388;&#12411;&#12393;&#21177;&#26524;&#12364;&#22823;&#12365;&#12356;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12428;&#12399;&#12362;&#31036;&#12434;&#36848;&#12409;&#12390;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#19982;&#12360;&#12427;&#12463;&#12524;&#12472;&#12483;&#12488;&#12364;&#22810;&#12377;&#12366;&#12390;&#27946;&#27700;&#12434;&#36215;&#12371;&#12373;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#20197;&#19979;&#12395;&#31034;&#12377;&#22522;&#28310;&#12364;&#24441;&#12395;&#31435;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
          &#35696;&#35542;&#12398;&#22580;&#12364;&#30701;&#21629;&#12391;&#12354;&#12428;&#12400;&#12354;&#12427;&#12411;&#12393;&#12289;&#27671;&#36605;&#12395;&#12381;&#12398;&#22580;&#12391;&#12362;&#31036;&#12434;&#36848;&#12409;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
          &#12383;&#12392;&#12360;&#12400;&#12289;IRC&#19978;&#12398;&#20250;&#35441;&#12391;&#12496;&#12464;&#20462;&#27491;&#12395;&#23550;&#12375;&#12390;&#12362;&#31036;&#12434;&#35328;&#12358;&#12398;&#12399;&#12424;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
          &#12414;&#12383;&#12289;&#20182;&#12398;&#12488;&#12500;&#12483;&#12463;&#12395;&#12388;&#12356;&#12390;&#35441;&#12375;&#12390;&#12356;&#12427;&#38651;&#23376;&#12513;&#12540;&#12523;&#12398;&#20013;&#12391;&#12289;
          &#20313;&#35527;&#12392;&#12375;&#12390;&#12362;&#31036;&#12434;&#35328;&#12358;&#12398;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
          &#12375;&#12363;&#12375;&#12289;&#26412;&#24403;&#12395;&#12414;&#12428;&#12394;&#21151;&#32318;&#12364;&#12394;&#12356;&#38480;&#12426;&#12289;&#12362;&#31036;&#12434;&#35328;&#12358;&#12384;&#12369;&#12398;&#38651;&#23376;&#12513;&#12540;&#12523;&#12434;&#20986;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
          &#21516;&#27096;&#12395;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12398;&#12354;&#12385;&#12371;&#12385;&#12391;&#24863;&#35613;&#12398;&#35328;&#33865;&#12434;&#36848;&#12409;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
          &#12356;&#12387;&#12383;&#12435;&#12381;&#12428;&#12434;&#12420;&#12426;&#22987;&#12417;&#12427;&#12392;&#12289;&#12356;&#12388;&#12393;&#12371;&#12391;&#12420;&#12417;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#12431;&#12363;&#12425;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
          &#12381;&#12375;&#12390;&#12289;<span class="emphasis"><em>&#32118;&#23550;&#12395;</em></span> &#12467;&#12540;&#12489;&#12398;&#12467;&#12513;&#12531;&#12488;&#12391;&#12362;&#31036;&#12434;&#35328;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
          &#12467;&#12540;&#12489;&#12434;&#35501;&#12416;&#20154;&#12364;&#29702;&#35299;&#12398;&#21161;&#12369;&#12395;&#12377;&#12427;&#12289;&#12392;&#12356;&#12358;&#12467;&#12513;&#12531;&#12488;&#12398;&#31532;&#19968;&#32681;&#12434;&#25613;&#12394;&#12358;&#12384;&#12369;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
      </p></li><li class="listitem"><p>
          &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#38971;&#24230;&#12364;&#23569;&#12394;&#12356;&#20154;&#12391;&#12354;&#12428;&#12400;&#12354;&#12427;&#12411;&#12393;&#12289;
          &#12381;&#12398;&#20154;&#12395;&#23550;&#12375;&#12390;&#12362;&#31036;&#12434;&#35328;&#12358;&#12398;&#12399;&#36969;&#20999;&#12391;&#12377;&#12290;
          &#12371;&#12428;&#12399;&#30452;&#24863;&#12395;&#21453;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
          &#12362;&#31036;&#12399;&#12289;&#33258;&#20998;&#12364;&#32771;&#12360;&#12390;&#12356;&#12427;&#20197;&#19978;&#12398;&#12371;&#12392;&#12434;&#12375;&#12390;&#12367;&#12428;&#12383;&#12392;&#12365;&#12395;&#35328;&#12358;&#12418;&#12398;&#12384;&#12289;
          &#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12392;&#12424;&#12367;&#21512;&#12356;&#12414;&#12377;&#12290;
          &#12424;&#12387;&#12390;&#12289;&#26222;&#27573;&#36002;&#29486;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#20154;&#12398;&#12356;&#12388;&#12418;&#12398;&#20181;&#20107;&#12395;&#23550;&#12375;&#12390;&#38971;&#32321;&#12395;&#12362;&#31036;&#12434;&#35328;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
          &#24444;&#12425;&#12364;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12384;&#12289;
          &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
          &#12393;&#12385;&#12425;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;&#21453;&#23550;&#12398;&#12371;&#12392;&#12434;&#12354;&#12394;&#12383;&#12399;&#35328;&#12356;&#12383;&#12356;&#12399;&#12378;&#12391;&#12377;&#12424;&#12397;&#65281;
      </p><p>
          &#12371;&#12398;&#12523;&#12540;&#12523;&#12395;&#12399;&#12392;&#12365;&#12393;&#12365;&#20363;&#22806;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
          &#35504;&#12363;&#12364;&#19968;&#26178;&#30340;&#12395;&#19968;&#29983;&#25080;&#21629;&#21162;&#21147;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#24441;&#21106;&#12434;&#20840;&#12358;&#12375;&#12383;&#12392;&#12365;&#12391;&#12377;&#12290;
          &#33391;&#12356;&#20363;&#12364;&#12289;&#12522;&#12522;&#12540;&#12473;&#26178;&#12395;&#12399;&#26412;&#26684;&#30340;&#12395;&#20316;&#26989;&#12375;&#12414;&#12377;&#12364;&#12289;
          &#12381;&#12358;&#12391;&#12394;&#12356;&#12392;&#12365;&#12399;&#20241;&#30496;&#29366;&#24907; (&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12392;&#12375;&#12390;&#12399;&#20241;&#30496;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;
          &#8212; &#12381;&#12398;&#12392;&#12365;&#12399;&#27963;&#30330;&#12394;&#38283;&#30330;&#32773;&#12391;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
          &#12391;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;&#21029;&#21839;&#38988;&#12391;&#12377;) &#12398;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12391;&#12377;&#12290;
      </p></li><li class="listitem"><p>
          &#25209;&#21028;&#12377;&#12427;&#12371;&#12392;&#12420;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12392;&#21516;&#27096;&#12289;
          &#24863;&#35613;&#12398;&#24847;&#12434;&#12354;&#12425;&#12431;&#12377;&#12398;&#12399;&#29305;&#21029;&#12391;&#12354;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12354;&#12427;&#20154;&#12364;&#20553;&#22823;&#12394;&#20154;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
          &#12383;&#12384;&#12381;&#12428;&#12384;&#12369;&#12391;&#12362;&#31036;&#12434;&#36848;&#12409;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
          &#26222;&#27573;&#20197;&#19978;&#12398;&#29289;&#20107;&#12434;&#12420;&#12426;&#36930;&#12370;&#12383;&#12371;&#12392;&#12395;&#23550;&#12375;&#12390;&#12362;&#31036;&#12434;&#35328;&#12356;&#12289;
          &#12381;&#12428;&#12395;&#20184;&#12369;&#21152;&#12360;&#12390;&#12289;&#12381;&#12428;&#12434;&#12394;&#12375;&#36930;&#12370;&#12383;&#12398;&#12364;&#12394;&#12380;&#32032;&#26228;&#12425;&#12375;&#12356;&#12363;&#12434;&#36848;&#12409;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
      </p></li></ul></div><p>
    &#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20491;&#21029;&#12398;&#36002;&#29486;&#12434;&#35469;&#12417;&#12427;&#12371;&#12392;&#12301;&#12392;&#12289;
    &#12300;&#20491;&#21029;&#12398;&#36002;&#29486;&#12434;&#36062;&#36059;&#12375;&#12390;&#31309;&#12415;&#37325;&#12397;&#12378;&#12289;&#38598;&#22243;&#20840;&#20307;&#12391;&#21162;&#21147;&#12377;&#12427;&#12371;&#12392;&#12301;&#12399;&#12356;&#12388;&#12418;&#23550;&#31435;&#12377;&#12427;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#23550;&#31435;&#38306;&#20418;&#12434;&#29702;&#35299;&#12375;&#12289;&#38598;&#22243;&#12398;&#20013;&#12391;&#35430;&#34892;&#37679;&#35492;&#12377;&#12427;&#12424;&#12358;&#12395;&#12377;&#12428;&#12400;&#12289;
    &#21454;&#25342;&#12364;&#12388;&#12363;&#12394;&#12367;&#12394;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2895616" href="#idp2895616" class="para">35</a>] </sup>&#12354;&#12427;&#29289;&#20107;&#12395;&#23550;&#12377;&#12427;&#36002;&#29486;&#12434;&#26126;&#30906;&#12395;&#12377;&#12427;&#12383;&#12417;&#12289;&#36002;&#29486;&#12364;&#12354;&#12387;&#12383;&#20154;&#29289;&#12289;
    &#22243;&#20307;&#12289;&#20225;&#26989;&#31561;&#12398;&#21517;&#21069;&#12434;&#26126;&#31034;&#12377;&#12427;&#12371;&#12392;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="committers.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="forks.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12467;&#12511;&#12483;&#12479;&#12540; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;</td></tr></table></div></body></html>
