<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="publicity.html" title="&#23459;&#20253;&#12539;&#24195;&#22577;"><link rel="next" href="release-branches.html" title="&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="publicity.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="release-branches.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><div class="titlepage"><div><div><h2 class="title"><a name="development-cycle"></a>&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="development-cycle.html#release-numbering">&#12522;&#12522;&#12540;&#12473;&#12395;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;</a></span></dt><dd><dl><dt><span class="sect2"><a href="development-cycle.html#release-number-components">&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#27083;&#25104;&#35201;&#32032;</a></span></dt><dt><span class="sect2"><a href="development-cycle.html#release-number-simple-strategy">&#21336;&#32020;&#12394;&#12420;&#12426;&#26041;</a></span></dt><dt><span class="sect2"><a href="development-cycle.html#release-number-even-odd-strategy">&#22855;&#25968;/&#20598;&#25968; &#12395;&#24847;&#21619;&#12434;&#25345;&#12383;&#12379;&#12427;&#12420;&#12426;&#26041;</a></span></dt></dl></dd><dt><span class="sect1"><a href="release-branches.html">&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;</a></span></dt><dd><dl><dt><span class="sect2"><a href="release-branches.html#release-branch-mechanics">&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12398;&#20351;&#12356;&#26041;</a></span></dt></dl></dd><dt><span class="sect1"><a href="stabilizing-a-release.html">&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;</a></span></dt><dd><dl><dt><span class="sect2"><a href="stabilizing-a-release.html#release-owner">&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;</a></span></dt><dt><span class="sect2"><a href="stabilizing-a-release.html#release-voting">&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#22793;&#26356;&#12434;&#25237;&#31080;&#12391;&#27770;&#12417;&#12427;</a></span></dt><dd><dl><dt><span class="sect3"><a href="stabilizing-a-release.html#release-stabilization-collaboration">
    &#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12434;&#31649;&#29702;&#12377;&#12427;
</a></span></dt><dt><span class="sect3"><a href="stabilizing-a-release.html#release-manager">&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="packaging.html">&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;</a></span></dt><dd><dl><dt><span class="sect2"><a href="packaging.html#packaging-format">&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</a></span></dt><dt><span class="sect2"><a href="packaging.html#packaging-name-and-layout">&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12392;&#12524;&#12452;&#12450;&#12454;&#12488;</a></span></dt><dd><dl><dt><span class="sect3"><a href="packaging.html#release-capitalization">&#22823;&#25991;&#23383;&#12395;&#12377;&#12427;&#12363;&#12289;&#23567;&#25991;&#23383;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12363;</a></span></dt><dt><span class="sect3"><a href="packaging.html#release-prereleases">&#12503;&#12524;&#12522;&#12522;&#12540;&#12473;&#29256;</a></span></dt></dl></dd><dt><span class="sect2"><a href="packaging.html#packaging-build-install">&#12467;&#12531;&#12497;&#12452;&#12523;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></span></dt><dt><span class="sect2"><a href="packaging.html#binary-packages">&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;</a></span></dt></dl></dd><dt><span class="sect1"><a href="testing-and-releasing.html">&#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473;</a></span></dt><dd><dl><dt><span class="sect2"><a href="testing-and-releasing.html#candidate-releases">&#12522;&#12522;&#12540;&#12473;&#20505;&#35036;</a></span></dt><dt><span class="sect2"><a href="testing-and-releasing.html#release-announcement">&#12522;&#12522;&#12540;&#12473;&#12434;&#21578;&#30693;&#12377;&#12427;</a></span></dt></dl></dd><dt><span class="sect1"><a href="release-lines.html">&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;</a></span></dt><dd><dl><dt><span class="sect2"><a href="release-lines.html#security-releases">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;</a></span></dt></dl></dd><dt><span class="sect1"><a href="releases-and-daily-development.html">&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;</a></span></dt><dd><dl><dt><span class="sect2"><a href="releases-and-daily-development.html#planning">&#12522;&#12522;&#12540;&#12473;&#12398;&#35336;&#30011;&#12434;&#31435;&#12390;&#12427;</a></span></dt></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>
    &#12371;&#12398;&#31456;&#12391;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;&#12375;&#12390;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#26041;&#27861;&#12392;&#12289;
    &#38283;&#30330;&#12497;&#12479;&#12540;&#12531;&#20840;&#20307;&#12364;&#12371;&#12358;&#12375;&#12383;&#30446;&#27161;&#12395;&#12393;&#12358;&#32331;&#12364;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#36848;&#12409;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12398;&#20027;&#12394;&#36949;&#12356;&#12399;&#12289;
    &#38283;&#30330;&#12481;&#12540;&#12512;&#12395;&#23550;&#12375;&#12390;&#20013;&#22830;&#38598;&#27177;&#30340;&#12394;&#31649;&#29702;&#12364;&#34892;&#12394;&#12431;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12434;&#28310;&#20633;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12289;&#12371;&#12398;&#36949;&#12356;&#12399;&#29305;&#12395;&#12399;&#12387;&#12365;&#12426;&#12375;&#12414;&#12377;&#12290;
    &#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#20225;&#26989;&#12399;&#20170;&#24230;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#12363;&#12363;&#12431;&#12427;&#20316;&#26989;&#12395;&#38598;&#20013;&#12375;&#12289;
    &#26032;&#27231;&#33021;&#12398;&#38283;&#30330;&#12420;&#37325;&#22823;&#12391;&#12394;&#12356;&#12496;&#12464;&#12501;&#12451;&#12483;&#12463;&#12473;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12364;&#32066;&#12431;&#12427;&#12414;&#12391;&#33031;&#12395;&#32622;&#12356;&#12390;&#12367;&#12428;&#12392;&#38283;&#30330;&#12481;&#12540;&#12512;&#20840;&#20307;&#12395;&#27714;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38598;&#22243;&#12399;&#12381;&#12435;&#12394;&#19968;&#26522;&#23721;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20154;&#12293;&#12399;&#27096;&#12293;&#12394;&#29702;&#30001;&#12391;&#20685;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12434;&#25163;&#20253;&#12358;&#12371;&#12392;&#12395;&#33288;&#21619;&#12364;&#12394;&#12356;&#20154;&#12383;&#12385;&#12399;&#12289;
    &#12383;&#12392;&#12360;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12364;&#36914;&#34892;&#20013;&#12391;&#12418;&#26085;&#12293;&#12398;&#38283;&#30330;&#20316;&#26989;&#12434;&#32154;&#12369;&#12383;&#12356;&#12392;&#32771;&#12360;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#12364;&#27490;&#12414;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12398;&#12391;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12399;&#12289;
    &#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12381;&#12428;&#12395;&#27604;&#12409;&#12390;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12364;&#12385;&#12391;&#12377;&#12364;&#12289;
    &#28151;&#27788;&#12392;&#12375;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12428;&#12399;&#39640;&#36895;&#36947;&#36335;&#12398;&#20462;&#24489;&#12395;&#12385;&#12423;&#12387;&#12392;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#36947;&#36335;&#12434;&#30452;&#12377;&#12395;&#12399;&#20108;&#12388;&#12420;&#12426;&#26041;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12399;&#12289;&#36947;&#36335;&#20840;&#20307;&#12395;&#20316;&#26989;&#21729;&#12364;&#32676;&#12364;&#12387;&#12390;&#21839;&#38988;&#12364;&#35299;&#27770;&#12377;&#12427;&#12414;&#12391;&#20840;&#21147;&#12391;&#20685;&#12369;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#36947;&#36335;&#12434;&#23436;&#20840;&#12395;&#38281;&#37782;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;&#19968;&#24230;&#12395;&#12402;&#12392;&#12388;&#12398;&#36554;&#32218;&#12391;&#12384;&#12369;&#20316;&#26989;&#12434;&#34892;&#12356;&#12289;
    &#12418;&#12358;&#19968;&#26041;&#12399;&#36890;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12399;&#12376;&#12417;&#12398;&#12420;&#12426;&#26041;&#12399; <span class="emphasis"><em>&#20462;&#29702;&#12434;&#34892;&#12394;&#12358;&#20316;&#26989;&#21729;&#12395;&#12392;&#12387;&#12390;&#12399;</em></span> &#21177;&#29575;&#12364;&#12356;&#12356;&#12420;&#12426;&#26041;&#12391;&#12377;&#12364;&#12289;
    &#12381;&#12428;&#20197;&#22806;&#12398;&#20154;&#12395;&#12399;&#12424;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435; &#8212; &#20316;&#26989;&#12364;&#32066;&#12431;&#12427;&#12414;&#12391;&#36947;&#36335;&#20840;&#20307;&#12364;&#38281;&#37782;&#12373;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12398;&#12420;&#12426;&#26041;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12289;&#20462;&#29702;&#12377;&#12427;&#20316;&#26989;&#21729;&#12399;&#22823;&#22793;&#12391;&#12377;&#65288;&#23569;&#12394;&#12356;&#20154;&#25968;&#12289;&#23569;&#12394;&#12356;&#27231;&#26800;&#12289;
    &#31406;&#23624;&#12394;&#29872;&#22659;&#12391;&#12398;&#20316;&#26989;&#12434;&#24375;&#12356;&#12425;&#12428;&#12427;&#19978;&#12289;
    &#36890;&#34892;&#12377;&#12427;&#36554;&#12434;&#24464;&#34892;&#12373;&#12379;&#12390;&#20132;&#36890;&#25972;&#29702;&#12434;&#12377;&#12427;&#26071;&#25391;&#12426;&#24441;&#12418;&#32622;&#12363;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#12289;&#12394;&#12393;&#65289;&#12364;&#12289;
    &#20316;&#26989;&#21729;&#12364;&#20840;&#21147;&#12434;&#20986;&#12373;&#12394;&#12367;&#12390;&#12418;&#23569;&#12394;&#12367;&#12392;&#12418;&#36947;&#36335;&#12399;&#20351;&#12356;&#12420;&#12377;&#12356;&#29366;&#24907;&#12398;&#12414;&#12414;&#12391;&#12377;&#12290;
</p><p>
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12424;&#12367;&#12405;&#12383;&#12388;&#12417;&#12398;&#12420;&#12426;&#26041;&#12391;&#21205;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#23455;&#38555;&#12289;&#35079;&#25968;&#12398;&#30064;&#12394;&#12387;&#12383;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12364;&#12354;&#12427;&#29366;&#24907;&#12391;&#12289;
    &#25104;&#29087;&#12375;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12378;&#12387;&#12392;&#23567;&#35215;&#27169;&#12394;&#36947;&#36335;&#20462;&#29702;&#12434;&#32154;&#12369;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#29366;&#24907;&#12391;&#12377;&#12290;
    &#12356;&#12388;&#12418;&#20108;&#12388;&#12398;&#36554;&#32218;&#12364;&#38281;&#37782;&#12375;&#12390;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12434;&#23450;&#26399;&#30340;&#12394;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12395;&#24467;&#12387;&#12390;&#34892;&#12394;&#12360;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#38283;&#30330;&#12481;&#12540;&#12512;&#12399;&#35023;&#12391;&#36215;&#12371;&#12427;&#12373;&#12373;&#12356;&#12394;&#19981;&#37117;&#21512;&#12395;&#12399;&#12356;&#12388;&#12418;&#30446;&#12434;&#12388;&#12406;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#20316;&#26989;&#12514;&#12487;&#12523;&#12399;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#20197;&#22806;&#12395;&#12418;&#19968;&#33324;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#20114;&#12356;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12394;&#12356;&#12479;&#12473;&#12463;&#12399;&#24179;&#34892;&#12375;&#12390;&#20966;&#29702;&#12434;&#12377;&#12427;&#12392;&#12356;&#12358;&#21407;&#21063;&#12391;&#12377;&#12290;&#8212;
    &#12371;&#12428;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12395;&#38480;&#12387;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#29420;&#33258;&#12398;&#12420;&#12426;&#26041;&#12391;&#12371;&#12398;&#21407;&#21063;&#12434;&#23455;&#36341;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#36948;&#12399;&#12289;
    &#36947;&#36335;&#24037;&#20107;&#12398;&#20316;&#26989;&#21729;&#12420;&#36890;&#34892;&#12377;&#12427;&#36554;&#12434;&#27671;&#12395;&#12377;&#12427;&#20313;&#35029;&#12399;&#12381;&#12435;&#12394;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12459;&#12521;&#12540;&#12467;&#12540;&#12531;&#12398;&#20621;&#12395;&#24453;&#27231;&#12375;&#12390;&#36554;&#12395;&#26071;&#12434;&#25391;&#12425;&#12379;&#12427;&#12371;&#12392;&#12395;&#20316;&#26989;&#21729;&#12434;&#23554;&#24565;&#12373;&#12379;&#12427;&#20313;&#35029;&#12418;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#24444;&#12425;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#12398;&#36000;&#33655;&#12398;&#22793;&#21270;&#12364;&#28608;&#12375;&#12356;&#31649;&#29702;&#12503;&#12525;&#12475;&#12473;&#12424;&#12426;&#12399;&#12289;
    &#36000;&#33655;&#12364;&#19968;&#23450;&#12363;&#12289;&#22793;&#21270;&#12364;&#23569;&#12394;&#12367;&#12394;&#12427;&#12424;&#12358;&#12394;&#12503;&#12525;&#12475;&#12473;&#12434;&#22909;&#12415;&#12414;&#12377;&#12290;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12383;&#12385;&#12399;&#12289;&#12385;&#12423;&#12387;&#12392;&#19981;&#20415;&#12384;&#12394;&#12392;&#24605;&#12358;&#29366;&#24907;&#12364;&#32154;&#12356;&#12390;&#12418;&#23244;&#12364;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#33258;&#20998;&#12395;&#12363;&#12363;&#12427;&#36000;&#33655;&#12364;&#20104;&#24819;&#12391;&#12365;&#12427;&#12363;&#12425;&#12371;&#12381;&#12289;
    &#24444;&#12425;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12392;&#34909;&#31361;&#12375;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#27671;&#12395;&#12379;&#12378;&#12395;&#20316;&#26989;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21029;&#12398;&#20316;&#26989;&#12434;&#12420;&#12417;&#12390;&#12354;&#12427;&#20316;&#26989;&#12395;&#23554;&#24565;&#12373;&#12379;&#12427;&#12424;&#12358;&#12394;&#12510;&#12473;&#12479;&#12540;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12395;&#32283;&#12425;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;
    &#22810;&#12367;&#12398;&#38283;&#30330;&#32773;&#12364;&#38263;&#12356;&#38291;&#20309;&#12418;&#12375;&#12394;&#12356;&#29366;&#24907;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377; &#8212; &#12371;&#12428;&#12399;&#38750;&#21177;&#29575;&#12391;&#12354;&#12427;&#12400;&#12363;&#12426;&#12363;&#12289;
    &#36864;&#23624;&#12394;&#12398;&#12391;&#21361;&#38522;&#12391;&#12377;&#12290;&#36864;&#23624;&#12375;&#12383;&#38283;&#30330;&#32773;&#12399;&#12289;&#12377;&#12368;&#12395;&#36766;&#12417;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12399;&#12289;
    &#24179;&#34892;&#12375;&#12390;&#34892;&#12394;&#12431;&#12428;&#12427;&#20316;&#26989;&#12398;&#12394;&#12363;&#12391;&#12418;&#38283;&#30330;&#12392;&#12399;&#38306;&#20418;&#12394;&#12356;&#12418;&#12387;&#12392;&#12418;&#30446;&#31435;&#12388;&#12479;&#12473;&#12463;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#35500;&#26126;&#12377;&#12427;&#12420;&#12426;&#26041;&#12391;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12434;&#34892;&#12394;&#12358;&#12479;&#12452;&#12511;&#12531;&#12464;&#12434;&#35519;&#25972;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12392;&#24179;&#34892;&#12375;&#12390;&#34892;&#12394;&#12360;&#12427;&#20316;&#26989;&#12289;
    &#12383;&#12392;&#12360;&#12400;&#32763;&#35379;&#12420;&#22269;&#38555;&#21270;&#12289;
    &#12467;&#12540;&#12489;&#12505;&#12540;&#12473;&#20840;&#20307;&#12395;&#24464;&#12293;&#12395;&#28024;&#36879;&#12377;&#12427;&#12424;&#12358;&#12395;API&#12434;&#22823;&#35215;&#27169;&#12395;&#22793;&#26356;&#12377;&#12427;&#12289;
    &#12394;&#12393;&#12364;&#21516;&#26178;&#12395;&#34892;&#12394;&#12431;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect1" title="&#12522;&#12522;&#12540;&#12473;&#12395;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-numbering"></a>&#12522;&#12522;&#12540;&#12473;&#12395;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;</h2></div></div></div><p>
    &#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12394;&#12358;&#26041;&#27861;&#12434;&#35696;&#35542;&#12377;&#12427;&#21069;&#12395;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12395;&#23550;&#12377;&#12427;&#21517;&#21069;&#12398;&#20184;&#12369;&#26041;&#12434;&#12415;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12364;&#12518;&#12540;&#12470;&#12540;&#12395;&#12392;&#12387;&#12390;&#20309;&#12434;&#24847;&#21619;&#12377;&#12427;&#12398;&#12363;&#12434;&#30693;&#12425;&#12379;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;  
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
            &#21476;&#12356;&#12496;&#12464;&#12364;&#30452;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#20840;&#12390;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#24403;&#12390;&#12399;&#12414;&#12427;&#12392;&#22810;&#20998;&#12518;&#12540;&#12470;&#12540;&#12364;&#26399;&#24453;&#12375;&#12390;&#12356;&#12356;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
            </p></li><li class="listitem"><p>
            &#26032;&#12375;&#12356;&#12496;&#12464;&#12364;&#20837;&#12426;&#36796;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#26178;&#12293;&#34892;&#12394;&#12431;&#12428;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;(<span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span><a class="xref" href="release-lines.html#security-releases" title="&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;">&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;&#12301;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12420;&#20182;&#12398;&#21336;&#30330;&#12522;&#12522;&#12540;&#12473;&#12434;&#38500;&#12356;&#12390;&#12289;&#26222;&#36890;&#12399;&#21313;&#20998;&#36942;&#12366;&#12427;&#12411;&#12393;&#12354;&#12426;&#24471;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
            </p></li><li class="listitem"><p>
      &#26032;&#27231;&#33021;&#12364;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      </p></li><li class="listitem"><p>
      &#26032;&#12375;&#12356;&#35373;&#23450;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#36861;&#21152;&#12373;&#12428;&#12289;
      &#21476;&#12356;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#24847;&#21619;&#12364;&#24494;&#22937;&#12395;&#22793;&#12431;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      &#12354;&#12387;&#12390;&#27442;&#12375;&#12367;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
      &#30452;&#21069;&#12398;&#12522;&#12522;&#12540;&#12473;&#12392;&#27604;&#12409;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#25163;&#38918;&#12418;&#22793;&#12431;&#12387;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
      </p></li><li class="listitem"><p>
      &#20114;&#25563;&#24615;&#12398;&#12394;&#12356;&#22793;&#26356;&#12364;&#20837;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;
      &#21476;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12383;&#12487;&#12540;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#12354;&#12427;&#31278;&#12398;&#22793;&#25563;&#12434;&#65288;&#22810;&#20998;&#25163;&#21205;&#12391;&#65289;&#12375;&#12394;&#12356;&#12392;&#12418;&#12399;&#12420;&#20351;&#12360;&#12394;&#12367;&#12394;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
      </p></li></ul></div><p>
    &#35211;&#12390;&#12431;&#12363;&#12427;&#36890;&#12426;&#12289;&#20840;&#12390;&#12364;&#33391;&#12356;&#12371;&#12392;&#12400;&#12363;&#12426;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12424;&#12387;&#12390;&#32076;&#39443;&#35914;&#23500;&#12394;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12434;&#23569;&#12375;&#24656;&#12427;&#24656;&#12427;&#25201;&#12356;&#12414;&#12377;&#12290;
    &#29305;&#12395;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#25104;&#29087;&#12375;&#12390;&#12362;&#12426;&#12289;
    &#26082;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364;&#27714;&#12417;&#12383;&#65288;&#12414;&#12383;&#12399;&#27442;&#12375;&#12356;&#12392;&#24605;&#12387;&#12383;&#65289;&#21205;&#12365;&#12434;&#12411;&#12392;&#12435;&#12393;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12399;&#12394;&#12362;&#12373;&#12425;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#26032;&#27231;&#33021;&#12364;&#36861;&#21152;&#12373;&#12428;&#12390;&#12418;&#12289;
    &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#24847;&#22259;&#12375;&#12394;&#12356;&#25391;&#33310;&#12356;&#12434;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12392;&#12356;&#12358;&#28857;&#12391;&#12289;
    &#12354;&#12426;&#12364;&#12383;&#36855;&#24785;&#12394;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12424;&#12387;&#12390;&#12289;&#12522;&#12522;&#12540;&#12473;&#12395;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;&#30446;&#30340;&#12399;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#24403;&#28982;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12399;&#12522;&#12522;&#12540;&#12473;&#12398;&#38918;&#30058;&#12434;&#26126;&#30906;&#12395;&#20253;&#12360;&#12427;&#65288;i.e. &#12405;&#12383;&#12388;&#12398;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12434;&#35211;&#12428;&#12400;&#12289;
    &#12393;&#12385;&#12425;&#12364;&#26032;&#12375;&#12356;&#12418;&#12398;&#12363;&#12364;&#12431;&#12363;&#12427;&#65289;&#12409;&#12365;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12390;&#12289;
    &#22793;&#26356;&#12398;&#24615;&#36074;&#12420;&#31243;&#24230;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#31777;&#28500;&#12395;&#31034;&#12377;&#12418;&#12398;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#20840;&#37096;&#25968;&#23383;&#12391;&#34920;&#29694;&#12377;&#12427;&#12398;&#12363;&#12387;&#12390;&#65311;
    &#12414;&#12354;&#12289;&#31243;&#24230;&#12398;&#24046;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#31572;&#12360;&#12399;YES&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#20184;&#12369;&#26041;&#12399;&#12289;
    &#20123;&#32048;&#12394;&#35441;&#38988;&#12394;&#12398;&#12395;&#26368;&#12418;&#21476;&#12367;&#12363;&#12425;&#12354;&#12385;&#12371;&#12385;&#12391;&#35696;&#35542;&#12373;&#12428;&#12390;&#12365;&#12383;&#65288;<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12398; </span> <a class="xref" href="common-pitfalls.html#bikeshed" title="&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;">&#12300;&#31777;&#21336;&#12394;&#35696;&#38988;&#12411;&#12393;&#38263;&#24341;&#12367;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12418;&#12398;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12364;&#12289;
    &#36817;&#12356;&#23558;&#26469;&#12289;&#21807;&#19968;&#12398;&#23436;&#20840;&#12394;&#27161;&#28310;&#12395;&#33853;&#12385;&#30528;&#12367;&#27671;&#37197;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;<span class="emphasis"><em>&#19968;&#36011;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;</em></span> &#12392;&#12356;&#12358;&#26222;&#36941;&#30340;&#12395;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12383;&#21407;&#21063;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;
    &#20778;&#12428;&#12383;&#25126;&#30053;&#12364;&#12356;&#12367;&#12388;&#12363;&#20986;&#12390;&#12365;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#30058;&#21495;&#12398;&#20184;&#12369;&#26041;&#12434;&#36984;&#12403;&#12289;&#12381;&#12428;&#12434;&#25991;&#26360;&#21270;&#12375;&#12289;&#23432;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#30058;&#21495;&#12398;&#20184;&#12369;&#26041;&#12434;&#12399;&#12387;&#12365;&#12426;&#12373;&#12379;&#12428;&#12400;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12354;&#12394;&#12383;&#12395;&#24863;&#35613;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect2" title="&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#27083;&#25104;&#35201;&#32032;"><div class="titlepage"><div><div><h3 class="title"><a name="release-number-components"></a>&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#27083;&#25104;&#35201;&#32032;</h3></div></div></div><p>
    &#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;&#35215;&#32004;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12364;&#12289;
    &#35501;&#32773;&#12395;&#21069;&#25552;&#12392;&#12394;&#12427;&#30693;&#35672;&#12364;&#27526;&#12393;&#12394;&#12356;&#12371;&#12392;&#12434;&#24819;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#20027;&#12395;&#21442;&#32771;&#36039;&#26009;&#12392;&#12375;&#12390;&#35501;&#12414;&#12428;&#12427;&#12371;&#12392;&#12434;&#24847;&#22259;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12354;&#12394;&#12383;&#12364;&#26082;&#12395;&#12371;&#12358;&#12375;&#12383;&#35215;&#32004;&#12395;&#39348;&#26579;&#12435;&#12391;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;&#39131;&#12400;&#12375;&#12390;&#35501;&#12435;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
</p><p>&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12399;&#12489;&#12483;&#12488;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#25968;&#23383;&#12398;&#38598;&#12414;&#12426;&#12391;&#12377;&#12290;</p><div class="informalexample"><div class="literallayout"><p>Scanley 2.3<br>
Singer 5.11.4</p></div></div><p>
    ... &#12394;&#12393;&#12391;&#12377;&#12290;&#12489;&#12483;&#12488;&#12399; &#23567;&#25968;&#28857;&#12391;&#12399; <span class="emphasis"><em>&#12394;&#12367;</em></span>&#12289;
    &#21336;&#12394;&#12427;&#21306;&#20999;&#12426;&#12391;&#12377;&#12290;"5.3.9" &#12398;&#27425;&#12399; "5.3.10" &#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12489;&#12483;&#12488;&#12434;&#23567;&#25968;&#28857;&#12392;&#12392;&#12375;&#12390;&#12354;&#12425;&#12431;&#12377;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#26377;&#21517;&#12394; Linux Kernel &#12391;&#12399;&#12289;Linux 1.0 &#12395;&#33267;&#12427;&#12414;&#12391;&#12395;&#12289;
    "0.95", "0.96" ... "0.99" &#12392;&#30058;&#21495;&#12364;&#32154;&#12365;&#12414;&#12377;&#12364;&#12289;
    &#12489;&#12483;&#12488;&#12364;&#23567;&#25968;&#28857;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#35215;&#32004;&#12399;&#20170;&#12420;&#30906;&#22266;&#12392;&#12375;&#12383;&#12418;&#12398;&#12392;&#12375;&#12390;&#30906;&#31435;&#12373;&#12428;&#12289;
    &#27161;&#28310;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12398;&#27083;&#25104;&#35201;&#32032;&#65288;&#12489;&#12483;&#12488;&#12434;&#38500;&#12356;&#12383;&#25968;&#23383;&#12398;&#37096;&#20998;&#65289;&#12398;&#25968;&#12395;&#21046;&#38480;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#27526;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;3&#12388;&#12363;4&#12388;&#12395;&#12392;&#12393;&#12417;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#29702;&#30001;&#12399;&#24460;&#12395;&#26126;&#12425;&#12363;&#12395;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#25968;&#23383;&#12398;&#37096;&#20998;&#12395;&#21152;&#12360;&#12390;&#12289;
    "Alpha" &#12392;&#12363; "Beta"&#65288;<a class="xref" href="getting-started.html#alpha-and-beta" title="&#12450;&#12523;&#12501;&#12449;&#29256;/&#12505;&#12540;&#12479;&#29256;">&#12450;&#12523;&#12501;&#12449;&#29256;/&#12505;&#12540;&#12479;&#29256;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289; &#12392;&#12356;&#12387;&#12383;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#29366;&#24907;&#12434;&#35500;&#26126;&#12377;&#12427;&#12521;&#12505;&#12523;&#12434;&#20184;&#21152;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><div class="informalexample"><div class="literallayout"><p>Scanley 2.3.0 (Alpha)<br>
Singer 5.11.4 (Beta)</p></div></div><p>
    Alpha &#12420; Beta &#12392;&#12356;&#12387;&#12383;&#35672;&#21029;&#23376;&#12399;&#12289;
    &#21516;&#12376;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12394;&#12364;&#12425;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#35672;&#21029;&#23376;&#12364;&#12388;&#12363;&#12394;&#12356;&#12418;&#12398;&#12364;&#23558;&#26469;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;"2.3.0 (Alpha)" &#12399;&#32080;&#23616; "2.3.0" &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12424;&#12358;&#12395;&#12289;&#35079;&#25968;&#12398;&#26368;&#32066;&#12522;&#12522;&#12540;&#12473;&#12398;&#20505;&#35036;&#12392;&#12394;&#12427;&#12418;&#12398;&#12434;&#19968;&#34892;&#12391;&#12354;&#12425;&#12431;&#12377;&#12383;&#12417;&#12395;&#12289;
    &#35672;&#21029;&#23376;&#12381;&#12398;&#12418;&#12398;&#12364; &#12513;&#12479;&#35672;&#21029;&#23376; &#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#20363;&#12392;&#12375;&#12390;&#12289;&#19968;&#33324;&#12398;&#20154;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12414;&#12391;&#12398;&#38918;&#30058;&#12391;&#12289;
    &#19968;&#36899;&#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#20197;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;
</p><div class="informalexample"><div class="literallayout"><p>Scanley 2.3.0 (Alpha 1)<br>
Scanley 2.3.0 (Alpha 2)<br>
Scanley 2.3.0 (Beta 1)<br>
Scanley 2.3.0 (Beta 2)<br>
Scanley 2.3.0 (Beta 3)<br>
Scanley 2.3.0</p></div></div><p>
    "Alpha" &#12392;&#12356;&#12358;&#35672;&#21029;&#23376;&#12364;&#12388;&#12356;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12289;
    Scanley "2.3" &#12399; "2.3.0" &#12392;&#35352;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    "2.3" &#12392; "2.3.0" &#12399;&#31561;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290; &#8212;
    &#12388;&#12414;&#12426;&#12289;&#30058;&#21495;&#12395;&#12367;&#12387;&#12388;&#12356;&#12390;&#12356;&#12427;&#12476;&#12525;&#12398;&#37096;&#20998;&#12399;&#31777;&#28500;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12356;&#12388;&#12391;&#12418;&#30465;&#30053;&#12391;&#12365;&#12414;&#12377;&#12290;&#8212;
    &#12375;&#12363;&#12375;&#12289;&#35672;&#21029;&#23376;&#12364;&#12354;&#12427;&#12392;&#12365;&#12399;&#12289;&#31777;&#28500;&#12373;&#12399;&#12418;&#12399;&#12420;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12424;&#12387;&#12390;&#12289;"2.3" &#12392;&#12356;&#12358;&#31777;&#28500;&#12394;&#35352;&#36848;&#12391;&#12399;&#12394;&#12367;&#12289;"2.3.0" &#12392;&#23436;&#20840;&#12394;&#24418;&#12391;&#34920;&#35352;&#12377;&#12427;&#26041;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#27604;&#36611;&#30340;&#12424;&#12367;&#20351;&#12431;&#12428;&#12427;&#20182;&#12398;&#35672;&#21029;&#23376;&#12395;&#12399; "Stable", "Unstable",
    "Development", &#12381;&#12375;&#12390; "RC"&#65288;&#12522;&#12522;&#12540;&#12473;&#20505;&#35036; &#12392;&#12356;&#12358;&#24847;&#21619;&#65289;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12399; &#26410;&#12384; "Alpha" &#12392; "Beta" &#12391;&#12289;
    "RC" &#12364;3&#30058;&#30446;&#12354;&#12383;&#12426;&#12398;&#20301;&#32622;&#12395;&#12365;&#12414;&#12377;&#12364;&#12289;
    "RC" &#12398;&#24460;&#12395;&#12399;&#24120;&#12395;&#25968;&#23383;&#12398;&#12513;&#12479;&#20462;&#39166;&#23376;&#12364;&#20184;&#12367;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12388;&#12414;&#12426;&#12289;"Scanley 2.3.0 (RC)" &#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    "Scanley 2.3.0 (RC 1)" &#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12390;&#12363;&#12425; RC2 &#12434;&#12289;&#12392;&#12356;&#12358;&#20855;&#21512;&#12391;&#12377;&#12290;
</p><p>
    "Alpha", "Beta", "RC" &#12392;&#12356;&#12358;3&#12388;&#12398;&#12521;&#12505;&#12523;&#12399;&#20170;&#12420;&#24195;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#12383;&#12392;&#12360;&#20182;&#12398;&#12521;&#12505;&#12523;&#12364;&#12289;&#20869;&#36650;&#12398;&#29992;&#35486;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#26222;&#36890;&#12398;&#29992;&#35486;&#12384;&#12363;&#12425;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#19968;&#35211;&#12424;&#12356;&#36984;&#25246;&#12398;&#12424;&#12358;&#12395;&#35211;&#12360;&#12390;&#12418;&#12289;
    &#20182;&#12398;&#12521;&#12505;&#12523;&#12434;&#20351;&#12358;&#12398;&#12399;&#12362;&#34214;&#12417;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#20154;&#12293;&#12399;&#12371;&#12398;3&#12388;&#12398;&#12521;&#12505;&#12523;&#12395;&#26082;&#12395;&#39348;&#26579;&#12435;&#12391;&#12356;&#12414;&#12377;&#12375;&#12289;
    &#26681;&#25312;&#28961;&#12375;&#12395;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12392;&#36949;&#12387;&#12383;&#12371;&#12392;&#12434;&#12377;&#12427;&#29702;&#30001;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12395;&#12354;&#12427;&#12489;&#12483;&#12488;&#12399;&#23567;&#25968;&#28857;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#25968;&#23383;&#12398;&#20301;&#32622;&#12395;&#12399;&#37325;&#35201;&#12394;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531; "1.0"&#65288;&#12371;&#12428;&#12399;&#12418;&#12385;&#12429;&#12435;&#12289;"1.0.0" &#12392;&#31561;&#12375;&#12356;&#12391;&#12377;&#65289; &#12424;&#12426;&#21069;&#12398;&#12522;&#12522;&#12540;&#12473;&#12399;&#20840;&#12390; "0.X.Y" &#12392;&#12356;&#12358;&#12522;&#12522;&#12540;&#12473;&#12391;&#12377;&#12290;
    "3.14.158" &#12398;&#12377;&#12368;&#24460;&#12399;&#12289;"3.14.159" &#12391;&#12354;&#12387;&#12390;&#12289;
    "3.14.160" &#12420;&#12289;"3.15.XXXXXX" &#12394;&#12393;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;&#19968;&#36011;&#12375;&#12383;&#27770;&#12414;&#12426;&#12364;&#12354;&#12428;&#12400;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#21516;&#12376;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12405;&#12383;&#12388;&#12398;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12434;&#35211;&#12390;&#12289;
    &#25968;&#23383;&#12384;&#12369;&#12391;&#12405;&#12383;&#12388;&#12398;&#37325;&#35201;&#12394;&#36949;&#12356;&#12434;&#21306;&#21029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    3&#12388;&#12398;&#25968;&#23383;&#12363;&#12425;&#12394;&#12427;&#20856;&#22411;&#30340;&#12394;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12391;&#12399;&#12289;
    &#12399;&#12376;&#12417;&#12398;&#25968;&#23383;&#12399; <em class="firstterm">&#12513;&#12472;&#12515;&#12540;&#30058;&#21495;</em>&#12289;
    &#12405;&#12383;&#12388;&#12417;&#12399; <em class="firstterm">&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;</em>&#12289;
    &#12381;&#12375;&#12390;&#19977;&#12388;&#12417;&#12399; <em class="firstterm">&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;</em> &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; "2.10.17" &#12399; 2&#30058;&#30446;&#12398;&#12513;&#12472;&#12515;&#12540;&#12522;&#12522;&#12540;&#12473;&#12471;&#12522;&#12540;&#12474;&#12398;&#12358;&#12385;&#12289;
    10&#30058;&#30446;&#12398;&#12510;&#12452;&#12490;&#12540;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12391;&#12354;&#12426;&#12289;
    &#12381;&#12398;&#12521;&#12452;&#12531;&#19978;&#12391;&#12398;17&#30058;&#30446;&#12398;&#12522;&#12522;&#12540;&#12473;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    "&#12521;&#12452;&#12531;" &#12392; "&#12471;&#12522;&#12540;&#12474;" &#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#12289;&#12371;&#12371;&#12391;&#12399;&#12367;&#12384;&#12369;&#12383;&#20351;&#12356;&#26041;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#25991;&#23383;&#36890;&#12426;&#12398;&#24847;&#21619;&#12391;&#12377;&#12290;&#12513;&#12472;&#12515;&#12540;&#12471;&#12522;&#12540;&#12474;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;
    &#21336;&#12395;&#21516;&#12376;&#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12434;&#20849;&#26377;&#12377;&#12427;&#12522;&#12522;&#12540;&#12473;&#20840;&#12390;&#12434;&#25351;&#12375;&#12289;
    &#12510;&#12452;&#12490;&#12540;&#12471;&#12522;&#12540;&#12474;&#65288;&#12414;&#12383;&#12399;&#12510;&#12452;&#12490;&#12540;&#12521;&#12452;&#12531;&#65289;&#12399;&#12289;
    &#21516;&#12376;&#12513;&#12472;&#12515;&#12540;&#30058;&#21495; <span class="emphasis"><em>&#12392;</em></span> &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#20849;&#26377;&#12377;&#12427;&#20840;&#12390;&#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;"2.4.0" &#12392; "3.4.1" &#12399; "4" &#12392;&#12356;&#12358;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12399;&#21516;&#12376;&#12391;&#12377;&#12364;&#12289;
    &#21516;&#12376;&#12510;&#12452;&#12490;&#12540;&#12471;&#12522;&#12540;&#12474;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#19968;&#26041;&#12289;"2.4.0" &#12392; "2.4.2" &#12399; &#12289;
    "2.4.1" &#12364;&#12381;&#12428;&#12425;&#12398;&#38291;&#12395;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#12399;&#38563;&#12426;&#21512;&#12358;&#12522;&#12522;&#12540;&#12473;&#12395;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#21516;&#12376;&#12510;&#12452;&#12490;&#12540;&#12471;&#12522;&#12540;&#12474;&#12395;&#23646;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12428;&#12425;&#12398;&#25968;&#23383;&#12398;&#24847;&#21619;&#12399;&#12289;&#12354;&#12394;&#12383;&#12364;&#26399;&#24453;&#12377;&#12427;&#36890;&#12426;&#12398;&#24847;&#21619;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12377;&#12371;&#12392;&#12399;&#12289;&#22823;&#12365;&#12394;&#22793;&#26356;&#12364;&#34892;&#12431;&#12428;&#12383;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12377;&#12371;&#12392;&#12399;&#12289;&#23567;&#12373;&#12394;&#22793;&#26356;&#12364;&#34892;&#12431;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12377;&#12371;&#12392;&#12399;&#12289;
    &#26412;&#24403;&#12395;&#12388;&#12414;&#12425;&#12394;&#12356;&#22793;&#26356;&#12364;&#34892;&#12431;&#12428;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#29305;&#12395;&#12522;&#12522;&#12540;&#12473;&#38291;&#12398;&#36949;&#12356;&#12434;&#12365;&#12417;&#32048;&#12363;&#12367;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
    <em class="firstterm">&#12497;&#12483;&#12481;&#30058;&#21495;</em> &#12392;&#36890;&#24120;&#21628;&#12400;&#12428;&#12427;4&#30058;&#30446;&#12398;&#30058;&#21495;&#12434;&#36861;&#21152;&#12375;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#65288;&#28151;&#20081;&#12375;&#12420;&#12377;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;"&#12497;&#12483;&#12481;&#30058;&#21495;" &#12434;&#12289;
    3&#30058;&#30446;&#12398;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12392;&#21516;&#12376;&#24847;&#21619;&#12391;&#29992;&#12356;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#65289;
    &#26368;&#24460;&#12398;&#25968;&#23383;&#12434; <em class="firstterm">&#12499;&#12523;&#12489;&#30058;&#21495;</em> &#12392;&#12375;&#12390;&#29992;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12499;&#12523;&#12489;&#30058;&#21495;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12499;&#12523;&#12489;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;&#12402;&#12392;&#12388;&#22679;&#12360;&#12390;&#12356;&#12365;&#12289;
    &#12499;&#12523;&#12489;&#20197;&#22806;&#12398;&#22793;&#26356;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#12354;&#12425;&#12431;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12499;&#12523;&#12489;&#30058;&#21495;&#12399;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12434;&#29305;&#23450;&#12398;&#12499;&#12523;&#12489;&#30058;&#21495;&#12395;&#32080;&#12403;&#12388;&#12369;&#12427;&#12398;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12375;&#12289;
    &#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#36890;&#24120;&#37197;&#24067;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12289;&#24656;&#12425;&#12367;&#12418;&#12387;&#12392;&#12418;&#24441;&#12395;&#31435;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12356;&#12367;&#12388;&#25968;&#23383;&#12434;&#20351;&#12358;&#12398;&#12363;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#25968;&#23383;&#12364;&#20309;&#12434;&#24847;&#21619;&#12377;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#22810;&#12367;&#12398;&#30064;&#12394;&#12427;&#35215;&#32004;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12381;&#12398;&#36949;&#12356;&#12398;&#22810;&#12367;&#12399;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#8212; &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12395;&#12388;&#12356;&#12390;&#12399;&#35009;&#37327;&#12398;&#20313;&#22320;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12381;&#12358;&#22810;&#12367;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#27425;&#12398;2&#12388;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;
    &#12418;&#12387;&#12392;&#12418;&#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#35215;&#32004;&#12398;&#12358;&#12385;&#12289;&#12356;&#12367;&#12388;&#12363;&#12434;&#35696;&#35542;&#12375;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#21336;&#32020;&#12394;&#12420;&#12426;&#26041;"><div class="titlepage"><div><div><h3 class="title"><a name="release-number-simple-strategy"></a>&#21336;&#32020;&#12394;&#12420;&#12426;&#26041;</h3></div></div></div><p>
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#12383;&#12392;&#12360;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12377;&#12384;&#12369;&#12398;&#22580;&#21512;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
    &#12393;&#12435;&#12394;&#20462;&#27491;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12363;&#12395;&#12388;&#12356;&#12390;&#12398;&#12523;&#12540;&#12523;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#22679;&#12420;&#12377;&#22580;&#21512;&#12395;&#12399;&#12414;&#12383;&#36949;&#12387;&#12383;&#12523;&#12540;&#12523;&#12364;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12434;&#22679;&#12420;&#12377;&#22580;&#21512;&#12399;&#12373;&#12425;&#12395;&#12523;&#12540;&#12523;&#12364;&#36949;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#12523;&#12540;&#12523;&#12395;&#27770;&#12414;&#12387;&#12383;&#22522;&#28310;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#35079;&#25968;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12358;&#12414;&#12367;&#20351;&#12431;&#12428;&#12390;&#12365;&#12383;&#12523;&#12540;&#12523;&#12434;&#12371;&#12371;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12371;&#12398;&#12523;&#12540;&#12523;&#12434;&#21336;&#32020;&#12395;&#25505;&#29992;&#12375;&#12390;&#12418;&#12424;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12383;&#12392;&#12360;&#12381;&#12358;&#12375;&#12394;&#12367;&#12390;&#12418;&#12289;&#12371;&#12428;&#12399;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12364;&#20253;&#12360;&#12427;&#24773;&#22577;&#12434;&#12358;&#12414;&#12367;&#34920;&#29694;&#12377;&#12427;&#35211;&#26412;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12523;&#12540;&#12523;&#12399;&#12289;APR&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    <a class="ulink" href="http://apr.apache.org/versioning.html" target="_top">http://apr.apache.org/versioning.html</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
                &#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12384;&#12369;&#12395;&#24433;&#38911;&#12377;&#12427;&#65288;&#12388;&#12414;&#12426;&#12289;
                &#21516;&#12376;&#12510;&#12452;&#12490;&#12540;&#12521;&#12452;&#12531;&#19978;&#12391;&#34892;&#12358;&#65289;&#22793;&#26356;&#12399;&#12289;
                &#21069;&#26041;&#20114;&#25563;&#24615;&#12392;&#24460;&#26041;&#20114;&#25563;&#24615;&#12398;&#20001;&#26041;&#12364;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
                &#12388;&#12414;&#12426;&#12289;&#22793;&#26356;&#12399;&#12496;&#12464;&#20462;&#27491;&#12398;&#12415;&#12363;&#12289;
                &#26082;&#12395;&#12354;&#12427;&#27231;&#33021;&#12395;&#23550;&#12377;&#12427;&#12431;&#12378;&#12363;&#12394;&#25913;&#21892;&#12395;&#12392;&#12393;&#12417;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
                &#26032;&#27231;&#33021;&#12399;&#12289;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12435;&#12391;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
            </p></li><li class="listitem"><p>
                &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12395;&#24433;&#38911;&#12377;&#12427;&#65288;&#12388;&#12414;&#12426;&#12289;
                &#21516;&#12376;&#12513;&#12472;&#12515;&#12540;&#12521;&#12452;&#12531;&#12391;&#34892;&#12358;&#65289;&#22793;&#26356;&#12395;&#12399;&#12289;
                &#24460;&#26041;&#20114;&#25563;&#24615;&#12364;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#21069;&#26041;&#20114;&#25563;&#24615;&#12399;&#24517;&#12378;&#12375;&#12418;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#12289;
                &#26032;&#27231;&#33021;&#12434;&#21462;&#12426;&#36796;&#12416;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12364;&#12289;
                &#19968;&#24230;&#12395;&#12383;&#12367;&#12373;&#12435;&#21462;&#12426;&#36796;&#12435;&#12384;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
            </p></li><li class="listitem"><p>
                &#20114;&#25563;&#24615;&#12434;&#32173;&#25345;&#12377;&#12427;&#12395;&#12399;&#38480;&#24230;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                &#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12395;&#24433;&#38911;&#12377;&#12427;&#22793;&#26356;&#12364;&#12381;&#12398;&#22659;&#30446;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
                &#26032;&#12375;&#12356;&#12513;&#12472;&#12515;&#12540;&#12522;&#12522;&#12540;&#12473;&#12395;&#12399;&#21069;&#26041;&#20114;&#25563;&#24615;&#12418;&#24460;&#26041;&#20114;&#25563;&#24615;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                &#12513;&#12472;&#12515;&#12540;&#12522;&#12522;&#12540;&#12473;&#12395;&#12399;&#26032;&#27231;&#33021;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12364;&#12289;
                &#20840;&#12390;&#12398;&#27231;&#33021;&#12364;&#26032;&#12375;&#12367;&#12394;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12373;&#12360;&#12354;&#12426;&#12414;&#12377;&#12290;
            </p></li></ol></div><p>
    <em class="firstterm">&#24460;&#26041;&#20114;&#25563;&#24615;</em> &#12392; <em class="firstterm">&#21069;&#26041;&#20114;&#25563;&#24615;</em> &#12398;&#27491;&#30906;&#12394;&#24847;&#21619;&#12399;&#12289;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#23455;&#29694;&#12377;&#12427;&#12371;&#12392;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12364;&#12289;&#35299;&#37320;&#12398;&#20313;&#22320;&#12364;&#12394;&#12356;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;/&#12469;&#12540;&#12496; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20316;&#12387;&#12390;&#12356;&#12427;&#12392;&#12377;&#12427;&#12392;&#12289;
    "&#24460;&#26041;&#20114;&#25563;&#24615;" &#12392;&#12399;&#12289;&#12469;&#12540;&#12496;&#12434; 2.6.0 &#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12390;&#12418;
    &#26082;&#12395;&#12354;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531; 2.5.4 &#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20197;&#21069;&#12392;&#30064;&#12394;&#12427;&#25391;&#33310;&#12356;&#65288;&#12418;&#12385;&#12429;&#12435;&#12496;&#12464;&#12434;&#30452;&#12375;&#12383;&#22580;&#21512;&#12399;&#21029;&#12391;&#12377;&#65289;&#12434;&#12375;&#12383;&#12426;&#12289;
    &#21205;&#12363;&#12394;&#12367;&#12394;&#12427;&#27231;&#33021;&#12364;&#12354;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12289;&#12469;&#12540;&#12496;&#12434; 2.6.0 &#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12418;2.6.0&#12395;&#12377;&#12427;&#12392;&#12289;
    <span class="emphasis"><em>&#26032;&#12375;&#12356;</em></span> &#27231;&#33021;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    2.5.4&#12391;&#20351;&#12360;&#12390;&#12356;&#12383;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#27231;&#33021;&#12399; 2.6.0 &#12391;&#12393;&#12358;&#25201;&#12431;&#12428;&#12427;&#12363;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#12371;&#12392;&#12364;&#36215;&#12371;&#12427;&#12392;&#12289;&#12371;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12395;&#12399; &#21069;&#26041;&#20114;&#25563;&#24615;&#12364; <span class="emphasis"><em>&#12394;&#12356;</em></span> &#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434; 2.5.4 &#12395;&#12480;&#12454;&#12531;&#12464;&#12524;&#12540;&#12489;&#12375;&#12390;&#12418;&#12289;
    2.6.0 &#12391;&#20351;&#12360;&#12390;&#12356;&#12383;&#20840;&#12390;&#12398;&#27231;&#33021;&#12399;&#20351;&#12360;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;2.6.0 &#12398;&#27231;&#33021;&#12395;&#12399;&#26032;&#27231;&#33021;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12356;&#12358;&#12431;&#12369;&#12391;&#12289;&#12510;&#12452;&#12463;&#12525;&#12522;&#12522;&#12540;&#12473;&#12399;&#26412;&#26469;&#12496;&#12464;&#12501;&#12451;&#12483;&#12463;&#12473;&#12398;&#12383;&#12417;&#12384;&#12369;&#12395;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
    &#12510;&#12452;&#12463;&#12525;&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#21069;&#26041;&#12289;&#24460;&#26041;&#20114;&#25563;&#24615;&#12398;&#20001;&#26041;&#12434;&#32173;&#25345;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12388;&#12414;&#12426;&#12289;2.5.3 &#12363;&#12425; 2.5.4 &#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12383;&#12354;&#12392;&#12391;&#27671;&#12364;&#22793;&#12431;&#12387;&#12390; 2.5.3 &#12395;&#25147;&#12375;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#29305;&#23450;&#12398;&#27231;&#33021;&#12364;&#22833;&#12431;&#12428;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;2.5.4 &#12391;&#30452;&#12375;&#12383;&#12496;&#12464;&#12399;&#12480;&#12454;&#12531;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12392;&#12414;&#12383;&#20877;&#29694;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    &#12381;&#12398;&#12496;&#12464;&#12364;&#12354;&#12387;&#12390;&#12418;&#26082;&#12395;&#21205;&#12356;&#12390;&#12356;&#12427;&#27231;&#33021;&#12364;&#20351;&#12360;&#12390;&#12356;&#12428;&#12400;&#12289;
    &#27231;&#33021;&#12364;&#22833;&#12431;&#12428;&#12383;&#12371;&#12392;&#12395;&#12399;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;/&#12469;&#12540;&#12496; &#38291;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;&#12289;
    &#20114;&#25563;&#24615;&#12398;&#21839;&#38988;&#12364;&#36215;&#12365;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#20998;&#37326;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
    &#21029;&#12398;&#20998;&#37326;&#12392;&#12375;&#12390;&#12289;&#12487;&#12540;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12487;&#12540;&#12479;&#12434;&#27704;&#32154;&#30340;&#12394;&#12473;&#12488;&#12524;&#12540;&#12472;&#12395;&#20445;&#23384;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
    &#12418;&#12375;&#12381;&#12358;&#12394;&#12425;&#12289;&#35501;&#12415;&#26360;&#12365;&#12434;&#34892;&#12358;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#12523;&#12540;&#12523;&#12391;&#27770;&#12414;&#12387;&#12390;&#12356;&#12427;&#20114;&#25563;&#24615;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#24467;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531; 2.6.0 &#12399; 2.5.4 &#12364;&#20445;&#23384;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#36796;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    2.5.4 &#12364;&#35501;&#12417;&#12394;&#12356;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#40665;&#12387;&#12390;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#12414;&#12383;&#12364;&#12427;&#12392;&#12480;&#12454;&#12531;&#12464;&#12524;&#12540;&#12489;&#12391;&#12365;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20182;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#37197;&#24067;&#12375;&#12390;&#12356;&#12427;&#12392;&#12377;&#12427;&#12392;&#12289;
    &#12381;&#12398; API &#12418;&#20114;&#25563;&#24615;&#12398;&#21839;&#38988;&#12364;&#36215;&#12371;&#12427;&#38936;&#22495;&#12395;&#20837;&#12426;&#12414;&#12377;&#12290;
    &#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#21476;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#32622;&#12365;&#25563;&#12360;&#12427;&#24418;&#12391;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12390;&#12418;&#23433;&#20840;&#12363;&#12393;&#12358;&#12363;&#12289;
    &#35443;&#12375;&#12356;&#12518;&#12540;&#12470;&#12540;&#12364;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12477;&#12540;&#12473;&#12289;&#12496;&#12452;&#12490;&#12522;&#12524;&#12505;&#12523;&#12391;&#12398;&#20114;&#25563;&#24615;&#12395;&#38306;&#12377;&#12427;&#12523;&#12540;&#12523;&#12434;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#35443;&#12375;&#12356;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434;&#12415;&#12428;&#12400;&#20114;&#25563;&#24615;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12364;&#12377;&#12368;&#12395;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12398;&#12375;&#12367;&#12415;&#12391;&#12399;&#12289;&#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12434;&#22679;&#12420;&#12377;&#12414;&#12391;&#36942;&#21435;&#12398;&#12375;&#12364;&#12425;&#12415;&#12394;&#12375;&#12395;&#20877;&#20986;&#30330;&#12377;&#12427;&#27231;&#20250;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#12383;&#12417;&#19981;&#20415;&#12394;&#29366;&#27841;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12383;&#12403;&#12383;&#12403;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#33258;&#20998;&#12364;&#26412;&#24403;&#12395;&#36861;&#21152;&#12375;&#12383;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#26032;&#27231;&#33021;&#12364;&#12354;&#12387;&#12383;&#12426;&#12289;
    &#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20877;&#35373;&#35336;&#12375;&#12383;&#12356;&#12392;&#24605;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#20114;&#25563;&#24615;&#12434;&#32173;&#25345;&#12375;&#12390;&#12356;&#12427;&#38291;&#12399;&#12381;&#12358;&#31777;&#21336;&#12395;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#26368;&#21021;&#12363;&#12425;&#25313;&#24373;&#21487;&#33021;&#12394;&#26041;&#27861;&#12391;&#35373;&#35336;&#12377;&#12427;&#12371;&#12392;&#65288;&#12371;&#12398;&#12488;&#12500;&#12483;&#12463;&#12395;&#38306;&#12375;&#12390;&#12399;&#19968;&#20874;&#26412;&#12434;&#26360;&#12367;&#20385;&#20516;&#12364;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#12371;&#12398;&#26412;&#12398;&#31684;&#22258;&#22806;&#12391;&#12375;&#12423;&#12358;&#65289;&#20197;&#22806;&#12395;&#12289;&#12371;&#12398;&#21839;&#38988;&#12395;&#23550;&#12377;&#12427;&#39764;&#27861;&#12398;&#35299;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12522;&#12522;&#12540;&#12473;&#38291;&#12398;&#20114;&#25563;&#24615;&#12395;&#38306;&#12377;&#12427;&#12523;&#12540;&#12523;&#12434;&#31034;&#12375;&#12289;
    &#12381;&#12428;&#12434;&#23432;&#12427;&#12371;&#12392;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#37197;&#24067;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#19981;&#21487;&#27424;&#12391;&#12377;&#12290;
    &#19981;&#24841;&#24555;&#12394;&#24605;&#12356;&#12434;&#19968;&#24230;&#12373;&#12379;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#22810;&#12367;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#38626;&#12428;&#12390;&#12356;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12371;&#12414;&#12391;&#35500;&#26126;&#12375;&#12390;&#12365;&#12383;&#20114;&#25563;&#24615;&#12395;&#38306;&#12377;&#12427;&#12523;&#12540;&#12523;&#12399;&#12289;
    &#24195;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12414;&#12384;&#12381;&#12358;&#12356;&#12387;&#12383;&#12523;&#12540;&#12523;&#12395;&#39348;&#26579;&#12415;&#12364;&#12394;&#12356;&#20154;&#12395;&#12418;&#35500;&#26126;&#12375;&#12420;&#12377;&#12367;&#12289;
    &#35226;&#12360;&#12390;&#12418;&#12425;&#12356;&#12420;&#12377;&#12356;&#12392;&#12356;&#12358;&#28857;&#12391;&#20778;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#20114;&#25563;&#24615;&#12395;&#38306;&#12377;&#12427;&#12523;&#12540;&#12523;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#20197;&#21069;&#12395;&#12399;&#36969;&#29992;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12364;&#19968;&#33324;&#12395;&#30693;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#65288;&#12375;&#12363;&#12375;&#12289;&#12399;&#12387;&#12365;&#12426;&#12373;&#12379;&#12390;&#12362;&#12367;&#12383;&#12417;&#12395;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12509;&#12522;&#12471;&#12540;&#12391;&#12399;&#12371;&#12398;&#12371;&#12392;&#12434;&#26126;&#31034;&#30340;&#12395;&#23459;&#35328;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#65289;
    &#38283;&#30330;&#12398;&#21021;&#26399;&#27573;&#38542;&#12395;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289; &#12496;&#12540;&#12472;&#12519;&#12531; 0.1, 0.2, 0.3 &#12392;&#12356;&#12387;&#12383;&#38918;&#12391;&#12289;
    1.0 &#12398;&#28310;&#20633;&#12364;&#12391;&#12365;&#12427;&#12414;&#12391;&#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#38291;&#12398;&#36949;&#12356;&#12434;&#36969;&#23452;&#22823;&#12365;&#12367;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#20197;&#21069;&#12399;&#12289;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12434;&#20351;&#12358;&#12363;&#12393;&#12358;&#12363;&#12399;&#20219;&#24847;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24615;&#36074;&#12392;&#12522;&#12522;&#12540;&#12473;&#38291;&#12398;&#24046;&#30064;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
    0.1.0, 0.1.1 &#12392;&#12356;&#12387;&#12383;&#30058;&#21495;&#12364;&#12354;&#12428;&#12400;&#20415;&#21033;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12375;&#12289;&#12381;&#12358;&#12391;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#20197;&#21069;&#12398;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#12523;&#12540;&#12523;&#12399;&#12363;&#12394;&#12426;&#12523;&#12540;&#12474;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#20114;&#25563;&#24615;&#12395;&#38306;&#12377;&#12427;&#21046;&#32004;&#12434;&#12365;&#12388;&#12367;&#12377;&#12427;&#12392;&#21021;&#26399;&#27573;&#38542;&#12398;&#38283;&#30330;&#12434;&#33879;&#12375;&#12367;&#22952;&#12370;&#12427;&#12371;&#12392;&#12392;&#12289;
    &#26089;&#12367;&#12363;&#12425;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12399;&#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#23515;&#22823;&#12394;&#20670;&#21521;&#12395;&#12354;&#12427;&#12371;&#12392;&#12364;&#20027;&#12394;&#29702;&#30001;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#21046;&#32004;&#12399;&#12289;&#65299;&#12388;&#12398;&#25968;&#23383;&#12434;&#20351;&#12387;&#12383;&#30058;&#21495;&#12398;&#20184;&#12369;&#26041;&#12395;&#12384;&#12369;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#65299;&#12388;&#12398;&#25968;&#23383;&#12434;&#20351;&#12387;&#12390;&#12289;
    &#12371;&#12428;&#12392;&#12399;&#36949;&#12387;&#12383;&#30058;&#21495;&#12398;&#20184;&#12369;&#26041;&#12434;&#31777;&#21336;&#12395;&#24605;&#12356;&#20184;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12418;&#12375;&#12367;&#12399;&#12289;&#32048;&#12363;&#12356;&#31890;&#24230;&#12399;&#24517;&#35201;&#12394;&#12356;&#12398;&#12391;&#12289;
    &#20195;&#12431;&#12426;&#12395;&#65298;&#12388;&#12398;&#30058;&#21495;&#12434;&#20351;&#12362;&#12358;&#12392;&#27770;&#12417;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12371;&#12358;&#12356;&#12358;&#12371;&#12392;&#12399;&#26089;&#12417;&#12395;&#27770;&#12417;&#12390;&#12362;&#12356;&#12390;&#12289;
    &#12381;&#12428;&#12382;&#12428;&#12398;&#25968;&#23383;&#12364;&#24847;&#21619;&#12377;&#12427;&#12392;&#12371;&#12429;&#12434;&#27491;&#30906;&#12395;&#30342;&#12395;&#30693;&#12425;&#12379;&#12289;&#12381;&#12428;&#12434;&#23432;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#22855;&#25968;/&#20598;&#25968; &#12395;&#24847;&#21619;&#12434;&#25345;&#12383;&#12379;&#12427;&#12420;&#12426;&#26041;"><div class="titlepage"><div><div><h3 class="title"><a name="release-number-even-odd-strategy"></a>&#22855;&#25968;/&#20598;&#25968; &#12395;&#24847;&#21619;&#12434;&#25345;&#12383;&#12379;&#12427;&#12420;&#12426;&#26041;</h3></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
    &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12398; &#20598;&#25968;/&#22855;&#25968; &#12434;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#23433;&#23450;&#24230;&#12434;&#31034;&#12377;&#12383;&#12417;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#20598;&#25968;&#12399;&#23433;&#23450;&#29256;&#12391;&#12289;&#22855;&#25968;&#12399;&#19981;&#23433;&#23450;&#29256;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12395;&#12398;&#12415;&#24403;&#12390;&#12399;&#12414;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12392;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12395;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12377;&#12371;&#12392;&#12399;&#12289;
    &#12496;&#12464;&#12501;&#12451;&#12483;&#12463;&#12473;&#12364;&#34892;&#12431;&#12428;&#12383;&#65288;&#26032;&#27231;&#33021;&#12399;&#12394;&#12356;&#65289;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12375;&#12289;
    &#12513;&#12472;&#12515;&#12540;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12377;&#12371;&#12392;&#12399;&#12289;
    &#22823;&#12365;&#12394;&#22793;&#26356;&#12364;&#34892;&#12431;&#12428;&#12383;&#12363;&#12289;&#26032;&#27231;&#33021;&#12364;&#25539;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#12354;&#12425;&#12431;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#25968;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20013;&#12391;&#12418;&#12289;
    &#29305;&#12395; Linux Kernel &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#12431;&#12428;&#12390;&#12365;&#12383;&#12371;&#12398;&#20181;&#32068;&#12415;&#12398;&#21033;&#28857;&#12399;&#12289;
    &#35069;&#21697;&#29256;&#12434;&#20351;&#12358;&#12518;&#12540;&#12470;&#12540;&#12364;&#28508;&#22312;&#30340;&#12395;&#19981;&#23433;&#23450;&#12394;&#12467;&#12540;&#12489;&#12398;&#24433;&#38911;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12394;&#12367;&#12289;
    &#26032;&#12375;&#12356;&#27231;&#33021;&#12434;&#12486;&#12473;&#12488;&#29992;&#12395;&#12522;&#12522;&#12540;&#12473;&#12391;&#12365;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12363;&#12425;&#12289;
    "2.4.21" &#12399;&#29694;&#22312;&#21205;&#12356;&#12390;&#12356;&#12427;Web&#12469;&#12540;&#12496;&#12398;&#12510;&#12471;&#12531;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12356;&#12356;&#12364;&#12289;
    "2.5.1" &#12399;&#22810;&#20998;&#23478;&#12398;&#12527;&#12540;&#12463;&#12473;&#12486;&#12540;&#12471;&#12519;&#12531;&#12398;&#23455;&#39443;&#29992;&#12395;&#38480;&#12427;&#12409;&#12365;&#12384;&#12429;&#12358;&#12289;
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#12481;&#12540;&#12512;&#12399;&#19981;&#23433;&#23450;&#29256;&#65288;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12364;&#22855;&#25968;&#12398;&#12418;&#12398;&#65289;&#12395;&#38306;&#12377;&#12427;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12434;&#25201;&#12356;&#12289;
    &#19981;&#23433;&#23450;&#29256;&#12391;&#12356;&#12367;&#12388;&#12363;&#12398;&#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#37325;&#12397;&#12390;&#23433;&#23450;&#12375;&#12390;&#12365;&#12383;&#12425;&#12289;
    &#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#12402;&#12392;&#12388;&#22679;&#12420;&#12375;&#65288;&#12388;&#12414;&#12426;&#12289;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12434;&#20598;&#25968;&#12395;&#12375;&#12414;&#12377;&#65289;&#12289;
    &#12510;&#12452;&#12463;&#12525;&#30058;&#21495;&#12434; "0" &#12395;&#12522;&#12475;&#12483;&#12488;&#12375;&#12414;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#24656;&#12425;&#12367;&#12399;&#12289;&#23433;&#23450;&#29256;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12390;&#12356;&#12367;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12398;&#20181;&#32068;&#12415;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#12289;&#20197;&#21069;&#35500;&#26126;&#12375;&#12383;&#20114;&#25563;&#24615;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12392;&#34909;&#31361;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12395;&#12356;&#12367;&#12425;&#12363;&#36861;&#21152;&#24773;&#22577;&#12434;&#20184;&#21152;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#20182;&#12398;&#20181;&#32068;&#12415;&#12424;&#12426;&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12364;&#12402;&#12392;&#12388;&#22679;&#12360;&#12427;&#22238;&#25968;&#12364;&#65298;&#20493;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#22823;&#12365;&#12394;&#23475;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#22855;&#25968;/&#20598;&#25968;&#12395;&#24847;&#21619;&#12434;&#25345;&#12383;&#12379;&#12427;&#20181;&#32068;&#12415;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12469;&#12452;&#12463;&#12523;&#12364;&#12392;&#12390;&#12418;&#38263;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12387;&#12392;&#12418;&#26377;&#21177;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24615;&#36074;&#19978;&#12289;
    &#26032;&#27231;&#33021;&#12424;&#12426;&#12418;&#23433;&#23450;&#24615;&#12395;&#37325;&#12365;&#12434;&#32622;&#12367;&#20445;&#23432;&#30340;&#12394;&#12518;&#12540;&#12470;&#12540;&#12398;&#21106;&#21512;&#12364;&#39640;&#12356;&#12392;&#12371;&#12429;&#12391;&#12418;&#26377;&#21177;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#20181;&#32068;&#12415;&#12364;&#12289;&#26032;&#27231;&#33021;&#12434;&#22823;&#32966;&#12395;&#12486;&#12473;&#12488;&#12377;&#12427;&#21807;&#19968;&#12398;&#26041;&#27861;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    <span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span> <a class="xref" href="stabilizing-a-release.html" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12301;</a> &#12391;&#12418;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#28508;&#22312;&#30340;&#12395;&#19981;&#23433;&#23450;&#12394;&#12467;&#12540;&#12489;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12418;&#12387;&#12392;&#19968;&#33324;&#30340;&#12394;&#26041;&#27861;&#12399;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#12522;&#12473;&#12463;&#12392;&#21033;&#30410;&#12398;&#12488;&#12524;&#12540;&#12489;&#12458;&#12501;&#12434;&#12522;&#12522;&#12540;&#12473;&#21517;&#12363;&#12425;&#12377;&#12368;&#12395;&#25226;&#25569;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12395;&#12510;&#12540;&#12463;&#12434;&#20184;&#12369;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="publicity.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="release-branches.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#23459;&#20253;&#12539;&#24195;&#22577; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;</td></tr></table></div></body></html>
