<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;"><link rel="prev" href="common-pitfalls.html" title="&#38501;&#12426;&#12364;&#12385;&#12394;&#32608;"><link rel="next" href="growth.html" title="&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="common-pitfalls.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</th><td width="20%" align="right"> <a accesskey="n" href="growth.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="difficult-people"></a>&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;</h2></div></div></div><p>
  &#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;&#12395;&#23550;&#12375;&#12390;&#38651;&#23376;&#20250;&#35696;&#23460;&#19978;&#12391;&#23550;&#24540;&#12377;&#12427;&#12398;&#12399;&#12289;
  &#38754;&#12392;&#21521;&#12363;&#12387;&#12390;&#23550;&#24540;&#12377;&#12427;&#12371;&#12392;&#12395;&#27604;&#12409;&#12390;&#22810;&#23569;&#38627;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#35328;&#12358; "&#25201;&#12356;&#12395;&#12367;&#12356;" &#12392;&#12399; "&#22833;&#31036;&#12394;" &#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#30906;&#12363;&#12395;&#22833;&#31036;&#12394;&#20154;&#12383;&#12385;&#12399;&#19981;&#24555;&#12394;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;&#24444;&#12425;&#12364;&#24517;&#12378;&#12375;&#12418;&#25201;&#12356;&#12395;&#12367;&#12356;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26412;&#26360;&#12391;&#12399;&#12289;&#12377;&#12391;&#12395;&#22833;&#31036;&#12394;&#20154;&#12383;&#12385;&#12408;&#12398;&#23550;&#20966;&#27861;&#12399;&#35500;&#26126;&#28168;&#12415;&#12391;&#12377;&#12290;
  &#12392;&#12426;&#12354;&#12360;&#12378;&#19968;&#35328;&#25351;&#25688;&#12375;&#12383;&#12354;&#12392;&#12399;&#12289;&#12381;&#12398;&#12414;&#12414;&#28961;&#35222;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12289;
  &#20309;&#20107;&#12418;&#12394;&#12363;&#12387;&#12383;&#12363;&#12398;&#12424;&#12358;&#12395;&#20182;&#12398;&#20154;&#12383;&#12385;&#12392;&#21516;&#12376;&#12424;&#12358;&#25509;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12391;&#12418;&#24444;&#12425;&#12364;&#22833;&#31036;&#12394;&#25391;&#12427;&#33310;&#12356;&#12434;&#32154;&#12369;&#12427;&#12424;&#12358;&#12394;&#12425;&#12289;
  &#24444;&#12425;&#12399;&#12365;&#12387;&#12392;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35504;&#12395;&#12418;&#35211;&#21521;&#12365;&#12418;&#12373;&#12428;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#33258;&#26989;&#33258;&#24471;&#12391;&#12377;&#12290;
</p><p>
  &#26412;&#24403;&#12395;&#12420;&#12387;&#12363;&#12356;&#12394;&#12398;&#12399;&#12289;&#12354;&#12363;&#12425;&#12373;&#12414;&#12395;&#22833;&#31036;&#12394;&#24907;&#24230;&#12391;&#12354;&#12427;&#12392;&#12399;&#12356;&#12360;&#12394;&#12356;&#12364;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36914;&#12415;&#20855;&#21512;&#12395;&#24746;&#24433;&#38911;&#12434;&#19982;&#12360;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#20182;&#12398;&#20154;&#12383;&#12385;&#12398;&#26178;&#38291;&#12420;&#21172;&#21147;&#12434;&#20313;&#35336;&#12395;&#36027;&#12420;&#12373;&#12379;&#12427;&#12384;&#12369;&#12391;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20309;&#12398;&#21033;&#30410;&#12418;&#12418;&#12383;&#12425;&#12375;&#12414;&#12379;&#12435;
  <sup>[<a name="idp1954432" href="#ftn.idp1954432" class="footnote">26</a>]</sup>&#12290;
</p><p>
  &#12381;&#12358;&#12356;&#12387;&#12383;&#20154;&#12383;&#12385;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36914;&#12417;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#35201;&#12392;&#12394;&#12427;&#31623;&#25152;&#12434;&#25506;&#12375;&#12390;&#12399;
  &#12381;&#12371;&#12391;&#33258;&#20998;&#12398;&#24433;&#38911;&#21147;&#12434;&#35463;&#31034;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#34892;&#12356;&#12399;&#12289;&#21336;&#12395;&#22833;&#31036;&#12391;&#12354;&#12427;&#12384;&#12369;&#12398;&#20154;&#12424;&#12426;&#12424;&#12387;&#12413;&#12393;&#27833;&#26029;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12398;&#25391;&#12427;&#33310;&#12356;&#12384;&#12369;&#12391;&#12394;&#12367;&#12381;&#12428;&#12395;&#12424;&#12427;&#34987;&#23475;&#12418;&#26126;&#30333;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#34892;&#12356;&#12398;&#20856;&#22411;&#30340;&#12394;&#20363;&#12399;&#12289;&#12356;&#12431;&#12422;&#12427;&#35696;&#20107;&#36914;&#34892;&#22952;&#23475;&#12391;&#12377;&#12290;
  &#36914;&#34892;&#20013;&#12398;&#35696;&#38988;&#12395;&#12388;&#12356;&#12390;&#12289;&#35504;&#12363;&#12364; (&#12356;&#12363;&#12395;&#12418;&#12418;&#12387;&#12392;&#12418;&#12425;&#12375;&#12367;&#32862;&#12371;&#12360;&#12427;&#12424;&#12358;&#12395;)
  &#12300;&#12414;&#12384;&#32080;&#35542;&#12399;&#35211;&#12360;&#12390;&#12356;&#12394;&#12356;&#12290;&#12418;&#12387;&#12392;&#21029;&#12398;&#35299;&#27770;&#31574;&#12418;&#26908;&#35342;&#12375;&#12390;&#12415;&#12427;&#12409;&#12365;&#12384;&#12290;
  &#36949;&#12358;&#35222;&#28857;&#12363;&#12425;&#35211;&#30452;&#12375;&#12390;&#12415;&#12427;&#12398;&#12418;&#12356;&#12356;&#12301;&#12392;&#12356;&#12387;&#12383;&#24847;&#35211;&#12434;&#36848;&#12409;&#12427;&#12364;&#12289;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12399;&#26082;&#12395;&#12411;&#12412;&#21512;&#24847;&#12364;&#12392;&#12428;&#12390;&#12356;&#12427;&#12363;&#12354;&#12427;&#12356;&#12399;&#25505;&#27770;&#12434;&#12392;&#12427;&#28310;&#20633;&#12364;&#12391;&#12365;&#12390;&#12356;&#12427;&#12392;&#12356;&#12387;&#12383;&#29366;&#27841;&#12391;&#12377;&#12290;
  &#21029;&#12398;&#20363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12394;&#12363;&#12394;&#12363;&#21512;&#24847;&#12364;&#24471;&#12425;&#12428;&#12394;&#12356;&#35696;&#35542;&#12395;&#12362;&#12356;&#12390;&#12289;
  &#12300;&#12414;&#12378;&#12399;&#12362;&#20114;&#12356;&#12398;&#24847;&#35211;&#12398;&#19981;&#19968;&#33268;&#12434;&#30906;&#35469;&#12375;&#12390;&#12371;&#12428;&#12414;&#12391;&#12398;&#35696;&#35542;&#12398;&#12414;&#12392;&#12417;&#12434;&#20316;&#25104;&#12375;&#12424;&#12358;&#12301;
  &#12392;&#12356;&#12358;&#27969;&#12428;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12414;&#12392;&#12417;&#12434;&#20316;&#25104;&#12375;&#12383;&#32080;&#26524;&#12289;&#33258;&#20998;&#12364;&#27671;&#12395;&#20837;&#12425;&#12394;&#12356;&#26041;&#21521;&#12395;&#36914;&#12416;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;
  &#12414;&#12392;&#12417;&#12398;&#20316;&#25104;&#20316;&#26989;&#12373;&#12360;&#12418;&#37034;&#39764;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#22949;&#24403;&#12394;&#25552;&#26696;&#12395;&#23550;&#12375;&#12390;&#12356;&#12385;&#12356;&#12385;&#21453;&#23550;&#12375;&#12383;&#12426;&#12289;
  &#35504;&#12418;&#21916;&#12400;&#12394;&#12356;&#12424;&#12358;&#12394;&#26032;&#12383;&#12394;&#35441;&#38988;&#12434;&#25345;&#12385;&#20986;&#12375;&#12383;&#12426;&#12394;&#12393;&#12392;&#12356;&#12387;&#12383;&#25163;&#27573;&#12391;&#31896;&#30528;&#12375;&#12390;&#12367;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;&#12408;&#12398;&#23550;&#24540;"><div class="titlepage"><div><div><h3 class="title"><a name="handling-difficult-people"></a>&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;&#12408;&#12398;&#23550;&#24540;</h3></div></div></div><p>
  &#12371;&#12435;&#12394;&#25391;&#12427;&#33310;&#12356;&#12395;&#23550;&#25239;&#12377;&#12427;&#12395;&#12399;&#12289;
  &#20309;&#12364;&#24444;&#12425;&#12434;&#12381;&#12358;&#12373;&#12379;&#12427;&#12398;&#12363;&#12434;&#29702;&#35299;&#12377;&#12427;&#12371;&#12392;&#12364;&#21161;&#12369;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#12289;&#24847;&#35672;&#12375;&#12390;&#12381;&#12398;&#12424;&#12358;&#12395;&#25391;&#33310;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#27598;&#26397;&#36215;&#12365;&#12383;&#12392;&#12365;&#12395;&#12300;&#12373;&#12354;&#12289;&#20170;&#26085;&#12418;&#26012;&#12395;&#27083;&#12360;&#12390;&#35696;&#35542;&#12434;&#12363;&#12365;&#20081;&#12375;&#12289;
  &#12415;&#12435;&#12394;&#12434;&#12356;&#12425;&#12356;&#12425;&#12373;&#12379;&#12390;&#12420;&#12429;&#12358;&#12301;&#12392;&#32771;&#12360;&#12427;&#20154;&#12394;&#12435;&#12390;&#12356;&#12414;&#12379;&#12435;&#12424;&#12397;&#12290;
  &#12381;&#12435;&#12394;&#34892;&#21205;&#12395;&#24444;&#12425;&#12434;&#23566;&#12367;&#12398;&#12399;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12399;
  &#12300;&#33258;&#20998;&#12399;&#12371;&#12398;&#12464;&#12523;&#12540;&#12503;&#12391;&#12398;&#35696;&#35542;&#12420;&#24847;&#24605;&#27770;&#23450;&#12398;&#38555;&#12395;&#20210;&#38291;&#12399;&#12378;&#12428;&#12395;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12301;
  &#12392;&#12356;&#12358;&#34987;&#23475;&#22916;&#24819;&#12391;&#12377;&#12290;&#24444;&#12425;&#12399;&#33258;&#20998;&#12364;&#12394;&#12356;&#12364;&#12375;&#12429;&#12395;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#24863;&#12376;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#12356;&#12399; (&#12418;&#12387;&#12392;&#28145;&#21051;&#12394;&#22580;&#21512;&#12399;) &#33258;&#20998;&#12384;&#12369;&#12434;&#12398;&#12369;&#12418;&#12398;&#12395;&#12375;&#12390;
  &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12384;&#12369;&#12391;&#20309;&#12363;&#12434;&#12375;&#12424;&#12358;&#12392;&#12383;&#12367;&#12425;&#12435;&#12391;&#12356;&#12427;&#12392;&#24863;&#12376;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#24863;&#12376;&#12390;&#12356;&#12427;&#24444;&#12395;&#12392;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36914;&#34892;&#12395;&#21475;&#12434;&#12399;&#12373;&#12435;&#12391;
  <span class="emphasis"><em>&#20309;&#12392;&#12363;</em></span> &#33258;&#20998;&#12398;&#12411;&#12358;&#12395;&#30446;&#12434;&#21521;&#12369;&#12390;&#12418;&#12425;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;
  &#23436;&#20840;&#12395;&#27491;&#24403;&#12394;&#25391;&#12427;&#33310;&#12356;&#12391;&#12377;&#12290;&#26997;&#31471;&#12394;&#22580;&#21512;&#12399;&#12289;&#24444;&#12399;
  &#12300;&#33258;&#20998;&#12364;&#25126;&#12431;&#12394;&#12365;&#12419;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12480;&#12513;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12301;&#12392;&#24605;&#12356;&#36796;&#12435;&#12391;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12371;&#12358;&#12356;&#12387;&#12383;&#25915;&#25731;&#12399;&#12289;&#12381;&#12398;&#24615;&#36074;&#19978;&#12415;&#12435;&#12394;&#12364;&#19968;&#25993;&#12395;&#27671;&#12389;&#12367;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20154;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#26126;&#30333;&#12394;&#35388;&#25312;&#12364;&#12354;&#12425;&#12431;&#12428;&#12427;&#12414;&#12391;&#12381;&#12428;&#12434;&#35469;&#12417;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#25915;&#25731;&#12434;&#20309;&#12392;&#12363;&#21454;&#12417;&#12427;&#12398;&#12399;&#12381;&#12428;&#12394;&#12426;&#12398;&#20316;&#26989;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20309;&#12363;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12392;&#33258;&#20998;&#12364;&#27671;&#12389;&#12367;&#12384;&#12369;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12289;
  &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12434;&#32013;&#24471;&#12373;&#12379;&#12427;&#12384;&#12369;&#12398;&#35388;&#25312;&#12434;&#29992;&#24847;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#35388;&#25312;&#12434;&#31034;&#12377;&#38555;&#12395;&#12399;&#21313;&#20998;&#12394;&#27880;&#24847;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
</p><p>
  &#25126;&#12358;&#12384;&#12369;&#12398;&#20313;&#21147;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;&#12392;&#12426;&#12354;&#12360;&#12378;&#12399;&#12375;&#12400;&#12425;&#12367;&#35211;&#36942;&#12372;&#12375;&#12390;&#12362;&#12367;&#12398;&#12364;&#24471;&#31574;&#12391;&#12377;&#12290;
  &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#24863;&#26579;&#24615;&#12398;&#30149;&#27671;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12392;&#12425;&#12360;&#12425;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26997;&#31471;&#12395;&#34928;&#24369;&#12375;&#12390;&#12356;&#12394;&#12356;&#38480;&#12426;&#12289;
  &#30149;&#27671;&#12395;&#24863;&#26579;&#12375;&#12390;&#12418;&#12394;&#12435;&#12392;&#12363;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#19979;&#25163;&#12395;&#34220;&#12395;&#38972;&#12427;&#12392;&#12289;&#20309;&#12425;&#12363;&#12398;&#21103;&#20316;&#29992;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#28961;&#35222;&#12391;&#12365;&#12394;&#12356;&#31243;&#24230;&#12398;&#34987;&#23475;&#12364;&#20986;&#22987;&#12417;&#12383;&#12425;&#12289;&#12381;&#12428;&#12364;&#21205;&#12365;&#20986;&#12377;&#12392;&#12365;&#12391;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#30446;&#12395;&#12375;&#12390;&#12356;&#12427;&#29366;&#27841;&#12434;&#12375;&#12387;&#12363;&#12426;&#26360;&#12365;&#30041;&#12417;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#20844;&#38283;&#12375;&#12390;&#12356;&#12427;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#21442;&#29031;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12398;&#12383;&#12417;&#12395;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27963;&#21205;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#22823;&#20999;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12424;&#12356;&#25163;&#12364;&#12363;&#12426;&#12364;&#35211;&#12388;&#12363;&#12387;&#12383;&#12425;&#12289;
  &#27425;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#20491;&#20154;&#30340;&#12394;&#35441;&#12375;&#21512;&#12356;&#12434;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12392;&#12365;&#12395;&#12300;&#12371;&#12435;&#12394;&#39080;&#12395;&#24863;&#12376;&#12427;&#12435;&#12384;&#12369;&#12393;&#8230;&#8230;&#12301;&#12392;&#35441;&#12377;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#12414;&#12378;
  &#12300;&#26368;&#36817;&#20309;&#12363;&#24863;&#12376;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#65311;&#12301;&#12392;&#12356;&#12358;&#12424;&#12358;&#12395;&#21839;&#12356;&#12363;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12488;&#12521;&#12502;&#12523;&#12513;&#12540;&#12459;&#12540;&#12398;&#34892;&#12356;&#12395;&#12388;&#12356;&#12390;&#20182;&#20154;&#12364;&#12393;&#12358;&#24605;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#32862;&#12369;&#12427;&#12398;&#12399;&#12289;
  &#12371;&#12428;&#12364;&#26368;&#24460;&#12398;&#12481;&#12515;&#12531;&#12473;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12356;&#12387;&#12383;&#12435;&#12488;&#12521;&#12502;&#12523;&#12398;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#35441;&#12375;&#22987;&#12417;&#12427;&#12392;
  &#12393;&#12358;&#12375;&#12390;&#12418;&#30456;&#25163;&#12398;&#24847;&#35211;&#12399;&#22793;&#21270;&#12375;&#12390;&#12375;&#12414;&#12356;&#12289;
  &#12418;&#12392;&#12418;&#12392;&#12393;&#12358;&#32771;&#12360;&#12390;&#12356;&#12383;&#12398;&#12363;&#12434;&#24605;&#12356;&#20986;&#12379;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#20491;&#20154;&#30340;&#12394;&#35441;&#12375;&#21512;&#12356;&#12398;&#32080;&#26524;&#12289;
  &#21516;&#12376;&#12424;&#12358;&#12394;&#21839;&#38988;&#12434;&#24863;&#12376;&#12390;&#12356;&#12427;&#20154;&#12364;&#23569;&#12394;&#12363;&#12425;&#12378;&#12356;&#12427;&#12392;&#12431;&#12363;&#12387;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12429;&#12381;&#12429;&#20309;&#12363;&#34892;&#21205;&#12434;&#12362;&#12371;&#12377;&#12392;&#12365;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12392;&#12365;&#12399; <span class="emphasis"><em>&#12411;&#12435;&#12392;&#12358;&#12395;</em></span> &#29992;&#24515;&#28145;&#12367;&#12394;&#12425;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#25163;&#12398;&#12488;&#12521;&#12502;&#12523;&#12513;&#12540;&#12459;&#12540;&#12399;&#12289;&#12375;&#12400;&#12375;&#12400;&#12300;&#33258;&#20998;&#12364;&#19981;&#24403;&#12395;&#12356;&#12376;&#12417;&#12425;&#12428;&#12390;&#12356;&#12427;&#12301;
  &#12392;&#24605;&#12356;&#36796;&#12435;&#12391;&#12375;&#12414;&#12356;&#12364;&#12385;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;&#20309;&#12434;&#12377;&#12427;&#12395;&#12375;&#12390;&#12418;&#12289;
  &#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21205;&#12365;&#12434;&#25925;&#24847;&#12395;&#22952;&#23475;&#12375;&#12390;&#12356;&#12427;&#12301;&#12300;&#34987;&#23475;&#22916;&#24819;&#12395;&#38501;&#12387;&#12390;&#12356;&#12427;&#12301;
  &#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#20182;&#12354;&#12394;&#12383;&#12364;&#30097;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#20107;&#23455;&#12391;&#12354;&#12427;&#12392;&#27770;&#12417;&#20184;&#12369;&#12390;&#36012;&#12417;&#12383;&#12426;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#26368;&#32066;&#30340;&#12394;&#30446;&#27161;&#12399;&#12289;&#12418;&#12387;&#12392;&#22949;&#24403;&#12394;&#12418;&#12398;&#12391;
  &#12363;&#12388;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12398;&#21033;&#30410;&#12398;&#12383;&#12417;&#12395;&#12394;&#12427;&#12418;&#12398;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12425;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#25913;&#12417;&#12373;&#12379;&#12427;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#36861;&#12356;&#20986;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12290;
  &#26368;&#32066;&#30340;&#12395;&#12399;&#12393;&#12385;&#12425;&#12363;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12392;&#20182;&#12398;&#38283;&#30330;&#32773;&#12383;&#12385;&#12392;&#12398;&#38306;&#20418;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
  &#20107;&#21069;&#12395;&#20491;&#21029;&#12395;&#25163;&#12434;&#32068;&#12435;&#12391;&#20849;&#21516;&#12391;&#36012;&#12417;&#12390;&#12356;&#12367;&#12371;&#12392;&#12418;&#26377;&#21177;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12384;&#12289;&#12381;&#12428;&#12364;&#35023;&#30446;&#12395;&#20986;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#35023;&#12391;&#12371;&#12381;&#12371;&#12381;&#12392;&#20309;&#12363;&#12434;&#12375;&#12390;&#20013;&#20663;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#12392;&#12425;&#12428;&#12383;&#12425;&#12289;
  &#12354;&#12414;&#12426;&#12424;&#12367;&#24605;&#12431;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12383;&#12392;&#12360;&#12414;&#12378;&#12356;&#34892;&#21205;&#12434;&#12375;&#12383;&#12398;&#12364;&#25163;&#12434;&#32068;&#12435;&#12384;&#30456;&#25163;&#12398;&#12411;&#12358;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#35328;&#12356;&#20986;&#12375;&#12383;&#12398;&#12364;&#12354;&#12394;&#12383;&#12391;&#12354;&#12427;&#20197;&#19978;&#12289;&#21608;&#12426;&#12363;&#12425;&#35211;&#12428;&#12400;&#12414;&#12378;&#12356;&#34892;&#21205;&#12434;&#12375;&#12383;&#12398;&#12399;
  <span class="emphasis"><em>&#12354;&#12394;&#12383;</em></span> &#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#33258;&#20998;&#12398;&#12356;&#12356;&#12383;&#12356;&#12371;&#12392;&#12434;&#31034;&#12377;&#20363;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#38598;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#12420;&#12373;&#12375;&#12367;&#32051;&#22763;&#30340;&#12395;&#35500;&#24471;&#12377;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#21839;&#38988;&#12398;&#24403;&#20107;&#32773;&#12434;&#35500;&#24471;&#12375;&#12365;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#20182;&#22823;&#21218;&#12398;&#20154;&#12383;&#12385;&#12434;&#35500;&#24471;&#12391;&#12365;&#12428;&#12400;&#12381;&#12428;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#23455;&#20363;"><div class="titlepage"><div><div><h3 class="title"><a name="difficult-people-case-study"></a>&#23455;&#20363;</h3></div></div></div><p>
  &#31169;&#12364;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12363;&#12363;&#12431;&#12426;&#12384;&#12375;&#12390;&#12363;&#12425; 10 &#24180;&#20197;&#19978;&#12383;&#12385;&#12414;&#12377;&#12364;&#12289;
  &#31169;&#12364;&#35226;&#12360;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289;&#12371;&#12428;&#12414;&#12391;&#12395;&#12371;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#36215;&#12371;&#12387;&#12383;&#12398;&#12399;&#19968;&#24230;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12392;&#12365;&#12399;&#12289;&#23455;&#38555;&#12395;&#25237;&#31295;&#12434;&#12420;&#12417;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#20685;&#12365;&#12363;&#12369;&#12427;&#12399;&#12417;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#12424;&#12367;&#12354;&#12426;&#12364;&#12385;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#24444;&#12399;&#12414;&#12387;&#12383;&#12367;&#24746;&#27671;&#12399;&#12394;&#12367;&#12289;&#33391;&#12363;&#12428;&#12392;&#24605;&#12387;&#12390;&#12420;&#12387;&#12390;&#12356;&#12383;&#12384;&#12369;&#12391;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#21336;&#12395;&#12289;&#25237;&#31295;&#12377;&#12409;&#12365;&#12392;&#12365;&#12392;&#25511;&#12360;&#12427;&#12409;&#12365;&#12392;&#12365;&#12398;&#21306;&#21029;&#12364;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#31169;&#12383;&#12385;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#19968;&#33324;&#12395;&#20844;&#38283;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#24444;&#12399;&#38750;&#24120;&#12395;&#38971;&#32321;&#12395;&#12381;&#12371;&#12395;&#25237;&#31295;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#36074;&#21839;&#12434;&#32368;&#12426;&#36820;&#12377;&#12371;&#12392;&#12418;&#12354;&#12426;&#12289;
  &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#38291;&#12391;&#24464;&#12293;&#12395;&#30446;&#38556;&#12426;&#12395;&#24863;&#12376;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#36074;&#21839;&#12434;&#25237;&#31295;&#12377;&#12427;&#21069;&#12395;&#23569;&#12375;&#12399;&#33258;&#20998;&#12391;&#35519;&#12409;&#12427;&#12424;&#12358;&#12395;&#12420;&#12373;&#12375;&#12367;&#12362;&#39000;&#12356;&#12375;&#12390;&#12399;&#12415;&#12383;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#24444;&#12395;&#12399;&#20309;&#12398;&#21177;&#26524;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
</p><p>
  &#26368;&#32066;&#30340;&#12395;&#26377;&#21177;&#12384;&#12387;&#12383;&#12398;&#12399;&#12289;&#23436;&#20840;&#12395;&#20013;&#31435;&#12391;&#23450;&#37327;&#30340;&#12394;&#12487;&#12540;&#12479;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12375;&#12383;&#12290;
  &#38283;&#30330;&#32773;&#12398;&#12402;&#12392;&#12426;&#12364;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#35519;&#12409;&#12289;
  &#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20309;&#20154;&#12363;&#12398;&#38283;&#30330;&#32773;&#12395;&#20491;&#21029;&#12395;&#36865;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#21839;&#38988;&#12398;&#20154; (&#20197;&#19979;&#12398;&#19968;&#35239;&#12395;&#12362;&#12369;&#12427; 3 &#30058;&#30446;&#12398;&#20154;&#12290;&#12371;&#12371;&#12391;&#12399;&#20206;&#12395; "J. Random" &#12392;&#12375;&#12414;&#12377;)
  &#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12426;&#22987;&#12417;&#12390;&#12363;&#12425;&#26085;&#12364;&#12414;&#12384;&#27973;&#12356;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12467;&#12540;&#12489;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#19968;&#20999;&#36002;&#29486;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12290;
  &#12394;&#12398;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#25237;&#31295;&#12521;&#12531;&#12461;&#12531;&#12464;&#12391;&#12399; 3 &#30058;&#30446;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
</p><pre class="screen">
From: "Brian W. Fitzpatrick" &lt;fitz@collab.net&gt;
To: [... &#21311;&#21517;&#24615;&#12434;&#30906;&#20445;&#12377;&#12427;&#12383;&#12417;&#12289;&#36865;&#20449;&#20808;&#12399;&#30465;&#30053;&#12375;&#12414;&#12377; ...]
Subject: The Subversion Energy Sink
Date: Wed, 12 Nov 2003 23:37:47 -0600

&#36942;&#21435;25&#26085;&#38291;&#12398; svn [dev|users] &#12522;&#12473;&#12488;&#12398;&#25237;&#31295;&#25968;&#12488;&#12483;&#12503;6&#12399;&#20197;&#19979;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;

    294  kfogel@collab.net
    236  "C. Michael Pilato" &lt;cmpilato@collab.net&gt;
    220  "J. Random" &lt;jrandom@problematic-poster.com&gt;
    176  Branko &#268;ibej &lt;brane@xbc.nu&gt;
    130  Philip Martin &lt;philip@codematters.co.uk&gt;
    126  Ben Collins-Sussman &lt;sussman@collab.net&gt;

&#12371;&#12398;&#20013;&#12398;5&#20154;&#12399;&#12289;&#36817;&#12293;&#30330;&#34920;&#20104;&#23450;&#12398; Subversion 1.0 &#12395;&#36002;&#29486;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;
&#12391;&#12377;&#12290;

&#12414;&#12383;&#12289;&#12371;&#12398;&#20013;&#12398;1&#20154;&#12399;&#12289;&#20182;&#12398;5&#20154;&#12398;&#36275;&#12434;&#24341;&#12387;&#24373;&#12387;&#12390;&#26178;&#38291;&#12392;&#27671;&#21147;&#12434;&#28010;&#36027;&#12373;&#12379;&#12390;&#12356;&#12427;&#12384;
&#12369;&#12398;&#20154;&#12391;&#12377;&#12290;&#24444;&#12398;&#12362;&#12363;&#12370;&#12391;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12364;&#20572;&#28382;&#12377;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#28961;&#24847;&#35672;&#12398;&#12358;
&#12385;&#12395;Subversion&#12398;&#38283;&#30330;&#33258;&#20307;&#12418;&#36895;&#24230;&#12364;&#20302;&#19979;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#35443;&#32048;&#12394;&#35299;&#26512;&#12434;&#12375;&#12383;
&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12289;Subversion&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12473;&#12503;&#12540;&#12523;&#12434;&#12374;&#12387;&#12392;
grep&#12375;&#12390;&#12415;&#12383;&#12392;&#12371;&#12429;&#12289;&#12371;&#12398;&#20154;&#29289;&#12364;&#12513;&#12540;&#12523;&#12434;&#25237;&#31295;&#12377;&#12427;&#12383;&#12403;&#12395;&#12289;&#20182;&#12398;5&#20154;&#12398;&#20013;&#12398;&#23569;&#12394;
&#12367;&#12392;&#12418;2&#20154;&#12364;&#36820;&#20449;&#12434;&#12377;&#12427;&#12399;&#12417;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;

&#12381;&#12429;&#12381;&#12429;&#20309;&#12425;&#12363;&#12398;&#34892;&#21205;&#12434;&#36215;&#12371;&#12377;&#12409;&#12365;&#12392;&#12365;&#12376;&#12419;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12383;&#12392;&#12360;&#12381;&#12428;&#12391;&#24403;
&#35442;&#20154;&#29289;&#12364;&#12371;&#12371;&#12363;&#12425;&#21435;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12418;&#12420;&#12416;&#12434;&#24471;&#12414;&#12379;&#12435;&#12290;&#25511;&#12360;&#12417;&#12395;&#12420;&#12373;&#12375;
&#12367;&#35500;&#24471;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#20309;&#12398;&#21177;&#26524;&#12418;&#12394;&#12356;&#12371;&#12392;&#12399;&#12377;&#12391;&#12395;&#35388;&#26126;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;

dev@subversion &#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#38283;&#30330;&#12434;&#25163;&#21161;&#12369;&#12377;&#12427;&#12383;&#12417;&#12398;&#12513;&#12540;&#12522;&#12531;
&#12464;&#12522;&#12473;&#12488;&#12391;&#12354;&#12426;&#12289;&#12464;&#12523;&#12540;&#12503;&#12475;&#12521;&#12500;&#12540;&#12434;&#34892;&#12358;&#22580;&#25152;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;

- 3&#26085;&#12418;&#12398;&#38291;&#12289;&#22823;&#37327;&#12398;&#12513;&#12540;&#12523;&#12392;&#26684;&#38360;&#12375;&#32154;&#12369;&#12383; Fitz &#12424;&#12426;
</pre><p>
  &#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#27671;&#12389;&#12363;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12364;&#12289;J. Random (&#20206;&#21517;)
  &#12398;&#25391;&#12427;&#33310;&#12356;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36914;&#34892;&#12434;&#22952;&#12370;&#12427;&#20856;&#22411;&#30340;&#12394;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#12289;&#35696;&#20107;&#12398;&#36914;&#34892;&#12434;&#22952;&#23475;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12394;&#12393;&#12398;&#20855;&#20307;&#30340;&#12394;&#34892;&#21205;&#12434;&#12392;&#12387;&#12383;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12384;&#12300;&#21508;&#12513;&#12531;&#12496;&#12540;&#12395;&#31680;&#24230;&#12434;&#25345;&#12387;&#12383;&#23550;&#24540;&#12434;&#26399;&#24453;&#12377;&#12427;&#12301;&#12392;&#12356;&#12358;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#26041;&#37341;&#12434;&#12358;&#12414;&#12367;&#21033;&#29992;&#12375;&#12390;&#12356;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#31169;&#12383;&#12385;&#12399;&#12300;&#12393;&#12435;&#12394;&#12493;&#12479;&#12434;&#12393;&#12435;&#12394;&#12392;&#12365;&#12395;&#25237;&#31295;&#12377;&#12409;&#12365;&#12363;&#12301;&#12392;&#12356;&#12387;&#12383;&#21028;&#26029;&#12399;
  &#23436;&#20840;&#12395;&#21508;&#20491;&#20154;&#12395;&#20219;&#12379;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#35504;&#12363;&#12364;&#19981;&#36969;&#20999;&#12394;&#25237;&#31295;&#12434;&#12375;&#12383;&#12426;
  &#12381;&#12428;&#12434;&#25913;&#21892;&#12377;&#12427;&#12381;&#12406;&#12426;&#12434;&#35211;&#12379;&#12394;&#12363;&#12387;&#12383;&#12426;&#12375;&#12390;&#12418;&#12289;
  &#31169;&#12383;&#12385;&#12399;&#12393;&#12358;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12364;&#38971;&#32321;&#12395;&#25237;&#31295;&#12434;&#32368;&#12426;&#36820;&#12377;&#12371;&#12392;&#12434;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#12415;&#12435;&#12394;&#27671;&#12395;&#12375;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#12300;&#12381;&#12428;&#12399;&#9675;&#9675;&#12392;&#12356;&#12358;&#35215;&#21063;&#12395;&#36949;&#21453;&#12375;&#12390;&#12356;&#12427;&#12301;&#12392;&#25351;&#25688;&#12377;&#12427;&#26681;&#25312;&#12399;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#24403;&#26178;&#12398; Fitz &#12398;&#12420;&#12426;&#26041;&#12399;&#12289;&#24039;&#22937;&#12394;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#12414;&#12378;&#23450;&#37327;&#30340;&#12394;&#35388;&#25312;&#12434;&#38598;&#12417;&#12414;&#12375;&#12383;&#12290;&#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12434;&#24910;&#37325;&#12395;&#24195;&#12417;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12378;&#12399;&#12289;&#20210;&#38291;&#12395;&#12394;&#12387;&#12390;&#12367;&#12428;&#12427;&#12392;&#24515;&#24375;&#12356;&#12392;&#24605;&#12431;&#12428;&#12427;&#12372;&#12367;&#19968;&#37096;&#12398;&#20154;&#12383;&#12385;&#12395;&#12384;&#12369;
  &#12381;&#12428;&#12434;&#20253;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#20309;&#12425;&#12363;&#12398;&#23550;&#24540;&#12364;&#24517;&#35201;&#12384;&#12392;&#21512;&#24847;&#12375;&#12383;&#24444;&#12425;&#12399;&#12289;J. Random
  &#12395;&#38651;&#35441;&#12434;&#12363;&#12369;&#12390;&#21839;&#38988;&#28857;&#12434;&#30452;&#25509;&#25351;&#25688;&#12375;&#12289;&#25237;&#31295;&#12434;&#25511;&#12360;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#38972;&#12415;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#12289;&#12394;&#12380;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#35328;&#12431;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12363;&#12434;&#12431;&#12363;&#12387;&#12390;&#12356;&#12394;&#12356;&#12424;&#12358;&#12391;&#12375;&#12383;&#12290;
  &#12414;&#12354;&#12289;&#12418;&#12375;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12427;&#12384;&#12369;&#12398;&#20154;&#12391;&#12354;&#12428;&#12400;&#12289;
  &#26368;&#21021;&#12363;&#12425;&#12371;&#12435;&#12394;&#21839;&#38988;&#12399;&#36215;&#12371;&#12425;&#12394;&#12363;&#12387;&#12383;&#12391;&#12375;&#12423;&#12358;&#12369;&#12393;&#12397;&#12290;
  &#32080;&#23616;&#12289;&#24444;&#12399;&#25237;&#31295;&#12434;&#12420;&#12417;&#12427;&#12371;&#12392;&#12395;&#21516;&#24847;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12375;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#36890;&#24120;&#12393;&#12362;&#12426;&#12395;&#25147;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#26368;&#32066;&#30340;&#12395;&#12371;&#12398;&#20316;&#25126;&#12364;&#12358;&#12414;&#12367;&#12356;&#12387;&#12383;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12399;
  &#12300;&#24444;&#12398;&#25237;&#31295;&#12434;&#12473;&#12497;&#12512;&#23550;&#31574;&#29992;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;
  (<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span> &#12398;
  <a class="xref" href="mailing-lists.html#spam-prevention" title="&#12473;&#12497;&#12512;&#23550;&#31574;">&#12300;&#12473;&#12497;&#12512;&#23550;&#31574;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
  &#12391;&#25298;&#21542;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12435;&#12384;&#12424;&#12301;
  &#12392;&#12356;&#12358;&#22311;&#21147;&#12434;&#36960;&#12414;&#12431;&#12375;&#12395;&#19982;&#12360;&#12383;&#12371;&#12392;&#12395;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#22311;&#21147;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12383;&#12398;&#12418;&#12289;
  Fitz &#12364;&#26368;&#21021;&#12395;&#20027;&#35201;&#20154;&#29289;&#12395;&#26681;&#22238;&#12375;&#12434;&#12375;&#12390;&#12362;&#12356;&#12383;&#12363;&#12425;&#12371;&#12381;&#12391;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1954432" href="#idp1954432" class="para">26</a>] </sup>
      &#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;&#12398;&#19968;&#20363;&#12395;&#12388;&#12356;&#12390;&#12289;Amy Hoy &#12364;&#24841;&#24555;&#12394;&#35352;&#20107;
      <em class="citetitle"><a class="ulink" href="http://slash7.com/2006/12/22/vampires/" target="_top">Help Vampires: A Spotter's Guide</a></em>
      &#12391;&#30340;&#30906;&#12395;&#25351;&#25688;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;Hoy &#26352;&#12367;&#12289;
      &#12300;&#12381;&#12428;&#12399;&#12365;&#12387;&#12392;&#12289;&#26178;&#35336;&#12398;&#26178;&#21051;&#21512;&#12431;&#12379;&#12434;&#12377;&#12427;&#12398;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#12395;&#26222;&#36890;&#12398;&#12371;&#12392;&#12290;
      &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12398;&#34928;&#36864;&#12399;&#12289;&#25918;&#23556;&#24615;&#21516;&#20301;&#20307;&#12398;&#28187;&#34928;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#12395;&#20104;&#28204;&#21487;&#33021;&#12394;&#12371;&#12392;&#12290;
      &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12394;&#12426;&#35328;&#35486;&#12394;&#12426;&#12364;&#12381;&#12428;&#12394;&#12426;&#12398;&#30693;&#21517;&#24230;&#12434;&#24471;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;
       &#8212; &#21322;&#28187;&#26399;&#12434;&#36814;&#12360;&#12427;&#12392;&#12289;&#12392;&#35328;&#12387;&#12390;&#12418;&#12356;&#12356; &#8212; 
      <span class="emphasis"><em>&#22900;&#12425;</em></span>&#12399;&#12420;&#12387;&#12390;&#12367;&#12427;&#12290;&#12381;&#12375;&#12390;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12398;&#27671;&#21147;&#12434;&#12381;&#12368;&#12424;&#12358;&#12395;&#12394;&#12427;&#12290;
      <span class="emphasis"><em>&#22900;&#12425;</em></span>&#12399; Help Vampire&#12290;&#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12434;&#38459;&#27490;&#12377;&#12427;&#12383;&#12417;&#12395;&#31169;&#12399;&#12371;&#12371;&#12395;&#12356;&#12427;...&#12301;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="common-pitfalls.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="growth.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#38501;&#12426;&#12364;&#12385;&#12394;&#32608; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;</td></tr></table></div></body></html>
