<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;"><link rel="prev" href="copyright-assignment.html" title="&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193;"><link rel="next" href="patents.html" title="&#29305;&#35377;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="copyright-assignment.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</th><td width="20%" align="right"> <a accesskey="n" href="patents.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="dual-licensing"></a>&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;</h2></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12362;&#37329;&#12434;&#31292;&#12368;&#12383;&#12417;&#12395;&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;&#12434;&#20351;&#12358;&#12392;&#12371;&#12429;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#29420;&#21344;&#30340;&#12394;&#27966;&#29983;&#29289;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#12467;&#12540;&#12489;&#12434;&#20351;&#12358;&#27177;&#21033;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#33879;&#20316;&#27177;&#32773;&#12395;&#12362;&#37329;&#12434;&#25173;&#12387;&#12390;&#12418;&#12425;&#12358;&#19968;&#26041;&#12391;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#12358;&#30446;&#30340;&#12394;&#12425;&#12467;&#12540;&#12489;&#12434;&#12501;&#12522;&#12540;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12362;&#12367;&#12289;
    &#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#24403;&#28982;&#12289;&#21336;&#29420;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12424;&#12426;&#12399;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12467;&#12540;&#12489;&#12392;&#30456;&#24615;&#12364;&#12424;&#12356;&#20181;&#32068;&#12415;&#12391;&#12377;&#12290;
    &#27491;&#30906;&#12394;&#26465;&#20214;&#12399;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#12358;&#22580;&#21512;&#12398;&#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;
    GNU GPL &#12364;&#12424;&#12367;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
    GPL &#12399;&#33879;&#20316;&#27177;&#32773;&#12398;&#35377;&#21487;&#12394;&#12367;&#29420;&#21344;&#30340;&#12394;&#35069;&#21697;&#12395;&#12467;&#12540;&#12489;&#12434;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12434;&#26082;&#12395;&#31105;&#27490;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12364;&#12289;
    &#12371;&#12428;&#12392;&#21516;&#12376;&#21177;&#26524;&#12434;&#25345;&#12388;&#29420;&#33258;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#21069;&#32773;&#12398;&#20363;&#12399; MySQL&#12398;&#12521;&#12452;&#12475;&#12531;&#12473; &#12391;&#12354;&#12426;&#12289;<a class="ulink" href="http://www.mysql.com/company/legal/licensing/" target="_top">http://www.mysql.com/company/legal/licensing/</a> &#12395;&#35500;&#26126;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#24460;&#32773;&#12398;&#20363;&#12399; Sleepycat Software &#12364;&#25505;&#29992;&#12375;&#12390;&#12356;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#25126;&#30053;&#12391;&#12289;
    <a class="ulink" href="http://www.oracle.com/technology/software/products/berkeley-db/htdocs/licensing.html" target="_top">http://www.oracle.com/technology/software/products/berkeley-db/htdocs/licensing.html</a> &#12395;&#35500;&#26126;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12435;&#12394;&#30097;&#21839;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435; &#12300;GNU GPL &#12364;&#12289;
    &#21046;&#38480;&#12364;&#32233;&#12356;&#26041;&#27861;&#12391;&#12467;&#12540;&#12489;&#12434;&#21033;&#29992;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#35201;&#27714;&#12375;&#12390;&#12356;&#12383;&#12392;&#12375;&#12383;&#12425;&#12289;
    &#33879;&#20316;&#27177;&#32773;&#12399;&#12393;&#12358;&#12420;&#12387;&#12390;&#12362;&#37329;&#12392;&#24341;&#25563;&#12360;&#12395;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#19982;&#12360;&#12428;&#12400;&#12356;&#12356;&#12398;&#65311;&#12301;
    &#12371;&#12428;&#12395;&#23550;&#12375;&#12390;&#12399; &#12300;GPL &#12398;&#26465;&#20214;&#12399;&#12289;&#33879;&#20316;&#27177;&#32773;&#12364;&#20182;&#20154;&#12395;&#35506;&#12377;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#33879;&#20316;&#27177;&#32773;&#12395;&#12399; GPL &#12398;&#26465;&#20214;&#12434; <span class="emphasis"><em>&#35506;&#12373;&#12378;&#12395;</em></span>
    &#29420;&#21344;&#30340;&#12394;&#26465;&#20214;&#12398;&#12415;&#12434;&#35506;&#12377;&#33258;&#30001;&#12418;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;&#12301;
    &#12392;&#12356;&#12358;&#12398;&#12364;&#31572;&#12360;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#33879;&#20316;&#27177;&#32773;&#12364;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12500;&#12540;&#12434;&#28961;&#38480;&#12395;&#22312;&#24235;&#12392;&#12375;&#12390;&#25345;&#12387;&#12390;&#12356;&#12427;&#12392;&#32771;&#12360;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12425;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12500;&#12540;&#12434;&#19968;&#12388;&#21462;&#12426;&#20986;&#12375;&#12390;&#19990;&#12395;&#36865;&#12426;&#20986;&#12377;&#12383;&#12403;&#12395;&#12289;
    &#12393;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#20184;&#12369;&#12427;&#12363;&#12289;&#12388;&#12414;&#12426; GPL &#12394;&#12398;&#12363;&#12289;
    &#29420;&#21344;&#30340;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12363;&#12289;&#12381;&#12428;&#20197;&#22806;&#12363;&#12434;&#27770;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36984;&#12435;&#12391;&#27770;&#12417;&#12427;&#27177;&#21033;&#12399;&#12289;
    GPL &#12420;&#20182;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#35506;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#21336;&#12395;&#33879;&#20316;&#27177;&#12395;&#38306;&#12377;&#12427;&#27861;&#24459;&#12364;&#19982;&#12360;&#12383;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#39749;&#21147;&#12399;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23433;&#23450;&#12375;&#12383;&#21454;&#20837;&#12398;&#36947;&#12434;&#38283;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#19981;&#24184;&#12394;&#12371;&#12392;&#12395;&#12289;
    &#12371;&#12428;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36890;&#24120;&#12398;&#21147;&#23398;&#12434;&#22952;&#12370;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#21839;&#38988;&#12394;&#12398;&#12399;&#12289;&#12467;&#12540;&#12489;&#12434;&#25552;&#20379;&#12377;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12383;&#12385;&#12364;&#12289;
    &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12418;&#12398;&#12392;&#12289;&#29420;&#21344;&#30340;&#12394;&#12418;&#12398;&#12398;&#12289;
    &#20840;&#12367;&#21029;&#12394;&#12405;&#12383;&#12388;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#36002;&#29486;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#36002;&#29486;&#12377;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12383;&#12385;&#12399;&#12289;
    &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12399;&#21916;&#12435;&#12391;&#12467;&#12540;&#12489;&#12434;&#25552;&#20379;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#25552;&#20379;&#12375;&#12383;&#12467;&#12540;&#12489;&#12434;&#12501;&#12522;&#12540;&#12395;&#12377;&#12427;&#12398;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#26222;&#36890;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#20182;&#12398;&#20154;&#12364;&#21322;&#12400;&#29420;&#21344;&#30340;&#12394;&#12420;&#12426;&#26041;&#12391;&#21033;&#30410;&#12434;&#24471;&#12427;&#12398;&#12395;&#21152;&#25285;&#12377;&#12427;&#12398;&#12399;&#12362;&#12363;&#12375;&#12356;&#12392;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#12472;&#12524;&#12531;&#12510;&#12399;&#12289;&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#25505;&#29992;&#12375;&#12383;&#22580;&#21512;&#12395;&#12289;
    &#29420;&#21344;&#30340;&#12394;&#12420;&#12426;&#26041;&#12391;&#24471;&#12383;&#21033;&#30410;&#12363;&#12425;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12364;&#12525;&#12452;&#12516;&#12522;&#12486;&#12451;&#12434;&#35531;&#27714;&#12377;&#12427;&#12371;&#12392;&#12434;&#38450;&#12368;&#12383;&#12417;&#12395;&#12289;
    &#33879;&#20316;&#27177;&#32773;&#12364;&#24444;&#12425;&#12398;&#12467;&#12540;&#12489;&#12398;&#33879;&#20316;&#27177;&#12434;&#33258;&#12425;&#12395;&#35698;&#28193;&#12377;&#12427;&#22865;&#32004;&#12395;&#12469;&#12452;&#12531;&#12377;&#12427;&#12424;&#12358;&#27714;&#12417;&#12390;&#12365;&#12383;&#12392;&#12365;&#12395;&#12373;&#12425;&#12395;&#22823;&#12365;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#22865;&#32004;&#26360;&#12395;&#12469;&#12452;&#12531;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#36948;&#12395;&#12289;&#33258;&#20998;&#12364;&#35504;&#12363;&#12434;&#20786;&#12369;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#21205;&#12356;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#20107;&#23455;&#12434;&#12356;&#12420;&#12364;&#12362;&#12358;&#12391;&#12418;&#31361;&#12365;&#12388;&#12369;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#20840;&#21729;&#12364;&#12371;&#12398;&#21839;&#38988;&#12391;&#24745;&#12416;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#32080;&#23616;&#12289;&#25552;&#20379;&#12375;&#12383;&#12467;&#12540;&#12489;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12418;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#12431;&#12369;&#12391;&#12289;
    &#12381;&#12428;&#12371;&#12381;&#12364;&#24444;&#12425;&#12398;&#38306;&#24515;&#20107;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12395;&#12418;&#38306;&#12431;&#12425;&#12378;&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;
    &#33879;&#20316;&#27177;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#29305;&#21029;&#12394;&#27177;&#21033;&#12434;&#12289;
    &#33258;&#12425;&#12395;&#19982;&#12360;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12422;&#12360;&#12395;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#20013;&#12395;&#12399;&#12354;&#12427;&#26178;&#28857;&#12391;&#33879;&#20316;&#27177;&#32773;&#12392;&#23550;&#31435;&#12375;&#12390;&#12375;&#12414;&#12358;&#20154;&#12364;&#24517;&#12378;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#25505;&#29992;&#12375;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#22522;&#30436;&#12395;&#12375;&#12390;&#12356;&#12427;&#20225;&#26989;&#12391;&#12399;&#12289;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#26412;&#24403;&#12398;&#24847;&#21619;&#12391;&#24179;&#31561;&#12394;&#38306;&#20418;&#12434;&#31689;&#12356;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#23567;&#35215;&#27169;&#12394;&#12496;&#12464;&#20462;&#27491;&#12420;&#12467;&#12540;&#12489;&#12434;&#25972;&#29702;&#12377;&#12427;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#22806;&#37096;&#12395;&#20381;&#23384;&#12377;&#12427;&#12418;&#12398;&#12398;&#12289;
    &#38627;&#12375;&#12356;&#20181;&#20107;&#12399;&#12411;&#12392;&#12435;&#12393;&#20869;&#37096;&#12391;&#12371;&#12394;&#12375;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;MySQL &#12398;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#37096;&#38272;&#21103;&#31038;&#38263;&#12398; Zack Urlocker &#12399;&#12289;
    &#27963;&#30330;&#12394;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12399;&#32080;&#23616;&#20225;&#26989;&#12364;&#38599;&#12387;&#12390;&#12375;&#12414;&#12358;&#12398;&#12364;&#19968;&#33324;&#30340;&#12384;&#12392;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12422;&#12360;&#12395;&#12289;MySQL &#12381;&#12398;&#12418;&#12398;&#12399; GPL &#12391;&#12521;&#12452;&#12475;&#12531;&#12473;&#12373;&#12428;&#12383;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12377;&#12364;&#12289;
    &#38283;&#30330;&#12381;&#12398;&#12418;&#12398;&#12399;&#22810;&#12363;&#12428;&#23569;&#12394;&#12363;&#12428;&#20225;&#26989;&#12364;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    (&#21487;&#33021;&#24615;&#12399;&#26997;&#12417;&#12390;&#23567;&#12373;&#12356;&#12418;&#12398;&#12398;)
    &#35504;&#12363;&#12364;&#20225;&#26989;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#25201;&#12356;&#12395;&#19981;&#28288;&#12434;&#25345;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12375;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12418;&#23381;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#25080;&#24565;&#12364;&#12393;&#12398;&#31243;&#24230;&#20225;&#26989;&#12398;&#26041;&#37341;&#12395;&#24433;&#38911;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;MySQL&#12392;&#12356;&#12358;&#20225;&#26989;&#12399;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12395;&#30041;&#12414;&#12427;&#12363;&#12289;
    &#12381;&#12358;&#12391;&#12394;&#12356;&#12363;&#12399;&#21839;&#38988;&#35222;&#12375;&#12390;&#12356;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="copyright-assignment.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="patents.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#29305;&#35377;</td></tr></table></div></body></html>
