<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><link rel="prev" href="credit.html" title="&#12463;&#12524;&#12472;&#12483;&#12488;"><link rel="next" href="governments-and-open-source.html" title="&#31532;9&#31456; Governments and Open Source"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="credit.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</th><td width="20%" align="right"> <a accesskey="n" href="governments-and-open-source.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="forks"></a>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;</h2></div></div></div><p>
  <span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a> &#12398;</span>
  <a class="xref" href="social-infrastructure.html#forkability" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#21487;&#33021;&#24615;">&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#21487;&#33021;&#24615;&#12301;</a> &#12391;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427; <span class="emphasis"><em>&#21487;&#33021;&#24615;</em></span>
  &#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#20307;&#21046;&#12395;&#37325;&#22823;&#12394;&#24433;&#38911;&#12434;&#21450;&#12412;&#12377;&#12371;&#12392;&#12434;&#21462;&#12426;&#19978;&#12370;&#12414;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23455;&#38555;&#12395;&#20998;&#35010;&#12375;&#12383;&#22580;&#21512;&#12399;&#12393;&#12358;&#12394;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;?
  &#12393;&#12358;&#12420;&#12387;&#12390;&#20966;&#29702;&#12377;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;? &#12381;&#12428;&#12364;&#12393;&#12435;&#12394;&#24433;&#38911;&#12434;&#21450;&#12412;&#12377;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;?
  &#36870;&#12395;&#12289;&#12354;&#12394;&#12383;&#12398;&#12411;&#12358;&#12364;&#12381;&#12358;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12399;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;?
</p><p>
  &#12381;&#12398;&#31572;&#12360;&#12399;&#12289;&#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#22793;&#12431;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36914;&#12416;&#36947;&#12395;&#38306;&#12375;&#12390;&#30456;&#23481;&#12428;&#12394;&#12356;&#24847;&#35211;&#12398;&#30456;&#36949;&#12364;&#20986;&#12390;&#12365;&#12383;&#12383;&#12417;&#12395;
  &#21451;&#22909;&#30340;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#12363;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12362;&#12381;&#12425;&#12367;&#12381;&#12428;&#12424;&#12426;&#12418;&#12387;&#12392;&#22810;&#12356;&#12398;&#12399;
  &#25216;&#34899;&#30340;&#12394;&#24847;&#35211;&#12398;&#30456;&#36949;&#12420;&#20154;&#38291;&#38306;&#20418;&#12398;&#21839;&#38988;&#12395;&#12424;&#12387;&#12390;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12428;&#12425;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12391;&#12365;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12399;&#24448;&#12293;&#12395;&#12375;&#12390;&#20491;&#20154;&#30340;&#12394;&#35696;&#35542;&#12398;&#35201;&#32032;&#12418;&#21547;&#12435;&#12391;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#20849;&#36890;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;&#12354;&#12427;&#38283;&#30330;&#32773;&#12464;&#12523;&#12540;&#12503;
  (&#12354;&#12427;&#12356;&#12399;&#12402;&#12392;&#12426;&#12398;&#38283;&#30330;&#32773;&#12384;&#12369;&#12398;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;)
  &#12395;&#12392;&#12387;&#12390;&#12381;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#12398;&#20849;&#21516;&#20316;&#26989;&#12398;&#12467;&#12473;&#12488;&#12395;&#35211;&#21512;&#12358;&#21033;&#30410;&#12364;
  &#24471;&#12425;&#12428;&#12394;&#12356;&#12392;&#21028;&#26029;&#12375;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12375;&#12383;&#12392;&#12365;&#12398;&#12289;&#12393;&#12385;&#12425;&#12364;&#12300;&#26412;&#23478;&#12301;&#12384;&#12392;&#12363;&#12393;&#12385;&#12425;&#12364;&#12300;&#20803;&#31062;&#12301;
  &#12384;&#12392;&#12363;&#12356;&#12358;&#21839;&#12356;&#12408;&#12398;&#26126;&#30906;&#12394;&#31572;&#12360;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488; P
  &#12363;&#12425;&#20998;&#35010;&#12375;&#12383; F&#12301;&#12392;&#12356;&#12358;&#12424;&#12358;&#12395;&#12289;&#12354;&#12383;&#12363;&#12418; P &#12399;&#20309;&#12418;&#22793;&#12431;&#12425;&#12394;&#12356;&#12414;&#12414;&#12391;
  F &#12364;&#12381;&#12371;&#12363;&#12425;&#26032;&#12383;&#12395;&#20998;&#23696;&#12375;&#12383;&#12392;&#35441;&#12377;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12371;&#12428;&#12399;&#12300;&#12381;&#12398;&#20154;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#24863;&#12376;&#12390;&#12356;&#12427;&#12363;&#12301;
  &#12434;&#35328;&#12387;&#12390;&#12356;&#12427;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12399;&#22522;&#26412;&#30340;&#12395;&#35469;&#30693;&#24230;&#12398;&#21839;&#38988;&#12391;&#12377;&#12290;&#21608;&#22258;&#12398;&#22823;&#22810;&#25968;&#12364;&#21516;&#24847;&#12377;&#12428;&#12400;&#12289;
  &#12381;&#12398;&#20027;&#24373;&#12364;&#30495;&#23455;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#23458;&#35251;&#30340;&#12395;&#12415;&#12383;&#30495;&#23455;&#12364;&#26368;&#21021;&#12363;&#12425;&#12354;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#19981;&#21313;&#20998;&#12394;&#12364;&#12425;&#12418;&#12300;&#12394;&#12435;&#12392;&#12394;&#12367;&#12371;&#12358;&#12376;&#12419;&#12394;&#12356;&#12363;&#12394;&#12301;&#12392;&#32771;&#12360;&#12427;&#12371;&#12392;&#12375;&#12363;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12414;&#12431;&#12426;&#12398;&#35469;&#30693;&#24230;&#12371;&#12381;&#12364;&#12416;&#12375;&#12429;&#23458;&#35251;&#30340;&#12394;&#30495;&#23455;&#12392;&#35328;&#12360;&#12414;&#12377;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#26412;&#23478; (&#12354;&#12427;&#12356;&#12399;&#20998;&#23478;) &#12398;&#21306;&#21029;
  &#12392;&#12356;&#12358;&#12418;&#12398;&#12399;&#20154;&#12398;&#24515;&#12398;&#20013;&#12395;&#12398;&#12415;&#23384;&#22312;&#12377;&#12427;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12418;&#12375;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12424;&#12358;&#12392;&#32771;&#12360;&#12383;&#20154;&#12364;
  &#12513;&#12452;&#12531;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#38626;&#12428;&#12390;&#26032;&#12383;&#12394;&#12502;&#12521;&#12531;&#12481;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#12398;&#12394;&#12425;&#12289;
  &#35469;&#30693;&#24230;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;&#12399;&#12377;&#12368;&#12395;&#35299;&#27770;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#38283;&#30330;&#32773;&#12418;&#12518;&#12540;&#12470;&#12540;&#12418;&#12289;
  &#26032;&#12383;&#12395;&#30331;&#22580;&#12375;&#12383;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#35469;&#12417;&#12289;
  &#26032;&#12375;&#12356;&#21517;&#21069; (&#20803;&#12398;&#21517;&#21069;&#12395;&#30001;&#26469;&#12377;&#12427;&#12418;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#23481;&#26131;&#12395;&#21306;&#21029;&#12391;&#12365;&#12427;&#12418;&#12398;) &#12420;&#26032;&#12375;&#12356;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12289;
  &#26032;&#12375;&#12356;&#30446;&#27161;&#12434;&#25345;&#12388;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#35469;&#12417;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20001;&#26041;&#12398;&#38499;&#21942;&#12364;&#12300;&#33258;&#20998;&#12398;&#12411;&#12358;&#12371;&#12381;&#12364;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26412;&#27969;&#12391;&#12354;&#12426;&#12289;
  &#21517;&#21069;&#12434;&#20351;&#12356;&#32154;&#12369;&#12427;&#27177;&#21033;&#12364;&#12354;&#12427;&#12301;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#35441;&#12364;&#12420;&#12420;&#12371;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21517;&#12398;&#21830;&#27161;&#27177;&#12420;&#12489;&#12513;&#12452;&#12531;&#12289;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12394;&#12393;&#12434;
  &#20309;&#12425;&#12363;&#12398;&#32068;&#32340;&#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#36890;&#24120;&#12399;&#12381;&#12398;&#32068;&#32340;&#12398;&#32771;&#12360;&#12391;&#21839;&#38988;&#12434;&#35299;&#27770;&#12373;&#12428;&#12414;&#12377;&#12290;
  &#12393;&#12385;&#12425;&#12364;&#26412;&#23478;&#12391;&#12393;&#12385;&#12425;&#12364;&#20998;&#23478;&#12394;&#12398;&#12363;&#12434;&#12381;&#12398;&#32068;&#32340;&#12364;&#27770;&#12417;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#24195;&#22577;&#21512;&#25126;&#12395;&#12394;&#12428;&#12400;&#12381;&#12398;&#32068;&#32340;&#12395;&#12399;&#12363;&#12394;&#12356;&#12387;&#12371;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#24403;&#28982;&#12289;&#12381;&#12435;&#12394;&#20107;&#24907;&#12395;&#12394;&#12427;&#12371;&#12392;&#12399;&#12417;&#12387;&#12383;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21147;&#38306;&#20418;&#12395;&#12388;&#12356;&#12390;&#12399;&#12415;&#12435;&#12394;&#12424;&#12367;&#12431;&#12363;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#32080;&#26524;&#12398;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12465;&#12531;&#12459;&#12394;&#12393;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
</p><p>
  &#24184;&#12356;&#12394;&#12371;&#12392;&#12395;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12399;&#12300;&#12393;&#12387;&#12385;&#12364;&#26412;&#27969;&#12391;&#12393;&#12387;&#12385;&#12364;&#20621;&#27969;&#12363;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#20105;&#12356;&#12399;&#36215;&#12371;&#12426;&#12414;&#12379;&#12435;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12289;
  &#23455;&#38555;&#12395;&#20998;&#35010;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;
  &#12381;&#12398;&#21205;&#12365;&#12395;&#23550;&#12377;&#12427;&#20449;&#20219;&#25237;&#31080;&#12398;&#12424;&#12358;&#12394;&#21147;&#23398;&#12391;&#27770;&#12414;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#38283;&#30330;&#32773;&#12398;&#36942;&#21322;&#25968;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12427;&#21205;&#12365;&#12395;&#36059;&#21516;&#12375;&#12383;&#12398;&#12394;&#12425;&#12289;
  &#36890;&#24120;&#12399;&#12418;&#12399;&#12420;&#12381;&#12358;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24375;&#24773;&#12394;&#29420;&#35009;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20181;&#20999;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12418;&#12394;&#12356;&#38480;&#12426;&#12289;
  &#12431;&#12374;&#12431;&#12374;&#20998;&#35010;&#12373;&#12379;&#12394;&#12367;&#12390;&#12418;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20013;&#12391;&#21205;&#12365;&#12434;&#36914;&#12417;&#12390;&#12356;&#12369;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#12418;&#12375;&#20998;&#35010;&#12373;&#12379;&#12424;&#12358;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12398;&#12364;&#20840;&#20307;&#12398;&#21322;&#25968;&#12424;&#12426;&#23569;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;
  &#12381;&#12428;&#12399;&#26126;&#12425;&#12363;&#12395;&#23569;&#25968;&#27966;&#12398;&#21453;&#20081;&#12391;&#12377;&#12290;&#31036;&#20736;&#30340;&#12394;&#24847;&#21619;&#12391;&#12418;&#12289;
  &#12414;&#12383;&#24120;&#35672;&#12391;&#32771;&#12360;&#12390;&#12418;&#24444;&#12425;&#12364;&#26412;&#27969;&#12392;&#12394;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#26412;&#27969;&#12363;&#12425;&#20998;&#23696;&#12375;&#12383;&#21029;&#12398;&#12418;&#12398;&#12392;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#20998;&#35010;&#12398;&#21205;&#12365;&#12434;&#12358;&#12414;&#12367;&#20966;&#29702;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="forks-handling"></a>&#20998;&#35010;&#12398;&#21205;&#12365;&#12434;&#12358;&#12414;&#12367;&#20966;&#29702;&#12377;&#12427;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#35504;&#12363;&#12364;&#26032;&#12375;&#12356;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#21205;&#12365;&#12434;&#35211;&#12379;&#22987;&#12417;&#12383;&#12425;&#12289;
  &#12414;&#12378;&#12399;&#33853;&#12385;&#30528;&#12356;&#12390;&#12354;&#12394;&#12383;&#12398;&#38263;&#26399;&#30446;&#27161;&#12434;&#24605;&#12356;&#20986;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#20998;&#35010;&#12377;&#12427;&#12371;&#12392;<span class="emphasis"><em>&#33258;&#20307;</em></span>&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#23475;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12416;&#12375;&#12429;&#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#38283;&#30330;&#32773;&#12420;&#12518;&#12540;&#12470;&#12540;&#12434;&#22833;&#12358;&#12371;&#12392;&#12364;&#21839;&#38988;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12354;&#12394;&#12383;&#12398;&#12420;&#12427;&#12409;&#12365;&#12371;&#12392;&#12399;&#12381;&#12358;&#12375;&#12383;&#21205;&#12365;&#12398;&#33469;&#12434;&#25688;&#12416;&#12371;&#12392;&#12391;&#12399;&#12394;&#12367;
  &#12381;&#12398;&#34987;&#23475;&#12434;&#26368;&#23567;&#38480;&#12395;&#25233;&#12360;&#12427;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#33145;&#12364;&#31435;&#12388;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12435;&#12394;&#21205;&#12365;&#12399;&#19981;&#24403;&#12394;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#12414;&#12383;&#19981;&#35201;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12392;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12418;&#12289;&#12381;&#12435;&#12394;&#24863;&#24773;&#12434;&#34920;&#12395;&#20986;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;
  &#24907;&#24230;&#12434;&#27770;&#12417;&#12363;&#12397;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12434;&#12354;&#12394;&#12383;&#12363;&#12425;&#36960;&#12374;&#12369;&#12427;&#12371;&#12392;&#12395;&#12375;&#12363;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#38283;&#30330;&#32773;&#12383;&#12385;&#12395;&#12289;&#24907;&#24230;&#12434;&#26126;&#30906;&#12395;&#12377;&#12427;&#12424;&#12358;&#35201;&#27714;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#26032;&#12375;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#20154;&#12383;&#12385;&#12392;&#12418;&#12391;&#12365;&#12427;&#12384;&#12369;&#21332;&#21147;&#30340;&#12395;&#25509;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12378;&#31532;&#19968;&#12395;&#12289;&#35504;&#12363;&#12364;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20596;&#12391;&#20316;&#26989;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
  &#12381;&#12398;&#20154;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#21093;&#22890;&#12377;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20596;&#12391;&#20316;&#26989;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
  &#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#12381;&#12398;&#20154;&#12398;&#27177;&#38480;&#12364;&#21363;&#21051;&#22833;&#12431;&#12428;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12467;&#12511;&#12483;&#12479;&#12540;&#12391;&#12354;&#12387;&#12383;&#20154;&#12399;&#12289;&#12371;&#12428;&#12363;&#12425;&#12418;&#12467;&#12511;&#12483;&#12479;&#12540;&#12391;&#12354;&#12426;&#32154;&#12369;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20596;&#12392;&#12399;&#12391;&#12365;&#12427;&#12384;&#12369;&#20210;&#33391;&#12367;&#12420;&#12387;&#12390;&#12356;&#12365;&#12383;&#12356;&#12392;&#12356;&#12358;&#24847;&#24535;&#12434;&#31034;&#12377;&#12371;&#12392;&#12418;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12289;&#12362;&#20114;&#12356;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#30456;&#25163;&#20596;&#12395;&#12418;&#21453;&#26144;&#12373;&#12379;&#12425;&#12428;&#12427;&#12424;&#12358;&#12394;&#38306;&#20418;&#12434;&#20445;&#12385;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12540;&#12496;&#12398;&#31649;&#29702;&#27177;&#38480;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#12398;&#12452;&#12531;&#12501;&#12521;&#12398;&#25903;&#25588;&#12434;&#25552;&#26696;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36942;&#21435;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12487;&#12540;&#12479;&#12398;&#12467;&#12500;&#12540;&#12434;&#25552;&#20379;&#12377;&#12428;&#12400;&#12289;
  &#24444;&#12425;&#12364;&#36942;&#21435;&#12398;&#12487;&#12540;&#12479;&#12434;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;
  (&#20351;&#29992;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
  &#12431;&#12374;&#12431;&#12374;&#12381;&#12358;&#12375;&#12394;&#12367;&#12390;&#12418;&#36942;&#21435;&#12398;&#12487;&#12540;&#12479;&#12434;&#21033;&#29992;&#12391;&#12365;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
  &#20309;&#12363;&#24517;&#35201;&#12394;&#12418;&#12398;&#12364;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#24444;&#12425;&#12395;&#32862;&#12365;&#12289;
  &#21487;&#33021;&#12394;&#38480;&#12426;&#25903;&#25588;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#37034;&#39764;&#12434;&#12377;&#12427;&#12388;&#12418;&#12426;&#12364;&#12394;&#12356;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390; (&#20182;&#12398;&#35201;&#22240;&#12391;&#12399;&#12394;&#12367;)
  &#12354;&#12367;&#12414;&#12391;&#12418;&#23455;&#21147;&#27425;&#31532;&#12391;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25104;&#21151;&#12363;&#22833;&#25943;&#12364;&#27770;&#12414;&#12427;&#12424;&#12358;&#12394;&#29366;&#24907;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#24907;&#24230;&#12391;&#31034;&#12377;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12377;&#12409;&#12390;&#12434; (&#20844;&#24335;&#12395;) &#34892;&#12358;&#29702;&#30001;&#12399;&#12289;
  &#26032;&#12375;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#20154;&#12383;&#12385;&#12434;&#21161;&#12369;&#12427;&#12383;&#12417;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12300;&#12371;&#12387;&#12385;&#20596;&#12395;&#12356;&#12383;&#12411;&#12358;&#12364;&#20309;&#12363;&#12392;&#23433;&#20840;&#12391;&#12377;&#12424;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#25276;&#12375;&#12388;&#12369;&#12364;&#12414;&#12375;&#12367;&#12394;&#12356;&#26041;&#27861;&#12391;&#38283;&#30330;&#32773;&#12383;&#12385;&#12395;&#20253;&#12360;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  &#25126;&#20105;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#12393;&#12385;&#12425;&#12398;&#38499;&#21942;&#12395;&#23646;&#12377;&#12427;&#12398;&#12363;&#12434;&#26126;&#30906;&#12395;&#12373;&#12379;&#12427;&#12371;&#12392;&#12395;&#12399;&#12381;&#12428;&#12394;&#12426;&#12398;&#24847;&#21619;&#12418;&#12354;&#12426;&#12414;&#12377;
  (&#25126;&#30053;&#30340;&#12394;&#24847;&#21619;&#12289;&#12354;&#12427;&#12356;&#12399;&#20154;&#38291;&#30340;&#12394;&#24847;&#21619;&#12395;&#12362;&#12356;&#12390;)&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12395;&#12362;&#12356;&#12390;&#12399;&#12371;&#12428;&#12399;&#12414;&#12387;&#12383;&#12367;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#24460;&#12391;&#12418;&#20001;&#26041;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12362;&#12362;&#12387;&#12404;&#12425;&#12395;&#27963;&#21205;&#12377;&#12427;&#38283;&#30330;&#32773;&#12418;&#20013;&#12395;&#12399;&#12356;&#12414;&#12377;&#12290;
  &#20001;&#32773;&#12398;&#20114;&#25563;&#24615;&#12434;&#20445;&#12388;&#12383;&#12417;&#12395;&#21147;&#12434;&#27880;&#12356;&#12391;&#12356;&#12383;&#12426;&#12377;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#20998;&#35010;&#12375;&#12383;&#24460;&#12391;&#12418;&#20001;&#26041;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38291;&#12398;&#20132;&#27969;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20596;&#12391;&#36861;&#21152;&#12375;&#12383;&#12377;&#12390;&#12365;&#12394;&#26032;&#27231;&#33021;&#12434;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12418;&#12383;&#12425;&#12375;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;
  (&#12381;&#12358;&#12289;&#12354;&#12394;&#12383;&#12398;&#26395;&#12416;&#12418;&#12398;&#12434;&#12354;&#12385;&#12425;&#20596;&#12391;&#20316;&#12387;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12381;&#12375;&#12390;&#12289;&#23558;&#26469;&#12405;&#12383;&#12383;&#12403;&#20001;&#32773;&#12364;&#21512;&#27969;&#12377;&#12427;&#12392;&#12356;&#12358;&#26395;&#12415;&#12418;&#27531;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
</p><p>
  &#26178;&#12395;&#12399;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12411;&#12358;&#12364;&#22823;&#25104;&#21151;&#12434;&#21454;&#12417;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26368;&#21021;&#12395;&#20998;&#35010;&#12373;&#12379;&#12383;&#24403;&#20107;&#32773;&#12391;&#12373;&#12360;&#33258;&#20998;&#12383;&#12385;&#12398;&#12411;&#12358;&#12364;&#20998;&#23478;&#12384;&#12392;&#35469;&#12417;&#12390;&#12356;&#12427;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
  &#12415;&#12435;&#12394;&#12364;&#12381;&#12385;&#12425;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12411;&#12358;&#12434;&#12378;&#12387;&#12392;&#22909;&#12416;&#12424;&#12358;&#12395;&#12394;&#12426;&#12289;
  &#32080;&#23616;&#26412;&#23478;&#12395;&#21462;&#12387;&#12390;&#20195;&#12431;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#26377;&#21517;&#12394;&#12398;&#12399; GCC/EGCS &#12398;&#20363;&#12391;&#12377;&#12290;
  <em class="firstterm">GNU Compiler Collection</em>
  (<em class="firstterm">GCC</em>&#12289;&#12371;&#12428;&#12399;&#20197;&#21069;&#12399; <em class="firstterm">GNU C
  Compiler</em> &#12392;&#12356;&#12358;&#21517;&#21069;&#12391;&#12375;&#12383;)
  &#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12467;&#12540;&#12489;&#12467;&#12531;&#12497;&#12452;&#12521;&#12392;&#12375;&#12390;&#12418;&#12387;&#12392;&#12418;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12289;
  &#12414;&#12383;&#12418;&#12387;&#12392;&#12418;&#22810;&#12367;&#12398;&#29872;&#22659;&#12395;&#31227;&#26893;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12497;&#12452;&#12521;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  GCC &#12398;&#20844;&#24335;&#12513;&#12531;&#12486;&#12490;&#12540;&#12392; Cygnus Software
  <sup>[<a name="idp3048624" href="#ftn.idp3048624" class="footnote">36</a>]</sup>
  &#12392;&#12398;&#38291;&#12398;&#24847;&#35211;&#12398;&#30456;&#36949;&#12364;&#21407;&#22240;&#12391;&#12289;GCC &#12398;&#12418;&#12387;&#12392;&#12418;&#27963;&#30330;&#12394;&#38283;&#30330;&#32773;&#12464;&#12523;&#12540;&#12503;&#12398;&#12402;&#12392;&#12388;&#12391;&#12354;&#12387;&#12383;
  Cygnus &#12399; GCC &#12434;&#38626;&#12428;&#12390; <em class="firstterm">EGCS</em>
  &#12392;&#12356;&#12358;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12414;&#12375;&#12383;&#12290;
  EGCS &#20596;&#12399;&#12289;&#24847;&#22259;&#30340;&#12395;&#12458;&#12522;&#12472;&#12490;&#12523;&#12392;&#25973;&#23550;&#12377;&#12427;&#12371;&#12392;&#12434;&#36991;&#12369;&#12414;&#12375;&#12383;&#12290;
  EGCS &#12398;&#38283;&#30330;&#32773;&#12399;&#12289;&#27770;&#12375;&#12390;&#33258;&#20998;&#12383;&#12385;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20844;&#24335;&#12394; GCC &#12395;&#12375;&#12424;&#12358;&#12392;&#12399;&#24605;&#12431;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;EGCS &#12434;&#12424;&#12426;&#12424;&#12356;&#12418;&#12398;&#12395;&#12377;&#12427;&#12371;&#12392;&#12384;&#12369;&#12395;&#27880;&#21147;&#12375;&#12289;
  &#12497;&#12483;&#12481;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#38971;&#24230;&#12418;&#20844;&#24335;&#12398; GCC &#12513;&#12531;&#12486;&#12490;&#12540;&#12424;&#12426;&#22810;&#12367;&#12375;&#12414;&#12375;&#12383;&#12290;
  EGCS &#12398;&#20154;&#27671;&#12399;&#22679;&#12375;&#12289;&#22823;&#25163;&#12398; OS &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12479;&#12398;&#20013;&#12395;&#12418;
  &#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12467;&#12531;&#12497;&#12452;&#12521;&#12392;&#12375;&#12390; GCC &#12391;&#12399;&#12394;&#12367; EGCS &#12434;&#25505;&#29992;&#12377;&#12427;&#12392;&#12371;&#12429;&#12364;&#20986;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12371;&#12395;&#12365;&#12390;&#12289;&#12373;&#12377;&#12364;&#12395; "GCC" &#12398;&#21517;&#21069;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#26412;&#23478; GCC &#12398;&#12513;&#12531;&#12486;&#12490;&#12540;&#12383;&#12385;&#12418;&#12431;&#12363;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12415;&#12435;&#12394;&#12364; EGCS &#12395;&#31227;&#34892;&#12377;&#12427;&#12392;&#12365;&#12395;&#12431;&#12374;&#12431;&#12374;&#21517;&#21069;&#12434;&#22793;&#26356;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12399;&#38754;&#20498;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12418;&#12399;&#12420; GCC &#12398;&#21517;&#21069;&#12434;&#24341;&#12365;&#28193;&#12373;&#12374;&#12427;&#12434;&#12360;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12290;
  &#12381;&#12371;&#12391;&#12289;GCC &#12399; EGCS &#12398;&#12467;&#12540;&#12489;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;
  GCC &#12399;&#20877;&#12403;&#32113;&#19968;&#12373;&#12428;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12458;&#12522;&#12472;&#12490;&#12523;&#12363;&#12425;&#20998;&#12363;&#12428;&#12390;&#12289;&#26032;&#12383;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#12362;&#12363;&#12370;&#12391;&#12289;
  &#20013;&#36523;&#12399;&#12392;&#12390;&#12418;&#25913;&#33391;&#12373;&#12428;&#12383;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#20363;&#12402;&#12392;&#12388;&#12392;&#12387;&#12390;&#12418;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;&#12434;&#21336;&#32020;&#12395;&#24746;&#12392;&#12415;&#12394;&#12377;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12364;&#12424;&#12367;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12395;&#36215;&#12371;&#12387;&#12383;&#12392;&#12365;&#12399;&#33510;&#30171;&#12434;&#24863;&#12376;&#12390;&#12354;&#12414;&#12426;&#27475;&#36814;&#12373;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12381;&#12428;&#12364;&#25104;&#21151;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12394;&#12435;&#12390;&#12381;&#12398;&#12392;&#12365;&#12395;&#12399;&#30693;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12354;&#12394;&#12383;&#12434;&#21547;&#12416;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12391;&#12365;&#12427;&#12371;&#12392;&#12392;&#12356;&#12360;&#12400;&#12289;
  &#24444;&#12425;&#12434;&#35211;&#23432;&#12426;&#32154;&#12369;&#12390;&#26032;&#27231;&#33021;&#12420;&#12467;&#12540;&#12489;&#12434;&#21462;&#12426;&#36796;&#12417;&#12427;&#12424;&#12358;&#12395;&#28310;&#20633;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12367;&#12425;&#12356;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12411;&#12358;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12398;&#21033;&#30410;&#12395;&#12394;&#12427;&#12392;&#30342;&#12364;&#21516;&#24847;&#12375;&#12383;&#12425;&#12289;
  &#31350;&#26997;&#12398;&#36984;&#25246;&#12392;&#12375;&#12390;&#24444;&#12425;&#12395;&#21512;&#27969;&#12377;&#12427;&#12371;&#12392;&#12418;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12428;&#21152;&#12431;&#12427;&#12513;&#12531;&#12496;&#12540;&#12434;&#12415;&#12428;&#12400;
  &#12381;&#12428;&#12364;&#25104;&#21151;&#12377;&#12427;&#12363;&#22833;&#25943;&#12377;&#12427;&#12363;&#12434;&#12354;&#12427;&#31243;&#24230;&#20104;&#28204;&#12391;&#12365;&#12427;&#12371;&#12392;&#12418;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#25991;&#21477;&#12400;&#12363;&#12426;&#35328;&#12387;&#12390;&#12356;&#12383;&#20154;&#12364;
  &#19968;&#25569;&#12426;&#12398;&#19981;&#28288;&#20998;&#23376; (&#24444;&#12425;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12399;&#24314;&#35373;&#30340;&#12394;&#25391;&#12427;&#33310;&#12356;&#12434;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;)
  &#12434;&#24341;&#12365;&#36899;&#12428;&#12390;&#26032;&#12383;&#12394;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#12416;&#12375;&#12429;&#12381;&#12358;&#12375;&#12390;&#12367;&#12428;&#12383;&#12411;&#12358;&#12364;&#12354;&#12426;&#12364;&#12383;&#12363;&#12387;&#12383;&#12391;&#12375;&#12423;&#12358;&#12397;&#12290;
  &#24444;&#12425;&#12364;&#26412;&#23478;&#12395;&#21462;&#12387;&#12390;&#20195;&#12431;&#12427;&#12371;&#12392;&#12434;&#24515;&#37197;&#12377;&#12427;&#24517;&#35201;&#12418;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12375;&#30342;&#12395;&#23562;&#25964;&#12373;&#12428;&#12390;&#12356;&#12427;&#23455;&#21147;&#32773;&#12364;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12398;&#12394;&#12425;&#12289;
  &#12394;&#12380;&#12381;&#12435;&#12394;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12398;&#12363;&#33258;&#20998;&#12395;&#21839;&#12356;&#36820;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#21046;&#32004;&#12364;&#22810;&#12377;&#12366;&#12289;
  &#12420;&#12426;&#12383;&#12356;&#12371;&#12392;&#12398;&#19968;&#37096; (&#12354;&#12427;&#12356;&#12399;&#12377;&#12409;&#12390;)
  &#12434;&#23455;&#29694;&#12377;&#12427;&#12395;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#12387;&#12390;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#12375;&#12363;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#35201;&#12377;&#12427;&#12395;&#12289;&#33258;&#12425;&#12364;&#34892;&#21205;&#12377;&#12427;&#12371;&#12392;&#12391;&#20182;&#12398;&#20998;&#35010;&#12398;&#21205;&#12365;&#12434;&#36991;&#12369;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="forks-initiating"></a>&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;</h3></div></div></div><p>
  &#12371;&#12371;&#12391;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12289;&#26368;&#24460;&#12398;&#25163;&#27573;&#12392;&#12375;&#12390;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#12356;&#12289;
  &#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12374;&#12427;&#12434;&#24471;&#12394;&#12367;&#12394;&#12387;&#12383;&#20154;&#12383;&#12385;&#12395;&#21521;&#12369;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#31435;&#12385;&#19978;&#12370;&#12434;&#22987;&#12417;&#12427;&#21069;&#12395;&#12289;&#12414;&#12378;&#20182;&#12398;&#21487;&#33021;&#24615;&#12434;&#24505;&#24213;&#30340;&#12395;&#35430;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#23455;&#38555;&#12395;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#12392;&#12289;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;&#38283;&#30330;&#32773;&#12434;&#22833;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20206;&#12395;&#24460;&#12391;&#26032;&#12375;&#12356;&#38283;&#30330;&#32773;&#12364;&#22679;&#12360;&#12427;&#12392;&#12375;&#12390;&#12418;&#12289;&#12381;&#12358;&#12394;&#12427;&#30906;&#35388;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#12518;&#12540;&#12470;&#12540;&#12398;&#27671;&#12434;&#24341;&#12367;&#12383;&#12417;&#12398;&#31478;&#20105;&#12364;&#22987;&#12414;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#20154;&#12383;&#12385;&#12399;&#12415;&#12435;&#12394;&#24745;&#12416;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  "&#12391;&#12289;&#12356;&#12387;&#12383;&#12356;&#31169;&#12399;&#12393;&#12387;&#12385;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12426;&#12419;&#12356;&#12356;&#12398;?"
  &#12354;&#12394;&#12383;&#12364;&#12393;&#12385;&#12425;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#29366;&#27841;&#12399;&#28151;&#27788;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#36074;&#21839;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#21069;&#12395;&#12399;&#20986;&#12394;&#12363;&#12387;&#12383;&#12431;&#12369;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#20013;&#12395;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#29983;&#24907;&#31995;&#19978;&#12372;&#12367;&#33258;&#28982;&#12394;&#12371;&#12392;&#12384;&#12392;&#12356;&#12358;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#33258;&#28982;&#28120;&#27760;&#12398;&#32080;&#26524;&#12289;&#19968;&#30058;&#29872;&#22659;&#12395;&#36969;&#21512;&#12375;&#12383;&#12418;&#12398;&#12364;&#29983;&#12365;&#27531;&#12427;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#32080;&#23616;&#12399;&#12415;&#12435;&#12394;&#12364;&#12424;&#12426;&#12424;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#29983;&#24907;&#31995;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12381;&#12428;&#12364;&#30495;&#23455;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#20491;&#12293;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12399;&#27770;&#12375;&#12390;&#30495;&#23455;&#12391;&#12354;&#12427;&#12392;&#12399;&#12356;&#12360;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12375;&#12390;&#12418;&#12289;
  &#26032;&#12383;&#12395;&#31435;&#12385;&#19978;&#12364;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25104;&#21151;&#12377;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#20998;&#35010;&#12375;&#12390;&#12418;&#12424;&#12356;&#32080;&#26524;&#12434;&#29983;&#12415;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#32080;&#35542;&#12392;&#12375;&#12390;&#12399;&#12289;&#35696;&#35542;&#12398;&#12493;&#12479;&#12392;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12434;&#25345;&#12385;&#20986;&#12375;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#8212;"&#20474;&#12398;&#35328;&#12358;&#12392;&#12362;&#12426;&#12395;&#12375;&#12390;&#12367;&#12428;&#12394;&#12365;&#12419;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12375;&#12385;&#12419;&#12358;&#12424;!"&#8212; &#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12395;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12415;&#12435;&#12394;&#30693;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#38283;&#30330;&#32773;&#12398;&#33288;&#21619;&#12434;&#12402;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12425;&#12289;
  &#26032;&#12375;&#12356;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#34892;&#12367;&#26411;&#12399;&#38263;&#12367;&#12394;&#12356;&#12371;&#12392;&#12364;&#22810;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#38306;&#20418;&#32773; (&#38283;&#30330;&#32773;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12518;&#12540;&#12470;&#12540;&#12420;&#21508; OS &#21521;&#12369;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#20316;&#25104;&#25285;&#24403;&#32773;&#12394;&#12393;&#12418;)
  &#12364;&#12393;&#12385;&#12425;&#20596;&#12434;&#36984;&#12406;&#12398;&#12363;&#12398;&#21028;&#26029;&#12434;&#36843;&#12425;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12354;&#12367;&#12414;&#12391;&#12418;&#12381;&#12428;&#20197;&#22806;&#12398;&#12420;&#12426;&#26041;&#12364;&#12394;&#12356;&#12371;&#12392;&#12364;&#30906;&#23455;&#12395;&#20027;&#24373;&#12391;&#12365;&#12427;&#29366;&#27841;&#12395;&#12394;&#12425;&#12394;&#12356;&#38480;&#12426;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12427;&#12398;&#12399;&#36991;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12427;&#12371;&#12392;&#12391;&#29983;&#12414;&#12428;&#12427;&#12289;
  &#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25104;&#21151;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#21487;&#33021;&#24615;&#12434;&#35413;&#20385;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;
  <span class="emphasis"><em>&#12377;&#12409;&#12390;&#12398;</em></span> &#35201;&#32032;&#12434;&#32771;&#24942;&#12395;&#12356;&#12428;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12398;&#22810;&#12367;&#12364;&#21516;&#12376;&#38599;&#12356;&#20027;&#12398;&#12418;&#12392;&#12391;&#20685;&#12356;&#12390;&#12356;&#12427;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#24444;&#12425;&#12364;&#19981;&#28288;&#12434;&#25265;&#12356;&#12390;&#20491;&#20154;&#30340;&#12395;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#12434;&#32771;&#12360;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#38599;&#12356;&#20027;&#12364;&#12381;&#12428;&#12395;&#21453;&#23550;&#12375;&#12390;&#12356;&#12427;&#12392;&#30693;&#12428;&#12400;
  &#22768;&#12434;&#22823;&#12395;&#12375;&#12390;&#12381;&#12428;&#12434;&#35328;&#12358;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#22810;&#12367;&#12399;&#12289;
  &#12467;&#12540;&#12489;&#12395;&#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#36969;&#29992;&#12373;&#12428;&#12390;&#12356;&#12383;&#12425;
  &#29305;&#23450;&#12398;&#20225;&#26989;&#12395;&#38283;&#30330;&#12364;&#24038;&#21491;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12392;&#32771;&#12360;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#31350;&#26997;&#12398;&#24847;&#21619;&#12391;&#12399;&#12289;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#33258;&#30001;&#12434;&#20445;&#35388;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;&#20107;&#23455;&#12391;&#12377;&#12290;
  &#12384;&#12428;&#12363;&#12364;&#26412;&#24403;&#12395;&#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#20998;&#12363;&#12428;&#12390;&#12289;
  &#26032;&#12375;&#12356;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#12434;&#26395;&#12415;
  &#12381;&#12428;&#12384;&#12369;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;&#12354;&#12427;&#12398;&#12394;&#12425;&#12289;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12399;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#12481;&#12540;&#12512;&#12399;
  &#12411;&#12412;&#29305;&#23450;&#12398;&#22243;&#20307;&#12364;&#36039;&#37329;&#28304;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#22810;&#12367;&#12289;
  &#12381;&#12428;&#12434;&#38560;&#12381;&#12358;&#12392;&#12375;&#12390;&#12418;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#22243;&#20307;&#12364;&#12381;&#12358;&#12375;&#12383;&#21205;&#12365;&#12395;&#21453;&#23550;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#12425;&#12289;
  &#12383;&#12392;&#12360;&#38283;&#30330;&#32773;&#12364;&#21442;&#21152;&#12377;&#12427;&#27671;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;
  &#23455;&#38555;&#12395;&#12399;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12381;&#12428;&#12391;&#12418;&#12414;&#12384;&#12300;&#20170;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#20998;&#12363;&#12428;&#12390;&#12289;
  &#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#20197;&#22806;&#12394;&#12356;&#12301;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289;
  &#12414;&#12378;&#12399;&#20491;&#20154;&#30340;&#12395;&#36059;&#21516;&#12375;&#12390;&#12367;&#12428;&#12427;&#20210;&#38291;&#12434;&#38598;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12363;&#12425;&#12289;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12434; (&#12369;&#12435;&#12363;&#33136;&#12391;&#12399;&#12394;&#12367;) &#12362;&#12384;&#12420;&#12363;&#12395;&#23459;&#35328;&#12375;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#29694;&#22312;&#12398;&#12513;&#12531;&#12486;&#12490;&#12540;&#12395;&#12383;&#12356;&#12375;&#12390;&#24594;&#12426;&#12420;&#22833;&#26395;&#12398;&#27671;&#25345;&#12385;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12434;&#23455;&#38555;&#12395;&#35328;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#27770;&#24515;&#12375;&#12383;&#12365;&#12387;&#12363;&#12369;&#12399;&#20309;&#12394;&#12398;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#29694;&#22312;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#24746;&#24847;&#12399;&#12414;&#12387;&#12383;&#12367;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#20919;&#38745;&#12395;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12427;&#12388;&#12418;&#12426; (&#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32202;&#24613;&#24453;&#36991;&#12373;&#12379;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;)
  &#12391;&#12354;&#12427;&#12394;&#12425;&#12289;&#12354;&#12367;&#12414;&#12391;&#12418;&#12467;&#12540;&#12489;&#12434;&#27966;&#29983;&#12373;&#12379;&#12427;&#12398;&#12391;&#12354;&#12387;&#12390;&#12458;&#12522;&#12472;&#12490;&#12523;&#12392;&#21516;&#12376;&#21517;&#21069;&#12434;&#20351;&#12358;&#12398;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24375;&#35519;&#12375;&#12289;
  &#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12392;&#34909;&#31361;&#12377;&#12427;&#12371;&#12392;&#12398;&#12394;&#12356;&#21517;&#21069;&#12434;&#36984;&#12403;&#12414;&#12377;&#12290;
  &#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12365;&#12385;&#12435;&#12392;&#21306;&#21029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12394;&#21517;&#21069;&#12391;&#12354;&#12428;&#12400;&#12289;
  &#12381;&#12398;&#19968;&#37096;&#12395;&#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12391;
  &#12300;&#12371;&#12428;&#12399;&#20803;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12363;&#12425;&#20998;&#38626;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;&#20803;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#32622;&#12365;&#25563;&#12360;&#12427;&#12371;&#12392;&#12434;&#30446;&#25351;&#12375;&#12390;&#12356;&#12427;&#12301;
  &#12392;&#35500;&#26126;&#12377;&#12427;&#12398;&#12399;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#21306;&#21029;&#12375;&#12395;&#12367;&#12356;&#12424;&#12358;&#12394;&#29366;&#27841;&#12395;&#12518;&#12540;&#12470;&#12540;&#12434;&#38501;&#12428;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12399;&#36991;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#26368;&#24460;&#12395;&#12289;&#12424;&#12356;&#12473;&#12479;&#12540;&#12488;&#12434;&#20999;&#12427;&#12383;&#12417;&#12398;&#12402;&#12392;&#12388;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;
  &#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#20840;&#21729;&#12395;&#23550;&#12375;&#12390; (&#12383;&#12392;&#12360;&#26126;&#31034;&#30340;&#12395;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31435;&#12385;&#19978;&#12370;&#12395;&#21453;&#23550;&#12375;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;)
  &#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#24444;&#12425;&#12364;&#12381;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#19968;&#20999;&#20351;&#29992;&#12375;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12354;&#12394;&#12383;&#12363;&#12425;&#12398;
  &#12300;&#24847;&#35211;&#12398;&#19981;&#19968;&#33268;&#12399;&#12354;&#12387;&#12383;&#12369;&#12428;&#12393;&#12418;&#12289;&#25973;&#12395;&#12394;&#12387;&#12383;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12290;
  &#12424;&#12356;&#12467;&#12540;&#12489;&#12394;&#12425;&#12393;&#12394;&#12383;&#12363;&#12425;&#12398;&#12418;&#12398;&#12391;&#12418;&#27475;&#36814;&#12375;&#12414;&#12377;&#12301;&#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#20253;&#12431;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3048624" href="#idp3048624" class="para">36</a>] </sup>
      &#29694;&#22312;&#12399; RedHat (<a class="ulink" href="http://www.redhat.com/" target="_top">http://www.redhat.com/</a>)
      &#12395;&#21560;&#21454;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="credit.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="governments-and-open-source.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12463;&#12524;&#12472;&#12483;&#12488; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#31532;9&#31456; Governments and Open Source</td></tr></table></div></body></html>
