<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="contracting.html" title="&#22865;&#32004;&#12377;&#12427;"><link rel="next" href="marketing.html" title="&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="contracting.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="marketing.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="funding-non-programming"></a>&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;</h2></div></div></div><p>
    &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#34892;&#12431;&#12428;&#12427;&#27963;&#21205;&#12398;&#19968;&#37096;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12363;&#12425;&#35211;&#12427;&#12392;&#12289;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12399;&#12418;&#12387;&#12392;&#12418;&#30446;&#31435;&#12388;&#12289;&#33775;&#12420;&#12363;&#12394;&#37096;&#20998;&#12391;&#12377;&#12290;&#12371;&#12398;&#12371;&#12392;&#12399;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12486;&#12473;&#12488;&#12394;&#12393;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12364;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#27604;&#36611;&#12377;&#12427;&#12392;&#27531;&#24565;&#12394;&#12364;&#12425;&#28961;&#35222;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#20225;&#26989;&#12399;&#12289;&#33258;&#12425;&#12364;&#25345;&#12388;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#12398;&#20869;&#37096;&#12452;&#12531;&#12501;&#12521;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19982;&#12360;&#12427;&#12371;&#12392;&#12391;&#12289;&#12371;&#12358;&#12375;&#12383;&#28961;&#35222;&#12373;&#12428;&#12364;&#12385;&#12394;&#27963;&#21205;&#12434;&#22475;&#12417;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#20869;&#37096;&#12452;&#12531;&#12501;&#12521;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12358;&#12414;&#12367;&#19982;&#12360;&#12427;&#12383;&#12417;&#12398;&#37749;&#12399;&#12289;&#20225;&#26989;&#12398;&#20869;&#37096;&#12503;&#12525;&#12475;&#12473;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12381;&#12428;&#12395;&#22793;&#25563;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12371;&#12398;&#22793;&#25563;&#12395;&#12399;&#12381;&#12428;&#12394;&#12426;&#12398;&#21162;&#21147;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#20225;&#26989;&#12398;&#20869;&#37096;&#12503;&#12525;&#12475;&#12473;&#12392;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12381;&#12428;&#12399;&#19968;&#33268;&#12375;&#12394;&#12356;&#12371;&#12392;&#12364;&#22810;&#12356;&#12391;&#12377;&#12375;&#12289;&#12381;&#12358;&#12375;&#12383;&#36949;&#12356;&#12399;&#20154;&#38291;&#12364;&#20171;&#20837;&#12375;&#12394;&#12356;&#12392;&#22475;&#12417;&#12425;&#12428;&#12394;&#12356;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#20225;&#26989;&#12392;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#30064;&#12394;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#21516;&#12376;&#12418;&#12398;&#12434;&#20351;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#33988;&#31309;&#12375;&#12383;&#12487;&#12540;&#12479;&#12364;&#20840;&#12367;&#36949;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#20225;&#26989;&#12398;&#12496;&#12464;&#36861;&#36321;&#12398;&#23550;&#35937;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12381;&#12428;&#12392;&#12399;&#20840;&#12367;&#36949;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;&#19968;&#26041;&#12398;&#12471;&#12473;&#12486;&#12512;&#12395;&#12354;&#12427;&#24773;&#22577;&#12398;&#26029;&#29255;&#12399;&#12289;&#12418;&#12358;&#29255;&#26041;&#12398;&#12471;&#12473;&#12486;&#12512;&#12395;&#21453;&#26144;&#12373;&#12379;&#12427;&#12409;&#12365;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12375;&#12289;&#20225;&#26989;&#31192;&#23494;&#12395;&#38306;&#12431;&#12427;&#12418;&#12398;&#12384;&#12363;&#12425;&#21066;&#38500;&#12377;&#12409;&#12365;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12375;&#12289;&#19968;&#26041;&#12395;&#12394;&#12356;&#12418;&#12398;&#12434;&#12418;&#12358;&#29255;&#26041;&#12395;&#36861;&#21152;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12371;&#12371;&#12391;&#12399;&#12289;&#20225;&#26989;&#12392;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12381;&#12358;&#12375;&#12383;&#28857;&#12391;&#27211;&#28193;&#12375;&#12377;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#12358;&#12414;&#12367;&#27211;&#28193;&#12375;&#12377;&#12428;&#12400;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12424;&#12426;&#38918;&#35519;&#12395;&#21205;&#12365;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12399;&#19982;&#12360;&#12425;&#12428;&#12383;&#12522;&#12477;&#12540;&#12473;&#12434;&#29702;&#35299;&#12377;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;&#20225;&#26989;&#12364;&#33258;&#20998;&#12398;&#12456;&#12468;&#12398;&#12383;&#12417;&#12395;&#29289;&#20107;&#12434;&#19981;&#36969;&#20999;&#12395;&#36914;&#12417;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#30097;&#12431;&#12394;&#12367;&#12394;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#21697;&#36074;&#20445;&#35388; (&#12486;&#12473;&#12488;&#12398;&#23554;&#38272;&#23478;&#12394;&#12393;)"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-qa"></a>&#21697;&#36074;&#20445;&#35388; (&#12486;&#12473;&#12488;&#12398;&#23554;&#38272;&#23478;&#12394;&#12393;)</h3></div></div></div><p>
    &#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12391;&#12399;&#12289;&#12496;&#12464;&#25506;&#12375;&#12420;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12289;
    &#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12398;&#12486;&#12473;&#12488;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#30906;&#35469;&#12289;
    &#12394;&#12393;&#12398;&#21697;&#36074;&#20445;&#35388;&#23554;&#38272;&#12481;&#12540;&#12512;&#12434;&#32622;&#12367;&#12371;&#12392;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12394;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#12399;&#12289;
    &#21697;&#36074;&#20445;&#35388;&#12395;&#38306;&#12377;&#12427;&#27963;&#21205;&#12399;&#31309;&#26997;&#30340;&#12395;&#34892;&#12431;&#12428;&#12394;&#12356;&#12398;&#12364;&#19968;&#33324;&#30340;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12486;&#12473;&#12488;&#12398;&#12424;&#12358;&#12394;&#22320;&#21619;&#12394;&#20181;&#20107;&#12434;&#12420;&#12387;&#12390;&#12367;&#12428;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#20154;&#12399;&#12394;&#12363;&#12394;&#12363;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#25968;&#12364;&#22810;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#12399;&#12289;
    &#12486;&#12473;&#12488;&#12398;&#32178;&#32645;&#29575;&#12364;&#39640;&#12367;&#12394;&#12427;&#12392;&#20154;&#12293;&#12364;&#32771;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12420;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12398;&#12486;&#12473;&#12488;&#12398;&#22580;&#21512;&#12399;&#12289;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12399;&#24517;&#35201;&#12394;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12522;&#12477;&#12540;&#12473;&#12434;&#24471;&#12425;&#12428;&#12394;&#12356;&#12363;&#12425;&#12289;
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#22810;&#12367;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#25265;&#12360;&#12390;&#12356;&#12427;&#12503;&#12525;&#12480;&#12463;&#12488;&#12395;&#12399;&#22810;&#12367;&#12398;&#12486;&#12473;&#12479;&#12540;&#12364;&#12356;&#12427;&#12289;
    &#12392;&#12356;&#12358;&#32771;&#12360;&#12399;&#20840;&#12367;&#26681;&#25312;&#12364;&#12394;&#12356;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#19968;&#33324;&#30340;&#12394;&#29872;&#22659;&#12391;&#12289;
    &#22522;&#30990;&#30340;&#12394;&#27231;&#33021;&#12395;&#12486;&#12473;&#12479;&#12540;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12398;&#12399;&#12354;&#12414;&#12426;&#24847;&#21619;&#12364;&#12394;&#12356;&#12398;&#12399;&#30906;&#12363;&#12391;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12358;&#12356;&#12358;&#29366;&#27841;&#12391;&#12399;&#12496;&#12464;&#12364;&#12377;&#12368;&#12395;&#35211;&#12388;&#12363;&#12427;&#12398;&#12364;&#33258;&#28982;&#12398;&#27969;&#12428;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12383;&#12384;&#20181;&#20107;&#12434;&#12371;&#12394;&#12381;&#12358;&#12392;&#12377;&#12427;&#12384;&#12369;&#12394;&#12398;&#12391;&#12289;
    &#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#21205;&#20316;&#12398;&#38480;&#30028;&#12434;&#24847;&#22259;&#30340;&#12395;&#25506;&#12381;&#12358;&#12392;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12424;&#12387;&#12390;&#12354;&#12427;&#31243;&#24230;&#12398;&#12496;&#12464;&#12364;&#27531;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12373;&#12425;&#12395;&#12289;&#23481;&#26131;&#12395;&#22238;&#36991;&#12377;&#12427;&#26041;&#27861;&#12364;&#12354;&#12427;&#12496;&#12464;&#12398;&#22580;&#21512;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#12496;&#12464;&#12434;&#22577;&#21578;&#12379;&#12378;&#12395;&#40665;&#12387;&#12390;&#12381;&#12398;&#22238;&#36991;&#31574;&#12434;&#20351;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#22810;&#12356;&#12391;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#27833;&#26029;&#12394;&#12425;&#12394;&#12356;&#12398;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#39015;&#23458;
    (<span class="emphasis"><em>&#12354;&#12394;&#12383;&#12364;</em></span> &#38306;&#24515;&#12364;&#12354;&#12427;&#20154;&#12383;&#12385;&#12391;&#12377;)
    &#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20351;&#12356;&#26041;&#12364;&#12289;
    &#12381;&#12371;&#12425;&#36794;&#12395;&#12356;&#12427;&#24179;&#22343;&#30340;&#12394;&#12518;&#12540;&#12470;&#12540;&#12398;&#20351;&#12356;&#26041;&#12392;&#36949;&#12358;&#22580;&#21512;&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12486;&#12473;&#12488;&#23554;&#38272;&#12398;&#12481;&#12540;&#12512;&#12399;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#25163;&#21512;&#12356;&#12398;&#12496;&#12464;&#12434;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12418;&#30330;&#35211;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
    &#38627;&#12375;&#12356;&#12398;&#12399;&#12289;&#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12364;&#34892;&#12387;&#12383;&#20316;&#26989;&#12398;&#32080;&#26524;&#12434;&#12289;
    &#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#26041;&#27861;&#12391;&#30342;&#12395;&#20253;&#12360;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#32068;&#32340;&#20869;&#12398;&#12486;&#12473;&#12488;&#23554;&#38272;&#37096;&#32626;&#12399;&#12289;
    &#12486;&#12473;&#12488;&#32080;&#26524;&#12434;&#22577;&#21578;&#12377;&#12427;&#29420;&#33258;&#12398;&#12420;&#12426;&#26041;&#12434;&#12381;&#12428;&#12382;&#12428;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#20225;&#26989;&#29420;&#33258;&#12398;&#26041;&#35328;&#12420;&#12289;
    &#29305;&#23450;&#12398;&#39015;&#23458;&#12420;&#24444;&#12425;&#21521;&#12369;&#12398;&#12487;&#12540;&#12479;&#12395;&#38306;&#12377;&#12427;&#29305;&#23450;&#12398;&#30693;&#35672;&#12394;&#12393;&#12391;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12387;&#12383;&#29420;&#33258;&#12398;&#24773;&#22577;&#12399;&#12289;&#26360;&#24335;&#12420;&#31192;&#23494;&#20445;&#25345;&#12398;&#35251;&#28857;&#12363;&#12425;&#12289;
    &#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#36617;&#12379;&#12427;&#12398;&#12399;&#19981;&#36969;&#20999;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12354;&#12394;&#12383;&#12398;&#20225;&#26989;&#12391;&#20351;&#12387;&#12390;&#12356;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12381;&#12428;&#12392;&#21516;&#12376;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#29305;&#23450;&#12398;&#20225;&#26989;&#21521;&#12369;&#12398;&#12467;&#12513;&#12531;&#12488;&#12420;&#12496;&#12464;&#12395;&#38306;&#12377;&#12427;&#12513;&#12479;&#12487;&#12540;&#12479;
    (&#12383;&#12392;&#12360;&#12400;&#12289;&#12496;&#12464;&#12395;&#23550;&#12377;&#12427;&#20869;&#37096;&#30340;&#12394;&#20778;&#20808;&#24230;&#12420;&#12289;
    &#29305;&#23450;&#12398;&#39015;&#23458;&#21521;&#12369;&#12395;&#35299;&#27770;&#12377;&#12427;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;) &#12434;&#20316;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#24773;&#22577;&#12399;&#22806;&#37096;&#12395;&#12399;&#28431;&#12425;&#12373;&#12394;&#12356;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#8212;
    &#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#39015;&#23458;&#12395;&#12377;&#12425;&#12415;&#12379;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12383;&#12392;&#12360;&#31192;&#23494;&#12391;&#12394;&#12367;&#12390;&#12418;&#12289;
    &#12381;&#12428;&#12425;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12399;&#38306;&#24515;&#12364;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12381;&#12358;&#12375;&#12383;&#24773;&#22577;&#12395;&#27671;&#12434;&#21462;&#12425;&#12428;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;<span class="emphasis"><em>&#12496;&#12464;&#22577;&#21578;&#12381;&#12398;&#12418;&#12398;</em></span> &#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#37325;&#35201;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#23455;&#38555;&#12289;&#12486;&#12473;&#12488;&#23554;&#38272;&#12398;&#12481;&#12540;&#12512;&#12363;&#12425;&#12354;&#12364;&#12387;&#12390;&#12365;&#12383;&#12496;&#12464;&#22577;&#21578;&#12399;&#12289;
    &#22810;&#12367;&#12398;&#12518;&#12540;&#12470;&#12540;&#12363;&#12425;&#21463;&#12369;&#21462;&#12427;&#12381;&#12428;&#12424;&#12426;&#12418;&#12354;&#12427;&#24847;&#21619;&#20385;&#20516;&#12364;&#12354;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#24444;&#12425;&#12399;&#12518;&#12540;&#12470;&#12540;&#12364;&#35519;&#12409;&#12390;&#12367;&#12428;&#12394;&#12356;&#12371;&#12392;&#12434;&#35519;&#12409;&#12390;&#12367;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12363;&#12425;&#12375;&#12363;&#12354;&#12364;&#12387;&#12390;&#12371;&#12394;&#12356;&#12496;&#12464;&#22577;&#21578;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;
    &#30906;&#23455;&#12395;&#20445;&#23384;&#12375;&#12390;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#30906;&#23455;&#12395;&#20445;&#23384;&#12377;&#12427;&#12395;&#12399;&#12289;&#24444;&#12425;&#12364;&#30452;&#25509;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#21839;&#38988;&#12434;&#30331;&#37682;&#12377;&#12427;&#12363;&#12289;
    &#24444;&#12425;&#12392;&#12398;&#20210;&#20171;&#24441; (&#36890;&#24120;&#12399;&#38283;&#30330;&#32773;&#12398;&#12402;&#12392;&#12426;) &#12364;&#12289;
    &#20869;&#37096;&#21521;&#12369;&#12398;&#12496;&#12464;&#22577;&#21578;&#12434;&#26032;&#12375;&#12356;&#12418;&#12398;&#12395;&#12300;&#32763;&#35379;&#12301;&#12375;&#12390;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12356;&#12358;&#12300;&#32763;&#35379;&#12301;&#12392;&#12399;&#12289;&#21336;&#12395;&#39015;&#23458;&#29305;&#26377;&#12398;&#12487;&#12540;&#12479; (&#12496;&#12464;&#12398;&#20877;&#29694;&#25163;&#38918;&#12395;&#12399;&#12289;
    &#21247;&#35542;&#39015;&#23458;&#12398;&#21516;&#24847;&#12434;&#24471;&#12383;&#19978;&#12391;&#39015;&#23458;&#12398;&#12487;&#12540;&#12479;&#12434;&#20351;&#12358;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;)
    &#12434;&#21442;&#29031;&#12379;&#12378;&#12395;&#12496;&#12464;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12364;&#30452;&#25509;&#21839;&#38988;&#12434;&#30331;&#37682;&#12377;&#12427;&#26041;&#12364;&#12393;&#12385;&#12425;&#12363;&#12392;&#12356;&#12360;&#12400;&#26395;&#12414;&#12375;&#12356;&#12391;&#12377;&#12290;
    &#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12354;&#12394;&#12383;&#12398;&#20225;&#26989;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#30452;&#25509;&#36002;&#29486;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#12450;&#12500;&#12540;&#12523;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#24441;&#12395;&#31435;&#12388;&#12496;&#12464;&#22577;&#21578;&#12434;&#12377;&#12427;&#12392;&#12289;
    &#25216;&#34899;&#30340;&#12394;&#36002;&#29486;&#12434;&#12377;&#12427;&#12371;&#12392;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12408;&#12398;&#20449;&#38972;&#12399;&#39640;&#12414;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;
    &#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12392;&#30452;&#25509;&#35441;&#12434;&#12377;&#12427;&#27231;&#20250;&#12395;&#32331;&#12364;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12496;&#12464;&#22577;&#21578;&#12471;&#12473;&#12486;&#12512;&#12434;&#35211;&#24373;&#12387;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#12496;&#12464; (&#12371;&#12428;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#12434;&#24444;&#12425;&#12399;&#25345;&#12383;&#12394;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;) &#12434;&#20462;&#27491;&#12377;&#12427;&#20316;&#26989;&#12395;&#27880;&#21147;&#12391;&#12365;&#12289;
    &#12381;&#12398;&#20462;&#27491;&#12364;&#26395;&#12414;&#12375;&#12356;&#32080;&#26524;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#12363;&#26908;&#35388;&#12377;&#12427;&#12424;&#12358;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#19978;&#12395;&#12467;&#12513;&#12531;&#12488;&#12377;&#12427;&#12371;&#12392;&#12391;&#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12395;&#38972;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12363;&#12425;&#22810;&#23569;&#12398;&#25269;&#25239;&#12364;&#12354;&#12427;&#12371;&#12392;&#12399;&#35226;&#24735;&#12375;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;&#12486;&#12473;&#12488;&#12434;&#12379;&#12356;&#12380;&#12356;&#24517;&#35201;&#24746;&#12367;&#12425;&#12356;&#12395;&#12375;&#12363;&#24605;&#12431;&#12394;&#12356;&#20670;&#21521;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12486;&#12473;&#12488;&#12481;&#12540;&#12512;&#12364;&#37325;&#35201;&#12394;&#12496;&#12464;&#12434;&#30330;&#35211;&#12375;&#12289;
    &#29702;&#35299;&#12375;&#12420;&#12377;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#34892;&#12360;&#12400;&#12289;&#12371;&#12358;&#12375;&#12383;&#25269;&#25239;&#12434;&#25391;&#12426;&#25173;&#12358;&#12398;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12289;&#24444;&#12425;&#12398;&#12496;&#12464;&#22577;&#21578;&#12398;&#36074;&#12364;&#12518;&#12540;&#12470;&#12540;&#12363;&#12425;&#12354;&#12364;&#12387;&#12390;&#12367;&#12427;&#12381;&#12428;&#12392;&#22823;&#24046;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#38283;&#30330;&#32773;&#12392;&#24444;&#12425;&#12364;&#30452;&#25509;&#35441;&#12434;&#12377;&#12427;&#24847;&#21619;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#12289;&#32068;&#32340;&#20869;&#37096;&#12398;&#12496;&#12464;&#22577;&#21578;&#12364;&#12289;
    &#22806;&#37096;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12356;&#12387;&#12383;&#12435;&#30331;&#37682;&#12373;&#12428;&#12383;&#12425;&#12289;
    &#32068;&#32340;&#20869;&#37096;&#12398;&#24773;&#22577;&#12399;&#12289;&#12381;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12418;&#12398;&#12434;&#21442;&#29031;&#12373;&#12379;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#32068;&#32340;&#12398;&#31649;&#29702;&#32773;&#12420;&#38599;&#12431;&#12428;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12399;&#12289;
    &#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#39015;&#23458;&#12395;&#29305;&#26377;&#12398;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#27880;&#37320;&#12434;&#20184;&#12369;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12415;&#12435;&#12394;&#12364;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#22806;&#37096;&#12398;&#24773;&#22577;&#12434;&#21033;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#20316;&#26989;&#12398;&#36942;&#31243;&#12391;&#12289;&#12354;&#12394;&#12383;&#12395;&#12399;&#20313;&#35336;&#12394;&#36000;&#25285;&#12364;&#25499;&#12363;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12375;&#12363;&#12496;&#12464;&#12364;&#12394;&#12356;&#12398;&#12395;&#20108;&#37325;&#12395;&#12496;&#12464;&#22577;&#21578;&#12434;&#31649;&#29702;&#12377;&#12427;&#12398;&#12399;&#12289;
    &#12402;&#12392;&#12388;&#12434;&#31649;&#29702;&#12377;&#12427;&#12398;&#12395;&#27604;&#12409;&#12390;&#20181;&#20107;&#12364;&#22810;&#12367;&#12394;&#12427;&#12398;&#12399;&#24403;&#28982;&#12391;&#12377;&#12290;
    &#12383;&#12384;&#12289;&#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#22810;&#12367;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#12496;&#12464;&#22577;&#21578;&#12398;&#24773;&#22577;&#12434;&#21033;&#29992;&#12391;&#12365;&#12289;
    &#21839;&#38988;&#12398;&#35299;&#27770;&#12395;&#36002;&#29486;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#27861;&#24459;&#19978;&#12398;&#21161;&#35328;&#12289;&#27177;&#21033;&#12398;&#20445;&#35703;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-legal"></a>&#27861;&#24459;&#19978;&#12398;&#21161;&#35328;&#12289;&#27177;&#21033;&#12398;&#20445;&#35703;</h3></div></div></div><p>
    &#21942;&#21033;&#20225;&#26989;&#12391;&#12354;&#12428;&#12289;&#38750;&#21942;&#21033;&#12394;&#32068;&#32340;&#12391;&#12354;&#12428;&#12289;
    &#27861;&#20154;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#28508;&#12416;&#35079;&#38609;&#12394;&#27861;&#24459;&#21839;&#38988;&#12395;&#27880;&#24847;&#12434;&#25173;&#12358;&#27231;&#20250;&#12364;&#12354;&#12427;&#12411;&#12412;&#21807;&#19968;&#12398;&#32068;&#32340;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#20491;&#20154;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#24494;&#22937;&#12394;&#36949;&#12356;&#12434;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#33879;&#20316;&#27177;&#12289;&#21830;&#27161;&#12289;&#12381;&#12375;&#12390;&#29305;&#35377;&#12395;&#38306;&#12377;&#12427;&#27861;&#24459;&#12398;&#35443;&#32048;&#12434;&#29702;&#35299;&#12377;&#12427;&#12383;&#12417;&#12398;&#12522;&#12477;&#12540;&#12473;&#12418;&#26178;&#38291;&#12418;&#12394;&#12356;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12395;&#27861;&#21209;&#37096;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;
    &#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12388;&#12356;&#12390;&#12356;&#12427;&#33879;&#20316;&#27177;&#12398;&#29366;&#24907;&#12434;&#35519;&#26619;&#12375;&#12383;&#12426;&#12289;
    &#23455;&#38555;&#12395;&#36215;&#12371;&#12426;&#12358;&#12427;&#29305;&#35377;&#12420;&#21830;&#27161;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#38283;&#30330;&#32773;&#12395;&#20855;&#20307;&#30340;&#12395;&#21161;&#35328;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#28857;&#12391;&#38283;&#30330;&#32773;&#12434;&#21161;&#12369;&#12427;&#27491;&#12375;&#12356;&#12420;&#12426;&#26041;&#12399;&#12289;
    <a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a> &#12391;&#35696;&#35542;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#27861;&#21209;&#37096;&#12392;&#38283;&#30330;&#32773;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#21462;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;
    &#12381;&#12428;&#12382;&#12428;&#12364;&#20840;&#12367;&#36949;&#12358;&#19990;&#30028;&#12395;&#12356;&#12427;&#12371;&#12392;&#12434;&#35469;&#35672;&#12375;&#12383;&#19978;&#12391;&#35441;&#12434;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12362;&#20114;&#12356;&#12364;&#36942;&#21435;&#12395;&#35441;&#12375;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#22580;&#21512;&#12418;&#12354;&#12428;&#12400;&#12289;
    &#19968;&#26041;&#12364;&#20840;&#12367;&#30693;&#12425;&#12394;&#12356;&#23554;&#38272;&#38936;&#22495;&#12395;&#38306;&#12377;&#12427;&#30693;&#35672;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#12417;&#12356;&#12417;&#12356;&#12364;&#24605;&#12356;&#36796;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#19968;&#30058;&#12424;&#12356;&#12398;&#12399;&#12289;&#20210;&#20171;&#24441;&#12392;&#12394;&#12427;&#20154; (&#38283;&#30330;&#32773;&#12363;&#12289;&#25216;&#34899;&#30340;&#12394;&#23554;&#38272;&#30693;&#35672;&#12434;&#12418;&#12387;&#12383;&#24321;&#35703;&#22763;) &#12434;&#24517;&#35201;&#12394;&#38480;&#12426;&#38291;&#12395;&#32622;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#12398;&#25913;&#21892;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-documentation-usability"></a>&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#12398;&#25913;&#21892;</h3></div></div></div><p>
    &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12392;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#12399;&#12289;&#20001;&#26041;&#12392;&#12418;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24369;&#28857;&#12392;&#12375;&#12390;&#26377;&#21517;&#12391;&#12377;&#12364;&#12289;
    &#31169;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12398;&#36949;&#12356;&#12364;&#35463;&#24373;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12392;&#12399;&#35328;&#12387;&#12390;&#12418;&#32076;&#39443;&#19978;&#12399;&#12289;&#32032;&#26228;&#12425;&#12375;&#12356;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#35519;&#26619;&#12364;&#22810;&#12367;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#27424;&#12369;&#12390;&#12356;&#12427;&#12398;&#12399;&#20107;&#23455;&#12391;&#12377;&#12290;
</p><p>
    &#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12354;&#12427;&#12371;&#12428;&#12425;&#12398;&#31348;&#12434;&#22475;&#12417;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12391;&#12399;<span class="emphasis"><em>&#12394;&#12367;</em></span>&#12289;
    &#24444;&#12425;&#12392;&#24314;&#35373;&#30340;&#12395;&#35441;&#12364;&#12391;&#12365;&#12427;&#20154;&#12434;&#38599;&#12358;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12434;&#38599;&#12431;&#12394;&#12356;&#26041;&#12364;&#12424;&#12356;&#29702;&#30001;&#12399;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#38626;&#12428;&#12390;&#12375;&#12414;&#12358;&#12392;&#38283;&#30330;&#12377;&#12427;&#26178;&#38291;&#12364;&#12392;&#12428;&#12394;&#12367;&#12394;&#12427;&#12371;&#12392;&#12290;
    &#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;&#23550;&#35937;&#12392;&#12394;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12354;&#12414;&#12426;&#12395;&#12418;&#36317;&#38626;&#12364;&#36817;&#12356;&#20154;&#12399;&#12289;
    &#31532;3&#32773;&#12398;&#35222;&#28857;&#12363;&#12425;&#12381;&#12428;&#12434;&#30522;&#12417;&#12427;&#12398;&#12364;&#38627;&#12375;&#12356;&#12383;&#12417;&#12395;&#12289;
    &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26360;&#12356;&#12383;&#12426;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#12434;&#35519;&#12409;&#12427;&#12398;&#12395;&#26222;&#36890;&#21521;&#12356;&#12390;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#38283;&#30330;&#32773;&#12392;&#35441;&#12434;&#12375;&#12394;&#12364;&#12425;&#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12395;&#21462;&#12426;&#32068;&#12435;&#12391;&#12367;&#12428;&#12427;&#20154;&#12399;&#24517;&#35201;&#12391;&#12377;&#12290;
    &#24444;&#12425;&#12392;&#35441;&#12379;&#12427;&#12384;&#12369;&#12398;&#25216;&#34899;&#12473;&#12461;&#12523;&#12364;&#12354;&#12427;&#12418;&#12398;&#12398;&#12289;&#23550;&#35937;&#12392;&#12394;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#31934;&#36890;&#12375;&#12390;&#12362;&#12425;&#12378;&#12289;
    &#26222;&#36890;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#24863;&#24773;&#31227;&#20837;&#12391;&#12365;&#12427;&#20154;&#12434;&#25506;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#20013;&#32026;&#32773;&#12524;&#12505;&#12523;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26360;&#12367;&#12398;&#12395;&#22810;&#20998;&#21521;&#12356;&#12390;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#23455;&#38555;&#12289;&#12371;&#12398;&#26412;&#12398;&#31532;1&#29256;&#12364;&#19990;&#12395;&#20986;&#12383;&#12354;&#12392;&#12289;
    &#31169;&#12399; Dirk Reiner &#12392;&#12356;&#12358;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#32773;&#12363;&#12425;&#27425;&#12398;&#12424;&#12358;&#12394;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><pre class="screen">
    &#12300;5.&#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;&#12301;&#12398;&#12300;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#12398;&#25913;&#21892;&#12301;&#12395;&#12388;&#12356;&#12390;&#12402;&#12392;&#35328;&#12290;
    &#12418;&#12375;&#20154;&#12395;&#25903;&#25173;&#12360;&#12427;&#12384;&#12369;&#12398;&#12362;&#37329;&#12364;&#12354;&#12387;&#12390;&#12289;&#12418;&#12387;&#12392;&#12418;&#24517;&#35201;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12364;&#21021;&#24515;&#32773;&#21521;&#12369;&#12398;
    &#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12384;&#12392;&#12356;&#12358;&#35441;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12289;&#31169;&#12364;&#23455;&#38555;&#12395;&#38599;&#12387;&#12383;&#12398;&#12399;&#20013;&#32026;&#32773;&#12524;&#12505;&#12523;&#12398;&#12518;&#12540;
    &#12470;&#12540;&#12391;&#12375;&#12383;&#12290;&#24444;&#12399;&#12471;&#12473;&#12486;&#12512;&#12395;&#38306;&#12377;&#12427;&#30740;&#20462;&#12434;&#26368;&#36817;&#21463;&#12369;&#12390;&#12356;&#12383;&#12398;&#12391;&#12289;&#20309;&#12364;&#21839;&#38988;&#12395;&#12394;&#12427;&#12398;&#12363;
    &#12434;&#35226;&#12360;&#12390;&#12356;&#12414;&#12375;&#12383;&#12375;&#12289;&#21839;&#38988;&#12434;&#20055;&#12426;&#36234;&#12360;&#12390;&#12365;&#12390;&#12356;&#12383;&#12398;&#12391;&#12289;&#12393;&#12358;&#20154;&#12395;&#35500;&#26126;&#12377;&#12428;&#12400;&#12356;&#12356;&#12363;&#12434;
    &#20998;&#12363;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#12383;&#12417;&#12289;&#24444;&#12364;&#26360;&#12356;&#12383;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289;&#24444;&#33258;&#36523;&#12364;&#29702;&#35299;&#12391;&#12365;&#12394;&#12363;&#12387;
    &#12383;&#37096;&#20998;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#38283;&#30330;&#32773;&#12364;&#12385;&#12423;&#12387;&#12392;&#20462;&#27491;&#12377;&#12428;&#12400;&#12377;&#12415;&#12414;&#12375;&#12383;&#12375;&#12289;&#38283;&#30330;&#32773;&#12364;&#12300;&#33258;&#26126;&#12394;&#12301;
    &#12418;&#12398;&#12392;&#12375;&#12390;&#35211;&#36867;&#12375;&#12390;&#12356;&#12383;&#37096;&#20998;&#12418;&#32178;&#32645;&#12391;&#12365;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
 
    &#12418;&#12387;&#12392;&#12418;&#12289;&#24444;&#12398;&#20181;&#20107;&#12399;&#22810;&#12367;&#12398;&#20154;(&#29983;&#24466;)&#12395;&#12471;&#12473;&#12486;&#12512;&#12434;&#32057;&#20171;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12383;&#12290;&#12424;&#12387;&#12390;&#24444;&#12399;
    &#33258;&#20998;&#12364;&#25945;&#12360;&#12383;&#20154;&#36948;&#12398;&#32076;&#39443;&#12289;&#12388;&#12414;&#12426;&#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12364;&#29702;&#35299;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12420;&#12289;&#12383;&#12414;&#12383;&#12414;
    &#12358;&#12414;&#12367;&#12391;&#12365;&#12383;&#12371;&#12392;&#12289;&#12434;&#12358;&#12414;&#12367;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#24444;&#12364;&#26360;&#12356;&#12383;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12373;&#12425;&#12395;&#32032;&#26228;&#12425;&#12375;&#12356;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
</pre></div><div class="sect2" title="&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12420;&#25509;&#32154;&#22238;&#32218;&#12434;&#25552;&#20379;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-hosting"></a>&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12420;&#25509;&#32154;&#22238;&#32218;&#12434;&#25552;&#20379;&#12377;&#12427;</h3></div></div></div><p>
    &#19968;&#36890;&#12426;&#12398;&#12484;&#12540;&#12523;&#12364;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488; (<span>
<a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12398; </span> <a class="xref" href="web-site.html#canned-hosting" title="&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;">&#12300;&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12434;&#20351;&#12387;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12289;
    &#12469;&#12540;&#12496;&#12420;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12434;&#25552;&#20379;&#8212;
    &#12418;&#12387;&#12392;&#12418;&#37325;&#35201;&#12394;&#12398;&#12399;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#12434;&#25163;&#21161;&#12369;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12364;&#8212;&#12377;&#12427;&#12392;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22823;&#12356;&#12395;&#21161;&#12363;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12381;&#12428;&#12364;&#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12364;&#12391;&#12365;&#12427;&#20840;&#12390;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#19990;&#38291;&#30340;&#12395;&#33391;&#12356;&#35413;&#20385;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12381;&#12428;&#12394;&#12426;&#12398;&#25163;&#27573;&#12395;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#20294;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12398;&#26041;&#21521;&#24615;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#24863;&#35613;&#12398;&#24847;&#12434;&#34920;&#12377;&#12383;&#12417;&#12395;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12395;&#12362;&#31036;&#12398;&#35328;&#33865;&#12434;&#36617;&#12379;&#12390;&#12418;&#12425;&#12387;&#12383;&#12426;&#12289;
    &#12496;&#12490;&#12540;&#24195;&#21578;&#12434;&#36028;&#12425;&#12379;&#12390;&#12418;&#12425;&#12360;&#12427;&#12371;&#12392;&#12364;&#26399;&#24453;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12398;&#35373;&#23450;&#12395;&#12354;&#12383;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;URL&#12434;&#12354;&#12394;&#12383;&#12398;&#20225;&#26989;&#12398;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;
    URL&#12384;&#12369;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12354;&#12394;&#12383;&#12398;&#20225;&#26989;&#12364;&#38306;&#20418;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#29702;&#35299;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#12354;&#12394;&#12383;&#12398;&#20225;&#26989;&#12364;&#38283;&#30330;&#12395;&#20840;&#12367;&#36002;&#29486;&#12375;&#12390;&#12356;&#12394;&#12367;&#12390;&#12418;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364; <span class="emphasis"><em>&#20309;&#12363;&#12375;&#12425;&#12398;</em></span> &#38306;&#20418;&#12364;&#12354;&#12427;&#12392;&#30475;&#20570;&#12377;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#21839;&#38988;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12381;&#12358;&#32771;&#12360;&#12427;&#12371;&#12392;&#12395;&#38283;&#30330;&#32773;&#12418;&#27671;&#12389;&#12367;&#12383;&#12417;&#12289;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12420;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#22238;&#32218;&#20197;&#22806;&#12398;&#38283;&#30330;&#12522;&#12477;&#12540;&#12473;&#12434;&#25552;&#20379;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;
    &#12354;&#12394;&#12383;&#12398;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32622;&#12367;&#12371;&#12392;&#12395;&#12354;&#12414;&#12426;&#12356;&#12356;&#24863;&#24773;&#12434;&#25345;&#12383;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20309;&#12384;&#12363;&#12435;&#12384;&#35328;&#12387;&#12390;&#12418;&#12289;&#26368;&#36817;&#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12399;&#32080;&#23616;&#12289;&#23455;&#24907;&#12395;&#35211;&#21512;&#12431;&#12394;&#12356;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12427;&#12398;&#12399;&#12289;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12434;&#25552;&#20379;&#12375;&#12390;&#12418;&#12425;&#12358;&#21033;&#28857;&#12395;&#35211;&#21512;&#12431;&#12394;&#12356;&#12392;&#24863;&#12376;&#12390;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20182;&#12395;&#31227;&#12375;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12354;&#12394;&#12383;&#12364;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#25552;&#20379;&#12375;&#12383;&#12356;&#12394;&#12425;&#12289;&#12381;&#12358;&#12377;&#12427;&#12392;&#33391;&#12356;&#12391;&#12375;&#12423;&#12358;&#8212;
    &#20294;&#12375;&#12289;&#12377;&#12368;&#12395;&#12418;&#12387;&#12392;&#31309;&#26997;&#30340;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12431;&#12427;&#12503;&#12521;&#12531;&#12434;&#31034;&#12377;&#12363;&#12289;
    &#33258;&#20998;&#12398;&#20027;&#24373;&#12364;&#12393;&#12428;&#12367;&#12425;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12425;&#12428;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;
    &#12424;&#12367;&#32771;&#12360;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="contracting.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="marketing.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#22865;&#32004;&#12377;&#12427; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;</td></tr></table></div></body></html>
