<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="today.html" title="&#29694;&#29366;"><link rel="next" href="license-quickstart.html" title="&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="today.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="license-quickstart.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;"><div class="titlepage"><div><div><h2 class="title"><a name="getting-started"></a>&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="getting-started.html#starting-from-what-you-have">&#25163;&#25345;&#12385;&#12398;&#12418;&#12398;&#12391;&#22987;&#12417;&#12424;&#12358;</a></span></dt><dd><dl><dt><span class="sect2"><a href="getting-started.html#choosing-a-name">&#21517;&#21069;&#12398;&#27770;&#23450;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#mission-statement">&#26126;&#30906;&#12394;&#30446;&#27161;&#12434;&#25522;&#12370;&#12427;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#state-freedom">&#12501;&#12522;&#12540;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#23459;&#35328;&#12377;&#12427;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#features-and-requirements">&#27231;&#33021;&#19968;&#35239;&#12539;&#35201;&#20214;&#19968;&#35239;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#development-status">&#38283;&#30330;&#12398;&#36914;&#25431;&#29366;&#27841;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#downloads">&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#vc-and-bug-tracker-access">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12420;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#communications-channels">&#36899;&#32097;&#25163;&#27573;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#developer-guidelines">&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#documentation">&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;</a></span></dt><dd><dl><dt><span class="sect3"><a href="getting-started.html#documentation-availability">&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20844;&#38283;&#26041;&#27861;</a></span></dt><dt><span class="sect3"><a href="getting-started.html#developer-documentation">&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;</a></span></dt></dl></dd><dt><span class="sect2"><a href="getting-started.html#example-output">&#20351;&#29992;&#20363;&#12392;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#starting-with-canned-hosting">&#20844;&#38283;&#22580;&#25152;</a></span></dt></dl></dd><dt><span class="sect1"><a href="license-quickstart.html">&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992;</a></span></dt><dd><dl><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-non-gpl">&#12300;&#20309;&#12391;&#12418;&#12391;&#12365;&#12427;&#12301;&#12521;&#12452;&#12475;&#12531;&#12473;</a></span></dt><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-gpl">GPL</a></span></dt><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-applying">&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12377;&#12427;&#26041;&#27861;</a></span></dt></dl></dd><dt><span class="sect1"><a href="setting-tone.html">&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367;</a></span></dt><dd><dl><dt><span class="sect2"><a href="setting-tone.html#avoid-private-discussions">&#20491;&#20154;&#30340;&#12394;&#35696;&#35542;&#12434;&#36991;&#12369;&#12427;</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#prevent-rudeness">&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#code-review">&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#opening-closed-projects">&#12418;&#12392;&#12418;&#12392;&#38750;&#20844;&#38283;&#12384;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;
&#22793;&#21270;&#12398;&#22823;&#12365;&#12373;&#12395;&#27671;&#12434;&#12388;&#12369;&#12424;&#12358;</a></span></dt></dl></dd><dt><span class="sect1"><a href="announcing.html">&#24195;&#22577;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#22987;&#12414;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  Eric Raymond &#12364;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#24444;&#12399;&#12289;&#20170;&#12420;&#36229;&#26377;&#21517;&#12395;&#12394;&#12387;&#12383;&#25991;&#26360;
  &#12300;<em class="citetitle">&#20285;&#34253;&#12392;&#12496;&#12470;&#12540;&#12523; (The Cathedral and the Bazaar)</em>&#12301;
  &#12398;&#20013;&#12391;&#27425;&#12398;&#12424;&#12358;&#12395;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        &#12424;&#12356;&#12477;&#12501;&#12488;&#12399;&#12377;&#12409;&#12390;&#12289;&#38283;&#30330;&#32773;&#12398;&#20491;&#20154;&#30340;&#12394;&#24745;&#12415;&#35299;&#27770;&#12363;&#12425;&#22987;&#12414;&#12427;&#12290;
      </em></span></p><p>(<span class="bold"><strong><a class="ulink" href="http://www.catb.org/~esr/writings/cathedral-bazaar/" target="_top">http://www.catb.org/~esr/writings/cathedral-bazaar/</a>
      </strong></span> &#12424;&#12426;&#24341;&#29992;&#12290;&#26085;&#26412;&#35486;&#35379;&#12399; <span class="bold"><strong><a class="ulink" href="http://www.tlug.jp/docs/cathedral-bazaar/cathedral-paper-jp.html" target="_top">http://www.tlug.jp/docs/cathedral-bazaar/cathedral-paper-jp.html</a></strong></span>)</p></blockquote></div><p>
  Raymond &#12399;&#12289;&#27770;&#12375;&#12390;&#12300;&#38283;&#30330;&#32773;&#12398;&#20491;&#20154;&#30340;&#12394;&#24745;&#12415;&#35299;&#27770;&#12301;
  &#12384;&#12369;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22987;&#12414;&#12427;&#12365;&#12387;&#12363;&#12369;&#12384;&#12392;&#12399;&#35328;&#12387;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12392;&#12356;&#12358;&#12424;&#12426;&#12399;&#12289;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#33258;&#36523;&#12364;&#21839;&#38988;&#12398;&#35299;&#27770;&#12395;&#38306;&#24515;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;
  &#12424;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#20986;&#26469;&#19978;&#12364;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12392;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12426;&#22987;&#12417;&#12427;&#21205;&#27231;&#12392;&#12375;&#12390;&#12356;&#12385;&#12400;&#12435;&#22810;&#12356;&#12398;&#12364;
  &#12300;&#20491;&#20154;&#30340;&#12394;&#24745;&#12415;&#35299;&#27770;&#12301;&#12384;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#29694;&#22312;&#12391;&#12418;&#21516;&#12376;&#29702;&#30001;&#12391;&#22987;&#12414;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;Raymond
  &#12364;&#12371;&#12398;&#25991;&#31456;&#12434;&#26360;&#12356;&#12383; 1997 &#24180;&#24403;&#26178;&#12395;&#27604;&#12409;&#12427;&#12392;&#12381;&#12398;&#21106;&#21512;&#12399;&#23569;&#12394;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#29694;&#22312;&#12391;&#12399;&#12289;&#24040;&#22823;&#12394;&#20013;&#22830;&#31649;&#29702;&#22411;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;
  (&#21942;&#21033;&#22243;&#20307;&#12364;&#31649;&#29702;&#12377;&#12427;&#12418;&#12398;&#12418;&#21547;&#12416;) &#12434;&#26368;&#21021;&#12363;&#12425;&#20316;&#12429;&#12358;&#12392;&#12377;&#12427;&#31354;&#27671;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#19968;&#21305;&#29436;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#20491;&#20154;&#30340;&#12394;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#12460;&#12471;&#12460;&#12471;&#26360;&#12356;&#12383;&#12467;&#12540;&#12489;&#12364;
  &#32080;&#26524;&#12392;&#12375;&#12390;&#24195;&#12367;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#20170;&#12391;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12356;&#12414;&#12420;&#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;Raymond &#12398;&#25351;&#25688;&#12399;&#20170;&#12391;&#12418;&#27934;&#23519;&#12395;&#28288;&#12385;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20316;&#32773;&#33258;&#36523;&#12364;&#12381;&#12398;&#25104;&#21151;&#12395;&#30452;&#25509;&#30340;&#12394;&#33288;&#21619;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12289;
  &#12394;&#12380;&#12394;&#12425;&#24444;&#12425;&#12399;&#33258;&#20998;&#33258;&#36523;&#12391;&#12381;&#12428;&#12434;&#20351;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12289;&#12392;&#12356;&#12358;&#12398;&#12364;&#26412;&#36074;&#30340;&#12394;&#26465;&#20214;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#26399;&#24453;&#36890;&#12426;&#12395;&#21205;&#12363;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#26085;&#12293;&#12381;&#12428;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#20316;&#32773;&#12399;&#19981;&#28288;&#12395;&#24605;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400; OpenAdapter &#12503;&#12525;&#12472;&#12455;&#12463;&#12488; (<a class="ulink" href="http://www.openadapter.org/" target="_top">http://www.openadapter.org/</a>)
  &#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12371;&#12428;&#12399;&#25237;&#36039;&#37504;&#34892; Dresdner Kleinwort Wasserstein
  &#12364;&#22987;&#12417;&#12383;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12391;&#12289;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#37329;&#34701;&#24773;&#22577;&#12471;&#12473;&#12486;&#12512;&#12434;&#32113;&#21512;&#12377;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12393;&#12358;&#32771;&#12360;&#12390;&#12418;&#12289;&#12371;&#12428;&#12399;&#12300;&#38283;&#30330;&#32773;&#12398;&#20491;&#20154;&#30340;&#12394;&#24745;&#12415;&#35299;&#27770;&#12301;
  &#12398;&#12383;&#12417;&#12395;&#20316;&#12425;&#12428;&#12383;&#12418;&#12398;&#12392;&#12399;&#12356;&#12360;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12300;&#27231;&#38306;&#12398;&#24745;&#12415;&#35299;&#27770;&#12301;&#12434;&#12377;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#24745;&#12415;&#12399;&#12381;&#12398;&#27231;&#38306;&#12392;&#12497;&#12540;&#12488;&#12490;&#12540;&#12398;&#32076;&#39443;&#12363;&#12425;&#30452;&#25509;&#12367;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12418;&#12375;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;&#12381;&#12428;&#12392;&#27671;&#12389;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12424;&#12426;&#12424;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#29987;&#12415;&#20986;&#12377;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12523;&#12540;&#12503;&#12364;&#27491;&#12375;&#12356;&#26041;&#21521;&#12395;&#27969;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#35211;&#30693;&#12425;&#12396;&#35504;&#12363;&#12395;&#22770;&#12426;&#12388;&#12369;&#12390;&#12289;<span class="emphasis"><em>&#24444;&#12425;&#12398;</em></span>&#21839;&#38988;&#12434;&#35299;&#27770;&#12391;&#12365;&#12427;&#12424;&#12358;&#26360;&#12363;&#12428;&#12427;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26368;&#21021;&#12399;&#33258;&#20998;&#12383;&#12385;<span class="emphasis"><em>&#33258;&#36523;&#12398;</em></span>&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#26360;&#12363;&#12428;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12381;&#12428;&#12364;&#12415;&#12435;&#12394;&#12392;&#20849;&#26377;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12300;&#21839;&#38988;&#12301;&#12434;&#30149;&#27671;&#12395;&#12383;&#12392;&#12360;&#12427;&#12392;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#34220;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#27969;&#34892;&#30149;&#12434;&#23436;&#20840;&#12395;&#26681;&#32118;&#12377;&#12427;&#12383;&#12417;&#12395;&#34220;&#12434;&#12400;&#12425;&#12414;&#12367;&#12398;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#37197;&#24067;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#26412;&#31456;&#12391;&#12399;&#12289;&#26032;&#12375;&#12356;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12473;&#12479;&#12540;&#12488;&#12373;&#12379;&#12427;&#26041;&#27861;&#12434;&#25201;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#26412;&#31456;&#12395;&#12363;&#12363;&#12428;&#12390;&#12356;&#12427;&#20869;&#23481;&#12398;&#22810;&#12367;&#12399;&#12289;
  &#20445;&#20581;&#27231;&#38306;&#12364;&#34220;&#12434;&#37197;&#24067;&#12377;&#12427;&#12392;&#12365;&#12398;&#26041;&#27861;&#12392;&#20284;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20001;&#32773;&#12398;&#30446;&#27161;&#12399;&#12424;&#12367;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;&#34220;&#12398;&#21177;&#33021;&#12399;&#12399;&#12387;&#12365;&#12426;&#31034;&#12373;&#12394;&#12356;&#12392;&#12356;&#12369;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#12381;&#12428;&#12434;&#26412;&#24403;&#12395;&#24517;&#35201;&#12392;&#12377;&#12427;&#20154;&#12395;&#25163;&#28193;&#12373;&#12394;&#12356;&#12392;&#12356;&#12369;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#12414;&#12383;&#12381;&#12428;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#20154;&#12399;&#34220;&#12398;&#25201;&#12356;&#26041;&#12434;&#30693;&#12387;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22580;&#21512;&#12399;&#12373;&#12425;&#12395;&#12289;
  &#34220;&#12434;&#25913;&#33391;&#12377;&#12427;&#12383;&#12417;&#12398;&#30740;&#31350;&#12395;&#21442;&#21152;&#12375;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#24739;&#32773;&#12434;&#21223;&#35480;&#12377;&#12427;&#12392;&#12356;&#12358;&#20316;&#26989;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#37197;&#24067;&#20316;&#26989;&#12399;&#12289;&#65298;&#12388;&#12398;&#20596;&#38754;&#12434;&#26377;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#29554;&#24471;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12289;&#38283;&#30330;&#32773;&#12418;&#29554;&#24471;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#65298;&#12388;&#12399;&#24517;&#12378;&#12375;&#12418;&#31478;&#21512;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#21021;&#12417;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#35211;&#12379;&#12427;&#12363;&#12434;&#32771;&#12360;&#12427;&#12392;&#12289;&#12371;&#12428;&#12399;&#23569;&#12293;&#35079;&#38609;&#12394;&#35441;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12518;&#12540;&#12470;&#12540;&#12392;&#38283;&#30330;&#32773;&#12398;&#20001;&#26041;&#12395;&#23550;&#12375;&#12390;&#26377;&#29992;&#12394;&#24773;&#22577;&#12418;&#12354;&#12428;&#12400;&#12289;
  &#12381;&#12398;&#12393;&#12385;&#12425;&#12363;&#19968;&#26041;&#12395;&#12375;&#12363;&#24441;&#31435;&#12383;&#12394;&#12356;&#24773;&#22577;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12393;&#12385;&#12425;&#12398;&#24773;&#22577;&#12418;&#12473;&#12465;&#12540;&#12523;&#12377;&#12427;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531; (scaled presentation) &#12398;&#21407;&#21063;&#12395;&#12375;&#12383;&#12364;&#12387;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12377;&#12394;&#12431;&#12385;&#12289;
  &#35501;&#12415;&#25163;&#12364;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#29105;&#24515;&#12395;&#35501;&#12417;&#12400;&#35501;&#12416;&#12411;&#12393;&#12289;
  &#12381;&#12428;&#12395;&#12354;&#12431;&#12379;&#12383;&#35443;&#32048;&#12394;&#24773;&#22577;&#12364;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21162;&#21147;&#12377;&#12428;&#12400;&#12377;&#12427;&#12411;&#12393;&#12289;&#12381;&#12428;&#12395;&#23550;&#12377;&#12427;&#35211;&#36820;&#12426;&#12364;&#24471;&#12425;&#12428;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#20001;&#32773;&#12364;&#12365;&#12385;&#12435;&#12392;&#30456;&#38306;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#20154;&#12399;&#12377;&#12368;&#20449;&#38972;&#12377;&#12427;&#24515;&#12434;&#22833;&#12356;&#12289;&#21162;&#21147;&#12434;&#27880;&#12366;&#36796;&#12416;&#12398;&#12434;&#12420;&#12417;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12398;&#31995;&#12392;&#12375;&#12390;&#35328;&#12360;&#12427;&#12398;&#12364;&#12289;<span class="emphasis"><em>&#35211;&#26628;&#12360;&#12399;&#37325;&#35201;&#12391;&#12354;&#12427;</em></span> &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12392;&#12426;&#12431;&#12369;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#12356;&#12358;&#20154;&#31278;&#12399;&#12289;&#12371;&#12428;&#12434;&#20449;&#12376;&#12424;&#12358;&#12392;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#24418;&#24335;&#12434;&#24046;&#12375;&#32622;&#12356;&#12383;&#26412;&#36074;&#12395;&#23550;&#12377;&#12427;&#24444;&#12425;&#12398;&#12371;&#12384;&#12431;&#12426;&#12399;&#12289;&#12411;&#12392;&#12435;&#12393;&#32887;&#20154;&#30340;&#12503;&#12521;&#12452;&#12489;&#12398;&#22495;&#12395;&#36948;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12420;&#24195;&#22577;&#27963;&#21205;&#12434;&#27611;&#23244;&#12356;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12384;&#12375;&#12289;
  &#12503;&#12525;&#12398;&#12464;&#12521;&#12501;&#12451;&#12483;&#12463;&#12487;&#12470;&#12452;&#12490;&#12418;&#12300;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12387;&#12390;&#20154;&#12383;&#12385;&#12399;&#12356;&#12387;&#12383;&#12356;&#20309;&#12434;&#32771;&#12360;&#12390;&#12356;&#12427;&#12398;&#12363;&#12301;
  &#12392;&#24656;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;&#20840;&#12367;&#19981;&#24605;&#35696;&#12394;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12371;&#12428;&#12399;&#27531;&#24565;&#12394;&#35441;&#12391;&#12377;&#12290;&#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#12399;&#24418;&#24335;&#12371;&#12381;&#12364;&#26412;&#36074;&#12391;&#12354;&#12426;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35211;&#26628;&#12360;&#12398;&#21839;&#38988;&#12399;&#12381;&#12398;&#29366;&#27841;&#12398;&#65297;&#12388;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#23384;&#22312;&#12434;&#30693;&#12387;&#12383;&#20154;&#12364;&#26368;&#21021;&#12395;&#30446;&#12395;&#12377;&#12427;&#12398;&#12399;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#35211;&#12383;&#30446;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12395;&#20309;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12363;&#12392;&#12363;&#12393;&#12371;&#12395;&#12522;&#12531;&#12463;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12363;&#12424;&#12426;&#12418;&#21069;&#12395;&#12289;
  &#12414;&#12378;&#12381;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12364;&#12393;&#12435;&#12394;&#24863;&#12376;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#30446;&#12395;&#20837;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12362;&#12363;&#12375;&#12394;&#35441;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#20154;&#12399;&#31532;&#19968;&#21360;&#35937;&#12398;&#24418;&#25104;&#12434;&#25233;&#21046;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12469;&#12452;&#12488;&#12398;&#35211;&#12383;&#30446;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35211;&#26628;&#12360;&#12398;&#27083;&#25104;&#12395;&#37197;&#24942;&#12364;&#25173;&#12431;&#12428;&#12383;&#12363;&#21542;&#12363;&#12392;&#12356;&#12358;&#24773;&#22577;&#12434;&#30330;&#20449;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#20154;&#38291;&#12399;&#12289;&#37197;&#24942;&#12398;&#25237;&#36039;&#12434;&#26908;&#30693;&#12377;&#12427;&#12383;&#12417;&#12398;&#12362;&#12381;&#12429;&#12375;&#12367;&#24863;&#24230;&#12398;&#12424;&#12356;&#12450;&#12531;&#12486;&#12490;&#12434;&#20633;&#12360;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#12289;&#12381;&#12398;&#12469;&#12452;&#12488;&#12364;&#29255;&#25163;&#38291;&#12395;&#20316;&#12425;&#12428;&#12383;&#12418;&#12398;&#12363;
  &#12424;&#12367;&#32244;&#12426;&#12371;&#12414;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12363;&#12434;&#19968;&#30446;&#35211;&#12390;&#21028;&#26029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#19990;&#12395;&#20986;&#12377;&#12395;&#12354;&#12383;&#12387;&#12390;&#26368;&#21021;&#12395;&#35211;&#12390;&#12418;&#12425;&#12358;&#12392;&#12371;&#12429;&#12364;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12394;&#12398;&#12391;&#12377;&#12363;&#12425;&#12289;
  &#12381;&#12398;&#21360;&#35937;&#12399;&#36899;&#24819;&#12395;&#12424;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12395;&#25345;&#12385;&#36234;&#12373;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#19968;&#26041;&#12391;&#26412;&#31456;&#12391;&#12399;&#20027;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38283;&#22987;&#12377;&#12427;&#12395;&#12354;&#12383;&#12426;&#29992;&#24847;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#21462;&#12426;&#25201;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#12381;&#12398;&#35211;&#26628;&#12360;&#12418;&#37325;&#35201;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12399; (&#12456;&#12531;&#12489;&#12518;&#12540;&#12470;&#12540;&#12392;&#38283;&#30330;&#32773;&#12398;) &#65298;&#31278;&#39006;&#12398;&#20154;&#12383;&#12385;&#12364;&#21033;&#29992;&#12377;&#12427;&#12418;&#12398;&#12394;&#12398;&#12391;&#12289;
  &#12393;&#12385;&#12425;&#12434;&#23550;&#35937;&#12392;&#12375;&#12383;&#12418;&#12398;&#12394;&#12398;&#12363;&#12434;&#12399;&#12387;&#12365;&#12426;&#12373;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26412;&#26360;&#12399;&#12454;&#12455;&#12502;&#12487;&#12470;&#12452;&#12531;&#12398;&#23554;&#38272;&#26360;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12402;&#12392;&#12388;&#12384;&#12369;&#37325;&#35201;&#12394;&#27861;&#21063;&#12434;&#31034;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12373;&#12414;&#12374;&#12414;&#12394;&#30456;&#25163; (&#37096;&#20998;&#30340;&#12395;&#37325;&#35079;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;)
  &#12434;&#23550;&#35937;&#12392;&#12377;&#12427;&#12392;&#12365;&#12399;&#29305;&#12395;&#37325;&#35201;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12399;&#12289;&#12522;&#12531;&#12463;&#20808;&#12395;&#20309;&#12364;&#12354;&#12427;&#12398;&#12363;&#12364;&#12289;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12394;&#12367;&#12390;&#12418;&#22823;&#12414;&#12363;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12394;&#12398;&#12363;&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12394;&#12398;&#12363;&#12364;&#12289;
  <span class="emphasis"><em>&#12522;&#12531;&#12463;&#20808;&#12391;&#12399;&#12394;&#12367;&#12522;&#12531;&#12463;&#12381;&#12398;&#12418;&#12398;&#12434;&#35211;&#12383;&#12384;&#12369;&#12391;</em></span>
  &#21028;&#26029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#36939;&#21942;&#12395;&#12399;&#12289;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;&#12392;&#12356;&#12358;&#20596;&#38754;&#12364;&#19968;&#37096;&#12395;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12414;&#12383;&#12289;&#23433;&#24515;&#24863;&#12434;&#25552;&#20379;&#12377;&#12427;&#12392;&#12356;&#12358;&#20596;&#38754;&#12418;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#26399;&#24453;&#12375;&#12383;&#22580;&#25152;&#12395;&#27770;&#12414;&#12426;&#12365;&#12387;&#12383;&#12418;&#12398;&#12364;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12431;&#12427;&#12363;&#21542;&#12363;&#27770;&#12417;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12420;&#38283;&#30330;&#32773;&#12399;&#23433;&#24515;&#12375;&#12414;&#12377;&#12290;
  &#12300;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12420;&#12427;&#12409;&#12365;&#12371;&#12392;&#12434;&#34892;&#12356;&#12289;&#24819;&#23450;&#12373;&#12428;&#12427;&#36074;&#21839;&#12395;&#23550;&#24540;&#12375;&#12289;
  &#12381;&#12398;&#36074;&#21839;&#12395;&#23550;&#12377;&#12427;&#31572;&#12360;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#31777;&#21336;&#12395;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12427;&#12301;&#12392;&#12356;&#12358;&#21162;&#21147;&#12364;&#35211;&#12360;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#27671;&#21512;&#12434;&#35211;&#12379;&#12427;&#12371;&#12392;&#12391;&#12300;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12431;&#12387;&#12390;&#12418;&#12354;&#12394;&#12383;&#12398;&#26178;&#38291;&#12399;&#28961;&#39364;&#12395;&#12394;&#12425;&#12394;&#12356;&#12301;
  &#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12371;&#12381;&#12364;&#30342;&#12364;&#32862;&#12365;&#12383;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#12414;&#12378;&#12399;&#21608;&#12426;&#12434;&#35211;&#28193;&#12377;&#12371;&#12392;&#12363;&#12425;"><div class="titlepage"><div><div><h3 class="title"><a name="look-around"></a>&#12414;&#12378;&#12399;&#21608;&#12426;&#12434;&#35211;&#28193;&#12377;&#12371;&#12392;&#12363;&#12425;</h3></div></div></div><p>
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12427;&#21069;&#12395;&#12289;&#12402;&#12392;&#12388;&#24544;&#21578;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#12414;&#12378;&#12399;&#21608;&#12426;&#12434;&#35211;&#28193;&#12375;&#12390;&#12289;&#21516;&#12376;&#12424;&#12358;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26082;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#20170;&#12414;&#12373;&#12395;&#35299;&#27770;&#12375;&#12424;&#12358;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#21839;&#38988;&#12434;&#12289;
  &#12354;&#12394;&#12383;&#12424;&#12426;&#12418;&#21069;&#12395;&#21029;&#12398;&#35504;&#12363;&#12364;&#35299;&#27770;&#12375;&#12424;&#12358;&#12392;&#24605;&#12387;&#12390;&#12356;&#12383;&#21487;&#33021;&#24615;&#12399;&#22823;&#12356;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#24444;&#12425;&#12364;&#23455;&#38555;&#12395;&#12381;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12289;&#12467;&#12540;&#12489;&#12434;&#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#20844;&#38283;&#12375;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12354;&#12394;&#12383;&#12364;&#12371;&#12428;&#12363;&#12425;&#36554;&#36650;&#12398;&#20877;&#30330;&#26126;&#12434;&#12377;&#12427;&#29702;&#30001;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#20363;&#22806;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#33258;&#20998;&#12398;&#21193;&#24375;&#12398;&#12383;&#12417;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38283;&#22987;&#12377;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#26082;&#23384;&#12398;&#12467;&#12540;&#12489;&#12399;&#21161;&#12369;&#12395;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12354;&#12427;&#12356;&#12399;
  &#12371;&#12428;&#12363;&#12425;&#12399;&#12376;&#12417;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#29305;&#23450;&#12398;&#20998;&#37326;&#12395;&#29305;&#21270;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#20182;&#12398;&#20154;&#12364;&#21516;&#12376;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12476;&#12525;&#12395;&#31561;&#12375;&#12356;&#22580;&#21512;&#12394;&#12393;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#36890;&#24120;&#12399;&#12289;&#12354;&#12360;&#12390;&#21608;&#12426;&#12434;&#35211;&#28193;&#12373;&#12394;&#12356;&#29702;&#30001;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#35211;&#28193;&#12377;&#12371;&#12392;&#12391;&#24471;&#12425;&#12428;&#12427;&#21033;&#30410;&#12399;&#12363;&#12394;&#12426;&#12398;&#12418;&#12398;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#19968;&#33324;&#30340;&#12394;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12391;&#32080;&#26524;&#12364;&#24471;&#12425;&#12428;&#12394;&#12369;&#12428;&#12400;&#12289;
  <a class="ulink" href="http://freecode.com/" target="_top">http://freecode.com/</a>
  (&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12377;&#12427;&#12491;&#12517;&#12540;&#12473;&#12469;&#12452;&#12488;&#12290;
  &#35443;&#32048;&#12399;&#24460;&#12411;&#12393;&#35500;&#26126;&#12375;&#12414;&#12377;)
  &#12420; <a class="ulink" href="http://www.sourceforge.net/" target="_top">http://www.sourceforge.net/</a>&#12289;
  &#12381;&#12375;&#12390; Free Software Foundation &#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;
  (<a class="ulink" href="http://directory.fsf.org/" target="_top">http://directory.fsf.org/</a>) &#12434;&#35519;&#12409;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12381;&#12398;&#12418;&#12398;&#12378;&#12400;&#12426;&#12398;&#12418;&#12398;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12424;&#12367;&#20284;&#12383;&#12418;&#12398;&#12364;&#35211;&#12388;&#12363;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21512;&#27969;&#12375;&#12390;&#24517;&#35201;&#12394;&#27231;&#33021;&#12434;&#36861;&#21152;&#12377;&#12427;&#12411;&#12358;&#12364;&#12289;
  &#65297;&#12363;&#12425;&#20316;&#12426;&#30452;&#12377;&#12424;&#12426;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div></div><div class="sect1" title="&#25163;&#25345;&#12385;&#12398;&#12418;&#12398;&#12391;&#22987;&#12417;&#12424;&#12358;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="starting-from-what-you-have"></a>&#25163;&#25345;&#12385;&#12398;&#12418;&#12398;&#12391;&#22987;&#12417;&#12424;&#12358;</h2></div></div></div><p>
  &#12414;&#12431;&#12426;&#12434;&#35211;&#28193;&#12375;&#12390;&#12415;&#12383;&#12369;&#12428;&#12393;&#26395;&#12415;&#12393;&#12362;&#12426;&#12398;&#12418;&#12398;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12289;&#32080;&#23616;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
</p><p>&#12373;&#12390;&#20309;&#12434;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;</p><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#26178;&#12395;&#26368;&#12418;&#21380;&#20171;&#12394;&#12398;&#12399;&#12289;
  &#20491;&#20154;&#30340;&#12394;&#12499;&#12472;&#12519;&#12531;&#12434;&#12415;&#12435;&#12394;&#12395;&#12431;&#12363;&#12427;&#24418;&#12395;&#32622;&#12365;&#25563;&#12360;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12354;&#12394;&#12383; (&#12354;&#12427;&#12356;&#12399;&#12354;&#12394;&#12383;&#12398;&#23646;&#12377;&#12427;&#32068;&#32340;) &#12395;&#12392;&#12387;&#12390;&#12399;&#20309;&#12364;&#12420;&#12426;&#12383;&#12356;&#12398;&#12363;&#12399;&#26126;&#30333;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#30446;&#27161;&#12364;&#20309;&#12394;&#12398;&#12363;&#12434;&#19968;&#33324;&#12395;&#12418;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#34920;&#26126;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
  &#12381;&#12428;&#12394;&#12426;&#12395;&#22823;&#22793;&#12394;&#20316;&#26989;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;
  &#12363;&#12394;&#12425;&#12378;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#12381;&#12428;&#12434;&#12420;&#12425;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383; (&#12381;&#12375;&#12390;&#20849;&#21516;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;)
  &#12399;&#12289;&#12414;&#12378;&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23455;&#38555;&#20309;&#12394;&#12398;&#12363;&#12301;&#12289;&#12377;&#12394;&#12431;&#12385;&#12289;
  &#12300;&#20309;&#12434;&#12420;&#12427;&#12398;&#12363;&#12301;&#12392;&#21516;&#26178;&#12395;
  &#12300;&#20309;&#12434;<span class="emphasis"><em>&#12420;&#12425;&#12394;&#12356;</em></span>&#12398;&#12363;&#12301;&#12392;&#12356;&#12358;&#38480;&#30028;&#12434;&#27770;&#23450;&#12375;&#12289;
  &#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12434;&#26360;&#12365;&#19978;&#12370;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26222;&#36890;&#12399;&#12289;&#12371;&#12428;&#12399;&#12381;&#12428;&#12411;&#12393;&#22256;&#38627;&#12394;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#20316;&#26989;&#12395;&#12424;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26412;&#36074;&#12395;&#38306;&#12377;&#12427;&#26263;&#40665;&#12398;&#20102;&#35299;&#12420;&#12373;&#12425;&#12395;&#12399;&#24847;&#35211;&#12398;&#30456;&#36949;&#12414;&#12391;&#28014;&#12363;&#12403;&#19978;&#12364;&#12387;&#12390;&#12367;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12391;&#12356;&#12356;&#12435;&#12391;&#12377;&#12290;&#24460;&#12395;&#12394;&#12387;&#12390;&#12363;&#12425;&#12381;&#12428;&#12364;&#21028;&#26126;&#12377;&#12427;&#12424;&#12426;&#12418;&#12289;
  &#26089;&#12356;&#12358;&#12385;&#12395;&#35211;&#12388;&#12369;&#12390;&#12375;&#12414;&#12387;&#12383;&#12411;&#12358;&#12364;&#35299;&#27770;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#20316;&#26989;&#12364;&#32066;&#12431;&#12428;&#12400;&#12289;&#27425;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;
  &#19968;&#33324;&#20844;&#38283;&#29992;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12406;&#12387;&#12385;&#12419;&#12369;&#12390;&#35328;&#12358;&#12392;&#21336;&#32020;&#12391;&#12388;&#12414;&#12425;&#12394;&#12356;&#32020;&#28982;&#12383;&#12427;&#39592;&#25240;&#12426;&#20181;&#20107;&#12391;&#12377;&#12290;
</p><p>
  &#20309;&#12364;&#12381;&#12435;&#12394;&#12395;&#38754;&#20498;&#12367;&#12373;&#12356;&#12398;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;&#12381;&#12398;&#20316;&#26989;&#12398;&#22823;&#21322;&#12364;&#12289;&#26082;&#12395;&#12415;&#12435;&#12394;&#12364;&#30693;&#12387;&#12390;&#12356;&#12427;
  &#8212;&#12371;&#12371;&#12391;&#12356;&#12358;&#12300;&#12415;&#12435;&#12394;&#12301;&#12392;&#12399;&#12289;&#12371;&#12428;&#12414;&#12391;&#12378;&#12387;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12365;&#12383;&#20154;&#12398;&#12371;&#12392;&#12391;&#12377;&#8212;
  &#12371;&#12392;&#12434;&#12414;&#12392;&#12417;&#19978;&#12370;&#12390;&#25991;&#26360;&#21270;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12381;&#12398;&#20316;&#26989;&#12434;&#23455;&#38555;&#12395;&#34892;&#12358;&#20154;&#12395;&#12399;&#30452;&#25509;&#30340;&#12394;&#12513;&#12522;&#12483;&#12488;&#12399;&#20309;&#12418;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12395;&#12392;&#12387;&#12390;&#12399;&#12300;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#8230;&#8230;&#12301;&#12392;&#12356;&#12358;&#12424;&#12358;&#12394; <code class="filename">README</code>
  &#12501;&#12449;&#12452;&#12523;&#12399;&#19981;&#35201;&#12391;&#12377;&#12375;&#12289;&#12418;&#12385;&#12429;&#12435;&#35373;&#35336;&#25991;&#26360;&#12420;&#12518;&#12540;&#12470;&#12540;&#12510;&#12491;&#12517;&#12450;&#12523;&#12394;&#12435;&#12363;&#12418;&#19981;&#35201;&#12391;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12477;&#12540;&#12473;&#12391;&#37197;&#24067;&#12377;&#12427;&#12392;&#12365;&#12395;&#12415;&#12435;&#12394;&#12364;&#27161;&#28310;&#30340;&#12395;&#20351;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;
  &#12467;&#12540;&#12489;&#12484;&#12522;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#24517;&#35201;&#12418;&#24863;&#12376;&#12390;&#12356;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21029;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#27083;&#25104;&#12364;&#12393;&#12358;&#12391;&#12354;&#12387;&#12390;&#12418;&#24444;&#12425;&#12399;&#27671;&#12395;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#12384;&#12387;&#12390;&#12418;&#12358;&#12381;&#12398;&#12467;&#12540;&#12489;&#12398;&#20869;&#23481;&#12434;&#29087;&#30693;&#12375;&#12390;&#12356;&#12427;&#12398;&#12384;&#12375;&#12289;
  &#12467;&#12540;&#12489;&#12364;&#21205;&#12365;&#20986;&#12379;&#12400;&#12289;&#12354;&#12392;&#12399;&#12393;&#12358;&#20351;&#12360;&#12400;&#12356;&#12356;&#12398;&#12363;&#12418;&#30693;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#24444;&#12425;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22522;&#26412;&#30340;&#12394;&#35373;&#35336;&#26041;&#37341;&#12364;&#25991;&#26360;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12367;&#12390;&#12418;&#24179;&#27671;&#12391;&#12377;&#12290;
  &#12384;&#12387;&#12390;&#12381;&#12428;&#12399;&#24444;&#12425;&#12398;&#38957;&#12398;&#20013;&#12395;&#12385;&#12419;&#12435;&#12392;&#12354;&#12427;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
</p><p>
  &#19968;&#26041;&#12289;&#26032;&#21442;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;&#12381;&#12398;&#12424;&#12358;&#12394;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
  &#12392;&#12399;&#12356;&#12360;&#12289;&#24184;&#12356;&#12394;&#12371;&#12392;&#12395;&#12377;&#12409;&#12390;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#19968;&#24230;&#12395;&#24517;&#35201;&#12392;&#12394;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20844;&#38283;&#12377;&#12427;&#21069;&#12395;&#12289;&#12354;&#12425;&#12422;&#12427;&#12522;&#12477;&#12540;&#12473;&#12434;&#25552;&#20379;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#26032;&#12375;&#12356;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12427;&#12392;&#12365;&#12395;&#12399;
  &#35373;&#35336;&#25991;&#26360;&#12420;&#23436;&#20840;&#12394;&#12518;&#12540;&#12470;&#12540;&#12510;&#12491;&#12517;&#12450;&#12523; (&#20170;&#24460;&#23455;&#35013;&#20104;&#23450;&#12398;&#27231;&#33021;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12418;&#21547;&#12416;)&#12289;
  &#35079;&#25968;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12391;&#21205;&#20316;&#12377;&#12427;&#12365;&#12428;&#12356;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12373;&#12428;&#12383;&#12467;&#12540;&#12489;&#12394;&#12393;&#12364;&#12381;&#12429;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#29694;&#23455;&#30340;&#12395;&#12399;&#12289;&#12371;&#12428;&#12425;&#12434;&#12400;&#12387;&#12385;&#12426;&#12381;&#12429;&#12360;&#12427;&#12371;&#12392;&#12399;&#25163;&#38291;&#12364;&#12363;&#12363;&#12426;&#12377;&#12366;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12395;&#12394;&#12395;&#12424;&#12426;&#12289;&#12402;&#12392;&#12383;&#12403;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21205;&#12365;&#20986;&#12379;&#12400;&#12289;
  &#12371;&#12428;&#12425;&#12398;&#20316;&#26989;&#12395;&#23550;&#12377;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#21332;&#21147;&#12434;&#27491;&#24403;&#12395;&#26399;&#24453;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#20309;&#12364;<span class="emphasis"><em>&#26412;&#24403;&#12395;</em></span>&#24517;&#35201;&#12394;&#12398;&#12363;&#12392;&#12356;&#12360;&#12400;&#12289;
  &#35211;&#26628;&#12360;&#12398;&#35519;&#25972;&#12395;&#21313;&#20998;&#12395;&#21147;&#12434;&#12356;&#12428;&#12289;
  &#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#19981;&#24931;&#12428;&#12392;&#12356;&#12358;&#21517;&#12398;&#26368;&#21021;&#12398;&#38556;&#22721;&#12434;&#20055;&#12426;&#36234;&#12360;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#20316;&#26989;&#12434;&#12502;&#12540;&#12488;&#12473;&#12488;&#12521;&#12483;&#12503;&#36942;&#31243;&#12398;&#31532;&#19968;&#27573;&#38542;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12356;&#12431;&#12400;&#27963;&#24615;&#21270;&#12456;&#12493;&#12523;&#12462;&#12540;&#26368;&#23567;&#12398;&#29366;&#24907;&#12395;&#25345;&#12387;&#12390;&#12356;&#12367;&#12371;&#12392;&#12384;&#12392;&#32771;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#12300;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#20309;&#12425;&#12363;&#12398;&#12363;&#12363;&#12431;&#12426;&#12392;&#25345;&#12392;&#12358;&#12301;
  &#12392;&#32771;&#12360;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12456;&#12493;&#12523;&#12462;&#12540;&#12398;&#38334;&#20516;&#12398;&#12371;&#12392;&#12434;&#12289;&#12393;&#12371;&#12363;&#12398;&#35504;&#12363;&#12364;
  <em class="firstterm">&#12495;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531; (hacktivation)
  <sup>[<a name="idp433200" href="#ftn.idp433200" class="footnote">12</a>]</sup>
  &#12456;&#12493;&#12523;&#12462;&#12540;</em>
  &#12392;&#21628;&#12435;&#12391;&#12356;&#12414;&#12375;&#12383;&#12290;&#12495;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12456;&#12493;&#12523;&#12462;&#12540;&#12364;&#20302;&#12369;&#12428;&#12400;&#20302;&#12356;&#12411;&#12393;&#12356;&#12356;&#12289;
  &#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#26368;&#21021;&#12395;&#34892;&#12358;&#20316;&#26989;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12495;&#12463;&#12486;&#12451;&#12505;&#12540;&#12471;&#12519;&#12531;&#12456;&#12493;&#12523;&#12462;&#12540;&#12434;&#19979;&#12370;&#12390;
  &#12356;&#12429;&#12356;&#12429;&#12394;&#20154;&#12383;&#12385;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12420;&#12377;&#12367;&#12377;&#12427;&#12371;&#12392;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#20197;&#19979;&#12398;&#21508;&#38917;&#12391;&#12399;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12399;&#12376;&#12417;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#37325;&#35201;&#12392;&#12394;&#12427;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#20491;&#21029;&#12395;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12399;&#12376;&#12417;&#12390;&#30693;&#12387;&#12383;&#20154;&#12364;&#36973;&#36935;&#12377;&#12427;&#12391;&#12354;&#12429;&#12358;&#38918;&#12395;&#20006;&#12409;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12398;&#12392;&#12362;&#12426;&#12398;&#38918;&#12391;&#20316;&#25104;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#38917;&#30446;&#12434;&#12289;&#12481;&#12455;&#12483;&#12463;&#12522;&#12473;&#12488;&#12392;&#12375;&#12390;&#29992;&#12356;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12399;&#12376;&#12417;&#12427;&#38555;&#12395;&#12399;&#12371;&#12428;&#12425;&#12398;&#21508;&#38917;&#30446;&#12364;&#32178;&#32645;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12363;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12418;&#12375;&#30465;&#30053;&#12375;&#12383;&#38917;&#30446;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;
  &#12379;&#12417;&#12390;&#20104;&#24819;&#12373;&#12428;&#12427;&#32080;&#26524;&#12364;&#28288;&#36275;&#12398;&#12356;&#12367;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect2" title="&#21517;&#21069;&#12398;&#27770;&#23450;"><div class="titlepage"><div><div><h3 class="title"><a name="choosing-a-name"></a>&#21517;&#21069;&#12398;&#27770;&#23450;</h3></div></div></div><p>
  &#12393;&#12371;&#12363;&#12398;&#35504;&#12363;&#12364;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12371;&#12392;&#12434;&#32862;&#12365;&#12388;&#12369;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#12289;&#20309;&#12363;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26908;&#32034;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#35211;&#12388;&#12369;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12425;&#12364;&#30495;&#12387;&#20808;&#12395;&#30446;&#12395;&#12377;&#12427;&#12398;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;
</p><p>
  &#12377;&#12400;&#12425;&#12375;&#12356;&#21517;&#21069;&#12434;&#12388;&#12369;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25104;&#21151;&#12364;&#32004;&#26463;&#12373;&#12428;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#22793;&#12394;&#21517;&#21069;&#12434;&#12388;&#12369;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;
  &#12381;&#12428;&#12384;&#12369;&#12398;&#29702;&#30001;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;
  &#8212;&#12418;&#12385;&#12429;&#12435;&#12289;<span class="emphasis"><em>&#12354;&#12414;&#12426;&#12395;&#12418;</em></span>
  &#12510;&#12474;&#12356;&#21517;&#21069;&#12434;&#12388;&#12369;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#24746;&#24433;&#38911;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12431;&#12374;&#12431;&#12374;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22833;&#25943;&#12395;&#25345;&#12387;&#12390;&#12356;&#12367;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#12375;&#12394;&#12356;&#12384;&#12429;&#12358;
  &#12392;&#12356;&#12358;&#21069;&#25552;&#12398;&#19979;&#12391;&#35441;&#12434;&#36914;&#12417;&#12414;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#22793;&#12394;&#21517;&#21069;&#12434;&#12388;&#12369;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#30495;&#21091;&#12395;&#21463;&#12369;&#27490;&#12417;&#12390;&#12418;&#12425;&#12360;&#12394;&#12363;&#12387;&#12383;&#12426;&#35226;&#12360;&#12390;&#12418;&#12425;&#12356;&#12395;&#12367;&#12363;&#12387;&#12383;&#12426;&#12375;&#12390;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21033;&#29992;&#12364;&#20302;&#19979;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>&#12424;&#12356;&#21517;&#21069;&#12392;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#26465;&#20214;&#12434;&#28288;&#12383;&#12377;&#12418;&#12398;&#12391;&#12377;&#12290;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
      &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12420;&#12427;&#12371;&#12392;&#12364;&#22810;&#23569;&#12394;&#12426;&#12392;&#12418;&#20998;&#12363;&#12427;&#12371;&#12392;&#12289;
      &#12354;&#12427;&#12356;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#26126;&#12425;&#12363;&#12394;&#24418;&#12391;&#12381;&#12428;&#12392;&#38306;&#36899;&#12364;&#12354;&#12427;&#12371;&#12392;&#12290;
      &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#21517;&#21069;&#12392;&#12420;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12418;&#12425;&#12387;&#12383;&#12354;&#12392;&#12289;
      &#12381;&#12398;&#21517;&#21069;&#12434;&#12377;&#12368;&#24605;&#12356;&#20986;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#35226;&#12360;&#12420;&#12377;&#12356;&#12371;&#12392;&#12290;
      &#12371;&#12371;&#12391;&#12289;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#35328;&#35486;&#12364;&#33521;&#35486;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;
      &#12392;&#12356;&#12358;&#20107;&#23455;&#12434;&#28961;&#35222;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12388;&#12414;&#12426;&#12300;&#35226;&#12360;&#12420;&#12377;&#12356;&#12301;
      &#12392;&#12399;&#12300;&#33521;&#35486;&#12364;&#35501;&#12417;&#12427;&#20154;&#12395;&#12392;&#12387;&#12390;&#35226;&#12360;&#12420;&#12377;&#12356;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
      &#33521;&#35486;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12473;&#12500;&#12540;&#12459;&#12540;&#12398;&#30330;&#38899;&#12395;&#22522;&#12389;&#12367;&#12384;&#12376;&#12419;&#12428;&#12434;&#29992;&#12356;&#12383;&#21517;&#21069;&#12394;&#12393;&#12399;&#12289;
      &#33521;&#35486;&#12434;&#27597;&#22269;&#35486;&#12392;&#12375;&#12394;&#12356;&#22810;&#12367;&#12398;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12431;&#12363;&#12426;&#12395;&#12367;&#12356;&#12418;&#12398;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#12383;&#12384;&#12289;&#12381;&#12428;&#12364;&#20154;&#12398;&#24515;&#12434;&#12402;&#12365;&#12388;&#12369;&#12427;&#12411;&#12393;&#21360;&#35937;&#30340;&#12394;&#12418;&#12398;&#12394;&#12425;&#12400;
      &#12384;&#12376;&#12419;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#20385;&#20516;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#33521;&#35486;&#12434;&#27597;&#22269;&#35486;&#12392;&#12375;&#12394;&#12356;&#20154;&#12383;&#12385;&#12363;&#12425;&#12415;&#12427;&#12392;&#12289;
      &#12384;&#12376;&#12419;&#12428;&#12434;&#29992;&#12356;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21517;&#12434;&#35211;&#12390;&#12418;&#12381;&#12398;&#35501;&#12415;&#26041;&#12434;&#24819;&#20687;&#12375;&#12395;&#12367;&#12367;&#12394;&#12427;
      &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    </p></li><li class="listitem"><p>
      &#26082;&#23384;&#12398;&#21029;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21517;&#12392;&#37325;&#35079;&#12375;&#12394;&#12356;&#12289;
      &#12381;&#12375;&#12390;&#21830;&#27161;&#27177;&#12434;&#20405;&#23475;&#12375;&#12394;&#12356;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12290;
      &#12371;&#12428;&#12399;&#12289;&#31036;&#20736;&#12398;&#21839;&#38988;&#12391;&#12354;&#12427;&#12392;&#21516;&#26178;&#12395;&#27861;&#30340;&#12395;&#12418;&#12424;&#12356;&#32771;&#12360;&#12391;&#12377;&#12290;
      &#21029;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#28151;&#21516;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#26395;&#12414;&#12375;&#12367;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#21029;&#12293;&#12398;&#12418;&#12398;&#12364;&#21516;&#12376;&#21517;&#21069;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
      &#12493;&#12483;&#12488;&#12391;&#25163;&#12395;&#20837;&#12427;&#12418;&#12398;&#12377;&#12409;&#12390;&#12434;&#36861;&#36321;&#12377;&#12427;&#12398;&#12399;&#26082;&#12395;&#21313;&#20998;&#22256;&#38627;&#12394;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
    </p><p>
      &#12354;&#12394;&#12383;&#12364;&#32771;&#12360;&#12390;&#12356;&#12427;&#12398;&#12392;&#21516;&#12376;&#21517;&#21069;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26082;&#12395;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#35519;&#12409;&#12427;&#12395;&#12399;&#12289;
      <a class="xref" href="getting-started.html#look-around" title="&#12414;&#12378;&#12399;&#21608;&#12426;&#12434;&#35211;&#28193;&#12377;&#12371;&#12392;&#12363;&#12425;">&#12300;&#12414;&#12378;&#12399;&#21608;&#12426;&#12434;&#35211;&#28193;&#12377;&#12371;&#12392;&#12363;&#12425;&#12301;</a> &#12391;&#31034;&#12375;&#12383;&#12522;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#30331;&#37682;&#21830;&#27161;&#12395;&#38306;&#12377;&#12427;&#26908;&#32034;&#12399; <a class="ulink" href="http://www.nameprotect.org/" target="_top">http://www.nameprotect.org/</a>
      &#12420; <a class="ulink" href="http://www.uspto.gov/" target="_top">http://www.uspto.gov/</a> &#12391;&#34892;&#12360;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12391;&#12365;&#12428;&#12400;&#12289;<code class="systemitem">.com</code> &#12420;
      <code class="systemitem">.net</code>&#12289;<code class="systemitem">.org</code>
      &#12398;&#12424;&#12358;&#12394;&#12488;&#12483;&#12503;&#12524;&#12505;&#12523;&#12489;&#12513;&#12452;&#12531;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#21517;&#21069;&#12434;&#36984;&#12403;&#12414;&#12375;&#12423;&#12358;&#12290;
      &#12371;&#12398;&#20013;&#12398;&#12356;&#12378;&#12428;&#12363;&#65297;&#12388; (&#12362;&#12381;&#12425;&#12367; <code class="systemitem">.org</code>
      &#12391;&#12375;&#12423;&#12358;) &#12434;&#36984;&#12403;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20844;&#24335;&#12469;&#12452;&#12488;&#12392;&#12375;&#12390;&#23459;&#20253;&#12375;&#12414;&#12377;&#12290;
      &#20182;&#12398;&#65298;&#12388;&#12398;&#12488;&#12483;&#12503;&#12524;&#12505;&#12523;&#12489;&#12513;&#12452;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#21336;&#32020;&#12395;
      &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12488;&#12395;&#36578;&#36865;&#12373;&#12379;&#12427;&#12384;&#12369;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
      &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#31532;&#19977;&#32773;&#12395;&#12381;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#24746;&#29992;&#12373;&#12428;&#12427;&#24515;&#37197;&#12434;&#12394;&#12367;&#12375;&#12414;&#12377;&#12290;
      &#20206;&#12395;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12469;&#12452;&#12488;&#12434;&#21029;&#12398;&#22580;&#25152;
      (<a class="xref" href="getting-started.html#starting-with-canned-hosting" title="&#20844;&#38283;&#22580;&#25152;">&#12300;&#20844;&#38283;&#22580;&#25152;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
      &#12395;&#12362;&#12367;&#12392;&#12375;&#12390;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21517;&#12398;&#12489;&#12513;&#12452;&#12531;&#12399;&#21462;&#24471;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
      &#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12425;&#12398;&#12469;&#12452;&#12488;&#12363;&#12425;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26412;&#26469;&#12398;&#12506;&#12540;&#12472;&#12395;&#36578;&#36865;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
      &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#35226;&#12360;&#12420;&#12377;&#12356;&#12471;&#12531;&#12503;&#12523;&#12394; URL &#12434;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    </p></li></ul></div><p>

</p></div><div class="sect2" title="&#26126;&#30906;&#12394;&#30446;&#27161;&#12434;&#25522;&#12370;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="mission-statement"></a>&#26126;&#30906;&#12394;&#30446;&#27161;&#12434;&#25522;&#12370;&#12427;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#35370;&#12428;&#12383;&#20154;&#12383;&#12385;&#12364;&#27425;&#12395;&#35211;&#12427;&#12418;&#12398;&#12399;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12420;&#30446;&#27161;&#12394;&#12393;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12425;&#12434;&#35211;&#12390; (&#12383;&#12356;&#12390;&#12356;&#12399; 30 &#31186;&#31243;&#24230;&#12391;)&#12289;&#20154;&#12399;
  &#12381;&#12371;&#12363;&#12425;&#20808;&#12395;&#36914;&#12416;&#12363;&#24341;&#12365;&#36820;&#12377;&#12363;&#12434;&#27770;&#26029;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12398;&#30446;&#31435;&#12388;&#22580;&#25152;&#12395;&#37197;&#32622;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21517;&#12398;&#12377;&#12368;&#19979;&#12395;&#32622;&#12367;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12398;&#22768;&#26126;&#12399;&#12289;&#20855;&#20307;&#30340;&#12391;&#20869;&#23481;&#12434;&#32094;&#12426;&#36796;&#12415;&#12289;&#12381;&#12375;&#12390;&#12394;&#12395;&#12424;&#12426;&#12418;&#31777;&#28500;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#20197;&#19979;&#12395;&#24341;&#29992;&#12375;&#12383; <a class="ulink" href="http://www.openoffice.org/" target="_top">http://www.openoffice.org/</a>
  &#12398;&#35352;&#36848;&#12394;&#12393;&#12364;&#12424;&#12356;&#20363;&#12391;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
      To create, as a community, the leading international
      office suite that will run on all major platforms and provide access
      to all functionality and data through open-component based APIs and
      an XML-based file format.
      (&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#12375;&#12390;&#12289;&#22269;&#38555;&#30340;&#12394;&#26368;&#20808;&#31471;&#12398;&#12458;&#12501;&#12451;&#12473;&#12473;&#12452;&#12540;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
      &#12377;&#12409;&#12390;&#12398;&#20027;&#35201;&#12394;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#19978;&#12391;&#21205;&#20316;&#12375;&#12289;
      &#12381;&#12398;&#12377;&#12409;&#12390;&#12398;&#27231;&#33021;&#12420;&#12487;&#12540;&#12479;&#12395;&#23550;&#12375;&#12390;
      &#12458;&#12540;&#12503;&#12531;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12505;&#12540;&#12473;&#12398; API &#12392;
      XML &#12505;&#12540;&#12473;&#12398;&#12501;&#12449;&#12452;&#12523;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12398;&#12450;&#12463;&#12475;&#12473;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;)
    </em></span></p></blockquote></div><p>
  &#12383;&#12387;&#12383;&#12371;&#12428;&#12384;&#12369;&#12398;&#25991;&#31456;&#12391;&#12377;&#12364;&#12289;&#20027;&#12395;&#35370;&#21839;&#32773;&#12398;&#20104;&#20633;&#30693;&#35672;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;
  &#37325;&#35201;&#12394;&#12392;&#12371;&#12429;&#12399;&#12377;&#12409;&#12390;&#12498;&#12483;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  "<span class="emphasis"><em>&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#12375;&#12390; (as a community)</em></span>" &#12392;&#26126;&#35352;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;
  &#12393;&#12371;&#12363;&#65297;&#12388;&#12398;&#20225;&#26989;&#12364;&#38283;&#30330;&#12434;&#25903;&#37197;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;
  "<span class="emphasis"><em>&#22269;&#38555;&#30340;&#12394; (international)</em></span>" &#12392;&#12356;&#12358;&#35328;&#33865;&#12395;&#12424;&#12387;&#12390;&#12289;
  &#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#35079;&#25968;&#12398;&#35328;&#35486;&#12420;&#22320;&#22495;&#12391;&#21205;&#20316;&#12377;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390; "<span class="emphasis"><em>&#12377;&#12409;&#12390;&#12398;&#20027;&#35201;&#12394;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512; (all major platforms)</em></span>"
  &#12392;&#12354;&#12427;&#12371;&#12392;&#12363;&#12425;&#12289;&#12362;&#12381;&#12425;&#12367; Unix&#12289;Macintosh &#12381;&#12375;&#12390; Windows &#12391;&#21205;&#20316;&#12377;&#12427;&#12391;&#12354;&#12429;&#12358;&#12371;&#12392;&#12364;&#35501;&#12415;&#21462;&#12428;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#20182;&#12398;&#31623;&#25152;&#12363;&#12425;&#12399;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12364;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12420;
  &#12501;&#12449;&#12452;&#12523;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#19968;&#33324;&#30340;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12394;&#12393;&#12364;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12425;&#12364; Microsoft Office &#12398;&#20195;&#12431;&#12426;&#12392;&#12394;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12429;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12399;&#12393;&#12371;&#12395;&#12418;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#34892;&#38291;&#12363;&#12425;&#12381;&#12398;&#27671;&#25345;&#12385;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#22768;&#26126;&#12399;&#19968;&#35211;&#12375;&#12383;&#12392;&#12371;&#12429;&#22823;&#38609;&#25226;&#12394;&#12424;&#12358;&#12391;&#12377;&#12364;&#12289;
  &#23455;&#38555;&#12395;&#12399;&#12365;&#12431;&#12417;&#12390;&#32094;&#12426;&#36796;&#12414;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12383; "<span class="emphasis"><em>&#12458;&#12501;&#12451;&#12473;&#12473;&#12452;&#12540;&#12488; (office suite)</em></span>"
  &#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12381;&#12398;&#25163;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12394;&#12376;&#12415;&#12364;&#12354;&#12427;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;
  &#12363;&#12394;&#12426;&#20855;&#20307;&#30340;&#12394;&#21360;&#35937;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12418;&#22768;&#26126;&#12434;&#31777;&#28500;&#12394;&#12418;&#12398;&#12392;&#12377;&#12427;&#12383;&#12417;&#12289;
  &#35370;&#21839;&#32773;&#12364;&#25345;&#12387;&#12390;&#12356;&#12427;&#12391;&#12354;&#12429;&#12358;&#12392;&#24605;&#12431;&#12428;&#12427;&#21069;&#25552;&#30693;&#35672; (&#12371;&#12398;&#22580;&#21512;&#12399; MS Office &#12395;&#38306;&#12377;&#12427;&#12418;&#12398;)
  &#12434;&#21033;&#29992;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#22768;&#26126;&#12398;&#26412;&#36074;&#12399;&#12289;&#12381;&#12428;&#12364;&#23550;&#35937;&#12392;&#12375;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;
  &#12300;&#12384;&#12428;&#12364;&#12381;&#12428;&#12434;&#26360;&#12356;&#12383;&#12363;&#12301;&#12395;&#12418;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;OpenOffice.org &#12364;&#12354;&#12360;&#12390; "<span class="emphasis"><em>&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#12375;&#12390;
  (as a community)</em></span>" &#12392;&#26360;&#12356;&#12390;&#12356;&#12427;&#12398;&#12364;&#12356;&#12356;&#20363;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12418;&#12392;&#12418;&#12392; Sun Microsystems &#12364;&#22987;&#12417;&#12383;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#29694;&#22312;&#12418;&#21516;&#31038;&#12364;&#20027;&#12394;&#12473;&#12509;&#12531;&#12469;&#12540;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12354;&#12360;&#12390;&#12371;&#12398;&#25991;&#35328;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12391; Sun &#12399;&#12300;&#38283;&#30330;&#12503;&#12525;&#12475;&#12473;&#12434;
  &#25903;&#37197;&#12377;&#12427;&#12424;&#12358;&#12394;&#12388;&#12418;&#12426;&#12399;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12300;&#21839;&#38988;&#12364;&#36215;&#12371;&#12427;<span class="emphasis"><em>&#21487;&#33021;&#24615;</em></span>&#12434;&#35469;&#35672;&#12375;&#12390;&#12356;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12377;&#12384;&#12369;&#12391;&#12418;&#12289;&#21839;&#38988;&#12398;&#30330;&#29983;&#12434;&#22238;&#36991;&#12377;&#12427;&#12398;&#12395;&#22823;&#12356;&#12395;&#21177;&#26524;&#12364;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#29305;&#23450;&#12398;&#20225;&#26989;&#12398;&#25903;&#25588;&#12434;&#21463;&#12369;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#25991;&#35328;&#12399;&#19981;&#35201;&#12391;&#12375;&#12423;&#12358;&#12290;&#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;
  &#26222;&#36890;&#12399;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12505;&#12540;&#12473;&#12398;&#38283;&#30330;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12363;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#12431;&#12374;&#12431;&#12374;&#31034;&#12377;&#24517;&#35201;&#12399;&#12394;&#12356;&#12431;&#12369;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#12501;&#12522;&#12540;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#23459;&#35328;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="state-freedom"></a>&#12501;&#12522;&#12540;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#23459;&#35328;&#12377;&#12427;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#30446;&#27161;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126; (&#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;)
  &#12434;&#35501;&#12435;&#12391;&#33288;&#21619;&#12364;&#27531;&#12387;&#12390;&#12356;&#12427;&#12402;&#12392;&#12383;&#12385;&#12399;&#12289;&#12418;&#12387;&#12392;&#35443;&#32048;&#12394;&#24773;&#22577;&#12434;&#30693;&#12426;&#12383;&#12367;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12394;&#12393;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#20309;&#12363;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12397;&#12290;
  &#12391;&#12418;&#12381;&#12398;&#21069;&#12395;&#12289;&#12414;&#12378;&#12399;&#12381;&#12428;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12394;&#12398;&#12363;&#12393;&#12358;&#12363;&#12434;&#30693;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  <span class="emphasis"><em>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12391;&#12289;
  &#12381;&#12428;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#26126;&#35352;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;</em></span>
  &#24403;&#28982;&#12398;&#12371;&#12392;&#12384;&#12392;&#12362;&#32771;&#12360;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12289;
  &#19990;&#12398;&#20013;&#12395;&#12399;&#12381;&#12428;&#12364;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23665;&#12411;&#12393;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#31169;&#12364;&#12363;&#12388;&#12390;&#35211;&#12383;&#12392;&#12354;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12391;&#12399;&#12289;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#37197;&#24067;&#26178;&#12395;&#12393;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12377;&#12427;&#12363;&#12364;&#31034;&#12373;&#12428;&#12390;&#12362;&#12425;&#12378;&#12289;
  &#12373;&#12425;&#12395;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12501;&#12522;&#12540;&#12394;&#12398;&#12363;&#12393;&#12358;&#12363;&#12373;&#12360;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12414;&#12383;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#37325;&#35201;&#12394;&#24773;&#22577;&#12364;
  &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12506;&#12540;&#12472;&#12420;&#38283;&#30330;&#32773;&#21521;&#12369;&#12506;&#12540;&#12472;&#12394;&#12393;&#12395;&#12375;&#12363;&#23384;&#22312;&#12375;&#12394;&#12356;&#12392;&#12356;&#12358;&#12506;&#12540;&#12472;&#12418;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#12289;&#37325;&#35201;&#12394;&#24773;&#22577;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12373;&#12425;&#12395;&#12510;&#12454;&#12473;&#12463;&#12522;&#12483;&#12463;&#12364;&#24517;&#35201;&#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#26368;&#12418;&#12402;&#12393;&#12363;&#12387;&#12383;&#20363;&#12391;&#12399;&#12289;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#19978;&#12398;&#12393;&#12371;&#12395;&#12418;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#31034;&#12373;&#12428;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#12381;&#12398;&#20013;&#36523;&#12434;&#35211;&#12394;&#12356;&#38480;&#12426;&#12289;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20869;&#23481;&#12364;&#12431;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#21516;&#12376;&#12424;&#12358;&#12394;&#12511;&#12473;&#12399;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12427;&#12392;&#12289;&#12379;&#12387;&#12363;&#12367;&#12398;&#38283;&#30330;&#32773;&#20505;&#35036;&#12420;&#12518;&#12540;&#12470;&#12540;&#20505;&#35036;&#12398;&#22810;&#12367;&#12434;&#22833;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12398;&#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#37096;&#12398;&#27425;&#12395;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;
  &#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12354;&#12427;&#12356;&#12399;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12289;
  &#12373;&#12425;&#12395;&#20855;&#20307;&#30340;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#12388;&#12356;&#12390;&#12418;&#35352;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12393;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12377;&#12428;&#12400;&#12356;&#12356;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;
  <a class="xref" href="license-quickstart.html" title="&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992;">&#12300;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992;&#12301;</a>&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#38306;&#12377;&#12427;&#12373;&#12414;&#12374;&#12414;&#12394;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;
  <a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12371;&#12414;&#12391;&#12398;&#24773;&#22577;&#12434;&#35211;&#12427;&#12398;&#12395;&#12289;&#35370;&#21839;&#32773;&#12364;&#35201;&#12377;&#12427;&#26178;&#38291;&#12399;&#65297;&#20998;&#12363;&#12381;&#12428;&#20197;&#19979;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#20869;&#23481;&#12434;&#12418;&#12392;&#12395;&#12289;&#24444;/&#24444;&#22899; &#12425;&#12364;&#12373;&#12425;&#12395;&#27425;&#12434;&#35501;&#12415;&#36914;&#12417;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#27770;&#26029;&#12377;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#26368;&#21021;&#12398;&#65301;&#20998;&#38291;&#12391;&#35370;&#21839;&#32773;&#12364;&#35211;&#12427;&#12391;&#12354;&#12429;&#12358;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#25201;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#27231;&#33021;&#19968;&#35239;&#12539;&#35201;&#20214;&#19968;&#35239;"><div class="titlepage"><div><div><h3 class="title"><a name="features-and-requirements"></a>&#27231;&#33021;&#19968;&#35239;&#12539;&#35201;&#20214;&#19968;&#35239;</h3></div></div></div><p>
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#27231;&#33021;&#19968;&#35239;
  (&#12414;&#12384;&#23436;&#25104;&#12375;&#12390;&#12356;&#12394;&#12356;&#27231;&#33021;&#12434;&#19968;&#35239;&#12395;&#21547;&#12417;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12381;&#12398;&#22580;&#21512;&#12399;
  "<span class="emphasis"><em>&#20104;&#23450;</em></span>" &#12392;&#12363; "<span class="emphasis"><em>&#38283;&#30330;&#20013;</em></span>"
  &#12394;&#12393;&#12392;&#12399;&#12387;&#12365;&#12426;&#31034;&#12375;&#12390;&#32622;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;)&#12289;
  &#12381;&#12375;&#12390;&#12381;&#12428;&#12434;&#21205;&#12363;&#12377;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#35201;&#20214;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#27231;&#33021;&#19968;&#35239;/&#35201;&#20214;&#19968;&#35239;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#35504;&#12363;&#12395;&#32862;&#12363;&#12428;&#12383;&#12392;&#12365;&#12395;
  &#31572;&#12360;&#12427;&#12383;&#12417;&#12395;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12392;&#32771;&#12360;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#21336;&#12395;&#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12398;&#20869;&#23481;&#12434;&#12424;&#12426;&#28145;&#12367;&#25496;&#12426;&#19979;&#12370;&#12383;&#12418;&#12398;&#12392;&#32771;&#12360;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12391;&#27425;&#12398;&#12424;&#12358;&#12395;&#35500;&#26126;&#12375;&#12383;&#12392;&#12377;&#12427;&#12392;&#12289;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
    &#35914;&#23500;&#12394; API &#12434;&#20633;&#12360;&#12383;&#20840;&#25991;&#12452;&#12531;&#12487;&#12463;&#12469;&#12540;&#12539;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
    &#22823;&#37327;&#12398;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12377;&#12427;&#26908;&#32034;&#12469;&#12540;&#12499;&#12473;&#12434;&#28310;&#20633;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#21033;&#29992;&#12434;&#24819;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  </em></span></p></blockquote></div><p>
  &#27231;&#33021;&#19968;&#35239;&#12289;&#35201;&#20214;&#19968;&#35239;&#12391;&#12381;&#12398;&#35443;&#32048;&#12434;&#35500;&#26126;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;
  &#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12398;&#31684;&#22258;&#12434;&#26126;&#30906;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#27231;&#33021;</em></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="emphasis"><em>&#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12289;HTML &#12362;&#12424;&#12403; XML
                &#12398;&#26908;&#32034;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#21336;&#35486;&#12354;&#12427;&#12356;&#12399;&#12501;&#12524;&#12540;&#12474;&#12395;&#12424;&#12427;&#26908;&#32034;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>(&#20104;&#23450;) &#12354;&#12356;&#12414;&#12356;&#26908;&#32034;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>(&#20104;&#23450;) &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#24046;&#20998;&#26356;&#26032;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>(&#20104;&#23450;) &#12522;&#12514;&#12540;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#21270;</em></span></p></li></ul></div><p><span class="emphasis"><em>&#35201;&#20214;</em></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="emphasis"><em>Python 2.2 &#20197;&#38477;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20316;&#25104;&#29992;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;
                (&#20803;&#12398;&#12487;&#12540;&#12479;&#12398;&#32004;&#65298;&#20493;&#12398;&#22823;&#12365;&#12373;)</em></span></p></li></ul></div></blockquote></div><p>
  &#12371;&#12428;&#12425;&#12398;&#24773;&#22577;&#12395;&#12424;&#12387;&#12390;&#12289;&#35370;&#21839;&#32773;&#12399;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#33258;&#20998;&#12398;&#24076;&#26395;&#12434;&#28288;&#12383;&#12377;&#12418;&#12398;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12375;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#38283;&#30330;&#32773;&#12392;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12434;&#26908;&#35342;&#12375;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect2" title="&#38283;&#30330;&#12398;&#36914;&#25431;&#29366;&#27841;"><div class="titlepage"><div><div><h3 class="title"><a name="development-status"></a>&#38283;&#30330;&#12398;&#36914;&#25431;&#29366;&#27841;</h3></div></div></div><p>
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12356;&#12387;&#12383;&#12356;&#20309;&#12434;&#12420;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12289;&#35370;&#21839;&#32773;&#12383;&#12385;&#12399;&#12365;&#12387;&#12392;&#27671;&#12395;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#29305;&#12395;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12399;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25522;&#12370;&#12390;&#12356;&#12427;&#30446;&#27161;&#12398;&#12358;&#12385;
  &#29694;&#22312;&#12393;&#12428;&#12367;&#12425;&#12356;&#12364;&#36948;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#12364;&#27671;&#12395;&#12394;&#12427;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
  &#21313;&#20998;&#12395;&#25104;&#29087;&#12375;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12395;&#27671;&#12395;&#12394;&#12427;&#12398;&#12399;&#12289;
  &#12300;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#29694;&#22312;&#27963;&#30330;&#12395;&#20445;&#23432;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#12301;
  &#12300;&#12393;&#12428;&#12367;&#12425;&#12356;&#12398;&#38971;&#24230;&#12391;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#12301;
  &#12300;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12395;&#23550;&#12377;&#12427;&#21453;&#24540;&#12398;&#36895;&#12373;&#12399;&#12393;&#12428;&#12367;&#12425;&#12356;&#12363;&#12301;
  &#12394;&#12393;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12398;&#36074;&#21839;&#12395;&#31572;&#12360;&#12427;&#12383;&#12417;&#12395;&#12289;&#38283;&#30330;&#29366;&#27841;&#12434;&#31034;&#12377;&#12506;&#12540;&#12472;&#12434;&#20316;&#12425;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12371;&#12395;&#12399;&#12289;&#30452;&#36817;&#12398;&#30446;&#27161;&#12392;&#12381;&#12428;&#12434;&#36948;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398;
  (&#12383;&#12392;&#12360;&#12400;&#12300;&#12354;&#12427;&#29305;&#23450;&#12398;&#20998;&#37326;&#12395;&#24375;&#12356;&#38283;&#30330;&#32773;&#12434;&#21215;&#38598;&#12375;&#12390;&#12356;&#12414;&#12377;&#12301;&#12394;&#12393;)
  &#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#36942;&#21435;&#12398;&#12522;&#12522;&#12540;&#12473;&#23653;&#27508;&#12420;&#27231;&#33021;&#19968;&#35239;&#12394;&#12393;&#12418;&#12371;&#12371;&#12395;&#25522;&#36617;&#12377;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12300;&#36914;&#25431;&#12301;&#12392;&#12356;&#12358;&#12418;&#12398;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#23450;&#32681;&#12375;&#12289;
  &#12381;&#12398;&#23450;&#32681;&#12395;&#12375;&#12383;&#12364;&#12387;&#12390;&#12393;&#12398;&#12367;&#12425;&#12356;&#36895;&#12367;&#21069;&#36914;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12289;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#35370;&#21839;&#32773;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#12414;&#12384;&#12391;&#12365;&#12354;&#12364;&#12387;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#24656;&#12428;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12365;&#12354;&#12364;&#12387;&#12390;&#12418;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#22793;&#12395;&#12372;&#12414;&#12363;&#12377;&#12371;&#12392;&#12418;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12395;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#27573;&#38542;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#12289;&#12415;&#12435;&#12394;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  "&#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12450;&#12523;&#12501;&#12449;&#29256;&#12391;&#12377;&#12290;&#26082;&#30693;&#12398;&#12496;&#12464;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  &#12392;&#12426;&#12354;&#12360;&#12378;&#12399;&#21205;&#20316;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;&#33258;&#24049;&#36012;&#20219;&#12398;&#12418;&#12392;&#12391;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;"
  &#12392;&#35328;&#12387;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;&#20309;&#12418;&#24677;&#12378;&#12363;&#12375;&#12356;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#27573;&#38542;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#24517;&#35201;&#12392;&#12375;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12399;&#12289;
  &#12300;&#12450;&#12523;&#12501;&#12449;&#29256;&#12301;&#12392;&#12356;&#12358;&#35500;&#26126;&#12394;&#12435;&#12363;&#12391;&#12399;&#12362;&#12403;&#12360;&#12383;&#12426;&#12375;&#12414;&#12379;&#12435;&#12290;&#23550;&#12456;&#12531;&#12489;&#12518;&#12540;&#12470;&#12540;&#12392;&#12356;&#12358;&#38754;&#12391;&#12399;&#12289;
  &#12414;&#12384;&#12391;&#12365;&#12354;&#12364;&#12387;&#12390;&#12418;&#12356;&#12394;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364;&#32676;&#12364;&#12387;&#12390;&#12375;&#12414;&#12358;&#12411;&#12393;&#12414;&#12378;&#12356;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12356;&#12387;&#12383;&#12435;&#12300;&#19981;&#23433;&#23450;&#12301;&#12384;&#12392;&#12363;&#12300;&#12496;&#12464;&#12384;&#12425;&#12369;&#12384;&#12301;&#12384;&#12392;&#12363;&#12356;&#12358;&#35413;&#21028;&#12364;&#20986;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#12381;&#12428;&#12434;&#25173;&#25325;&#12377;&#12427;&#12398;&#12399;&#22823;&#22793;&#12394;&#35441;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#22810;&#23569;&#20445;&#23432;&#30340;&#12394;&#12411;&#12358;&#12364;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12300;&#12518;&#12540;&#12470;&#12540;&#12364;&#26399;&#24453;&#12375;&#12390;&#12356;&#12427;&#12424;&#12426;&#12418;&#23433;&#23450;&#12375;&#12390;&#12356;&#12383;&#12301;
  &#12411;&#12358;&#12364;&#12289;&#26399;&#24453;&#12399;&#12378;&#12428;&#12384;&#12387;&#12383;&#22580;&#21512;&#12424;&#12426;&#12418;&#12378;&#12387;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12381;&#12398;&#12411;&#12358;&#12364;&#12289;&#21475;&#12467;&#12511;&#12395;&#12424;&#12427;&#24195;&#12364;&#12426;&#12364;&#26399;&#24453;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><div class="sidebar" title="&#12450;&#12523;&#12501;&#12449;&#29256;/&#12505;&#12540;&#12479;&#29256;"><a name="alpha-and-beta"></a><div class="titlepage"><div><div><p class="title"><b>&#12450;&#12523;&#12501;&#12449;&#29256;/&#12505;&#12540;&#12479;&#29256;</b></p></div></div></div><p>
    <em class="firstterm">&#12450;&#12523;&#12501;&#12449;&#29256;</em> &#12392;&#12399;&#12289;&#36890;&#24120;&#12399;&#19968;&#30058;&#26368;&#21021;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#12371;&#12392;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
    &#12392;&#12426;&#12354;&#12360;&#12378;&#12399;&#21205;&#12363;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#12402;&#12392;&#12392;&#12362;&#12426;&#12398;&#27231;&#33021;&#12399;&#12381;&#12429;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12414;&#12384;&#12496;&#12464;&#12364;&#27531;&#12387;&#12390;&#12356;&#12427;&#29366;&#24907;&#12391;&#12377;&#12290;&#12450;&#12523;&#12501;&#12449;&#29256;&#12398;&#20027;&#12394;&#30446;&#30340;&#12399;&#12289;
    &#21033;&#29992;&#32773;&#12363;&#12425;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12434;&#24471;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#38283;&#30330;&#32773;&#12399;&#12289;
    &#20309;&#12395;&#21462;&#12426;&#32068;&#12416;&#12409;&#12365;&#12363;&#12434;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#27425;&#12398;&#27573;&#38542;&#12392;&#12394;&#12427;&#12398;&#12364;<em class="firstterm">&#12505;&#12540;&#12479;&#29256;</em>&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#33268;&#21629;&#30340;&#12394;&#12496;&#12464;&#12399;&#12377;&#12409;&#12390;&#20462;&#27491;&#28168;&#12415;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12414;&#12384;&#12522;&#12522;&#12540;&#12473;&#12395;&#21521;&#12369;&#12390;&#12398;&#21313;&#20998;&#12394;&#12486;&#12473;&#12488;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12394;&#12356;&#29366;&#24907;&#12391;&#12377;&#12290;
    &#12505;&#12540;&#12479;&#29256;&#12398;&#30446;&#30340;&#12395;&#12399;&#65298;&#31278;&#39006;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#65297;&#12388;&#12395;&#12399;&#12289;&#12496;&#12464;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12395;&#12381;&#12428;&#12434;&#12381;&#12398;&#12414;&#12414;&#20844;&#24335;&#12522;&#12522;&#12540;&#12473;&#12392;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12418;&#12358;&#65297;&#12388;&#12395;&#12399;&#12289;&#20844;&#24335;&#12522;&#12522;&#12540;&#12473;&#12434;&#26089;&#12367;&#34892;&#12358;&#12383;&#12417;&#12289;
    &#38283;&#30330;&#32773;&#12364;&#35443;&#32048;&#12394;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12434;&#21463;&#12369;&#21462;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12450;&#12523;&#12501;&#12449;&#29256;&#12392;&#12505;&#12540;&#12479;&#29256;&#12398;&#24046;&#12434;&#12393;&#12371;&#12395;&#12362;&#12367;&#12363;&#12399;&#12289;&#12354;&#12394;&#12383;&#12375;&#12384;&#12356;&#12391;&#12377;&#12290;
  </p></div></div><div class="sect2" title="&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;"><div class="titlepage"><div><div><h3 class="title"><a name="downloads"></a>&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;</h3></div></div></div><p>
  &#27161;&#28310;&#30340;&#12394;&#24418;&#24335;&#12391;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#12289;&#12496;&#12452;&#12490;&#12522; (&#23455;&#34892;&#21487;&#33021;) &#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12394;&#12367;&#12390;&#12418;&#12363;&#12414;&#12431;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12384;&#12375;&#12289;&#12499;&#12523;&#12489;&#25163;&#38918;&#12364;&#38754;&#20498;&#12384;&#12387;&#12383;&#12426;&#20381;&#23384;&#24615;&#12364;&#35079;&#38609;&#12384;&#12387;&#12383;&#12426;&#12375;&#12390;&#12289;
  &#12383;&#12384;&#21205;&#12363;&#12379;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12384;&#12369;&#12391;&#12418;&#22810;&#12367;&#12398;&#20154;&#12395;&#12392;&#12387;&#12390;&#39592;&#12364;&#25240;&#12428;&#12427;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#12289;
  &#12496;&#12452;&#12490;&#12522;&#29256;&#12418;&#24517;&#35201;&#12391;&#12377; (&#12391;&#12418;&#12289;
  &#12381;&#12435;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;&#12354;&#12414;&#12426;&#39749;&#21147;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12290;
</p><p>
  &#37197;&#24067;&#24418;&#24907;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#20415;&#21033;&#12391;&#27161;&#28310;&#30340;&#12363;&#12388;&#20313;&#35336;&#12394;&#36000;&#25285;&#12398;&#23569;&#12394;&#12356;&#12418;&#12398;&#12434;&#36984;&#12403;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12354;&#12427;&#30149;&#27671;&#12398;&#25778;&#28357;&#12434;&#29401;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289;
  &#34220;&#12434;&#37197;&#12427;&#38555;&#12395;&#29420;&#33258;&#12398;&#27880;&#23556;&#22120;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12424;&#12358;&#12394;&#38754;&#20498;&#12394;&#25163;&#27573;&#12399;&#12392;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21516;&#27096;&#12395;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12388;&#12356;&#12390;&#12418;&#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12391;
  &#12499;&#12523;&#12489;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#27161;&#28310;&#12363;&#12425;&#22806;&#12428;&#12428;&#12400;&#22806;&#12428;&#12427;&#12411;&#12393;&#12289;
  &#12518;&#12540;&#12470;&#12540;&#20505;&#35036;&#12420;&#38283;&#30330;&#32773;&#20505;&#35036;&#12399;&#29436;&#29437;&#12375;&#12390;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#38626;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#24403;&#28982;&#12398;&#12371;&#12392;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#26412;&#24403;&#12395;&#20999;&#32701;&#35440;&#12427;&#12414;&#12391;
  &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#25163;&#38918;&#12434;&#27161;&#28310;&#21270;&#12375;&#12424;&#12358;&#12392;&#12399;&#12375;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  <span class="emphasis"><em>"&#12414;&#12289;&#12522;&#12522;&#12540;&#12473;&#12395;&#36817;&#12389;&#12356;&#12383;&#12425;
  &#12381;&#12398;&#12392;&#12365;&#12395;&#12420;&#12429;&#12358;&#12424;&#12290;&#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#12356;&#12388;&#12391;&#12418;&#12391;&#12365;&#12427;&#12435;&#12384;&#12363;&#12425;&#12290;"</em></span>
  &#12392;&#12356;&#12387;&#12383;&#35328;&#12356;&#35379;&#12434;&#12375;&#12390;&#12375;&#12414;&#12356;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12431;&#12363;&#12387;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;&#12381;&#12358;&#12356;&#12387;&#12383;&#20316;&#26989;&#12434;&#24460;&#22238;&#12375;&#12395;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#32080;&#26524;&#30340;&#12395;&#12522;&#12522;&#12540;&#12473;&#12395;&#36817;&#12389;&#12367;&#12414;&#12391;&#20313;&#35336;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12387;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12400;&#12289;&#12373;&#12418;&#12394;&#12367;&#12400;&#12467;&#12540;&#12489;&#12434;&#36002;&#29486;&#12375;&#12390;&#12367;&#12428;&#12383;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#38283;&#30330;&#32773;&#12383;&#12385;&#12398;&#24847;&#27442;&#12434;&#21066;&#12356;&#12391;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12418;&#12387;&#12392;&#12418;&#24746;&#12356;&#12371;&#12392;&#12395;&#12289;&#24444;&#12425;&#12399;&#12381;&#12398;&#12424;&#12358;&#12394;&#38283;&#30330;&#32773;&#12434;&#22833;&#12356;&#12388;&#12388;&#12354;&#12427;&#12371;&#12392;&#12395;&#27671;&#12389;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12400;&#12289;&#12371;&#12398;&#36942;&#31243;&#12399;
  &#12300;&#35504;&#12363;&#12364;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#35370;&#12428;&#12383;&#8594;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;
  &#8594;&#12499;&#12523;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#8594;&#22833;&#25943;&#12375;&#12383;&#8594;&#12354;&#12365;&#12425;&#12417;&#12383;&#12301;
  &#12392;&#12356;&#12358;&#12289;&#12452;&#12505;&#12531;&#12488;&#12364;&#30330;&#29983;&#12375;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12398;&#31309;&#12415;&#37325;&#12397;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12354;&#12365;&#12425;&#12417;&#12383;&#26412;&#20154;&#20197;&#22806;&#12395;&#12399;&#12289;&#12381;&#12435;&#12394;&#12371;&#12392;&#12364;&#12354;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12392;&#12418;&#12392;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#33288;&#21619;&#12434;&#25345;&#12387;&#12390;&#12356;&#12390;&#12367;&#12428;&#12383;&#12399;&#12378;&#12398;&#20154;&#12364;&#40665;&#12387;&#12390;&#31435;&#12385;&#21435;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12289;
  &#12381;&#12375;&#12390;&#12381;&#12428;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#35504;&#12418;&#27671;&#12389;&#12363;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#38754;&#20498;&#12384;&#12364;&#35211;&#36820;&#12426;&#12398;&#22823;&#12365;&#12356;&#20316;&#26989;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#26089;&#12417;&#12395;&#28168;&#12414;&#12379;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12365;&#12385;&#12435;&#12392;&#20316;&#25104;&#12377;&#12427;&#12392;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#21152;&#38556;&#22721;&#12434;&#21127;&#30340;&#12395;&#12362;&#12429;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
  &#32080;&#26524;&#12392;&#12375;&#12390;&#22823;&#12365;&#12394;&#35211;&#36820;&#12426;&#12434;&#24471;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29992;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;
  &#19968;&#24847;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#20154;&#12399;&#12289;&#65298;&#12388;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#12358;&#12385;&#12393;&#12385;&#12425;&#12364;&#26032;&#12375;&#12356;&#12398;&#12363;&#12434;&#30693;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12398;&#12388;&#12369;&#12363;&#12383;&#12395;&#12388;&#12356;&#12390;&#12399;
  <span><a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a></span> &#12398;
  <a class="xref" href="development-cycle.html#release-numbering" title="&#12522;&#12522;&#12540;&#12473;&#12395;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12395;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;&#12301;</a> &#12391;&#12289;
  &#12381;&#12375;&#12390;&#12499;&#12523;&#12489;&#25163;&#38918;&#12420;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#25163;&#38918;&#12398;&#27161;&#28310;&#21270;&#12395;&#12388;&#12356;&#12390;&#12399;&#21516;&#12376;&#31456;&#12398;
  <a class="xref" href="packaging.html" title="&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;">&#12300;&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;&#12301;</a>
  &#12391;&#12381;&#12428;&#12382;&#12428;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12420;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-and-bug-tracker-access"></a>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12420;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;</h3></div></div></div><p>
  &#21336;&#12395;&#12381;&#12398;&#12477;&#12501;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#20351;&#12356;&#12383;&#12356;&#12384;&#12369;&#12392;&#12356;&#12358;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;
  &#12477;&#12540;&#12473;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#21313;&#20998;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;&#12487;&#12496;&#12483;&#12464;&#12434;&#12375;&#12383;&#12426;
  &#27231;&#33021;&#36861;&#21152;&#12434;&#12375;&#12383;&#12426;&#12375;&#12383;&#12356;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#27598;&#26217;&#26368;&#26032;&#12477;&#12540;&#12473;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12356;&#12358;&#25163;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#38283;&#30330;&#12364;&#27963;&#30330;&#12395;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#12399;&#12414;&#12384;&#12371;&#12428;&#12391;&#12418;&#23436;&#29863;&#12384;&#12392;&#12399;&#12356;&#12360;&#12414;&#12379;&#12435;&#12290;
  &#24120;&#12395;&#12381;&#12398;&#26178;&#28857;&#12398;&#26368;&#26032;&#12398;&#12477;&#12540;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383;&#12356;&#12392;&#12356;&#12358;&#20154;&#12383;&#12385;&#12395;&#12381;&#12398;&#25163;&#27573;&#12434;&#25552;&#20379;&#12377;&#12427;&#12398;&#12364;&#12289;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12477;&#12540;&#12473;&#12395;&#21311;&#21517;&#12391;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12392;&#12289;
  &#12300;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#26032;&#12375;&#12356;&#12513;&#12531;&#12496;&#12540;&#12398;&#21442;&#21152;&#12434;&#27475;&#36814;&#12375;&#12390;&#12356;&#12414;&#12377;&#12301;
  &#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12518;&#12540;&#12470;&#12540;&#12392;&#38283;&#30330;&#32773;&#12398;&#20001;&#26041;&#12395;&#36865;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#20170;&#12377;&#12368;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#29992;&#24847;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
  &#36817;&#12293;&#20844;&#38283;&#20104;&#23450;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26360;&#12356;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#12399;
  <span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="vc.html" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;">&#12300;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12301;</a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#12418;&#21516;&#12376;&#12391;&#12377;&#12290;
  &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#24847;&#32681;&#12399;&#12289;&#38283;&#30330;&#32773;&#12395;&#23550;&#12377;&#12427;&#26377;&#29992;&#24615;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#12381;&#12428;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35251;&#23519;&#32773;&#12395;&#23550;&#12375;&#12390;&#30330;&#12375;&#12390;&#12356;&#12427;&#26263;&#40665;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  &#22810;&#12367;&#12398;&#20154;&#12399;&#12289;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;
  &#12300;&#29105;&#24515;&#12395;&#38283;&#30330;&#12364;&#36914;&#12417;&#12425;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12384;&#12301;&#12392;&#24863;&#12376;&#12414;&#12377;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12383;&#12367;&#12373;&#12435;&#12398;&#12496;&#12464;&#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12356;&#12427;&#12411;&#12393;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35211;&#26628;&#12360;&#12399;&#12424;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12385;&#12423;&#12387;&#12392;&#30452;&#24863;&#12395;&#21453;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12391;&#12418;&#32771;&#12360;&#12390;&#12418;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12383;&#12496;&#12464;&#12398;&#25968;&#12364;&#23455;&#38555;&#20309;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;
  &#12381;&#12428;&#12399;&#27425;&#12398;&#65299;&#12388;&#12391;&#12377;&#12290;&#12414;&#12378;&#12289;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#23384;&#22312;&#12377;&#12427;&#12496;&#12464;&#12398;&#32118;&#23550;&#25968;&#12290;
  &#27425;&#12395;&#12289;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#25968;&#12290;
  &#12381;&#12375;&#12390;&#26368;&#24460;&#12395;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#26032;&#35215;&#12398;&#12496;&#12464;&#12434;&#30331;&#37682;&#12391;&#12365;&#12427;&#12383;&#12417;&#12398;&#21033;&#20415;&#24615;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12358;&#12385;&#26368;&#21021;&#12398;&#65297;&#12388;&#12424;&#12426;&#12418;&#24460;&#12429;&#12398;&#65298;&#12388;&#12398;&#26041;&#12364;&#37325;&#35201;&#12394;&#35201;&#32032;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#31243;&#24230;&#12398;&#35215;&#27169;&#12392;&#35079;&#38609;&#12373;&#12434;&#25345;&#12388;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12399;&#12289;
  &#22522;&#26412;&#30340;&#12395;&#12496;&#12464;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#26412;&#24403;&#12398;&#21839;&#38988;&#12399;&#12289;
  &#12381;&#12428;&#12425;&#12398;&#12496;&#12464;&#12434;&#12356;&#12363;&#12395;&#12375;&#12390;&#35211;&#12388;&#12369;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;&#20778;&#20808;&#38918;&#20301;&#12434;&#35373;&#23450;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#12392;&#12371;&#12429;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12424;&#12367;&#25972;&#20633;&#12373;&#12428;&#12383; (&#12496;&#12464;&#12395;&#23550;&#12377;&#12427;&#23550;&#24540;&#12364;&#12377;&#12400;&#12420;&#12367;&#12289;
  &#37325;&#35079;&#12375;&#12383;&#12496;&#12464;&#22577;&#21578;&#12399;&#12365;&#12385;&#12435;&#12392;&#32113;&#19968;&#12373;&#12428;&#12390;&#12356;&#12427;&#12394;&#12393;) &#22823;&#35215;&#27169;&#12394;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#12354;&#12427;&#12392;&#12289;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#12394;&#12363;&#12387;&#12383;&#12426;&#12411;&#12392;&#12435;&#12393;&#27231;&#33021;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12426;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12424;&#12426;
  &#12378;&#12387;&#12392;&#21360;&#35937;&#12364;&#12424;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26412;&#24403;&#12395;&#22987;&#12414;&#12387;&#12383;&#12400;&#12363;&#12426;&#12394;&#12398;&#12394;&#12425;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12427;&#20869;&#23481;&#12399;&#12411;&#12435;&#12398;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#12393;&#12358;&#12395;&#12418;&#12375;&#12424;&#12358;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22987;&#12414;&#12387;&#12383;&#12400;&#12363;&#12426;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12393;&#12371;&#12363;&#12395;&#12365;&#12385;&#12435;&#12392;&#26360;&#12356;&#12390;&#12354;&#12426;&#12289;
  &#12363;&#12388;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12364;&#26368;&#36817;&#30331;&#37682;&#12373;&#12428;&#12383;&#12496;&#12464;&#12400;&#12363;&#12426;&#12391;&#12354;&#12387;&#12383;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12496;&#12464;&#30331;&#37682;&#12364;&#20581;&#20840;&#12394;<span class="emphasis"><em>&#27604;&#29575;</em></span>&#12434;&#20445;&#12387;&#12390;&#12356;&#12427;&#12289;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35501;&#12415;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12496;&#12464;&#30331;&#37682;&#12398;&#32118;&#23550;&#25968;&#12364;&#23567;&#12373;&#12356;&#12371;&#12392;&#12434;&#19981;&#24403;&#12395;&#35686;&#25106;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12373;&#12428;&#12427;&#12398;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12496;&#12464;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#27231;&#33021;&#36861;&#21152;&#12398;&#35201;&#26395;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#22793;&#26356;&#12289;
  &#12392;&#12426;&#12354;&#12360;&#12378;&#20445;&#30041;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#20316;&#26989;&#12394;&#12393;&#12364;&#30331;&#37682;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#22810;&#12293;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#36939;&#29992;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;
  <span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="bug-tracker.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;">&#12300;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12301;</a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12377;&#12427;&#12398;&#12391;&#12289;
  &#12371;&#12371;&#12391;&#12399;&#28145;&#12367;&#31435;&#12385;&#20837;&#12426;&#12414;&#12379;&#12435;&#12290;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35211;&#26628;&#12360;&#12392;&#12356;&#12358;&#35251;&#28857;&#12363;&#12425;&#35211;&#12390;&#22823;&#20999;&#12394;&#12398;&#12399;&#12289;
  &#12414;&#12378;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12364; <span class="emphasis"><em>&#23384;&#22312;&#12377;&#12427;</em></span> &#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
  &#12381;&#12375;&#12390;&#12381;&#12428;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12363;&#12425;&#12383;&#12393;&#12428;&#12427;&#22580;&#25152;&#12395;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#36899;&#32097;&#25163;&#27573;"><div class="titlepage"><div><div><h3 class="title"><a name="communications-channels"></a>&#36899;&#32097;&#25163;&#27573;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38306;&#20418;&#32773;&#12398;&#36899;&#32097;&#20808;&#12434;&#30693;&#12426;&#12383;&#12356;&#12392;&#12356;&#12358;&#20154;&#12418;&#12354;&#12425;&#12431;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#38306;&#20418;&#32773;&#12392;&#36899;&#32097;&#12434;&#21462;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12420;
  &#12481;&#12515;&#12483;&#12488;&#12523;&#12540;&#12512;&#12289;IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12289;&#25522;&#31034;&#26495;&#12394;&#12393;&#12398;&#22580;&#25152;&#12434;&#31034;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12289;&#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#38306;&#20418;&#32773;&#12364;&#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#26126;&#35352;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12300;&#12381;&#12371;&#12395;&#34892;&#12369;&#12400;&#38283;&#30330;&#32773;&#12392;&#35441;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#20253;&#12431;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#36074;&#21839;&#12395;&#31572;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12363;
  &#12377;&#12409;&#12390;&#12398;&#35201;&#26395;&#12395;&#31572;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12363;&#12356;&#12387;&#12383;&#32681;&#21209;&#12364;&#30330;&#29983;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#38263;&#12356;&#30446;&#12391;&#35211;&#12428;&#12400;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#25522;&#31034;&#26495;&#12395;&#12399;&#21442;&#21152;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#12392;&#12399;&#12356;&#12360;&#12289;&#24517;&#35201;&#12394;&#12425;&#12356;&#12388;&#12391;&#12418;&#21442;&#21152;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12377;&#12384;&#12369;&#12391;&#12289;
  &#23433;&#24515;&#24863;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#12400;&#12363;&#12426;&#12398;&#12371;&#12429;&#12399;&#12289;
  &#12456;&#12531;&#12489;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12392;&#38283;&#30330;&#32773;&#21521;&#12369;&#12395;&#12501;&#12457;&#12540;&#12521;&#12512;&#12434;&#20998;&#12369;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12424;&#12426;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12427;&#20154;&#12383;&#12385;&#12364;&#65297;&#12388;&#12398;&#12300;&#37096;&#23627;&#12301;
  &#12395;&#38598;&#12414;&#12387;&#12390;&#12431;&#12356;&#12431;&#12356;&#12364;&#12420;&#12364;&#12420;&#35441;&#12434;&#12377;&#12427;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12450;&#12540;&#12522;&#12540;&#12450;&#12480;&#12503;&#12479;&#12540;&#23652;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#38283;&#30330;&#32773;&#12392;&#12518;&#12540;&#12470;&#12540;&#12398;&#21306;&#21029;&#12399;&#12354;&#12356;&#12414;&#12356;&#12391;&#12377;&#12290;
  &#12354;&#12360;&#12390;&#20998;&#39006;&#12377;&#12427;&#12392;&#12375;&#12390;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21021;&#26399;&#12395;&#12399;&#38283;&#30330;&#32773;&#12398;&#27604;&#29575;&#12364;&#12363;&#12394;&#12426;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12450;&#12540;&#12522;&#12540;&#12450;&#12480;&#12503;&#12479;&#12540;&#12398;&#12377;&#12409;&#12390;&#12364;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12495;&#12483;&#12463;&#12375;&#12383;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20170;&#24460;&#12398;&#26041;&#21521;&#24615;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12395;&#12399;
  &#33288;&#21619;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#26412;&#31456;&#12391;&#12399;&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#31435;&#12385;&#19978;&#12370;&#12427;&#12363;&#12301;&#12395;&#12388;&#12356;&#12390;&#12398;&#12415;&#12434;&#25201;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#27573;&#38542;&#12391;&#12399;&#12300;&#12392;&#12426;&#12354;&#12360;&#12378;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#29992;&#12398;&#22580;&#25152;&#12364;&#24517;&#35201;&#12384;&#12301;&#12392;&#12356;&#12358;&#12367;&#12425;&#12356;&#12391;&#21313;&#20998;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24460;&#12391;&#12289;<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span>
  &#12398; <a class="xref" href="growth.html" title="&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;">&#12300;&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;&#12301;</a> &#12395;&#12362;&#12356;&#12390;&#12373;&#12425;&#12395;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12289;&#25522;&#31034;&#26495;&#12398;&#35373;&#32622;&#12420;&#31649;&#29702;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#25201;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12356;&#12388;&#12363;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#20250;&#35696;&#23460;&#12392;&#38283;&#30330;&#32773;&#21521;&#12369;&#20250;&#35696;&#23460;&#12434;&#20998;&#21106;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#20001;&#32773;&#12398;&#38291;&#12395;&#28317;&#12434;&#29983;&#12376;&#12373;&#12379;&#12394;&#12356;&#12383;&#12417;&#12398;&#26041;&#27861;&#12418;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;"><div class="titlepage"><div><div><h3 class="title"><a name="developer-guidelines"></a>&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;</h3></div></div></div><p>
  &#38283;&#30330;&#32773;&#12392;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12424;&#12358;&#12392;&#32771;&#12360;&#12383;&#20154;&#12399;&#12289;
  &#12414;&#12378;&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#25506;&#12377;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#12289;&#25216;&#34899;&#30340;&#12394;&#12418;&#12398;&#12392;&#12356;&#12358;&#12424;&#12426;&#12418;&#12416;&#12375;&#12429;&#31038;&#20250;&#30340;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#38283;&#30330;&#32773;&#21516;&#22763;&#12398;&#12420;&#12426;&#12392;&#12426;&#12398;&#26041;&#27861;&#12289;&#12518;&#12540;&#12470;&#12540;&#12392;&#12398;&#12420;&#12426;&#12392;&#12426;&#12398;&#26041;&#27861;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12358;&#12414;&#12367;&#36914;&#12417;&#12427;&#12383;&#12417;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12367;&#12363;&#12394;&#12393;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12488;&#12500;&#12483;&#12463;&#12395;&#12388;&#12356;&#12390;&#12399;
  <span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a></span>
  &#12398; <a class="xref" href="written-rules.html" title="&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;">&#12300;&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;&#12301;</a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12289;&#12381;&#12371;&#12395;&#21547;&#12417;&#12427;&#22522;&#26412;&#30340;&#12394;&#20869;&#23481;&#12384;&#12369;&#12434;&#12414;&#12392;&#12417;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
      &#20182;&#12398;&#38283;&#30330;&#32773;&#12392;&#12398;&#12420;&#12426;&#21462;&#12426;&#12398;&#12383;&#12417;&#12398;&#12501;&#12457;&#12540;&#12521;&#12512;&#12398;&#22580;&#25152;
    </p></li><li class="listitem"><p>
      &#12496;&#12464;&#22577;&#21578;&#12420;&#12497;&#12483;&#12481;&#12398;&#25237;&#31295;&#12398;&#26041;&#27861;
    </p></li><li class="listitem"><p>
      &#38283;&#30330;&#12398;&#22522;&#26412;&#26041;&#37341;&#8212;
      &#12300;&#24904;&#24754;&#28145;&#12356;&#29420;&#35009;&#32773;&#12301;&#24335;&#12391;&#12356;&#12367;&#12398;&#12363;&#12300;&#27665;&#20027;&#20027;&#32681;&#12301;&#24335;&#12391;&#12356;&#12367;&#12398;&#12363;&#12289;
      &#12354;&#12427;&#12356;&#12399;&#12381;&#12428;&#20197;&#22806;&#12398;&#25163;&#27861;&#12434;&#12392;&#12427;&#12398;&#12363;
    </p></li></ul></div><p>


  &#12392;&#12371;&#12429;&#12391;&#12289;&#12300;&#29420;&#35009;&#32773;&#12301;&#12392;&#12356;&#12358;&#35328;&#12356;&#26041;&#12395;&#12399;&#12289;&#29305;&#12395;&#12381;&#12428;&#12434;&#25209;&#21028;&#12377;&#12427;&#24847;&#22259;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#29305;&#23450;&#12398;&#38283;&#30330;&#32773;&#12384;&#12369;&#12364;&#12377;&#12409;&#12390;&#12398;&#22793;&#26356;&#12395;&#23550;&#12377;&#12427;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12391;&#12365;&#12427;
  &#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#23554;&#21046;&#25919;&#27835;&#12434;&#34892;&#12387;&#12390;&#12418;&#12414;&#12387;&#12383;&#12367;&#21839;&#38988;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12289;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12371;&#12398;&#26041;&#24335;&#12391;&#25104;&#21151;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12381;&#12358;&#12356;&#12358;&#26041;&#37341;&#12391;&#36939;&#21942;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12399;&#12387;&#12365;&#12426;&#31034;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12395;&#12399;&#29420;&#35009;&#22411;&#12394;&#12398;&#12395;&#28961;&#29702;&#12395;&#27665;&#20027;&#20027;&#32681;&#12387;&#12413;&#12367;&#35211;&#12379;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#20154;&#12399;&#38626;&#12428;&#12390;&#12356;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12365;&#12385;&#12435;&#12392;&#29420;&#35009;&#22411;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#23459;&#35328;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12381;&#12398;&#29420;&#35009;&#32773;&#12364;&#26377;&#33021;&#12391;&#20449;&#38972;&#12391;&#12365;&#12427;&#20154;&#12391;&#12354;&#12427;&#38480;&#12426;&#12399;&#12358;&#12414;&#12367;&#36914;&#12415;&#12414;&#12377;&#12290;
</p><p>
  &#38283;&#30330;&#32773;&#21521;&#12369;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12398;&#23455;&#20363;&#12399;
  <a class="ulink" href="http://subversion.apache.org/docs/community-guide/" target="_top">http://subversion.apache.org/docs/community-guide/</a>
  &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;&#12414;&#12383;&#12289;<a class="ulink" href="http://www.openoffice.org/dev_docs/guidelines.html" target="_top">http://www.openoffice.org/dev_docs/guidelines.html</a>
  &#12395;&#12399;&#12289;&#12424;&#12426;&#19968;&#33324;&#30340;&#12394;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12385;&#12425;&#12399;&#12289;
  &#25216;&#34899;&#30340;&#12394;&#35441;&#38988;&#12424;&#12426;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#20307;&#21046;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#21152;&#26041;&#27861;&#12395;&#37325;&#28857;&#12434;&#32622;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#21521;&#12369;&#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12434;&#34892;&#12358;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  <span>&#26412;&#31456;&#12398;&#24460;&#21322;</span>&#12398;
  <a class="xref" href="getting-started.html#developer-documentation" title="&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;">&#12300;&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12301;</a> &#12391;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;"><div class="titlepage"><div><div><h3 class="title"><a name="documentation"></a>&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;</h3></div></div></div><p>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#24517;&#35201;&#19981;&#21487;&#27424;&#12391;&#12377;&#12290;
  <span class="emphasis"><em>&#20309;&#12363;</em></span>&#35501;&#12435;&#12391;&#12418;&#12425;&#12358;&#12418;&#12398;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12381;&#12428;&#12364;&#12372;&#12367;&#31777;&#21336;&#12394;&#26410;&#23436;&#25104;&#12398;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#20316;&#26989;&#12399;&#12414;&#12373;&#12395;&#12289;&#20808;&#12411;&#12393;&#35328;&#21450;&#12375;&#12383;&#12300;&#39592;&#25240;&#12426;&#20181;&#20107;&#12301;&#12398;&#31684;&#30087;&#12395;&#23646;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#26032;&#12375;&#12356;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12375;&#12400;&#12375;&#12400;&#26368;&#21021;&#12395;&#12388;&#12414;&#12389;&#12367;&#12398;&#12364;&#12371;&#12398;&#20998;&#37326;&#12391;&#12377;&#12290;
  &#12511;&#12483;&#12471;&#12519;&#12531;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12420;&#27231;&#33021;&#19968;&#35239;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12363;&#12289;
  &#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12363;&#12289;&#38283;&#30330;&#29366;&#27841;&#12434;&#12414;&#12392;&#12417;&#12427;&#12392;&#12363;&#12356;&#12387;&#12383;&#12371;&#12392;&#12399;&#12393;&#12428;&#12418;&#27604;&#36611;&#30340;&#23567;&#35215;&#27169;&#12394;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12418;&#12300;&#12371;&#12371;&#12414;&#12391;&#12391;&#12365;&#12383;&#12425;&#23436;&#20102;&#12301;&#12392;&#12356;&#12358;&#28857;&#12364;&#12399;&#12387;&#12365;&#12426;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#36890;&#24120;&#12399;&#19968;&#24230;&#20316;&#25104;&#12377;&#12428;&#12400;&#12381;&#12428;&#20197;&#38477;&#12399;&#25163;&#12434;&#21152;&#12360;&#12427;&#24517;&#35201;&#12398;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20316;&#25104;&#12399;&#12371;&#12428;&#12425;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289;
  &#27770;&#12375;&#12390;&#32066;&#12431;&#12427;&#12371;&#12392;&#12398;&#12394;&#12356;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#12415;&#12435;&#12394;&#12364;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20316;&#25104;&#12434;&#23244;&#12364;&#12427;&#12402;&#12392;&#12388;&#12398;&#29702;&#30001;&#12364;&#12371;&#12371;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20316;&#25104;&#12395;&#12362;&#12356;&#12390;&#26368;&#12418;&#27880;&#24847;&#12377;&#12409;&#12365;&#28857;&#12399;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#26360;&#12365;&#25163;&#12395;&#12392;&#12387;&#12390;&#26377;&#29992;&#12394;&#20869;&#23481;&#12392;&#35501;&#12415;&#25163;&#12395;&#12392;&#12387;&#12390;&#26377;&#29992;&#12394;&#20869;&#23481;&#12392;&#12399;
  &#12414;&#12387;&#12383;&#12367;&#27491;&#21453;&#23550;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12399;&#12376;&#12417;&#12390;&#20351;&#29992;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12395;&#12392;&#12387;&#12390;&#24517;&#35201;&#12394;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289;
  &#22522;&#26412;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25163;&#12387;&#21462;&#12426;&#26089;&#12367;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#26041;&#27861;&#12420;
  &#21205;&#20316;&#12398;&#27010;&#35201;&#12289;&#12381;&#12375;&#12390;&#19968;&#33324;&#30340;&#12394;&#20316;&#26989;&#12434;&#12377;&#12427;&#12383;&#12417;&#12398;&#25163;&#24341;&#12365;&#12394;&#12393;&#12364;&#24517;&#35201;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12425;&#12398;&#20869;&#23481;&#12399;&#12414;&#12373;&#12395;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;<span class="emphasis"><em>&#26360;&#12365;&#25163;</em></span>
  &#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#12424;&#12367;&#30693;&#12426;&#12377;&#12366;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12363;&#12360;&#12387;&#12390;&#12289;&#29289;&#20107;&#12434;&#35501;&#32773;&#12398;&#35222;&#28857;&#12363;&#12425;&#30522;&#12417;&#12383;&#12426;&#12289;&#12414;&#12383;&#12289;
  (&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#26360;&#12365;&#25163;&#12395;&#12392;&#12387;&#12390;&#12399;) &#35328;&#21450;&#12395;&#20516;&#12375;&#12394;&#12356;&#12411;&#12393;&#26126;&#30333;&#12394;&#25163;&#38918;&#12434;&#12289;
  &#39592;&#12434;&#25240;&#12387;&#12390;&#35443;&#32048;&#12395;&#35500;&#26126;&#12377;&#12427;&#12398;&#12364;&#22256;&#38627;&#12395;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12398;&#12510;&#12523;&#31192;&#25163;&#27573;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#35504;&#12363;&#12364;&#33136;&#12434;&#33853;&#12385;&#30528;&#12369;&#12390;&#12381;&#12428;&#12434;&#26360;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#21021;&#24515;&#32773;&#12395;&#12381;&#12428;&#12434;&#35211;&#12379;&#12390;&#20869;&#23481;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12418;&#12425;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#26360;&#24335;&#12399;&#12289;
  &#12383;&#12392;&#12360;&#12400; HTML &#12420;&#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12289;Texinfo &#12354;&#12427;&#12356;&#12399;&#21508;&#31278; XML &#12392;&#12356;&#12387;&#12383;&#12424;&#12358;&#12394;&#12289;
  &#12471;&#12531;&#12503;&#12523;&#12391;&#32232;&#38598;&#12375;&#12420;&#12377;&#12356;&#12418;&#12398;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12377;&#12394;&#12431;&#12385;&#12289;&#12405;&#12392;&#24605;&#12387;&#12383;&#12392;&#12365;&#12362;&#25163;&#36605;&#12363;&#12388;&#36805;&#36895;&#12395;&#26356;&#26032;&#12377;&#12427;&#12398;&#12395;&#36969;&#12375;&#12383;&#26360;&#24335;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20316;&#25104;&#32773;&#12364;&#12354;&#12392;&#12363;&#12425;&#12381;&#12428;&#12434;&#26356;&#26032;&#12377;&#12427;&#38555;&#12398;&#25163;&#38291;&#12418;&#23569;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#24460;&#12363;&#12425;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21512;&#27969;&#12375;&#12383;&#20154;&#12395;&#12392;&#12387;&#12390;&#12418;&#12289;&#20316;&#26989;&#12395;&#21442;&#21152;&#12375;&#12420;&#12377;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#22522;&#26412;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#12365;&#12385;&#12435;&#12392;&#25972;&#20633;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12398;&#12402;&#12392;&#12388;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12399;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#32178;&#32645;&#12377;&#12427;&#31684;&#22258;&#12434;&#20107;&#21069;&#12395;&#38480;&#23450;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20316;&#25104;&#12364;
  &#26524;&#12390;&#12375;&#12394;&#12356;&#20316;&#26989;&#12395;&#24605;&#12360;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12399;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#23455;&#38555;&#30340;&#12394;&#30446;&#23433;&#12392;&#12375;&#12390;&#12399;&#12289;&#20197;&#19979;&#12395;&#25369;&#12370;&#12427;&#26368;&#20302;&#38480;&#12398;&#22522;&#28310;&#12399;&#28288;&#12383;&#12377;&#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
      &#35501;&#32773;&#12395;&#23550;&#12375;&#12390;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12392;&#12394;&#12427;
      &#25216;&#34899;&#30340;&#12394;&#21069;&#25552;&#30693;&#35672;&#12434;&#26126;&#30906;&#12395;&#31034;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#25163;&#38918;&#12434;&#12289;
      &#26126;&#30906;&#12363;&#12388;&#23436;&#20840;&#12395;&#35500;&#26126;&#12377;&#12427;&#12290;
      &#12381;&#12375;&#12390;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#26368;&#21021;&#12398;&#12411;&#12358;&#12391;
      &#31777;&#21336;&#12394;&#21205;&#20316;&#12486;&#12473;&#12488;&#12398;&#26041;&#27861;&#12420;&#22522;&#26412;&#30340;&#12394;&#12467;&#12510;&#12531;&#12489;&#12434;&#35500;&#26126;&#12375;&#12289;
      &#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12364;&#27491;&#24120;&#12395;&#23436;&#20102;&#12375;&#12383;&#12398;&#12363;&#12434;&#30906;&#35469;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12290;
      &#23566;&#20837;&#12395;&#38306;&#12377;&#12427;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289;
      &#12354;&#12427;&#24847;&#21619;&#23455;&#38555;&#12398;&#20351;&#29992;&#27861;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12424;&#12426;&#12418;&#37325;&#35201;&#12391;&#12377;&#12290;
      &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#36215;&#21205;&#12377;&#12427;&#12383;&#12417;&#12395;&#12424;&#12426;&#22810;&#12367;&#12398;&#21162;&#21147;&#12434;&#27880;&#12366;&#36796;&#12435;&#12391;&#12356;&#12428;&#12400;&#12356;&#12427;&#12411;&#12393;&#12289;
      &#12381;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12424;&#12426;&#31896;&#12426;&#24375;&#12367;&#12289;
      &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#19981;&#21313;&#20998;&#12394;&#39640;&#24230;&#12394;&#27231;&#33021;&#12434;&#29702;&#35299;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
      &#12518;&#12540;&#12470;&#12540;&#12364;&#35558;&#12417;&#12427;&#12392;&#12375;&#12383;&#12425;&#12289;&#12381;&#12428;&#12399;&#21021;&#26399;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#12388;&#12414;&#12426;&#12289;&#26368;&#12418;&#21021;&#26399;&#12398;&#27573;&#38542;&#12391;&#12354;&#12427;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#12371;&#12381;&#26368;&#22823;&#12398;&#12469;&#12509;&#12540;&#12488;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#24418;&#24335;&#12398;&#20363;&#12434;&#29992;&#12356;&#12390;&#12289;&#19968;&#33324;&#30340;&#12394;&#20316;&#26989;&#12398;&#26041;&#27861;&#12434;&#31034;&#12377;&#12371;&#12392;&#12289;
      &#12418;&#12385;&#12429;&#12435;&#12373;&#12414;&#12374;&#12414;&#12394;&#20316;&#26989;&#12395;&#23550;&#12377;&#12427;&#12383;&#12367;&#12373;&#12435;&#12398;&#20363;&#12364;&#12354;&#12427;&#12395;&#12371;&#12375;&#12383;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
      &#26178;&#38291;&#12364;&#38480;&#12425;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12393;&#12428;&#12363;&#12402;&#12392;&#12388;&#12395;&#32094;&#12387;&#12390;&#12381;&#12428;&#12434;&#23436;&#29863;&#12395;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
      &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12394;&#12395;&#12363;&#12402;&#12392;&#12388;&#12398;&#22580;&#38754;&#12391;
      <span class="emphasis"><em>&#20351;&#12360;&#12427;</em></span>&#12371;&#12392;&#12364;&#12431;&#12363;&#12428;&#12400;&#12289;
      &#12354;&#12392;&#12399;&#33258;&#20998;&#33258;&#36523;&#12391;&#20182;&#12398;&#20351;&#12356;&#26041;&#12434;&#35211;&#12388;&#12369;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#12414;&#12383;&#12289;&#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#12300;&#27531;&#12426;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26360;&#12356;&#12390;&#12354;&#12370;&#12424;&#12358;&#12363;&#65311;&#12301;
      &#12394;&#12435;&#12390;&#12356;&#12358;&#24184;&#36939;&#12394;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#27425;&#12398;&#12509;&#12452;&#12531;&#12488;&#12391;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#12414;&#12384;&#20986;&#26469;&#19978;&#12364;&#12387;&#12390;&#12356;&#12394;&#12356;&#12392;&#12371;&#12429;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
      &#12381;&#12428;&#12434;&#31034;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12290;
      &#35501;&#32773;&#12395;&#23550;&#12375;&#12289;&#36275;&#12426;&#12390;&#12356;&#12394;&#12356;&#37096;&#20998;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#35469;&#35672;&#12375;&#12390;&#12356;&#12414;&#12377;&#12424;&#12289;
      &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12377;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;
      &#12354;&#12394;&#12383;&#12399;&#35501;&#32773;&#12398;&#35222;&#32218;&#12395;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#35501;&#32773;&#12395;&#20849;&#24863;&#12434;&#31034;&#12377;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#35501;&#32773;&#12395;&#23550;&#12375;&#12289;
      &#37325;&#35201;&#12394;&#12371;&#12392;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#32013;&#24471;&#12375;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12398;&#33510;&#38360;&#12395;&#30452;&#38754;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12289;
      &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#20877;&#20445;&#35388;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
      &#21029;&#12395;&#12300;&#12356;&#12388;&#12414;&#12391;&#12395;&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#20181;&#19978;&#12370;&#12427;&#12301;&#12392;&#34920;&#26126;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#21161;&#12369;&#12434;&#24195;&#12367;&#27714;&#12417;&#12427;&#12418;&#12398;&#12392;&#12375;&#12390;&#21462;&#12426;&#25201;&#12358;&#12398;&#12418;&#21516;&#31243;&#24230;&#12395;&#27491;&#24403;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
    </p></li></ul></div><p>
  &#12371;&#12398;&#26368;&#24460;&#12395;&#36848;&#12409;&#12383;&#28857;&#12399;&#12289;&#23455;&#12398;&#12392;&#12371;&#12429;&#12289;&#12424;&#12426;&#24195;&#31684;&#22258;&#12398;&#37325;&#35201;&#24615;&#12364;&#12354;&#12426;&#12289;
  &#21336;&#12395;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12384;&#12369;&#12395;&#38480;&#12425;&#12378;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12395;&#12354;&#12390;&#12399;&#12414;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#26082;&#30693;&#12398;&#36275;&#12426;&#12390;&#12356;&#12394;&#12356;&#37096;&#20998;&#12434;&#27491;&#30906;&#12395;&#20250;&#35336;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12395;&#12362;&#12356;&#12390;&#12399;&#24403;&#12383;&#12426;&#21069;&#12398;&#12371;&#12392;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27424;&#28857;&#12434;&#24517;&#35201;&#20197;&#19978;&#12395;&#35463;&#24373;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21336;&#12395;&#12289;&#20107;&#24773;&#12364;&#12381;&#12428;&#12434;&#35201;&#27714;&#12377;&#12427;&#22580;&#21512;
  (&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12496;&#12464;&#36861;&#36321;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12289;&#12354;&#12427;&#12356;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12362;&#12369;&#12427;&#35696;&#35542;&#12394;&#12393;)
  &#12395;&#12289;&#12381;&#12428;&#12434;&#21427;&#27491;&#12363;&#12388;&#31169;&#24773;&#12434;&#20132;&#12360;&#12378;&#12395;&#26126;&#12425;&#12363;&#12395;&#12377;&#12427;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#36000;&#12369;&#29356;&#26681;&#24615;&#12384;&#12392;&#12356;&#12358;&#20154;&#12399;&#12356;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#26126;&#31034;&#30340;&#12395;&#31034;&#12373;&#12394;&#12356;&#38480;&#12426;&#12399;&#12300;&#12356;&#12388;&#12414;&#12391;&#12395;&#12371;&#12428;&#12434;&#35299;&#27770;&#12377;&#12427;&#12301;&#12392;&#12356;&#12358;&#20844;&#32004;&#12384;&#12392;&#21463;&#12369;&#21462;&#12427;&#20154;&#12418;&#12356;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;&#12384;&#12428;&#12391;&#12418;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#27424;&#38501;&#12434;&#30330;&#35211;&#12375;&#12390;&#12375;&#12414;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12364;&#24515;&#12398;&#28310;&#20633;&#12434;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#12354;&#12370;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#33258;&#20998;&#12383;&#12385;&#12398;&#12371;&#12392;&#12364;&#12424;&#12367;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><div class="sidebar" title="FAQ &#12398;&#31649;&#29702;"><a name="starting-a-faq"></a><div class="titlepage"><div><div><p class="title"><b>FAQ &#12398;&#31649;&#29702;</b></p></div></div></div><p>
    <em class="firstterm">FAQ</em> ("Frequently Asked Questions"&#12289;
    &#12388;&#12414;&#12426; "&#12424;&#12367;&#12354;&#12427;&#36074;&#21839;&#38598;") &#12399;&#12289;&#25945;&#32946;&#12392;&#12356;&#12358;&#35251;&#28857;&#12395;&#12362;&#12356;&#12390;&#25237;&#36039;&#21177;&#26524;&#12398;&#26368;&#12418;&#39640;&#12356;&#12418;&#12398;&#12398;&#65297;&#12388;&#12391;&#12377;&#12290;
    FAQ &#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12420;&#38283;&#30330;&#32773;&#12364;&#23455;&#38555;&#12395;&#36074;&#21839;&#12377;&#12427;&#20869;&#23481;
    &#8212;&#24444;&#12425;&#12364;&#36074;&#21839;&#12377;&#12427;&#12371;&#12392;&#12434;&#12354;&#12394;&#12383;&#12364; <span class="emphasis"><em>&#26399;&#24453;&#12375;&#12383;</em></span>
    &#20869;&#23481;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#8212;&#12395;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#32080;&#26524;&#12289;&#12424;&#12367;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12373;&#12428;&#12390;&#12356;&#12427; FAQ
    &#12434;&#25506;&#12375;&#12383;&#20154;&#12399;&#12383;&#12356;&#12390;&#12356;&#12289;&#12414;&#12373;&#12395;&#27442;&#12375;&#12363;&#12387;&#12383;&#22238;&#31572;&#12364;&#35211;&#12388;&#12369;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#20309;&#12363;&#21839;&#38988;&#12395;&#20986;&#12367;&#12431;&#12377;&#12392;&#12414;&#12378; FAQ &#12434;&#35519;&#12409;&#12414;&#12377;&#12290;
    &#20844;&#24335;&#12510;&#12491;&#12517;&#12450;&#12523;&#12424;&#12426;&#12418; FAQ &#12398;&#12411;&#12358;&#12434;&#20808;&#12395;&#35211;&#12427;&#12371;&#12392;&#12418;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12375;&#12390;&#12289;&#20182;&#12398;&#12469;&#12452;&#12488;&#12363;&#12425;&#26368;&#12418;&#22810;&#12367;&#12522;&#12531;&#12463;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12398;&#12418;
    FAQ &#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  </p><p>
    &#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22987;&#12414;&#12387;&#12383;&#12400;&#12363;&#12426;&#12398;&#12371;&#12429;&#12399;
    FAQ &#12434;&#29992;&#24847;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;FAQ &#12399;&#35504;&#12363;&#12364;&#26360;&#12367;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#24464;&#12293;&#12395;&#25104;&#38263;&#12375;&#12390;&#12356;&#12367;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;FAQ &#12399;&#12289;
    &#12381;&#12398;&#21517;&#21069;&#12363;&#12425;&#12375;&#12390;&#21453;&#24540;&#30340;&#12394;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#12354;&#12426;&#12289;
    &#22810;&#12367;&#12398;&#20154;&#12364;&#26085;&#12293;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12387;&#12390;&#12356;&#12367;&#12395;&#12375;&#12383;&#12364;&#12387;&#12390;&#25104;&#38263;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12363;&#12425;&#21463;&#12369;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12354;&#12429;&#12358;&#36074;&#21839;&#12434;&#27491;&#30906;&#12395;&#20104;&#28204;&#12377;&#12427;&#12371;&#12392;&#12394;&#12393;&#19981;&#21487;&#33021;&#12394;&#12398;&#12391;&#12289;
    &#26377;&#29992;&#12394; FAQ &#12434;&#33136;&#12434;&#25454;&#12360;&#12390;&#12476;&#12525;&#12363;&#12425;&#26360;&#12365;&#19978;&#12370;&#12427;&#12371;&#12392;&#12394;&#12393;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  </p><p>
    &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;FAQ &#12434;&#26360;&#12371;&#12358;&#12392;&#12375;&#12390;&#26178;&#38291;&#12434;&#28010;&#36027;&#12377;&#12427;&#12371;&#12392;&#12399;&#36991;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12411;&#12392;&#12435;&#12393;&#31354;&#12387;&#12413;&#12398; FAQ &#12398;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12434;&#29992;&#24847;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12399;&#33391;&#12356;&#32771;&#12360;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21205;&#12365;&#22987;&#12417;&#12383;&#24460;&#12395;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#36074;&#21839;&#12392;&#22238;&#31572;&#12434;&#25237;&#31295;&#12375;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#27573;&#38542;&#12391;&#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#23436;&#20840;&#24615;&#12391;&#12399;&#12394;&#12367;&#21033;&#20415;&#24615;&#12391;&#12377;&#12290;
    FAQ &#12364;&#36861;&#21152;&#12375;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12428;&#12400;&#12289;&#30342;&#12364;&#12381;&#12371;&#12395;&#36861;&#21152;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;
    (FAQ &#12434;&#36969;&#20999;&#12395;&#31649;&#29702;&#12377;&#12427;&#12392;&#12356;&#12358;&#20316;&#26989;&#12399;&#27770;&#12375;&#12390;&#31777;&#21336;&#12394;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#33288;&#21619;&#12434;&#12381;&#12381;&#12427;&#21839;&#38988;&#12391;&#12377;&#12290;&#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    <span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a></span>
    &#12398; <a class="xref" href="share-management.html#faq-manager" title="FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;">&#12300;FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;</a> &#12391;&#12424;&#12426;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;)&#12290;
  </p></div><div class="sect3" title="&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20844;&#38283;&#26041;&#27861;"><div class="titlepage"><div><div><h4 class="title"><a name="documentation-availability"></a>&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20844;&#38283;&#26041;&#27861;</h4></div></div></div><p>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#65298;&#36890;&#12426;&#12398;&#26041;&#27861;&#12391;&#20844;&#38283;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12458;&#12531;&#12521;&#12452;&#12531;
  (&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#19978;&#12391;&#30452;&#25509;&#20844;&#38283;&#12377;&#12427;&#12418;&#12398;)&#12289;<span class="emphasis"><em>&#12381;&#12375;&#12390;</em></span>
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#37197;&#24067;&#29289;&#12392;&#12375;&#12390;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#21487;&#33021;&#12394;&#12418;&#12398;
  (<span><a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a></span>
  &#12398; <a class="xref" href="packaging.html" title="&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;">&#12300;&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12398;&#65298;&#36890;&#12426;&#12391;&#12377;&#12290;
  &#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#20844;&#38283;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#29702;&#30001;&#12399;&#12289;
  &#20154;&#12399;&#26222;&#36890;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427; <span class="emphasis"><em>&#21069;&#12395;</em></span>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#35501;&#12416;&#12371;&#12392;&#12364;&#22810;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12395;&#20516;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20869;&#23481;&#12391;&#21028;&#26029;&#12377;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12384;&#12369;&#12391;&#12394;&#12367;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12418;&#21516;&#26801;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12391;&#12381;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398;&#12364;&#12377;&#12409;&#12390;&#25163;&#12395;&#20837;&#12427;
  (&#12377;&#12394;&#12431;&#12385;&#12289;&#12525;&#12540;&#12459;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12395;&#12394;&#12427;) &#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12354;&#12427;&#12289;
  &#12392;&#12356;&#12358;&#21407;&#21063;&#12395;&#24467;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#25552;&#20379;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;
  <span class="emphasis"><em>&#20840;&#20307;</em></span>&#12434;&#21336;&#19968;&#12398; HTML
  &#12506;&#12540;&#12472;&#12395;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12408;&#12398;&#12522;&#12531;&#12463;&#12434;&#29992;&#24847;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;
  (&#12371;&#12398;&#12506;&#12540;&#12472;&#12408;&#12398;&#12522;&#12531;&#12463;&#12395;&#12399;&#12289;"&#23436;&#20840;&#29256;" &#12420; "&#12377;&#12409;&#12390;&#12434;&#12402;&#12392;&#12414;&#12392;&#12417;&#12395;&#12375;&#12383;&#12418;&#12398;"&#12289;
  &#12354;&#12427;&#12356;&#12399; "&#21336;&#19968;&#12398;&#22823;&#12365;&#12394;&#12506;&#12540;&#12472;" &#12392;&#12356;&#12387;&#12383;&#35500;&#26126;&#12434;&#12388;&#12369;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#12381;&#12398;&#12506;&#12540;&#12472;&#12398;&#35501;&#12415;&#36796;&#12415;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;)&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20840;&#20307;&#12363;&#12425;&#29305;&#23450;&#12398;&#21336;&#35486;&#12420;&#12501;&#12524;&#12540;&#12474;&#12434;&#26908;&#32034;&#12375;&#12383;&#12356;&#12392;&#12356;&#12387;&#12383;&#29992;&#36884;&#12395;&#12362;&#12356;&#12390;&#20415;&#21033;&#12391;&#12377;&#12290;
  &#19968;&#33324;&#12395;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#20309;&#12434;&#25506;&#12375;&#12383;&#12356;&#12398;&#12363;&#12364;&#26082;&#12395;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#21336;&#12395;&#12289;&#12381;&#12428;&#12364;&#31532;&#20309;&#31456;&#12395;&#12354;&#12427;&#12398;&#12363;&#12364;&#24605;&#12356;&#20986;&#12379;&#12394;&#12356;&#12384;&#12369;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12354;&#12427;&#12506;&#12540;&#12472;&#12395;&#12399;&#30446;&#27425;&#12384;&#12369;&#12289;&#27425;&#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#23566;&#20837;&#12384;&#12369;&#12289;
  &#12381;&#12398;&#27425;&#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12384;&#12369;&#12289;&#8230;&#8230;
  &#12392;&#12356;&#12387;&#12383;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12411;&#12393;&#12473;&#12488;&#12524;&#12473;&#12364;&#28316;&#12414;&#12427;&#12418;&#12398;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12435;&#12394;&#24418;&#24335;&#12398;&#12506;&#12540;&#12472;&#27083;&#25104;&#12384;&#12392;&#12289;&#12502;&#12521;&#12454;&#12470;&#12398;&#26908;&#32034;&#27231;&#33021;&#12364;&#28961;&#24847;&#21619;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#20491;&#21029;&#12395;&#20998;&#21106;&#12375;&#12383;&#24418;&#24335;&#12364;&#20415;&#21033;&#12394;&#12398;&#12399;&#12289;&#24517;&#35201;&#12394;&#20869;&#23481;&#12364;&#31532;&#20309;&#31456;&#12395;&#12354;&#12427;&#12398;&#12363;&#12364;&#20107;&#21069;&#12395;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12377;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20840;&#20307;&#12434;&#38957;&#12363;&#12425;&#26368;&#24460;&#12414;&#12391;&#38918;&#12395;&#35501;&#12435;&#12391;&#12356;&#12365;&#12383;&#12356;&#20154;&#12395;&#12392;&#12387;&#12390;&#12418;&#20415;&#21033;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#20154;&#12398;&#22810;&#12367;&#12399;&#12289;&#12371;&#12398;&#12497;&#12479;&#12540;&#12531;&#12395;&#12399;
  <span class="emphasis"><em>&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;
  &#12424;&#12367;&#12354;&#12427;&#12497;&#12479;&#12540;&#12531;&#12399;&#12289;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22522;&#26412;&#30340;&#12394;&#20869;&#23481;&#12434;&#12354;&#12427;&#31243;&#24230;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#12289;
  &#29305;&#23450;&#12398;&#21336;&#35486;&#12420;&#12501;&#12524;&#12540;&#12474;&#12434;&#26908;&#32034;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#20351;&#12356;&#26041;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#23550;&#12375;&#12390;&#21336;&#19968;&#12398;&#26908;&#32034;&#21487;&#33021;&#12394;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#25552;&#20379;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#24444;&#12425;&#12395;&#12392;&#12387;&#12390;&#12399;&#38750;&#24120;&#12395;&#29983;&#12365;&#12395;&#12367;&#12356;&#19990;&#30028;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect3" title="&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;"><div class="titlepage"><div><div><h4 class="title"><a name="developer-documentation"></a>&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;</h4></div></div></div><p>
  &#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26360;&#12367;&#30446;&#30340;&#12399;&#12289;
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#12467;&#12540;&#12489;&#12434;&#29702;&#35299;&#12377;&#12427;&#12398;&#12434;&#21161;&#12369;&#12427;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12467;&#12540;&#12489;&#12398;&#20462;&#27491;&#12420;&#25313;&#24373;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12398;&#12434;&#21161;&#12369;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20808;&#12411;&#12393;&#35500;&#26126;&#12375;&#12383; <span class="emphasis"><em>&#38283;&#30330;&#32773;&#21521;&#12369;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;</em></span>
  &#12399;&#25216;&#34899;&#30340;&#12392;&#12356;&#12358;&#12424;&#12426;&#12418;&#31038;&#20250;&#30340;&#12394;&#20869;&#23481;&#12391;&#12375;&#12383;&#12364;&#12289;
  &#20170;&#22238;&#35500;&#26126;&#12377;&#12427;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12371;&#12428;&#12392;&#12399;&#23569;&#12293;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#21521;&#12369;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#12289;
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#21516;&#22763;&#12364;&#12362;&#20114;&#12356;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12367;&#12383;&#12417;&#12398;&#26041;&#27861;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12467;&#12540;&#12489;&#12381;&#12398;&#12418;&#12398;&#12392;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12367;&#12383;&#12417;&#12398;&#26041;&#27861;&#12434;&#31034;&#12377;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#21033;&#20415;&#24615;&#12398;&#12383;&#12417;&#12395;&#12371;&#12428;&#12425;&#12398;&#65298;&#12388;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#12402;&#12392;&#12388;&#12395;&#12414;&#12392;&#12417;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;
  (&#20808;&#12411;&#12393;&#20363;&#12391;&#12375;&#12417;&#12375;&#12383; <a class="ulink" href="http://subversion.apache.org/docs/community-guide/" target="_top">http://subversion.apache.org/docs/community-guide/</a>
  &#12398;&#12424;&#12358;&#12395;) &#12364;&#12289;&#12381;&#12358;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#38283;&#30330;&#32773;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#12356;&#12363;&#12395;&#26377;&#29992;&#12394;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12364;&#21407;&#22240;&#12391;&#12522;&#12522;&#12540;&#12473;&#12434;&#36933;&#12425;&#12379;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#12354;&#12387;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#20316;&#32773;&#33258;&#36523;&#12364;&#12467;&#12540;&#12489;&#12395;&#38306;&#12377;&#12427;&#36074;&#21839;&#12395;&#31572;&#12360;&#12425;&#12428;&#12427;
  (&#12381;&#12375;&#12390;&#31572;&#12360;&#12427;&#27671;&#12364;&#12354;&#12427;) &#12398;&#12394;&#12425;&#12289;&#24403;&#38754;&#12399;&#12381;&#12428;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#21516;&#12376;&#36074;&#21839;&#12395;&#31572;&#12360;&#12427;&#32701;&#30446;&#12395;&#12394;&#12427;&#12387;&#12390;&#12356;&#12358;&#12371;&#12392;&#12364;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20316;&#25104;&#12398;&#21205;&#27231;&#12392;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26360;&#12365;&#22987;&#12417;&#12427;&#21069;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21332;&#21147;&#12377;&#12427;&#12371;&#12392;&#12434;&#27770;&#24515;&#12375;&#12383;&#20154;&#12383;&#12385;&#12399;
  &#20309;&#12392;&#12363;&#12467;&#12540;&#12489;&#12392;&#26684;&#38360;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#20309;&#12364;&#20154;&#12434;&#12381;&#12371;&#12414;&#12391;&#12373;&#12379;&#12427;&#12398;&#12363;&#12392;&#12356;&#12360;&#12400;&#12289;
  &#12381;&#12398;&#12467;&#12540;&#12489;&#12364;&#12365;&#12387;&#12392;&#20309;&#12363;&#33258;&#20998;&#12398;&#24441;&#12395;&#31435;&#12388;&#12384;&#12429;&#12358;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#20154;&#12364;&#12381;&#12428;&#12434;&#20449;&#12376;&#12390;&#12356;&#12428;&#12400;&#12289;&#33258;&#20998;&#33258;&#36523;&#12391;&#20309;&#12392;&#12363;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20449;&#12376;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;&#22823;&#37327;&#12398;&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12354;&#12414;&#12426;&#24441;&#31435;&#12383;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12394;&#12398;&#12391;&#12289;&#12418;&#12375;&#12393;&#12385;&#12425;&#12363;&#19968;&#26041;&#12395;&#21521;&#12369;&#12383;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12375;&#12363;&#26360;&#12367;&#26178;&#38291;&#12364;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;
  &#12414;&#12378;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#20316;&#25104;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289;&#20107;&#23455;&#19978;
  &#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12395;&#21442;&#21152;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;
  &#12414;&#12378;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20351;&#12356;&#26041;&#12434;&#36523;&#12395;&#30528;&#12369;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#24460;&#12395;&#12394;&#12387;&#12390;&#20182;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#21516;&#12376;&#12424;&#12358;&#12394;&#36074;&#21839;&#12434;
  &#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#32368;&#12426;&#36820;&#12377;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#12354;&#12425;&#12383;&#12417;&#12390;&#26178;&#38291;&#12434;&#12392;&#12387;&#12390;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#20316;&#25104;&#12377;&#12428;&#12400;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399; wiki &#12434;&#29992;&#12356;&#12390;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26360;&#12365;&#22987;&#12417;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12393;&#12371;&#12429;&#12363;&#12289;wiki &#12434;&#12513;&#12452;&#12531;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#31169;&#12398;&#32076;&#39443;&#19978;&#12289;&#12371;&#12428;&#12399;&#12354;&#12414;&#12426;&#12358;&#12414;&#12367;&#12356;&#12363;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12358;&#12414;&#12367;&#12356;&#12367;&#12392;&#12377;&#12428;&#12400;&#12289;&#12381;&#12428;&#12399;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#27083;&#25104;&#12434;&#12375;&#12387;&#12363;&#12426;&#25226;&#25569;&#12375;&#12289;
  &#12381;&#12371;&#12395;&#20309;&#12434;&#26360;&#12367;&#12409;&#12365;&#12363;&#12434;&#29087;&#30693;&#12375;&#12383;&#25968;&#20154;&#12398;&#20154;&#38291;&#12364;&#38971;&#32321;&#12395; wiki &#12434;&#26356;&#26032;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#35443;&#32048;&#12399;&#12289;<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="wikis.html" title="Wiki">&#12300;Wiki&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div></div><div class="sect2" title="&#20351;&#29992;&#20363;&#12392;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;"><div class="titlepage"><div><div><h3 class="title"><a name="example-output"></a>&#20351;&#29992;&#20363;&#12392;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;</h3></div></div></div><p>
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12394;&#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#12426;&#12289;
  &#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12354;&#12427;&#12356;&#12399;&#12381;&#12358;&#12391;&#12394;&#12356;&#29305;&#24500;&#30340;&#12394;&#20986;&#21147;&#12434;&#34892;&#12387;&#12383;&#12426;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
  &#12381;&#12398;&#12469;&#12531;&#12503;&#12523;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#20844;&#38283;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#22580;&#21512;&#12399;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12364;&#12371;&#12428;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;&#12290;
  &#20986;&#21147;&#12398;&#22580;&#21512;&#12399;&#12289;&#21516;&#12376;&#12367;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12363;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#23455;&#38555;&#12398;&#20986;&#21147;&#12501;&#12449;&#12452;&#12523;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12393;&#12385;&#12425;&#12418;&#12289;&#21363;&#24231;&#12398;&#28288;&#36275;&#24863;&#12395;&#23550;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#27442;&#27714;&#12434;&#28288;&#12383;&#12377;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#38263;&#12293;&#12392;&#12375;&#12383;&#35500;&#26126;&#12420;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12398;&#12420;&#12426;&#12392;&#12426;&#12424;&#12426;&#12418;&#12289;
  &#12411;&#12435;&#12398;&#19968;&#26522;&#12398;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12398;&#12411;&#12358;&#12364;&#35500;&#24471;&#21147;&#12434;&#25345;&#12388;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12399;&#12414;&#12373;&#12395;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;
  <span class="emphasis"><em>&#21205;&#20316;&#12375;&#12383;</em></span>&#32080;&#26524;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#30097;&#12356;&#12398;&#20313;&#22320;&#12364;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12496;&#12464;&#12384;&#12425;&#12369;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#38627;&#12375;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#36275;&#12426;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12418;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12373;&#12360;&#12354;&#12428;&#12400;&#12289;
  &#20309;&#12392;&#12363;&#12364;&#12435;&#12400;&#12428;&#12400;&#21205;&#12363;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12435;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12398;&#35388;&#26126;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><div class="sidebar" title="&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;"><a name="screenshots"></a><div class="titlepage"><div><div><p class="title"><b>&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;</b></p></div></div></div><p>
    &#20316;&#12387;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12473;&#12463;&#12522;&#12540;&#12531;&#12471;&#12519;&#12483;&#12488;&#12398;&#20316;&#25104;&#12399;&#22823;&#22793;&#12394;&#12418;&#12398;&#12395;&#24863;&#12376;&#12425;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12371;&#12391;&#12289;&#12371;&#12371;&#12391;&#12399;&#12381;&#12398;&#22522;&#26412;&#30340;&#12394;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;Gimp (<a class="ulink" href="http://www.gimp.org/" target="_top">http://www.gimp.org/</a>)
    &#12434;&#31435;&#12385;&#19978;&#12370;&#12390;&#12289;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;
    <span class="guimenu">File</span>-&gt;<span class="guimenu">Acquire</span>-&gt;<span class="guimenu">Screenshot</span>
    &#12434;&#36984;&#12403;&#12289;<span class="guimenuitem">Single Window</span> &#12354;&#12427;&#12356;&#12399;
    <span class="guimenuitem">Whole Screen</span> &#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#25351;&#23450;&#12375;&#12390;
    <span class="guimenuitem">OK</span> &#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#27425;&#12395;&#12510;&#12454;&#12473;&#12391;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#12454;&#12451;&#12531;&#12489;&#12454;&#12354;&#12427;&#12356;&#12399;&#12473;&#12463;&#12522;&#12540;&#12531;&#12364;&#12289;
    Gimp &#12395;&#30011;&#20687;&#12392;&#12375;&#12390;&#21462;&#12426;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;&#12354;&#12392;&#12399;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#30011;&#20687;&#12398;&#19968;&#37096;&#12434;&#20999;&#12426;&#20986;&#12375;&#12383;&#12426;
    &#12469;&#12452;&#12474;&#12434;&#22793;&#26356;&#12375;&#12383;&#12426;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#26041;&#27861;&#12399;
    <a class="ulink" href="http://www.gimp.org/tutorials/Lite_Quickies/#crop" target="_top">http://www.gimp.org/tutorials/Lite_Quickies/#crop</a>
    &#12391;&#35500;&#26126;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#32622;&#12367;&#12371;&#12392;&#12398;&#12391;&#12365;&#12427;&#24773;&#22577;&#12399;&#12289;&#12371;&#12428;&#12425;&#20197;&#22806;&#12395;&#12418;&#12383;&#12367;&#12373;&#12435;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26368;&#26032;&#24773;&#22577;&#12398;&#12506;&#12540;&#12472;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27508;&#21490;&#12398;&#12506;&#12540;&#12472;&#12289;&#38306;&#36899;&#12469;&#12452;&#12488;&#12408;&#12398;&#12522;&#12531;&#12463;&#12289;
  &#12469;&#12452;&#12488;&#20869;&#26908;&#32034;&#12398;&#27231;&#33021;&#12289;&#23492;&#20184;&#12398;&#21463;&#20184;&#12394;&#12393;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#26178;&#38291;&#12364;&#35377;&#12375;&#12383;&#12426;&#20309;&#12363;&#29305;&#21029;&#12394;&#29702;&#30001;&#12364;&#12354;&#12427;&#12398;&#12394;&#12425;&#12289;&#12371;&#12428;&#12425;&#12434;&#20316;&#25104;&#12375;&#12390;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#26178;&#12395;&#12399;&#36890;&#24120;&#12399;&#12393;&#12428;&#12418;&#19981;&#35201;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23558;&#26469;&#12398;&#12383;&#12417;&#12395;&#24515;&#12395;&#30041;&#12417;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect2" title="&#20844;&#38283;&#22580;&#25152;"><div class="titlepage"><div><div><h3 class="title"><a name="starting-with-canned-hosting"></a>&#20844;&#38283;&#22580;&#25152;</h3></div></div></div><p>
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12383;&#12417;&#12395;&#12289;
  &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#29992;&#12398;&#38936;&#22495;&#12420;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#27231;&#33021;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12456;&#12522;&#12450;&#12289;
  &#25522;&#31034;&#26495;&#12289;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12394;&#12393;&#12398;&#27231;&#33021;&#12434;&#28961;&#26009;&#12391;&#25552;&#20379;&#12377;&#12427;&#12469;&#12452;&#12488;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#35443;&#32048;&#12399;&#12469;&#12452;&#12488;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#22522;&#26412;&#30340;&#12394;&#27231;&#33021;&#12399;&#12393;&#12371;&#12391;&#12418;&#21516;&#12376;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12469;&#12452;&#12488;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#28961;&#26009;&#12391;&#22810;&#12367;&#12398;&#12418;&#12398;&#12434;&#25163;&#12395;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#12518;&#12540;&#12470;&#12540;&#12408;&#12398;&#35211;&#12379;&#26041;&#12434;&#12365;&#12417;&#32048;&#12363;&#12367;&#35519;&#25972;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12399;&#12354;&#12365;&#12425;&#12417;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12469;&#12452;&#12488;&#12391;&#12393;&#12435;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#29992;&#12356;&#12427;&#12398;&#12363;&#12434;&#27770;&#12417;&#12427;&#12398;&#12399;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#26989;&#32773;&#12391;&#12354;&#12426;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12398;&#35211;&#12383;&#30446;&#12399;&#12381;&#12398;&#26989;&#32773;&#12395;&#22810;&#23569;&#12394;&#12426;&#12392;&#12418;&#24038;&#21491;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12354;&#12425;&#12363;&#12376;&#12417;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#20351;&#12358;&#12371;&#12392;&#12398;&#21033;&#28857;&#12392;&#27424;&#28857;&#12289;
  &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#19968;&#35239;&#12394;&#12393;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399;&#12289;
  <span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="web-site.html#canned-hosting" title="&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;">&#12300;&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp433200" href="#idp433200" class="para">12</a>] </sup>
      hack &#12392; activation &#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12383;&#36896;&#35486;&#65311;
      &#12362;&#12381;&#12425;&#12367; <a class="ulink" href="http://www.gnu.org/software/guile/docs/docs-1.6/guile-ref/Programming-Overview.html" target="_top">http://www.gnu.org/software/guile/docs/docs-1.6/guile-ref/Programming-Overview.html</a>
      &#12363;&#12425;&#12398;&#24341;&#29992;&#12384;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="today.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="license-quickstart.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#29694;&#29366; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992;</td></tr></table></div></body></html>
