<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;"><link rel="prev" href="difficult-people.html" title="&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385;"><link rel="next" href="bug-tracker-usage.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="difficult-people.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</th><td width="20%" align="right"> <a accesskey="n" href="bug-tracker-usage.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="growth"></a>&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;</h2></div></div></div><p>
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#30028;&#12391;&#12399;&#12289;&#25104;&#21151;&#12398;&#20195;&#20767;&#12399;&#37325;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#26360;&#12356;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#26377;&#21517;&#12395;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;
  &#12381;&#12398;&#24773;&#22577;&#12434;&#30693;&#12426;&#12383;&#12364;&#12427;&#20154;&#12398;&#25968;&#12418;&#21127;&#30340;&#12395;&#22679;&#21152;&#12375;&#12414;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#12415;&#12435;&#12394;&#12364;&#12411;&#12375;&#12364;&#12387;&#12390;&#12356;&#12427;&#24773;&#22577;&#12434;&#25552;&#20379;&#12391;&#12365;&#12427;&#20154;&#12398;&#25968;&#12399;&#12289;
  &#12381;&#12428;&#12411;&#12393;&#24613;&#28608;&#12395;&#22679;&#12360;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#12383;&#12392;&#12360;&#24773;&#22577;&#12434;&#12411;&#12375;&#12364;&#12427;&#20154;&#12392;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;&#20154;&#12398;&#22679;&#21152;&#29575;&#12364;
  &#12358;&#12414;&#12356;&#20855;&#21512;&#12395;&#12496;&#12521;&#12531;&#12473;&#12364;&#12392;&#12428;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#38291;&#12391;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;
  &#20154;&#25968;&#12364;&#22679;&#12360;&#12428;&#12400;&#22679;&#12360;&#12427;&#12411;&#12393;&#38754;&#20498;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#19968;&#33324;&#30340;&#12394;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12356;&#12431;&#12422;&#12427; "users" &#12392;&#12363; "discuss" &#12392;&#12363; "help"
  &#12394;&#12393;&#12392;&#12356;&#12387;&#12383;&#21517;&#21069;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;
  &#21517;&#21069;&#12364;&#20309;&#12391;&#12354;&#12427;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#12371;&#12428;&#12425;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#30446;&#30340;&#12399;&#21516;&#12376;&#12391;&#12377;&#12290;
  &#30097;&#21839;&#12364;&#12354;&#12427;&#20154;&#12364;&#36074;&#21839;&#12434;&#12377;&#12428;&#12400;&#20309;&#12425;&#12363;&#12398;&#31572;&#12360;&#12364;&#24471;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12425;&#12398;&#12420;&#12426;&#21462;&#12426;&#12434;&#12383;&#12384;&#30522;&#12417;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;
  &#12381;&#12428;&#12394;&#12426;&#12398;&#30693;&#35672;&#12434;&#24471;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#25163;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#25968;&#21315;&#20154;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#29645;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#19968;&#26085;&#12354;&#12383;&#12426;&#12398;&#25237;&#31295;&#25968;&#12364;&#25968;&#30334;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12367;&#12425;&#12356;&#12398;&#35215;&#27169;&#12395;&#12394;&#12387;&#12390;&#12367;&#12427;&#12392;&#12289;&#12471;&#12473;&#12486;&#12512;&#12399;&#24464;&#12293;&#12395;&#30772;&#32187;&#12375;&#12399;&#12376;&#12417;&#12414;&#12377;&#12290;
  &#20491;&#12293;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#19968;&#26085;&#12395;&#12373;&#12400;&#12365;&#12365;&#12428;&#12394;&#12356;&#37327;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#12369;&#21462;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12381;&#12398;&#20154;&#12395;&#12392;&#12387;&#12390;&#37325;&#33655;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#32771;&#12360;&#12390;&#12418;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;Microsoft &#12364; Windows XP
  &#29992;&#12395;&#12371;&#12398;&#25163;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#38283;&#35373;&#12375;&#12383;&#12392;&#12375;&#12414;&#12377;&#12290;
  Windows XP &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;&#19990;&#30028;&#20013;&#12395;&#20309;&#20740;&#20154;&#12392;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12358;&#12385;&#12398;&#12411;&#12435;&#12398; 0.1% &#12398;&#20154;&#12364; 24 &#26178;&#38291;&#12398;&#12358;&#12385;&#12395;&#12402;&#12392;&#12388;&#12398;&#36074;&#21839;&#12434;&#25237;&#31295;&#12375;&#12383;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#12371;&#12398;&#20206;&#24819;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#19968;&#26085;&#12398;&#25237;&#31295;&#25968;&#12399;10&#19975;&#36890;&#12395;&#12418;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;!
  &#12418;&#12385;&#12429;&#12435;&#12289;&#23455;&#38555;&#12395;&#12399;&#12381;&#12435;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12384;&#12428;&#12418;&#12381;&#12435;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12356;&#32154;&#12369;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#38480;&#12387;&#12383;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12420;&#12458;&#12531;&#12521;&#12452;&#12531;&#12398;&#25522;&#31034;&#26495;&#12289;
  &#12381;&#12398;&#20182;&#20491;&#20154;&#12363;&#12425;&#12398;&#36074;&#21839;&#12434;&#21463;&#12369;&#20184;&#12369;&#12427;&#12354;&#12425;&#12422;&#12427;&#12471;&#12473;&#12486;&#12512;&#12395;&#12399;&#21516;&#12376;&#35542;&#29702;&#12364;&#12354;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#35542;&#29702;&#12364;&#31034;&#21766;&#12377;&#12427;&#12392;&#12371;&#12429;&#12399;&#12354;&#12414;&#12426;&#24605;&#12431;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12514;&#12487;&#12523;&#12391;&#12375;&#12387;&#12363;&#12426;&#12392;&#12375;&#12383;&#12469;&#12509;&#12540;&#12488;&#12434;&#32154;&#12369;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#19990;&#30028;&#24449;&#26381;&#12391;&#12365;&#12427;&#12411;&#12393;&#12395;&#12414;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12434;&#25313;&#22823;&#12377;&#12427;&#12398;&#12399;&#19981;&#21487;&#33021;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#25522;&#31034;&#26495;&#12398;&#35215;&#27169;&#12364;&#33256;&#30028;&#28857;&#12395;&#36948;&#12375;&#12390;&#12418;&#12289;
  &#22823;&#29190;&#30330;&#12364;&#30330;&#29983;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#36000;&#12398;&#21453;&#24540;&#12399;&#12289;&#38745;&#12363;&#12395;&#20986;&#12390;&#12367;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12363;&#12425;&#33073;&#36864;&#12377;&#12427;&#20154;&#12420;
  IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12363;&#12425;&#21435;&#12427;&#20154;&#12364;&#20986;&#12390;&#12365;&#12383;&#12426;&#12289;
  &#12494;&#12452;&#12474;&#12364;&#30446;&#38556;&#12426;&#12384;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#36074;&#21839;&#12434;&#25511;&#12360;&#12427;&#20154;&#12364;&#20986;&#12390;&#12365;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12391;&#12377;&#12290;
  &#20154;&#12364;&#12415;&#12394;&#12371;&#12398;&#12424;&#12358;&#12395;&#21512;&#29702;&#30340;&#12394;&#36984;&#25246;&#12434;&#12377;&#12428;&#12400;&#12289;
  &#25522;&#31034;&#26495;&#12398;&#35215;&#27169;&#12399;&#12354;&#12427;&#31243;&#24230;&#31649;&#29702;&#21487;&#33021;&#12394;&#31684;&#22258;&#12391;&#33853;&#12385;&#30528;&#12367;&#12398;&#12391;&#12399;?
  &#12392;&#32771;&#12360;&#12427;&#20154;&#12364;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#12414;&#12378;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12363;&#12425;&#21435;&#12387;&#12390;&#12356;&#12367;&#12398;&#12399;&#12289;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12399;&#32076;&#39443;&#12434;&#31309;&#12435;&#12384;&#12513;&#12531;&#12496;&#12540;&#12391;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#21442;&#21152;&#12375;&#12390;&#26085;&#12364;&#27973;&#12356;&#20154;&#12383;&#12385;&#12399;&#12381;&#12398;&#12414;&#12414;&#12381;&#12371;&#12395;&#27531;&#12387;&#12383;&#12414;&#12414;&#12391;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12367;&#12394;&#12426;&#12377;&#12366;&#12390;&#12418;
  &#12414;&#12384;&#21516;&#12376;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12514;&#12487;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;
  &#12381;&#12398;&#22580;&#12395;&#12362;&#12369;&#12427;&#36074;&#21839;&#12420;&#22238;&#31572;&#12398;&#12524;&#12505;&#12523;&#12364;&#24464;&#12293;&#12395;&#20302;&#19979;&#12375;&#12390;&#12356;&#12367;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12427;&#12391;&#12289;(&#23455;&#38555;&#12395;&#12399;&#12381;&#12358;&#12391;&#12399;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12398;&#12395;)
  &#26032;&#21442;&#32773;&#12398;&#12411;&#12358;&#12364;&#21476;&#21442;&#12513;&#12531;&#12496;&#12540;&#12424;&#12426;&#21155;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12424;&#12358;&#12395;&#35211;&#12360;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#29366;&#27841;&#12395;&#12394;&#12427;&#12392;&#12289;&#21476;&#26666;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;
  &#12381;&#12371;&#12395;&#21442;&#21152;&#12377;&#12427;&#12513;&#12522;&#12483;&#12488;&#12434;&#12354;&#12414;&#12426;&#24863;&#12376;&#12425;&#12428;&#12394;&#12367;&#12394;&#12426;&#12289;
  &#12393;&#12371;&#12363;&#20182;&#12398;&#22580;&#25152;&#12434;&#25506;&#12377;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12364;&#25313;&#22823;&#12375;&#12383;&#12392;&#12365;&#12395;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20181;&#32068;&#12415;&#12434;&#12393;&#12358;&#12377;&#12427;&#12363;&#12290;
  &#12371;&#12428;&#12395;&#12399;&#12289;&#27425;&#12398;&#12405;&#12383;&#12388;&#12398;&#25126;&#30053;&#12364;&#12363;&#12363;&#12431;&#12387;&#12390;&#12365;&#12414;&#12377;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
      &#20840;&#20307;&#12392;&#12375;&#12390;&#12399;&#24040;&#22823;&#21270;&#12398;&#24746;&#24433;&#38911;&#12364;&#20986;&#12390;&#12365;&#12388;&#12388;&#12354;&#12427;&#12424;&#12358;&#12384;&#12364;&#12289;
      &#29305;&#23450;&#12398;&#20998;&#37326;&#12398;&#35441;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;&#12414;&#12384;&#12381;&#12398;&#24433;&#38911;&#12434;&#21463;&#12369;&#12390;<span class="emphasis"><em>&#12356;&#12394;&#12356;</em></span>
      &#12392;&#12356;&#12358;&#12392;&#12371;&#12429;&#12434;&#35211;&#12388;&#12369;&#12383;&#12425;&#12289;&#12381;&#12398;&#20998;&#37326;&#12398;&#35441;&#38988;&#12384;&#12369;&#12395;&#29305;&#21270;&#12375;&#12383;&#20250;&#35696;&#23460;&#12434;&#26032;&#12383;&#12395;&#20316;&#25104;&#12377;&#12427;
      (&#12388;&#12414;&#12426;&#12289;&#34987;&#23475;&#12364;&#21450;&#12400;&#12394;&#12356;&#12358;&#12385;&#12395;&#20182;&#12398;&#22580;&#25152;&#12395;&#36991;&#38627;&#12373;&#12379;&#12427;)&#12290;
    </p></li><li class="listitem"><p>
      &#24773;&#22577;&#12434;&#33258;&#21205;&#30340;&#12395;&#21462;&#24471;&#12391;&#12365;&#12427;&#22580;&#25152;&#12434;&#22810;&#12367;&#30906;&#20445;&#12375;&#12289;
      &#12381;&#12428;&#12434;&#12365;&#12385;&#12435;&#12392;&#31995;&#32113;&#31435;&#12390;&#12390;&#31649;&#29702;&#12377;&#12427;&#12290;
      &#12414;&#12383;&#12289;&#24120;&#12395;&#26368;&#26032;&#12398;&#24773;&#22577;&#12434;&#21453;&#26144;&#12373;&#12379;&#12289;&#20154;&#12364;&#35211;&#12388;&#12369;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12290;
    </p></li></ol></div><p>
  &#20316;&#25126; (1) &#12399;&#12289;&#36890;&#24120;&#12399;&#12381;&#12435;&#12394;&#12395;&#38627;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#26368;&#21021;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12364;&#12402;&#12392;&#12388;&#12384;&#12369;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12371;&#12391;&#12399;&#12289;&#19968;&#33324;&#30340;&#12394;&#35696;&#35542;&#12398;&#12411;&#12363;&#12395;&#12289;&#27231;&#33021;&#36861;&#21152;&#12398;&#35201;&#26395;&#12420;&#35373;&#35336;&#12395;&#38306;&#12377;&#12427;&#30097;&#21839;&#12289;
  &#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;&#12394;&#12393;&#12373;&#12414;&#12374;&#12414;&#12394;&#20869;&#23481;&#12434;&#12372;&#12385;&#12419;&#28151;&#12380;&#12395;&#12375;&#12390;&#25201;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12427;&#12377;&#12409;&#12390;&#12398;&#20154;&#12383;&#12385;&#12364;&#12381;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12400;&#12425;&#12367;&#12377;&#12427;&#12392;&#12289;&#25201;&#12358;&#20869;&#23481;&#12395;&#12424;&#12387;&#12390;
  &#12356;&#12367;&#12388;&#12363;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#20998;&#21106;&#12375;&#12383;&#12411;&#12358;&#12364;&#12424;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12431;&#12363;&#12387;&#12390;&#12365;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12427;&#12473;&#12524;&#12483;&#12489;&#12391;&#12399;&#38283;&#30330;&#12395;&#38306;&#36899;&#12377;&#12427;&#35441;&#38988;&#12364;&#30427;&#12426;&#19978;&#12364;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#21029;&#12398;&#12473;&#12524;&#12483;&#12489;&#12391;&#12399;&#12289;&#12356;&#12431;&#12422;&#12427;&#12300;&#9675;&#9675;&#12434;&#12377;&#12427;&#12395;&#12399;&#12393;&#12358;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#65311;&#12301;
  &#30340;&#12394;&#36074;&#21839;&#12364;&#34892;&#12431;&#12428;&#12289;&#12414;&#12383;&#21029;&#12398;&#12473;&#12524;&#12483;&#12489;&#12391;&#12399;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12420;&#27231;&#33021;&#36861;&#21152;&#35201;&#27714;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12391;&#12377;&#12290;
  &#20013;&#12395;&#12399;&#12371;&#12428;&#12425;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#35079;&#25968;&#12395;&#21442;&#21152;&#12377;&#12427;&#20154;&#12418;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12371;&#12371;&#12391;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12371;&#12428;&#12425;&#30064;&#12394;&#12427;&#12479;&#12452;&#12503;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#12399;
  &#20849;&#36890;&#28857;&#12364;&#12411;&#12392;&#12435;&#12393;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12289;&#12371;&#12428;&#12425;&#12398;&#35441;&#38988;&#12434;&#12381;&#12428;&#12382;&#12428;&#20491;&#21029;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#20998;&#21106;&#12375;&#12390;&#12418;&#12289;
  &#29305;&#12395;&#24330;&#23475;&#12399;&#20986;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12398;&#20998;&#21106;&#12399;&#12289;&#20108;&#27573;&#38542;&#12398;&#25163;&#38918;&#12434;&#36367;&#12435;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#26032;&#12375;&#12356;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488; (&#12354;&#12427;&#12356;&#12399; IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12394;&#12393;) &#12434;&#20316;&#25104;&#12375;&#12289;
  &#27425;&#12395;&#12381;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#36969;&#20999;&#12395;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12289;
  &#20182;&#12398;&#20154;&#12383;&#12385;&#12434;&#35480;&#23566;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#24460;&#21322;&#12398;&#20316;&#26989;&#12399;&#25968;&#36913;&#38291;&#31243;&#24230;&#12398;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#34892;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12428;&#12367;&#12425;&#12356;&#12354;&#12428;&#12400;&#20154;&#12399;&#12415;&#12394;&#12381;&#12398;&#32771;&#12360;&#12434;&#29702;&#35299;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12377;&#12409;&#12365;&#12371;&#12392;&#12399;&#12289;&#38291;&#36949;&#12387;&#12383;&#22580;&#25152;&#12395;&#25237;&#31295;&#12375;&#12390;&#12365;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;
  &#20182;&#20154;&#12395;&#12418;&#35211;&#12360;&#12427;&#22580;&#25152;&#12391;&#12381;&#12428;&#12434;&#25351;&#25688;&#12375;&#12390;&#12354;&#12370;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#20182;&#12398;&#20154;&#12383;&#12385;&#12399;&#12356;&#12385;&#12356;&#12385;&#25351;&#25688;&#12373;&#12428;&#12394;&#12367;&#12390;&#12418;&#26032;&#12375;&#12356;&#22580;&#25152;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#19968;&#35239;&#12434;&#12414;&#12392;&#12417;&#12383;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12418;&#26377;&#29992;&#12391;&#12377;&#12290;
  &#20182;&#12398;&#20154;&#12395;&#26032;&#12375;&#12356;&#22580;&#25152;&#12434;&#25351;&#23450;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395;&#12289;&#12381;&#12398;&#12506;&#12540;&#12472;&#12434;&#21442;&#29031;&#12373;&#12379;&#12427;&#12384;&#12369;&#12391;&#12424;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12358;&#12414;&#12367;&#12356;&#12369;&#12400;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12418;&#25237;&#31295;&#12398;&#21069;&#12395;&#12381;&#12398;&#12506;&#12540;&#12472;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#20316;&#25126; (2) &#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23384;&#32154;&#12377;&#12427;&#38480;&#12426;&#12378;&#12387;&#12392;&#32154;&#12369;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12399;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#24120;&#12395;&#26368;&#26032;&#12398;&#29366;&#24907;&#12395;&#20445;&#12387;&#12390;
  (<span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a></span>
  &#12398; <a class="xref" href="getting-started.html#documentation" title="&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;">&#12300;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
  &#12415;&#12435;&#12394;&#12434;&#12381;&#12371;&#12395;&#35480;&#23566;&#12377;&#12427;&#12392;&#12356;&#12358;&#20316;&#26989;&#12398;&#19968;&#29872;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#20197;&#22806;&#12395;&#12418;&#32771;&#24942;&#12377;&#12409;&#12365;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12371;&#12385;&#12425;&#12398;&#20316;&#25126;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#35211;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;"><div class="titlepage"><div><div><h3 class="title"><a name="using-archives"></a>&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;</h3></div></div></div><p>
  &#36890;&#24120;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#12354;&#12425;&#12422;&#12427;&#12420;&#12426;&#21462;&#12426;&#12398;&#20869;&#23481;&#12399;
  (IRC &#12391;&#12398;&#20250;&#35441;&#12399;&#20363;&#22806;&#12392;&#12375;&#12390;) &#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12289;&#19968;&#33324;&#12395;&#20844;&#38283;&#12373;&#12428;&#12383;&#26908;&#32034;&#21487;&#33021;&#12394;&#22580;&#25152;&#12395;&#37197;&#32622;&#12373;&#12428;&#12289;
  &#24120;&#12395;&#21442;&#29031;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12377;&#12394;&#12431;&#12385;&#12289;
  &#12394;&#12435;&#12425;&#12363;&#12398;&#24773;&#22577;&#12364;&#29305;&#23450;&#12398;&#22580;&#25152;&#12395;&#20445;&#23384;&#12373;&#12428;&#12383;&#12425;&#12289;
  &#12381;&#12428;&#12399;&#24120;&#12395;&#21516;&#12376;&#22580;&#25152;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#12391;&#12365;&#12427;&#12384;&#12369;&#12371;&#12428;&#12425;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#27963;&#29992;&#12375;&#12289;&#12381;&#12398;&#23384;&#22312;&#12434;&#24195;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12431;&#12363;&#12426;&#12365;&#12387;&#12383;&#20869;&#23481;&#12398;&#36074;&#21839;&#12395;&#31572;&#12360;&#12427;&#22580;&#21512;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#31572;&#12360;&#12434;&#21547;&#12416;&#12450;&#12540;&#12459;&#12452;&#12502;&#12364;&#12354;&#12426;&#12381;&#12358;&#12394;&#12425;
  &#12381;&#12428;&#12434;&#25506;&#12375;&#12390;&#22580;&#25152;&#12434;&#31034;&#12375;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#24120;&#12395;&#12381;&#12398;&#12424;&#12358;&#12395;&#12377;&#12427;&#12424;&#12358;&#24515;&#12364;&#12369;&#12390;&#12356;&#12427;&#12392;&#12289;
  &#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12364;&#12381;&#12371;&#12395;&#12354;&#12427;&#12301;&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#26908;&#32034;&#12377;&#12428;&#12400;&#31572;&#12360;&#12364;&#24471;&#12425;&#12428;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#27671;&#12389;&#12356;&#12390;&#12367;&#12428;&#12427;&#20154;&#12418;&#12354;&#12425;&#12431;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#21516;&#12376;&#20869;&#23481;&#12434;&#25913;&#12417;&#12390;&#26360;&#12365;&#30452;&#12377;&#12398;&#12391;&#12399;&#12394;&#12367;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#21442;&#29031;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
  &#12300;&#21516;&#12376;&#24773;&#22577;&#12434;&#37325;&#35079;&#12373;&#12379;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#25351;&#37341;&#12434;&#23432;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#21516;&#12376;&#22238;&#31572;&#12434;&#12431;&#12374;&#12431;&#12374;&#12356;&#12429;&#12435;&#12394;&#22580;&#25152;&#12395;&#20998;&#25955;&#12373;&#12379;&#12427;&#24517;&#35201;&#12394;&#12435;&#12390;&#12354;&#12426;&#12414;&#12377;&#12363;?
  &#12371;&#12398;&#12424;&#12358;&#12394;&#37325;&#35079;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#28187;&#12425;&#12377;&#12424;&#12358;&#12395;&#24515;&#12364;&#12369;&#12428;&#12400;&#12289;
  &#12354;&#12427;&#22238;&#31572;&#12395;&#20197;&#21069;&#12395;&#12383;&#12393;&#12426;&#30528;&#12356;&#12383;&#20154;&#12364;&#12289;
  &#12381;&#12428;&#12434;&#20877;&#12403;&#35211;&#12388;&#12369;&#20986;&#12377;&#12371;&#12392;&#12418;&#31777;&#21336;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21442;&#29031;&#12434;&#12358;&#12414;&#12367;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;&#26908;&#32034;&#32080;&#26524;&#20840;&#33324;&#12395;&#12418;&#12424;&#12356;&#24433;&#38911;&#12434;&#19982;&#12360;&#12414;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12398;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12399;
  &#20182;&#12398;&#22580;&#25152;&#12363;&#12425;&#22810;&#12367;&#21442;&#29031;&#12373;&#12428;&#12390;&#12356;&#12427;&#12522;&#12477;&#12540;&#12473;&#12434;&#37325;&#35222;&#12377;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#24773;&#22577;&#12434;&#22810;&#37325;&#21270;&#12375;&#12390;&#12418;&#12356;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12394;&#12383;&#20197;&#22806;&#12398;&#20154;&#12364;&#25237;&#31295;&#12375;&#12383;&#27425;&#12398;&#12424;&#12358;&#12394;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#20869;&#12395;&#12377;&#12391;&#12395;&#12354;&#12427;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
&#12362;&#12381;&#12425;&#12367; Scanley &#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#29378;&#12356;&#22987;&#12417;&#12390;&#12356;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
&#24489;&#26087;&#12373;&#12379;&#12427;&#12395;&#12399;&#27425;&#12398;&#25163;&#38918;&#12434;&#23455;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;

1. Scanley &#12469;&#12540;&#12496;&#12434;&#20572;&#27490;&#12377;&#12427;
2. Scanley &#12395;&#21516;&#26801;&#12373;&#12428;&#12390;&#12356;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512; 'defrobnicate' &#12434;&#23455;&#34892;&#12377;&#12427;
3. &#12469;&#12540;&#12496;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;
</pre><p>
  &#25968;&#12533;&#26376;&#24460;&#12395;&#12289;&#12414;&#12383;&#21029;&#12398;&#20154;&#12364;&#12300;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#12362;&#12363;&#12375;&#12356;&#12415;&#12383;&#12356;&#12394;&#12435;&#12391;&#12377;&#12301;
  &#12392;&#12356;&#12358;&#25237;&#31295;&#12434;&#12375;&#12390;&#12365;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#26908;&#32034;&#12375;&#12383;&#12354;&#12394;&#12383;&#12399;
  &#20808;&#12411;&#12393;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35211;&#12388;&#12369;&#12414;&#12375;&#12383;&#12290;&#12391;&#12418;&#12289;&#12381;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25163;&#38918;&#12395;&#12399;&#12377;&#12371;&#12375;&#19981;&#20633;&#12364;&#12354;&#12427;&#12424;&#12358;&#12391;&#12377;
  (&#21336;&#12394;&#12427;&#38291;&#36949;&#12356;&#12394;&#12398;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#24403;&#26178;&#12392;&#12399;&#20181;&#27096;&#12364;&#22793;&#12431;&#12387;&#12383;&#12398;&#12363;&#12392;&#12356;&#12387;&#12383;&#12392;&#12371;&#12429;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12371;&#12435;&#12394;&#12392;&#12365;&#12398;&#12452;&#12465;&#12390;&#12427;&#12420;&#12426;&#12363;&#12383;&#12399;&#12289;
  &#20316;&#26989;&#25163;&#38918;&#12434;&#12365;&#12385;&#12435;&#12392;&#12414;&#12392;&#12417;&#12394;&#12362;&#12375;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26032;&#12383;&#12395;&#25237;&#31295;&#12375;&#12289;
  &#12381;&#12371;&#12391;&#12300;&#20197;&#21069;&#12398;&#25237;&#31295;&#12399;&#20869;&#23481;&#12364;&#21476;&#12367;&#12394;&#12387;&#12390;&#12356;&#12427;&#12301;&#12392;&#26126;&#35352;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><pre class="screen">
&#12362;&#12381;&#12425;&#12367; Scanley &#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#29378;&#12356;&#22987;&#12417;&#12390;&#12356;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
7 &#26376;&#12395;&#12418;&#21516;&#12376;&#12424;&#12358;&#12394;&#25237;&#31295;&#12364;&#12354;&#12426;&#12289;J. Random &#12364;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#22238;&#31572;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12381;&#12398;&#22238;&#31572;&#12399; http://blahblahblah/blah &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#20197;&#19979;&#12395;&#31034;&#12377;&#25163;&#38918;&#12399;&#12289;
J. Random &#12364;&#31034;&#12375;&#12383;&#25163;&#38918;&#12434;&#12418;&#12358;&#23569;&#12375;&#12365;&#12385;&#12435;&#12392;&#35036;&#36275;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;

1. Scanley &#12469;&#12540;&#12496;&#12434;&#20572;&#27490;&#12377;&#12427;
2. Scanley &#12469;&#12540;&#12496;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12395;&#12394;&#12427;
3. &#12381;&#12398;&#12518;&#12540;&#12470;&#12540;&#12391;&#12289;'defrobnicate' &#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#23455;&#34892;&#12377;&#12427;
4. Scanley &#12434;&#25163;&#21205;&#12391;&#36215;&#21205;&#12375;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#27491;&#24120;&#12395;&#12394;&#12387;&#12383;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;
5. &#12469;&#12540;&#12496;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;
</pre><p>
  (&#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#21476;&#12356;&#12411;&#12358;&#12398;&#25237;&#31295;&#12395;&#12513;&#12514;&#12434;&#12388;&#12369;&#12390;
  &#12300;&#12371;&#12398;&#20869;&#23481;&#12399;&#21476;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#26032;&#12375;&#12356;&#24773;&#22577;&#12399;&#12371;&#12385;&#12425;&#12391;&#12377;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12364;&#25351;&#23450;&#12391;&#12365;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#31169;&#12398;&#30693;&#12427;&#38480;&#12426;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#12300;&#26032;&#12375;&#12356;&#24773;&#22577;&#12399;&#12371;&#12385;&#12425;&#12301;
  &#27231;&#33021;&#12434;&#25345;&#12387;&#12383;&#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#23384;&#22312;&#12375;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#20869;&#23481;&#12398;&#25972;&#21512;&#24615;&#12434;&#22833;&#12431;&#12378;&#12395;&#12371;&#12398;&#27231;&#33021;&#12434;&#23455;&#35013;&#12377;&#12427;&#12398;&#12399;
  &#23569;&#12375;&#25163;&#38291;&#12398;&#12363;&#12363;&#12427;&#12371;&#12392;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12358;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12427;&#12398;&#12391;&#12289;&#12424;&#12367;&#12354;&#12427;&#36074;&#21839;&#12392;&#12381;&#12398;&#22238;&#31572;&#12395;&#12388;&#12356;&#12390;&#12399;
  &#23554;&#29992;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#20316;&#25104;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12377;&#12427;&#12398;&#12391;&#12377;)
</p><p>
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#20351;&#29992;&#27861;&#12392;&#12375;&#12390;&#26368;&#12418;&#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12289;
  &#25216;&#34899;&#30340;&#12394;&#36074;&#21839;&#12395;&#23550;&#12377;&#12427;&#31572;&#12360;&#12434;&#25506;&#12377;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#37325;&#35201;&#24615;&#12399;&#12289;&#12381;&#12428;&#12434;&#12399;&#12427;&#12363;&#12395;&#19978;&#22238;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20844;&#24335;&#12394;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12364;&#12356;&#12431;&#12400;&#12300;&#21046;&#23450;&#27861;&#12301;&#12391;&#12354;&#12427;&#12392;&#12377;&#12427;&#12394;&#12425;&#12289;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12300;&#24931;&#32722;&#27861;&#12301;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
  &#12377;&#12394;&#12431;&#12385;&#12289;&#12371;&#12428;&#12414;&#12391;&#12395;&#34892;&#12431;&#12428;&#12383;&#12354;&#12425;&#12422;&#12427;&#35696;&#35542;&#12398;&#27969;&#12428;&#12392;&#12381;&#12398;&#32080;&#35542;&#12364;&#12450;&#12540;&#12459;&#12452;&#12502;&#12363;&#12425;&#24471;&#12425;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#20197;&#21069;&#12392;&#21516;&#12376;&#12424;&#12358;&#12394;&#35696;&#35542;&#12434;&#32368;&#12426;&#36820;&#12377;&#38555;&#12395;&#12399;&#12289;&#12414;&#12378;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#26908;&#32034;&#12375;&#12390;&#12415;&#12427;&#12398;&#12364;&#32681;&#21209;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#29694;&#22312;&#12398;&#29366;&#27841;&#12420;&#20104;&#24819;&#12373;&#12428;&#12427;&#21453;&#35542;&#12434;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
  &#12381;&#12428;&#12395;&#23550;&#12377;&#12427;&#21453;&#35388;&#12398;&#28310;&#20633;&#12434;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#33258;&#20998;&#12391;&#12399;&#24605;&#12356;&#12388;&#12363;&#12394;&#12363;&#12387;&#12383;&#35282;&#24230;&#12363;&#12425;&#12398;&#24847;&#35211;&#12418;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12418;&#12354;&#12394;&#12383;&#12364;&#12377;&#12391;&#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#26908;&#32034;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#12375;&#12390;&#35441;&#12434;&#36914;&#12417;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#20197;&#21069;&#12398;&#35696;&#35542;&#12391;&#20309;&#12398;&#32080;&#35542;&#12418;&#20986;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#35696;&#35542;&#12434;&#20877;&#38283;&#12377;&#12427;&#38555;&#12395;&#12399;&#20197;&#21069;&#12398;&#35696;&#35542;&#12408;&#12398;&#12509;&#12452;&#12531;&#12479;&#12434;&#31034;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;
  &#12300;&#12381;&#12398;&#35696;&#35542;&#12398;&#32080;&#35542;&#12364;&#12414;&#12384;&#20986;&#12390;&#12356;&#12394;&#12356;&#12301;&#12381;&#12375;&#12390;&#12300;&#12354;&#12394;&#12383;&#12364;&#12420;&#12427;&#12409;&#12365;&#12371;&#12392;&#12434;&#12420;&#12387;&#12390;&#12356;&#12427;&#12301;
  &#12388;&#12414;&#12426;&#12289;&#12354;&#12394;&#12383;&#12398;&#24847;&#35211;&#12399;&#12371;&#12428;&#12414;&#12391;&#12398;&#35696;&#35542;&#12398;&#32368;&#12426;&#36820;&#12375;&#12391;&#12399;&#12394;&#12356;&#12398;&#12384;&#12429;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
</p><div class="sect3" title="&#20840;&#12522;&#12477;&#12540;&#12473;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#21516;&#27096;&#12395;&#25201;&#12358;"><div class="titlepage"><div><div><h4 class="title"><a name="all-as-archives"></a>&#20840;&#12522;&#12477;&#12540;&#12473;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#21516;&#27096;&#12395;&#25201;&#12358;</h4></div></div></div><p>
  &#12371;&#12428;&#12414;&#12391;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12289;&#21336;&#12394;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12384;&#12369;&#12395;&#12354;&#12390;&#12399;&#12414;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#29305;&#23450;&#12398;&#24773;&#22577;&#12399;&#24120;&#12395;&#21516;&#12376;&#22580;&#25152;&#12391;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12289;
  &#35211;&#12388;&#12369;&#12420;&#12377;&#12356;&#22580;&#25152;&#12395;&#32622;&#12367;&#12394;&#12393;&#12392;&#12356;&#12387;&#12383;&#21407;&#21063;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12377;&#12409;&#12390;&#12398;&#24773;&#22577;&#12395;&#23550;&#12375;&#12390;&#21516;&#27096;&#12395;&#12354;&#12390;&#12399;&#12414;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; FAQ &#12434;&#20363;&#12395;&#12375;&#12390;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>&#20154;&#12399; FAQ &#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#20351;&#12358;&#12398;&#12391;&#12375;&#12423;&#12358;?</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
      &#36969;&#24403;&#12394;&#21336;&#35486;&#12420;&#12501;&#12524;&#12540;&#12474;&#12434;&#20837;&#21147;&#12375;&#12390;&#26908;&#32034;&#12391;&#12365;&#12428;&#12400;&#12356;&#12356;&#12391;&#12377;&#12397;&#12290;
    </p></li><li class="listitem"><p>
      &#21336;&#12395;&#29305;&#23450;&#12398;&#36074;&#21839;&#12395;&#23550;&#12377;&#12427;&#31572;&#12360;&#12434;&#25506;&#12377;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
      &#20840;&#20307;&#12434;&#12374;&#12387;&#12392;&#30522;&#12417;&#12383;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    </p></li><li class="listitem"><p>
      Google &#12398;&#12424;&#12358;&#12394;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12391;&#12418;
      FAQ &#12398;&#20869;&#23481;&#12434;&#35211;&#12388;&#12369;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12411;&#12375;&#12356;&#12392;&#24605;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
    </p></li><li class="listitem"><p>
      FAQ &#12398;&#29305;&#23450;&#12398;&#38917;&#30446;&#12434;&#30452;&#25509;&#25351;&#12375;&#31034;&#12379;&#12427;&#12424;&#12358;&#12395;&#12418;&#12375;&#12383;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      FAQ &#12395;&#26032;&#12383;&#12394;&#20869;&#23481;&#12434;&#36861;&#21152;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12418;&#12375;&#12383;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#12375;&#12363;&#12375;&#12289;&#27880;&#24847;&#12377;&#12409;&#12365;&#12394;&#12398;&#12399;&#12289;FAQ &#12408;&#12398;&#26032;&#12383;&#12394;&#20869;&#23481;&#12398;&#36861;&#21152;&#12399;
      FAQ &#12398;&#26908;&#32034;&#12424;&#12426;&#12418;&#12399;&#12427;&#12363;&#12395;&#38971;&#24230;&#12398;&#20302;&#12356;&#12418;&#12398;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
      FAQ &#12399;&#12289;&#26360;&#12365;&#36796;&#12416;&#12424;&#12426;&#12418;&#35501;&#12414;&#12428;&#12427;&#12411;&#12358;&#12364;&#22311;&#20498;&#30340;&#12395;&#22810;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    </p></li></ol></div><p>
  1. &#12399;&#12289;&#12388;&#12414;&#12426; FAQ &#12364;&#20309;&#12425;&#12363;&#12398;&#12486;&#12461;&#12473;&#12488;&#24418;&#24335;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  2. &#12392; 3. &#12364;&#35328;&#12431;&#12435;&#12392;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#12289;FAQ &#12364;
  HTML &#12506;&#12540;&#12472;&#12392;&#12375;&#12390;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  2. &#12399;&#12373;&#12425;&#12395;&#12289;HTML &#12364;&#35501;&#12415;&#12420;&#12377;&#12356;&#24418;&#24335;&#12391;&#12354;&#12427;&#12371;&#12392;
  (&#12388;&#12414;&#12426;&#12289;&#12381;&#12398;&#35211;&#26628;&#12360;&#12434;&#22793;&#26356;&#12391;&#12365;&#12427;&#12371;&#12392;)
  &#12420;&#30446;&#27425;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#35201;&#27714;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  4. &#12434;&#28288;&#12383;&#12377;&#12395;&#12399;&#12289;FAQ &#12398;&#21508;&#38917;&#30446;&#12395; HTML &#12398;
  <em class="firstterm">&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;</em> &#12434;&#25351;&#23450;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#12506;&#12540;&#12472;&#20869;&#12398;&#29305;&#23450;&#12398;&#22580;&#25152;&#12395;&#30452;&#25509;&#21040;&#36948;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  5. &#12364;&#24847;&#21619;&#12377;&#12427;&#12392;&#12371;&#12429;&#12399;&#12289;FAQ &#12398;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#21462;&#24471;&#12364;&#23481;&#26131;&#12391;&#12354;&#12426;
  (<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="vc.html#version-everything" title="&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;">&#12300;&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12289;
  &#12414;&#12383;&#32232;&#38598;&#12375;&#12420;&#12377;&#12356;&#12418;&#12398;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><div class="sidebar" title="&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12392; ID &#23646;&#24615;"><a name="html-named-anchors-and-ids"></a><div class="titlepage"><div><div><p class="title"><b>&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12392; ID &#23646;&#24615;</b></p></div></div></div><p>
    &#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#20869;&#12398;&#29305;&#23450;&#12398;&#22580;&#25152;&#12395;&#30452;&#25509;&#31227;&#21205;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;
    &#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12434;&#20351;&#12358;&#26041;&#27861;&#12392; id &#23646;&#24615;&#12434;&#20351;&#12358;&#26041;&#27861;&#12398;&#20108;&#36890;&#12426;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  </p><p>
    <em class="firstterm">&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;</em> &#12399;&#21336;&#12394;&#12427; HTML &#12398;
    &#12450;&#12531;&#12459;&#12540;&#35201;&#32032; (<code class="literal">&lt;a&gt;...&lt;/a&gt;</code>)
    &#12392;&#21516;&#12376;&#12391;&#12289;&#12381;&#12371;&#12395; "name" &#23646;&#24615;&#12434;&#36861;&#21152;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  </p><pre class="screen">&lt;a name="mylabel"&gt;...&lt;/a&gt;</pre><p>
    &#26368;&#36817;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; HTML &#12391;&#12399;&#12289;&#12424;&#12426;&#27726;&#29992;&#30340;&#12394; <em class="firstterm">id
    &#23646;&#24615;</em> &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12362;&#12426;&#12289;<code class="literal">&lt;a&gt;</code>
    &#12384;&#12369;&#12391;&#12394;&#12367;&#20219;&#24847;&#12398; HTML &#35201;&#32032;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
  </p><pre class="screen">&lt;p id="mylabel"&gt;...&lt;/p&gt;</pre><p>
    &#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12392; id &#23646;&#24615;&#12398;&#20351;&#29992;&#27861;&#12399;&#12289;&#12393;&#12385;&#12425;&#12418;&#21516;&#12376;&#12391;&#12377;&#12290;
    URL &#12398;&#26368;&#24460;&#12395;&#12495;&#12483;&#12471;&#12517;&#12510;&#12540;&#12463; (#) &#12395;&#32154;&#12369;&#12390;&#12521;&#12505;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;
    &#12502;&#12521;&#12454;&#12470;&#12399;&#12506;&#12540;&#12472;&#20869;&#12398;&#12381;&#12398;&#22580;&#25152;&#12395;&#30452;&#25509;&#31227;&#21205;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><pre class="screen">http://myproject.example.com/faq.html#mylabel</pre><p>
    &#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12399;&#20107;&#23455;&#19978;&#12377;&#12409;&#12390;&#12398;&#12502;&#12521;&#12454;&#12470;&#12364;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12362;&#12426;&#12289;
    &#26368;&#36817;&#12398;&#12502;&#12521;&#12454;&#12470;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399; id &#23646;&#24615;&#12395;&#12418;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#19975;&#20840;&#12434;&#26399;&#12377;&#12394;&#12425;&#12289;&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12384;&#12369;&#12434;&#29992;&#12356;&#12427;&#12363;
    &#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12392; id &#23646;&#24615;&#12434; <span class="emphasis"><em>&#20341;&#29992;</em></span> &#12377;&#12427;
    (&#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12398;&#12392;&#12365;&#12399;&#20001;&#32773;&#12395;&#21516;&#12376;&#12521;&#12505;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;)
    &#12371;&#12392;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#38283;&#22987;&#35201;&#32032;&#12392;&#32066;&#20102;&#35201;&#32032;&#12434;&#12402;&#12392;&#12388;&#12395;&#12414;&#12392;&#12417;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12392;&#12360;&#35201;&#32032;&#20869;&#12398;&#12486;&#12461;&#12473;&#12488;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12391;&#12418;&#12289;
    &#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#38283;&#22987;&#35201;&#32032;&#12392;&#32066;&#20102;&#35201;&#32032;&#12434;&#21029;&#12293;&#12395;&#26360;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  </p><pre class="screen">&lt;a name="mylabel"&gt;&lt;/a&gt;</pre><p>
    &#8230;&#8230;&#12392;&#12399;&#12356;&#12360;&#12289;&#26222;&#36890;&#12399;&#12371;&#12371;&#12395;&#12399; (&#12475;&#12463;&#12471;&#12519;&#12531;&#12398;&#12479;&#12452;&#12488;&#12523;&#12394;&#12393;)
    &#20309;&#12425;&#12363;&#12398;&#12486;&#12461;&#12473;&#12488;&#12364;&#20837;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  </p><p>
    &#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12434;&#20351;&#12358;&#12395;&#12375;&#12390;&#12418; id &#23646;&#24615;&#12434;&#20351;&#12358;&#12395;&#12375;&#12390;&#12418;&#12289;
    &#12521;&#12505;&#12523;&#12434;&#25351;&#23450;&#12375;&#12390;&#12450;&#12463;&#12475;&#12473;&#12375;&#12394;&#12356;&#38480;&#12426;&#12399;&#12502;&#12521;&#12454;&#12470;&#19978;&#12391;&#12381;&#12398;&#12521;&#12505;&#12523;&#12399;&#35211;&#12360;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12383;&#12392;&#12360;&#12400; FAQ &#12398;&#29305;&#23450;&#12398;&#22238;&#31572;&#12434;&#12513;&#12540;&#12523;&#12391;&#31034;&#12375;&#12383;&#12356;&#22580;&#21512;&#12394;&#12393;&#12289;
    &#12381;&#12398;&#22580;&#25152;&#12398;&#12521;&#12505;&#12523;&#12364;&#20309;&#12394;&#12398;&#12363;&#12434;&#30693;&#12426;&#12383;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12398;&#12383;&#12417;&#12395;&#12289;"name" &#12420; "id" &#23646;&#24615;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;
    <em class="firstterm">title &#23646;&#24615;</em> &#12418;&#21516;&#12376;&#35201;&#32032;&#12395;&#25351;&#23450;&#12375;&#12390;&#12362;&#12367;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  </p><pre class="screen">&lt;a name="mylabel" title="#mylabel"&gt;...&lt;/a&gt;</pre><p>
    title &#23646;&#24615;&#12434;&#25351;&#23450;&#12375;&#12383;&#35201;&#32032;&#20869;&#12398;&#12486;&#12461;&#12473;&#12488;&#12398;&#19978;&#12434;&#12510;&#12454;&#12473;&#12509;&#12452;&#12531;&#12479;&#12364;&#36890;&#36942;&#12377;&#12427;&#12392;&#12289;
    &#12383;&#12356;&#12390;&#12356;&#12398;&#12502;&#12521;&#12454;&#12470;&#12391;&#12399; title &#23646;&#24615;&#12398;&#20869;&#23481;&#12434;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
    &#31169;&#12399;&#12289;&#12371;&#12398; title &#23646;&#24615;&#12398;&#20869;&#23481;&#12395;&#12495;&#12483;&#12471;&#12517;&#12510;&#12540;&#12463;&#12418;&#21547;&#12417;&#12427;&#12424;&#12358;&#24515;&#12364;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12434;&#35211;&#12383;&#12518;&#12540;&#12470;&#12540;&#12364;&#12289;URL &#12398;&#26368;&#24460;&#12395;&#12381;&#12428;&#12434;&#12388;&#12394;&#12370;&#12428;&#12400;
    &#30452;&#25509;&#12371;&#12398;&#22580;&#25152;&#12395;&#21040;&#36948;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#27671;&#12389;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  </p></div><p>
  &#12371;&#12371;&#12391;&#12399; FAQ &#12395;&#12388;&#12356;&#12390;&#12398;&#12415;&#21462;&#12426;&#19978;&#12370;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#12371;&#12428;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#20307;&#35009;&#12434;&#25972;&#12360;&#12427;&#12411;&#12435;&#12398;&#19968;&#20363;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12371;&#12391;&#21462;&#12426;&#19978;&#12370;&#12383;&#20869;&#23481; (&#30452;&#25509;&#26908;&#32034;&#12391;&#12365;&#12427;&#12371;&#12392;&#12289;
  &#20027;&#35201;&#12394;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12363;&#12425;&#26908;&#32034;&#12391;&#12365;&#12427;&#12371;&#12392;&#12289;&#38322;&#35239;&#12375;&#12420;&#12377;&#12356;&#12371;&#12392;&#12289;
  &#29305;&#23450;&#12398;&#22580;&#25152;&#12434;&#21442;&#29031;&#12375;&#12420;&#12377;&#12356;&#12371;&#12392;&#12289;&#36969;&#20999;&#12395;&#32232;&#38598;&#12375;&#12420;&#12377;&#12356;&#12371;&#12392;)
  &#12399;&#12289;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#20840;&#33324;&#12420;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12289;
  &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12394;&#12393;&#12391;&#12418;&#24403;&#12390;&#12399;&#12414;&#12427;&#12418;&#12398;&#12400;&#12363;&#12426;&#12391;&#12377;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22810;&#12367;&#12399;&#12289;
  &#12371;&#12428;&#12425;&#12398;&#38917;&#30446;&#12398;&#37325;&#35201;&#24615;&#12395;&#22823;&#26132;&#12363;&#12425;&#27671;&#12389;&#12356;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22810;&#12367;&#12399;
  &#12371;&#12428;&#12425;&#12398;&#27231;&#33021;&#12434;&#33258;&#21069;&#12391;&#25645;&#36617;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#20182;&#12398;&#24418;&#24335;&#12398;&#25991;&#26360;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#25285;&#24403;&#32773;&#12364;&#12381;&#12428;&#12394;&#12426;&#12395;&#25163;&#38291;&#12434;&#12363;&#12369;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;
  (&#12371;&#12398;&#12424;&#12358;&#12394;&#20316;&#26989;&#12434;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12395;&#20219;&#12379;&#12390;&#12356;&#12367;&#12383;&#12417;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;
  <a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;)&#12290;
</p></div></div><div class="sect2" title="&#12375;&#12365;&#12383;&#12426;&#12398;&#25104;&#25991;&#21270;"><div class="titlepage"><div><div><h3 class="title"><a name="codifying-tradition"></a>&#12375;&#12365;&#12383;&#12426;&#12398;&#25104;&#25991;&#21270;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#27508;&#21490;&#12434;&#31309;&#12415;&#37325;&#12397;&#12390;&#35079;&#38609;&#12373;&#12434;&#22679;&#12375;&#12390;&#12356;&#12367;&#12395;&#12388;&#12428;&#12390;&#12289;
  &#26032;&#35215;&#21442;&#20837;&#12377;&#12427;&#20154;&#12383;&#12385;&#12364;&#35226;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12487;&#12540;&#12479;&#12398;&#37327;&#12418;&#22679;&#21152;&#12375;&#12414;&#12377;&#12290;
  &#38263;&#24180;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25104;&#38263;&#12392;&#12392;&#12418;&#12395;&#12381;&#12398;&#12375;&#12365;&#12383;&#12426;&#12434;&#20316;&#12426;&#19978;&#12370;&#12383;&#12426;&#23398;&#12435;&#12384;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12399;&#24448;&#12293;&#12395;&#12375;&#12390;&#12289;&#20170;&#12414;&#12391;&#31689;&#12365;&#19978;&#12370;&#12390;&#12365;&#12383;&#20253;&#32113;&#12364;&#12393;&#12428;&#12411;&#12393;&#24040;&#22823;&#12394;&#12418;&#12398;&#12363;&#12395;&#27671;&#12389;&#12356;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#26032;&#12383;&#12395;&#21442;&#21152;&#12375;&#12390;&#12367;&#12427;&#20154;&#12383;&#12385;&#12364;&#12381;&#12398;&#20253;&#32113;&#12434;&#23432;&#12425;&#12394;&#12356;&#12398;&#12434;&#12415;&#12390;&#39514;&#12367;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12399;&#12289;&#26368;&#36817;&#12398;&#20154;&#12383;&#12385;&#12364;&#21476;&#26666;&#12424;&#12426;&#12418;&#21155;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21021;&#26399;&#12395;&#27604;&#12409;&#12289;&#26032;&#35215;&#21442;&#20837;&#12398;&#12495;&#12540;&#12489;&#12523;&#12364;&#39640;&#12367;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#21839;&#38988;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#31309;&#12415;&#19978;&#12370;&#12390;&#12356;&#12367;&#20253;&#32113;&#12395;&#12399;&#12289;
  &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#26041;&#27861;&#12420;&#12289;
  &#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#35215;&#32004;&#12362;&#12424;&#12403;&#20182;&#12398;&#25216;&#34899;&#24773;&#22577;&#12434;&#33988;&#31309;&#12377;&#12427;&#26041;&#27861;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;
  <span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a></span>
  &#12398; <a class="xref" href="getting-started.html#developer-documentation" title="&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;">&#12300;&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12301;</a> &#12362;&#12424;&#12403;
  <span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a></span>
  &#12398; <a class="xref" href="written-rules.html" title="&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;">&#12300;&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;&#12301;</a> &#12391;&#20363;&#12434;&#25369;&#12370;&#12390;&#35500;&#26126;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25104;&#38263;&#12395;&#20276;&#12387;&#12390;
  &#12371;&#12428;&#12425;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#12356;&#12363;&#12395;&#26368;&#26032;&#12398;&#29366;&#24907;&#12395;&#20445;&#12388;&#12363;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#29305;&#12395;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#37325;&#35201;&#12391;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12371;&#12428;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12420;&#35079;&#38609;&#12373;&#12364;&#22823;&#12365;&#12367;&#12394;&#12427;&#12395;&#12388;&#12428;&#12390;&#22793;&#12431;&#12387;&#12390;&#12356;&#12367;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12414;&#12378;&#12399;&#12289;&#12415;&#12435;&#12394;&#12364;&#20309;&#12395;&#22256;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#35519;&#12409;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#21516;&#12376;&#12424;&#12358;&#12394;&#29366;&#27841;&#12391; (&#29305;&#12395;&#26032;&#20837;&#12426;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;) &#22256;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27671;&#12389;&#12356;&#12383;&#12425;&#12289;
  &#12381;&#12428;&#12399;&#12300;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#12365;&#12385;&#12435;&#12392;&#35373;&#23450;&#12377;&#12409;&#12365;&#12394;&#12398;&#12395;&#12289;&#12414;&#12384;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12301;
  &#12392;&#12356;&#12358;&#35388;&#25312;&#12391;&#12377;&#12290;
  &#27425;&#12395;&#12289;&#21516;&#12376;&#12371;&#12392;&#12434;&#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#32368;&#12426;&#36820;&#12375;&#12390;&#35328;&#12358;&#12398;&#12434;&#12356;&#12420;&#12364;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12356;&#12420;&#12356;&#12420;&#35328;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24605;&#12431;&#12428;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#12393;&#12435;&#12393;&#12435;&#20837;&#12387;&#12390;&#12367;&#12427;&#20197;&#19978;&#12289;
  &#12354;&#12394;&#12383;&#12420;&#20182;&#12398;&#12505;&#12486;&#12521;&#12531;&#12513;&#12531;&#12496;&#12540;&#12364;&#21516;&#12376;&#12371;&#12392;&#12434;&#32368;&#12426;&#36820;&#12377;&#12399;&#12417;&#12395;&#12394;&#12427;&#12398;&#12399;&#36991;&#12369;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12377;&#12409;&#12390;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12289;
  &#12381;&#12375;&#12390;&#12377;&#12409;&#12390;&#12398; IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#12399;&#21578;&#30693;&#29992;&#12398;&#12473;&#12506;&#12540;&#12473;&#12434;&#35373;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#21830;&#26989;&#30340;&#12394;&#24195;&#21578;&#12434;&#34892;&#12358;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#33258;&#36523;&#12398;&#12522;&#12477;&#12540;&#12473;&#12395;&#12388;&#12356;&#12390;&#21578;&#30693;&#12377;&#12427;&#12383;&#12417;&#12398;&#22580;&#25152;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12371;&#12395;&#20309;&#12434;&#36617;&#12379;&#12427;&#12398;&#12363;&#12399;&#12289;&#12381;&#12428;&#12434;&#12393;&#12398;&#12424;&#12358;&#12394;&#20154;&#12383;&#12385;&#12364;&#35501;&#12416;&#12398;&#12363;&#12395;&#12354;&#12431;&#12379;&#12390;&#27770;&#12417;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12518;&#12540;&#12470;&#12540;&#12363;&#12425;&#12398;&#36074;&#21839;&#12434;&#21463;&#12369;&#20184;&#12369;&#12427; IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12398;&#22580;&#21512;&#12289;
  &#12381;&#12428;&#12434;&#21033;&#29992;&#12377;&#12427;&#20154;&#12398;&#22810;&#12367;&#12399;&#12371;&#12428;&#12414;&#12391;&#12395;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12387;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#20154;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21336;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12415;&#12383;&#12384;&#12369;&#12391;&#12354;&#12427;&#12371;&#12392;&#12418;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#12383;&#12356;&#12390;&#12356;&#12399;&#12300;&#20170;&#12377;&#12368;&#12395;&#12301;&#22238;&#31572;&#12434;&#27442;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;
  (&#12385;&#12423;&#12387;&#12392;&#12391;&#12418;&#24453;&#12390;&#12427;&#12398;&#12394;&#12425;&#12289;&#26222;&#36890;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#36074;&#21839;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
  &#31572;&#12360;&#12364;&#36820;&#12387;&#12390;&#12367;&#12427;&#12398;&#12395;&#22810;&#23569;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12371;&#12392;&#12373;&#12360;&#25105;&#24930;&#12391;&#12365;&#12428;&#12400;&#12289;
  &#12371;&#12387;&#12385;&#12398;&#12411;&#12358;&#12364;&#25163;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12379;&#12435;)&#12290;
  &#26222;&#36890;&#12398;&#20154;&#12399; IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#24120;&#39376;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12405;&#12425;&#12387;&#12392;&#30331;&#22580;&#12375;&#12390;&#36074;&#21839;&#12434;&#34892;&#12356;&#12289;&#12381;&#12375;&#12390;&#21435;&#12387;&#12390;&#12356;&#12367;&#12384;&#12369;&#12391;&#12377;&#12290;
</p><p>
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12371;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12391;&#25201;&#12358;&#35441;&#38988;&#12398;&#23550;&#35937;&#12399;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12388;&#12356;&#12390;&#12398;&#25216;&#34899;&#30340;&#12394;&#36074;&#21839;&#12398;&#22238;&#31572;&#12434;
  <span class="emphasis"><em>&#20170;&#12377;&#12368;&#12395;</em></span> &#12411;&#12375;&#12356;&#20154;&#12383;&#12385;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20170;&#24460;&#12378;&#12387;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#21442;&#21152;&#12377;&#12427;&#12391;&#12354;&#12429;&#12358;&#20154;&#12383;&#12385;&#12395;&#12367;&#12425;&#12409;&#12289;
  &#12371;&#12398;&#25163;&#12398;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#12381;&#12428;&#12411;&#12393;&#37325;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#27963;&#30330;&#12394;&#12481;&#12515;&#12531;&#12493;&#12523;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12398;&#20363;&#12434;&#35211;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;
  (<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span>
  &#12398; <a class="xref" href="irc.html" title="IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;">&#12300;IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;&#12301;</a> &#12391;&#31034;&#12375;&#12383;&#20363;&#12392;&#35211;&#27604;&#12409;&#12390;&#12415;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;)&#12290;
</p><pre class="screen">
&#12354;&#12394;&#12383;&#12399;&#12481;&#12515;&#12531;&#12493;&#12523; #linuxhelp &#12391;&#35441;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;

#linuxhelp &#12398;&#12488;&#12500;&#12483;&#12463;&#12399;&#20197;&#19979;&#12398;&#36890;&#12426;&#12391;&#12377;&#12290;
&#36074;&#21839;&#12377;&#12427;&#21069;&#12395;&#12289;&#20197;&#19979;&#12398;&#20108;&#12388;&#12399;&#24517;&#12378;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
http://www.catb.org/~esr/faqs/smart-questions.html &amp;&amp;
http://www.tldp.org/docs.html#howto | &#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#38306;&#12377;&#12427;&#12523;&#12540;&#12523;&#12399;
http://www.nerdfest.org/lh_rules.html &#12395;&#12354;&#12426;&#12414;&#12377; | kernel 2.6.x &#12408;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;&#36074;&#21839;&#12377;&#12427;&#21069;&#12395;
http://kerneltrap.org/node/view/799 &#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356; | kernel &#12398;&#12513;&#12514;&#12522;&#31354;&#38291;&#12364;&#21442;&#29031;&#21487;&#33021;&#12395;&#12394;&#12427;&#33030;&#24369;&#24615;:
http://tinyurl.com/4s6mc -&gt; 2.6.8.1 &#12363; 2.4.27 &#12395;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392; |
&#34909;&#31361;&#12377;&#12427;&#12495;&#12483;&#12471;&#12517;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;: http://tinyurl.com/6w8rf | reiser4 &#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#12522;&#12522;&#12540;&#12473;)
</pre><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#12300;&#21578;&#30693;&#12473;&#12506;&#12540;&#12473;&#12301;&#12395;&#12354;&#12383;&#12427;&#12398;&#12399;
  &#20840;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#24460;&#12395;&#20184;&#21152;&#12373;&#12428;&#12427;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12501;&#12483;&#12479;&#12540;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#37096;&#20998;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#21442;&#21152;&#26041;&#27861;&#12420;
  &#33073;&#36864;&#26041;&#27861;&#12434;&#36617;&#12379;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12420;
  FAQ &#12506;&#12540;&#12472;&#12398;&#22580;&#25152;&#12434;&#36617;&#12379;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12394;&#12435;&#12390;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12394;&#12425;&#12415;&#12435;&#12394;&#30693;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#12381;&#12428;&#12399;&#27491;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;&#12434;&#35211;&#12427;&#12398;&#12399;&#12289;
  &#20309;&#12418;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12384;&#12369;&#12391;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#22580;&#25152;&#12363;&#12425;&#12522;&#12531;&#12463;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#25237;&#31295;&#12398;&#20869;&#23481;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12424;&#12426;&#12418;&#12378;&#12387;&#12392;&#22810;&#12367;&#12398;&#20154;&#12383;&#12385;&#12395;&#35501;&#12414;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12418;&#12398;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#26360;&#24335;&#12434;&#25972;&#12360;&#12427;&#12371;&#12392;&#12395;&#12399;&#32118;&#22823;&#12394;&#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
  <span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span> &#12398;
  <a class="xref" href="bug-tracker.html#bug-filtering" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;">&#12300;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12383;&#12496;&#12464;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#25216;&#34899;&#12391;
  &#12354;&#12427;&#31243;&#24230;&#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12383;&#12384;&#12289;&#12381;&#12428;&#12391;&#12418;&#12496;&#12464;&#12392;&#12399;&#35328;&#12360;&#12394;&#12356;&#12424;&#12358;&#12394;&#20869;&#23481;&#12364;&#12383;&#12403;&#12383;&#12403;&#30331;&#37682;&#12373;&#12428;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#12289;&#25285;&#24403;&#32773;&#12364;&#12356;&#12385;&#12356;&#12385;&#24444;&#12425;&#12395;&#25945;&#12360;&#12390;&#12420;&#12427;&#24517;&#35201;&#12364;&#12354;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12289;&#12371;&#12428;&#12414;&#12391; 500 &#20154;&#12418;&#12398;&#20154;&#12395;&#35328;&#12387;&#12390;&#12365;&#12383;&#12398;&#12392;&#21516;&#12376;&#12371;&#12392;&#12434;&#12290;
  &#12354;&#12427;&#26085;&#12398;&#12371;&#12392;&#12290;&#12381;&#12435;&#12394;&#29366;&#27841;&#12395;&#26989;&#12434;&#29038;&#12420;&#12375;&#12383;&#12354;&#12427;&#38283;&#30330;&#32773;&#12364;&#12289;
  &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#35501;&#12414;&#12378;&#12395;&#25237;&#31295;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12461;&#12524;&#12399;&#12376;&#12417;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#35211;&#12383;&#20182;&#12398;&#38283;&#30330;&#32773;&#12383;&#12385;&#12399;&#12289;&#12371;&#12398;&#26041;&#24335;&#12391;&#12399;&#12418;&#12399;&#12420;&#12420;&#12387;&#12390;&#12356;&#12369;&#12394;&#12356;&#12371;&#12392;&#12395;&#27671;&#12389;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#25552;&#26696;&#12375;&#12414;&#12375;&#12383;&#12290;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12398;&#30446;&#31435;&#12388;&#12392;&#12371;&#12429;&#12395;
  &#12300;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420; IRC &#12391;&#21313;&#20998;&#12395;&#35696;&#35542;&#12375;&#12390;&#12363;&#12425;&#12496;&#12464;&#12434;&#30331;&#37682;&#12377;&#12427;&#12424;&#12358;&#12395;&#12301;&#12392;&#26360;&#12356;&#12390;&#12420;&#12429;&#12358;&#12392;&#12290;
  &#12381;&#12358;&#12289;&#40644;&#33394;&#12356;&#32972;&#26223;&#12395;&#36196;&#12398;&#22826;&#23383;&#12391;&#12290;&#12377;&#12409;&#12390;&#12398;&#12506;&#12540;&#12472;&#12398;&#20808;&#38957;&#12395;&#12391;&#12363;&#12391;&#12363;&#12392;&#12290;
  &#31169;&#12383;&#12385;&#12399;&#12381;&#12428;&#12434;&#23455;&#34892;&#12375;&#12414;&#12375;&#12383; (&#12381;&#12398;&#32080;&#26524;&#12399;
  <a class="ulink" href="http://subversion.tigris.org/project_issues.html" target="_top">http://subversion.tigris.org/project_issues.html</a> &#12391;&#12372;&#35239;&#12356;&#12383;&#12384;&#12369;&#12414;&#12377;)&#12290;
  &#12381;&#12398;&#32080;&#26524;&#12290;&#26412;&#26469;&#12398;&#12496;&#12464;&#20197;&#22806;&#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#28608;&#28187;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;(&#26399;&#24453;&#36890;&#12426;) &#29694;&#22312;&#12418;&#12381;&#12428;&#12399;&#32154;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12418;&#12289;&#12518;&#12540;&#12470;&#12540;&#25968;&#12364;&#22679;&#12360;&#12390;&#12356;&#12427;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#12468;&#12511;&#12398;&#37327;&#12399;&#30446;&#12395;&#35211;&#12360;&#12390;&#28187;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#32080;&#26524;&#12289;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20013;&#12395;&#21547;&#12414;&#12428;&#12427;&#12468;&#12511;&#12398;&#37327;&#12364;&#28187;&#12387;&#12383;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12496;&#12464;&#12395;&#23550;&#24540;&#12377;&#12427;&#20154;&#12383;&#12385;&#12398;&#31354;&#27671;&#12418;&#12424;&#12367;&#12394;&#12387;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#20170;&#12391;&#12418;&#12383;&#12414;&#12395;&#12496;&#12464;&#20197;&#22806;&#12398;&#12468;&#12511;&#12364;&#30331;&#37682;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12398;&#21453;&#24540;&#12418;&#26262;&#12363;&#12356;&#12418;&#12398;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12452;&#12513;&#12540;&#12472;&#12392;&#12513;&#12531;&#12496;&#12540;&#12398;&#31934;&#31070;&#34907;&#29983;&#12398;&#20001;&#26041;&#12395;&#12424;&#12356;&#24433;&#38911;&#12434;&#21450;&#12412;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12371;&#12392;&#12363;&#12425;&#24471;&#12425;&#12428;&#12383;&#25945;&#35347;&#12399;&#12289;
  &#21336;&#12395;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#20316;&#25104;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#12480;&#12513;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12375;&#12383;&#12290;
  &#20316;&#25104;&#12375;&#12383;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#12289;
  &#12381;&#12428;&#12434;&#26368;&#12418;&#24517;&#35201;&#12392;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12398;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12356;&#12392;&#12371;&#12429;&#12395;&#25522;&#12370;&#12427;&#24517;&#35201;&#12364;&#12354;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12354;&#12414;&#12426;&#12394;&#12376;&#12415;&#12398;&#12394;&#12356;&#20154;&#12391;&#12418;&#26126;&#30906;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12375;&#12365;&#12383;&#12426;&#12434;&#35500;&#26126;&#12377;&#12427;&#22580;&#25152;&#12399;&#12289;&#20309;&#12418;&#38745;&#30340;&#12394;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12427;&#31243;&#24230;&#12399;&#23550;&#35441;&#30340;&#12394;&#21462;&#12426;&#32224;&#12414;&#12426;&#12418;&#24517;&#35201;&#12391;&#12377; (&#12371;&#12371;&#12391;&#35328;&#12358;&#12300;&#21462;&#12426;&#32224;&#12414;&#12426;&#12301;&#12392;&#12399;&#12289;
  &#25163;&#37664;&#12384;&#12398;&#29282;&#23627;&#12384;&#12398;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#21336;&#12395;&#22909;&#24847;&#30340;&#12394;&#27880;&#24847;&#12434;&#12377;&#12427;&#31243;&#24230;&#12398;&#12418;&#12398;&#12391;&#12377;)&#12290;
  <span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a></span> &#12398;
  <a class="xref" href="setting-tone.html#code-review" title="&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;">&#12300;&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12383;&#12467;&#12511;&#12483;&#12488;&#12524;&#12499;&#12517;&#12540;&#12434;&#21547;&#12416;&#12377;&#12409;&#12390;&#12398;&#12500;&#12450;&#12524;&#12499;&#12517;&#12540;&#12391;&#12399;&#12289;
  &#29305;&#12395;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27770;&#12414;&#12426;&#12395;&#21453;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12418;&#27880;&#24847;&#12375;&#12390;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#21033;&#29992;&#12375;&#12390;&#12356;&#12427;&#35215;&#32004;&#12434;&#12418;&#12358;&#12402;&#12392;&#12388;&#12372;&#32057;&#20171;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#31169;&#12383;&#12385;&#12399;&#12289;"r12908" &#12392;&#26360;&#12369;&#12400;&#12381;&#12428;&#12399;
  "&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531; 12908" &#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12354;&#12427;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#23567;&#25991;&#23383;&#12398; "r" &#12399;&#38750;&#24120;&#12395;&#12479;&#12452;&#12503;&#12375;&#12420;&#12377;&#12356;&#25991;&#23383;&#12384;&#12375;&#12289;
  &#25968;&#23383;&#12398;&#21322;&#20998;&#12398;&#39640;&#12373;&#12375;&#12363;&#12394;&#12356;&#12398;&#12391;&#25968;&#23383;&#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#12418;&#35672;&#21029;&#12375;&#12420;&#12377;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12435;&#12394;&#27770;&#12414;&#12426;&#12434;&#20316;&#12387;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12415;&#12435;&#12394;&#12364;&#12377;&#12368;&#12381;&#12428;&#12395;&#24467;&#12358;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12371;&#12435;&#12394;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21547;&#12416;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12364;&#23626;&#12367;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
------------------------------------------------------------------------
r12908 | qsimon | 2005-02-02 14:15:06 -0600 (Wed, 02 Feb 2005) | 4 lines

J. Random &#12363;&#12425;&#12398;&#12497;&#12483;&#12481;&#12434;&#25505;&#29992;&#12375;&#12383; &lt;jrcontrib@gmail.com&gt;

* trunk/contrib/client-side/psvn/psvn.el:
  revision 12828 &#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12383;typo&#12434;&#12356;&#12367;&#12388;&#12363;&#20462;&#27491;
------------------------------------------------------------------------
</pre><p>
  ...&#12371;&#12435;&#12394;&#12467;&#12511;&#12483;&#12488;&#12395;&#23550;&#12377;&#12427;&#12524;&#12499;&#12517;&#12540;&#12398;&#36820;&#20107;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  "&#12392;&#12371;&#12429;&#12391;&#12289;&#36942;&#21435;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#25351;&#12377;&#22580;&#21512;&#12399; 'revision 12828' &#12376;&#12419;&#12394;&#12367;&#12390;
  'r12828' &#24418;&#24335;&#12395;&#12375;&#12390;&#12367;&#12428;&#12394;&#12356;&#12363;&#12394;?" &#12371;&#12428;&#12399;&#12289;&#21336;&#12395;&#26684;&#22909;&#12384;&#12369;&#12398;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#20154;&#38291;&#12364;&#35501;&#12415;&#12420;&#12377;&#12367;&#12394;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;
  &#27231;&#26800;&#12391;&#33258;&#21205;&#35299;&#26512;&#12377;&#12427;&#12371;&#12392;&#12418;&#31777;&#21336;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12394;&#27161;&#28310;&#12395;&#12375;&#12383;&#12364;&#12387;&#12390;
  &#20849;&#36890;&#12398;&#26041;&#24335;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12289;&#12381;&#12428;&#12434;&#12393;&#12371;&#12391;&#12418;&#19968;&#36011;&#12375;&#12390;&#20351;&#12358;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20107;&#23455;&#19978;&#12398;&#27770;&#12414;&#12426;&#12392;&#12375;&#12390;&#35469;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#27770;&#12414;&#12426;&#12434;&#20316;&#12387;&#12390;&#12362;&#12367;&#12392;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12424;&#12426;&#20870;&#28369;&#12395;&#12377;&#12427;&#12383;&#12417;&#12398;&#12484;&#12540;&#12523;&#12434;&#20316;&#12426;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400; "r12828" &#24418;&#24335;&#12391;&#26360;&#12363;&#12428;&#12383;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;
  &#12522;&#12509;&#12472;&#12488;&#12522;&#38322;&#35239;&#12471;&#12473;&#12486;&#12512;&#12408;&#12398;&#30452;&#12522;&#12531;&#12463;&#12395;&#22793;&#25563;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12364;&#12420;&#12426;&#12420;&#12377;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12375; "revision 12828" &#12398;&#12424;&#12358;&#12394;&#24418;&#24335;&#12391;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#34920;&#12377;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12289;
  &#12484;&#12540;&#12523;&#12434;&#20316;&#12427;&#12398;&#12399;&#38627;&#12375;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12383;&#12392;&#12360;&#12400;&#36884;&#20013;&#12395;&#25913;&#34892;&#12364;&#12399;&#12356;&#12387;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#25991;&#31456;&#12398;&#20013;&#12363;&#12425;&#25244;&#12365;&#20986;&#12377;&#12398;&#12418;&#38627;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;
  ("revision" &#12392;&#12356;&#12358;&#21336;&#35486;&#12399;&#20182;&#12398;&#22580;&#38754;&#12391;&#12418;&#12424;&#12367;&#20351;&#12431;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  "12828" &#12398;&#12424;&#12358;&#12394;&#21336;&#12394;&#12427;&#25968;&#23383;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#22580;&#25152;&#12391;&#29992;&#12356;&#12425;&#12428;&#12414;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;&#20197;&#22806;&#12398;&#24847;&#21619;&#12391; "r12828" &#24418;&#24335;&#12434;&#29992;&#12356;&#12427;&#12371;&#12392;&#12399;&#12414;&#12378;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#21516;&#27096;&#12398;&#12371;&#12392;&#12364;&#12289;&#12496;&#12464;&#30058;&#21495;&#12420; FAQ &#12398;&#38917;&#30446;&#30058;&#21495;
  (&#12498;&#12531;&#12488;: <a class="xref" href="growth.html#html-named-anchors-and-ids" title="&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12392; ID &#23646;&#24615;">&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12392; ID &#23646;&#24615;</a>
  &#12391;&#35500;&#26126;&#12375;&#12383;&#12424;&#12358;&#12395;&#12289;URL &#12391;&#21517;&#21069;&#20184;&#12365;&#12450;&#12531;&#12459;&#12540;&#12434;&#29992;&#12356;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;)
  &#12394;&#12393;&#12395;&#12418;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#30701;&#12417;&#12398;&#27770;&#12414;&#12387;&#12383;&#24418;&#24335;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#24773;&#22577;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#19968;&#36011;&#12375;&#12390;&#37325;&#35201;&#12394;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;&#12434;&#25351;&#12377;&#12392;&#12365;&#12395;&#12289;
  &#21336;&#12395;&#36865;&#20449;&#32773;&#12392;&#20214;&#21517;&#12384;&#12369;&#12391;&#28168;&#12414;&#12379;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12408;&#12398; URL &#12392; Message-ID
  &#12504;&#12483;&#12480;&#12418;&#21547;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  Message-ID &#12504;&#12483;&#12480;&#12434;&#21547;&#12417;&#12390;&#12362;&#12369;&#12400;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;&#12434;&#12525;&#12540;&#12459;&#12523;&#12395;&#20445;&#23384;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;
  (&#26053;&#34892;&#20013;&#12391;&#12418;&#36942;&#21435;&#12398;&#12513;&#12540;&#12523;&#12434;&#35501;&#12417;&#12427;&#12424;&#12358;&#12395;&#12289;&#12458;&#12501;&#12521;&#12452;&#12531;&#12398;&#12467;&#12500;&#12540;&#12434;
  &#12521;&#12483;&#12503;&#12488;&#12483;&#12503;&#12395;&#27531;&#12375;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;) &#12395;&#12392;&#12387;&#12390;&#20415;&#21033;&#12391;&#12377;&#12290;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12394;&#12367;&#12390;&#12418;&#12289;Message-ID
  &#12504;&#12483;&#12480;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#29305;&#23450;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12289;&#36865;&#20449;&#32773;&#12392;&#20214;&#21517;&#12384;&#12369;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#12384;&#12387;&#12390;&#12289;&#21516;&#12376;&#12473;&#12524;&#12483;&#12489;&#20869;&#12391;&#21516;&#12376;&#20154;&#12364;&#21516;&#12376;&#20214;&#21517;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;
  &#19968;&#26085;&#12395;&#20309;&#24230;&#12418;&#36865;&#20449;&#12377;&#12427;&#12371;&#12392;&#12387;&#12390;&#12289;&#12381;&#12435;&#12394;&#12395;&#29645;&#12375;&#12356;&#12371;&#12392;&#12391;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#65311;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;&#12371;&#12398;&#25163;&#12398;&#19968;&#36011;&#24615;&#12399;&#12424;&#12426;&#37325;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#19968;&#36011;&#24615;&#12392;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12393;&#12371;&#12391;&#12418;&#21516;&#12376;&#35215;&#21063;&#12395;&#24467;&#12358;&#12371;&#12392;&#12290;
  &#12381;&#12375;&#12390;&#35215;&#21063;&#12395;&#24467;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#35469;&#30693;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12358;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;&#28961;&#39364;&#12394;&#36074;&#21839;&#12364;&#32368;&#12426;&#36820;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#28187;&#12426;&#12414;&#12377;&#12290;
  &#12513;&#12531;&#12496;&#12540;&#12364; 100 &#19975;&#20154;&#12384;&#12429;&#12358;&#12364;&#12402;&#12392;&#12426;&#12384;&#12429;&#12358;&#12364;&#12289;
  &#12381;&#12398;&#36000;&#33655;&#12399;&#12381;&#12428;&#12411;&#12393;&#22793;&#12431;&#12426;&#12414;&#12379;&#12435;&#12290;&#26412;&#24403;&#12395;&#12388;&#12425;&#12367;&#12394;&#12427;&#12398;&#12399;&#12289;
  &#36074;&#21839;&#12375;&#12390;&#12367;&#12427;&#20154;&#12398;&#25968;&#12364;&#22679;&#12360;&#22987;&#12417;&#12390;&#12365;&#12383;&#12392;&#12365;&#12391;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12367;&#12394;&#12387;&#12390;&#12365;&#12383;&#12425;&#12289;
  &#36074;&#21839;&#12398;&#37327;&#12434;&#28187;&#12425;&#12377;&#26041;&#21521;&#12395;&#36914;&#12417;&#12427;&#12371;&#12392;&#12434;&#24515;&#12364;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;&#36074;&#12398;&#39640;&#12356;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12289;
  &#12373;&#12425;&#12395;&#12381;&#12398;&#24773;&#22577;&#12434;&#35211;&#12388;&#12369;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12431;&#12374;&#12431;&#12374;&#36074;&#21839;&#12377;&#12427;&#12414;&#12391;&#12418;&#12394;&#12367;
  &#24517;&#35201;&#12394;&#24773;&#22577;&#12434;&#12377;&#12368;&#12395;&#35211;&#12388;&#12369;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="difficult-people.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="bug-tracker-usage.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#25201;&#12356;&#12395;&#12367;&#12356;&#20154;&#12383;&#12385; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356;</td></tr></table></div></body></html>
