<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;1&#31456; &#23566;&#20837;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="aboutjpversion.html" title="&#26085;&#26412;&#35486;&#29256;&#12395;&#12388;&#12356;&#12390;"><link rel="next" href="today.html" title="&#29694;&#29366;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;1&#31456; &#23566;&#20837;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="aboutjpversion.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="today.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;1&#31456; &#23566;&#20837;"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>&#31532;1&#31456; &#23566;&#20837;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="introduction.html#history">&#27508;&#21490;</a></span></dt><dd><dl><dt><span class="sect2"><a href="introduction.html#propertization">&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</a></span></dt><dd><dl><dt><span class="sect3"><a href="introduction.html#history-conscious-resistance">&#24847;&#35672;&#30340;&#12394;&#25269;&#25239;</a></span></dt><dt><span class="sect3"><a href="introduction.html#history-accidental-resistance">&#28961;&#24847;&#35672;&#12394;&#25269;&#25239;</a></span></dt></dl></dd><dt><span class="sect2"><a href="introduction.html#free-vs-open-source">&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;</a></span></dt></dl></dd><dt><span class="sect1"><a href="today.html">&#29694;&#29366;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>
  &#12411;&#12392;&#12435;&#12393;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#22833;&#25943;&#20363;&#12395;&#12388;&#12356;&#12390;&#32862;&#12367;&#12371;&#12392;&#12399;&#12354;&#12414;&#12426;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12415;&#12435;&#12394;&#12398;&#27671;&#12434;&#24341;&#12367;&#12398;&#12399;&#25104;&#21151;&#12375;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12384;&#12369;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#19990;&#12398;&#20013;&#12395;&#12399;&#36884;&#26041;&#12418;&#12394;&#12356;&#25968;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23384;&#22312;&#12377;&#12427;
  <sup>[<a name="idp24080" href="#ftn.idp24080" class="footnote">4</a>]</sup>
  &#12398;&#12391;&#12289;&#12383;&#12392;&#12360;&#25104;&#21151;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12381;&#12398;&#20013;&#12398;&#12372;&#12367;&#19968;&#37096;&#12395;&#36942;&#12366;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#35211;&#12360;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12356;&#12388;&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22833;&#25943;&#12375;&#12383;&#12301;&#12392;&#21028;&#26029;&#12377;&#12427;&#12398;&#12363;&#12364;&#12399;&#12387;&#12365;&#12426;&#12375;&#12394;&#12356;&#12398;&#12418;
  &#31169;&#12383;&#12385;&#12364;&#22833;&#25943;&#12395;&#12388;&#12356;&#12390;&#32862;&#12367;&#12371;&#12392;&#12364;&#12394;&#12356;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#28040;&#28357;&#12375;&#12383;&#30636;&#38291;&#12301;&#12392;&#12356;&#12358;&#12398;&#12434;&#29305;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#21442;&#21152;&#32773;&#12364;&#23569;&#12375;&#12378;&#12388;&#20182;&#12408;&#31227;&#12387;&#12390;&#12356;&#12365;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20316;&#26989;&#12377;&#12427;&#12398;&#12434;&#12420;&#12417;&#12427;&#12384;&#12369;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#26368;&#24460;&#12395;&#22793;&#26356;&#12364;&#21152;&#12360;&#12425;&#12428;&#12383;&#12392;&#12365;&#12301;&#12434;&#30693;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
  &#23455;&#38555;&#12395;&#12381;&#12398;&#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#20154;&#12399;&#12300;&#12381;&#12428;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#26368;&#24460;&#12398;&#12467;&#12511;&#12483;&#12488;&#12392;&#12394;&#12427;&#12301;
  &#12392;&#12399;&#27770;&#12375;&#12390;&#24605;&#12387;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#12393;&#12428;&#12368;&#12425;&#12356;&#21205;&#12365;&#12364;&#12394;&#12369;&#12428;&#12400;&#12300;&#27490;&#12414;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12301;
  &#12392;&#12415;&#12394;&#12377;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12418;&#12399;&#12387;&#12365;&#12426;&#12375;&#12383;&#23450;&#32681;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#30446;&#12384;&#12387;&#12383;&#21205;&#12365;&#12364;&#21322;&#24180;&#38291;&#12394;&#12363;&#12387;&#12383;&#12392;&#12365;&#65311;
  &#12518;&#12540;&#12470;&#12540;&#25968;&#12398;&#20280;&#12403;&#12364;&#27490;&#12414;&#12387;&#12390;&#12375;&#12414;&#12356;&#12289;&#32080;&#23616;&#38283;&#30330;&#32773;&#12398;&#25968;&#12434;&#36229;&#12360;&#12427;&#12371;&#12392;&#12364;&#12394;&#12363;&#12387;&#12383;&#12392;&#12365;&#65311;
  &#33258;&#20998;&#12398;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#32080;&#23616;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#28988;&#12365;&#30452;&#12375;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27671;&#12389;&#12356;&#12383;&#38283;&#30330;&#32773;&#12364;&#12289;
  &#29694;&#22312;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25448;&#12390;&#12390;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#12411;&#12358;&#12395;&#31227;&#21205;&#12375;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#31227;&#12387;&#12383;&#20808;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12393;&#12435;&#12393;&#12435;&#25104;&#38263;&#12373;&#12379;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12289;&#20803;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12300;&#28040;&#28357;&#12375;&#12383;&#12301;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
  &#12381;&#12428;&#12392;&#12418;&#12300;&#12354;&#12427;&#12409;&#12365;&#22580;&#25152;&#12395;&#31227;&#21205;&#12375;&#12383;&#12384;&#12369;&#12301;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#35079;&#38609;&#12394;&#20596;&#38754;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;
  &#12356;&#12387;&#12383;&#12356;&#12393;&#12398;&#31243;&#24230;&#12398;&#21106;&#21512;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22833;&#25943;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#27491;&#30906;&#12395;&#30693;&#12427;&#12398;&#12399;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#36942;&#21435;10&#24180;&#12434;&#36229;&#12360;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#30028;&#12391;&#12398;&#32076;&#39443;&#12420;
  SourceForge.net &#12398;&#12487;&#12540;&#12479;&#12363;&#12425;&#12398;&#25512;&#28204;&#12289;
  &#12381;&#12375;&#12390;&#12385;&#12423;&#12387;&#12392;&#12464;&#12464;&#12387;&#12390;&#12415;&#12383;&#32080;&#26524;&#12399;&#12393;&#12428;&#12418;&#21516;&#12376;&#12424;&#12358;&#12394;&#32080;&#26524;&#12392;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22833;&#25943;&#12395;&#32066;&#12431;&#12427;&#21487;&#33021;&#24615;&#12399;&#38750;&#24120;&#12395;&#39640;&#12367;&#12289;
  &#12362;&#12381;&#12425;&#12367;90&#8211;95%&#12367;&#12425;&#12356;&#12392;&#35211;&#12390;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12363;&#12429;&#12358;&#12376;&#12390;&#29983;&#12365;&#27531;&#12387;&#12390;&#12399;&#12356;&#12427;&#12364;&#12289;&#12414;&#12392;&#12418;&#12395;&#27231;&#33021;&#12375;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#21547;&#12417;&#12427;&#12392;&#12289;
  &#12371;&#12398;&#25968;&#23383;&#12399;&#12373;&#12425;&#12395;&#19978;&#12364;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12371;&#12391;&#12356;&#12358;&#12300;&#12414;&#12392;&#12418;&#12395;&#27231;&#33021;&#12375;&#12390;&#12356;&#12394;&#12356;&#12301;&#12392;&#12399;&#12289;
  &#12392;&#12426;&#12354;&#12360;&#12378;&#21205;&#12367;&#12467;&#12540;&#12488;&#12399;&#23384;&#22312;&#12377;&#12427;&#12364;&#28288;&#36275;&#12395;&#20351;&#12360;&#12427;&#20195;&#29289;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#38283;&#30330;&#12364;&#36914;&#12435;&#12391;&#12356;&#12427;&#12424;&#12358;&#12395;&#12399;&#35211;&#12360;&#12394;&#12356;&#12392;&#12356;&#12358;&#29366;&#24907;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#26412;&#26360;&#12398;&#30446;&#30340;&#12399;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#22833;&#25943;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#26412;&#26360;&#12391;&#12399;&#12289;&#12300;&#12393;&#12358;&#12420;&#12387;&#12383;&#12425;&#12358;&#12414;&#12367;&#12356;&#12367;&#12363;&#12301;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;
  &#12300;&#12393;&#12358;&#12420;&#12387;&#12383;&#12425;&#22833;&#25943;&#12377;&#12427;&#12363;&#12301;&#12395;&#12388;&#12356;&#12390;&#12418;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#30693;&#12427;&#12371;&#12392;&#12391;&#12289;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#36556;&#36947;&#20462;&#27491;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#26412;&#26360;&#12434;&#35501;&#12415;&#32066;&#12360;&#12425;&#12428;&#12383;&#30342;&#12373;&#12435;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38283;&#30330;&#12395;&#12362;&#12356;&#12390;&#38501;&#12426;&#12364;&#12385;&#12394;
  &#33853;&#12392;&#12375;&#31348;&#12434;&#36991;&#12369;&#12427;&#12373;&#12414;&#12374;&#12414;&#12394;&#12486;&#12463;&#12491;&#12483;&#12463;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24040;&#22823;&#21270;&#12420;&#20445;&#23432;&#12434;&#12358;&#12414;&#12367;&#25201;&#12358;&#12383;&#12417;&#12398;&#12486;&#12463;&#12491;&#12483;&#12463;&#12418;&#36523;&#12395;&#30528;&#12369;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#25104;&#21151;&#12392;&#12356;&#12358;&#12418;&#12398;&#12399;&#12476;&#12525;&#12469;&#12512;&#12466;&#12540;&#12512;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#26412;&#26360;&#12391;&#12399;&#12289;
  &#12356;&#12363;&#12395;&#12375;&#12390;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20986;&#12375;&#25244;&#12367;&#12363;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12399;&#25201;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12377;&#12427;&#19978;&#12391;&#12399;
  &#20182;&#12398;&#38306;&#36899;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12398;&#21332;&#35519;&#12364;&#37325;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#38263;&#12356;&#30446;&#12391;&#35211;&#12428;&#12400;&#12289;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25104;&#21151;&#12375;&#12390;&#12418;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#30028;&#20840;&#20307;&#12398;&#21033;&#30410;&#12395;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22833;&#25943;&#12395;&#32066;&#12431;&#12427;&#21407;&#22240;&#12399;
  &#29420;&#21344;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12392;&#21516;&#12376;&#12384;&#12392;&#35328;&#12356;&#20999;&#12387;&#12390;&#12375;&#12414;&#12360;&#12428;&#12400;&#35441;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29987;&#26989;&#12395;&#12362;&#12369;&#12427;&#12424;&#12367;&#30693;&#12425;&#12428;&#12383;&#21839;&#38988;
  (&#12383;&#12392;&#12360;&#12400;&#38750;&#29694;&#23455;&#30340;&#12394;&#35201;&#20214;&#12289;&#12354;&#12356;&#12414;&#12356;&#12394;&#20181;&#27096;&#12289;
  &#12414;&#12378;&#12356;&#12522;&#12477;&#12540;&#12473;&#31649;&#29702;&#12289;&#19981;&#21313;&#20998;&#12394;&#35373;&#35336;&#12501;&#12455;&#12540;&#12474;&#12394;&#12393;)
  &#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12418;&#36215;&#12371;&#12426;&#12358;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12488;&#12500;&#12483;&#12463;&#12395;&#38306;&#12375;&#12390;&#12399;&#26082;&#12395;&#22823;&#37327;&#12398;&#26360;&#29289;&#12364;&#23384;&#22312;&#12377;&#12427;&#12398;&#12391;&#12289;
  &#26412;&#26360;&#12391;&#12399;&#12381;&#12428;&#12392;&#37325;&#35079;&#12377;&#12427;&#12424;&#12358;&#12394;&#20869;&#23481;&#12399;&#36991;&#12369;&#12427;&#12388;&#12418;&#12426;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#29305;&#26377;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#34892;&#12365;&#35440;&#12414;&#12427;&#21407;&#22240;&#12392;&#12375;&#12390;&#12424;&#12367;&#12354;&#12427;&#12398;&#12364;&#12289;
  &#38283;&#30330;&#32773; (&#12354;&#12427;&#12356;&#12399;&#12510;&#12493;&#12540;&#12472;&#12515;) &#12364;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#12395;&#22266;&#26377;&#12398;&#21839;&#38988;&#12434;&#27491;&#12375;&#12367;&#35469;&#35672;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12463;&#12525;&#12540;&#12474;&#12489;&#12477;&#12540;&#12473;&#12394;&#38283;&#30330;&#12395;&#12362;&#12369;&#12427;&#21839;&#38988;&#12408;&#12398;&#23550;&#24540;&#12399;&#24931;&#12428;&#12390;&#12356;&#12383;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12418;&#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12384;&#12417;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#19968;&#30058;&#12424;&#12367;&#12354;&#12427;&#38291;&#36949;&#12356;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#33258;&#20307;&#12391;&#19968;&#20786;&#12369;&#12375;&#12424;&#12358;&#12392;&#38750;&#29694;&#23455;&#30340;&#12394;&#26399;&#24453;&#12434;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12395;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#24517;&#12378;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12364;&#38598;&#32080;&#12375;&#12390;&#12367;&#12428;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12377;&#12391;&#12395;&#21839;&#38988;&#12434;&#25265;&#12360;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12395;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;
  &#12381;&#12398;&#21839;&#38988;&#12364;&#33258;&#28982;&#12395;&#35299;&#27770;&#12377;&#12427;&#12431;&#12369;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12414;&#12387;&#12383;&#12367;&#27491;&#21453;&#23550;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12399;&#12376;&#12417;&#12427;&#12392;&#12289;
  &#12371;&#12428;&#12414;&#12391;&#33258;&#20998;&#12383;&#12385;&#12384;&#12369;&#12391;&#12420;&#12387;&#12390;&#12356;&#12383;&#12392;&#12365;&#12392;&#27604;&#12409;&#12390;
  &#12356;&#12429;&#12356;&#12429;&#35079;&#38609;&#12394;&#12371;&#12392;&#12434;&#32771;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#30701;&#26399;&#30340;&#12395;&#12399; <span class="emphasis"><em>&#36027;&#29992;&#12418;&#12363;&#12373;&#12416;</em></span> &#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;&#35211;&#30693;&#12425;&#12396;&#20182;&#20154;&#12364;&#35501;&#12435;&#12391;&#12418;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#12394;&#12427;&#12424;&#12358;&#12394;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#38283;&#30330;&#32773;&#29992;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12420;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#25972;&#20633;&#12375;&#12383;&#12426;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
  &#26368;&#20302;&#38480;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12418;&#26360;&#12367;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12425;&#12399;&#12393;&#12428;&#12418;&#22823;&#22793;&#12394;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#20206;&#12395;&#12393;&#12371;&#12363;&#12398;&#38283;&#30330;&#32773;&#12364;&#12300;&#25163;&#20253;&#12387;&#12390;&#12354;&#12370;&#12424;&#12358;&#12363;&#65311;&#12301;&#12392;&#22768;&#12434;&#12363;&#12369;&#12390;&#12365;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12384;&#12381;&#12398;&#20154;&#12364;&#12393;&#12428;&#12411;&#12393;&#21332;&#21147;&#12375;&#12390;&#12367;&#12428;&#12381;&#12358;&#12363;&#12431;&#12363;&#12425;&#12394;&#12356;&#26178;&#28857;&#12391;&#12418;&#12289;
  &#12381;&#12398;&#20154;&#12395;&#23550;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12434;&#12375;&#12383;&#12426;&#36074;&#21839;&#12395;&#31572;&#12360;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#20316;&#26989;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  Jamie Zawinski &#12399;&#12289;Mozilla &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21021;&#26399;&#12395;&#30330;&#29983;&#12375;&#12383;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#27425;&#12398;&#12424;&#12358;&#12395;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12399;&#12358;&#12414;&#12367;&#20685;&#12367;&#12418;&#12398;&#12391;&#12354;&#12427;&#12290;&#12375;&#12363;&#12375;&#12289;&#26368;&#12418;&#22823;&#20999;&#12394;&#12371;&#12392;&#12399;&#12289;
        &#20309;&#12395;&#12391;&#12418;&#21177;&#12367;&#12424;&#12358;&#12394;&#29305;&#21177;&#34220;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12290;
        &#12418;&#12375;&#12289;&#12371;&#12371;&#12395;&#25945;&#35347;&#12364;&#12354;&#12427;&#12392;&#12377;&#12428;&#12400;&#12289;&#27515;&#12395;&#12363;&#12369;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12388;&#12363;&#12414;&#12360;&#12390;&#12289;
        &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12392;&#12356;&#12358;&#39764;&#27861;&#12398;&#22934;&#31934;&#12398;&#31881;&#12434;&#12405;&#12426;&#12363;&#12369;&#12390;&#12289;
        &#12377;&#12409;&#12390;&#12364;&#39764;&#27861;&#12398;&#12424;&#12358;&#12395;&#12358;&#12414;&#12367;&#34892;&#12367;&#12394;&#12393;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12394;&#12356;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12290;
        &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#38627;&#12375;&#12356;&#12290;&#21839;&#38988;&#12399;&#12381;&#12435;&#12394;&#12395;&#31777;&#21336;&#12394;&#12418;&#12398;&#12376;&#12419;&#12394;&#12356;&#12290;
      </em></span></p><p>
        (<span class="bold"><strong><a class="ulink" href="http://www.jwz.org/gruntle/nomo.html" target="_top">http://www.jwz.org/gruntle/nomo.html</a></strong></span> &#12424;&#12426;&#24341;&#29992;&#12290;
        &#26085;&#26412;&#35486;&#35379;&#12399; <span class="bold"><strong><a class="ulink" href="http://cruel.org/jwz/nomo.html" target="_top">http://cruel.org/jwz/nomo.html</a></strong></span>)
      </p></blockquote></div><p>
  &#12381;&#12428;&#12395;&#38306;&#36899;&#12377;&#12427;&#38291;&#36949;&#12356;&#12392;&#12375;&#12390;&#12399;&#12289;&#35211;&#26628;&#12360;&#12398;&#35519;&#25972;&#12420;&#12497;&#12483;&#12465;&#12540;&#12472;&#20316;&#25104;&#12395;&#25163;&#12434;&#25244;&#12367;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12300;&#12381;&#12435;&#12394;&#12398;&#12356;&#12388;&#12391;&#12418;&#12391;&#12365;&#12427;&#12375;&#12289;&#12418;&#12358;&#12385;&#12423;&#12387;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#33853;&#12385;&#30528;&#12356;&#12390;&#12363;&#12425;&#12391;&#12356;&#12356;&#12424;&#12301;
  &#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#32771;&#12360;&#12391;&#12377;&#12290;
  &#35211;&#26628;&#12360;&#12398;&#35519;&#25972;&#12420;&#12497;&#12483;&#12465;&#12540;&#12472;&#20316;&#25104;&#12392;&#12356;&#12387;&#12390;&#12418;&#12356;&#12429;&#12356;&#12429;&#12394;&#20869;&#23481;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12364;&#12289;
  &#12393;&#12428;&#12418;&#32080;&#23616;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#20837;&#38556;&#22721;&#12434;&#19979;&#12370;&#12427;&#12371;&#12392;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12365;&#12414;&#12377;&#12290;
  &#26032;&#21442;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12420;&#12377;&#12367;&#12377;&#12427;&#12395;&#12399;&#12289;
  &#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#38283;&#30330;&#32773;&#21521;&#12369;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#25972;&#20633;&#12375;&#12383;&#12426;
  &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#38283;&#12356;&#12390;&#21021;&#24515;&#32773;&#21521;&#12369;&#24773;&#22577;&#12434;&#25522;&#36617;&#12375;&#12383;&#12426;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12531;&#12497;&#12452;&#12523;&#12420;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#12362;&#25163;&#36605;&#12395;&#34892;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#20316;&#26989;&#12364;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#27531;&#24565;&#12394;&#12364;&#12425;&#12289;&#19990;&#12398;&#22810;&#12367;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;
  &#12371;&#12428;&#12425;&#12398;&#20316;&#26989;&#12434;&#20108;&#12398;&#27425;&#12395;&#12375;&#12390;&#12467;&#12540;&#12489;&#12384;&#12369;&#12395;&#27880;&#21147;&#12375;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#29702;&#30001;&#12399;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12381;&#12428;&#12364;&#24444;&#12425;&#12395;&#12392;&#12387;&#12390;&#12354;&#12414;&#12426;&#37325;&#35201;&#12394;&#20316;&#26989;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12364;&#24441;&#12395;&#31435;&#12388;&#12398;&#12399;&#12371;&#12428;&#12414;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12411;&#12392;&#12435;&#12393;&#12363;&#12363;&#12431;&#12387;&#12390;&#12371;&#12394;&#12363;&#12387;&#12383;&#20154;&#12383;&#12385;&#12391;&#12354;&#12426;&#12289;
  &#20170;&#12414;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12365;&#12383;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12354;&#12414;&#12426;&#24847;&#21619;&#12398;&#12394;&#12356;&#20316;&#26989;&#12384;&#12392;&#24863;&#12376;&#12425;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#23455;&#38555;&#12395;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#12394;&#12435;&#12390;&#19981;&#35201;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12381;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12418;&#31649;&#29702;&#26041;&#27861;&#12418;&#29087;&#30693;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12384;&#12387;&#12390;&#33258;&#20998;&#33258;&#36523;&#12391;&#12381;&#12428;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#12435;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#27425;&#12395;&#12289;&#35211;&#26628;&#12360;&#12434;&#12424;&#12367;&#12375;&#12383;&#12426;&#20351;&#12356;&#12420;&#12377;&#12367;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12375;&#12383;&#12426;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12473;&#12461;&#12523;&#12399;&#12289;
  &#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12473;&#12461;&#12523;&#12392;&#12399;&#12414;&#12387;&#12383;&#12367;&#30064;&#12394;&#12427;&#12418;&#12398;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20154;&#12399;&#12415;&#12394;&#12289;&#33258;&#20998;&#12398;&#24471;&#24847;&#12394;&#12392;&#12371;&#12429;&#12395;&#21147;&#12434;&#20837;&#12428;&#12383;&#12364;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#33510;&#25163;&#12394;&#12371;&#12392;&#12395;&#12385;&#12423;&#12387;&#12392;&#21462;&#12426;&#32068;&#12416;&#12384;&#12369;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12424;&#12426;&#12424;&#12356;&#12418;&#12398;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12392;&#12375;&#12390;&#12418;&#12290;
  <a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a> &#12391;&#12399;&#12289;
  &#35211;&#26628;&#12360;&#12434;&#12424;&#12367;&#12375;&#12383;&#12426;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20316;&#25104;&#12375;&#12383;&#12426;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26368;&#21021;&#26399;&#12363;&#12425;&#34892;&#12358;&#12409;&#12365;&#12391;&#12354;&#12427;&#29702;&#30001;&#12395;&#12388;&#12356;&#12390;&#12418;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#27425;&#12395;&#12424;&#12367;&#12354;&#12427;&#35492;&#35299;&#12399;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#12395;&#12354;&#12414;&#12426;&#27671;&#12434;&#20351;&#12431;&#12394;&#12367;&#12390;&#12356;&#12356;&#12301;
  &#12392;&#12363;&#12289;&#36870;&#12395;&#12300;&#31038;&#20869;&#38283;&#30330;&#12398;&#22580;&#21512;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#12434;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#21839;&#38988;&#12394;&#12367;&#21205;&#12367;&#12384;&#12429;&#12358;&#12301;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#12364;&#12354;&#12414;&#12426;&#34920;&#12395;&#20986;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#33310;&#21488;&#35023;&#12391;&#12399;&#12289;&#20309;&#12425;&#12363;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12394;&#12380;&#65311;&#29702;&#30001;&#12434;&#35500;&#26126;&#12377;&#12427;&#12383;&#12417;&#12289;&#12371;&#12371;&#12391;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#24605;&#32771;&#23455;&#39443;&#12434;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;&#12356;&#12429;&#12356;&#12429;&#12394;&#24847;&#21619;&#12391;&#12496;&#12521;&#12496;&#12521;&#12391;&#12377;
  &#8212;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#12289;&#19968;&#21305;&#29436;&#30340;&#12394;&#20154;&#31278;&#12391;&#12377;&#8212;&#24444;&#12425;&#12399;&#12362;&#20114;&#12356;&#12395;&#38996;&#12434;&#12354;&#12431;&#12379;&#12427;&#12371;&#12392;&#12418;&#12394;&#12367;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20309;&#12434;&#36948;&#25104;&#12375;&#12383;&#12356;&#12398;&#12363;&#12392;&#12356;&#12358;&#30446;&#27161;&#12418;&#20491;&#12293;&#12395;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#38598;&#22243;&#12391;&#12289;&#20309;&#12418;&#31649;&#29702;&#12434;&#12375;&#12394;&#12363;&#12387;&#12383;&#12425;&#12393;&#12435;&#12394;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
  &#22855;&#36321;&#12391;&#12418;&#36215;&#12371;&#12425;&#12394;&#12356;&#38480;&#12426;&#12289;&#12377;&#12368;&#12395;&#12496;&#12521;&#12496;&#12521;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#26126;&#24460;&#26085;&#12398;&#26041;&#21521;&#12395;&#21521;&#12363;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#31169;&#12383;&#12385;&#12364;&#24605;&#12387;&#12390;&#12356;&#12427;&#12411;&#12393;&#29289;&#20107;&#12399;&#12358;&#12414;&#12367;&#36914;&#12415;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12391;&#12399;&#12289;&#12356;&#12387;&#12383;&#12356;&#20309;&#12434;&#31649;&#29702;&#12377;&#12409;&#12365;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;
  &#31649;&#29702;&#12399;&#12362;&#12362;&#12387;&#12404;&#12425;&#12395;&#12420;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#38750;&#20844;&#24335;&#12395;&#25511;&#12360;&#12417;&#12395;&#34892;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#38283;&#30330;&#32773;&#12383;&#12385;&#12434;&#32080;&#12403;&#12388;&#12369;&#12427;&#21807;&#19968;&#12398;&#29702;&#30001;&#12399;&#12289;
  &#20491;&#21029;&#12395;&#12420;&#12427;&#12424;&#12426;&#12418;&#21332;&#35519;&#12375;&#12383;&#12411;&#12358;&#12364;&#12424;&#12426;&#12424;&#12356;&#12418;&#12398;&#12364;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#20849;&#36890;&#35469;&#35672;&#12391;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#31649;&#29702;&#32773;&#12398;&#30446;&#27161;&#12399;&#12289;&#38283;&#30330;&#32773;&#12383;&#12385;&#12364;&#12371;&#12398;&#32771;&#12360;&#12434;&#20449;&#12376;&#32154;&#12369;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;&#27161;&#28310;&#30340;&#12394;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#25163;&#27573;&#12434;&#23450;&#12417;&#12427;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#26377;&#33021;&#12394;&#38283;&#30330;&#32773;&#12364;&#12300;&#21608;&#12426;&#12392;&#36949;&#12358;&#12301;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#20210;&#38291;&#12399;&#12378;&#12428;&#12395;&#12373;&#12428;&#12427;&#12371;&#12392;&#12398;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#35201;&#12377;&#12427;&#12395;&#12289;&#38283;&#30330;&#32773;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12300;&#12414;&#12383;&#12371;&#12371;&#12395;&#25147;&#12387;&#12390;&#12365;&#12383;&#12356;&#12301;&#12392;&#24605;&#12431;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12424;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12398;&#20855;&#20307;&#30340;&#12394;&#12486;&#12463;&#12491;&#12483;&#12463;&#12395;&#12388;&#12356;&#12390;&#12289;&#26412;&#26360;&#12391;&#12371;&#12428;&#12363;&#12425;&#35500;&#26126;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#26368;&#24460;&#12395;&#12300;&#25991;&#21270;&#30340;&#12394;&#23566;&#12365;&#26041;&#12398;&#22833;&#25943; (failures of cultural navigation)&#12301;
  &#12392;&#35328;&#12431;&#12428;&#12427;&#19968;&#33324;&#30340;&#12394;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12411;&#12435;&#12398;10&#24180;&#21069;&#12367;&#12425;&#12356;&#12414;&#12391;&#12289;&#12356;&#12420;&#65301;&#24180;&#21069;&#12367;&#12425;&#12356;&#12414;&#12391;&#12399;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#25991;&#21270;&#12395;&#12388;&#12356;&#12390;&#35486;&#12427;&#12384;&#12394;&#12435;&#12390;&#26178;&#26399;&#23578;&#26089;&#12384;&#12392;&#12356;&#12431;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12391;&#12418;&#20170;&#12399;&#12418;&#12358;&#36949;&#12356;&#12414;&#12377;&#12290;
  &#24464;&#12293;&#12395;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#25991;&#21270;&#12364;&#30446;&#12395;&#20184;&#12367;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#30906;&#12363;&#12395;&#12381;&#12428;&#12399;&#19968;&#26522;&#23721;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#8212;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12372;&#12367;&#26222;&#36890;&#12398;&#25991;&#21270;&#12392;&#21516;&#27096;&#12395;&#24847;&#35211;&#12398;&#30456;&#36949;&#12420;&#27966;&#38309;&#20105;&#12356;&#12394;&#12393;&#12364;&#36215;&#12371;&#12426;&#12364;&#12385;&#12391;&#12377;
  &#8212;&#12364;&#12289;&#12467;&#12450;&#12392;&#12394;&#12427;&#37096;&#20998;&#12399;&#19968;&#36011;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22823;&#21322;&#12399;&#12289;
  &#12371;&#12398;&#12467;&#12450;&#12392;&#12394;&#12427;&#32771;&#12360;&#12363;&#12383;&#12398;&#19968;&#37096;&#12354;&#12427;&#12356;&#12399;&#12377;&#12409;&#12390;&#12434;&#25345;&#12385;&#20633;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12424;&#12356;&#25391;&#12427;&#33310;&#12356;&#12395;&#23550;&#12375;&#12390;&#12399;&#36062;&#36059;&#12375;&#12289;&#12381;&#12358;&#12391;&#12394;&#12356;&#12418;&#12398;&#12395;&#12388;&#12356;&#12390;&#12399;&#38750;&#38627;&#12375;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#35504;&#12391;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12420;&#12377;&#12367;&#12394;&#12427;&#12424;&#12358;&#12394;&#38640;&#22258;&#27671;&#20316;&#12426;&#12434;&#24515;&#12364;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#26178;&#12395;&#12399;&#12381;&#12428;&#12364;&#29694;&#22312;&#12398;&#12513;&#12531;&#12496;&#12540;&#38291;&#12398;&#36899;&#25658;&#12434;&#20081;&#12377;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12290;
  &#24444;&#12425;&#12399;&#20309;&#12364;&#22833;&#31036;&#12391;&#20309;&#12364;&#12381;&#12358;&#12391;&#12394;&#12356;&#12398;&#12363;&#12434;&#12365;&#12385;&#12435;&#12392;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#22522;&#28310;&#12399;&#20182;&#12398;&#25991;&#21270;&#12395;&#12362;&#12369;&#12427;&#12418;&#12398;&#12392;&#12399;&#22823;&#12365;&#12367;&#30064;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#26368;&#12418;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#38263;&#24180;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12364;&#12371;&#12428;&#12425;&#12398;&#32771;&#12360;&#12434;&#36523;&#12395;&#30528;&#12369;&#12390;&#12362;&#12426;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12393;&#12358;&#12354;&#12427;&#12409;&#12365;&#12363;&#12392;&#12356;&#12358;&#25351;&#37341;&#12434;&#22823;&#38609;&#25226;&#12395;&#12388;&#12363;&#12435;&#12391;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12383;&#12356;&#12390;&#12356;&#12289;&#28961;&#24847;&#35672;&#12398;&#12358;&#12385;&#12395;&#12371;&#12398;&#22522;&#26412;&#12363;&#12425;&#36920;&#33073;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#25391;&#12427;&#33310;&#12356;&#12364;&#12393;&#12358;&#12354;&#12427;&#12409;&#12365;&#12363;&#12392;&#12356;&#12358;&#20849;&#36890;&#35469;&#35672;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12364;&#22810;&#12356;&#12391;&#12377;&#12290;
  &#12371;&#12358;&#12394;&#12427;&#12392;&#12289;&#12356;&#12374;&#20309;&#12363;&#21839;&#38988;&#12364;&#36215;&#12371;&#12387;&#12383;&#12392;&#12365;&#12395;&#29366;&#24907;&#12364;&#24613;&#36895;&#12395;&#24746;&#21270;&#12375;&#12390;&#12375;&#12414;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20105;&#12356;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12398;&#12424;&#12426;&#12393;&#12371;&#12429;&#12392;&#12394;&#12427;&#12409;&#12365;&#30906;&#31435;&#12373;&#12428;&#12383;&#25991;&#21270;&#30340;&#34892;&#21205;&#27096;&#24335;&#12434;&#21442;&#21152;&#32773;&#12364;&#25345;&#12385;&#21512;&#12431;&#12379;&#12390;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#26412;&#26360;&#12399;&#23455;&#29992;&#30340;&#12394;&#12460;&#12452;&#12489;&#12502;&#12483;&#12463;&#12391;&#12354;&#12426;&#12289;
  &#20154;&#39006;&#23398;&#12420;&#27508;&#21490;&#23398;&#12434;&#25201;&#12358;&#23398;&#34899;&#26360;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12435;&#12395;&#12385;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#25991;&#21270;&#12398;&#22987;&#12414;&#12387;&#12383;&#32972;&#26223;&#12395;&#12388;&#12356;&#12390;&#12398;
  &#22522;&#26412;&#30340;&#12394;&#30693;&#35672;&#12434;&#36523;&#12395;&#30528;&#12369;&#12390;&#12362;&#12367;&#12392;&#12289;&#26412;&#26360;&#12391;&#12398;&#23455;&#29992;&#30340;&#12394;&#12450;&#12489;&#12496;&#12452;&#12473;&#12364;&#12424;&#12426;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#32972;&#26223;&#12392;&#12394;&#12427;&#25991;&#21270;&#12434;&#30693;&#12387;&#12390;&#12362;&#12367;&#12392;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12434;&#12424;&#12426;&#24195;&#12367;&#28145;&#12367;&#27497;&#12365;&#22238;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#29420;&#29305;&#12398;&#32722;&#24931;&#12420;&#26041;&#35328;&#12364;&#12354;&#12387;&#12383;&#12426;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12418;&#27671;&#12395;&#12379;&#12378;&#12395;&#20210;&#38291;&#20837;&#12426;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21453;&#23550;&#12395;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#32972;&#26223;&#12434;&#30693;&#12425;&#12394;&#12356;&#20154;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12383;&#12426;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#12426;&#12377;&#12427;&#25163;&#32154;&#12365;&#12434;&#35211;&#12390;
  &#38750;&#24120;&#12395;&#38627;&#12375;&#12367;&#12390;&#12403;&#12387;&#12367;&#12426;&#12377;&#12427;&#12371;&#12392;&#12400;&#12363;&#12426;&#12384;&#12392;&#24863;&#12376;&#12425;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12395;&#12363;&#12363;&#12431;&#12427;&#20154;&#12399;&#20381;&#28982;&#12392;&#12375;&#12390;&#39131;&#36493;&#30340;&#12395;&#22679;&#12360;&#12388;&#12389;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#24460;&#32773;&#12395;&#23646;&#12377;&#12427;&#20154; (&#12388;&#12414;&#12426;&#32972;&#26223;&#12434;&#30693;&#12425;&#12394;&#12356;&#20154;) &#12364;&#12383;&#12367;&#12373;&#12435;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#20027;&#12392;&#12375;&#12390;&#26032;&#12375;&#12356;&#31227;&#27665;&#12395;&#12424;&#12427;&#25991;&#21270;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#20670;&#21521;&#12399;&#12418;&#12358;&#12375;&#12400;&#12425;&#12367;&#12399;&#32154;&#12367;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#33258;&#20998;&#12418;&#12300;&#32972;&#26223;&#12434;&#30693;&#12425;&#12394;&#12356;&#20154;&#12301;&#12398;&#12402;&#12392;&#12426;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12394;&#12425;&#12289;
  &#12380;&#12402;&#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12371;&#12391;&#12399;&#12289;
  &#20170;&#24460;&#26412;&#26360;&#12420;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12391;&#30331;&#22580;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#35696;&#35542;&#12398;&#32972;&#26223;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;
  (&#19968;&#26041;&#12289;&#12377;&#12391;&#12395;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12391;&#12398;&#27963;&#21205;&#32076;&#39443;&#12364;&#12354;&#12426;&#12289;
  &#12381;&#12398;&#27508;&#21490;&#12395;&#12388;&#12356;&#12390;&#12418;&#12424;&#12367;&#30693;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#26041;&#12399;&#12289;
  &#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12399;&#35501;&#12415;&#39131;&#12400;&#12375;&#12390;&#12356;&#12383;&#12384;&#12356;&#12390;&#12369;&#12387;&#12371;&#12358;&#12391;&#12377;)&#12290;
</p></div><div class="sect1" title="&#27508;&#21490;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>&#27508;&#21490;</h2></div></div></div><p>
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20849;&#26377;&#12377;&#12427;&#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#35477;&#29983;&#12375;&#12383;&#24403;&#21021;&#12363;&#12425;&#23384;&#22312;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#40654;&#26126;&#26399;&#12395;&#12399;&#12289;&#21508;&#12513;&#12540;&#12459;&#12540;&#12399;&#12300;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12398;&#38761;&#26032;&#12395;&#12424;&#12387;&#12390;
  &#31478;&#21512;&#20182;&#31038;&#12398;&#19978;&#12434;&#34892;&#12371;&#12358;&#12301;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#21830;&#22770;&#12398;&#26448;&#26009;&#12392;&#12375;&#12390;&#12354;&#12414;&#12426;&#37325;&#35222;&#12373;&#12428;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12356;&#12431;&#12400;&#12300;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12398;&#12362;&#12414;&#12369;&#12301;&#12392;&#12356;&#12358;&#23384;&#22312;&#12391;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12371;&#12429;&#12395;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12434;&#20351;&#12387;&#12390;&#12356;&#12383;&#12398;&#12399;&#31185;&#23398;&#32773;&#12420;&#25216;&#34899;&#32773;&#12400;&#12363;&#12426;&#12391;&#12289;
  &#24444;&#12425;&#12399;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#21516;&#26801;&#12373;&#12428;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20462;&#27491;&#12375;&#12383;&#12426;&#25313;&#24373;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#20462;&#27491;&#12497;&#12483;&#12481;&#12434;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#12513;&#12540;&#12459;&#12540;&#12395;&#36865;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#21516;&#12376;&#12510;&#12471;&#12531;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20182;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12418;&#36865;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12513;&#12540;&#12459;&#12540;&#12399;&#12381;&#12428;&#12395;&#30446;&#12367;&#12376;&#12425;&#12434;&#31435;&#12390;&#12427;&#12371;&#12392;&#12399;&#12394;&#12367;&#12289;&#12416;&#12375;&#12429;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12434;&#22888;&#21169;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12393;&#12435;&#12394;&#29702;&#30001;&#12391;&#12354;&#12428;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#21697;&#36074;&#12364;&#21521;&#19978;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12364;&#12383;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12362;&#12363;&#12370;&#12391;&#33258;&#31038;&#12398;&#12510;&#12471;&#12531;&#12364;&#12424;&#12426;&#39749;&#21147;&#30340;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12289;
  &#26032;&#35215;&#39015;&#23458;&#12364;&#22679;&#12360;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
</p><p>
  &#24403;&#26178;&#12398;&#29366;&#27841;&#12392;&#29694;&#22312;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#25991;&#21270;&#12392;&#12398;&#38291;&#12395;&#12399;&#22810;&#12367;&#12398;&#20849;&#36890;&#28857;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#27770;&#23450;&#30340;&#12394;&#36949;&#12356;&#12364;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#24403;&#26178;&#12399;&#12414;&#12384;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12364;&#27161;&#28310;&#21270;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12385;&#12423;&#12358;&#12393;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#33258;&#20307;&#12364;&#38761;&#26032;&#30340;&#12394;&#36914;&#27497;&#12434;&#36930;&#12370;&#12388;&#12388;&#12354;&#12427;&#26178;&#26399;&#12384;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12381;&#12398;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12364;&#23384;&#22312;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#12354;&#12427;&#27231;&#31278;&#12398;&#12383;&#12417;&#12395;&#26360;&#12356;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#12381;&#12398;&#20182;&#12398;&#27231;&#31278;&#12391;&#12399;&#19968;&#20999;&#21205;&#12363;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12354;&#12427;&#27231;&#31278;&#12398;&#12383;&#12417;&#12395;&#26360;&#12356;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#19990;&#30028;&#20013;&#12391;&#20351;&#12431;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#24403;&#26178;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;&#29305;&#23450;&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;
  &#12354;&#12427;&#12356;&#12399;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12501;&#12449;&#12511;&#12522;&#12540;&#12395;&#12388;&#12356;&#12390;&#12398;&#23554;&#38272;&#25216;&#34899;&#12434;&#36523;&#12395;&#12388;&#12369;&#12424;&#12358;&#12392;&#12377;&#12427;&#20670;&#21521;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;
  (&#19968;&#26041;&#29694;&#22312;&#12391;&#12399;&#12289;&#29305;&#23450;&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12392;&#12356;&#12358;&#12424;&#12426;&#12399;
  &#29305;&#23450;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12395;&#38306;&#12377;&#12427;&#12456;&#12461;&#12473;&#12497;&#12540;&#12488;&#12395;&#12394;&#12429;&#12358;&#12392;&#12377;&#12427;&#20154;&#12364;&#22810;&#12356;&#12424;&#12358;&#12395;&#24605;&#12356;&#12414;&#12377;&#12290;
  &#20309;&#12363;&#12402;&#12392;&#12388;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12434;&#12510;&#12473;&#12479;&#12540;&#12377;&#12428;&#12400;&#12289;
  &#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12364;&#22793;&#12431;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12381;&#12398;&#30693;&#35672;&#12364;&#24540;&#29992;&#12391;&#12365;&#12427;&#12431;&#12369;&#12391;&#12377;)&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#33288;&#21619;&#12398;&#23550;&#35937;&#12364;&#12354;&#12428;&#12371;&#12428;&#31227;&#12426;&#22793;&#12431;&#12427;&#12371;&#12392;&#12364;&#12394;&#12356;&#12398;&#12391;&#12289;
  &#20309;&#12363;&#29305;&#23450;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#21147;&#12434;&#20837;&#12428;&#22987;&#12417;&#12427;&#12392;&#12378;&#12387;&#12392;&#12381;&#12428;&#12395;&#21147;&#12434;&#20837;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#32080;&#26524;&#12289;&#21608;&#22258;&#12398;&#20154;&#12383;&#12385;&#12418;&#21516;&#12376;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#33288;&#21619;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12510;&#12471;&#12531;&#12391;&#12375;&#12363;&#20351;&#12360;&#12394;&#12356;&#12467;&#12540;&#12489;&#12420;&#30693;&#35672;&#12364;&#24195;&#12414;&#12428;&#12400;&#24195;&#12414;&#12427;&#12411;&#12393;&#12289;
  &#12381;&#12398;&#12510;&#12471;&#12531;&#12434;&#20316;&#12387;&#12390;&#12356;&#12427;&#12513;&#12540;&#12459;&#12540;&#12395;&#12392;&#12387;&#12390;&#12399;&#12354;&#12426;&#12364;&#12383;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12381;&#12375;&#12390;&#65298;&#30058;&#30446;&#12395;&#12289;&#24403;&#26178;&#12399;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#24403;&#26178;&#12399;&#29694;&#22312;&#12411;&#12393;&#20849;&#26377;&#12395;&#38306;&#12377;&#12427;&#27861;&#30340;&#35215;&#21046;&#12399;&#21427;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;
  &#12381;&#12428;&#12424;&#12426;&#12418;&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12398;&#12411;&#12358;&#12364;&#22823;&#12365;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12354;&#12427;&#12487;&#12540;&#12479;&#12434;&#12393;&#12371;&#12363;&#12363;&#12425;&#12393;&#12371;&#12363;&#12408;&#31227;&#21205;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#29694;&#22312;&#12395;&#27604;&#12409;&#12390;&#38750;&#24120;&#12395;&#19981;&#20415;&#12391;&#12420;&#12387;&#12363;&#12356;&#12391;&#12375;&#12383;&#12290;
  &#30740;&#31350;&#25152;&#12420;&#20225;&#26989;&#12395;&#12424;&#12387;&#12390;&#12399;&#23567;&#12373;&#12394;&#27083;&#20869;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12434;&#25345;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#12381;&#12371;&#12391;&#12399;&#27083;&#25104;&#21729;&#12398;&#38291;&#12391;&#23481;&#26131;&#12395;&#24773;&#22577;&#12434;&#20849;&#26377;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#24773;&#22577;&#12434;&#12393;&#12371;&#12398;&#35504;&#12392;&#12391;&#12418;&#20849;&#26377;&#12375;&#12424;&#12358;&#12392;&#24605;&#12387;&#12383;&#12425;&#12289;
  &#39640;&#12356;&#25975;&#23621;&#12434;&#20055;&#12426;&#36234;&#12360;&#12394;&#12356;&#12392;&#12356;&#12369;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#22810;&#12367;&#12398;&#22580;&#21512;&#12289;&#12381;&#12398;&#25975;&#23621;&#12399;&#23455;&#38555;&#12395;&#20055;&#12426;&#36234;&#12360;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290;
  &#26178;&#12395;&#12399;&#12464;&#12523;&#12540;&#12503;&#21516;&#22763;&#12391;&#36899;&#32097;&#12434;&#12392;&#12426;&#12289;&#12487;&#12451;&#12473;&#12463;&#12420;&#12486;&#12540;&#12503;&#12434;&#37109;&#20415;&#12391;&#12420;&#12426;&#12392;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12375;&#12289;
  &#26178;&#12395;&#12399;&#12513;&#12540;&#12459;&#12540;&#33258;&#36523;&#12364;&#38291;&#12395;&#20837;&#12426;&#12289;&#12497;&#12483;&#12481;&#12398;&#21462;&#24341;&#25152;&#12392;&#12375;&#12390;&#12398;&#24441;&#21106;&#12434;&#26524;&#12383;&#12377;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#21021;&#26399;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#38283;&#30330;&#32773;&#12398;&#22810;&#12367;&#12364;&#22823;&#23398;&#12391;&#20685;&#12356;&#12390;&#12356;&#12383;&#12371;&#12392;&#12418;&#24184;&#12356;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#22823;&#23398;&#12391;&#12399;&#12289;&#33258;&#20998;&#12398;&#24471;&#12383;&#30693;&#35672;&#12434;&#12415;&#12435;&#12394;&#12395;&#24195;&#12417;&#12427;&#12371;&#12392;&#12364;&#12372;&#12367;&#26222;&#36890;&#12395;&#34892;&#12431;&#12428;&#12390;&#12356;&#12383;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12487;&#12540;&#12479;&#12434;&#20849;&#26377;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#29289;&#29702;&#30340;&#12394;&#36317;&#38626;&#12398;&#38548;&#12383;&#12426;&#12364;&#24120;&#12395;&#38556;&#23475;&#12392;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12362;&#20114;&#12356;&#12398;&#22320;&#29702;&#30340;&#12394;&#36317;&#38626;&#12289;&#12381;&#12375;&#12390;&#32068;&#32340;&#30340;&#12394;&#36317;&#38626;&#12364;&#36960;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;&#20849;&#26377;&#12364;&#12416;&#12378;&#12363;&#12375;&#12367;&#12394;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#29694;&#22312;&#12398;&#31169;&#12383;&#12385;&#12398;&#12424;&#12358;&#12395;&#12289;&#36317;&#38626;&#12434;&#27671;&#12395;&#12379;&#12378;&#24773;&#22577;&#12398;&#20849;&#26377;&#12364;&#12391;&#12365;&#12427;&#12394;&#12435;&#12390;&#12371;&#12392;&#12399;&#12354;&#12426;&#12360;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;"><div class="titlepage"><div><div><h3 class="title"><a name="propertization"></a>&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</h3></div></div></div><p>
  &#26989;&#30028;&#12364;&#25104;&#29087;&#12375;&#12390;&#12367;&#12427;&#12395;&#12388;&#12428;&#12390;&#12289;&#30456;&#20114;&#38306;&#20418;&#12398;&#12354;&#12427;&#12356;&#12367;&#12388;&#12363;&#12398;&#22793;&#21270;&#12364;&#21516;&#26178;&#12395;&#30330;&#29983;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12414;&#12378;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#12418;&#12398;&#12364;&#12354;&#12387;&#12383;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#35373;&#35336;&#12364;&#24464;&#12293;&#12395;&#28120;&#27760;&#12373;&#12428;&#12289;
  &#12356;&#12367;&#12388;&#12363;&#12398;&#21213;&#12385;&#32068;&#12395;&#32094;&#12425;&#12428;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#20182;&#12424;&#12426;&#25216;&#34899;&#30340;&#12395;&#20778;&#12428;&#12390;&#12356;&#12383;&#12418;&#12398;&#12289;&#20182;&#12424;&#12426;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12364;&#19978;&#25163;&#12384;&#12387;&#12383;&#12418;&#12398;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#20001;&#26041;&#12434;&#20860;&#12397;&#20633;&#12360;&#12390;&#12356;&#12383;&#12418;&#12398;&#12394;&#12393;&#12364;&#27531;&#12427;&#12371;&#12392;&#12392;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12392;&#21516;&#26178;&#12395; (&#12371;&#12428;&#12399;&#20840;&#12367;&#12398;&#20598;&#28982;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12289;
  &#12356;&#12431;&#12422;&#12427;&#12300;&#39640;&#32026;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12301;&#12364;&#21488;&#38957;&#12375;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12381;&#12398;&#35328;&#35486;&#12391;&#26360;&#12356;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#33258;&#21205;&#30340;&#12395;&#32763;&#35379; (&#12300;&#12467;&#12531;&#12497;&#12452;&#12523;&#12301;)
  &#12375;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#19978;&#12391;&#21205;&#12363;&#12377;&#12371;&#12392;&#12434;&#21487;&#33021;&#12392;&#12377;&#12427;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12513;&#12540;&#12459;&#12540;&#12418;&#12289;&#24403;&#28982;&#12371;&#12398;&#12424;&#12358;&#12394;&#21205;&#12365;&#12434;&#23519;&#30693;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12398;&#39015;&#23458;&#12399;&#20170;&#12420;&#12289;&#29305;&#23450;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12395;&#22258;&#12356;&#36796;&#12414;&#12428;&#12427;&#12371;&#12392;&#12394;&#12367;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#38283;&#30330;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#22793;&#21270;&#12392;&#21516;&#26178;&#12395;&#12289;&#21508;&#31278;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#38291;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#24046;&#12418;&#12411;&#12392;&#12435;&#12393;&#12394;&#12367;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12414;&#12383;&#21177;&#29575;&#30340;&#12391;&#12394;&#12356;&#35373;&#35336;&#12398;&#12418;&#12398;&#12399;&#25490;&#38500;&#12373;&#12428;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12398;&#12415;&#12434;&#21454;&#20837;&#28304;&#12392;&#12375;&#12390;&#12356;&#12427;&#12513;&#12540;&#12459;&#12540;&#12399;&#12289;
  &#23558;&#26469;&#12398;&#35211;&#36890;&#12375;&#12364;&#12354;&#12414;&#12426;&#26126;&#12427;&#12367;&#24863;&#12376;&#12425;&#12428;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12381;&#12398;&#12418;&#12398;&#12399;&#20170;&#12420;&#20195;&#26367;&#21487;&#33021;&#12394;&#12418;&#12398;&#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12289;
  &#19968;&#26041;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12371;&#12381;&#12364;&#20182;&#12392;&#12398;&#24046;&#21029;&#21270;&#12398;&#25163;&#27573;&#12392;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#27969;&#12428;&#12398;&#20013;&#12391;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#33258;&#20307;&#12434;&#36009;&#22770;&#12375;&#12383;&#12426;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12398;&#24517;&#38920;&#37096;&#21697;&#12392;&#12375;&#12390;&#36009;&#22770;&#12375;&#12383;&#12426;
  &#12392;&#12356;&#12387;&#12383;&#32771;&#12360;&#12364;&#20986;&#12390;&#12367;&#12427;&#12398;&#12418;&#24403;&#28982;&#12391;&#12375;&#12383;&#12290;
</p><p>
  &#12371;&#12371;&#12395;&#12365;&#12390;&#12289;&#21508;&#12513;&#12540;&#12459;&#12540;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#33879;&#20316;&#27177;&#12434;
  &#12424;&#12426;&#21427;&#26684;&#12395;&#36969;&#29992;&#12377;&#12427;&#24517;&#35201;&#12395;&#36843;&#12425;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12518;&#12540;&#12470;&#12540;&#12364;&#33258;&#20998;&#12383;&#12385;&#12391;&#12467;&#12540;&#12489;&#12434;&#33258;&#30001;&#12395;&#20849;&#26377;&#12375;&#25913;&#22793;&#12375;&#32154;&#12369;&#12428;&#12400;&#12289;
  &#20170;&#12420;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12398;&#12300;&#36861;&#21152;&#27231;&#33021;&#12301;&#12392;&#12375;&#12390;&#36009;&#22770;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12418;&#12398;&#12434;
  &#33258;&#21069;&#12391;&#20877;&#23455;&#35013;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12373;&#12425;&#12395;&#24746;&#12356;&#12371;&#12392;&#12395;&#12289;&#12381;&#12398;&#12467;&#12540;&#12489;&#12399;&#31478;&#21512;&#20182;&#31038;&#12398;&#25163;&#12395;&#28193;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#30382;&#32905;&#12395;&#12418;&#12289;&#12371;&#12428;&#12425;&#12398;&#20986;&#26469;&#20107;&#12399;&#12385;&#12423;&#12358;&#12393;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12364;&#35477;&#29983;&#12375;&#12383;&#12398;&#12392;&#21516;&#12376;&#12371;&#12429;&#12395;&#30330;&#29983;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20849;&#26377;&#12377;&#12427;&#38555;&#12398;&#25216;&#34899;&#30340;&#12394;&#38556;&#23475;&#12364;&#12424;&#12358;&#12420;&#12367;&#35299;&#28040;&#12373;&#12428;&#12383;&#12392;&#24605;&#12387;&#12383;&#12425;&#12289;
  &#12381;&#12398;&#12392;&#12365;&#12395;&#12399;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#26989;&#30028;&#12398;&#24120;&#35672;&#12364;&#22793;&#12431;&#12387;&#12390;&#12356;&#12383;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12513;&#12540;&#12459;&#12540;&#20596;&#12398;&#35222;&#28857;&#12391;&#35211;&#12428;&#12400;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#33258;&#30001;&#12395;&#20849;&#26377;&#12377;&#12427;&#12398;&#12399;&#26395;&#12414;&#12375;&#12367;&#12394;&#12356;&#12371;&#12392;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12513;&#12540;&#12459;&#12540;&#12399;&#35215;&#21046;&#12395;&#36208;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#33258;&#31038;&#12398;&#12510;&#12471;&#12531;&#12434;&#21205;&#12363;&#12375;&#12390;&#12356;&#12427;&#12467;&#12540;&#12489;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#20844;&#38283;&#12375;&#12394;&#12367;&#12394;&#12387;&#12383;&#12426;&#12289;
  &#27231;&#23494;&#20445;&#25345;&#22865;&#32004;&#12434;&#32080;&#12400;&#12379;&#12427;&#12371;&#12392;&#12391;&#12467;&#12540;&#12489;&#12398;&#20849;&#26377;&#12434;&#19981;&#21487;&#33021;&#12395;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#34892;&#12356;&#12414;&#12375;&#12383;&#12290;
</p><div class="sect3" title="&#24847;&#35672;&#30340;&#12394;&#25269;&#25239;"><div class="titlepage"><div><div><h4 class="title"><a name="history-conscious-resistance"></a>&#24847;&#35672;&#30340;&#12394;&#25269;&#25239;</h4></div></div></div><p>
  &#33258;&#30001;&#12395;&#12467;&#12540;&#12489;&#12434;&#20849;&#26377;&#12391;&#12365;&#12383;&#26178;&#20195;&#12364;&#32066;&#12431;&#12426;&#12434;&#21578;&#12370;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12371;&#12429;&#12289;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#65297;&#20154;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#24515;&#12398;&#20013;&#12391;&#12399;&#12381;&#12428;&#12395;&#21453;&#23550;&#12377;&#12427;&#27671;&#25345;&#12385;&#12364;&#22266;&#12414;&#12426;&#12388;&#12388;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  Richard Stallman &#12399;&#12289;&#12510;&#12469;&#12481;&#12517;&#12540;&#12475;&#12483;&#12484;&#24037;&#31185;&#22823;&#23398;&#12398;&#20154;&#24037;&#30693;&#33021; (AI) &#30740;&#31350;&#25152;&#12395; 1970
  &#24180;&#20195;&#12363;&#12425; 80 &#24180;&#20195;&#12398;&#21021;&#26399;&#12395;&#12363;&#12369;&#12390;&#22312;&#31821;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12385;&#12423;&#12358;&#12393;&#12381;&#12398;&#12371;&#12429;&#12364;&#12289;&#12467;&#12540;&#12489;&#12398;&#20849;&#26377;&#12364;&#30427;&#12435;&#12395;&#34892;&#12431;&#12428;&#12390;&#12356;&#12383;&#40644;&#37329;&#26178;&#20195;&#12391;&#12375;&#12383;&#12290;
  AI &#30740;&#12399;&#12300;&#12495;&#12483;&#12459;&#12540;&#20523;&#29702;&#12301;
  <sup>[<a name="idp286864" href="#ftn.idp286864" class="footnote">5</a>]</sup>
  &#12434;&#21069;&#38754;&#12395;&#25276;&#12375;&#20986;&#12375;&#12390;&#12362;&#12426;&#12289;&#20309;&#12363;&#12471;&#12473;&#12486;&#12512;&#12395;&#25913;&#33391;&#12434;&#21152;&#12360;&#12383;&#22580;&#21512;&#12399;
  &#12381;&#12428;&#12434;&#30342;&#12391;&#20849;&#26377;&#12377;&#12427;&#12398;&#12364;&#24403;&#28982;&#12398;&#12371;&#12392;&#12391;&#12354;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  Stallman &#12399;&#12289;&#24460;&#12395;&#27425;&#12398;&#12424;&#12358;&#12395;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        &#12431;&#12383;&#12375;&#12383;&#12385;&#12399;&#33258;&#20998;&#12383;&#12385;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12399;&#21628;&#12435;&#12391;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
        &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12435;&#12394;&#29992;&#35486;&#12399;&#23384;&#22312;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12363;&#12425;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#23455;&#38555;&#12399;&#12381;&#12358;&#12356;&#12358;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
        &#20182;&#12398;&#22823;&#23398;&#12420;&#20225;&#26989;&#12363;&#12425;&#12420;&#12387;&#12390;&#26469;&#12383;&#20154;&#12364;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#31227;&#26893;&#12375;&#12383;&#12426;&#20351;&#12387;&#12383;&#12426;&#12375;&#12383;&#12356;&#12392;&#12365;&#12399;&#12356;&#12388;&#12391;&#12418;&#12289;
        &#12431;&#12383;&#12375;&#12383;&#12385;&#12399;&#21916;&#12435;&#12391;&#35377;&#21487;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
        &#12418;&#12375;&#35504;&#12363;&#12364;&#29645;&#12375;&#12367;&#12390;&#38754;&#30333;&#12381;&#12358;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#12383;&#12425;&#12289;
        &#12356;&#12388;&#12391;&#12418;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#35211;&#12379;&#12390;&#12411;&#12375;&#12356;&#12392;&#38972;&#12435;&#12391;&#12418;&#12356;&#12356;&#12398;&#12391;&#12289;&#12381;&#12428;&#12434;&#35501;&#12435;&#12384;&#12426;&#12289;
        &#26360;&#12365;&#25563;&#12360;&#12383;&#12426;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20316;&#12427;&#12383;&#12417;&#12395;&#12381;&#12398;&#19968;&#37096;&#12434;&#21462;&#12426;&#20986;&#12375;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
      </em></span></p><p>
        (<span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.html" target="_top">http://www.gnu.org/gnu/thegnuproject.html</a></strong></span> &#12424;&#12426;&#24341;&#29992;&#12290;
        &#26085;&#26412;&#35486;&#35379;&#12399; <span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.ja.html" target="_top">http://www.gnu.org/gnu/thegnuproject.ja.html</a></strong></span>)
      </p></blockquote></div><p>
  Stallman &#12398;&#21608;&#12426;&#12395;&#12354;&#12387;&#12383;&#12456;&#12487;&#12531;&#12398;&#22290;&#12399;&#12289;1980 &#24180;&#20195;&#12395;&#20837;&#12387;&#12390;&#12377;&#12368;&#12395;&#23849;&#22730;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#21608;&#22258;&#12398;&#26989;&#30028;&#12391;&#36215;&#12371;&#12387;&#12390;&#12356;&#12383;&#12373;&#12414;&#12374;&#12414;&#12394;&#22793;&#21270;&#12398;&#24433;&#38911;&#12364;&#12289;AI &#30740;&#12395;&#12418;&#21040;&#36948;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#30740;&#31350;&#25152;&#12395;&#12356;&#12383;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#22810;&#12367;&#12399;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#20225;&#26989;&#12395;&#23601;&#32887;&#12375;&#12289;
  &#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#38283;&#30330;&#12395;&#24467;&#20107;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#30740;&#31350;&#25152;&#26178;&#20195;&#12392;&#20284;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#20170;&#12420;&#24444;&#12425;&#12399;&#29420;&#21344;&#30340;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12418;&#12392;&#12391;&#20685;&#12367;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12385;&#12423;&#12358;&#12393;&#21516;&#12376;&#12371;&#12429;&#12289;AI &#30740;&#12399;&#26032;&#12375;&#12356;&#12510;&#12471;&#12531;&#12434;&#23566;&#20837;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12371;&#12395;&#25645;&#36617;&#12373;&#12428;&#12390;&#12356;&#12383;&#12398;&#12399;&#29420;&#21344;&#30340;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#12375;&#12383;&#12290;
</p><p>Stallman &#12399;&#12289;&#20309;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#24195;&#12356;&#31684;&#22258;&#12391;&#30446;&#12398;&#24403;&#12383;&#12426;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        VAX &#12420; 68020 &#12398;&#12424;&#12358;&#12394;&#24403;&#26178;&#12398;&#20808;&#36914;&#30340;&#12394;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12399;
        &#23554;&#29992;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12539;&#12471;&#12473;&#12486;&#12512;&#12434;&#20633;&#12360;&#12390;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;
        &#12393;&#12428;&#12418;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#12388;&#12414;&#12426;&#12289;
        &#23455;&#34892;&#21487;&#33021;&#12394;&#12467;&#12500;&#12540;&#12434;&#20837;&#25163;&#12377;&#12427;&#12383;&#12417;&#12384;&#12369;&#12391;&#12418;&#38750;&#38283;&#31034;&#22865;&#32004;&#12434;&#32080;&#12406;&#24517;&#35201;&#12364;&#12354;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
      </em></span></p><p><span class="emphasis"><em>
        &#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;&#12388;&#12414;&#12426;&#26368;&#21021;&#12395;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12434;&#20351;&#12358;&#12392;&#12365;&#12395;&#12399;&#12289;
        &#21608;&#12426;&#12398;&#20154;&#12434;&#25163;&#21161;&#12369;&#12375;&#12394;&#12356;&#12392;&#32004;&#26463;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12375;&#12383;&#12290;
        &#21332;&#21147;&#12375;&#21512;&#12358;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12399;&#31105;&#12376;&#12425;&#12428;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
        &#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#25152;&#26377;&#32773;&#12395;&#12424;&#12387;&#12390;&#20316;&#12425;&#12428;&#12383;&#12523;&#12540;&#12523;&#12392;&#12399;
        &#12300;&#12418;&#12375;&#12362;&#21069;&#12364;&#38563;&#20154;&#12392;&#20998;&#12363;&#12385;&#21512;&#12358;&#12394;&#12425;&#12289;&#12362;&#21069;&#12399;&#33879;&#20316;&#27177;&#27861;&#12395;&#21453;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12290;
        &#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;&#12431;&#12428;&#12431;&#12428;&#12395;&#38972;&#12415;&#36796;&#12435;&#12391;&#20316;&#12387;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12384;&#12301;
        &#12392;&#12356;&#12358;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
      </em></span> </p></blockquote></div><p>
  &#24444;&#12399;&#12289;&#12371;&#12398;&#39080;&#28526;&#12395;&#23550;&#12375;&#12390;&#25269;&#25239;&#12377;&#12427;&#27770;&#24515;&#12434;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#35215;&#27169;&#12364;&#12363;&#12394;&#12426;&#32302;&#23567;&#12373;&#12428;&#12390;&#12375;&#12414;&#12387;&#12383; AI &#30740;&#12395;&#27531;&#12426;&#32154;&#12369;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12414;&#12383;&#26032;&#33288;&#20225;&#26989;&#12391;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#20181;&#20107;&#12434;&#24471;&#12427;
  (&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12383;&#12425;&#24444;&#12398;&#20316;&#26989;&#12398;&#25104;&#26524;&#12364;&#19968;&#20225;&#26989;&#12395;&#38281;&#12376;&#36796;&#12417;&#12425;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;)
  &#12431;&#12369;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#30740;&#31350;&#25152;&#12434;&#36864;&#32887;&#12375;&#12289;GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392; Free Software Foundation (FSF)
  &#12434;&#31435;&#12385;&#19978;&#12370;&#12414;&#12375;&#12383;&#12290;GNU
  <sup>[<a name="idp284592" href="#ftn.idp284592" class="footnote">6</a>]</sup>
  &#12398;&#30446;&#27161;&#12399;&#12289;&#23436;&#20840;&#12395;&#12501;&#12522;&#12540;&#12391;&#12458;&#12540;&#12503;&#12531;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12392;
  &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12518;&#12540;&#12470;&#12540;&#12364;&#12467;&#12540;&#12489;&#12434;&#12495;&#12483;&#12463;&#12375;&#12383;&#12426;&#20182;&#20154;&#12392;&#20849;&#26377;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399;&#27770;&#12375;&#12390;&#22952;&#12370;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#31777;&#21336;&#12395;&#35328;&#12358;&#12392;&#12289;&#24444;&#12399; AI &#30740;&#12395;&#12363;&#12388;&#12390;&#12354;&#12387;&#12383; (&#12381;&#12375;&#12390;&#20170;&#12399;&#30772;&#22730;&#12373;&#12428;&#12390;&#12375;&#12414;&#12387;&#12383;)
  &#31354;&#27671;&#12434;&#26032;&#12383;&#12395;&#20316;&#12426;&#30452;&#12381;&#12358;&#12392;&#12375;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#20170;&#24230;&#12399;&#19990;&#30028;&#20013;&#12434;&#24059;&#12365;&#36796;&#12416;&#35215;&#27169;&#12391;&#12290;
  &#12381;&#12375;&#12390; AI &#30740;&#12398;&#31354;&#27671;&#12364;&#30772;&#22730;&#12373;&#12428;&#12390;&#12375;&#12414;&#12387;&#12383;&#12398;&#12392;&#21516;&#12376;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#36215;&#12371;&#12373;&#12394;&#12356;&#12424;&#12358;&#12395;&#12290;
</p><p>
  &#26032;&#12375;&#12356;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#38283;&#30330;&#12398;&#12363;&#12383;&#12431;&#12425;&#12289;Stallman
  &#12399;&#26032;&#12375;&#12356;&#33879;&#20316;&#27177;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#32771;&#26696;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#33258;&#20998;&#12398;&#12467;&#12540;&#12489;&#12364;&#27704;&#20037;&#12395;&#33258;&#30001;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  GNU General Public License (GPL) &#12399;&#12289;&#27861;&#24459;&#12395;&#12362;&#12369;&#12427;&#35211;&#20107;&#12394;&#26580;&#34899;&#12391;&#12377;&#12290;
  &#12467;&#12540;&#12489;&#12398;&#35079;&#35069;&#12420;&#22793;&#26356;&#12395;&#12399;&#19968;&#20999;&#12398;&#21046;&#38480;&#12434;&#35373;&#12369;&#12414;&#12379;&#12435;&#12290;&#12467;&#12500;&#12540;&#12375;&#12383;&#12418;&#12398;&#12420;&#12381;&#12398;&#27966;&#29983;&#29289;
  (&#25913;&#36896;&#12375;&#12383;&#12418;&#12398;&#12394;&#12393;) &#12398;&#37197;&#24067;&#12399;&#21516;&#12376;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12418;&#12392;&#12391;&#34892;&#12431;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;
  &#12356;&#12363;&#12394;&#12427;&#21046;&#38480;&#12418;&#20184;&#21152;&#12373;&#12428;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#33879;&#20316;&#27177;&#27861;&#12434;&#21033;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#29401;&#12387;&#12390;&#12356;&#12427;&#21177;&#26524;&#12399;&#20253;&#32113;&#30340;&#12394;&#33879;&#20316;&#27177;&#12392;&#12399;&#27491;&#21453;&#23550;&#12398;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20877;&#37197;&#24067;&#12434;&#21046;&#38480;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#12383;&#12392;&#12360;&#20316;&#32773;&#12391;&#12354;&#12387;&#12390;&#12418;
  <span class="emphasis"><em>&#20877;&#37197;&#24067;&#12434;&#21046;&#38480;&#12377;&#12427;&#12371;&#12392;</em></span> &#33258;&#20307;&#12434;&#31105;&#27490;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
  Stallman &#12395;&#12392;&#12387;&#12390;&#12289;&#33258;&#20998;&#12398;&#12467;&#12540;&#12489;&#12434;&#21336;&#12395;&#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12395;&#12377;&#12427;&#12424;&#12426;&#12418;
  &#12381;&#12398;&#12411;&#12358;&#12364;&#22909;&#37117;&#21512;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12395;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#35504;&#12363;&#12364;&#12381;&#12428;&#12434;&#29420;&#21344;&#30340;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;
  (&#12354;&#12427;&#12356;&#12399;&#12289;&#12424;&#12426;&#35215;&#21046;&#12398;&#12422;&#12427;&#12356;&#21029;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12375;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;)
  &#12395;&#20351;&#29992;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12373;&#12428;&#12383;&#12392;&#12371;&#12429;&#12391;&#20803;&#12398;&#12467;&#12540;&#12489;&#12399;&#33258;&#30001;&#12394;&#12414;&#12414;&#12391;&#27531;&#12426;&#32154;&#12369;&#12427;&#12431;&#12369;&#12391;&#12377;&#12364;&#12289;
  &#12391;&#12418;&#32080;&#23616;&#12399; Stallman &#12398;&#21162;&#21147;&#12375;&#12383;&#32080;&#26524;&#12364;&#25973;&#38499;&#21942;
  &#8212;&#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#8212;&#12395;&#21033;&#30410;&#12434;&#12418;&#12383;&#12425;&#12377;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  GPL &#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#23550;&#12377;&#12427;&#20445;&#35703;&#20027;&#32681;&#12398;&#19968;&#24418;&#24335;&#12392;&#32771;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#33258;&#30001;&#12391;&#12394;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364; GPL &#12398;&#12467;&#12540;&#12489;&#12434;&#23436;&#20840;&#12395;&#22909;&#12365;&#12394;&#12424;&#12358;&#12395;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  GPL &#12392;&#12381;&#12398;&#20182;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12521;&#12452;&#12475;&#12531;&#12473;&#12392;&#12398;&#38306;&#20418;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  <a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#25968;&#22810;&#12367;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;
  (Stallman &#12398;&#24605;&#24819;&#12395;&#36059;&#21516;&#12377;&#12427;&#20154;&#12418;&#12356;&#12428;&#12400;&#12289;
  &#12383;&#12384;&#21336;&#12395;&#33258;&#30001;&#12395;&#12467;&#12540;&#12489;&#12434;&#20351;&#12356;&#12383;&#12356;&#12384;&#12369;&#12392;&#12356;&#12358;&#20154;&#12418;&#12356;&#12414;&#12375;&#12383;)
  &#12398;&#21332;&#21147;&#12434;&#24471;&#12390;&#12289;GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;
  OS &#12398;&#22522;&#24185;&#37096;&#21697;&#12434;&#32622;&#12365;&#25563;&#12360;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#27425;&#12293;&#12395;&#12522;&#12522;&#12540;&#12473;&#12375;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#24403;&#26178;&#12399;&#12377;&#12391;&#12395;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12420;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#27161;&#28310;&#21270;&#12373;&#12428;&#12390;&#12356;&#12383;&#12398;&#12391;&#12289;
  GNU &#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#33258;&#30001;&#12391;&#12394;&#12356;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12414;&#12383;&#23455;&#38555;&#12395;&#22810;&#12367;&#12398;&#20154;&#12364;&#12381;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#20013;&#12391;&#12418;&#26368;&#12418;&#25104;&#21151;&#12375;&#12383;&#12398;&#12364; GNU &#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479; (Emacs)
  &#12392; C &#12467;&#12531;&#12497;&#12452;&#12521; (GCC) &#12391;&#12375;&#12383;&#12290;&#12371;&#12428;&#12425;&#12399;&#12289;&#12381;&#12398;&#24605;&#24819;&#12395;&#20849;&#24863;&#12377;&#12427;&#20154;&#12383;&#12385;&#12384;&#12369;&#12391;&#12394;&#12367;
  &#21336;&#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12375;&#12390;&#20778;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#20351;&#12358;&#20154;&#12383;&#12385;&#12418;&#24341;&#12365;&#36796;&#12416;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  1990 &#24180;&#12372;&#12429;&#12395;&#12399;&#12289;GNU &#12399;&#33258;&#30001;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#12411;&#12412;&#23436;&#25104;&#12373;&#12379;&#12388;&#12388;&#12354;&#12426;&#12289;
  &#27531;&#12387;&#12390;&#12356;&#12383;&#12398;&#12399;&#12459;&#12540;&#12493;&#12523;&#12384;&#12369;&#12391;&#12375;&#12383;&#12290;&#12459;&#12540;&#12493;&#12523;&#12392;&#12399;&#12510;&#12471;&#12531;&#12434;&#23455;&#38555;&#12395;&#31435;&#12385;&#19978;&#12370;&#12427;&#37096;&#20998;&#12391;&#12354;&#12426;&#12289;
  &#12513;&#12514;&#12522;&#12420;&#12487;&#12451;&#12473;&#12463;&#31561;&#12398;&#12471;&#12473;&#12486;&#12512;&#12522;&#12477;&#12540;&#12473;&#12398;&#31649;&#29702;&#12434;&#34892;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#19981;&#24184;&#12395;&#12418;&#12289;GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#36984;&#25246;&#12375;&#12383;&#12459;&#12540;&#12493;&#12523;&#35373;&#35336;&#12399;
  &#24403;&#21021;&#20104;&#24819;&#12375;&#12390;&#12356;&#12383;&#12424;&#12426;&#12418;&#23455;&#35013;&#12364;&#22256;&#38627;&#12394;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#12459;&#12540;&#12493;&#12523;&#12398;&#20316;&#25104;&#12399;&#36933;&#12428;&#12395;&#36933;&#12428;&#12289;Free Software Foundation
  &#12364;&#23436;&#20840;&#12395;&#33258;&#30001;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#20844;&#38283;&#12377;&#12427;&#26085;&#12399;&#12394;&#12363;&#12394;&#12363;&#12420;&#12387;&#12390;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12371;&#12395;&#30331;&#22580;&#12375;&#12383;&#12398;&#12364; Linus Torvalds &#12391;&#12377;&#12290;
  &#24444;&#12399;&#12501;&#12451;&#12531;&#12521;&#12531;&#12489;&#20154;&#12398;&#23398;&#29983;&#12391;&#35336;&#31639;&#27231;&#31185;&#23398;&#12434;&#23554;&#25915;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#19990;&#30028;&#20013;&#12398;&#26377;&#24535;&#12392;&#21147;&#12434;&#12354;&#12431;&#12379;&#12289;&#12424;&#12426;&#20445;&#23432;&#30340;&#12394;&#35373;&#35336;&#12398;&#12501;&#12522;&#12540;&#12394;&#12459;&#12540;&#12493;&#12523;&#12434;&#23436;&#25104;&#12373;&#12379;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#12381;&#12428;&#12434; Linux &#12392;&#21517;&#12389;&#12369;&#12414;&#12375;&#12383;&#12290;Linux &#12434;&#26082;&#23384;&#12398; GNU &#12503;&#12525;&#12464;&#12521;&#12512;&#32676;&#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12391;&#12289;
  &#23436;&#20840;&#12395;&#33258;&#30001;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12371;&#12395;&#12365;&#12390;&#21021;&#12417;&#12390;&#12289;&#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#19968;&#20999;&#20351;&#29992;&#12379;&#12378;&#12395;
  &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12434;&#31435;&#12385;&#19978;&#12370;&#12390;&#20316;&#26989;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  <sup>[<a name="idp315600" href="#ftn.idp315600" class="footnote">7</a>]</sup>
</p><p>
  &#12371;&#12398;&#26032;&#12375;&#12356;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#21205;&#20316;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22810;&#12367;&#12399;&#12289;
  GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20197;&#22806;&#12364;&#20316;&#25104;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;
  &#12501;&#12522;&#12540;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#20316;&#12429;&#12358;&#12392;&#12375;&#12390;&#12356;&#12383;&#12398;&#12399; GNU &#12384;&#12369;&#12391;&#12399;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;
  (&#12383;&#12392;&#12360;&#12400;&#12289;&#24460;&#12395; NetBSD &#12420; FreeBSD &#12392;&#12394;&#12427;&#12467;&#12540;&#12489;&#12399;&#12371;&#12398;&#26178;&#28857;&#12391;&#12377;&#12391;&#12395;&#38283;&#30330;&#12364;&#36914;&#12417;&#12425;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;)&#12290;
  Free Software Foundation &#12398;&#23384;&#22312;&#24847;&#32681;&#12399;&#12289;
  &#24444;&#12425;&#12364;&#26360;&#12356;&#12383;&#12467;&#12540;&#12489;&#12384;&#12369;&#12395;&#12354;&#12427;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12425;&#12399;&#25919;&#27835;&#30340;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35328;&#33865;&#24039;&#12415;&#12395;&#20253;&#12360;&#12414;&#12375;&#12383;&#12290;
  &#21033;&#20415;&#24615;&#12391;&#12399;&#12394;&#12367;&#12289;&#20449;&#26465;&#12392;&#12375;&#12390;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#35486;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#25919;&#27835;&#30340;&#12394;&#38754;&#12434;&#27671;&#12395;&#12379;&#12374;&#12427;&#12434;&#24471;&#12394;&#12356;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  FSF &#12392;&#24847;&#35211;&#12364;&#30064;&#12394;&#12427;&#20154;&#12391;&#12373;&#12360;&#12289;&#31435;&#22580;&#12364;&#36949;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#26126;&#30906;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
  &#25919;&#27835;&#30340;&#12394;&#21839;&#38988;&#12395;&#36275;&#12434;&#31361;&#12387;&#36796;&#12414;&#12374;&#12427;&#12434;&#24471;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  FSF &#12399;&#12289;&#24444;&#12425;&#12398;&#12467;&#12540;&#12489;&#12395; GPL &#12420;&#12381;&#12398;&#20182;&#12398;&#12486;&#12461;&#12473;&#12488;&#12434;&#21516;&#26801;&#12377;&#12427;&#12371;&#12392;&#12391;&#24444;&#12425;&#12398;&#24605;&#24819;&#12434;&#21177;&#29575;&#30340;&#12395;&#24195;&#12417;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12398;&#26360;&#12356;&#12383;&#12467;&#12540;&#12489;&#12364;&#24195;&#12414;&#12428;&#12400;&#24195;&#12414;&#12427;&#12411;&#12393;&#12289;
  &#24444;&#12425;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12418;&#24195;&#12414;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
</p></div><div class="sect3" title="&#28961;&#24847;&#35672;&#12394;&#25269;&#25239;"><div class="titlepage"><div><div><h4 class="title"><a name="history-accidental-resistance"></a>&#28961;&#24847;&#35672;&#12394;&#25269;&#25239;</h4></div></div></div><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#12398;&#21021;&#26399;&#12395;&#12399;&#12289;&#20182;&#12395;&#12418;&#22810;&#12367;&#12398;&#36939;&#21205;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12289;Stallman &#12398; GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#12395;&#12452;&#12487;&#12458;&#12525;&#12462;&#12540;&#12434;&#21069;&#38754;&#12395;&#25276;&#12375;&#20986;&#12375;&#12383;&#12418;&#12398;&#12399;
  &#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#12381;&#12398;&#20013;&#12391;&#12418;&#26368;&#12418;&#37325;&#35201;&#12394;&#12418;&#12398;&#12398;&#12402;&#12392;&#12388;&#12364;
  <em class="firstterm">Berkeley Software Distribution</em> (<em class="firstterm">BSD</em>)
  &#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12428;&#12399;&#12289;&#24464;&#12293;&#12395; Unix &#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;
  &#8212;1970 &#24180;&#20195;&#12398;&#32066;&#12431;&#12426;&#38915;&#12414;&#12391; AT&amp;T &#12395;&#12362;&#12369;&#12427;&#21322;&#12400;&#29420;&#21344;&#30340;&#12394;&#30740;&#31350;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12375;&#12383;&#8212;
  &#12434;&#20877;&#23455;&#35013;&#12375;&#12424;&#12358;&#12392;&#12356;&#12358;&#21205;&#12365;&#12391;&#12289;&#12459;&#12522;&#12501;&#12457;&#12523;&#12491;&#12450;&#22823;&#23398;&#12496;&#12540;&#12463;&#12524;&#12540;&#26657;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#12399;&#12376;&#12417;&#12414;&#12375;&#12383;&#12290;
  BSD &#12464;&#12523;&#12540;&#12503;&#12399;&#12300;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#21516;&#22763;&#12362;&#20114;&#12356;&#12395;&#25163;&#12434;&#21462;&#12426;&#21512;&#12387;&#12390;&#22243;&#32080;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#25919;&#27835;&#30340;&#12394;&#22768;&#26126;&#12399;&#20986;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#24444;&#12425;&#12398;&#25165;&#33021;&#12392;&#29105;&#24847;&#12391;&#12418;&#12387;&#12390;&#12381;&#12398;&#12450;&#12452;&#12487;&#12450;&#12434;&#23455;&#29694;&#12373;&#12379;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#22580;&#25152;&#12395;&#25955;&#12425;&#12400;&#12387;&#12383;&#38283;&#30330;&#32773;&#12383;&#12385;&#12364;&#21332;&#21147;&#12375;&#12289;Unix
  &#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12420;&#12467;&#12540;&#12489;&#12521;&#12452;&#12502;&#12521;&#12522;&#12289;
  &#12381;&#12375;&#12390;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12459;&#12540;&#12493;&#12523;&#33258;&#20307;&#12395;&#12388;&#12356;&#12390;&#12418;&#65297;&#12363;&#12425;&#26360;&#12365;&#30452;&#12375;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12395;&#12424;&#12427;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  BSD &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12452;&#12487;&#12458;&#12525;&#12462;&#12540;&#12434;&#21069;&#38754;&#12395;&#25276;&#12375;&#20986;&#12373;&#12394;&#12356;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;
  &#26368;&#12418;&#26377;&#21517;&#12394;&#20363;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;
  &#12381;&#12398;&#24460;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12395;&#27531;&#12387;&#12390;&#27963;&#36493;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#22810;&#12367;&#12398;&#38283;&#30330;&#32773;&#12398;&#12383;&#12417;&#12398;&#35347;&#32244;&#12398;&#22580;&#12392;&#12375;&#12390;&#12398;&#24441;&#21106;&#12418;&#26524;&#12383;&#12375;&#12414;&#12375;&#12383;&#12290;
</p><p>
  &#21029;&#12398;&#30427;&#12435;&#12394;&#20849;&#21516;&#38283;&#30330;&#12398;&#20363;&#12392;&#12375;&#12390;&#12399; <em class="firstterm">X
  Window System</em> &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;
  &#12501;&#12522;&#12540;&#12391;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#36234;&#12375;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12464;&#12521;&#12501;&#12451;&#12483;&#12463;&#29872;&#22659;&#12391;&#12289;
  1980 &#24180;&#20195;&#21322;&#12400;&#12395; MIT &#12392;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12505;&#12531;&#12480;&#12540;&#12364;&#20849;&#21516;&#12391;&#38283;&#30330;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12505;&#12531;&#12480;&#12540;&#20596;&#12418;&#12289;&#39015;&#23458;&#12395;&#21516;&#12376;&#12424;&#12358;&#12394;&#12454;&#12451;&#12531;&#12489;&#12454;&#12471;&#12473;&#12486;&#12512;&#12434;&#25552;&#20379;&#12375;&#12383;&#12364;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#23550;&#31435;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;X &#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#12399;
  &#12501;&#12522;&#12540;&#12394;&#12467;&#12450;&#12398;&#12467;&#12540;&#12489;&#19978;&#12395;&#29420;&#21344;&#30340;&#12394;&#25313;&#24373;&#12434;&#26045;&#12377;&#12371;&#12392;&#12434;&#24847;&#22259;&#30340;&#12395;&#35377;&#21487;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12467;&#12531;&#12477;&#12540;&#12471;&#12450;&#12512;&#12398;&#21508;&#12513;&#12531;&#12496;&#12540;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398; X &#12434;&#12381;&#12428;&#12382;&#12428;&#25313;&#24373;&#12375;&#12289;
  &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#31478;&#21512;&#12377;&#12427;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#23550;&#12377;&#12427;&#20778;&#20301;&#12434;&#30906;&#20445;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  X &#12454;&#12451;&#12531;&#12489;&#12454;
  <sup>[<a name="idp283360" href="#ftn.idp283360" class="footnote">8</a>]</sup>
  &#33258;&#20307;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12377;&#12364;&#12289;
  &#12381;&#12398;&#20027;&#12394;&#30446;&#30340;&#12399;&#12289;&#12356;&#12431;&#12400;&#31478;&#20105;&#12377;&#12427;&#21442;&#21152;&#20225;&#26989;&#38291;&#12398;&#35430;&#21512;&#12398;&#22580;&#12434;&#12394;&#12425;&#12377;&#12371;&#12392;&#12391;&#12354;&#12426;&#12289;
  &#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#25903;&#37197;&#12434;&#32066;&#12431;&#12425;&#12379;&#12427;&#12392;&#12356;&#12387;&#12383;&#24847;&#22259;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#20363;&#12434;&#25369;&#12370;&#12414;&#12375;&#12423;&#12358;&#12290;GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25968;&#24180;&#21069;&#12395;&#38283;&#30330;&#12364;&#22987;&#12414;&#12387;&#12383; TeX
  &#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;Donald Knuth &#12395;&#12424;&#12427;&#12501;&#12522;&#12540;&#12391;&#39640;&#21697;&#36074;&#12394;&#32068;&#29256;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#24444;&#12399;&#12289;&#35504;&#12391;&#12418;&#12467;&#12540;&#12489;&#12434;&#25913;&#22793;&#12375;&#12390;&#20877;&#37197;&#24067;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12418;&#12392;&#12391; Tex &#12434;&#20844;&#38283;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12383;&#12384;&#12375;&#12289;&#25913;&#22793;&#12375;&#12383;&#12467;&#12540;&#12489;&#12434;&#20877;&#37197;&#24067;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;&#38750;&#24120;&#12395;&#21427;&#12375;&#12356;&#20114;&#25563;&#24615;&#12486;&#12473;&#12488;&#12434;&#12463;&#12522;&#12450;&#12375;&#12394;&#12356;&#38480;&#12426;
  "TeX" &#12398;&#21517;&#12434;&#20351;&#12387;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#21046;&#38480;&#12434;&#12388;&#12369;&#12414;&#12375;&#12383;
  (&#12371;&#12428;&#12399;&#12289;&#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#12362;&#12369;&#12427; "&#21830;&#27161;&#20445;&#35703;" &#12398;&#20363;&#12391;&#12377;&#12290;&#35443;&#32048;&#12399; <a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a>
  &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;)&#12290;Knuth &#12399;&#12289;&#33258;&#30001;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12363;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12363;&#12392;&#12356;&#12387;&#12383;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;
  &#29305;&#12395;&#31435;&#22580;&#12434;&#34920;&#26126;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#24444;&#12399;&#12289;&#21336;&#12395;
  <span class="emphasis"><em>&#30495;&#12398;</em></span> &#30446;&#30340; (&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12395;&#38306;&#12377;&#12427;&#26360;&#31821;&#12398;&#20986;&#29256;)
  &#12434;&#36948;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#12414;&#12392;&#12418;&#12394;&#32068;&#29256;&#12471;&#12473;&#12486;&#12512;&#12364;&#12411;&#12375;&#12363;&#12387;&#12383;&#12384;&#12369;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#24444;&#12395;&#12392;&#12387;&#12390;&#12289;&#33258;&#20998;&#12398;&#20316;&#12387;&#12383;&#12471;&#12473;&#12486;&#12512;&#12434;&#19968;&#33324;&#12395;&#20844;&#38283;&#12375;&#12394;&#12356;&#29702;&#30001;&#12399;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p></div><p>
  &#12377;&#12409;&#12390;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12420;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#12371;&#12371;&#12391;&#25369;&#12370;&#12427;&#12371;&#12392;&#12399;&#12375;&#12414;&#12379;&#12435;&#12364;&#12289;
  1980 &#24180;&#20195;&#24460;&#21322;&#12395;&#12399;&#12373;&#12414;&#12374;&#12414;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12373;&#12414;&#12374;&#12414;&#12394;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#23384;&#22312;&#12375;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;
  &#12371;&#12371;&#12414;&#12391;&#12398;&#20363;&#12391;&#12418;&#21313;&#20998;&#12395;&#20253;&#12431;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20844;&#38283;&#12377;&#12427;&#21205;&#27231;&#12395;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#12418;&#12398;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  GNU GPL &#12434;&#36984;&#25246;&#12375;&#12383;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  GNU &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12411;&#12393;&#12395;&#12399;&#12452;&#12487;&#12458;&#12525;&#12462;&#12540;&#12434;&#25276;&#12375;&#20986;&#12375;&#12390;&#12356;&#12394;&#12356;&#20154;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12434;&#27005;&#12375;&#12435;&#12391;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12398;&#22810;&#12367;&#12399;&#12289;&#29305;&#12395;&#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25973;&#35222;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#19990;&#12363;&#12425;&#12300;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22258;&#12356;&#36796;&#12415; (software hoarding)&#12301;(Stallman
  &#12364;&#12501;&#12522;&#12540;&#12391;&#12394;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25351;&#12377;&#12392;&#12365;&#12395;&#20351;&#29992;&#12377;&#12427;&#29992;&#35486;) &#12434;&#12394;&#12367;&#12377;&#12435;&#12384;&#65281;
  &#12392;&#12356;&#12358;&#36947;&#24499;&#30340;&#12394;&#34909;&#21205;&#12395;&#12363;&#12425;&#12428;&#12427;&#20154;&#12418;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#21336;&#12395;&#25216;&#34899;&#30340;&#12394;&#33288;&#21619;&#12363;&#12425;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#38283;&#30330;&#12375;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12414;&#12383;&#12289;&#21516;&#12376;&#36259;&#21619;&#12434;&#25345;&#12388;&#20154;&#12392;&#20849;&#21516;&#20316;&#26989;&#12434;&#12377;&#12427;&#12398;&#12364;&#27005;&#12375;&#12356;&#12392;&#12363;&#12289;
  &#26377;&#21517;&#12395;&#12394;&#12426;&#12383;&#12356;&#12392;&#12363;&#12356;&#12358;&#29702;&#30001;&#12398;&#20154;&#12418;&#12356;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12424;&#12358;&#12395;&#26412;&#36074;&#30340;&#12395;&#30064;&#12394;&#12427;&#21205;&#27231;&#12434;&#25345;&#12387;&#12383;&#20154;&#12383;&#12385;&#12364;
  &#12362;&#20114;&#12356;&#12395;&#24746;&#24433;&#38911;&#12434;&#21450;&#12412;&#12375;&#12354;&#12358;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#23567;&#35500;&#12420;&#32117;&#30011;&#12392;&#30064;&#12394;&#12426;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12399;&#26368;&#20302;&#38480;&#12398;&#22522;&#28310;
  (&#12365;&#12385;&#12435;&#12392;&#21205;&#12367;&#12371;&#12392;&#12289;&#12496;&#12464;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12371;&#12392;) &#12364;&#12354;&#12387;&#12383;&#12371;&#12392;&#12418;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21442;&#21152;&#32773;&#12364;&#20849;&#21516;&#12391;&#20316;&#26989;&#12377;&#12427;&#38555;&#12395;
  &#25216;&#34899;&#38754;&#20197;&#22806;&#12398;&#36969;&#24615;&#12434;&#12354;&#12414;&#12426;&#27671;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
</p><p>
  &#38283;&#30330;&#32773;&#12383;&#12385;&#12364;&#25163;&#12434;&#21462;&#12426;&#21512;&#12358;&#29702;&#30001;&#12364;&#12418;&#12358;&#12402;&#12392;&#12388;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#30028;&#12364;&#38750;&#24120;&#12395;&#39640;&#21697;&#36074;&#12394;&#12467;&#12540;&#12489;&#12434;&#29983;&#12415;&#20986;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12387;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#26178;&#12395;&#12399;&#12289;&#12501;&#12522;&#12540;&#12391;&#12394;&#12356;&#21516;&#31561;&#35069;&#21697;&#12424;&#12426;&#26126;&#12425;&#12363;&#12395;&#25216;&#34899;&#38754;&#12391;&#19978;&#22238;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#21516;&#31561;&#12398;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#22810;&#12367;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;&#24403;&#28982;&#12289;
  &#12371;&#12428;&#12399;&#20302;&#12467;&#12473;&#12488;&#12391;&#20837;&#25163;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#24605;&#24819;&#12395;&#21427;&#23494;&#12395;&#24467;&#12358;&#12383;&#12417;&#12395;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12356;&#12358;&#20154;&#12399;
  &#12354;&#12414;&#12426;&#22810;&#12367;&#12394;&#12363;&#12387;&#12383;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#22810;&#12367;&#12398;&#20154;&#12383;&#12385;&#12399;&#12289;
  &#21336;&#12395;&#12381;&#12385;&#12425;&#12398;&#12411;&#12358;&#12364;&#39640;&#24615;&#33021;&#12384;&#12363;&#12425;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#36984;&#25246;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12375;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12358;&#20154;&#12383;&#12385;&#12398;&#20013;&#12395;&#12399;&#12289;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20445;&#23432;&#12420;&#25913;&#21892;&#12398;&#12383;&#12417;&#12395;&#26178;&#38291;&#12392;&#21147;&#12434;&#36024;&#12375;&#12390;&#12367;&#12428;&#12427;&#20154;&#12364;&#24120;&#12395;&#12354;&#12427;&#31243;&#24230;&#20197;&#19978;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12300;&#12424;&#12356;&#12467;&#12540;&#12489;&#12434;&#29983;&#12415;&#20986;&#12377;&#12301;&#12392;&#12356;&#12358;&#20670;&#21521;&#12399;&#12414;&#12384;&#26222;&#36941;&#30340;&#12394;&#12418;&#12398;&#12392;&#12399;&#12394;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;
  &#24464;&#12293;&#12395;&#19990;&#30028;&#20013;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#21516;&#27096;&#12398;&#29694;&#35937;&#12364;&#35211;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#24375;&#12367;&#20381;&#23384;&#12377;&#12427;&#29987;&#26989;&#30028;&#12391;&#12418;&#12289;&#24464;&#12293;&#12395;&#12381;&#12398;&#12371;&#12392;&#12395;&#27671;&#12389;&#12365;&#22987;&#12417;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12398;&#22810;&#12367;&#12399;&#12289;&#12377;&#12391;&#12395;&#26085;&#24120;&#12398;&#20316;&#26989;&#12395;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#12381;&#12428;&#12395;&#27671;&#12389;&#12356;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383; (&#19978;&#32026;&#31649;&#29702;&#32887;&#12364;
  IT &#37096;&#38272;&#12398;&#21205;&#12365;&#12434;&#24120;&#12395;&#25226;&#25569;&#12375;&#12390;&#12356;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;)&#12290;
  &#20225;&#26989;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;
  &#12424;&#12426;&#31309;&#26997;&#30340;&#12289;&#20844;&#20849;&#30340;&#12394;&#24441;&#21106;&#12434;&#25285;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12398;&#12383;&#12417;&#12395;&#26178;&#38291;&#12420;&#35373;&#20633;&#12434;&#25552;&#20379;&#12375;&#12383;&#12426;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12418;&#12387;&#12392;&#30452;&#25509;&#30340;&#12395;&#36039;&#37329;&#12434;&#25552;&#20379;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12358;&#12414;&#12367;&#12356;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#25237;&#36039;&#12364;&#20309;&#20493;&#12395;&#12418;&#12394;&#12387;&#12390;&#36820;&#12387;&#12390;&#12367;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12501;&#12523;&#12479;&#12452;&#12512;&#12391;&#23554;&#24565;&#12375;&#12390;&#12356;&#12427;&#19968;&#37096;&#12398;&#23554;&#38272;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12395;&#23550;&#12375;&#12390;&#36039;&#37329;&#12434;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307; (&#28961;&#20767;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12420;&#20182;&#12398;&#20225;&#26989;&#12395;&#23646;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12394;&#12393;)
  &#12398;&#27963;&#21205;&#12398;&#21033;&#30410;&#12434;&#24471;&#12425;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;"><div class="titlepage"><div><div><h3 class="title"><a name="free-vs-open-source"></a>&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;</h3></div></div></div><p>
  &#29987;&#26989;&#30028;&#12364;&#12414;&#12377;&#12414;&#12377;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#27880;&#30446;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12383;&#12385;&#12399;&#12414;&#12383;&#26032;&#12383;&#12394;&#21839;&#38988;&#12395;&#30452;&#38754;&#12377;&#12427;&#12371;&#12392;&#12392;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12402;&#12392;&#12388;&#12399;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12398;&#24847;&#21619;&#12395;&#12388;&#12356;&#12390;&#12391;&#12377;&#12290;
  &#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#32862;&#12356;&#12390;&#12289;&#22810;&#12367;&#12398;&#20154;&#12364;&#12381;&#12428;&#12434;&#21336;&#12394;&#12427;
  &#12300;&#28961;&#26009;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12356;&#12358;&#12424;&#12358;&#12395;&#21208;&#36949;&#12356;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#30906;&#12363;&#12395;&#12377;&#12409;&#12390;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#28961;&#26009;&#12391;&#12377;&#12364;&#12289;
  <sup>[<a name="idp230544" href="#ftn.idp230544" class="footnote">9</a>]</sup>
  &#28961;&#26009;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12377;&#12409;&#12390;&#12501;&#12522;&#12540; (&#33258;&#30001;) &#12391;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;1990 &#24180;&#20195;&#12398;&#12502;&#12521;&#12454;&#12470;&#25126;&#20105;&#12398;&#38555;&#12395;
  Netscape &#12392; Microsoft &#12399;&#12392;&#12418;&#12395;&#12502;&#12521;&#12454;&#12470;&#12434;&#28961;&#20767;&#12391;&#12400;&#12425;&#12414;&#12365;&#12289;
  &#24066;&#22580;&#12398;&#12471;&#12455;&#12450;&#12434;&#29554;&#24471;&#12375;&#12424;&#12358;&#12392;&#36493;&#36215;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12398;&#12393;&#12385;&#12425;&#12398;&#12502;&#12521;&#12454;&#12470;&#12418;&#12289;"&#33258;&#30001;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;" &#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12398;&#12501;&#12522;&#12540;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12363;&#12387;&#12383;&#12426;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12383;&#12392;&#12360;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12383;&#12392;&#12375;&#12390;&#12418;&#12381;&#12428;&#12434;&#25913;&#36896;&#12375;&#12390;&#20877;&#37197;&#24067;&#12377;&#12427;&#27177;&#21033;&#12364;&#12394;&#12363;&#12387;&#12383;&#12426;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  <sup>[<a name="idp338080" href="#ftn.idp338080" class="footnote">10</a>]</sup>
  &#12391;&#12365;&#12427;&#12371;&#12392;&#12392;&#12356;&#12360;&#12400;&#12289;&#23455;&#34892;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#21205;&#12363;&#12377;&#12371;&#12392;&#12384;&#12369;&#12391;&#12375;&#12383;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12502;&#12521;&#12454;&#12470;&#12395;&#12399;&#12289;&#24215;&#38957;&#12391;&#31665;&#22770;&#12426;&#12373;&#12428;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#20197;&#19978;&#12398;&#33258;&#30001;&#12394;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#21336;&#12395;&#20385;&#26684;&#12364;&#23433;&#12363;&#12387;&#12383;&#12384;&#12369;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12364;&#28151;&#20081;&#12434;&#25307;&#12367;&#21407;&#22240;&#12399;&#12289;
  &#19981;&#24184;&#12395;&#12418;&#12371;&#12398;&#33521;&#21336;&#35486;&#12364;&#12356;&#12429;&#12356;&#12429;&#12394;&#24847;&#21619;&#12434;&#25345;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#20182;&#12398;&#22823;&#21322;&#12398;&#35328;&#35486;&#12391;&#12399;&#12289;&#20385;&#26684;&#12364;&#23433;&#12356;&#12371;&#12392;&#12392;&#33258;&#30001;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#31777;&#21336;&#12395;&#21306;&#21029;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;
  (&#12383;&#12392;&#12360;&#12400;&#12525;&#12510;&#12531;&#12473;&#35576;&#35486;&#12434;&#35441;&#12377;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399; <span class="emphasis"><em>gratis</em></span>
  &#12392; <span class="emphasis"><em>libre</em></span> &#12398;&#36949;&#12356;&#12399;&#26126;&#30906;&#12391;&#12377;)&#12290;
  &#12375;&#12363;&#12375;&#12289;&#33521;&#35486;&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12391;&#12398;&#27161;&#28310;&#35328;&#35486;&#12392;&#12375;&#12390;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#29694;&#29366;&#12391;&#12399;&#12289;
  &#33521;&#35486;&#12398;&#21839;&#38988;&#12399;&#12289;&#12354;&#12427;&#24847;&#21619;&#12391;&#12399;&#12377;&#12409;&#12390;&#12398;&#20154;&#12383;&#12385;&#12398;&#21839;&#38988;&#12391;&#12354;&#12427;&#12392;&#12418;&#12356;&#12360;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12398;&#24847;&#21619;&#12398;&#23653;&#12365;&#36949;&#12360;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#24195;&#12414;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12398;&#12391;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#32773;&#12399;&#27770;&#12414;&#12426;&#25991;&#21477;&#12434;&#12388;&#12367;&#12426;&#20986;&#12375;&#12414;&#12375;&#12383;&#12290;
  "<span class="emphasis"><em>&#12501;&#12522;&#12540; (free)</em></span> &#12392;&#12399;&#12289;<span class="emphasis"><em>&#33258;&#30001; (freedom)</em></span>
  &#12398;&#12371;&#12392;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;<span class="emphasis"><em>&#12501;&#12522;&#12540;&#12473;&#12500;&#12540;&#12481; (&#35328;&#35542;&#12398;&#33258;&#30001;)</em></span>
  &#12392;&#12356;&#12358;&#12392;&#12365;&#12398;&#12300;&#12501;&#12522;&#12540;&#12301;&#12391;&#12354;&#12426;&#12289;<span class="emphasis"><em>&#12501;&#12522;&#12540;&#12499;&#12540;&#12523; (&#28961;&#26009;&#12398;&#12499;&#12540;&#12523;)</em></span>
  &#12392;&#12356;&#12358;&#12392;&#12365;&#12398;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12399;&#36949;&#12356;&#12414;&#12377;&#12290;"
  &#12375;&#12363;&#12375;&#12289;&#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#12371;&#12428;&#12434;&#35500;&#26126;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12399;&#22823;&#22793;&#12391;&#12377;&#12290;
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#12289;&#12371;&#12398;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#12354;&#12356;&#12414;&#12356;&#12394;&#21336;&#35486;&#12398;&#12379;&#12356;&#12391;
  &#33258;&#20998;&#12383;&#12385;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#19990;&#38291;&#12395;&#27491;&#12375;&#12367;&#29702;&#35299;&#12373;&#12428;&#12394;&#12356;&#12392;&#24863;&#12376;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#21839;&#38988;&#12399;&#12418;&#12387;&#12392;&#28145;&#12356;&#12392;&#12371;&#12429;&#12395;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12300;&#33258;&#30001;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12395;&#12399;&#36947;&#24499;&#30340;&#12394;&#24847;&#21619;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#33258;&#30001;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#30446;&#30340;&#12394;&#12398;&#12394;&#12425;&#12400;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12424;&#12426;&#12424;&#12356;&#12418;&#12398;&#12395;&#12394;&#12429;&#12358;&#12364;
  &#29305;&#23450;&#12398;&#29366;&#27841;&#12395;&#12362;&#12356;&#12390;&#29305;&#23450;&#12398;&#12499;&#12472;&#12493;&#12473;&#12391;&#26377;&#30410;&#12395;&#12394;&#12429;&#12358;&#12364;&#12289;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12399;&#12393;&#12358;&#12391;&#12418;&#12424;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#21336;&#12395;&#12381;&#12398;&#21205;&#27231;&#12395;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12424;&#12356;&#21103;&#20316;&#29992;&#12364;&#12354;&#12387;&#12383;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#24515;&#24213;&#12399;&#25216;&#34899;&#30340;&#12391;&#12418;&#21830;&#26989;&#30340;&#12391;&#12418;&#12394;&#12367;&#12289;&#36947;&#24499;&#30340;&#12394;&#21205;&#27231;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12373;&#12425;&#12395;&#12300;&#33258;&#30001;&#12392;&#12356;&#12358;&#24847;&#21619;&#12398;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#31435;&#12385;&#20301;&#32622;&#12399;&#12289;
  &#12501;&#12522;&#12540;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12469;&#12509;&#12540;&#12488;&#12418;&#12375;&#12383;&#12356;&#12364;&#21029;&#12398;&#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#21830;&#22770;&#12418;&#32154;&#34892;&#12375;&#12383;&#12356;
  &#12392;&#12356;&#12358;&#20225;&#26989;&#12395;&#12392;&#12387;&#12390;&#12399;&#12385;&#12423;&#12387;&#12392;&#19981;&#20415;&#12394;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
</p><p>
  &#12371;&#12398;&#12472;&#12524;&#12531;&#12510;&#12399;&#12289;&#12377;&#12391;&#12395;&#33258;&#24049;&#21930;&#22833;&#29366;&#24907;&#12395;&#12394;&#12387;&#12390;&#12356;&#12383;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#31361;&#12365;&#21050;&#12373;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#23455;&#38555;&#12395;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12383;&#12385;&#12399;&#12289;
  &#20206;&#12395;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#20840;&#20307;&#12392;&#12375;&#12390;&#12398;&#30446;&#27161;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;
  &#12381;&#12398;&#12383;&#12417;&#12395;&#19968;&#33268;&#22243;&#32080;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#24444;&#12425;&#12398;&#32771;&#12360;&#12395;&#12399;&#20001;&#26997;&#31471;&#12398;&#12418;&#12398;&#12364;&#12354;&#12387;&#12383;&#12392;&#35328;&#12387;&#12390;&#12375;&#12414;&#12358;&#12398;&#12418;&#12385;&#12423;&#12387;&#12392;&#36949;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#39080;&#12395;&#35328;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#12414;&#12427;&#12391;&#24444;&#12425;&#12398;&#36949;&#12356;&#12364;&#21336;&#19968;&#12398;&#22522;&#28310;&#12384;&#12369;&#12395;&#12418;&#12392;&#12389;&#12367;&#12418;&#12398;&#12384;&#12392;&#21208;&#36949;&#12356;&#12373;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20123;&#32048;&#12394;&#36949;&#12356;&#12434;&#12392;&#12426;&#12354;&#12360;&#12378;&#28961;&#35222;&#12377;&#12427;&#12394;&#12425;&#12289;
  &#24444;&#12425;&#12398;&#32771;&#12360;&#26041;&#12399;&#22823;&#12365;&#12367;&#65298;&#31278;&#39006;&#12395;&#20998;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#19968;&#26041;&#12398;&#12464;&#12523;&#12540;&#12503;&#12399; Stallman &#12398;&#32771;&#12360;&#26041;&#12395;&#20849;&#40180;&#12377;&#12427;&#20154;&#12383;&#12385;&#12391;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#33258;&#30001;&#12395;&#20849;&#26377;&#12391;&#12365;&#12390;&#33258;&#30001;&#12395;&#25913;&#22793;&#12391;&#12365;&#12427;&#12371;&#12392;&#12371;&#12381;&#12364;&#26368;&#12418;&#37325;&#35201;&#12391;&#12289;
  &#33258;&#30001;&#12395;&#12388;&#12356;&#12390;&#35486;&#12427;&#12371;&#12392;&#12434;&#12420;&#12417;&#12383;&#30636;&#38291;&#12395;&#26412;&#36074;&#30340;&#12394;&#21839;&#38988;&#12363;&#12425;&#38626;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12358;&#19968;&#26041;&#12398;&#12464;&#12523;&#12540;&#12503;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12381;&#12398;&#12418;&#12398;&#12371;&#12381;&#12364;&#26368;&#12418;&#37325;&#35201;&#12391;&#12354;&#12427;&#12392;&#32771;&#12360;&#12390;&#12362;&#12426;&#12289;
  &#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25973;&#35222;&#12377;&#12427;&#12424;&#12358;&#12394;&#32771;&#12360;&#26041;&#12399;&#22909;&#12415;&#12414;&#12379;&#12435;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#20154;&#12364;&#12381;&#12358;&#12384;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#20013;&#12395;&#12399;&#12289;
  &#20316;&#32773; (&#12354;&#12427;&#12356;&#12399;&#38599;&#29992;&#20027;) &#12399;&#20877;&#37197;&#24067;&#27177;&#12434;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#20877;&#37197;&#24067;&#27177;&#12434;&#32771;&#12360;&#12427;&#38555;&#12395;&#12289;&#36947;&#24499;&#30340;&#12394;&#35222;&#28857;&#12399;&#19981;&#35201;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#38263;&#12356;&#38291;&#12289;&#12371;&#12428;&#12425;&#12398;&#36949;&#12356;&#12434;&#12365;&#12385;&#12435;&#12392;&#35519;&#12409;&#12383;&#12426;
  &#12354;&#12360;&#12390;&#26126;&#30906;&#12395;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12499;&#12472;&#12493;&#12473;&#12398;&#19990;&#30028;&#12395;&#24195;&#12414;&#12387;&#12390;&#12356;&#12367;&#20013;&#12391;
  &#12371;&#12398;&#21839;&#38988;&#12399;&#36991;&#12369;&#12425;&#12428;&#12394;&#12356;&#12418;&#12398;&#12392;&#12394;&#12387;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
  1998 &#24180;&#12395;&#12289;&#12300;&#12501;&#12522;&#12540;&#12301;&#12395;&#12363;&#12431;&#12427;&#35328;&#33865;&#12392;&#12375;&#12390;
  <em class="firstterm">&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;</em> &#12364;&#30331;&#22580;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#24460;&#12395; Open Source Initiative (OSI) &#12392;&#12394;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#38598;&#22243;&#12364;&#23450;&#32681;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  <sup>[<a name="idp296912" href="#ftn.idp296912" class="footnote">11</a>]</sup>
  OSI &#12399;&#12289;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12364;&#28151;&#20081;&#12398;&#20803;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#21336;&#35486;&#12364;&#12289;&#12424;&#12426;&#20840;&#33324;&#30340;&#12394;&#21839;&#38988;&#12398;&#24500;&#20505;&#12398;&#12402;&#12392;&#12388;&#12391;&#12354;&#12427;&#12392;&#32771;&#12360;&#12414;&#12375;&#12383;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#12434;&#12424;&#12426;&#24195;&#12417;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
  &#20309;&#12425;&#12363;&#12398;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#25126;&#30053;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;
  &#36947;&#24499;&#12384;&#12398;&#31038;&#20250;&#20840;&#20307;&#12398;&#21033;&#30410;&#12384;&#12398;&#12392;&#12356;&#12387;&#12383;&#35328;&#33865;&#12399;
  &#27770;&#12375;&#12390;&#37325;&#24441;&#20250;&#35696;&#12391;&#25201;&#12431;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  OSI &#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#35328;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        Open Source Initiative &#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12377;&#12290;
        &#12452;&#12487;&#12458;&#12525;&#12462;&#12540;&#12395;&#12388;&#12356;&#12390;&#29105;&#24321;&#12434;&#12405;&#12427;&#12358;&#12398;&#12391;&#12399;&#12394;&#12356;&#12289;
        &#25163;&#22533;&#12367;&#23455;&#38555;&#30340;&#12394;&#31435;&#22580;&#12395;&#12362;&#12356;&#12390;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12434;&#24195;&#12417;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
        &#21213;&#31639;&#12398;&#12354;&#12427;&#20013;&#36523;&#12399;&#12381;&#12398;&#12414;&#12414;&#12289;
        &#21213;&#12385;&#30446;&#12398;&#28961;&#12356;&#24907;&#24230;&#12420;&#35937;&#24500;&#20027;&#32681;&#12434;&#22793;&#12360;&#12383;&#12398;&#12391;&#12377;&#12290;&#8230;&#8230;
      </em></span></p><p><span class="emphasis"><em>
        &#12411;&#12392;&#12435;&#12393;&#12398;&#25216;&#34899;&#32773;&#12395;&#12392;&#12387;&#12390;&#12289;
        &#24517;&#35201;&#12394;&#12398;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#27010;&#24565;&#12391;&#12399;&#12394;&#12367;&#12381;&#12398;&#21517;&#21069;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12391;&#12377;&#12290;
        &#12394;&#12380;&#26087;&#26469;&#12398;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12391;&#12399;&#12394;&#12367;
        &#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
      </em></span></p><p><span class="emphasis"><em>
        &#30452;&#25509;&#12398;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12399;&#12289;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;
        &#12392;&#12356;&#12358;&#35328;&#33865;&#12364;&#35492;&#35299;&#12434;&#21463;&#12369;&#12420;&#12377;&#12367;&#12289;&#28151;&#20081;&#12398;&#20803;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#8230;&#8230;
      </em></span></p><p><span class="emphasis"><em>
        &#12375;&#12363;&#12375;&#12289;&#21517;&#21069;&#12434;&#12388;&#12369;&#12394;&#12362;&#12375;&#12383;&#30495;&#12398;&#29702;&#30001;&#12399;&#12289;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#19978;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
        &#31169;&#12383;&#12385;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#27010;&#24565;&#12434;&#19968;&#33324;&#12398;&#26989;&#30028;&#12395;&#12418;&#24195;&#12417;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        &#31169;&#12383;&#12385;&#12399;&#12377;&#12400;&#12425;&#12375;&#12356;&#35069;&#21697;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;
        &#36942;&#21435;&#12395;&#12362;&#12356;&#12390;&#12399;&#31169;&#12383;&#12385;&#12398;&#31435;&#22580;&#12399;&#12402;&#12393;&#12356;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
        &#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#12499;&#12472;&#12493;&#12473;&#12510;&#12531;&#12398;&#35492;&#35299;&#12434;&#25307;&#12365;&#12289;
        &#21453;&#21830;&#26989;&#20027;&#32681;&#12384;&#12392;&#12363;&#12289;&#26178;&#12395;&#12399;&#30423;&#20154;&#21628;&#12400;&#12431;&#12426;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
      </em></span></p><p><span class="emphasis"><em>
        &#22823;&#25163;&#20225;&#26989;&#12398; CEO &#12420; CTO &#12399;&#12289;&#27770;&#12375;&#12390;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;
        &#12434;&#36092;&#20837;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
        &#12391;&#12418;&#12289;&#20170;&#12414;&#12391;&#12392;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#32771;&#12360;&#12398;&#12418;&#12392;&#12391;&#21516;&#12376;&#20154;&#12383;&#12385;&#12364;&#20316;&#12426;&#12289;
        &#21516;&#12376;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12375;&#12383;&#12418;&#12398;&#12398;&#21517;&#21069;&#12434;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;
        &#12392;&#22793;&#12360;&#12383;&#12425;&#12393;&#12358;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#65311;&#24444;&#12425;&#12399;&#12381;&#12428;&#12434;&#36092;&#20837;&#12375;&#12390;&#12367;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
      </em></span></p><p><span class="emphasis"><em>
        &#12495;&#12483;&#12459;&#12540;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12371;&#12428;&#12399;&#20449;&#12376;&#12364;&#12383;&#12356;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
        &#25216;&#34899;&#32773;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#20855;&#20307;&#30340;&#12391;&#20013;&#36523;&#12398;&#12354;&#12427;&#12418;&#12398;&#12395;&#32622;&#12365;&#25563;&#12360;&#12390;&#32771;&#12360;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
        &#12375;&#12363;&#12375;&#12289;&#20309;&#12363;&#12434;&#22770;&#12427;&#12392;&#12365;&#12395;&#12399;&#12452;&#12513;&#12540;&#12472;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#37325;&#35201;&#12394;&#12398;&#12391;&#12377;&#12290;
      </em></span></p><p><span class="emphasis"><em>
        &#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#35211;&#12383;&#30446;&#12364;&#37325;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
        &#31169;&#12383;&#12385;&#12364;&#36914;&#12435;&#12391;&#12496;&#12522;&#12465;&#12540;&#12489;&#12434;&#21462;&#12426;&#22730;&#12375;&#12289;
        &#21916;&#12435;&#12391;&#29987;&#26989;&#30028;&#12392;&#19968;&#32210;&#12395;&#20181;&#20107;&#12434;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#35211;&#12379;&#12427;&#12371;&#12392;&#12399;&#12289;
        &#31169;&#12383;&#12385;&#12398;&#23455;&#38555;&#12398;&#25391;&#12427;&#33310;&#12356;&#12420;&#20449;&#24565;&#12289;&#12381;&#12375;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#33258;&#20307;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;
        &#20385;&#20516;&#12398;&#12354;&#12427;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
      </em></span></p><p>
        (<a class="ulink" href="http://www.opensource.org" target="_top">http://www.opensource.org</a> &#12424;&#12426;&#24341;&#29992;&#12290; &#12356;&#12420;&#12416;&#12375;&#12429;
         <span class="emphasis"><em>&#20197;&#21069;&#12399;</em></span> &#12381;&#12371;&#12395;&#12354;&#12387;&#12383;&#12289;&#12392;&#12356;&#12358;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
          &#8212;  OSI &#12399;&#12371;&#12398;&#12506;&#12540;&#12472;&#12434;&#21066;&#38500;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12424;&#12358;&#12391;&#12377;&#12364;&#12289;
         <a class="ulink" href="http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php" target="_top">http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php</a> &#12392;
         <a class="ulink" href="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a> &#12391;&#20170;&#12391;&#12418;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        )
      </p></blockquote></div><p>
  &#12371;&#12398;&#25991;&#12395;&#12399;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#12484;&#12483;&#12467;&#12511;&#12393;&#12371;&#12429;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12300;&#31169;&#12383;&#12385;&#12398;&#20449;&#24565;&#12301;&#12392;&#12399;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12398;&#20449;&#24565;&#12392;&#12399;&#12356;&#12387;&#12383;&#12356;&#20309;&#12394;&#12398;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#24039;&#22937;&#12395;&#30465;&#30053;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#25163;&#27861;&#12399;&#12424;&#12426;&#12424;&#12356;&#12467;&#12540;&#12489;&#12434;&#29983;&#12415;&#20986;&#12377;&#12392;&#12356;&#12358;&#20449;&#24565;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12425;&#12422;&#12427;&#24773;&#22577;&#12434;&#20849;&#26377;&#12377;&#12409;&#12365;&#12384;&#12392;&#12356;&#12358;&#20449;&#24565;&#12398;&#20154;&#12418;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12300;&#30423;&#20154;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#12289;(&#12362;&#12381;&#12425;&#12367;) &#36949;&#27861;&#12467;&#12500;&#12540;&#12398;&#12371;&#12392;&#12434;&#25351;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#35328;&#12356;&#26041;&#12395;&#12399;&#30064;&#35696;&#12364;&#12354;&#12427;&#20154;&#12418;&#22810;&#12356;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20803;&#12398;&#25152;&#26377;&#32773;&#12364;&#12414;&#12384;&#12381;&#12428;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12427;&#12398;&#12384;&#12363;&#12425;
  &#12300;&#30423;&#20154;&#12301;&#12399;&#12362;&#12363;&#12375;&#12356;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#12364;&#21453;&#21830;&#26989;&#20027;&#32681;&#12384;&#12392;&#38750;&#38627;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12395;&#12388;&#12356;&#12390;&#12399;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12398;&#38750;&#38627;&#12364;&#20309;&#12363;&#12398;&#20107;&#23455;&#12395;&#12418;&#12392;&#12389;&#12367;&#12418;&#12398;&#12394;&#12398;&#12363;&#12393;&#12358;&#12363;&#12395;&#12399;&#35302;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#21029;&#12395;&#12289;OSI &#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12364;&#30683;&#30462;&#12375;&#12390;&#12356;&#12390;&#32027;&#12425;&#12431;&#12375;&#12356;&#12392;&#35328;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12376;&#12419;&#12394;&#12356;&#12435;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#12364;&#27424;&#12356;&#12390;&#12365;&#12383;&#12418;&#12398;&#12384;&#12392; OSI &#12364;&#20027;&#24373;&#12377;&#12427;&#12289;&#12414;&#12373;&#12395;&#12381;&#12428;&#12398;&#20363;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12435;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12289;&#12300;&#12424;&#12356;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12301;&#12391;&#12377;&#12290;
  &#12300;&#12424;&#12356;&#12301;&#12392;&#12399;&#12289;&#12300;&#26989;&#30028;&#12391;&#29983;&#12365;&#27531;&#12387;&#12390;&#12356;&#12369;&#12427;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12290;
  Open Source Initiative &#12399;&#12289;&#22810;&#12367;&#12398;&#20154;&#12293;&#12395;&#24444;&#12425;&#12364;&#24453;&#12385;&#26395;&#12435;&#12391;&#12356;&#12383;&#12418;&#12398;&#12434;&#19982;&#12360;&#12414;&#12375;&#12383;&#12290;
  &#36947;&#24499;&#30340;&#12394;&#21313;&#23383;&#36557;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12424;&#12427;&#38283;&#30330;&#25163;&#27861;&#12420;&#32076;&#21942;&#25126;&#30053;&#12434;&#35486;&#12427;&#19978;&#12391;&#24517;&#35201;&#12394;&#35328;&#33865;&#12391;&#12377;&#12290;
</p></div><p>
  Open Source Initiative &#12398;&#30331;&#22580;&#12395;&#12424;&#12387;&#12390;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#30028;&#12398;&#24773;&#21218;&#12364;&#22793;&#21270;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#38263;&#12356;&#38291;&#12358;&#12420;&#12416;&#12420;&#12395;&#12373;&#12428;&#12390;&#12365;&#12383;&#20001;&#32773;&#12395;&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#21517;&#21069;&#12434;&#12388;&#12369;&#12289;
  &#20869;&#37096;&#12398;&#25919;&#27835;&#30340;&#12394;&#21839;&#38988;&#12392;&#21516;&#27096;&#12395;&#22806;&#37096;&#30340;&#12394;&#21839;&#38988;&#12392;&#12375;&#12390;&#12418;&#35469;&#35672;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#29694;&#22312;&#12408;&#12398;&#24433;&#38911;&#12399;&#12289;&#20001;&#32773;&#12364;&#20849;&#36890;&#12398;&#32972;&#26223;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#20001;&#26041;&#12398;&#38499;&#21942;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12434;&#21547;&#12435;&#12391;&#12362;&#12426;&#12289;
  &#12414;&#12383;&#12393;&#12385;&#12425;&#12395;&#23646;&#12377;&#12427;&#12363;&#12399;&#12387;&#12365;&#12426;&#12375;&#12394;&#12356;&#21442;&#21152;&#32773;&#12418;&#21516;&#12376;&#12367;&#12425;&#12356;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#27770;&#12375;&#12390;&#12289;&#36947;&#24499;&#30340;&#12394;&#35441;&#12364;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#20363;&#12398;&#12300;&#12495;&#12483;&#12459;&#12540;&#20523;&#29702;&#12301;&#12399;&#20170;&#12391;&#12418;&#12383;&#12414;&#12395;&#35441;&#38988;&#12395;&#12398;&#12412;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;/&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473; &#12398;&#38283;&#30330;&#32773;&#12364;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#23550;&#12375;&#12390;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#21205;&#27231;&#12434;&#12362;&#12362;&#12387;&#12404;&#12425;&#12395;&#23563;&#12397;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12394;&#12367;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#36002;&#29486;&#12375;&#12383;&#20154;&#12391;&#12399;&#12394;&#12367;&#36002;&#29486;&#12398;&#20869;&#23481;&#12391;&#35413;&#20385;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12384;&#12428;&#12363;&#12364;&#12377;&#12400;&#12425;&#12375;&#12356;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#20154;&#12395;&#23550;&#12375;&#12390;&#12300;&#36947;&#24499;&#30340;&#12394;&#29702;&#30001;&#12391;&#12381;&#12428;&#12434;&#26360;&#12356;&#12383;&#12398;&#65311;&#12301;&#12392;&#12363;
  &#12300;&#37329;&#12391;&#38599;&#12431;&#12428;&#12390;&#26360;&#12356;&#12383;&#12398;&#65311;&#12301;&#12300;&#21517;&#21069;&#12434;&#22770;&#12427;&#12383;&#12417;&#65311;&#12301;&#12392;&#12356;&#12387;&#12383;&#39006;&#12398;&#12371;&#12392;&#12399;&#32862;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#21336;&#12395;&#12381;&#12398;&#12467;&#12540;&#12489;&#12398;&#20869;&#23481;&#12434;&#25216;&#34899;&#30340;&#12395;&#35413;&#20385;&#12375;&#12289;&#25216;&#34899;&#30340;&#12395;&#31572;&#12360;&#12434;&#36820;&#12377;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  Debian &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399; 100% &#12501;&#12522;&#12540; (&#12418;&#12385;&#12429;&#12435;&#12300;&#33258;&#30001;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;)
  &#12394;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#29872;&#22659;&#12434;&#20316;&#12427;&#12371;&#12392;&#12434;&#30446;&#27161;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12395;&#25919;&#27835;&#30340;&#12394;&#24907;&#24230;&#12434;&#26126;&#30906;&#12395;&#25171;&#12385;&#20986;&#12375;&#12390;&#12356;&#12427;&#32068;&#32340;&#12391;&#12373;&#12360;&#12418;&#12289;
  &#12501;&#12522;&#12540;&#12391;&#12394;&#12356;&#12467;&#12540;&#12489;&#12418;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;
  &#26041;&#21521;&#24615;&#12364;&#23436;&#20840;&#12395;&#19968;&#33268;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#12418;&#20849;&#21516;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp24080" href="#idp24080" class="para">4</a>] </sup>
      &#26377;&#21517;&#12394;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#12402;&#12392;&#12388;&#12391;&#12354;&#12427; SourceForge.net &#12395;&#12399;&#12289;2004 &#24180; 4 &#26376;&#20013;&#26092;&#12398;&#26178;&#28857;&#12391;
      79,225 &#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12428;&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#32207;&#25968;&#12391;&#12354;&#12427;
      &#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#12371;&#12428;&#12399;&#21336;&#12395;&#12289;&#12381;&#12398;&#26178;&#28857;&#12391; SourceForge &#12434;&#36984;&#25246;&#12375;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25968;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp286864" href="#idp286864" class="para">5</a>] </sup>
      Stallman &#12399;&#12300;&#12495;&#12483;&#12459;&#12540;&#12301;&#12392;&#12356;&#12358;&#21336;&#35486;&#12434;
      &#12300;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12364;&#22823;&#22909;&#12365;&#12391;&#12381;&#12428;&#12434;&#27005;&#12375;&#12435;&#12391;&#12356;&#12427;&#36066;&#12356;&#20154;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#26368;&#36817;&#12424;&#12367;&#20351;&#12431;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12300;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#19981;&#27491;&#20405;&#20837;&#12377;&#12427;&#20154;&#12301;
      &#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp284592" href="#idp284592" class="para">6</a>] </sup>
      &#12371;&#12428;&#12399; "GNU's Not Unix" &#12398;&#38957;&#25991;&#23383;&#12434;&#12392;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
      &#12381;&#12375;&#12390;&#12371;&#12398;&#20013;&#12398; "GNU" &#12399;&#20309;&#12398;&#30053;&#12363;&#12392;&#12356;&#12360;&#12400;&#8230;&#8230; &#21516;&#12376;&#12391;&#12377;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp315600" href="#idp315600" class="para">7</a>] </sup>
      &#21427;&#23494;&#12395;&#35328;&#12358;&#12392;&#12289;Linux &#12364;&#26368;&#21021;&#12384;&#12387;&#12383;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      IBM &#20114;&#25563;&#27231;&#19978;&#12391;&#21205;&#20316;&#12377;&#12427; 386BSD &#12392;&#12356;&#12358;&#12501;&#12522;&#12540;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12364;
      Linux &#12398;&#12411;&#12435;&#12398;&#23569;&#12375;&#21069;&#12395;&#30331;&#22580;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12375;&#12363;&#12375;&#12289;386BSD &#12434;&#21205;&#12363;&#12377;&#12398;&#12399;&#38750;&#24120;&#12395;&#38627;&#12375;&#12356;&#12371;&#12392;&#12391;&#12375;&#12383;&#12290;
      Linux &#12364;&#39442;&#12364;&#12428;&#12383;&#29702;&#30001;&#12399;&#12289;&#21336;&#12395;&#12501;&#12522;&#12540;&#12394;&#12384;&#12369;&#12391;&#12394;&#12367;
      &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#21205;&#20316;&#12373;&#12379;&#12427;&#12398;&#12364;&#31777;&#21336;&#12391;&#12354;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp283360" href="#idp283360" class="para">8</a>] </sup>
      &#24444;&#12425;&#12399; "X &#12454;&#12451;&#12531;&#12489;&#12454;&#12471;&#12473;&#12486;&#12512;" &#12392;&#21628;&#12435;&#12391;&#12411;&#12375;&#12356;&#12424;&#12358;&#12391;&#12377;&#12364;&#12289;
      &#29694;&#23455;&#12395;&#12399; "X &#12454;&#12451;&#12531;&#12489;&#12454;" &#12392;&#12356;&#12358;&#12371;&#12392;&#12398;&#12411;&#12358;&#12364;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#12384;&#12387;&#12390;&#12356;&#12385;&#12356;&#12385;&#12381;&#12435;&#12394;&#38263;&#12356;&#21517;&#21069;&#12434;&#35328;&#12358;&#12398;&#12399;&#38754;&#20498;&#12367;&#12373;&#12356;&#12363;&#12425;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp230544" href="#idp230544" class="para">9</a>] </sup>
      &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#37197;&#24067;&#12377;&#12427;&#38555;&#12395;&#20195;&#37329;&#12434;&#24500;&#21454;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      &#12375;&#12363;&#12375;&#12289;&#36092;&#20837;&#12375;&#12383;&#20154;&#12364;&#12381;&#12428;&#12434;&#20182;&#20154;&#12395;&#28961;&#26009;&#12391;&#20877;&#37197;&#24067;&#12377;&#12427;&#12398;&#12434;&#31105;&#12376;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12289;
      &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#20385;&#26684;&#12399;&#28961;&#26009;&#21516;&#28982;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp338080" href="#idp338080" class="para">10</a>] </sup>
      Netscape Navigator &#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12399;&#12289;&#32080;&#23616;&#12399;
      1998 &#24180;&#12395;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12418;&#12392;&#12391;&#20844;&#38283;&#12373;&#12428;&#12427;&#12371;&#12392;&#12392;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
      &#12371;&#12428;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#20316;&#12425;&#12428;&#12383;&#12398;&#12364; Mozilla &#12454;&#12455;&#12502;&#12502;&#12521;&#12454;&#12470;&#12391;&#12377;&#12290;&#35443;&#32048;&#12399;
      <a class="ulink" href="http://www.mozilla.org/" target="_top">http://www.mozilla.org/</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp296912" href="#idp296912" class="para">11</a>] </sup>
      OSI &#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12399; <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a> &#12391;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="aboutjpversion.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="today.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#26085;&#26412;&#35486;&#29256;&#12395;&#12388;&#12356;&#12390; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#29694;&#29366;</td></tr></table></div></body></html>
