<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="bug-tracker.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;"><link rel="next" href="rss.html" title="RSS &#12501;&#12451;&#12540;&#12489;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-tracker.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="rss.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="irc"></a>IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;</h2></div></div></div><p>
    &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;<em class="firstterm">Internet Relay Chat</em> (<em class="firstterm">IRC</em>) &#12434;&#20351;&#12387;&#12383;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12398;&#12481;&#12515;&#12483;&#12488;&#12523;&#12540;&#12512;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12371;&#12391;&#12399;&#12518;&#12540;&#12470;&#12540;&#12392;&#38283;&#30330;&#32773;&#12364;&#36074;&#21839;&#12434;&#20986;&#12375;&#21512;&#12356;&#12289;&#12377;&#12368;&#12395;&#36820;&#20107;&#12434;&#36016;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#33258;&#21069;&#12398;IRC&#12469;&#12540;&#12496;&#12434;&#21205;&#12363;&#12377;&#12371;&#12392;&#12418; <span class="emphasis"><em>&#21487;&#33021;&#12391;&#12377;</em></span> &#12364;&#12289;
    &#26222;&#36890;&#12399;&#12381;&#12371;&#12414;&#12391;&#38929;&#24373;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12416;&#12375;&#12429;&#12415;&#12435;&#12394;&#12364;&#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30495;&#20284;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12388;&#12414;&#12426;&#12289;Freenode (<a class="ulink" href="http://freenode.net/" target="_top">http://freenode.net/</a>) &#12391;&#33258;&#20998;&#12398;IRC&#12481;&#12515;&#12531;&#12493;&#12523;&#12434;&#38283;&#35373;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
    Freenode&#12399;&#12289;IRC&#12469;&#12540;&#12496;&#12434;&#33258;&#20998;&#12391;&#31649;&#29702;&#12377;&#12427;&#33510;&#21172;&#12363;&#12425;&#12354;&#12394;&#12383;&#12434;&#35299;&#25918;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12289;
    <sup>[<a name="idp1159984" href="#ftn.idp1159984" class="footnote">20</a>]</sup>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;IRC&#12481;&#12515;&#12531;&#12493;&#12523;&#12434;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#35215;&#21046;&#12434;&#34892;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#12414;&#12378;&#12420;&#12427;&#12409;&#12365;&#12371;&#12392;&#12399;&#12481;&#12515;&#12531;&#12493;&#12523;&#12398;&#21517;&#21069;&#12434;&#27770;&#12417;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#12398;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;
    &#8212; Freenode &#12391;&#20351;&#12360;&#12427;&#21517;&#21069;&#12394;&#12425;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12418;&#12375;&#20351;&#12360;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12395;&#36817;&#12356;&#21517;&#21069;&#12391;&#12289;
    &#12391;&#12365;&#12427;&#12384;&#12369;&#35226;&#12360;&#12420;&#12377;&#12356;&#21517;&#21069;&#12434;&#36984;&#12406;&#12424;&#12358;&#12395;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#36074;&#21839;&#12395;&#32032;&#26089;&#12367;&#31572;&#12360;&#12390;&#27442;&#12375;&#12356;&#12518;&#12540;&#12470;&#12540;&#12364;&#12377;&#12368;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12391;IRC&#12481;&#12515;&#12531;&#12493;&#12523;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#30693;&#12425;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12383;&#12392;&#12360;&#12400;Subversion &#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12391;&#12399;&#12289;
    &#12506;&#12540;&#12472;&#19978;&#37096;&#12398;&#30446;&#31435;&#12388;&#12508;&#12483;&#12463;&#12473;&#37096;&#20998;&#12395;&#27425;&#12398;&#12424;&#12358;&#12394;&#24773;&#22577;&#12434;&#34920;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
        <span class="emphasis"><em>Subversion&#12434;&#12362;&#20351;&#12356;&#12394;&#12425;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</em></span>
        <code class="literal">users@subversion.tigris.org</code>
        <span class="emphasis"><em>&#12434;&#36092;&#35501;&#12375;&#12289;
        <a class="ulink" href="http://svnbook.red-bean.com/index.ja.html" target="_top">Subversion&#12395;&#12424;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;</a> &#12392; 
        <a class="ulink" href="http://subversion.tigris.org/faq.html" target="_top">FAQ</a>
        &#12434;&#35501;&#12416;&#12371;&#12392;&#12434;&#21223;&#12417;&#12414;&#12377;&#12290;</em></span> 
        <span class="emphasis"><em>IRC&#12398;</em></span>
        <code class="literal">irc.freenode.net</code>
        <span class="emphasis"><em>&#19978;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;</em></span>
         <code class="literal">#svn</code> 
        <span class="emphasis"><em>&#12391;&#12418;&#36074;&#21839;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</em></span>
    </p></blockquote></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#35079;&#25968;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12434;&#25345;&#12388;&#12418;&#12398;&#12418;&#12354;&#12426;&#12289;
    &#12402;&#12392;&#12388;&#12402;&#12392;&#12388;&#12364;&#21103;&#27425;&#30340;&#12394;&#12488;&#12500;&#12483;&#12463;&#12434;&#25201;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12354;&#12427;&#12481;&#12515;&#12531;&#12493;&#12523;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12398;&#21839;&#38988;&#12434;&#25201;&#12356;&#12289;
    &#21029;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12391;&#12399;&#20351;&#12356;&#26041;&#12398;&#21839;&#38988;&#12289;&#38283;&#30330;&#12395;&#38306;&#12377;&#12427;&#12481;&#12515;&#12483;&#12488;&#12289;&#31561;&#12391;&#12377;&#12290;
    (<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12398; <a class="xref" href="growth.html" title="&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;">&#12300;&#24040;&#22823;&#21270;&#12408;&#12398;&#23550;&#24540;&#12301;</a> &#12391;&#12399;</span>&#12289;&#12481;&#12515;&#12531;&#12493;&#12523;&#12434;&#35079;&#25968;&#12395;&#20998;&#21106;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#35696;&#35542;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;)
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22987;&#12414;&#12387;&#12390;&#38291;&#12418;&#12394;&#12356;&#12394;&#12425;&#12289;&#30342;&#12364;&#19968;&#32210;&#12395;&#12362;&#21899;&#12426;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12481;&#12515;&#12531;&#12493;&#12523;&#12398;&#25968;&#12399;&#12402;&#12392;&#12388;&#12395;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24460;&#12395;&#38283;&#30330;&#32773;&#12402;&#12392;&#12426;&#12395;&#23550;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#25968;&#12364;&#22679;&#12360;&#12427;&#12398;&#12395;&#24540;&#12376;&#12390;&#12289;
    &#12481;&#12515;&#12531;&#12493;&#12523;&#12398;&#20998;&#21106;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12393;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12391;&#21899;&#12428;&#12400;&#12424;&#12356;&#12363;&#12399;&#35328;&#12358;&#12414;&#12391;&#12418;&#12394;&#12367;&#12289;
    &#21033;&#29992;&#12391;&#12365;&#12427;&#20840;&#12390;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12434;&#30693;&#12425;&#12379;&#12427;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;?
    &#12381;&#12375;&#12390;&#12481;&#12515;&#12483;&#12488;&#12434;&#12377;&#12427;&#12392;&#12365;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#29305;&#26377;&#12398;&#27770;&#12414;&#12426;&#12372;&#12392;&#12434;&#30693;&#12425;&#12379;&#12427;&#12395;&#12399;&#12393;&#12358;&#12377;&#12428;&#12400;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;?
</p><p>
    &#31572;&#12360;&#12399; <em class="firstterm">&#12481;&#12515;&#12531;&#12493;&#12523;&#12488;&#12500;&#12483;&#12463;</em>
    <sup>[<a name="idp1278016" href="#ftn.idp1278016" class="footnote">21</a>]</sup>
    &#12434;&#35373;&#23450;&#12375;&#12390;&#30693;&#12425;&#12379;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12481;&#12515;&#12531;&#12493;&#12523;&#12488;&#12500;&#12483;&#12463;&#12399;&#12289;&#21021;&#12417;&#12390;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#20837;&#12387;&#12383;&#12392;&#12365;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364;&#35211;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#26032;&#38996;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#31777;&#21336;&#12394;&#26696;&#20869;&#12434;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12289;
    &#12373;&#12425;&#12395;&#35443;&#12375;&#12356;&#24773;&#22577;&#12408;&#12398;&#12509;&#12452;&#12531;&#12479;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;:
</p><pre class="screen">
&#12354;&#12394;&#12383;&#12399; #svn &#12391;&#21899;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;

#svn &#12398;&#12488;&#12500;&#12483;&#12463;&#12399;&#20197;&#19979;&#12398;&#36890;&#12426;&#12391;&#12377;&#12290;Subversion&#12518;&#12540;&#12470;&#12540;&#12398;&#36074;&#21839;&#12434;&#21463;&#12369;&#20184;&#12369;&#12427;
&#12501;&#12457;&#12540;&#12521;&#12512;&#12391;&#12377;&#12290;http://subversion.tigris.org &#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; || 
&#38283;&#30330;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12399;&#12289;#svn-dev &#12391;&#34892;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; || &#38263;&#12356; Subversion &#12398;
&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#36028;&#12426;&#20184;&#12369;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;http://pastebin.ca/ &#12398;&#12424;&#12358;&#12394;
&#36028;&#12426;&#20184;&#12369;&#29992;&#12398;&#12469;&#12452;&#12488;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; || &#12491;&#12517;&#12540;&#12473;: Subversion 1.1.0 &#12364;
&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#35443;&#12375;&#12367;&#12399; http://svn110.notlong.com/ &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;
&#12373;&#12356;&#12290;
</pre><p>
    &#12371;&#12428;&#12399;&#31777;&#21336;&#12391;&#12377;&#12364;&#12289;&#26032;&#38996;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#30693;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#24773;&#22577;&#12434;&#20253;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12481;&#12515;&#12531;&#12493;&#12523;&#12398;&#30446;&#30340;&#12434;&#27491;&#30906;&#12395;&#20253;&#12360;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12434;&#31034;&#12375;(&#12518;&#12540;&#12470;&#12540;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#35370;&#12428;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#12392;&#12481;&#12515;&#12531;&#12493;&#12523;&#20869;&#12391;&#36855;&#23376;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;)
    &#38306;&#36899;&#12377;&#12427;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#35328;&#21450;&#12375;&#12289;&#36028;&#12426;&#20184;&#12369;&#12395;&#38306;&#12377;&#12427;&#26696;&#20869;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="sidebar" title="&#36028;&#12426;&#20184;&#12369;&#29992;&#12398;&#12469;&#12452;&#12488;"><a name="paste-sites"></a><div class="titlepage"><div><div><p class="title"><b>&#36028;&#12426;&#20184;&#12369;&#29992;&#12398;&#12469;&#12452;&#12488;</b></p></div></div></div><p>
    IRC&#12481;&#12515;&#12531;&#12493;&#12523;&#12399;&#20849;&#26377;&#12473;&#12506;&#12540;&#12473;&#12391;&#12377;&#12290;&#35504;&#12391;&#12418;&#20182;&#20154;&#12398;&#30330;&#35328;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#36002;&#29486;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#12392;&#12365;&#12395;&#20250;&#35441;&#12395;&#21106;&#12387;&#12390;&#20837;&#12428;&#12414;&#12377;&#12375;&#12289;
    &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#12420;&#12426;&#12392;&#12426;&#12434;&#35211;&#12390;&#23398;&#12406;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#26222;&#27573;&#12399;&#12424;&#12356;&#29366;&#24907;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12487;&#12496;&#12483;&#12464;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#12467;&#12500;&#12540;&#12398;&#12424;&#12358;&#12395;&#12289;
    &#22823;&#37327;&#12398;&#24773;&#22577;&#12434;&#19968;&#24230;&#12395;&#27969;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#21839;&#38988;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#12354;&#12414;&#12426;&#12395;&#22810;&#12367;&#12398;&#34892;&#12434;&#36028;&#12426;&#20184;&#12369;&#12427;&#12392;&#20182;&#12398;&#20250;&#35441;&#12434;&#12406;&#12385;&#22730;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#21839;&#38988;&#12398;&#35299;&#27770;&#31574;&#12399;&#12289;
    <em class="firstterm">&#12506;&#12540;&#12473;&#12488;&#12499;&#12531;</em> &#12414;&#12383;&#12399; <em class="firstterm">&#12506;&#12540;&#12473;&#12488;&#12508;&#12483;&#12488;</em> &#12469;&#12452;&#12488;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#22823;&#37327;&#12398;&#12487;&#12540;&#12479;&#12434;&#20182;&#20154;&#12363;&#12425;&#35211;&#12390;&#12411;&#12375;&#12356;&#12392;&#38972;&#12414;&#12428;&#12427;&#26178;&#12399;&#12289;
    &#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#36028;&#12426;&#20184;&#12369;&#12394;&#12356;&#12391;&#12289;
    (&#12383;&#12392;&#12360;&#12400;) <a class="ulink" href="http://pastebin.ca/" target="_top">http://pastebin.ca/</a> &#12395;&#34892;&#12365;&#12289;
    &#12501;&#12457;&#12540;&#12512;&#12395;&#12487;&#12540;&#12479;&#12434;&#20837;&#21147;&#12375;&#12390;&#29983;&#25104;&#12373;&#12428;&#12383;URL&#12434;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#20253;&#12360;&#12427;&#12424;&#12358;&#12395;&#38972;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12381;&#12398;URL&#12434;&#35504;&#12391;&#12418;&#35370;&#12428;&#12390;&#12487;&#12540;&#12479;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#20170;&#12391;&#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#36028;&#12426;&#20184;&#12369;&#12469;&#12452;&#12488;&#12364;&#28961;&#26009;&#12391;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;
    &#12414;&#12392;&#12417;&#12390;&#31034;&#12377;&#12395;&#12399;&#25968;&#12364;&#22810;&#12377;&#12366;&#12414;&#12377;&#12364;&#12289;
    &#31169;&#12364;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#12469;&#12452;&#12488;&#12434;&#12356;&#12367;&#12388;&#12363;&#20197;&#19979;&#12395;&#31034;&#12375;&#12414;&#12377;:
<a class="ulink" href="http://www.nomorepasting.com/" target="_top">http://www.nomorepasting.com/</a>,
<a class="ulink" href="http://pastebin.ca/" target="_top">http://pastebin.ca/</a>,
<a class="ulink" href="http://nopaste.php.cd/" target="_top">http://nopaste.php.cd/</a>,
<a class="ulink" href="http://rafb.net/paste/" target="_top">http://rafb.net/paste/</a>,
<a class="ulink" href="http://sourcepost.sytes.net/" target="_top">http://sourcepost.sytes.net/</a>,
<a class="ulink" href="http://extraball.sunsite.dk/notepad.php" target="_top">http://extraball.sunsite.dk/notepad.php</a>,
<a class="ulink" href="http://www.pastebin.com/" target="_top">http://www.pastebin.com/</a></p></div><div class="sect2" title="&#12508;&#12483;&#12488;"><div class="titlepage"><div><div><h3 class="title"><a name="bots"></a>&#12508;&#12483;&#12488;</h3></div></div></div><p>
    &#22810;&#12367;&#12398;&#25216;&#34899;&#25351;&#21521;&#12394;IRC&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#12399;&#12289;
    &#12356;&#12431;&#12422;&#12427; <em class="firstterm">&#12508;&#12483;&#12488;</em> &#12392;&#21628;&#12400;&#12428;&#12427;&#20154;&#38291;&#12391;&#12394;&#12356;&#12513;&#12531;&#12496;&#12540;&#12364;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#29305;&#23450;&#12398;&#12467;&#12510;&#12531;&#12489;&#12395;&#21453;&#24540;&#12375;&#12390;&#24773;&#22577;&#12434;&#20445;&#23384;&#12375;&#12383;&#12426;&#12289;
    &#34920;&#31034;&#12375;&#12383;&#12426;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#36890;&#24120;&#12399;&#12289;&#12508;&#12483;&#12488;&#12399;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#12356;&#12427;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#25201;&#12356;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12467;&#12510;&#12531;&#12489;&#12399;&#12508;&#12483;&#12488;&#12395; "&#35441;&#12375;&#12363;&#12369;&#12427;" &#12371;&#12392;&#12391;&#20253;&#12360;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377; :
</p><pre class="screen">
&lt;kfogel&gt; ayita: learn diff-cmd = http://subversion.tigris.org/faq.html#diff-cmd
&lt;ayita&gt;  Thanks!
</pre><p>
    &#12371;&#12428;&#12399;&#12508;&#12483;&#12488;(ayita &#12392;&#12375;&#12390;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#12525;&#12464;&#12452;&#12531;&#12375;&#12390;&#12356;&#12414;&#12377;)&#12395; "diff-cmd" &#12392;&#12356;&#12358;&#21839;&#12356;&#21512;&#12431;&#12379;&#12398;&#31572;&#12360;&#12392;&#12375;&#12390;&#12354;&#12427;URL&#12434;&#35226;&#12360;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#20253;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12391;&#12399;&#12289;ayita &#12395;&#35441;&#12375;&#12363;&#12369;&#12390;&#12289;&#20182;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395; diff-cmd &#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#20253;&#12360;&#12427;&#12424;&#12358;&#12395;&#38972;&#12435;&#12391;&#12415;&#12414;&#12375;&#12423;&#12358; :
</p><pre class="screen">
&lt;kfogel&gt; ayita: tell jrandom about diff-cmd
&lt;ayita&gt;  jrandom: http://subversion.tigris.org/faq.html#diff-cmd
</pre><p>
    &#20415;&#21033;&#12394;&#30701;&#32302;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12387;&#12390;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#23455;&#29694;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><pre class="screen">
&lt;kfogel&gt; !a jrandom diff-cmd
&lt;ayita&gt;  jrandom: http://subversion.tigris.org/faq.html#diff-cmd
</pre><p>
    &#27491;&#30906;&#12394;&#12467;&#12510;&#12531;&#12489;&#12392;&#12381;&#12428;&#12395;&#23550;&#12377;&#12427;&#25391;&#33310;&#12356;&#12399;&#12508;&#12483;&#12488;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#19978;&#12398;&#20363;&#12399; Freenode &#12398; <code class="literal">#svn</code> &#12391;&#36890;&#24120;&#21205;&#12356;&#12390;&#12356;&#12427; <code class="literal">ayita</code>(<a class="ulink" href="http://hix.nu/svn-public/alexis/trunk/" target="_top">http://hix.nu/svn-public/alexis/trunk/</a>) &#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#20182;&#12395;&#12418; Dancer(<a class="ulink" href="http://dancer.sourceforge.net/" target="_top">http://dancer.sourceforge.net/</a>) &#12420; Supybot(<a class="ulink" href="http://supybot.com/" target="_top">http://supybot.com/</a>) &#12392;&#12356;&#12387;&#12383;&#12508;&#12483;&#12488;&#12364;&#12356;&#12414;&#12377;&#12290;
    &#12508;&#12483;&#12488;&#12434;&#21205;&#12363;&#12377;&#12398;&#12395;&#29305;&#21029;&#12394;IRC&#12469;&#12540;&#12496;&#19978;&#12398;&#27177;&#38480;&#12399;&#24517;&#35201;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12508;&#12483;&#12488;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12503;&#12525;&#12464;&#12521;&#12512;&#12394;&#12398;&#12391;&#12289;&#35504;&#12391;&#12418;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12375;&#12390;&#29305;&#23450;&#12398; IRC&#12469;&#12540;&#12496;/&#12481;&#12515;&#12531;&#12493;&#12523; &#19978;&#12391;&#24453;&#27231;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#12354;&#12394;&#12383;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12391;&#21516;&#12376;&#36074;&#21839;&#12364;&#32368;&#12426;&#36820;&#12373;&#12428;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;
    &#12508;&#12483;&#12488;&#12434;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#12371;&#12392;&#12434;&#24375;&#12367;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;
    &#12508;&#12483;&#12488;&#12398;&#25805;&#20316;&#26041;&#27861;&#12434;&#36523;&#12395;&#20184;&#12369;&#12427;&#12398;&#12399;&#12411;&#12435;&#12398;&#19968;&#25569;&#12426;&#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12377;&#12364;&#12289;
    &#12508;&#12483;&#12488;&#12364;&#21177;&#29575;&#30340;&#12395;&#21453;&#24540;&#12375;&#12390;&#12367;&#12428;&#12427;&#12398;&#12391;&#12289;
    &#23569;&#12394;&#12356;&#20154;&#25968;&#12391;&#32368;&#12426;&#36820;&#12373;&#12428;&#12427;&#36074;&#21839;&#12395;&#31572;&#12360;&#12425;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="IRC&#12398;&#20250;&#35441;&#12434;&#20445;&#23384;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="irc-archiving"></a>IRC&#12398;&#20250;&#35441;&#12434;&#20445;&#23384;&#12377;&#12427;</h3></div></div></div><p>
    IRC&#12481;&#12515;&#12531;&#12493;&#12523;&#12391;&#36215;&#12371;&#12387;&#12383;&#12371;&#12392;&#12399;&#20840;&#12390;&#20445;&#23384;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
    &#24517;&#12378;&#12375;&#12418;&#12381;&#12428;&#12364;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    IRC&#12391;&#12398;&#20250;&#35441;&#12399;&#24314;&#21069;&#19978;&#12399;&#20844;&#12394;&#12418;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#38750;&#20844;&#24335;&#12394;&#12418;&#12398;&#12289;&#12418;&#12375;&#12367;&#12399;&#21322;&#12400;&#12503;&#12521;&#12452;&#12505;&#12540;&#12488;&#12394;&#20250;&#35441;&#12384;&#12392;&#32771;&#12360;&#12427;&#20154;&#12418;&#22810;&#12367;&#12356;&#12414;&#12377;&#12290;
    IRC&#19978;&#12391;&#12399;&#12518;&#12540;&#12470;&#12540;&#12399;&#25991;&#27861;&#12395;&#28961;&#38931;&#30528;&#12391;&#12377;&#12375;&#12289;
    &#12458;&#12531;&#12521;&#12452;&#12531;&#19978;&#12391;&#32118;&#23550;&#12395;&#20445;&#23384;&#12373;&#12428;&#12383;&#12367;&#12394;&#12356;&#24847;&#35211;(&#12383;&#12392;&#12360;&#12400;&#12289;
    &#20182;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12420;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;)&#12434;&#35328;&#12387;&#12383;&#12426;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12418;&#12385;&#12429;&#12435;&#12289;<span class="emphasis"><em>&#20250;&#35441;&#12398;&#12414;&#12392;&#12417;</em></span> &#12434;&#20445;&#23384;&#12377;&#12409;&#12365;&#26178;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12398;&#22580;&#21512;&#12399;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;IRC&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#12518;&#12540;&#12470;&#12540;&#12398;&#35201;&#27714;&#12395;&#24540;&#12376;&#12390;&#20250;&#35441;&#12434;&#20445;&#23384;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12375;&#12289;
    &#12381;&#12428;&#12364;&#12391;&#12365;&#12394;&#12367;&#12390;&#12418;&#20250;&#35441;&#12434;&#12501;&#12457;&#12540;&#12521;&#12512;(&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;)&#12395;&#36028;&#12426;&#20184;&#12369;&#12427;&#12384;&#12369;&#12394;&#12425;&#12356;&#12388;&#12391;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#31680;&#25805;&#12394;&#12367;&#20250;&#35441;&#12434;&#20445;&#23384;&#12377;&#12427;&#12392;&#19981;&#23433;&#12395;&#12394;&#12427;&#12518;&#12540;&#12470;&#12540;&#12418;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#20840;&#12390;&#12398;&#20250;&#35441;&#12434;&#20445;&#23384;&#12377;&#12427;&#12398;&#12394;&#12425;&#12289;&#24517;&#12378;&#12381;&#12398;&#26088;&#12434;&#12481;&#12515;&#12531;&#12493;&#12523;&#12488;&#12500;&#12483;&#12463;&#12391;&#26126;&#31034;&#30340;&#12395;&#23459;&#35328;&#12375;&#12289;&#20445;&#23384;&#20808;&#12398;URL&#12434;&#31034;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1159984" href="#idp1159984" class="para">20</a>] </sup>Freenode &#12408;&#12398;&#23492;&#20184;&#12434;&#35201;&#27714;&#12373;&#12428;&#12383;&#12426;&#12289;
    &#26399;&#24453;&#12373;&#12428;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12354;&#12394;&#12383;&#20491;&#20154;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20313;&#35029;&#12364;&#12354;&#12427;&#12394;&#12425;&#23492;&#20184;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12450;&#12513;&#12522;&#12459;&#22269;&#20869;&#12363;&#12425;&#12384;&#12392;&#31246;&#37329;&#12364;&#25511;&#38500;&#12373;&#12428;&#12427;&#23492;&#20184;&#37329;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12414;&#12377;&#12375;&#12289;
    &#23492;&#20184;&#12373;&#12428;&#12383;&#12362;&#37329;&#12434;&#20351;&#12387;&#12390;&#20385;&#20516;&#12398;&#12354;&#12427;&#12469;&#12540;&#12499;&#12473;&#12364;&#25552;&#20379;&#12373;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp1278016" href="#idp1278016" class="para">21</a>] </sup>
    &#12481;&#12515;&#12531;&#12493;&#12523;&#12488;&#12500;&#12483;&#12463;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399; <code class="literal">/topic</code> &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    IRC&#12467;&#12510;&#12531;&#12489;&#12399;&#20840;&#12390; "<code class="literal">/</code>" &#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;
    IRC&#12398;&#20351;&#12356;&#26041;&#12420;&#12481;&#12515;&#12531;&#12493;&#12523;&#12398;&#31649;&#29702;&#12395;&#24931;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;
    <a class="ulink" href="http://www.irchelp.org/" target="_top">http://www.irchelp.org/</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;:
    &#29305;&#12395; <a class="ulink" href="http://www.irchelp.org/irchelp/irctutorial.html" target="_top">http://www.irchelp.org/irchelp/irctutorial.html</a> &#12399;&#20778;&#12428;&#12383;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-tracker.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="rss.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> RSS &#12501;&#12451;&#12540;&#12489;</td></tr></table></div></body></html>
