<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="poss2-gov-tbd-7.html" title="Have a Plan to Handle Negative Reactions"><link rel="next" href="license-aspects.html" title="&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#29305;&#24500;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="poss2-gov-tbd-7.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="license-aspects.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;"><div class="titlepage"><div><div><h2 class="title"><a name="legal"></a>&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="legal.html#licenses-terminology">&#20351;&#29992;&#12377;&#12427;&#29992;&#35486;</a></span></dt><dt><span class="sect1"><a href="license-aspects.html">&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#29305;&#24500;</a></span></dt><dt><span class="sect1"><a href="license-compatibility.html">GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;</a></span></dt><dt><span class="sect1"><a href="license-choosing.html">&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36984;&#12406;</a></span></dt><dd><dl><dt><span class="sect2"><a href="license-choosing.html#license-choosing-mit-x">MIT/X Window System &#12521;&#12452;&#12475;&#12531;&#12473;</a></span></dt><dt><span class="sect2"><a href="license-choosing.html#license-choosing-gpl">GPL</a></span></dt><dd><dl><dt><span class="sect3"><a href="license-choosing.html#is-the-gpl-free">GPL &#12399;&#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12394;&#12398;&#12363;?</a></span></dt></dl></dd><dt><span class="sect2"><a href="license-choosing.html#license-bsd">BSD&#12521;&#12452;&#12475;&#12531;&#12473; &#12399;&#12393;&#12358;&#12394;&#12398;?</a></span></dt></dl></dd><dt><span class="sect1"><a href="copyright-assignment.html">&#33879;&#20316;&#27177;&#12398;&#20445;&#26377;&#12392;&#35698;&#28193;</a></span></dt><dd><dl><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-none">&#20309;&#12418;&#23550;&#20966;&#12375;&#12394;&#12356;</a></span></dt><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-cla">&#36002;&#29486;&#32773;&#12521;&#12452;&#12475;&#12531;&#12473;&#21516;&#24847;&#26360;(CLA)</a></span></dt><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-transfer">&#33879;&#20316;&#27177;&#12398;&#35698;&#28193;</a></span></dt></dl></dd><dt><span class="sect1"><a href="dual-licensing.html">&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;</a></span></dt><dt><span class="sect1"><a href="patents.html">&#29305;&#35377;</a></span></dt><dt><span class="sect1"><a href="licensing-further-resources.html">&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>
    &#12354;&#12394;&#12383;&#12364;&#36984;&#12406;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;&#12381;&#12428;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12354;&#12427;&#38480;&#12426;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#25505;&#29992;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#22823;&#12365;&#12394;&#24433;&#38911;&#12434;&#19982;&#12360;&#12394;&#12356;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#27231;&#33021;&#12420;&#36074;&#12434;&#35211;&#12390;&#36984;&#12406;&#12371;&#12392;&#12364;&#19968;&#33324;&#30340;&#12391;&#12289;
    &#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#35443;&#32048;&#12434;&#35211;&#12390;&#36984;&#12435;&#12384;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12391;&#12418;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25505;&#29992;&#12377;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#30446;&#30340;&#12395;&#30906;&#23455;&#12395;&#21512;&#12387;&#12383;&#12418;&#12398;&#12395;&#12377;&#12427;&#12371;&#12392;&#12392;&#12289;
    &#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#38306;&#12377;&#12427;&#27770;&#23450;&#12434;&#20182;&#12398;&#20154;&#12392;&#35696;&#35542;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#21839;&#38988;&#12395;&#38306;&#12377;&#12427;&#22522;&#26412;&#30340;&#12394;&#12371;&#12392;&#12364;&#12425;&#12399;&#12420;&#12399;&#12426;&#29702;&#35299;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#31169;&#12399;&#27861;&#24459;&#23478;&#12391;&#12399;&#12394;&#12356;&#12391;&#12377;&#12375;&#12289;&#12371;&#12398;&#31456;&#12398;&#20869;&#23481;&#12418;&#12289;
    &#27861;&#30340;&#12394;&#12450;&#12489;&#12496;&#12452;&#12473;&#12434;&#27491;&#24335;&#12395;&#21463;&#12369;&#12390;&#26360;&#12356;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12381;&#12358;&#12377;&#12427;&#12395;&#12399;&#12289;&#27861;&#24459;&#23478;&#12434;&#38599;&#12358;&#12363;&#12289;&#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#27861;&#24459;&#23478;&#12395;&#12394;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290; 
</p></div><div class="sect1" title="&#20351;&#29992;&#12377;&#12427;&#29992;&#35486;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="licenses-terminology"></a>&#20351;&#29992;&#12377;&#12427;&#29992;&#35486;</h2></div></div></div><p>
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#12388;&#12356;&#12390;&#35696;&#35542;&#12377;&#12427;&#12392;&#12365;&#12395;&#12414;&#12378;&#26126;&#12425;&#12363;&#12395;&#12394;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#21516;&#12376;&#24847;&#21619;&#12434;&#25345;&#12388;&#30064;&#12394;&#12427;&#21336;&#35486;&#12364;&#12383;&#12367;&#12373;&#12435;&#12354;&#12427;&#12425;&#12375;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400; <em class="firstterm">&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</em>&#12289;
    <em class="firstterm">&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;</em>&#12289;<em class="firstterm">FOSS</em>&#12289;
    <em class="firstterm">F/OSS</em>&#12289;&#12381;&#12375;&#12390; <em class="firstterm">FLOSS</em> &#12391;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12399;&#12289;&#12381;&#12358;&#12375;&#12383;&#29992;&#35486;&#12434;&#20182;&#12398;&#35328;&#33865;&#12392;&#19968;&#32210;&#12395;&#25972;&#29702;&#12377;&#12427;&#12371;&#12392;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="variablelist"><dl><dt><span class="term"><em class="firstterm">&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</em></span></dt><dd><p>
                  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#33258;&#30001;&#12395;&#20849;&#26377;&#12375;&#12289;
                  &#12363;&#12388;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
                  &#12371;&#12398;&#29992;&#35486;&#12399; &#12522;&#12481;&#12515;&#12540;&#12489;&#12539;&#12473;&#12488;&#12540;&#12523;&#12510;&#12531; &#12364;&#12399;&#12376;&#12417;&#12395;&#20316;&#12426;&#12289;
                  GNU General Public Licence (&#19968;&#33324;&#20844;&#34886;&#21033;&#29992;&#35377;&#35582;&#22865;&#32004;&#26360;&#12289;
                  &#20197;&#19979; GPL) &#12395;&#30427;&#12426;&#36796;&#12415;&#12414;&#12375;&#12383;&#12290;
                  &#12381;&#12375;&#12390; Free Software Foundation (&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243;&#12289;
                  &#20197;&#19979; FSF&#12289;<a class="ulink" href="http://www.fsf.org/" target="_top">http://www.fsf.org/</a>)
                  &#12434;&#35373;&#31435;&#12375;&#12390;&#12371;&#12398;&#27010;&#24565;&#12434;&#24195;&#12417;&#12383;&#12398;&#12391;&#12377;&#12290;
              </p><p>
                  &#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12356;&#12358;&#29992;&#35486;&#12399;&#12289;
                   &#12477;&#12501;&#12488;&#12454;&#12455;&#12450; &#12398;&#31684;&#30087;&#12391;&#12399;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12392;&#12411;&#12392;&#12435;&#12393;&#21516;&#12376;&#24847;&#21619;&#12391;&#12377;&#12290;
                   &#12375;&#12363;&#12375;&#12289;&#12392;&#12426;&#12431;&#12369; FSF &#12399;&#21069;&#32773;&#12434;&#22909;&#12415;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
                  &#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12398;&#26041;&#12364;&#12289;&#33258;&#30001;&#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12420;&#12289;
                   &#25216;&#34899;&#30340;&#12394;&#27969;&#34892;&#12391;&#12399;&#12394;&#12367;&#12390;&#20309;&#12424;&#12426;&#31038;&#20250;&#36939;&#21205;&#12392;&#12375;&#12390;&#12398;&#12289;
                   &#33258;&#30001;&#12395;&#20877;&#37197;&#24067;&#21487;&#33021;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12289;
                   &#12392;&#12356;&#12358;&#32771;&#12360;&#12434;&#24375;&#35519;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
                   FSF &#12399;&#12289;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#21336;&#35486;&#12364; &#8212; &#12300;&#33258;&#30001;&#12301;&#12391;&#12399;&#12394;&#12367;&#12289;
                  &#12300;&#12467;&#12473;&#12488;&#12364;&#12363;&#12363;&#12425;&#12394;&#12356;&#12301;&#12289;&#12392;&#35299;&#37320;&#12373;&#12428;&#24471;&#12427;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;
                   &#8212; &#26326;&#26151;&#12394;&#12418;&#12398;&#12384;&#12392;&#35469;&#12417;&#12390;&#12356;&#12414;&#12377;&#12290;
                   &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#33394;&#12293;&#32771;&#12360;&#12390;&#12415;&#12390;&#12289;
                   &#12501;&#12522;&#12540;&#12392;&#12356;&#12358;&#21336;&#35486;&#12364;&#12420;&#12399;&#12426;&#19968;&#30058;&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12375;&#12289;
                   &#20182;&#12398;&#33521;&#21336;&#35486;&#12395;&#12418;&#26326;&#26151;&#12394;&#37096;&#20998;&#12364;&#12354;&#12427;&#12392;&#12418;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
                   (&#26412;&#26360;&#12391;&#12399;&#12289;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#21336;&#35486;&#12434;&#12300;&#12467;&#12473;&#12488;&#12364;&#12363;&#12363;&#12425;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12394;&#12367;&#12289;
                   &#12300;&#33258;&#30001;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;)
              </p></dd><dt><span class="term"><em class="firstterm">&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</em></span></dt><dd><p>
                  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450; &#12398;&#21029;&#21517;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;
                  &#12371;&#12398;&#21517;&#21069;&#12398;&#36949;&#12356;&#12399;&#37325;&#35201;&#12394;&#21746;&#23398;&#12398;&#36949;&#12356;&#12434;&#21453;&#26144;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                  &#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12392;&#12356;&#12358;&#21336;&#35486;&#12399;&#12289;Open Source Initiative
                  (&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12539;&#12452;&#12491;&#12471;&#12450;&#12486;&#12451;&#12502;&#12289;&#20197;&#19979; OSI&#12290; <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>) &#12364;
                  &#31038;&#20250;&#36939;&#21205;&#12424;&#12426;&#12399;&#12416;&#12375;&#12429;&#38283;&#30330;&#12398;&#26041;&#27861;&#35542;&#12392;&#12375;&#12390;&#12398;&#24847;&#21619;&#12434;&#24375;&#35519;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
                  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12424;&#12426;&#20225;&#26989;&#12364;&#21463;&#12369;&#20837;&#12428;&#12420;&#12377;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;&#20316;&#12426;&#12414;&#12375;&#12383;&#12290;
                  OSI &#12399;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;
                  &#20302;&#21697;&#36074;&#12395;&#36949;&#12356;&#12394;&#12356;&#12392;&#24605;&#12431;&#12428;&#12390;&#12375;&#12414;&#12358;&#28857;&#12418;&#20811;&#26381;&#12375;&#12383;&#12363;&#12387;&#12383;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
              </p><p>
                  &#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12418;&#12354;&#12426;&#12289;
                  (2,3 &#12398;&#23567;&#12373;&#12394;&#20363;&#22806;&#12434;&#38500;&#12365;) &#36870;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#35328;&#12360;&#12414;&#12377;&#12364;&#12289;
                  &#20154;&#12293;&#12399;&#12402;&#12392;&#12388;&#12398;&#29992;&#35486;&#12434;&#21462;&#12426;&#19978;&#12370;&#12390;&#12381;&#12428;&#12395;&#22266;&#22519;&#12375;&#12364;&#12385;&#12391;&#12377;&#12290;
                  &#19968;&#33324;&#30340;&#12395;&#12289;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12434;&#22909;&#12416;&#20154;&#12383;&#12385;&#12399;&#12300;&#12501;&#12522;&#12540;&#12301;&#12364;&#25345;&#12388;&#24847;&#21619;&#12395;&#12388;&#12356;&#12390;&#12289;
                  &#21746;&#23398;&#30340;&#12289;&#12414;&#12383;&#12399;&#36947;&#24499;&#30340;&#12394;&#31435;&#22580;&#12434;&#22909;&#12416;&#12398;&#12395;&#23550;&#12375;&#12390;&#12289;
                 &#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12434;&#22909;&#12416;&#20154;&#12383;&#12385;&#12399;&#12381;&#12428;&#12364;&#12300;&#33258;&#30001;&#12301;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;&#12384;&#12392;&#12399;&#32771;&#12360;&#12414;&#12379;&#12435;&#12375;&#12289;
                 &#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12434;&#22909;&#12416;&#20154;&#12398;&#32771;&#12360;&#26041;&#12434;&#24195;&#12417;&#12427;&#12371;&#12392;&#12395;&#12418;&#33288;&#21619;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                  &#12371;&#12398;&#20108;&#12388;&#12398;&#29992;&#35486;&#12395;&#38306;&#12377;&#12427;&#20998;&#35010;&#12398;&#27508;&#21490;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
                  <span><a class="xref" href="introduction.html" title="&#31532;1&#31456; &#23566;&#20837;">1&#31456;<i>&#23566;&#20837;</i></a> &#12398; </span>
                  <a class="xref" href="introduction.html#free-vs-open-source" title="&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;">&#12300;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
              </p><p>
                  FSF &#12399; &#8212; &#31169;&#12398;&#23436;&#20840;&#12394;&#20027;&#35251;&#12391;&#12377;&#12364;&#12289;&#24494;&#22937;&#12394;&#12364;&#12425;&#26997;&#12417;&#12390;&#20844;&#24179;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391; &#8212;
                  &#12371;&#12428;&#12425;&#12398;&#20108;&#12388;&#12398;&#29992;&#35486;&#12395;&#12388;&#12356;&#12390;&#20778;&#12428;&#12383;&#35299;&#37320;&#12434;
                  <a class="ulink" href="http://www.fsf.org/licensing/essays/free-software-for-freedom.html" target="_top">http://www.fsf.org/licensing/essays/free-software-for-freedom.html</a>
                  &#12391;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;OSI &#12399;&#12289;&#33258;&#12425;&#12398;&#35299;&#37320;&#12434;2&#12506;&#12540;&#12472;&#12395;&#20998;&#12369;&#12390;&#32057;&#20171;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;:
                  <a class="ulink" href="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a> &#12392;
                  <a class="ulink" href="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/free-notfree.php" target="_top">http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/free-notfree.php</a> &#12391;&#12377;&#12290;
              </p></dd><dt><span class="term"><em class="firstterm">FOSS</em>,
                      <em class="firstterm">F/OSS</em>,
                      <em class="firstterm">FLOSS</em></span></dt><dd><p>
                  &#20108;&#12388;&#12354;&#12427;&#12418;&#12398;&#12364;&#19977;&#12388;&#12395;&#12394;&#12427;&#12290;
                  &#12371;&#12428;&#12399;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12356;&#12358;&#29992;&#35486;&#12391;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12392;&#20840;&#12367;&#21516;&#12376;&#12391;&#12377;&#12290;
                  &#23398;&#21839;&#12398;&#19990;&#30028;&#12391;&#12399;&#12289;
                  &#35328;&#33865;&#12398;&#19978;&#12387;&#38754;&#12398;&#32654;&#12375;&#12373;&#12424;&#12426;&#12418;&#27491;&#30906;&#12373;&#12392;&#21253;&#25324;&#24615;&#12434;&#27714;&#12417;&#12390;&#12289;
                  "Free / Open Source Software" &#12434;&#34920;&#12377; FOSS
                  &#12420; F/OSS &#12395;&#31227;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
                  &#21218;&#12356;&#12364;&#12354;&#12427;&#21029;&#12398;&#34920;&#29694;&#12392;&#12375;&#12390;&#12289;
                  "Free / Libre Open Source Software" &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                  (<span class="foreignphrase"><em class="foreignphrase">libre</em></span><sup>[<a name="idp3142656" href="#ftn.idp3142656" class="footnote">37</a>]</sup>
                  &#12392;&#12356;&#12358;&#21336;&#35486;&#12399;&#12289;
                  &#22810;&#12367;&#12398;&#35328;&#33865;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12394;&#12364;&#12425;&#12289;&#12300;&#12501;&#12522;&#12540;&#12301;&#12364;&#25345;&#12388;&#26326;&#26151;&#12394;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                  &#35443;&#12375;&#12367;&#12399; <a class="ulink" href="http://en.wikipedia.org/wiki/FLOSS" target="_top">http://en.wikipedia.org/wiki/FLOSS</a>
 &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;)
              </p><p>
                  &#12371;&#12428;&#12425;&#12398;&#29992;&#35486;&#12399;&#20840;&#12390;&#12289;&#26412;&#36074;&#30340;&#12395;&#12399;&#21516;&#12376;&#24847;&#21619;&#12391;&#12377;&#12290;
                  &#25913;&#36896;&#12375;&#12289;&#19975;&#20154;&#12364;&#37197;&#24067;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#26178;&#12395;
                  &#8212; &#24517;&#12378;&#12375;&#12418;&#24120;&#12395;&#12381;&#12358;&#12391;&#12354;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12391;&#12377;&#12364;
                  &#8212; &#27966;&#29983;&#12375;&#12383;&#12418;&#12398;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
                  &#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#37197;&#24067;&#26465;&#20214;&#12392;&#21516;&#26465;&#20214;&#12391;&#33258;&#30001;&#12395;&#37197;&#24067;&#12377;&#12427;&#12371;&#12392;&#12434;&#27714;&#12417;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
              </p></dd><dt><span class="term"><em class="firstterm">DFSG &#20114;&#25563;&#12398; ...</em></span></dt><dd><p>
                  Debian &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531; (&#20197;&#19979; DFSG&#12289;<a class="ulink" href="http://www.debian.org/social_contract#guidelines" target="_top">http://www.debian.org/social_contract#guidelines</a>) &#12392;&#20114;&#25563;&#24615;&#12364;&#12354;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
                  DFSG &#20114;&#25563;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;
                  &#29305;&#23450;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#26412;&#24403;&#12398;&#24847;&#21619;&#12391;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;
                  (&#12501;&#12522;&#12540;&#12289;&#33258;&#30001;) &#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#22522;&#28310;&#12392;&#12375;&#12390;&#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
                  Debian &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20219;&#21209;&#12399;&#12289;
                  &#12471;&#12473;&#12486;&#12512;&#12398;&#19968;&#37096;&#12414;&#12383;&#12399;&#20840;&#37096;&#12434;&#25913;&#22793;&#12289;
                  &#20877;&#37197;&#24067;&#12377;&#12427;&#27177;&#21033;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30097;&#12431;&#12378;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#12289;
                  &#20840;&#20307;&#12364;&#12501;&#12522;&#12540;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#32173;&#25345;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
                  DFSG &#12399;&#12289;Debian &#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#21547;&#12417;&#12427;&#38555;&#12395;&#12289;
                  &#12381;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#28288;&#12383;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#22522;&#28310;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
                  Debian &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;
                  DFSG &#12398;&#22522;&#28310;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12420;&#12426;&#26041;&#12434;&#32771;&#12360;&#12427;&#12398;&#12395;&#22810;&#12367;&#12398;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
                  &#12424;&#12387;&#12390;&#12289;&#24444;&#12425;&#12364;&#32771;&#12360;&#12383;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#38750;&#24120;&#12395;&#22533;&#22266;&#12391;&#12289;
                  &#31169;&#12364;&#30693;&#12427;&#38480;&#12426;&#12391;&#12399;&#12289;
                  FSF &#12363;&#12425;&#12418; OSI &#12363;&#12425;&#12418;&#24375;&#12367;&#30064;&#35696;&#12434;&#21809;&#12360;&#12425;&#12428;&#12383;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                  &#29305;&#23450;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364; DFSG &#20114;&#25563;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12428;&#12400;&#12289;
                  (&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#20316;&#32773;&#12398;&#24847;&#12395;&#21453;&#12375;&#12390;&#12391;&#12418;&#12467;&#12540;&#12489;&#12434;&#27966;&#29983;&#12373;&#12379;&#12425;&#12428;&#12427;&#12371;&#12392;&#12289;&#12398;&#12424;&#12358;&#12394;)
                  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21147;&#23398;&#12434;&#32173;&#25345;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;&#12300;&#33258;&#30001;&#12301;&#12434;&#12289;
                  &#12381;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#20445;&#35388;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                  &#12371;&#12398;&#31456;&#12391;&#35696;&#35542;&#12375;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399; DFSG&#20114;&#25563;&#12391;&#12377;&#12290;
              </p></dd><dt><span class="term"><em class="firstterm">OSI&#12398;&#25215;&#35469;&#12434;&#24471;&#12383; ...</em></span></dt><dd><p>
                  OSI &#12364;&#35469;&#12417;&#12383;&#12521;&#12452;&#12475;&#12531;&#12473;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
                  &#12371;&#12428;&#12399;&#29305;&#23450;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#12289;
                  &#24517;&#35201;&#12392;&#12373;&#12428;&#12390;&#12356;&#12427;&#33258;&#30001;&#12434;&#12377;&#12409;&#12390;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#12363;&#12417;&#12427;&#12398;&#12395;&#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12418;&#12358;&#19968;&#12388;&#12398;&#22522;&#28310;&#12391;&#12377;&#12290;
                  OSI &#12364;&#23450;&#32681;&#12375;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#23450;&#32681;&#12399;&#12289;
                  DFSG &#12434;&#22522;&#12395;&#12375;&#12390;&#12362;&#12426;&#12289;
                  &#12371;&#12398;&#23450;&#32681;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;DFSG &#12418;&#28288;&#12383;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                  &#12371;&#12398;&#12371;&#12392;&#12399;&#12289;&#38263;&#12356;&#27508;&#21490;&#12398;&#20013;&#12391; 2&#12289;3&#12398;&#20363;&#22806;&#12399;&#12354;&#12427;&#12418;&#12398;&#12398;&#12289;
                  &#12381;&#12398;&#20363;&#22806;&#12399;&#12491;&#12483;&#12481;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12420;&#12289;
                  &#20840;&#12367;&#38306;&#36899;&#12398;&#12394;&#12356;&#12418;&#12398;&#12384;&#12369;&#12391;&#12377;&#12290;
                  Debian Project &#12392;&#12399;&#30064;&#12394;&#12426;&#12289;
                  OSI &#12399;&#12371;&#12428;&#12414;&#12391;&#25215;&#35469;&#12375;&#12390;&#12365;&#12383;&#12377;&#12409;&#12390;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434; <a class="ulink" href="http://www.opensource.org/licenses/" target="_top">http://www.opensource.org/licenses/</a> &#12391;&#19968;&#35239;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                  &#12424;&#12387;&#12390;&#12289;&#12300;OSI&#12364;&#25215;&#35469;&#12377;&#12427;&#12301;&#12371;&#12392;&#12395;&#12399;&#26326;&#26151;&#12373;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                  &#12394;&#12380;&#12394;&#12425;&#12289;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#12381;&#12398;&#19968;&#35239;&#12395;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12391;&#12289;
                  OSI&#12364;&#25215;&#35469;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12364;&#27770;&#12414;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
              </p><p>
                  FSF &#12418;&#12289;&#33258;&#12425;&#12364;&#35469;&#12417;&#12383;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#19968;&#35239;&#12434; <a class="ulink" href="http://www.fsf.org/licensing/licenses/license-list.html" target="_top">http://www.fsf.org/licensing/licenses/license-list.html</a> &#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                  FSF &#12399;&#12501;&#12522;&#12540;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
                  GPL &#12392;&#20114;&#25563;&#24615;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12391;&#12418;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#20998;&#39006;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                  GPL &#12392;&#20114;&#25563;&#24615;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#37325;&#35201;&#12394;&#35441;&#38988;&#12394;&#12398;&#12391;&#12289;
                  <span> &#24460;&#12395;&#12354;&#12427; </span><a class="xref" href="license-compatibility.html" title="GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;">&#12300;GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;&#12301;</a> &#12391;&#25201;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
              </p></dd><dt><span class="term"><em class="firstterm">&#29420;&#21344;&#30340;(&#12503;&#12525;&#12503;&#12521;&#12452;&#12456;&#12479;&#12522;&#65289;&#12394;</em>&#12289;
                      <em class="firstterm">&#12463;&#12525;&#12540;&#12474;&#12489;&#12477;&#12540;&#12473;</em></span></dt><dd><p>
                  &#12300;&#12501;&#12522;&#12540;&#12301;&#12420;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12392;&#12399;&#21453;&#23550;&#12398;&#24847;&#21619;&#12391;&#12377;&#12290;
                  &#12467;&#12500;&#12540;&#12402;&#12392;&#12388;&#27598;&#12395;&#12362;&#37329;&#12434;&#25903;&#25173;&#12358;&#12363;&#12289;
                  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#21147;&#23398;&#12434;&#22952;&#12370;&#12427;&#12398;&#12395;&#20805;&#20998;&#21046;&#38480;&#30340;&#12394;&#26465;&#20214;&#12434;&#36969;&#29992;&#12375;&#12383;&#12289;
                  &#20253;&#32113;&#30340;&#12394;&#12525;&#12452;&#12516;&#12522;&#12486;&#12451;&#12505;&#12540;&#12473;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#37197;&#24067;&#12373;&#12428;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
                  &#28961;&#26009;&#12391;&#37197;&#24067;&#12373;&#12428;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12418;&#12289;
                  &#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#33258;&#30001;&#12394;&#25913;&#22793;&#12420;&#20877;&#37197;&#24067;&#12434;&#35469;&#12417;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;
                  &#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12394;&#12426;&#24471;&#12414;&#12377;&#12290;
              </p><p>
                  &#12300;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12420;&#12300;&#12463;&#12525;&#12540;&#12474;&#12489;&#12477;&#12540;&#12473;&#12301;&#12399;&#19968;&#33324;&#30340;&#12395;&#21516;&#12376;&#24847;&#21619;&#12391;&#12377;&#12290;
                  &#12375;&#12363;&#12375;&#12289;&#12300;&#12463;&#12525;&#12540;&#12474;&#12489;&#12477;&#12540;&#12473;&#12301;&#12399;&#12289;
                  &#12373;&#12425;&#12395;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#35211;&#12427;&#12371;&#12392;&#12373;&#12360;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12418;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12399;&#12411;&#12392;&#12435;&#12393;&#12398;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#35211;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12398;&#12391;&#12289;&#12371;&#12428;&#12425;&#12434;&#21306;&#21029;&#12377;&#12427;&#12371;&#12392;&#12399;&#26222;&#36890;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                  &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#35211;&#12427;&#12398;&#12434;&#35377;&#21487;&#12377;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
                  &#24444;&#12425;&#12399;&#12381;&#12428;&#12434;&#12289;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12420;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12395;&#36817;&#12356;&#12301;&#12394;&#12393;&#12392;&#32027;&#12425;&#12431;&#12375;&#12356;&#21628;&#12403;&#26041;&#12434;&#12377;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;
                  &#12371;&#12428;&#12399;&#35492;&#35299;&#12434;&#25307;&#12367;&#35328;&#12356;&#26041;&#12391;&#12377;&#12290;
                  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12364; <span class="emphasis"><em>&#25163;&#12395;&#20837;&#12427;</em></span> &#12363;&#12393;&#12358;&#12363;&#12398;&#21839;&#38988;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12381;&#12428;&#12434;&#20351;&#12387;&#12390;&#20309;&#12364;&#12391;&#12365;&#12427;&#12398;&#12363;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
                  &#12424;&#12387;&#12390;&#12289;&#12300;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12392;&#12300;&#12463;&#12525;&#12540;&#12474;&#12489;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;&#12399;&#12411;&#12392;&#12435;&#12393;&#28961;&#24847;&#21619;&#12391;&#12377;&#12363;&#12425;&#12289;&#12371;&#12428;&#12425;&#12399;&#21516;&#12376;&#24847;&#21619;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
              </p><p>
                  &#12300;<em class="firstterm">&#21830;&#29992;&#12398;</em>&#12301; &#12392;&#12356;&#12358;&#35328;&#33865;&#12364;&#12289;
                 &#12300;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;&#12398;&#21029;&#21517;&#12392;&#12375;&#12390;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                 &#12375;&#12363;&#12375;&#12289;&#27491;&#30906;&#12395;&#35328;&#12358;&#12392;&#12289;&#12371;&#12428;&#12425;&#12399;&#21516;&#12376;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                 &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12418;&#21830;&#29992;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                 &#32080;&#23616;&#12289;&#36023;&#12358;&#20154;&#12364;&#12467;&#12500;&#12540;&#12377;&#12427;&#27177;&#21033;&#12434;&#21046;&#38480;&#12375;&#12394;&#12356;&#38480;&#12426;&#12289;
                 &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#22770;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
                 &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#20182;&#12398;&#12420;&#12426;&#26041;&#12289;
                 &#12383;&#12392;&#12360;&#12400;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12469;&#12509;&#12540;&#12488;&#12420;&#12289;
                 &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12387;&#12383;&#12469;&#12540;&#12499;&#12473;&#12420;&#12289;
                 &#36039;&#26684;&#12434;&#22770;&#12387;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#21830;&#29992;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
                 &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12387;&#12390;&#24040;&#19975;&#12398;&#23500;&#12434;&#31689;&#12356;&#12383;&#20225;&#26989;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
                 &#12424;&#12387;&#12390;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#21830;&#29992;&#12395;&#12391;&#12365;&#12394;&#12356;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
                 &#20225;&#26989;&#12364;&#20351;&#12360;&#12394;&#12356;&#12431;&#12369;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                 &#19968;&#26041;&#12391;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#26412;&#36074;&#30340;&#12395;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12399; <span class="emphasis"><em>&#30456;&#23481;&#12428;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;</em></span>&#12290;
                 &#12381;&#12428;&#12371;&#12381;&#12364;&#12289;&#12467;&#12500;&#12540;&#12377;&#12427;&#27598;&#12395;&#12362;&#37329;&#12364;&#24517;&#35201;&#12394;&#12289;
                 &#20253;&#32113;&#30340;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12514;&#12487;&#12523;&#12392;&#30064;&#12394;&#12427;&#37325;&#35201;&#12394;&#28857;&#12394;&#12398;&#12391;&#12377;&#12290;
              </p></dd><dt><span class="term"><em class="firstterm">&#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;</em></span></dt><dd><p>
                  &#33879;&#20316;&#27177;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
                  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12500;&#12540;&#12434;&#21046;&#38480;&#12377;&#12427;&#20154;&#12364;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
                  &#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#12289;&#20316;&#32773;&#12364;&#12356;&#12394;&#12356;&#12371;&#12392;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
                  &#12393;&#12435;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12418;&#20316;&#32773;&#12364;&#12356;&#12414;&#12377;&#12364;&#12289;
                  &#12381;&#12398;&#20316;&#32773;&#12364;&#26360;&#12356;&#12383;&#12418;&#12398;&#12434;&#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#36984;&#12435;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;
                  &#29305;&#23450;&#12398;&#20154;&#12364;&#26360;&#12356;&#12383;&#12392;&#12356;&#12358;&#20107;&#23455;&#12434;&#21205;&#12363;&#12377;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
              </p><p>
                  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12395;&#32622;&#12363;&#12428;&#12383;&#22580;&#21512;&#12289;
                  &#12381;&#12398;&#27083;&#25104;&#35201;&#32032;&#12399;&#33879;&#20316;&#27177;&#12364;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#32068;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
                  &#32068;&#12415;&#36796;&#12414;&#12428;&#12383;&#37096;&#20998;&#12398; <span class="emphasis"><em>&#12467;&#12500;&#12540;</em></span> &#12395;&#12418;&#12289;
                  &#32068;&#12415;&#36796;&#12435;&#12384;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#33879;&#20316;&#27177;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
                  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#20803;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#21033;&#29992;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;&#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12398;&#12414;&#12414;&#12391;&#12377;&#12290;
                  &#12424;&#12387;&#12390;&#12289;&#12522;&#12522;&#12540;&#12473;&#12375;&#12383;&#12418;&#12398;&#12434;&#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12395;&#32622;&#12367;&#12371;&#12392;&#12399;&#12289;
                  &#12411;&#12392;&#12435;&#12393;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#35469;&#23450;&#12375;&#12390;&#12356;&#12427;&#32068;&#32340;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#29031;&#12425;&#12375;&#12390;&#12289;
                  &#25216;&#34899;&#30340;&#12395;&#12300;&#12501;&#12522;&#12540;&#12301;&#12395;&#12377;&#12427;&#26041;&#27861;&#12398;&#19968;&#12388;&#12391;&#12377;&#12290;
                  &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12383;&#12392;&#12360;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
                  &#12497;&#12502;&#12522;&#12483;&#12463;&#12489;&#12513;&#12452;&#12531;&#12395;&#32622;&#12367;&#12424;&#12426;&#12399;&#20309;&#12425;&#12363;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#25505;&#29992;&#12375;&#12383;&#26041;&#12364;&#12424;&#12356;&#29702;&#30001;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#33879;&#20316;&#27177;&#12434;&#25345;&#12388;&#20154;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
                  &#12381;&#12428;&#12434;&#21463;&#12369;&#21462;&#12427;&#20154;&#12383;&#12385;&#12395;&#23550;&#12375;&#12390;&#12418;&#12289;&#21046;&#38480;&#12434;&#35506;&#12379;&#12400;&#24441;&#12395;&#31435;&#12388;&#22580;&#21512;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
                  &#12371;&#12358;&#12375;&#12383;&#20596;&#38754;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#26126;&#12425;&#12363;&#12395;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
              </p></dd><dt><span class="term"><em class="firstterm">&#12467;&#12500;&#12540;&#12524;&#12501;&#12488;</em></span></dt><dd><p>
                  &#20253;&#32113;&#30340;&#12394;&#33879;&#20316;&#27177;&#12392;&#21453;&#23550;&#12398;&#32080;&#26524;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12289;
                  &#33879;&#20316;&#27177;&#12395;&#38306;&#12377;&#12427;&#27861;&#24459;&#12434;&#21033;&#29992;&#12375;&#12390;&#12356;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
                  &#12371;&#12398;&#24847;&#21619;&#12399;&#12289;
                  &#12371;&#12398;&#31456;&#12391;&#35696;&#35542;&#12375;&#12390;&#12356;&#12427;&#33258;&#30001;&#12434;&#35469;&#12417;&#12383;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12371;&#12392;&#12418;&#12354;&#12428;&#12400;&#12289;
                  &#12418;&#12387;&#12392;&#29421;&#32681;&#12391;&#12399;&#12289;
                  &#12381;&#12398;&#33258;&#30001;&#12364;&#20253;&#25773;&#12375;&#12390;&#12356;&#12367;&#12371;&#12392;&#12434;&#32681;&#21209;&#20184;&#12369;&#12427;&#12371;&#12392;&#12391;&#12289;
                  &#33258;&#30001;&#12434;&#35469;&#12417;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367; <span class="emphasis"><em>&#24375;&#21046;</em></span> &#12418;&#12375;&#12390;&#12356;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
                  FSF &#12399;&#24460;&#32773;&#12398;&#23450;&#32681;&#12384;&#12369;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
                  &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;5&#20998;5&#20998;&#12391;&#12377;&#12290;
                  &#12388;&#12414;&#12426;&#12289;&#22810;&#12367;&#12398;&#20154;&#12293;&#12399; FSF &#12392;&#21516;&#12376;&#20351;&#12356;&#26041;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
                  &#12381;&#12428;&#20197;&#22806;&#12399;
                  &#8212; &#20027;&#27969;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12513;&#12487;&#12451;&#12450;&#12398;&#35352;&#20107;&#12434;&#26360;&#12367;&#20154;&#12383;&#12385;&#12399;
                  &#8212; &#21069;&#32773;&#12398;&#23450;&#32681;&#12434;&#20351;&#12358;&#20670;&#21521;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                  &#12371;&#12398;&#29992;&#35486;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12364;&#12289;
                  &#21306;&#21029;&#12377;&#12409;&#12365;&#20351;&#12356;&#26041;&#12364;&#12354;&#12427;&#12398;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
              </p><p>
                  &#24460;&#32773;&#12398;&#24847;&#21619;&#12391;&#12398;&#27161;&#28310;&#30340;&#12394;&#20351;&#12356;&#26041;&#12398;&#20363;&#12420;&#12289;&#21427;&#23494;&#12394;&#23450;&#32681;&#12392;&#12375;&#12390;&#12399;&#12289;
                  &#27966;&#29983;&#29289;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#21516;&#12376;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#32681;&#21209;&#20184;&#12369;&#12390;&#12356;&#12427; GPL &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                  &#35443;&#12375;&#12367;&#12399;&#12289;<span> &#24460;&#12395;&#12354;&#12427; </span><a class="xref" href="license-compatibility.html" title="GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;">&#12300;GPL &#12392;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20114;&#25563;&#24615;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
              </p></dd></dl></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3142656" href="#idp3142656" class="para">37</a>] </sup>&#12501;&#12521;&#12531;&#12473;&#35486;&#12391;&#12300;&#33258;&#30001;&#12394;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="poss2-gov-tbd-7.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="license-aspects.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">Have a Plan to Handle Negative Reactions </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#29305;&#24500;</td></tr></table></div></body></html>
