<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;"><link rel="prev" href="patents.html" title="&#29305;&#35377;"><link rel="next" href="canned-hosting-sites.html" title="&#20184;&#37682;A Canned Hosting Sites"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="patents.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</th><td width="20%" align="right"> <a accesskey="n" href="canned-hosting-sites.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="licensing-further-resources"></a>&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;</h2></div></div></div><p>
    &#12371;&#12398;&#31456;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#12377;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#21839;&#38988;&#12434;&#12373;&#12431;&#12426;&#12384;&#12369;&#32057;&#20171;
    &#12375;&#12383;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#31456;&#12398;&#35500;&#26126;&#12364;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12399;&#12376;&#12417;&#12427;&#12383;&#12417;&#12398;&#21313;&#20998;&#12394;&#24773;&#22577;&#28304;&#12395;&#12394;&#12427;&#12371;&#12392;&#12434;&#39000;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#30495;&#38754;&#30446;&#12395;&#12521;&#12452;&#12475;&#12531;&#12473;&#21839;&#38988;&#12434;&#35519;&#12409;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#12377;&#12368;&#12395;&#32025;&#38754;&#12364;&#23613;&#12365;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#20197;&#19979;&#12395;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#38306;&#12377;&#12427;&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;&#12434;&#19968;&#35239;&#12391;&#31034;&#12375;&#12414;&#12377;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
              <em class="citetitle">Understanding Open Source and Free
              Software Licensing</em> Andrew M. St. Laurent&#33879;&#12290;
              &#20986;&#29256;: O'Reilly Media&#12289;2004&#24180;8&#26376;&#21021;&#29256;&#12290;ISBN: 0-596-00581-4.
            </p><p>
            &#12371;&#12398;&#26412;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#38306;&#12377;&#12427;&#35079;&#38609;&#12394;&#21839;&#38988;&#20840;&#33324;&#12434;&#20313;&#12377;&#12392;&#12371;&#12429;&#12394;&#12367;&#35352;&#12375;&#12383;&#26412;&#12391;&#12377;&#12290;
            &#35443;&#32048;&#12399; <a class="ulink" href="http://www.oreilly.com/catalog/osfreesoft/" target="_top">http://www.oreilly.com/catalog/osfreesoft/</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            </p></li><li class="listitem"><p><em class="citetitle">Make Your Open Source Software
            GPL-Compatible.  Or Else.</em> David
            A. Wheeler&#20316;&#12290;
            <a class="ulink" href="http://www.dwheeler.com/essays/gpl-compatible.html" target="_top">http://www.dwheeler.com/essays/gpl-compatible.html</a>.</p><p>&#12371;&#12428;&#12399;&#12289;&#12383;&#12392;&#12360;&#12354;&#12394;&#12383;&#12364;GPL&#12434;&#25505;&#29992;&#12375;&#12394;&#12356;&#22580;&#21512;&#12391;&#12418;&#12289;
            &#12394;&#12380;GPL&#12392;&#20114;&#25563;&#24615;&#12364;&#12354;&#12427;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#37325;&#35201;&#12394;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;
            &#35443;&#32048;&#12395;&#12358;&#12414;&#12367;&#26360;&#12363;&#12428;&#12383;&#35352;&#20107;&#12391;&#12377;&#12290;&#12371;&#12398;&#35352;&#20107;&#12399;&#12289;&#20182;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#38306;&#12377;&#12427;
            &#30097;&#21839;&#12395;&#12388;&#12356;&#12390;&#12418;&#35302;&#12428;&#12390;&#12362;&#12426;&#12289;&#23494;&#24230;&#12398;&#28611;&#12356;&#20778;&#12428;&#12383;&#12522;&#12531;&#12463;&#38598;&#12418;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p></li><li class="listitem"><p><a class="ulink" href="http://creativecommons.org/" target="_top">http://creativecommons.org/</a></p><p>
            &#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12467;&#12514;&#12531;&#12474;&#12399;&#12289;
            &#12371;&#12428;&#12414;&#12391;&#12398;&#20253;&#32113;&#30340;&#12394;&#33879;&#20316;&#27177;&#12364;&#25512;&#12375;&#36914;&#12417;&#12390;&#12365;&#12383;&#12418;&#12398;&#12424;&#12426;&#12418;&#12289;&#22810;&#27096;&#12289;
            &#12363;&#12388;&#26580;&#36575;&#12391;&#12289;&#12522;&#12505;&#12521;&#12523;&#12394;&#33879;&#20316;&#27177;&#12434;&#24195;&#12417;&#12390;&#12356;&#12427;&#32068;&#32340;&#12391;&#12377;&#12290;
            &#24444;&#12425;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#21521;&#12369;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
            &#25991;&#31456;&#12289;&#33464;&#34899;&#12289;&#38899;&#27005;&#21521;&#12369;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12418;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12425;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;&#20351;&#12356;&#12420;&#12377;&#12356;&#12521;&#12452;&#12475;&#12531;&#12473;&#36984;&#25246;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;
            &#20840;&#12390;&#12364;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12425;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20013;&#12395;&#12399;&#12289;&#12467;&#12500;&#12540;&#12524;&#12501;&#12488;&#12398;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
            &#12467;&#12500;&#12540;&#12524;&#12501;&#12488;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12501;&#12522;&#12540;&#12394;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12414;&#12383;&#12289;&#20253;&#32113;&#30340;&#12394;&#33879;&#20316;&#27177;&#12398;&#20181;&#32068;&#12415;&#12434;&#25345;&#12388;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#12354;&#12426;&#12394;&#12364;&#12425;&#12289;
            &#12381;&#12398;&#21046;&#38480;&#12434;&#12356;&#12367;&#12425;&#12363;&#32233;&#12417;&#12383;&#12384;&#12369;&#12398;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12463;&#12522;&#12456;&#12452;&#12486;&#12451;&#12502;&#12467;&#12514;&#12531;&#12474;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12399;&#12289;
            &#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#12393;&#12435;&#12394;&#12418;&#12398;&#12394;&#12398;&#12363;&#12434;&#26997;&#12417;&#12390;&#26126;&#24555;&#12395;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36939;&#21205;&#12364;&#25345;&#12388;&#12289;
            &#21746;&#23398;&#30340;&#12391;&#24133;&#24195;&#12356;&#24847;&#21619;&#21512;&#12356;&#12434;&#31034;&#12375;&#12390;&#12356;&#12427;&#12469;&#12452;&#12488;&#12434;&#31169;&#12364;&#12402;&#12392;&#12388;&#12354;&#12370;&#12427;&#12392;&#12377;&#12428;&#12400;&#12289;
            &#12371;&#12398;&#12469;&#12452;&#12488;&#12434;&#36984;&#12406;&#12391;&#12375;&#12423;&#12358;&#12290;
            </p></li></ul></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="patents.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="canned-hosting-sites.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#29305;&#35377; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20184;&#37682;A Canned Hosting Sites</td></tr></table></div></body></html>
