<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="next" href="vc.html" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="technical-infrastructure.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="vc.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mailing-lists"></a>&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</h2></div></div></div><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#24517;&#35201;&#19981;&#21487;&#27424;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#20197;&#22806;&#12395;&#12518;&#12540;&#12470;&#12540;&#12395;&#35211;&#12379;&#12427;&#12418;&#12398;&#12364;&#12354;&#12427;&#12392;&#12377;&#12428;&#12400;&#12289;
  &#12414;&#12378;&#26368;&#21021;&#12399;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#21069;&#12395;&#12289;
  &#12518;&#12540;&#12470;&#12540;&#12399;&#12414;&#12378;&#12381;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;
  (&#12383;&#12392;&#12360;&#12400; "&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;" &#12394;&#12393;)
  &#12395;&#20986;&#20250;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12363;&#12425;&#12289;&#27425;&#12398;&#12300;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31532;&#19968;&#27861;&#21063;&#12301;&#12364;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
     &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#12399;&#12289;&#25163;&#20316;&#26989;&#12391;&#34892;&#12358;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
     &#23554;&#29992;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12290;
   </em></span></p></blockquote></div><p>
  &#12356;&#12365;&#12394;&#12426;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#35328;&#12431;&#12428;&#12390;&#12418;&#39514;&#12365;&#12414;&#12377;&#12424;&#12397;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#29992;&#12395;&#12431;&#12374;&#12431;&#12374;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#12394;&#12435;&#12390;&#12289;
  &#12385;&#12423;&#12387;&#12392;&#12420;&#12426;&#12377;&#12366;&#12398;&#12424;&#12358;&#12395;&#24863;&#12376;&#12425;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#23567;&#35215;&#27169;&#12391;&#27969;&#37327;&#12398;&#23569;&#12394;&#12356;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#25163;&#21205;&#12391;&#31649;&#29702;&#12377;&#12427;&#12411;&#12358;&#12364;&#27005;&#12395;&#35211;&#12360;&#12414;&#12377;&#12290;
  &#21442;&#21152;&#30003;&#12375;&#36796;&#12415;&#29992;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#12402;&#12392;&#12388;&#20316;&#25104;&#12375;&#12390;&#12381;&#12428;&#12434;&#12354;&#12394;&#12383;&#23451;&#12390;&#12395;&#36578;&#36865;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12365;&#12289;
  &#23626;&#12356;&#12383;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12434;&#35211;&#12390;&#12289;&#12450;&#12489;&#12524;&#12473;&#19968;&#35239; (&#12362;&#12381;&#12425;&#12367;&#21336;&#12394;&#12427;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;)
  &#12395;&#36861;&#21152;&#12375;&#12383;&#12426;&#21066;&#38500;&#12375;&#12383;&#12426;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#20197;&#19978;&#12395;&#12471;&#12531;&#12503;&#12523;&#12394;&#12420;&#12426;&#12363;&#12383;&#12394;&#12435;&#12390;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;?
</p><p>
  &#12415;&#12435;&#12394;&#12364;&#28288;&#36275;&#12377;&#12427;&#12524;&#12505;&#12523;&#12391;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#12434;&#34892;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#24605;&#12387;&#12390;&#12356;&#12427;&#12411;&#12393;&#31777;&#21336;&#12394;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;
  &#21336;&#12395;&#12518;&#12540;&#12470;&#12540;&#12434;&#30331;&#37682;&#12375;&#12383;&#12426;&#21066;&#38500;&#12375;&#12383;&#12426;&#12377;&#12427;&#12384;&#12369;&#12398;&#35441;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12473;&#12497;&#12512;&#12424;&#12369;&#12398;&#12383;&#12417;&#12395;&#25237;&#31295;&#20869;&#23481;&#12434;&#12514;&#12487;&#12524;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12289;
  &#35079;&#25968;&#12398;&#25237;&#31295;&#12434;&#12402;&#12392;&#12414;&#12392;&#12417;&#12395;&#12375;&#12383;&#24418;&#24335;&#12391;&#12513;&#12540;&#12523;&#12434;&#37197;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#33258;&#21205;&#36820;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;
  &#12392;&#12356;&#12387;&#12383;&#12373;&#12414;&#12374;&#12414;&#12394;&#20869;&#23481;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#21442;&#21152;&#29992;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#20154;&#25163;&#12391;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12399;&#12289;
  &#26368;&#23567;&#38480;&#12398;&#27231;&#33021;&#12375;&#12363;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12375;&#12390;&#12381;&#12398;&#26368;&#23567;&#38480;&#12398;&#27231;&#33021;&#12391;&#12373;&#12360;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#20219;&#12379;&#12427;&#12398;&#12395;&#27604;&#12409;&#12427;&#12392;
  &#20449;&#38972;&#24615;&#12420;&#21363;&#26178;&#24615;&#12395;&#27424;&#12369;&#12427;&#12418;&#12398;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12356;&#12414;&#12393;&#12365;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12394;&#12425;&#12289;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#27425;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12364;&#25645;&#36617;&#12373;&#12428;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><div class="variablelist"><dl><dt><span class="term">&#12513;&#12540;&#12523;&#12362;&#12424;&#12403;&#12454;&#12455;&#12502;&#12398;&#20001;&#26041;&#12363;&#12425;&#12398;&#21442;&#21152;&#21463;&#20184;</span></dt><dd><p>
        &#12518;&#12540;&#12470;&#12540;&#12364;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#21442;&#21152;&#12434;&#30003;&#12375;&#36796;&#12416;&#12392;&#12289;
        <span class="emphasis"><em>&#12377;&#12368;&#12395;</em></span>&#33258;&#21205;&#36820;&#20449;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#12369;&#21462;&#12426;&#12414;&#12377;&#12290;
        &#12381;&#12371;&#12395;&#12399;&#12289;&#21442;&#21152;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#24773;&#22577;&#12420;
        &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12408;&#12398;&#25351;&#31034;&#12398;&#20986;&#12375;&#26041;&#12289;&#12381;&#12375;&#12390;
        (&#26368;&#12418;&#37325;&#35201;&#12394;&#38917;&#30446;&#12392;&#12375;&#12390;) &#12522;&#12473;&#12488;&#12363;&#12425;&#12398;&#36864;&#20250;&#12398;&#12375;&#12363;&#12383;&#12394;&#12393;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
        &#12371;&#12398;&#33258;&#21205;&#36820;&#20449;&#12398;&#20869;&#23481;&#12399;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;
        &#12371;&#12371;&#12395;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12420;
        FAQ &#12398;&#22580;&#25152;&#12392;&#12356;&#12387;&#12383;&#24773;&#22577;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term">&#19968;&#36890;&#12372;&#12392;&#12398;&#37197;&#20449;&#12363;&#12414;&#12392;&#12417;&#12390;&#12398;&#37197;&#20449;&#12363;&#12398;&#36984;&#25246;</span></dt><dd><p>
       &#12480;&#12452;&#12472;&#12455;&#12473;&#12488;&#12514;&#12540;&#12489; (&#12300;&#12414;&#12392;&#12417;&#12390;&#37197;&#20449;&#12301;&#12514;&#12540;&#12489;)
       &#12395;&#12377;&#12427;&#12392;&#12289;&#21442;&#21152;&#32773;&#12364;&#21463;&#12369;&#21462;&#12427;&#12513;&#12540;&#12523;&#12399;&#65297;&#26085;&#12395;&#65297;&#36890;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
       &#12381;&#12398;&#26085;&#12395;&#25237;&#31295;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12364;&#65297;&#36890;&#12395;&#12414;&#12392;&#12417;&#12390;&#36865;&#20449;&#12373;&#12428;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
       &#31309;&#26997;&#30340;&#12395;&#21442;&#21152;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12364;&#12289;
       &#22823;&#12414;&#12363;&#12394;&#35441;&#12398;&#27969;&#12428;&#12399;&#36861;&#12356;&#12363;&#12369;&#12390;&#12362;&#12365;&#12383;&#12356;&#12392;&#12356;&#12387;&#12383;&#20154;&#12383;&#12385;&#12395;&#12399;
       &#12480;&#12452;&#12472;&#12455;&#12473;&#12488;&#12514;&#12540;&#12489;&#12364;&#12362;&#21223;&#12417;&#12391;&#12377;&#12290;
       &#12371;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#38971;&#32321;&#12395;&#12420;&#12387;&#12390;&#12367;&#12427;&#12513;&#12540;&#12523;&#12395;&#27671;&#12434;&#25955;&#12425;&#12373;&#12428;&#12427;&#12371;&#12392;&#12394;&#12367;
       &#12381;&#12398;&#26085;&#12398;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12434;&#12422;&#12387;&#12367;&#12426;&#35211;&#28193;&#12379;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
      </p></dd><dt><span class="term">&#12514;&#12487;&#12524;&#12540;&#12488;&#27231;&#33021;</span></dt><dd><p>
        &#12300;&#12514;&#12487;&#12524;&#12540;&#12488;&#12301;&#12392;&#12399;&#12289;
        &#25237;&#31295;&#12398;&#20869;&#23481;&#12434;&#12356;&#12387;&#12383;&#12435;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;
        a) &#12473;&#12497;&#12512;&#12391;&#12394;&#12356;&#12371;&#12392;&#12289;&#12381;&#12375;&#12390;
        b) &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#25201;&#12358;&#12398;&#12395;&#12405;&#12373;&#12431;&#12375;&#12356;&#20869;&#23481;&#12391;&#12354;&#12427;&#12371;&#12392;
        &#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#19968;&#33324;&#21521;&#12369;&#12395;&#37197;&#20449;&#12377;&#12427;&#20316;&#26989;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
        &#12514;&#12487;&#12524;&#12540;&#12488;&#20966;&#29702;&#12399;&#12289;&#24517;&#12378;&#12375;&#12418;&#20154;&#38291;&#12364;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#20219;&#12379;&#12427;&#12371;&#12392;&#12391;&#12289;&#12424;&#12426;&#31777;&#21336;&#12395;&#34892;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        &#12514;&#12487;&#12524;&#12540;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#24460;&#12391;&#12418;&#12358;&#12356;&#12385;&#12393;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term">&#31649;&#29702;&#32773;&#29992;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;</span></dt><dd><p>
        &#12371;&#12428;&#12399;&#29305;&#12395;&#12289;&#20351;&#12431;&#12428;&#12394;&#12367;&#12394;&#12387;&#12383;&#12450;&#12489;&#12524;&#12473;&#12434;&#31777;&#21336;&#12395;&#21066;&#38500;&#12377;&#12427;&#12383;&#12417;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290;
        &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12398;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;
        &#12300;&#12371;&#12398;&#12450;&#12489;&#12524;&#12473;&#12399;&#12418;&#12358;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12301;&#12392;&#12356;&#12387;&#12383;&#33258;&#21205;&#36820;&#20449;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#27598;&#22238;&#23626;&#12367;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12425;&#12289;
        &#21363;&#21051;&#23550;&#24540;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;
        (&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
        &#12371;&#12428;&#12434;&#33258;&#21205;&#26908;&#20986;&#12375;&#12390;&#35442;&#24403;&#32773;&#12434;&#33258;&#21205;&#30340;&#12395;&#12513;&#12531;&#12496;&#12540;&#12363;&#12425;&#22806;&#12377;&#12424;&#12358;&#12395;&#12391;&#12365;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
      </p></dd><dt><span class="term">&#12504;&#12483;&#12480;&#12398;&#25805;&#20316;</span></dt><dd><p>
        &#22810;&#12367;&#12398;&#20154;&#12399;&#12289;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12398;&#20181;&#20998;&#12369;&#27231;&#33021;&#12394;&#12393;&#12434;&#27963;&#29992;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
        &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;
        &#29305;&#23450;&#12398;&#12504;&#12483;&#12480;&#12434;&#12513;&#12540;&#12523;&#12395;&#20184;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;
        &#12371;&#12428;&#12425;&#12398;&#27231;&#33021;&#12434;&#20351;&#12356;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;
        (&#35443;&#32048;&#12399;&#24460;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;)&#12290;
      </p></dd><dt><span class="term">&#12450;&#12540;&#12459;&#12452;&#12502;&#20966;&#29702;</span></dt><dd><p>
        &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12399;&#12289;
        &#20445;&#23384;&#12373;&#12428;&#12383;&#12358;&#12360;&#12391;&#12454;&#12455;&#12502;&#12363;&#12425;&#38322;&#35239;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        &#12354;&#12427;&#12356;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12424;&#12387;&#12390;&#12399;
        MHonArc (<a class="ulink" href="http://www.mhonarc.org/" target="_top">http://www.mhonarc.org/</a>)
        &#12398;&#12424;&#12358;&#12394;&#22806;&#37096;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12484;&#12540;&#12523;&#12408;&#12398;&#12503;&#12521;&#12464;&#12452;&#12531;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
        <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span>
        &#12398; <a class="xref" href="growth.html#using-archives" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;">&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;&#12301;</a> &#12391;&#35500;&#26126;&#12377;&#12427;&#12424;&#12358;&#12395;&#12289;
        &#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#37325;&#35201;&#12394;&#20316;&#26989;&#12391;&#12377;&#12290;
      </p></dd></dl></div><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12402;&#12392;&#12388;&#12402;&#12392;&#12388;&#25369;&#12370;&#12390;&#12415;&#12427;&#12392;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#24605;&#12356;&#12398;&#12411;&#12363;&#35079;&#38609;&#12394;&#20316;&#26989;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12362;&#20998;&#12363;&#12426;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12425;&#12398;&#20316;&#26989;&#12398;&#22810;&#12367;&#12364;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#33258;&#21205;&#21270;&#12391;&#12365;&#12427;&#12371;&#12392;&#12418;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#27770;&#12375;&#12390;&#12371;&#12428;&#12425;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12456;&#12461;&#12473;&#12497;&#12540;&#12488;&#12395;&#12394;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12414;&#12384;&#12414;&#12384;&#24120;&#12395;&#23398;&#12406;&#20313;&#22320;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#20316;&#26989;&#12399;&#36991;&#12369;&#12390;&#36890;&#12428;&#12394;&#12356;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#24515;&#12395;&#12362;&#12356;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#20197;&#38477;&#12391;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#35373;&#23450;&#12395;&#38306;&#12377;&#12427;&#12424;&#12367;&#12354;&#12427;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12415;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12473;&#12497;&#12512;&#23550;&#31574;"><div class="titlepage"><div><div><h3 class="title"><a name="spam-prevention"></a>&#12473;&#12497;&#12512;&#23550;&#31574;</h3></div></div></div><p>
  &#20170;&#12289;&#12371;&#12398;&#25991;&#31456;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#26178;&#28857;&#12392;&#23455;&#38555;&#12395;&#26412;&#26360;&#12364;&#20986;&#29256;&#12373;&#12428;&#12383;&#26178;&#28857;&#12434;&#27604;&#12409;&#12390;&#12418;&#12289;
  &#12473;&#12497;&#12512;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;&#12398;&#28145;&#21051;&#24230;&#12399;&#20493;&#22679;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12289;&#12381;&#12358;&#24863;&#12376;&#12427;&#12367;&#12425;&#12356;&#12398;&#12524;&#12505;&#12523;&#12395;&#12399;&#12394;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12388;&#12356;&#26368;&#36817;&#12414;&#12391;&#12399;&#12289;&#12473;&#12497;&#12512;&#23550;&#31574;&#12434;&#12414;&#12387;&#12383;&#12367;&#34892;&#12431;&#12394;&#12367;&#12390;&#12418;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#26222;&#36890;&#12395;&#36939;&#21942;&#12391;&#12365;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12372;&#12367;&#12414;&#12428;&#12395;&#22793;&#12394;&#25237;&#31295;&#12364;&#34892;&#12431;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;&#27671;&#12395;&#12394;&#12427;&#12411;&#12393;&#12398;&#12418;&#12398;&#12391;&#12399;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12435;&#12394;&#26178;&#20195;&#12399;&#12392;&#12387;&#12367;&#12395;&#32066;&#12431;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#29694;&#22312;&#12391;&#12399;&#12289;&#12473;&#12497;&#12512;&#23550;&#31574;&#12434;&#12414;&#12387;&#12383;&#12367;&#12375;&#12390;&#12356;&#12394;&#12356;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;
  &#12354;&#12387;&#12392;&#12356;&#12358;&#38291;&#12395;&#12468;&#12511;&#12513;&#12540;&#12523;&#12398;&#23665;&#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#20351;&#12356;&#29289;&#12395;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12473;&#12497;&#12512;&#12399;&#27770;&#12375;&#12390;&#37326;&#25918;&#12375;&#12395;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#26412;&#26360;&#12391;&#12399;&#12289;&#12473;&#12497;&#12512;&#23550;&#31574;&#12434;&#65298;&#31278;&#39006;&#12395;&#20998;&#12369;&#12390;&#32771;&#12360;&#12414;&#12377;&#12290;
  &#12402;&#12392;&#12388;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12473;&#12497;&#12512;&#12364;&#37197;&#20449;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12290;
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;
  &#12473;&#12497;&#12512;&#26989;&#32773;&#12395;&#21454;&#38598;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#21069;&#32773;&#12398;&#26041;&#12364;&#12424;&#12426;&#22823;&#20107;&#12394;&#12398;&#12391;&#12289;&#12414;&#12378;&#12399;&#12381;&#12385;&#12425;&#12363;&#12425;&#32771;&#12360;&#12390;&#12356;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect3" title="&#25237;&#31295;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;"><div class="titlepage"><div><div><h4 class="title"><a name="spam-filtering"></a>&#25237;&#31295;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;</h4></div></div></div><p>
  &#12473;&#12497;&#12512;&#25237;&#31295;&#12434;&#38450;&#12368;&#22522;&#26412;&#30340;&#12394;&#26041;&#27861;&#12399;&#12289;&#27425;&#12398;&#65299;&#12388;&#12391;&#12377;&#12290;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#27231;&#33021;&#12434;&#12377;&#12409;&#12390;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12371;&#12428;&#12425;&#12398;&#26041;&#27861;&#12399;&#12289;&#12393;&#12428;&#12363;&#12402;&#12392;&#12388;&#12384;&#12369;&#12434;&#20351;&#12358;&#12398;&#12391;&#12399;&#12394;&#12367;
  &#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#20351;&#12358;&#12392;&#26377;&#21177;&#12391;&#12377;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p><span class="bold"><strong>&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12363;&#12425;&#12398;&#25237;&#31295;&#12398;&#12415;&#12434;&#33258;&#21205;&#37197;&#20449;&#12377;&#12427;</strong></span></p><p>
              &#12371;&#12428;&#12399;&#12354;&#12427;&#31243;&#24230;&#12399;&#26377;&#21177;&#12391;&#12289;&#31649;&#29702;&#32773;&#12395;&#12399;&#12411;&#12392;&#12435;&#12393;&#36000;&#25285;&#12364;&#12363;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12289;
              &#12371;&#12428;&#12434;&#34892;&#12358;&#12395;&#12399;&#21336;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12384;&#12369;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
              &#12375;&#12363;&#12375;&#12289;&#33258;&#21205;&#25215;&#35469;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#25237;&#31295;&#12434;&#21336;&#12395;&#25448;&#12390;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
              &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;&#33258;&#21205;&#25215;&#35469;&#12373;&#12428;&#12394;&#12363;&#12387;&#12383;&#25237;&#31295;&#12399;&#31649;&#29702;&#32773;&#12364;&#12356;&#12387;&#12383;&#12435;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
              &#12381;&#12358;&#12377;&#12427;&#29702;&#30001;&#12399;&#27425;&#12398;&#65298;&#12388;&#12391;&#12377;&#12290;&#12414;&#12378;&#31532;&#19968;&#12395;&#12289;
              &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#20197;&#22806;&#12363;&#12425;&#12398;&#25237;&#31295;&#12418;&#21463;&#12369;&#20184;&#12369;&#12383;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
              &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#36074;&#21839;&#12420;&#25552;&#26696;&#12364;&#12354;&#12427;&#20154;&#12364;&#12289;
              &#12356;&#12385;&#12356;&#12385;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12394;&#12369;&#12428;&#12400;&#12513;&#12540;&#12523;&#12434;&#25237;&#31295;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12358;&#12398;&#12399;&#19981;&#20415;&#12391;&#12377;&#12290;
              &#12418;&#12358;&#12402;&#12392;&#12388;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
              &#30331;&#37682;&#12375;&#12390;&#12356;&#12427;&#12450;&#12489;&#12524;&#12473;&#20197;&#22806;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#25237;&#31295;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
              &#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12399;&#12289;&#20154;&#12434;&#35672;&#21029;&#12377;&#12427;&#25163;&#27573;&#12392;&#12375;&#12390;&#12399;&#12354;&#12414;&#12426;&#20449;&#38972;&#12391;&#12365;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
              &#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12395;&#12354;&#12414;&#12426;&#38972;&#12426;&#12377;&#12366;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
            </p></li><li class="listitem"><p><span class="bold"><strong>
              &#25237;&#31295;&#12434;&#12289;&#12356;&#12387;&#12383;&#12435;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12363;&#12369;&#12427;
            </strong></span></p><p>
              &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#23550;&#24540;&#12375;&#12390;&#12356;&#12428;&#12400; (&#12411;&#12392;&#12435;&#12393;&#12399;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;)&#12289;
              &#25237;&#31295;&#20869;&#23481;&#12434;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#28193;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
              &#33258;&#21205;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12399;&#23436;&#29863;&#12394;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
              &#12414;&#12383;&#12289;&#20170;&#24460;&#12418;&#27770;&#12375;&#12390;&#23436;&#29863;&#12394;&#12418;&#12398;&#12395;&#12399;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
              &#12473;&#12497;&#12512;&#12398;&#36865;&#20449;&#32773;&#12392;&#12501;&#12451;&#12523;&#12479;&#12398;&#20316;&#32773;&#12392;&#12398;&#25126;&#12356;&#12399;&#27704;&#36960;&#12395;&#32154;&#12367;&#12398;&#12391;&#12377;&#12290;
              &#12375;&#12363;&#12375;&#12289;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12477;&#12501;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
              &#31649;&#29702;&#32773;&#12364;&#25163;&#20316;&#26989;&#12391;&#20966;&#29702;&#12377;&#12409;&#12365;&#12473;&#12497;&#12512;&#12434;&#28608;&#28187;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
              &#20154;&#25163;&#12391;&#20966;&#29702;&#12377;&#12409;&#12365;&#20869;&#23481;&#12364;&#22810;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;
              &#33258;&#21205;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12399;&#26377;&#29992;&#12391;&#12377;&#12290;
            </p><p>
              &#12371;&#12371;&#12391;&#12399;&#12289;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12398;&#35373;&#23450;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#35500;&#26126;&#12375;&#12414;&#12379;&#12435;&#12290;
              &#12372;&#21033;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;
              (<span>&#26412;&#31456;&#12398;&#24460;&#21322;&#12398;</span>
              <a class="xref" href="mailing-lists.html#mailing-list-software" title="&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;">&#12300;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12301;</a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;)&#12290;
              &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12399;&#12383;&#12356;&#12390;&#12356;&#12289;
              &#33258;&#21069;&#12398;&#12473;&#12497;&#12512;&#23550;&#31574;&#27231;&#33021;&#12364;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
              &#12375;&#12363;&#12375;&#12289;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12501;&#12451;&#12523;&#12479;&#12434;&#20351;&#12356;&#12383;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
              &#31169;&#12364;&#12424;&#12367;&#21033;&#29992;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;SpamAssassin
              (<a class="ulink" href="http://spamassassin.apache.org/" target="_top">http://spamassassin.apache.org/</a>)
              &#12392; SpamProbe
              (<a class="ulink" href="http://spamprobe.sourceforge.net/" target="_top">http://spamprobe.sourceforge.net/</a>)
              &#12391;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12425;&#20197;&#22806;&#12395;&#12418;
              &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12399;&#12383;&#12367;&#12373;&#12435;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
              &#12381;&#12398;&#20013;&#12395;&#12399;&#12377;&#12400;&#12425;&#12375;&#12356;&#12418;&#12398;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
              &#31169;&#12399;&#12383;&#12414;&#12383;&#12414;&#12371;&#12398;&#65298;&#12388;&#12391;&#28288;&#36275;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
              &#20182;&#12398;&#12418;&#12398;&#12434;&#12354;&#12414;&#12426;&#35519;&#12409;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
            </p></li><li class="listitem"><p><span class="bold"><strong>&#12514;&#12487;&#12524;&#12540;&#12488;&#12377;&#12427;</strong></span></p><p>
              &#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#12398;&#25237;&#31295;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;
              &#33258;&#21205;&#37197;&#20449;&#12399;&#12373;&#12428;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
              &#12414;&#12383;&#12289;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12434;&#36890;&#12375;&#12383;&#32080;&#26524;&#12289;&#12473;&#12497;&#12512;&#12391;&#12399;&#12394;&#12356;&#12392;&#21028;&#26029;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
              &#12381;&#12398;&#12424;&#12358;&#12394;&#25237;&#31295;&#12395;&#23550;&#12377;&#12427;&#26368;&#24460;&#12398;&#25163;&#27573;&#12399;
              <em class="firstterm">&#12514;&#12487;&#12524;&#12540;&#12488;</em> &#12391;&#12377;&#12290;
              &#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12364;&#29305;&#21029;&#12394;&#12450;&#12489;&#12524;&#12473;&#12395;&#36865;&#12425;&#12428;&#12289;
              &#20154;&#38291;&#12364;&#12381;&#12398;&#20869;&#23481;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12383;&#12358;&#12360;&#12391;&#25215;&#35469;&#12377;&#12427;&#12363;&#21364;&#19979;&#12377;&#12427;&#12363;&#12434;&#27770;&#12417;&#12427;&#12398;&#12391;&#12377;&#12290;
            </p><p>
              &#25237;&#31295;&#12434;&#25215;&#35469;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12381;&#12398;&#25237;&#31295;&#12384;&#12369;&#12434;&#25215;&#35469;&#12377;&#12427;&#12301;
              &#12354;&#12427;&#12356;&#12399;&#12300;&#12381;&#12398;&#25237;&#31295;&#12434;&#25215;&#35469;&#12375;&#12289;
              &#20170;&#24460;&#21516;&#12376;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#12398;&#25237;&#31295;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12399;&#33258;&#21205;&#30340;&#12395;&#37197;&#20449;&#12377;&#12427;&#12301;
              &#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#26041;&#24335;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
              &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;&#24460;&#32773;&#12398;&#26041;&#24335;&#12434;&#12392;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
              &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#23558;&#26469;&#12398;&#12514;&#12487;&#12524;&#12540;&#12488;&#12398;&#36000;&#33655;&#12434;&#19979;&#12370;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
              &#25237;&#31295;&#12398;&#25215;&#35469;&#26041;&#27861;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12371;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
              &#12424;&#12367;&#12354;&#12427;&#26041;&#24335;&#12399;&#12289;&#29305;&#21029;&#12394;&#12450;&#12489;&#12524;&#12473;&#12395;&#23550;&#12375;&#12390;&#12467;&#12510;&#12531;&#12489;&#12434;&#36820;&#20449;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
              &#12383;&#12392;&#12360;&#12400; "accept" (&#12371;&#12398;&#25237;&#31295;&#12384;&#12369;&#12434;&#25215;&#35469;&#12377;&#12427;)
              &#12354;&#12427;&#12356;&#12399; "allow" (&#12371;&#12398;&#25237;&#31295;&#12362;&#12424;&#12403;&#20170;&#24460;&#12398;&#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12434;&#25215;&#35469;&#12377;&#12427;)
              &#12394;&#12393;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            </p><p>
              &#21364;&#19979;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#36890;&#24120;&#12399;&#21336;&#12395;&#20309;&#12418;&#12379;&#12378;&#12395;&#12514;&#12487;&#12524;&#12540;&#12488;&#12513;&#12540;&#12523;&#12434;&#28961;&#35222;&#12375;&#12414;&#12377;&#12290;
              &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;
              &#12381;&#12398;&#25237;&#31295;&#12434;&#25215;&#35469;&#12377;&#12427;&#12392;&#12356;&#12358;&#30906;&#35469;&#12434;&#21463;&#12369;&#21462;&#12425;&#12394;&#12356;&#38480;&#12426;
              &#25237;&#31295;&#12434;&#37197;&#20449;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
              &#12388;&#12414;&#12426;&#12289;&#21336;&#12395;&#12514;&#12487;&#12524;&#12540;&#12488;&#12513;&#12540;&#12523;&#12434;&#28961;&#35222;&#12375;&#12390;&#12362;&#12369;&#12400;
              &#12381;&#12428;&#12391;&#29992;&#12364;&#28288;&#12383;&#12373;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
              &#12354;&#12427;&#12356;&#12399;&#12289;"reject" &#12420; "deny"
              &#12392;&#12356;&#12387;&#12383;&#12467;&#12510;&#12531;&#12489;&#12434;&#26126;&#31034;&#30340;&#12395;&#36820;&#20449;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
              &#12381;&#12358;&#12377;&#12427;&#12392;&#12289;&#21516;&#12376;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#20170;&#24460;&#25237;&#31295;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12395;
              &#12514;&#12487;&#12524;&#12540;&#12488;&#20966;&#29702;&#12398;&#21069;&#12395;&#33258;&#21205;&#30340;&#12395;&#21364;&#19979;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
              &#12375;&#12363;&#12375;&#12289;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12418;&#12354;&#12414;&#12426;&#24847;&#21619;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
              &#12514;&#12487;&#12524;&#12540;&#12488;&#12398;&#20027;&#35201;&#12394;&#30446;&#30340;&#12399;&#12473;&#12497;&#12512;&#12398;&#38450;&#27490;&#12391;&#12354;&#12426;&#12289;
              &#12473;&#12497;&#12510;&#12540;&#12364;&#21516;&#12376;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#12513;&#12540;&#12523;&#12434;&#20309;&#24230;&#12418;&#36865;&#12427;&#12394;&#12435;&#12390;&#12354;&#12426;&#12360;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
            </p></li></ol></div><p>
  &#12514;&#12487;&#12524;&#12540;&#12488;&#12434;&#20081;&#29992;&#12375;&#12377;&#12366;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12473;&#12497;&#12512;&#12434;&#38450;&#12368;&#12371;&#12392;&#12392;&#12289;&#12414;&#12387;&#12383;&#12367;&#30340;&#22806;&#12428;&#12394;&#25237;&#31295;
  (&#25237;&#31295;&#12377;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#38291;&#36949;&#12360;&#12383;&#12394;&#12393;)
  &#12434;&#38450;&#12368;&#12371;&#12392;<span class="emphasis"><em>&#12384;&#12369;</em></span>&#12395;&#38480;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12514;&#12487;&#12524;&#12540;&#12488;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;
  &#25237;&#31295;&#32773;&#12395;&#12384;&#12369;&#30452;&#25509;&#36820;&#20449;&#12434;&#36820;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12428;&#12434;&#20351;&#12387;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#38306;&#12377;&#12427;&#36074;&#21839;&#12395;&#31572;&#12360;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#21363;&#31572;&#12391;&#12365;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12427;&#12392;&#12289;&#12393;&#12435;&#12394;&#36074;&#21839;&#12364;&#12354;&#12387;&#12383;&#12398;&#12363;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#20253;&#12431;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12381;&#12398;&#36074;&#21839;&#12395;&#23550;&#12375;&#12390;&#12424;&#12426;&#36969;&#20999;&#12395;&#31572;&#12360;&#12425;&#12428;&#12427;&#20154;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#31572;&#12360;&#12427;&#12481;&#12515;&#12531;&#12473;&#12364;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#20182;&#12398;&#20154;&#12364;&#31572;&#12360;&#12383;&#20869;&#23481;&#12418;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12514;&#12487;&#12524;&#12540;&#12488;&#12399;&#12289;
  &#12468;&#12511;&#12513;&#12540;&#12523;&#12420;&#22580;&#36949;&#12356;&#12394;&#12513;&#12540;&#12523;&#12400;&#12363;&#12426;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#38450;&#12368;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#20197;&#19978;&#12398;&#20309;&#32773;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect3" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;"><div class="titlepage"><div><div><h4 class="title"><a name="address-hiding"></a>&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;</h4></div></div></div><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#21442;&#21152;&#32773;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#12473;&#12497;&#12510;&#12540;&#12395;&#25244;&#12365;&#21462;&#12425;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12377;&#12427;&#38555;&#12395;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#12412;&#12363;&#12377;&#12398;&#12364;&#19968;&#33324;&#30340;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;
</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandom@somedomain.com</code></p></blockquote></div><p>&#12398;&#12424;&#12358;&#12394;&#12450;&#12489;&#12524;&#12473;&#12434;</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandom_AT_somedomain.com</code></p></blockquote></div><p>&#12354;&#12427;&#12356;&#12399;</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandomNOSPAM@somedomain.com</code></p></blockquote></div><p>
  &#12354;&#12427;&#12356;&#12399;&#12381;&#12428;&#12392;&#21516;&#27096;&#12394; (&#20154;&#38291;&#12395;&#12399;&#29702;&#35299;&#12391;&#12365;&#12427;&#12424;&#12358;&#12394;) &#24418;&#24335;&#12395;&#22793;&#25563;&#12375;&#12414;&#12377;&#12290;
  &#12354;&#12426;&#12364;&#12385;&#12394;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#21454;&#38598;&#12477;&#12501;&#12488;&#12399;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#35501;&#12415;&#36796;&#12435;&#12391;
  "@" &#12434;&#21547;&#12416;&#25991;&#23383;&#21015;&#12434;&#25506;&#12375;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;
  &#12450;&#12489;&#12524;&#12473;&#12434;&#12371;&#12398;&#12424;&#12358;&#12395;&#22793;&#25563;&#12375;&#12390;&#12362;&#12369;&#12400;&#21454;&#38598;&#12477;&#12501;&#12488;&#29992;&#12398;&#23550;&#31574;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#30452;&#25509;&#36865;&#12425;&#12428;&#12390;&#12367;&#12427;&#12424;&#12358;&#12394;&#12473;&#12497;&#12512;&#12395;&#12399;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#30452;&#25509;&#12473;&#12497;&#12512;&#12364;&#36865;&#12425;&#12428;&#12427;&#12398;&#12434;&#38450;&#12368;&#12383;&#12417;&#12398;&#20181;&#32068;&#12415;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12450;&#12489;&#12524;&#12473;&#12434;&#38560;&#12377;&#12371;&#12392;&#12395;&#12399;&#36059;&#21542;&#20001;&#35542;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#27231;&#33021;&#12434;&#27671;&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12399;&#12381;&#12358;&#12377;&#12427;&#12398;&#12364;&#24403;&#28982;&#12384;&#12392;&#24605;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#12418;&#12375;&#12381;&#12358;&#12394;&#12387;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#38750;&#24120;&#12395;&#39514;&#12365;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20013;&#12395;&#12399;&#12385;&#12423;&#12387;&#12392;&#12381;&#12428;&#12399;&#12420;&#12426;&#12377;&#12366;&#12384;&#12392;&#32771;&#12360;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#12356;&#12367;&#12425;&#20154;&#38291;&#12395;&#12392;&#12387;&#12390;&#12399;&#29702;&#35299;&#12391;&#12365;&#12427;&#24418;&#24335;&#12391;&#12354;&#12427;&#12392;&#12399;&#12356;&#12360;&#12289;
  &#12356;&#12387;&#12383;&#12435;&#38957;&#12398;&#20013;&#12391;&#22793;&#25563;&#12375;&#12394;&#12356;&#12392;&#27491;&#12375;&#12356;&#12450;&#12489;&#12524;&#12473;&#12364;&#12431;&#12363;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12414;&#12387;&#12383;&#12367;&#28961;&#24847;&#21619;&#12384;&#12392;&#12356;&#12358;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#12356;&#12367;&#12425;&#12375;&#12387;&#12363;&#12426;&#12375;&#12383;&#31526;&#21495;&#21270;&#12434;&#34892;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12450;&#12489;&#12524;&#12473;&#21454;&#38598;&#12477;&#12501;&#12488;&#12399;&#12381;&#12428;&#12434;&#29702;&#35542;&#19978;&#12399;&#29702;&#35299;&#12391;&#12365;&#12427;&#12399;&#12378;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12450;&#12489;&#12524;&#12473;&#12398;&#22793;&#25563;&#12364;&#26377;&#29992;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#23455;&#35388;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  <a class="ulink" href="http://www.cdt.org/speech/spam/030319spamreport.shtml" target="_top">http://www.cdt.org/speech/spam/030319spamreport.shtml</a>
  &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
  &#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#20966;&#29702;&#12399;
  &#20491;&#12293;&#12398;&#22909;&#12415;&#12391;&#20999;&#12426;&#26367;&#12360;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12398;&#20491;&#20154;&#35373;&#23450;&#12506;&#12540;&#12472;&#12391;
  &#12300;&#33258;&#20998;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#31526;&#21495;&#21270;&#12377;&#12427;/&#12375;&#12394;&#12356;&#12301;
  &#12434;&#20999;&#12426;&#26367;&#12360;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12369;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#12424;&#12358;&#12395;&#25237;&#31295;&#32773;&#12372;&#12392;&#12420;&#25237;&#31295;&#12372;&#12392;&#12395;&#35373;&#23450;&#12434;&#20999;&#12426;&#26367;&#12360;&#12425;&#12428;&#12427;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#35211;&#12383;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#29694;&#29366;&#12391;&#12399;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#32773;&#12364;&#20840;&#21729;&#12398;&#35373;&#23450;&#12434;&#19968;&#25324;&#12391;&#27770;&#12417;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;
  (&#12450;&#12540;&#12459;&#12452;&#12502;&#12484;&#12540;&#12523;&#12364;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#22793;&#25563;&#20966;&#29702;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;
  &#21069;&#25552;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#20013;&#12395;&#12399;&#12381;&#12398;&#27231;&#33021;&#12364;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
  &#31169;&#12399;&#12289;&#20491;&#20154;&#30340;&#12395;&#12399;&#12393;&#12385;&#12425;&#12363;&#12392;&#12356;&#12358;&#12392;&#22793;&#25563;&#20966;&#29702;&#12434;&#34892;&#12358;&#12411;&#12358;&#12364;&#22909;&#12365;&#12391;&#12377;&#12290;
  &#33258;&#20998;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12394;&#12393;&#12395;&#34920;&#35352;&#12377;&#12427;&#38555;&#12395;&#12289;
  &#12450;&#12489;&#12524;&#12473;&#21454;&#38598;&#29992;&#12477;&#12501;&#12488;&#23550;&#31574;&#12395;&#38750;&#24120;&#12395;&#27671;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#20154;&#12383;&#12385;&#12398;&#21162;&#21147;&#12364;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12424;&#12387;&#12390;&#21488;&#28961;&#12375;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#12365;&#12387;&#12392;&#38750;&#24120;&#12395;&#24754;&#12375;&#12416;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#19968;&#26041;&#12289;&#12450;&#12489;&#12524;&#12473;&#12364;&#22793;&#25563;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#21033;&#29992;&#32773;&#12395;&#22810;&#23569;&#19981;&#20415;&#12434;&#24863;&#12376;&#12373;&#12379;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12435;&#12394;&#12395;&#12383;&#12356;&#12375;&#12383;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12423;&#12379;&#12435;&#12289;&#24517;&#35201;&#12394;&#12383;&#12387;&#12383;&#19968;&#20154;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#27491;&#12375;&#12356;&#24418;&#24335;&#12395;&#25147;&#12377;&#12384;&#12369;&#12398;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12392;&#12371;&#12429;&#12391;&#12289;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#22793;&#25563;&#20316;&#26989;&#12418;&#12414;&#12383;&#12289;
  &#32066;&#12431;&#12426;&#12398;&#12394;&#12356;&#25126;&#12356;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#12371;&#12428;&#12434;&#35501;&#12435;&#12391;&#12356;&#12427;&#20170;&#12414;&#12373;&#12395;&#12371;&#12398;&#38291;&#12395;&#12418;&#12289;
  &#12450;&#12489;&#12524;&#12473;&#21454;&#38598;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#36914;&#21270;&#12375;&#32154;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12426;&#12364;&#12385;&#12394;&#12450;&#12489;&#12524;&#12473;&#22793;&#25563;&#26041;&#27861;&#12399;&#12377;&#12391;&#12395;&#30772;&#12425;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#31169;&#12383;&#12385;&#12399;&#12414;&#12383;&#21029;&#12398;&#26041;&#27861;&#12434;&#32771;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p></div></div><div class="sect2" title="&#35672;&#21029;&#12375;&#12420;&#12377;&#12356;&#12504;&#12483;&#12480;"><div class="titlepage"><div><div><h3 class="title"><a name="header-management"></a>&#35672;&#21029;&#12375;&#12420;&#12377;&#12356;&#12504;&#12483;&#12480;</h3></div></div></div><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12398;&#20013;&#12395;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12434;
  &#21029;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#12431;&#12369;&#12390;&#31649;&#29702;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12427;&#20154;&#12418;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12398;&#22810;&#12367;&#12399;&#12289;<em class="firstterm">&#12504;&#12483;&#12480;</em>
  &#12398;&#20869;&#23481;&#12395;&#12424;&#12387;&#12390;&#33258;&#21205;&#30340;&#12395;&#12513;&#12540;&#12523;&#12434;&#20181;&#20998;&#12369;&#12427;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12504;&#12483;&#12480;&#12392;&#12399;&#12513;&#12540;&#12523;&#12398;&#20808;&#38957;&#12395;&#12354;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#12371;&#12392;&#12391;&#12289;
  &#36865;&#20449;&#32773;&#12420;&#21463;&#20449;&#32773;&#12289;&#20214;&#21517;&#12289;&#26085;&#20184;&#12289;&#12381;&#12398;&#20182;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#38306;&#12377;&#12427;&#12373;&#12414;&#12374;&#12414;&#12394;&#24773;&#22577;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#20197;&#19979;&#12395;&#12354;&#12370;&#12427;&#12504;&#12483;&#12480;&#12399;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#20107;&#23455;&#19978;&#24517;&#38920;&#12391;&#12354;&#12427;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
</p><pre class="screen">
From: ...
To: ...
Subject: ...
Date: ...
</pre><p>
  &#12381;&#12398;&#20182;&#12395;&#12418;&#27161;&#28310;&#30340;&#12394;&#12504;&#12483;&#12480;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12371;&#12428;&#12425;&#12399;&#30465;&#30053;&#12375;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;
</p><pre class="screen">
Reply-to: sender@email.address.here
</pre><p>
  &#12504;&#12483;&#12480;&#12399;&#30465;&#30053;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#22823;&#21322;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12399;&#12371;&#12398;&#12504;&#12483;&#12480;&#12364;&#12388;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12371;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#36865;&#20449;&#20803;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#30906;&#23455;&#12395;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;
  (&#12405;&#12384;&#12435;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12387;&#12390;&#12356;&#12427;&#12450;&#12489;&#12524;&#12473;&#20197;&#22806;&#12363;&#12425;&#12513;&#12540;&#12523;&#12434;&#36865;&#20449;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12395;&#29305;&#12395;&#20415;&#21033;&#12391;&#12377;)&#12290;
</p><p>
  &#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12398;&#20013;&#12395;&#12399;&#12289;Subject &#12504;&#12483;&#12480;&#12398;&#20869;&#23481;&#12434;&#12418;&#12392;&#12395;&#12375;&#12383;
  &#31777;&#21336;&#12394;&#20181;&#20998;&#12369;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12477;&#12501;&#12488;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12363;&#12425;&#12399;&#12289;
  &#12513;&#12540;&#12523;&#12398;&#20214;&#21517;&#12398;&#20808;&#38957;&#12395;&#33258;&#21205;&#30340;&#12395;&#12503;&#12524;&#12501;&#12451;&#12483;&#12463;&#12473;&#12434;&#12388;&#12369;&#12390;&#12411;&#12375;&#12356;
  &#12392;&#12356;&#12358;&#35201;&#26395;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12434;&#21033;&#29992;&#12377;&#12428;&#12400;&#12289;
  &#31777;&#21336;&#12395;&#20181;&#20998;&#12369;&#12434;&#34892;&#12360;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12393;&#12358;&#12356;&#12358;&#12371;&#12392;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#20214;&#21517;&#12398;&#12513;&#12540;&#12523;
</p><pre class="screen">
Subject: Making the 2.5 release.
</pre><p>
  &#12364;&#25237;&#31295;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#23455;&#38555;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#37197;&#20449;&#12373;&#12428;&#12427;&#12513;&#12540;&#12523;&#12399;
  &#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><pre class="screen">
Subject: [discuss@lists.example.org] Making the 2.5 release.
</pre><p>
  &#22810;&#12367;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12399;&#12371;&#12398;&#27231;&#33021;&#12364;&#12388;&#12356;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#20351;&#12431;&#12394;&#12356;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#35299;&#27770;&#12391;&#12365;&#12427;&#12391;&#12354;&#12429;&#12358;&#21839;&#38988;&#12399;&#12289;
  &#12418;&#12387;&#12392;&#25511;&#12360;&#12417;&#12394;&#26041;&#27861;&#12391;&#35299;&#27770;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#19968;&#26041;&#12289;&#20214;&#21517;&#27396;&#12364;&#28961;&#24847;&#21619;&#12395;&#38263;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#28857;&#12399;&#28961;&#35222;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#24931;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;
  &#12414;&#12378;&#12381;&#12398;&#26085;&#12395;&#12420;&#12387;&#12390;&#12365;&#12383;&#12513;&#12540;&#12523;&#12398;&#20214;&#21517;&#12434;&#12374;&#12387;&#12392;&#30522;&#12417;&#12289;
  &#12393;&#12428;&#12434;&#35501;&#12435;&#12391;&#12393;&#12428;&#12395;&#36820;&#20449;&#12377;&#12427;&#12398;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#20214;&#21517;&#12398;&#20808;&#38957;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21517;&#21069;&#12434;&#12388;&#12369;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#20214;&#21517;&#12398;&#24460;&#21322;&#12364;&#30011;&#38754;&#12363;&#12425;&#12399;&#12415;&#20986;&#12390;&#12375;&#12414;&#12356;&#12289;&#35211;&#12360;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12393;&#12398;&#12513;&#12540;&#12523;&#12434;&#20966;&#29702;&#12377;&#12427;&#12398;&#12363;&#12434;&#27770;&#12417;&#12427;&#12383;&#12417;&#12398;&#24773;&#22577;&#12364;&#23569;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12431;&#12369;&#12391;&#12289;
  &#32080;&#26524;&#12392;&#12375;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#20351;&#12356;&#21213;&#25163;&#12364;&#24746;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p><p>
  Subject &#12504;&#12483;&#12480;&#12395;&#25163;&#12434;&#21152;&#12360;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12418;&#12387;&#12392;&#21029;&#12398;&#26041;&#27861;&#12391;&#20181;&#20998;&#12369;&#12434;&#12377;&#12427;&#26041;&#27861;&#12434;&#25945;&#12360;&#12390;&#12354;&#12370;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400; To &#12504;&#12483;&#12480;&#12394;&#12393;&#12364;&#12362;&#21223;&#12417;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#21517;&#12381;&#12398;&#12418;&#12398;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><pre class="screen">
To: &lt;discuss@lists.example.org&gt;
</pre><p>
  Subject &#12395;&#12424;&#12427;&#20181;&#20998;&#12369;&#12364;&#12391;&#12365;&#12427;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12394;&#12425;&#12289;
  &#12414;&#12378;&#38291;&#36949;&#12356;&#12394;&#12367; To &#12395;&#12424;&#12427;&#20181;&#20998;&#12369;&#12418;&#12391;&#12365;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#20197;&#22806;&#12395;&#12418;&#24517;&#38920;&#12391;&#12399;&#12394;&#12356;&#12369;&#12428;&#12393;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12399;&#12424;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12504;&#12483;&#12480;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12504;&#12483;&#12480;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#20181;&#20998;&#12369;&#12434;&#12375;&#12383;&#12411;&#12358;&#12364;&#12289;"To" &#12420; "Cc"
  &#12395;&#38972;&#12427;&#12424;&#12426;&#12418;&#30906;&#23455;&#12391;&#12377;&#12290;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12504;&#12483;&#12480;&#12399;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#30452;&#25509;&#36861;&#21152;&#12377;&#12427;&#12398;&#12391;&#12289;
  &#12371;&#12428;&#12434;&#20351;&#29992;&#12375;&#12383;&#20181;&#20998;&#12369;&#12434;&#12375;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
list-help: &lt;mailto:discuss-help@lists.example.org&gt;
list-unsubscribe: &lt;mailto:discuss-unsubscribe@lists.example.org&gt;
list-post: &lt;mailto:discuss@lists.example.org&gt;
Delivered-To: mailing list discuss@lists.example.org
Mailing-List: contact discuss-help@lists.example.org; run by ezmlm
</pre><p>
  &#12371;&#12428;&#12425;&#12398;&#12504;&#12483;&#12480;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#25991;&#23383;&#36890;&#12426;&#12398;&#24847;&#21619;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#35443;&#12375;&#12367;&#12399; <a class="ulink" href="http://www.nisto.com/listspec/list-manager-intro.html" target="_top">http://www.nisto.com/listspec/list-manager-intro.html</a>
  &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;&#12354;&#12427;&#12356;&#12399;&#12418;&#12387;&#12392;&#35443;&#12375;&#12356;&#21427;&#23494;&#12394;&#20181;&#27096;&#12364;&#30693;&#12426;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;
  <a class="ulink" href="http://www.faqs.org/rfcs/rfc2369.html" target="_top">http://www.faqs.org/rfcs/rfc2369.html</a>
  &#12434;&#35211;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12398;&#12504;&#12483;&#12480;&#12434;&#35211;&#12427;&#12392;&#12289;"list" &#12392;&#12356;&#12358;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#29992;&#12450;&#12489;&#12524;&#12473;&#12392;&#12375;&#12390;
  "list-help" &#12392; "list-unsubscribe" &#12364;&#12354;&#12427;&#12371;&#12392;&#12364;&#20309;&#12392;&#12394;&#12367;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12425;&#12395;&#21152;&#12360;&#12390;&#12289;&#36890;&#24120;&#12399;&#21442;&#21152;&#29992;&#12398;&#12450;&#12489;&#12524;&#12473;&#12392;&#12375;&#12390; "list-subscribe"&#12289;
  &#31649;&#29702;&#32773;&#12408;&#12398;&#36899;&#32097;&#29992;&#12450;&#12489;&#12524;&#12473;&#12392;&#12375;&#12390; "list-owner" &#12364;&#12354;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#20351;&#29992;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
  &#12371;&#12428;&#12425;&#20197;&#22806;&#12395;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#31649;&#29702;&#29992;&#12450;&#12489;&#12524;&#12473;&#12364;&#35373;&#23450;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#35443;&#32048;&#12399;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#36890;&#24120;&#12289;&#12371;&#12428;&#12425;&#12398;&#29305;&#21029;&#12394;&#12450;&#12489;&#12524;&#12473;&#12398;&#19968;&#35239;&#12399;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#21442;&#21152;&#26178;&#12395;&#33258;&#21205;&#36865;&#20449;&#12373;&#12428;&#12427;
  &#12300;&#12424;&#12358;&#12371;&#12381;&#12301;&#12513;&#12540;&#12523;&#12395;&#12414;&#12392;&#12417;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#33258;&#36523;&#12418;&#12371;&#12398;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12418;&#12375;&#35211;&#12425;&#12428;&#12394;&#12356;&#12424;&#12358;&#12394;&#12425;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#35504;&#12363;&#12395;&#35211;&#12379;&#12390;&#12418;&#12425;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12371;&#12398;&#12300;&#12424;&#12358;&#12371;&#12381;&#12301;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12399;&#12289;&#24120;&#12395;&#25163;&#20803;&#12395;&#12362;&#12356;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#20351;&#12356;&#26041;&#12395;&#38306;&#12377;&#12427;&#21839;&#12356;&#21512;&#12431;&#12379;&#12395;&#31572;&#12360;&#12383;&#12426;&#12289;
  &#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12395;&#24773;&#22577;&#12434;&#12398;&#12379;&#12383;&#12426;&#12377;&#12427;&#38555;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12363;&#12425;&#12300;&#36864;&#20250;&#12377;&#12427;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12377;&#12363;?&#12301;
  &#12392;&#12356;&#12358;&#36074;&#21839;&#12434;&#21463;&#12369;&#12383;&#12425;&#12289;&#12381;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12398; URL &#12434;&#25945;&#12360;&#12390;&#12354;&#12370;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#20013;&#12395;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12398;&#26411;&#23614;&#12395;&#36864;&#20250;&#29992;&#12398;&#25163;&#38918;&#12434;&#36617;&#12379;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12424;&#12358;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12354;&#12427;&#12398;&#12394;&#12425;&#12289;&#26377;&#21177;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#30446;&#31435;&#12383;&#12394;&#12356;&#22580;&#25152;&#12395;&#12411;&#12435;&#12398;&#25968;&#34892;&#12398;&#20869;&#23481;&#12434;&#36861;&#21152;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12383;&#12387;&#12383;&#12381;&#12428;&#12384;&#12369;&#12391;&#12289;&#12354;&#12394;&#12383;&#12398;&#25163;&#38291;&#12399;&#28608;&#28187;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#36864;&#20250;&#26041;&#27861;&#12434;&#25945;&#12360;&#12390;!&#12301;&#12392;&#12356;&#12358;&#12513;&#12540;&#12523;&#12364;&#12354;&#12394;&#12383;&#23451;&#12390;&#12395;
  (&#12418;&#12387;&#12392;&#12402;&#12393;&#12356;&#12371;&#12392;&#12395;&#12399;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#23451;&#12390;&#12395;!) &#23626;&#12367;&#12371;&#12392;&#12418;&#28187;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;"><div class="titlepage"><div><div><h3 class="title"><a name="reply-to"></a>Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;</h3></div></div></div><p>
  &#20808;&#12411;&#12393; <a class="xref" href="setting-tone.html#avoid-private-discussions" title="&#20491;&#20154;&#30340;&#12394;&#35696;&#35542;&#12434;&#36991;&#12369;&#12427;">&#12300;&#20491;&#20154;&#30340;&#12394;&#35696;&#35542;&#12434;&#36991;&#12369;&#12427;&#12301;</a> &#12391;&#12289;
  &#35696;&#35542;&#12399;&#20844;&#38283;&#12398;&#22580;&#12391;&#34892;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12398;&#37325;&#35201;&#24615;&#12434;&#24375;&#35519;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#12381;&#12398;&#12424;&#12358;&#12395;&#24515;&#12364;&#12369;&#12390;&#12362;&#12363;&#12394;&#12356;&#12392;&#12289;
  &#35696;&#35542;&#12399;&#12393;&#12435;&#12393;&#12435;&#20491;&#20154;&#30340;&#12394;&#12513;&#12540;&#12523;&#12398;&#12420;&#12426;&#12392;&#12426;&#12395;&#21454;&#26463;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#26412;&#31456;&#12391;&#25201;&#12387;&#12390;&#12356;&#12427;&#20869;&#23481;&#12399;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#29992;&#12356;&#12390;&#12356;&#12363;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;
  &#20870;&#28369;&#12395;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#35696;&#35542;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#32154;&#12369;&#12373;&#12428;&#12427;&#12424;&#12358;&#12394;&#27231;&#33021;&#12364;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#25645;&#36617;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#25163;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#8230;&#8230;&#12392;&#12399;&#19968;&#27010;&#12395;&#35328;&#12356;&#20999;&#12428;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12381;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12399;&#12354;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#28961;&#35222;&#12391;&#12365;&#12394;&#12356;&#21839;&#38988;&#28857;&#12418;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#27231;&#33021;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12398;&#20013;&#12391;&#12418;&#26368;&#12418;&#30333;&#29105;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#65303;&#26178;&#12398;&#12491;&#12517;&#12540;&#12473;&#12391;&#21462;&#12426;&#19978;&#12370;&#12425;&#12428;&#12427;&#12424;&#12358;&#12394;&#20869;&#23481;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12399;&#20309;&#24230;&#12392;&#12394;&#12367;&#35696;&#35542;&#12373;&#12428;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12289;&#12414;&#12378;&#12381;&#12398;&#27231;&#33021;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12289;
  &#21452;&#26041;&#12398;&#31435;&#22580;&#12398;&#20027;&#24373;&#12434;&#20006;&#12409;&#12383;&#12358;&#12360;&#12391;&#12289;
  &#20491;&#20154;&#30340;&#12395;&#12362;&#21223;&#12417;&#12398;&#26041;&#24335;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#27231;&#33021;&#12381;&#12398;&#12418;&#12398;&#12399;&#38750;&#24120;&#12395;&#12471;&#12531;&#12503;&#12523;&#12391;&#12377;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12395;&#23550;&#12375;&#12390;&#33258;&#21205;&#12391; Reply-to
  &#12504;&#12483;&#12480;&#12434;&#35373;&#23450;&#12375;&#12289;&#36820;&#20449;&#20808;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12392;&#12398;&#36865;&#20449;&#32773;&#12364;&#12393;&#12435;&#12394; Reply-to &#12504;&#12483;&#12480;&#12434;&#12388;&#12369;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;
  (&#12354;&#12427;&#12356;&#12399;&#12388;&#12369;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;)&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21442;&#21152;&#32773;&#12395;&#37197;&#20449;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12399;
  Reply-to &#12364;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#22793;&#12431;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><pre class="screen">
Reply-to: discuss@lists.example.org
</pre><p>
  &#19968;&#35211;&#12371;&#12428;&#12399;&#12424;&#12373;&#12370;&#12394;&#27231;&#33021;&#12395;&#35211;&#12360;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12399; Reply-to &#12504;&#12483;&#12480;&#12398;&#20869;&#23481;&#12434;&#32771;&#24942;&#12377;&#12427;&#12398;&#12391;&#12289;
  &#25237;&#31295;&#12395;&#23550;&#12375;&#12390;&#36820;&#20449;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#33258;&#21205;&#30340;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#23451;&#12390;&#12395;&#36865;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#36820;&#20449;&#12377;&#12427;&#20154;&#12398;&#24847;&#24605;&#12391;&#23451;&#20808;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
  <span class="emphasis"><em>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;</em></span>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#23451;&#12390;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#22823;&#20107;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#12486;&#12463;&#12494;&#12525;&#12472;&#12540;&#12398;&#21147;&#12391;&#21332;&#35519;&#20316;&#26989;&#12434;&#12420;&#12426;&#12420;&#12377;&#12367;&#12377;&#12427;&#12290;
  &#12414;&#12373;&#12395;&#23436;&#29863;&#12394;&#20363;&#12376;&#12419;&#12394;&#12356;&#12391;&#12377;&#12363;&#12290;
</p><p>
  &#12392;&#12371;&#12429;&#12364;&#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#12289;&#12371;&#12398;&#26041;&#27861;&#12395;&#12399;&#12356;&#12367;&#12388;&#12363;&#27424;&#28857;&#12364;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#27424;&#28857;&#12392;&#12375;&#12390;&#12414;&#12378;&#26368;&#21021;&#12395;&#12354;&#12370;&#12425;&#12428;&#12427;&#12398;&#12364;&#12289;&#12356;&#12431;&#12422;&#12427;
  <em class="firstterm">Can't Find My Way Back Home (&#12362;&#12358;&#12385;&#12395;&#24112;&#12428;&#12394;&#12356;)</em>
  &#21839;&#38988;&#12391;&#12377;&#12290;&#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#26222;&#27573;&#12392;&#12399;&#30064;&#12394;&#12427;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#12513;&#12540;&#12523;&#12434;&#36865;&#20449;&#12377;&#12427;&#38555;&#12394;&#12393;&#12289;
  &#12300;&#26412;&#24403;&#12398;&#12301;&#12450;&#12489;&#12524;&#12473;&#12434; Reply-to &#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#24120;&#12395;&#21516;&#12376;&#22580;&#25152;&#12391;&#12513;&#12540;&#12523;&#12398;&#35501;&#12415;&#26360;&#12365;&#12434;&#34892;&#12358;&#12398;&#12394;&#12425;&#12289;&#12371;&#12398;&#21839;&#38988;&#12399;&#36215;&#12371;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#12289;&#12381;&#12435;&#12394;&#21839;&#38988;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#12377;&#12425;&#27671;&#12389;&#12356;&#12390;&#12356;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#26222;&#27573;&#12392;&#12399;&#30064;&#12394;&#12427;&#35373;&#23450;&#12391;&#12513;&#12540;&#12523;&#12434;&#36865;&#20449;&#12377;&#12427;&#20154;&#12420;
  &#12513;&#12540;&#12523;&#12398; From &#12450;&#12489;&#12524;&#12473;&#12434;&#22793;&#26356;&#12391;&#12365;&#12394;&#12356;&#29366;&#27841;
  (&#32887;&#22580;&#12363;&#12425;&#36865;&#20449;&#12375;&#12390;&#12362;&#12426;&#12289;IT &#37096;&#38272;&#12395;&#23550;&#12377;&#12427;&#27177;&#38480;&#12364;&#12394;&#12356;&#29366;&#27841;)
  &#12398;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#36820;&#20449;&#12434;&#33258;&#20998;&#12391;&#21463;&#12369;&#21462;&#12427;&#12383;&#12417;&#12398;&#21807;&#19968;&#12398;&#25163;&#27573;&#12364; Reply-to &#12392;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12398;&#12392;&#12399;&#21029;&#12398;&#12450;&#12489;&#12524;&#12473;&#12391;&#25237;&#31295;&#12377;&#12427;&#38555;&#12395;&#12399;
  Reply-to &#35373;&#23450;&#12399;&#24517;&#35201;&#19981;&#21487;&#27424;&#12394;&#24773;&#22577;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12381;&#12428;&#12434;&#19978;&#26360;&#12365;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#12381;&#12398;&#20154;&#12399;&#33258;&#20998;&#12398;&#25237;&#31295;&#12395;&#23550;&#12377;&#12427;&#36820;&#20449;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#21839;&#38988;&#12399;&#12289;&#26399;&#24453;&#12395;&#21453;&#12377;&#12427;&#21205;&#20316;&#12434;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20491;&#20154;&#30340;&#12395;&#12399;&#12289;Reply-to &#12398;&#22793;&#26356;&#12395;&#21453;&#23550;&#12377;&#12427;&#20154;&#12364;&#26368;&#12418;&#24375;&#12367;&#20027;&#24373;&#12375;&#12390;&#12356;&#12427;&#12398;&#12364;&#12371;&#12398;&#21839;&#38988;&#12384;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
  &#12513;&#12540;&#12523;&#12398;&#20966;&#29702;&#12395;&#24931;&#12428;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;<em class="firstterm">reply-to-all (&#20840;&#21729;&#12395;&#36820;&#20449;)</em>
  &#12392; <em class="firstterm">reply-to-author (&#36865;&#20449;&#32773;&#12395;&#23550;&#12375;&#12390;&#36820;&#20449;)</em>
  &#12398;&#65298;&#36890;&#12426;&#12398;&#36820;&#20449;&#26041;&#27861;&#12434;&#20351;&#12356;&#20998;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#26368;&#36817;&#12398;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#25805;&#20316;&#12395;&#23550;&#12375;&#12390;
  &#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;&#12461;&#12540;&#12434;&#21106;&#12426;&#24403;&#12390;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#20840;&#21729; (&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12418;&#21547;&#12416;) &#12395;&#36820;&#20449;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;
  &#12300;&#20840;&#21729;&#12395;&#36820;&#20449;&#12301;&#12434;&#12289;&#12381;&#12375;&#12390;&#36865;&#20449;&#32773;&#12395;&#23550;&#12375;&#12390;&#20491;&#20154;&#30340;&#12395;&#36820;&#20449;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;
  &#21336;&#12394;&#12427;&#12300;&#36820;&#20449;&#12301;&#12434;&#20351;&#12360;&#12400;&#12356;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12392;&#12375;&#12390;&#12399;&#36820;&#20449;&#12399;&#21487;&#33021;&#12394;&#38480;&#12426;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#36865;&#20449;&#12375;&#12390;&#12411;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#36820;&#20449;&#12377;&#12427;&#12411;&#12358;&#12395;&#12399;&#20491;&#20154;&#30340;&#12395;&#36820;&#20449;&#12377;&#12427;&#27177;&#21033;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;
  &#20803;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#23550;&#12375;&#12390;&#20309;&#12363;&#27231;&#23494;&#24773;&#22577;&#12434;&#21547;&#12416;&#20869;&#23481;&#12434;&#36820;&#20449;&#12375;&#12383;&#12356;&#22580;&#21512;&#12394;&#12393;&#12399;&#12289;
  &#12381;&#12428;&#12364;&#20844;&#38283;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#27969;&#12428;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12414;&#12378;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12373;&#12390;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#20596;&#12391;&#36865;&#20449;&#32773;&#12398; Reply-to
  &#35373;&#23450;&#12434;&#26360;&#12365;&#25563;&#12360;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#12393;&#12358;&#12394;&#12427;&#12398;&#12363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#12513;&#12540;&#12523;&#12395;&#23550;&#12375;&#12390;&#12300;&#36865;&#20449;&#32773;&#12395;&#36820;&#20449;&#12301;&#12398;&#12461;&#12540;&#12434;&#25276;&#12375;&#12383;&#12392;&#12375;&#12383;&#12425;&#12289;
  &#24403;&#28982;&#12381;&#12398;&#20154;&#12399;&#12381;&#12398;&#12513;&#12540;&#12523;&#12364;&#36865;&#20449;&#32773;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#23626;&#12367;&#12418;&#12398;&#12392;&#26399;&#24453;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12372;&#12367;&#24403;&#12383;&#12426;&#21069;&#12398;&#12371;&#12392;&#12394;&#12398;&#12391;&#12289;&#12356;&#12385;&#12356;&#12385;&#12354;&#12390;&#20808;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12418;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#36820;&#20449;&#12513;&#12540;&#12523;&#12398;&#20013;&#12391;&#20491;&#20154;&#30340;&#12394;&#20869;&#32210;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;
  (&#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#24746;&#21475;&#12363;&#12418;&#8230;&#8230;)
  &#12434;&#26360;&#12365;&#12289;&#36865;&#20449;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12414;&#12377;&#12290;
  &#20104;&#24819;&#12395;&#21453;&#12375;&#12390;&#12289;&#25968;&#20998;&#24460;&#12395;&#12399;&#24444;&#12398;&#26360;&#12356;&#12383;&#36820;&#20449;&#12364;
  <span class="emphasis"><em>&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;</em></span>&#27969;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;!
  &#12360;&#12360;&#12289;&#12418;&#12385;&#12429;&#12435;&#36865;&#20449;&#21069;&#12395;&#12354;&#12390;&#20808;&#12434;&#12375;&#12387;&#12363;&#12426;&#30906;&#35469;&#12375;&#12394;&#12363;&#12387;&#12383;&#24444;&#12364;&#24746;&#12356;&#12398;&#12391;&#12377;&#8230;&#8230;
  &#29702;&#23624;&#19978;&#12399;&#12290;&#12391;&#12418;&#12289;&#26222;&#36890;&#12399; Reply-to &#12399;&#36865;&#20449;&#32773;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;
  (&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12364;&#12381;&#12358;&#35373;&#23450;&#12375;&#12390;&#12356;&#12427;&#12399;&#12378;) &#12394;&#12398;&#12391;&#12289;
  &#38263;&#24180;&#12513;&#12540;&#12523;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#20154;&#12411;&#12393;&#12381;&#12358;&#20449;&#12376;&#36796;&#12435;&#12391;&#12375;&#12414;&#12358;&#20670;&#21521;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12289;&#12418;&#12375;&#24847;&#22259;&#30340;&#12395;&#20182;&#12398;&#12450;&#12489;&#12524;&#12473; (&#12383;&#12392;&#12360;&#12400;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12394;&#12393;)
  &#12434; Reply-to &#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#36890;&#24120;&#12399;&#12381;&#12428;&#12434;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20013;&#12391;&#26126;&#35352;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#20104;&#26399;&#12379;&#12396;&#25391;&#12427;&#33310;&#12356;&#12398;&#24433;&#38911;&#12399;&#28961;&#35222;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289;
  &#20491;&#20154;&#30340;&#12395;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#20596;&#12391;&#12398; Reply-to &#12504;&#12483;&#12480;&#12398;&#22793;&#26356;&#12399;&#34892;&#12431;&#12394;&#12356;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;
  &#30906;&#12363;&#12395;&#12371;&#12398;&#27231;&#33021;&#12399;&#20849;&#21516;&#20316;&#26989;&#12398;&#38555;&#12395;&#12399;&#20415;&#21033;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#31169;&#12395;&#12392;&#12387;&#12390;&#12399;&#12381;&#12398;&#21103;&#20316;&#29992;&#12398;&#24433;&#38911;&#12398;&#12411;&#12358;&#12364;&#37325;&#22823;&#12395;&#24863;&#12376;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#31435;&#22580;&#12398;&#20154;&#12383;&#12385;&#12395;&#12418;&#12381;&#12428;&#12394;&#12426;&#12398;&#35328;&#12356;&#20998;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12393;&#12385;&#12425;&#12434;&#36984;&#25246;&#12375;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12300;&#12393;&#12358;&#12375;&#12390;&#9675;&#9675;&#12395;&#12375;&#12394;&#12363;&#12387;&#12383;&#12398;?&#12301;
  &#12392;&#12356;&#12358;&#36074;&#21839;&#12364;&#12383;&#12403;&#12383;&#12403;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12365;&#12387;&#12392;&#12289;&#12381;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#26412;&#26469;&#25201;&#12356;&#12383;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12486;&#12540;&#12510;&#12392;&#12399;&#30064;&#12394;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#29992;&#12395;&#12289;&#12371;&#12398;&#21839;&#38988;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12434;&#12358;&#12414;&#12367;&#12375;&#12378;&#12417;&#12427;&#12424;&#12358;&#12394;
  &#12362;&#27770;&#12414;&#12426;&#12398;&#36820;&#31572;&#12434;&#29992;&#24847;&#12375;&#12390;&#12362;&#12367;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12371;&#12391;&#22823;&#20999;&#12394;&#12398;&#12399;&#12289;
  &#12354;&#12394;&#12383;&#12364;&#12393;&#12385;&#12425;&#12398;&#35373;&#23450;&#12434;&#36984;&#12435;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;<span class="emphasis"><em>&#27770;&#12375;&#12390;</em></span>
  &#12381;&#12428;&#12364;&#21807;&#19968;&#12398;&#27491;&#35299;&#12394;&#12435;&#12384;&#12392;&#20027;&#24373;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;
  (&#12383;&#12392;&#12360;&#20869;&#24515;&#12391;&#12399;&#12381;&#12358;&#24605;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;)&#12290;
  &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#35500;&#26126;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#12371;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;&#26132;&#12363;&#12425;&#35696;&#35542;&#12364;&#32368;&#12426;&#36820;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12393;&#12385;&#12425;&#12398;&#31435;&#22580;&#12398;&#20027;&#24373;&#12395;&#12418;&#12381;&#12428;&#12394;&#12426;&#12398;&#35328;&#12356;&#20998;&#12364;&#12354;&#12426;&#12289;
  &#12415;&#12435;&#12394;&#12364;&#32013;&#24471;&#12377;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#22256;&#38627;&#12391;&#12377;&#12290;
  &#12384;&#12363;&#12425;&#12289;&#31169;&#12399;&#33258;&#20998;&#12364;&#12424;&#12426;&#12424;&#12356;&#12392;&#24605;&#12358;&#35373;&#23450;&#12395;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;&#12301;
  &#12381;&#12375;&#12390;&#12289;(&#12414;&#12387;&#12383;&#12367;&#12398;&#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#36074;&#21839;&#12375;&#12390;&#12367;&#12427;&#22580;&#21512;&#12399;&#21029;&#12392;&#12375;&#12390;)
  &#12418;&#12358;&#12371;&#12398;&#35441;&#38988;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#35441;&#12377;&#12398;&#12399;&#12420;&#12417;&#12427;&#12424;&#12358;&#19969;&#23527;&#12395;&#12362;&#39000;&#12356;&#12375;&#12289;
  &#12354;&#12392;&#12399;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#25918;&#32622;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#35696;&#35542;&#12399;&#33258;&#28982;&#12395;&#21454;&#12414;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#12289;&#35504;&#12363;&#12364;&#12300;&#12393;&#12387;&#12385;&#12364;&#12356;&#12356;&#12363;&#25237;&#31080;&#12391;&#27770;&#12417;&#12424;&#12358;&#12301;&#12394;&#12435;&#12390;&#35328;&#12356;&#20986;&#12377;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12373;&#12360;&#12363;&#12414;&#12431;&#12394;&#12369;&#12428;&#12400;&#12381;&#12428;&#12391;&#12418;&#12356;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#20491;&#20154;&#30340;&#12395;&#12399;&#12289;&#12371;&#12398;&#21839;&#38988;&#12399;&#22810;&#25968;&#27770;&#12391;&#27770;&#12417;&#12427;&#12424;&#12358;&#12394;&#39006;&#12398;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
  &#20104;&#26399;&#12379;&#12396;&#25369;&#21205;&#12398;&#12379;&#12356;&#12391;&#21463;&#12369;&#12427;&#34987;&#23475; (&#20491;&#20154;&#30340;&#12394;&#12513;&#12540;&#12523;&#12434;
  &#38291;&#36949;&#12387;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#36865;&#12387;&#12390;&#12375;&#12414;&#12358;) &#12399;&#29978;&#22823;&#12391;&#12377;&#12364;&#12289;
  Reply-to &#12434;&#26360;&#12365;&#25563;&#12360;&#12394;&#12356;&#12371;&#12392;&#12391;&#21442;&#21152;&#32773;&#12364;&#21463;&#12369;&#12427;&#19981;&#21033;&#30410;&#12399;&#12383;&#12363;&#12364;&#30693;&#12428;&#12390;&#12356;&#12414;&#12377;
  (&#12383;&#12414;&#12395;&#38291;&#36949;&#12387;&#12390;&#20491;&#20154;&#23451;&#12395;&#36820;&#20449;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#36820;&#20449;&#12377;&#12427;&#12424;&#12358;&#20253;&#12360;&#12427;&#12367;&#12425;&#12356;&#12391;&#12377;)&#12290;
  &#20491;&#20154;&#30340;&#12394;&#12513;&#12540;&#12523;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#36865;&#12387;&#12390;&#12375;&#12414;&#12358;&#12424;&#12358;&#12394;&#20154;&#12399;
  &#12411;&#12435;&#12398;&#19968;&#25569;&#12426;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12391;&#12418;&#12289;&#12383;&#12392;&#12360;&#12381;&#12358;&#12391;&#12354;&#12387;&#12390;&#12418;
  &#24444;&#12425;&#12395;&#12381;&#12398;&#12424;&#12358;&#12394;&#12522;&#12473;&#12463;&#12434;&#36000;&#12431;&#12379;&#12427;&#12371;&#12392;&#12364;&#35377;&#12373;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;?
</p><p>
  &#12371;&#12398;&#21839;&#38988;&#12395;&#38306;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#35696;&#35542;&#12434;&#21462;&#12426;&#19978;&#12370;&#12427;&#12371;&#12392;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12289;&#26368;&#12418;&#37325;&#35201;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12418;&#12398;&#12384;&#12369;&#12434;&#31034;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#35443;&#32048;&#12394;&#35696;&#35542;&#12398;&#20869;&#23481;&#12399;&#12289;&#20197;&#19979;&#12398;&#25991;&#26360;&#12391;&#12372;&#30906;&#35469;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12393;&#12385;&#12425;&#12418;&#12289;&#12371;&#12398;&#21839;&#38988;&#12364;&#25345;&#12385;&#19978;&#12364;&#12427;&#12383;&#12403;&#12395;&#22810;&#12367;&#12398;&#20154;&#12364;&#24341;&#29992;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Reply-to &#12399;&#12381;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12384;&#12392;&#12356;&#12358;&#20027;&#24373;</strong></span>,
     <span class="emphasis"><em>by Chip Rosenthal</em></span></p><p><a class="ulink" href="http://www.unicom.com/pw/reply-to-harmful.html" target="_top">http://www.unicom.com/pw/reply-to-harmful.html</a>
        (<a class="ulink" href="http://arch.bluegate.org/reply-to-harmful.html" target="_top">&#26085;&#26412;&#35486;</a>)
     </p></li><li class="listitem"><p><span class="bold"><strong>Reply-to &#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#23451;&#12395;&#22793;&#26356;&#12377;&#12409;&#12365;&#12384;&#12392;&#12356;&#12358;&#20027;&#24373;</strong></span>,
     <span class="emphasis"><em>by Simon Hill</em></span></p><p><a class="ulink" href="http://www.metasystema.net/essays/reply-to.mhtml" target="_top">http://www.metasystema.net/essays/reply-to.mhtml</a>
        (<a class="ulink" href="http://arch.bluegate.org/reply-to.html" target="_top">&#26085;&#26412;&#35486;</a>)
     </p></li></ul></div><p>

</p><p>
  &#20808;&#12411;&#12393;&#31169;&#12398;&#20491;&#20154;&#30340;&#12394;&#22909;&#12415;&#12434;&#36605;&#12367;&#36848;&#12409;&#12414;&#12375;&#12383;&#12364;&#12289;&#27770;&#12375;&#12390;&#12381;&#12428;&#12364; "&#27491;&#35299;"
  &#12384;&#12392;&#30906;&#20449;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#23455;&#38555;&#12289;&#31169;&#12399; Reply-to &#12434;
  <span class="emphasis"><em>&#26360;&#12365;&#25563;&#12360;&#12390;&#12356;&#12427;</em></span> &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12418;&#22810;&#25968;&#21442;&#21152;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#22823;&#20107;&#12394;&#12371;&#12392;&#12399;&#12289;&#12393;&#12385;&#12425;&#12395;&#12377;&#12427;&#12398;&#12363;&#12434;&#26089;&#12417;&#12395;&#27770;&#12417;&#12390;&#12362;&#12367;&#12371;&#12392;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#24460;&#12293;&#12371;&#12398;&#20214;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12395;&#24059;&#12365;&#36796;&#12414;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><div class="sect3" title="&#31169;&#12398;&#12405;&#12383;&#12388;&#12398;&#22818;"><div class="titlepage"><div><div><h4 class="title"><a name="reply-fantasies"></a>&#31169;&#12398;&#12405;&#12383;&#12388;&#12398;&#22818;</h4></div></div></div><p>
  &#12356;&#12388;&#12398;&#26085;&#12363;&#12289;&#12393;&#12371;&#12363;&#12398;&#35504;&#12363;&#12364; <em class="firstterm">reply-to-list</em>
  &#27231;&#33021;&#12434;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12395;&#32068;&#12415;&#36796;&#12435;&#12391;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;
  &#20808;&#12411;&#12393;&#35500;&#26126;&#12375;&#12383;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#29420;&#29305;&#12398;&#12504;&#12483;&#12480;&#12398;&#20869;&#23481;&#12434;&#12358;&#12414;&#12367;&#35501;&#12415;&#21462;&#12426;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#23451;&#12390;&#12395;&#36969;&#20999;&#12395;&#36820;&#20449;&#12375;&#12390;&#12367;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#20197;&#22806;&#12398;&#30456;&#25163;&#12395;&#12399;&#12513;&#12540;&#12523;&#12399;&#36865;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12384;&#12387;&#12390;&#12381;&#12398;&#20154;&#12383;&#12385;&#12411;&#12411;&#12392;&#12435;&#12393;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12418;&#21152;&#20837;&#12375;&#12390;&#12356;&#12427;&#12435;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#20596;&#12391;&#12371;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12434;&#23455;&#35013;&#12375;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;
  &#12371;&#12435;&#12394;&#35696;&#35542;&#12434;&#12379;&#12378;&#12395;&#12377;&#12416;&#12424;&#12358;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;
  (&#23455;&#38555;&#12289;<a class="ulink" href="http://www.mutt.org/" target="_top">Mutt</a>
  &#12392;&#12356;&#12358;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12399;&#12371;&#12398;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;
  <sup>[<a name="idp946672" href="#ftn.idp946672" class="footnote">16</a>]</sup>
  )&#12290;
</p><p>
  &#12424;&#12426;&#12424;&#12356;&#23550;&#24540;&#27861;&#12399;&#12289;Reply-to &#12434;&#22793;&#26356;&#12377;&#12427;&#12363;&#12375;&#12394;&#12356;&#12363;&#12434;
  &#21508;&#12513;&#12531;&#12496;&#12540;&#12364;&#20491;&#21029;&#12395;&#35373;&#23450;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#23451;&#12390;&#12398;&#25237;&#31295;&#12399; (&#33258;&#20998;&#12398;&#25237;&#31295;&#12418;&#20182;&#20154;&#12398;&#25237;&#31295;&#12418;&#21547;&#12417;&#12390;)
  Reply-to &#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#12375;&#12390;&#12411;&#12375;&#12356;&#12392;&#12356;&#12358;&#20154;&#12399;&#12381;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12289;
  Reply-to &#12434;&#12381;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#12411;&#12375;&#12356;&#20154;&#12399;&#12381;&#12398;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
  &#27531;&#24565;&#12394;&#12364;&#12425;&#29694;&#26178;&#28857;&#12391;&#12399;&#12289;
  &#12371;&#12428;&#12434;&#21508;&#21442;&#21152;&#32773;&#12372;&#12392;&#12395;&#35373;&#23450;&#12391;&#12365;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12399;&#23384;&#22312;&#12375;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#29694;&#29366;&#12399;&#12289;&#20840;&#21729;&#20849;&#36890;&#12398;&#35373;&#23450;&#12391;&#25105;&#24930;&#12377;&#12427;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  <sup>[<a name="idp932848" href="#ftn.idp932848" class="footnote">17</a>]</sup>
</p></div></div><div class="sect2" title="&#12450;&#12540;&#12459;&#12452;&#12502;"><div class="titlepage"><div><div><h3 class="title"><a name="archiving"></a>&#12450;&#12540;&#12459;&#12452;&#12502;</h3></div></div></div><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#35373;&#23450;&#12377;&#12427;&#25216;&#34899;&#30340;&#12394;&#26041;&#27861;&#12399;&#12289;
  &#20351;&#29992;&#12377;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12427;&#12398;&#12391;&#12289;
  &#26412;&#26360;&#12391;&#12399;&#35443;&#12375;&#12367;&#12399;&#21462;&#12426;&#19978;&#12370;&#12414;&#12379;&#12435;&#12290;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12484;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12383;&#12426;&#35373;&#23450;&#12375;&#12383;&#12426;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;
  &#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#28857;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="variablelist"><dl><dt><span class="term">&#36805;&#36895;&#12394;&#26356;&#26032;</span></dt><dd><p>
        &#23569;&#12394;&#12367;&#12392;&#12418;&#12289;&#23455;&#38555;&#12395;&#25237;&#31295;&#12364;&#12354;&#12387;&#12390;&#12363;&#12425;&#65297;&#26178;&#38291;&#24460;&#12367;&#12425;&#12356;&#12395;&#12399;
        &#12381;&#12398;&#25237;&#31295;&#12364;&#12450;&#12540;&#12459;&#12452;&#12502;&#12373;&#12428;&#12390;&#12356;&#12390;&#12411;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
        &#21487;&#33021;&#12394;&#12425;&#12289;&#23455;&#38555;&#12395;&#25237;&#31295;&#12364;&#12354;&#12387;&#12383;&#30636;&#38291;&#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#20966;&#29702;&#12418;&#21516;&#26178;&#12395;&#34892;&#12394;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
        &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12381;&#12398;&#25237;&#31295;&#12364;&#12513;&#12531;&#12496;&#12540;&#12395;&#37197;&#20449;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12399;&#26082;&#12395;
        &#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12418;&#21516;&#12376;&#20869;&#23481;&#12364;&#23384;&#22312;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        &#12381;&#12428;&#12364;&#28961;&#29702;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#65297;&#26178;&#38291;&#12362;&#12365;&#12367;&#12425;&#12356;&#12398;&#38971;&#24230;&#12391;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#26356;&#26032;&#12434;&#34892;&#12394;&#12356;&#12414;&#12375;&#12423;&#12358;
        (&#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;
        &#65297;&#26085;&#12395;&#65297;&#22238;&#12375;&#12363;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#34892;&#12394;&#12431;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
        &#12375;&#12363;&#12375;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#20966;&#29702;&#12392;&#12375;&#12390;&#12399;&#12289;
        &#20107;&#23455;&#19978;&#12371;&#12428;&#12391;&#12399;&#20351;&#12356;&#29289;&#12395;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;)&#12290;
      </p></dd><dt><span class="term">&#21442;&#29031;&#12398;&#27704;&#32154;&#24615;</span></dt><dd><p>
        &#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12356;&#12387;&#12383;&#12435;&#12354;&#12427; URL &#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#12373;&#12428;&#12383;&#12425;&#12289;
        &#12381;&#12398;&#24460;&#12378;&#12387;&#12392;&#21516;&#12376; URL &#12391;&#12381;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
        &#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#20877;&#27083;&#31689;&#12375;&#12383;&#12426;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12363;&#12425;&#24489;&#26087;&#12375;&#12383;&#12426;&#12289;
        &#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#20182;&#20309;&#12425;&#12363;&#12398;&#20462;&#27491;&#12434;&#21152;&#12360;&#12383;&#12392;&#12365;&#12395;&#12418;&#12289;
        &#12356;&#12387;&#12383;&#12435;&#20844;&#38283;&#12375;&#12383; URL &#12399;&#12381;&#12398;&#12414;&#12414;&#22793;&#12431;&#12425;&#12394;&#12356;&#12371;&#12392;&#12364;&#26395;&#12414;&#12375;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
        &#21516;&#12376; URL &#12434;&#20445;&#12388;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12395;&#25429;&#25417;&#12373;&#12428;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
        &#12371;&#12428;&#12399;&#12289;&#21033;&#29992;&#32773;&#12395;&#12392;&#12387;&#12390;&#22823;&#12365;&#12394;&#21033;&#28857;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
        URL &#12434;&#20445;&#12385;&#32154;&#12369;&#12427;&#12424;&#12358;&#24515;&#12364;&#12369;&#12427;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#29702;&#30001;&#12392;&#12375;&#12390;&#12399;&#12289;
        &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#25237;&#31295;&#12420;&#12473;&#12524;&#12483;&#12489;&#12364;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;
        (<span>&#26412;&#31456;&#12398;&#24460;&#21322;</span>&#12398;
        <a class="xref" href="bug-tracker.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;">&#12300;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
        &#12420;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12363;&#12425;&#12522;&#12531;&#12463;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
      </p><p>
        &#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#12513;&#12540;&#12523;&#12434;&#12513;&#12531;&#12496;&#12540;&#12395;&#37197;&#20449;&#12377;&#12427;&#38555;&#12395;&#12289;
        &#12381;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12450;&#12540;&#12459;&#12452;&#12502;&#12373;&#12428;&#12390;&#12356;&#12427; URL
        &#12434;&#12504;&#12483;&#12480;&#12395;&#21547;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12428;&#12400;&#12394;&#12362;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
        &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12381;&#12398;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#20154;&#12399;
        &#12431;&#12374;&#12431;&#12374;&#12450;&#12540;&#12459;&#12452;&#12502;&#12469;&#12452;&#12488;&#12434;&#35370;&#12428;&#12394;&#12367;&#12390;&#12418;
        &#12381;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12450;&#12540;&#12459;&#12452;&#12502;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12434;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        &#12502;&#12521;&#12454;&#12470;&#12434;&#38283;&#12356;&#12390;&#20309;&#12425;&#12363;&#12398;&#25805;&#20316;&#12434;&#12377;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;&#26178;&#38291;&#12398;&#12363;&#12363;&#12427;&#20316;&#26989;&#12394;&#12398;&#12391;&#12289;
        &#12381;&#12428;&#12364;&#30465;&#12369;&#12427;&#12384;&#12369;&#12391;&#12418;&#38750;&#24120;&#12395;&#20415;&#21033;&#12391;&#12377;&#12290;
        &#12371;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12434;&#25345;&#12388;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;
        &#31169;&#12399;&#30693;&#12426;&#12414;&#12379;&#12435;&#12290;&#27531;&#24565;&#12394;&#12364;&#12425;&#12289;
        &#31169;&#12364;&#20170;&#20351;&#12387;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12399;&#12381;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12399;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
        &#12375;&#12363;&#12375;&#12289;&#12393;&#12371;&#12363;&#12395;&#12381;&#12435;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12354;&#12427;&#12398;&#12391;&#12399;&#12392;&#26399;&#24453;&#12375;&#12390;&#12356;&#12414;&#12377;
        (&#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#26032;&#12383;&#12395;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#38283;&#30330;&#12377;&#12427;&#12398;&#12394;&#12425;&#12289;
        &#12380;&#12402;&#12371;&#12398;&#27231;&#33021;&#12434;&#23455;&#35013;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12362;&#39000;&#12356;&#12375;&#12414;&#12377;)&#12290;
      </p></dd><dt><span class="term">&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;</span></dt><dd><p>
        &#24403;&#28982;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12392;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12363;&#12425;&#12398;&#24489;&#26087;&#12398;&#26041;&#27861;&#12399;
        &#31777;&#21336;&#12394;&#12411;&#12358;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12356;&#12356;&#12363;&#12360;&#12428;&#12400;&#12289;
        &#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12364;&#12502;&#12521;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#21270;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
        &#12354;&#12394;&#12383; (&#12418;&#12375;&#12367;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#35504;&#12363;)
        &#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#23455;&#38555;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12289;&#12414;&#12383;&#12289;
        &#24517;&#35201;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#12399;&#12381;&#12371;&#12363;&#12425;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#24489;&#20803;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
        &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#20869;&#23481;&#12399;&#23453;&#29289;&#12391;&#12377;&#12290;
        &#19975;&#19968;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#22833;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12354;&#12428;&#12400;&#12289;
        &#36020;&#37325;&#12394;&#35352;&#37682;&#12434;&#22833;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      </p></dd><dt><span class="term">&#12473;&#12524;&#12483;&#12489;&#12398;&#12469;&#12509;&#12540;&#12488;</span></dt><dd><p>
        &#20491;&#12293;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12363;&#12425;&#12289;&#12381;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#23646;&#12377;&#12427;
        <em class="firstterm">&#12473;&#12524;&#12483;&#12489;</em> (&#38306;&#36899;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12414;&#12392;&#12414;&#12426;)
        &#12408;&#31227;&#21205;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
        &#12414;&#12383;&#12289;&#21508;&#12513;&#12483;&#12475;&#12540;&#12472;&#20491;&#21029;&#12398; URL &#12392;&#12399;&#21029;&#12395;&#12289;
        &#12473;&#12524;&#12483;&#12489;&#12434;&#34920;&#12377; URL &#12418;&#12354;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      </p></dd><dt><span class="term">&#26908;&#32034;&#27231;&#33021;</span></dt><dd><p>
        &#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26412;&#25991;&#12420;&#36865;&#20449;&#32773;&#12289;&#20214;&#21517;&#12394;&#12393;&#12395;&#12424;&#12427;&#26908;&#32034;&#27231;&#33021;&#12434;
        &#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12394;&#12435;&#12390;&#12289;&#20351;&#12356;&#29289;&#12395;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12387;&#12390;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
        &#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12398;&#20013;&#12395;&#12399;&#12289;&#21336;&#12395;
        <a class="ulink" href="http://www.google.com/" target="_top">Google</a>
        &#12394;&#12393;&#12398;&#22806;&#37096;&#12398;&#12469;&#12540;&#12481;&#12456;&#12531;&#12472;&#12531;&#12395;&#20966;&#29702;&#12434;&#12414;&#12363;&#12379;&#12390;&#12356;&#12427;&#12384;&#12369;&#12398;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
        &#27231;&#33021;&#12364;&#12394;&#12356;&#12424;&#12426;&#12399;&#12414;&#12375;&#12391;&#12377;&#12364;&#12289;&#26908;&#32034;&#27231;&#33021;&#12434;&#33258;&#21069;&#12391;&#23455;&#35013;&#12375;&#12390;&#12356;&#12427;&#12411;&#12358;&#12364;
        &#12424;&#12426;&#12365;&#12417;&#32048;&#12420;&#12363;&#12394;&#20966;&#29702;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        &#12383;&#12392;&#12360;&#12400;&#12289;&#12479;&#12452;&#12488;&#12523;&#12384;&#12369;&#12434;&#23550;&#35937;&#12395;&#26908;&#32034;&#12375;&#12383;&#12426;&#12289;
        &#26412;&#25991;&#12418;&#21547;&#12417;&#12390;&#26908;&#32034;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
      </p></dd></dl></div><p>
  &#19978;&#12395;&#12354;&#12370;&#12383;&#12398;&#12399;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#38555;&#12395;&#27880;&#24847;&#12377;&#12427;&#28857;&#12392;&#12375;&#12390;
  &#25216;&#34899;&#30340;&#12394;&#38754;&#12395;&#12375;&#12412;&#12387;&#12383;&#19968;&#35239;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12395;&#12415;&#12435;&#12394;&#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#12477;&#12501;&#12488;&#12434;<span class="emphasis"><em>&#21033;&#29992;</em></span>
  &#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12395;&#12393;&#12398;&#12424;&#12358;&#12394;&#21033;&#28857;&#12364;&#12354;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  <a class="xref" href="growth.html#using-archives" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;">&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;&#12301;</a>&#12391;&#12392;&#12426;&#12354;&#12370;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;"><div class="titlepage"><div><div><h3 class="title"><a name="mailing-list-software"></a>&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</h3></div></div></div><p>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#31649;&#29702;&#12420;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#20316;&#25104;&#29992;&#12395;&#12289;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#12484;&#12540;&#12523;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20844;&#38283;&#12375;&#12390;&#12356;&#12427;&#12469;&#12452;&#12488;&#12391;&#20309;&#12363;&#12398;&#12484;&#12540;&#12523;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#20351;&#12360;&#12400;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;&#12418;&#12375;&#33258;&#20998;&#12391;&#26032;&#12383;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12356;&#12367;&#12388;&#12363;&#12398;&#36984;&#25246;&#32930;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#31169;&#12364;&#23455;&#38555;&#12395;&#20351;&#29992;&#12375;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#12398;&#12399;
  Mailman&#12289;Ezmlm&#12289;MHonArc&#12289;&#12381;&#12375;&#12390; Hypermail &#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#21155;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;
  (&#12414;&#12383;&#12289;&#24403;&#28982;&#12398;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;&#31169;&#12364;&#30693;&#12387;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12384;&#12369;&#12364;&#12377;&#12409;&#12390;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#20197;&#22806;&#12395;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#12418;&#12398;&#12364;&#12354;&#12427;&#12399;&#12378;&#12394;&#12398;&#12391;&#12289;
  &#12371;&#12428;&#12434;&#23436;&#20840;&#12394;&#12522;&#12473;&#12488;&#12392;&#12399;&#12392;&#12425;&#12360;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;)&#12290;
</p><p>&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Mailman</strong></span> &#8212; <a class="ulink" href="http://www.list.org/" target="_top">http://www.list.org/</a></p><p>
     (Pipermail &#12392;&#12356;&#12358;&#12450;&#12540;&#12459;&#12452;&#12496;&#12364;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
      &#12503;&#12521;&#12464;&#12452;&#12531;&#24418;&#24335;&#12391;&#22806;&#37096;&#12398;&#12450;&#12540;&#12459;&#12452;&#12496;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
      Mailman &#12399;&#27161;&#28310;&#12398;&#24231;&#12434;&#38263;&#24180;&#32173;&#25345;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12381;&#12398;&#31649;&#29702;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12289;&#29305;&#12395;&#12473;&#12497;&#12512;&#12398;&#12514;&#12487;&#12524;&#12540;&#12471;&#12519;&#12531;&#12420;
      &#36092;&#35501;&#12398;&#12514;&#12487;&#12524;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12375;&#12390;&#12399;&#12373;&#12377;&#12364;&#12395;&#26178;&#20195;&#12434;&#24863;&#12376;&#12373;&#12379;&#12289;
      &#12424;&#12426;&#12514;&#12480;&#12531;&#12394;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12395;&#24931;&#12428;&#12383;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;
      &#12418;&#12393;&#12363;&#12375;&#12373;&#12434;&#24863;&#12376;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;)
   </p></li><li class="listitem"><p><span class="bold"><strong>GroupServer</strong></span> &#8212; <a class="ulink" href="http://www.groupserver.org/" target="_top">http://www.groupserver.org/</a></p><p>
     (&#12450;&#12540;&#12459;&#12452;&#12496;&#12364;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12362;&#12426;&#12289;&#12454;&#12455;&#12502;&#12505;&#12540;&#12473;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12418;&#32113;&#21512;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
      GroupServer &#12399; Mailman &#12395;&#27604;&#12409;&#12390;&#23569;&#12375;&#23566;&#20837;&#12364;&#38627;&#12375;&#12367;&#12289;
      2012 &#24180;&#12399;&#12376;&#12417;&#12398;&#26178;&#28857;&#12391;&#12399;&#21069;&#25552;&#26465;&#20214;&#12418;&#12363;&#12394;&#12426;&#21427;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
      &#12375;&#12363;&#12375;&#12289;&#12402;&#12392;&#12383;&#12403;&#21205;&#12365;&#20986;&#12379;&#12400;&#12289;&#12424;&#12426;&#20351;&#12356;&#12420;&#12377;&#12373;&#12434;&#23455;&#24863;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;)
   </p></li><li class="listitem"><p><span class="bold"><strong>Sympa</strong></span> &#8212; <a class="ulink" href="http://www.sympa.org/" target="_top">http://www.sympa.org/</a></p><p>
     (&#38283;&#30330;&#12392;&#20445;&#23432;&#12399;&#12501;&#12521;&#12531;&#12473;&#12398;&#22823;&#23398;&#12398;&#12467;&#12531;&#12477;&#12540;&#12471;&#12450;&#12512;&#12364;&#25285;&#24403;&#12375;&#12390;&#12362;&#12426;&#12289;
      700000 &#20154;&#12434;&#36229;&#12360;&#12427;&#22823;&#35215;&#27169;&#12394;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#25201;&#12360;&#12427;&#12424;&#12358;&#12395;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12414;&#12383;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#25968;&#12364;&#22810;&#12367;&#12394;&#12387;&#12390;&#12418;&#23550;&#24540;&#12391;&#12365;&#12414;&#12377;&#12290;
      &#20381;&#23384;&#12377;&#12427;&#12484;&#12540;&#12523;&#12399;&#12373;&#12414;&#12374;&#12414;&#12394;&#12418;&#12398;&#12364;&#36984;&#12409;&#12289;
      &#12383;&#12392;&#12360;&#12400; sendmail &#12420; postfix&#12289;qmail&#12289;&#12381;&#12375;&#12390; exim
      &#12394;&#12393;&#12434;&#12513;&#12483;&#12475;&#12540;&#12472;&#37197;&#36865;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12392;&#12375;&#12390;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
      &#12454;&#12455;&#12502;&#12505;&#12540;&#12473;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#27231;&#33021;&#12364;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;)
   </p></li><li class="listitem"><p><span class="bold"><strong>SmartList</strong></span> &#8212; <a class="ulink" href="http://www.procmail.org/" target="_top">http://www.procmail.org/</a></p><p>(&#12513;&#12540;&#12523;&#20966;&#29702;&#12471;&#12473;&#12486;&#12512; Procmail &#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;)</p></li><li class="listitem"><p><span class="bold"><strong>Ecartis</strong></span> &#8212; <a class="ulink" href="http://www.ecartis.org/" target="_top">http://www.ecartis.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>ListProc</strong></span> &#8212; <a class="ulink" href="http://listproc.sourceforge.net/" target="_top">http://listproc.sourceforge.net/</a></p></li><li class="listitem"><p><span class="bold"><strong>Ezmlm</strong></span> &#8212; <a class="ulink" href="http://cr.yp.to/ezmlm.html" target="_top">http://cr.yp.to/ezmlm.html</a></p><p>
     (&#12513;&#12540;&#12523;&#37197;&#36865;&#12471;&#12473;&#12486;&#12512; <a class="ulink" href="http://cr.yp.to/qmail.html" target="_top">Qmail</a>
     &#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;)
   </p></li><li class="listitem"><p><span class="bold"><strong>Dada</strong></span> &#8212; <a class="ulink" href="http://mojo.skazat.com/" target="_top">http://mojo.skazat.com/</a></p><p>
     (&#12394;&#12380;&#12363;&#12469;&#12452;&#12488;&#19978;&#12391;&#12399;&#38560;&#12381;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12364;&#12289;
     &#12371;&#12428;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12289;GNU General Public License
     &#12398;&#12418;&#12392;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12450;&#12540;&#12459;&#12452;&#12496;&#12418;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;)
   </p></li></ul></div><p>&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>MHonArc</strong></span> &#8212; <a class="ulink" href="http://www.mhonarc.org/" target="_top">http://www.mhonarc.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>Hypermail</strong></span> &#8212; <a class="ulink" href="http://www.hypermail.org/" target="_top">http://www.hypermail.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>Lurker</strong></span> &#8212; <a class="ulink" href="http://sourceforge.net/projects/lurker/" target="_top">http://sourceforge.net/projects/lurker/</a></p></li><li class="listitem"><p><span class="bold"><strong>Procmail</strong></span> &#8212; <a class="ulink" href="http://www.procmail.org/" target="_top">http://www.procmail.org/</a></p><p>
     (SmartList &#12395;&#21516;&#26801;&#12373;&#12428;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12377;&#12290;
     &#36890;&#24120;&#12398;&#12513;&#12540;&#12523;&#20966;&#29702;&#12471;&#12473;&#12486;&#12512;&#12394;&#12398;&#12391;&#12377;&#12364;&#12289;
     &#12450;&#12540;&#12459;&#12452;&#12496;&#12392;&#12375;&#12390;&#12418;&#20351;&#12360;&#12427;&#12424;&#12358;&#12391;&#12377;)
   </p></li></ul></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp946672" href="#idp946672" class="para">16</a>] </sup>
      &#26412;&#26360;&#12398;&#20986;&#29256;&#30452;&#24460;&#12395; <a class="ulink" href="http://www.michaelbernstein.com/" target="_top">Michael
      Bernstein</a> &#12364;&#25945;&#12360;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;"Mutt &#20197;&#22806;&#12395;&#12418;&#12289;
      reply-to-list &#27231;&#33021;&#12434;&#23455;&#35013;&#12375;&#12390;&#12356;&#12427;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12383;&#12392;&#12360;&#12400; Evolution &#12391;&#12399;&#12289;&#12461;&#12540;&#12508;&#12540;&#12489;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;
      (Ctrl+L) &#12391;&#12371;&#12398;&#27231;&#33021;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12391;&#12418;&#12508;&#12479;&#12531;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;"
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp932848" href="#idp932848" class="para">17</a>] </sup>
      &#12381;&#12398;&#24460;&#12289;&#12371;&#12398;&#27231;&#33021;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12477;&#12501;&#12488;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30693;&#12426;&#12414;&#12375;&#12383;&#12290;
      <a class="ulink" href="http://siesta.unixbeard.net/" target="_top">Siesta</a>
      &#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
      <a class="ulink" href="http://www.perl.com/pub/a/2004/02/05/siesta.html" target="_top">http://www.perl.com/pub/a/2004/02/05/siesta.html</a>
      &#12398;&#35352;&#20107;&#12418;&#21442;&#32771;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="technical-infrastructure.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="vc.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;</td></tr></table></div></body></html>
