<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="releases-and-daily-development.html" title="&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="next" href="share-management.html" title="&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="releases-and-daily-development.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="share-management.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><div class="titlepage"><div><div><h2 class="title"><a name="managing-volunteers"></a>&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="managing-volunteers.html#volunteers">&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12434;&#26368;&#22823;&#38480;&#12395;&#27963;&#29992;&#12377;&#12427;</a></span></dt><dd><dl><dt><span class="sect2"><a href="managing-volunteers.html#delegation">&#22996;&#20219;</a></span></dt><dd><dl><dt><span class="sect3"><a href="managing-volunteers.html#delegation-assignment">&#20316;&#26989;&#20381;&#38972;&#12392;&#25285;&#24403;&#32773;&#12398;&#27770;&#23450;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;</a></span></dt><dt><span class="sect3"><a href="managing-volunteers.html#delegation-followup">&#22996;&#20219;&#12375;&#12383;&#12354;&#12392;&#12398;&#12501;&#12457;&#12525;&#12540;</a></span></dt><dt><span class="sect3"><a href="managing-volunteers.html#delegation-interest">&#12415;&#12435;&#12394;&#12398;&#22909;&#12415;&#12434;&#30693;&#12427;</a></span></dt></dl></dd><dt><span class="sect2"><a href="managing-volunteers.html#praise-and-criticism">&#36062;&#36059;&#12392;&#25209;&#21028;</a></span></dt><dt><span class="sect2"><a href="managing-volunteers.html#territoriality">&#32260;&#24373;&#12426;&#24847;&#35672;&#12398;&#22238;&#36991;</a></span></dt><dt><span class="sect2"><a href="managing-volunteers.html#automation">&#33258;&#21205;&#21270;&#12398;&#21106;&#21512;</a></span></dt><dd><dl><dt><span class="sect3"><a href="managing-volunteers.html#automated-testing">&#33258;&#21205;&#12486;&#12473;&#12488;</a></span></dt></dl></dd><dt><span class="sect2"><a href="managing-volunteers.html#users-to-volunteers">&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;</a></span></dt><dt><span class="sect2"><a href="managing-volunteers.html#meeting-in-person">Meeting In Person (Conferences, Hackfests, Code-a-Thons, Code Sprints, Retreats)</a></span></dt></dl></dd><dt><span class="sect1"><a href="share-management.html">&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;</a></span></dt><dd><dl><dt><span class="sect2"><a href="share-management.html#patch-manager">&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</a></span></dt><dt><span class="sect2"><a href="share-management.html#translation-manager">&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</a></span></dt><dt><span class="sect2"><a href="share-management.html#documentation-manager">&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</a></span></dt><dt><span class="sect2"><a href="share-management.html#issue-manager">&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</a></span></dt><dt><span class="sect2"><a href="share-management.html#faq-manager">FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</a></span></dt></dl></dd><dt><span class="sect1"><a href="transitions.html">&#24341;&#12365;&#32153;&#12366;</a></span></dt><dt><span class="sect1"><a href="committers.html">&#12467;&#12511;&#12483;&#12479;&#12540;</a></span></dt><dd><dl><dt><span class="sect2"><a href="committers.html#choosing-committers">&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#36984;&#12403;&#12363;&#12383;</a></span></dt><dt><span class="sect2"><a href="committers.html#revoking-committers">&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#21093;&#22890;</a></span></dt><dt><span class="sect2"><a href="committers.html#partial-committers">&#37096;&#20998;&#30340;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;</a></span></dt><dt><span class="sect2"><a href="committers.html#dormant-committers">&#20241;&#30496;&#29366;&#24907;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;</a></span></dt><dt><span class="sect2"><a href="committers.html#commit-access-openness">&#31192;&#23494;&#20027;&#32681;&#12434;&#36991;&#12369;&#12427;</a></span></dt></dl></dd><dt><span class="sect1"><a href="credit.html">&#12463;&#12524;&#12472;&#12483;&#12488;</a></span></dt><dt><span class="sect1"><a href="forks.html">&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;</a></span></dt><dd><dl><dt><span class="sect2"><a href="forks.html#forks-handling">&#20998;&#35010;&#12398;&#21205;&#12365;&#12434;&#12358;&#12414;&#12367;&#20966;&#29702;&#12377;&#12427;</a></span></dt><dt><span class="sect2"><a href="forks.html#forks-initiating">&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;</a></span></dt></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#30446;&#25351;&#12377;&#12468;&#12540;&#12523;&#12395;&#21521;&#12363;&#12387;&#12390;&#12415;&#12435;&#12394;&#12391;&#21332;&#21147;&#12375;&#12390;&#12364;&#12435;&#12400;&#12387;&#12390;&#12356;&#12367;&#12395;&#12399;&#12289;
  &#12383;&#12384;&#21336;&#12395;&#12300;&#12513;&#12531;&#12496;&#12540;&#12364;&#12415;&#12435;&#12394;&#20210;&#33391;&#12367;&#12420;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#27770;&#23450;&#30340;&#12394;&#27231;&#33021;&#19981;&#20840;&#12399;&#36215;&#12371;&#12375;&#12390;&#12356;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12434;&#31649;&#29702;&#12377;&#12427;&#24441;&#21106;&#12398;&#20154;&#12364;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12434;&#31649;&#29702;&#12377;&#12427;&#12392;&#12356;&#12358;&#25216;&#34899;&#12399;&#12289;
  &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12398;&#12300;&#25216;&#34899;&#12301;&#12392;&#12399;&#23569;&#12293;&#30064;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12418;&#12289;&#23398;&#32722;&#12392;&#23455;&#36341;&#12434;&#36890;&#12375;&#12390;&#12358;&#12414;&#12367;&#34892;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#28857;&#12391;&#12399;&#12289;
  &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;&#12418;&#19968;&#31278;&#12398;&#12300;&#25216;&#34899;&#12301;&#12391;&#12354;&#12427;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#26412;&#31456;&#12391;&#12399;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#25163;&#27861;&#12434;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12398;&#31456;&#12395;&#27604;&#12409;&#12390;&#12289;&#12424;&#12426; Subversion
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12398;&#23455;&#20363;&#12434;&#24341;&#12365;&#21512;&#12356;&#12395;&#20986;&#12377;&#12371;&#12392;&#12364;&#22810;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#26412;&#26360;&#12398;&#22519;&#31558;&#26178;&#12395;&#12399;&#31169;&#12399;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20316;&#26989;&#12375;&#12390;&#12362;&#12426;&#12289;
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36942;&#21435;&#12398;&#36039;&#29987;&#12395;&#12388;&#12356;&#12390;&#12399;&#29087;&#30693;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12385;&#12423;&#12387;&#12392;&#24494;&#22937;&#12394;&#35441;&#38988;&#12394;&#12393;&#12391;&#12399;&#36523;&#20869;&#12398;&#12493;&#12479;&#12398;&#12411;&#12358;&#12364;&#25201;&#12356;&#12420;&#12377;&#12356;&#12392;&#12356;&#12358;&#38754;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12398;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12418;&#35519;&#26619;&#12434;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#26412;&#31456;&#12391;&#25201;&#12358;&#20869;&#23481;&#12395;&#24467;&#12387;&#12383; (&#12354;&#12427;&#12356;&#12399;&#24467;&#12431;&#12394;&#12363;&#12387;&#12383;) &#32080;&#26524;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12393;&#12358;&#12394;&#12387;&#12383;&#12398;&#12363;&#12290;
  &#25919;&#27835;&#30340;&#12394;&#21839;&#38988;&#12434;&#12463;&#12522;&#12450;&#12375;&#12383;&#12418;&#12398;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20363;&#12418;&#26412;&#31456;&#12391;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
</p><p>
  &#25919;&#27835;&#12392;&#12356;&#12358;&#35328;&#33865;&#12364;&#20986;&#12390;&#12365;&#12383;&#12388;&#12356;&#12391;&#12395;&#12289;
  &#12415;&#12394;&#12373;&#12435;&#12364;&#12354;&#12414;&#12426;&#12424;&#12367;&#24605;&#12387;&#12390;&#12356;&#12394;&#12356;&#12391;&#12354;&#12429;&#12358;&#12371;&#12398;&#35328;&#33865;&#12395;&#12388;&#12356;&#12390;&#12424;&#12367;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#25216;&#34899;&#32773;&#12398;&#22810;&#12367;&#12399;&#12300;&#25919;&#27835;&#30340;&#12394;&#35441;&#12394;&#12435;&#12363;&#12358;&#12435;&#12374;&#12426;&#12384;&#12290;&#12393;&#12371;&#12363;&#21029;&#12398;&#12392;&#12371;&#12429;&#12391;&#12375;&#12390;&#12367;&#12428;&#12424;&#12301;&#12392;&#32771;&#12360;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#12300;<span class="emphasis"><em>&#20693;&#12399;</em></span> &#12399;&#12383;&#12384;&#12289;
  &#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12383;&#12417;&#12395;&#19968;&#30058;&#12356;&#12356;&#12398;&#12399;&#12393;&#12398;&#26041;&#27861;&#12394;&#12398;&#12363;&#12434;&#32771;&#12360;&#12390;&#24847;&#35211;&#12434;&#35328;&#12387;&#12390;&#12356;&#12427;&#12384;&#12369;&#12394;&#12435;&#12384;&#12290;
  &#12394;&#12398;&#12395; <span class="emphasis"><em>&#24444;&#22899;</em></span> &#12399;&#12392;&#12356;&#12360;&#12400;&#12356;&#12388;&#12418;&#25919;&#27835;&#30340;&#12394;&#29702;&#30001;&#12391;&#12354;&#12428;&#12371;&#12428;&#25991;&#21477;&#12434;&#12388;&#12369;&#12390;&#12367;&#12427;&#12290;&#12301;
  &#31169;&#12364;&#24605;&#12358;&#12395;&#12289;&#25216;&#34899;&#32773;&#12392;&#12356;&#12358;&#20154;&#31278;&#12399;&#25919;&#27835; (&#12354;&#12427;&#12356;&#12399;&#24444;&#12425;&#12364;&#25919;&#27835;&#12391;&#12354;&#12427;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;)
  &#12434;&#23244;&#12358;&#20670;&#21521;&#12364;&#29305;&#12395;&#24375;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#25216;&#34899;&#32773;&#12399;&#12289;
  &#12300;&#12354;&#12427;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12364;&#20182;&#12398;&#12418;&#12398;&#12424;&#12426;&#20778;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#23458;&#35251;&#30340;&#12395;&#21028;&#26029;&#12391;&#12365;&#12427;&#12399;&#12378;&#12384;&#12301;
  &#12392;&#12356;&#12358;&#32771;&#12360;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12289;&#12354;&#12414;&#12426;&#26412;&#36074;&#30340;&#12391;&#12394;&#12356;&#21839;&#38988;&#12395;&#27671;&#12434;&#12392;&#12425;&#12428;&#12390;&#12356;&#12427;
  (&#12383;&#12392;&#12360;&#12400;&#33258;&#20998;&#12398;&#35413;&#20385;&#12384;&#12369;&#12434;&#27671;&#12395;&#12377;&#12427;&#12289;&#20182;&#20154;&#12398;&#35413;&#21028;&#12434;&#33853;&#12392;&#12381;&#12358;&#12392;&#12377;&#12427;&#12289;
  &#12354;&#12363;&#12425;&#12373;&#12414;&#12394;&#39366;&#12369;&#24341;&#12365;&#12434;&#34892;&#12358;&#12289;&#20182;&#20154;&#12395;&#23244;&#12431;&#12428;&#12394;&#12356;&#12371;&#12392;&#12400;&#12363;&#12426;&#32771;&#12360;&#12427;&#12394;&#12393;)
  &#12424;&#12358;&#12384;&#12392;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#12354;&#12414;&#12426;&#12356;&#12356;&#27671;&#12364;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;&#12289;
  &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12418;&#37325;&#22823;&#12394;&#38306;&#24515;&#20107;&#12395;&#12388;&#12356;&#12390;&#12399;&#21516;&#12376;&#12424;&#12358;&#12395;&#26412;&#36074;&#30340;&#12391;&#12394;&#12356;&#25391;&#12427;&#33310;&#12356;&#12434;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#12300;&#25919;&#27835;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#20309;&#12363;&#27738;&#12425;&#12375;&#12356;&#12418;&#12398;&#12384;&#12392;&#24863;&#12376;&#12289;
  &#33258;&#20998;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#25919;&#27835;&#30340;&#12394;&#35441;&#12434;&#36991;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12356;&#12392;&#24605;&#12387;&#12390;&#12362;&#12425;&#12428;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12381;&#12435;&#12394;&#32771;&#12360;&#12399;&#21363;&#21051;&#25448;&#12390;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#35079;&#25968;&#12398;&#20154;&#38291;&#12364;&#36039;&#28304;&#12434;&#20849;&#26377;&#12375;&#12390;&#20316;&#26989;&#12434;&#36914;&#12417;&#12390;&#12356;&#12367;&#20197;&#19978;&#12289;
  &#25919;&#27835;&#30340;&#12394;&#35441;&#12399;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#20309;&#12363;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36215;&#12371;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#21508;&#12513;&#12531;&#12496;&#12540;&#12398;&#24433;&#38911;&#21147;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#22793;&#21270;&#12377;&#12427;&#12363;&#12434;&#32771;&#24942;&#12377;&#12427;&#12290;
  &#12371;&#12428;&#12399;&#12414;&#12387;&#12383;&#12367;&#12418;&#12387;&#12390;&#21512;&#29702;&#30340;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#22810;&#12367;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#21516;&#27096;&#12395;
  &#33258;&#20998;&#12398;&#21028;&#26029;&#12392;&#12473;&#12461;&#12523;&#12395;&#33258;&#20449;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#20309;&#12425;&#12363;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#24433;&#38911;&#21147;&#12364;&#33853;&#12385;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12399;&#21336;&#12394;&#12427;&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12384;&#12392;&#32771;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21516;&#12376;&#12371;&#12392;&#12364;&#12289;&#12381;&#12398;&#20182;&#12398;&#12356;&#12363;&#12395;&#12418;&#12300;&#25919;&#27835;&#30340;&#12301;&#12394;&#25391;&#12427;&#33310;&#12356;&#12395;&#12384;&#12387;&#12390;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#32020;&#31883;&#12395;&#12300;&#25919;&#27835;&#12301;&#12392;&#12356;&#12360;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20154;&#12398;&#34892;&#21205;&#12392;&#12356;&#12358;&#12398;&#12399;&#29694;&#23455;&#31038;&#20250;&#12398;&#12373;&#12414;&#12374;&#12414;&#12394;&#22240;&#26524;&#38306;&#20418;&#12398;&#20013;&#12391;&#34892;&#12431;&#12428;&#12427;&#12398;&#12391;&#12289;
  &#20154;&#12399;&#12414;&#12378;&#26368;&#21021;&#12395;&#25919;&#27835;&#30340;&#12394;&#12371;&#12392;&#12434;&#24847;&#35672;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#25919;&#27835;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#19968;&#35328;&#12391;&#35328;&#12387;&#12390;&#12375;&#12414;&#12360;&#12400;&#12300;&#12377;&#12409;&#12390;&#12398;&#22240;&#26524;&#38306;&#20418;&#12434;&#32771;&#24942;&#12377;&#12427;&#12371;&#12392;&#12301;
  &#12392;&#12356;&#12358;&#21512;&#24847;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
  &#12392;&#12354;&#12427;&#27770;&#23450;&#12364;&#12513;&#12531;&#12496;&#12540;&#12398;&#22810;&#12367;&#12434;&#25216;&#34899;&#30340;&#12395;&#28288;&#36275;&#12373;&#12379;&#12427;&#12418;&#12398;&#12384;&#12387;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12384;&#12289;&#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#12513;&#12531;&#12496;&#12540;&#38291;&#12398;&#21147;&#38306;&#20418;&#12395;&#22793;&#21270;&#12364;&#29983;&#12376;&#12289;
  &#20027;&#35201;&#12394;&#12513;&#12531;&#12496;&#12540;&#12364;&#20210;&#38291;&#12399;&#12378;&#12428;&#12395;&#12373;&#12428;&#12383;&#12392;&#24863;&#12376;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12289;&#20027;&#35201;&#12394;&#12513;&#12531;&#12496;&#12540;&#12364;&#24863;&#12376;&#12427;&#27671;&#25345;&#12385;&#12399;&#12363;&#12394;&#12426;&#37325;&#35201;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#28961;&#35222;&#12375;&#12390;&#12375;&#12414;&#12358;&#12398;&#12399;&#12289;
  &#27671;&#39640;&#12356;&#12392;&#12356;&#12358;&#12424;&#12426;&#12399;&#12416;&#12375;&#12429;&#30446;&#20808;&#12398;&#12371;&#12392;&#12375;&#12363;&#32771;&#12360;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12373;&#12390;&#12289;&#12371;&#12428;&#20197;&#38477;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12434;&#35501;&#12416;&#38555;&#12395;&#12399;&#12289;
  &#12381;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#27963;&#21205;&#12434;&#12377;&#12427;&#38555;&#12395;&#12399;&#12289;
  &#25919;&#27835;&#12398;&#12371;&#12392;&#12384;&#12369;&#12434;&#32771;&#12360;&#12390;&#12356;&#12427;&#20154;&#12394;&#12435;&#12390; <span class="emphasis"><em>&#12393;&#12371;&#12395;&#12418;&#12356;&#12394;&#12356;</em></span>
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24515;&#12395;&#12392;&#12393;&#12417;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#25919;&#27835;&#12434;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#35211;&#12360;&#12427;&#12398;&#12399;&#21336;&#12394;&#12427;&#25126;&#30053;&#12395;&#36942;&#12366;&#12378;&#12289;
  &#26178;&#12395;&#12399;&#26377;&#21177;&#12391;&#12375;&#12423;&#12358;&#12364;&#27770;&#12375;&#12390;&#29694;&#23455;&#12398;&#25919;&#27835;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#25919;&#27835;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#21336;&#12395;&#24847;&#35211;&#12398;&#30456;&#36949;&#12364;&#29983;&#12376;&#12383;&#12392;&#12365;&#12395;&#36215;&#12371;&#12427;&#12418;&#12398;&#12391;&#12289;
  &#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12381;&#12358;&#12356;&#12358;&#29366;&#27841;&#12434;&#24314;&#35373;&#30340;&#12395;&#35299;&#27770;&#12377;&#12427;&#12424;&#12358;&#12394;
  &#25919;&#27835;&#12398;&#20181;&#32068;&#12415;&#12434;&#30906;&#31435;&#12373;&#12379;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect1" title="&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12434;&#26368;&#22823;&#38480;&#12395;&#27963;&#29992;&#12377;&#12427;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="volunteers"></a>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12434;&#26368;&#22823;&#38480;&#12395;&#27963;&#29992;&#12377;&#12427;</h2></div></div></div><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12392;&#12375;&#12390;&#20685;&#12367;&#12398;&#12399;&#12289;&#12394;&#12380;&#12391;&#12375;&#12423;&#12358;?
  <sup>[<a name="idp2631824" href="#ftn.idp2631824" class="footnote">30</a>]</sup>
</p><p>
  &#12300;&#12394;&#12380;?&#12301;&#12392;&#32862;&#12363;&#12428;&#12383;&#12425;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;
  &#12300;&#12424;&#12426;&#12424;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12426;&#12383;&#12356;&#12363;&#12425;&#12301;&#12392;&#12363;
  &#12300;&#20491;&#20154;&#30340;&#12395;&#12496;&#12464;&#12398;&#20462;&#27491;&#12395;&#12363;&#12363;&#12431;&#12426;&#12383;&#12356;&#12363;&#12425;&#12301;&#12394;&#12393;&#12392;&#31572;&#12360;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12384;&#12289;&#12371;&#12428;&#12384;&#12369;&#12364;&#12377;&#12409;&#12390;&#12384;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#24444;&#12425;&#12395;&#24863;&#35613;&#12398;&#35328;&#33865;&#12434;&#19968;&#35328;&#12418;&#12363;&#12369;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12383;&#12425;&#12289;
  &#12418;&#12375;&#24444;&#12425;&#12398;&#35328;&#12358;&#12371;&#12392;&#12395;&#19968;&#20999;&#32819;&#12434;&#20670;&#12369;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12383;&#12425;&#12289;
  &#12381;&#12428;&#12391;&#12418;&#24444;&#12425;&#12399;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12392;&#12375;&#12390;&#38306;&#12431;&#12426;&#32154;&#12369;&#12390;&#12367;&#12428;&#12427;&#12392;&#24605;&#12356;&#12414;&#12377;&#12363;?
  &#12418;&#12385;&#12429;&#12435;&#12381;&#12435;&#12394;&#12431;&#12369;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12397;&#12290;
  &#20154;&#12364;&#12431;&#12374;&#12431;&#12374;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#12431;&#12427;&#12398;&#12399;&#12289;
  &#12424;&#12426;&#12424;&#12356;&#12467;&#12540;&#12489;&#12434;&#26360;&#12365;&#12383;&#12356;&#12394;&#12435;&#12390;&#12356;&#12358;&#25277;&#35937;&#30340;&#12394;&#37325;&#12356;&#12384;&#12369;&#12363;&#12425;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12425;&#12398;&#30495;&#12398;&#21205;&#27231;&#12434;&#29702;&#35299;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#20154;&#12383;&#12385;&#12392;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12367;&#12398;&#12395;&#24441;&#31435;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#20778;&#12428;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12426;&#19978;&#12370;&#12383;&#12356;&#12301;&#12392;&#12363;
  &#12300;&#38627;&#12375;&#12356;&#21839;&#38988;&#12395;&#25361;&#25126;&#12375;&#12390;&#12415;&#12383;&#12356;&#12301;&#12394;&#12393;&#12392;&#12356;&#12358;&#24605;&#12356;&#12418;&#12381;&#12398;&#21205;&#27231;&#12398;&#12402;&#12392;&#12388;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20154;&#12395;&#12399;&#12418;&#12392;&#12418;&#12392;&#12300;&#20182;&#12398;&#20154;&#12383;&#12385;&#12392;&#20849;&#21516;&#20316;&#26989;&#12434;&#12375;&#12383;&#12356;&#12301;
  &#12300;&#20182;&#12398;&#20154;&#12395;&#23562;&#25964;&#12373;&#12428;&#12383;&#12356;&#12301;&#12392;&#12356;&#12387;&#12383;&#39000;&#26395;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#20849;&#21516;&#20316;&#26989;&#12434;&#36914;&#12417;&#12390;&#12356;&#12367;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;
  &#20309;&#12425;&#12363;&#12398;&#34892;&#21205;&#22522;&#28310;&#12434;&#23450;&#12417;&#12383;&#19978;&#12391;
  &#30446;&#27161;&#12395;&#21521;&#12363;&#12387;&#12390;&#12392;&#12418;&#12395;&#36914;&#12435;&#12391;&#12356;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12381;&#12435;&#12394;&#34892;&#21205;&#22522;&#28310;&#12399;&#12289;&#12356;&#12388;&#12418;&#33258;&#28982;&#12395;&#31435;&#12385;&#19978;&#12364;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12300;&#38971;&#32321;&#12395;&#32368;&#12426;&#36820;&#12375;&#30330;&#35328;&#12377;&#12427;&#20154;&#12364;&#12424;&#12426;&#12424;&#12356;&#31435;&#22580;&#12434;&#24471;&#12427;&#12301;
  &#12424;&#12358;&#12395;&#35211;&#12360;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377; (&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#30028;&#12391;&#38263;&#24180;&#12377;&#12372;&#12375;&#12390;&#12365;&#12383;&#20154;&#12394;&#12425;&#12289;
  &#12362;&#12381;&#12425;&#12367;&#12300;&#12354;&#12354;&#12289;&#12354;&#12428;&#12398;&#12371;&#12392;&#12397;&#12301;&#12392;&#38957;&#12395;&#24605;&#12356;&#28014;&#12363;&#12406;&#12418;&#12398;&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#27770;&#12375;&#12390;&#20598;&#28982;&#12381;&#12358;&#12394;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#35079;&#38609;&#12394;&#35696;&#35542;&#12434;&#38263;&#12293;&#12392;&#32154;&#12369;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#23550;&#12377;&#12427;&#25964;&#24847;&#12398;&#12354;&#12425;&#12431;&#12428;&#12392;&#12375;&#12390;&#12289;
  &#31435;&#22580;&#12364;&#19978;&#12364;&#12387;&#12390;&#12365;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;
  (&#23455;&#38555;&#12395;&#12381;&#12398;&#35696;&#35542;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#26377;&#29992;&#12363;&#12393;&#12358;&#12363;&#12399;&#38306;&#20418;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12290;
  &#21517;&#22768;&#12434;&#24471;&#12427;&#12383;&#12417;&#12398;&#34892;&#21205;&#12364;&#12289;&#21516;&#26178;&#12395;&#24314;&#35373;&#30340;&#12394;&#34892;&#28858;&#12392;&#12394;&#12427;&#12424;&#12358;&#12394;&#31354;&#27671;&#12434;&#20316;&#12426;&#20986;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12398;&#26041;&#27861;&#12434;&#20197;&#19979;&#12391;&#35500;&#26126;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#22996;&#20219;"><div class="titlepage"><div><div><h3 class="title"><a name="delegation"></a>&#22996;&#20219;</h3></div></div></div><p>
  &#12300;&#22996;&#20219;&#12301;&#12399;&#12289;&#21336;&#12395;&#36000;&#33655;&#12434;&#20998;&#25955;&#12373;&#12379;&#12427;&#26041;&#27861;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12394;&#12367;
  &#25919;&#27835;&#30340;&#12539;&#31038;&#20250;&#30340;&#12394;&#36947;&#20855;&#12395;&#12418;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20154;&#12395;&#20309;&#12363;&#20316;&#26989;&#12434;&#12383;&#12398;&#12416;&#12371;&#12392;&#12395;&#12399;&#12393;&#12435;&#12394;&#21177;&#26524;&#12364;&#12354;&#12427;&#12363;&#12289;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12356;&#12385;&#12400;&#12435;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#12398;&#12399;&#12289;
  &#12300;&#12362;&#39000;&#12356;&#12434;&#32862;&#12365;&#20837;&#12428;&#12390;&#12418;&#12425;&#12360;&#12383;&#12425;&#12289;&#23455;&#38555;&#12398;&#20316;&#26989;&#12399;&#24444;&#12364;&#34892;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12354;&#12394;&#12383;&#12399;&#34892;&#12431;&#12394;&#12356;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#21177;&#26524;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12362;&#39000;&#12356;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;
  &#12300;&#31169;&#12399;&#12354;&#12398;&#20154;&#12395;&#38972;&#12425;&#12428;&#12390;&#12356;&#12427;&#12435;&#12384;&#12301;&#12392;&#24444;&#12395;&#27671;&#12389;&#12363;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#12418;&#12375;&#12381;&#12398;&#12362;&#39000;&#12356;&#12434;&#20844;&#38283;&#12398;&#22580;&#12391;&#12375;&#12383;&#12398;&#12394;&#12425;&#12289;
  &#12300;&#12302;&#31169;&#12399;&#12354;&#12398;&#20154;&#12395;&#38972;&#12425;&#12428;&#12390;&#12356;&#12427;&#12303;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12289;&#12415;&#12435;&#12394;&#12418;&#30693;&#12387;&#12390;&#12356;&#12427;&#12435;&#12384;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12418;&#24444;&#12399;&#27671;&#12389;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12399;&#12300;&#12354;&#12398;&#20154;&#12398;&#35328;&#12358;&#12371;&#12392;&#12384;&#12363;&#12425;&#12289;&#32862;&#12363;&#12394;&#12365;&#12419;&#12301;&#12392;&#12356;&#12358;&#12503;&#12524;&#12483;&#12471;&#12515;&#12540;&#12434;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#20154;&#12395;&#20309;&#12363;&#38972;&#12415;&#12372;&#12392;&#12434;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;
  &#12418;&#12375;&#23244;&#12394;&#12425;&#27671;&#20860;&#12397;&#12394;&#12367;&#26029;&#12428;&#12427;&#12424;&#12358;&#12395;&#27671;&#37197;&#12426;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12395;&#20381;&#38972;&#12377;&#12427;&#20316;&#26989;&#12364;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#21029;&#12398;&#20154;&#12392;&#12398;&#35519;&#25972;&#12434;&#35201;&#12377;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#12289;
  &#12381;&#12428;&#12399;&#24444;&#12395;&#12300;&#12354;&#12394;&#12383;&#12399;&#20182;&#12398;&#20154;&#12392;&#12399;&#36949;&#12358;&#12290;&#12418;&#12358;&#19968;&#27573;&#38542;&#12377;&#12377;&#12435;&#12384;&#21332;&#21147;&#12434;&#38972;&#12415;&#12383;&#12356;&#12301;
  &#12392;&#35328;&#12358;&#12398;&#12395;&#31561;&#12375;&#12356;&#12392;&#12356;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12402;&#12392;&#12388;&#12398;&#12469;&#12502;&#12489;&#12513;&#12452;&#12531;&#12434;&#31649;&#29702;&#12373;&#12379;&#12427;&#12367;&#12425;&#12356;&#12398;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12414;&#12426;&#12420;&#12426;&#12377;&#12366;&#12427;&#12392;&#23041;&#22311;&#30340;&#12395;&#21463;&#12369;&#21462;&#12425;&#12428;&#12363;&#12397;&#12378;&#12289;
  &#24444;&#12399;&#12381;&#12398;&#36012;&#20219;&#12398;&#37325;&#22823;&#12373;&#12363;&#12425;&#36867;&#12370;&#20986;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12398;&#21177;&#26524;&#12434;&#32771;&#24942;&#12377;&#12427;&#12392;&#12289;
  &#20154;&#12395;&#20309;&#12363;&#20316;&#26989;&#12434;&#12362;&#39000;&#12356;&#12377;&#12427;&#12398;&#12399;&#29702;&#12395;&#12363;&#12394;&#12387;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12381;&#12428;&#12434;&#33258;&#20998;&#12391;&#12420;&#12387;&#12383;&#12411;&#12358;&#12364;&#25163;&#38555;&#12424;&#12367;&#12391;&#12365;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12365;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#20309;&#12425;&#12363;&#12398;&#20107;&#24773;&#12391;&#20154;&#12395;&#12362;&#39000;&#12356;&#12434;&#12379;&#12374;&#12427;&#12434;&#12360;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#33258;&#20998;&#12391;&#12381;&#12428;&#12434;&#34892;&#12358;&#12398;&#12364;&#12467;&#12473;&#12488;&#12395;&#35211;&#21512;&#12431;&#12394;&#12356;
  (&#20182;&#12395;&#12418;&#12387;&#12392;&#37325;&#35201;&#12394;&#20316;&#26989;&#12364;&#12354;&#12427;) &#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12435;&#12394;&#24046;&#12375;&#36843;&#12387;&#12383;&#20107;&#24773;&#12364;&#12394;&#12356;&#22580;&#21512;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#20154;&#12395;&#20316;&#26989;&#12434;&#12362;&#39000;&#12356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#23558;&#26469;&#30340;&#12395;&#12381;&#12398;&#20154;&#12395;&#12418;&#12387;&#12392;&#28145;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12431;&#12387;&#12390;&#12411;&#12375;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;
  &#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#23569;&#12293;&#20313;&#20998;&#12394;&#26178;&#38291;&#12434;&#20351;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12418;&#12363;&#12414;&#12431;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#36870;&#12418;&#25104;&#12426;&#31435;&#12385;&#12414;&#12377;&#12290;&#35504;&#12363;&#20182;&#12398;&#20154;&#12398;&#20316;&#26989;&#12434;&#25163;&#20253;&#12387;&#12390;&#12354;&#12370;&#12428;&#12400;&#12289;
  &#12354;&#12394;&#12383;&#12395;&#23550;&#12377;&#12427;&#30456;&#25163;&#12398;&#21360;&#35937;&#12399;&#12424;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#30456;&#25163;&#12363;&#12425;&#23562;&#25964;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#22996;&#20219;&#12375;&#12383;&#12426;&#20195;&#29702;&#12434;&#12362;&#39000;&#12356;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;&#20309;&#12418;&#20491;&#12293;&#12398;&#20316;&#26989;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12424;&#12426;&#28145;&#12356;&#38306;&#12431;&#12426;&#12434;&#25345;&#12383;&#12379;&#12427;&#12371;&#12392;&#12395;&#12418;&#38306;&#20418;&#12375;&#12414;&#12377;&#12290;
</p><div class="sect3" title="&#20316;&#26989;&#20381;&#38972;&#12392;&#25285;&#24403;&#32773;&#12398;&#27770;&#23450;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="delegation-assignment"></a>&#20316;&#26989;&#20381;&#38972;&#12392;&#25285;&#24403;&#32773;&#12398;&#27770;&#23450;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;</h4></div></div></div><p>
  &#35504;&#12363;&#12364;&#12381;&#12398;&#20316;&#26989;&#12434;&#24341;&#12365;&#21463;&#12369;&#12390;&#12367;&#12428;&#12427;&#12391;&#12354;&#12429;&#12358;&#12371;&#12392;&#12364;&#12289;&#12411;&#12412;&#35211;&#24403;&#12364;&#12388;&#12367;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#35504;&#12363;&#12364;&#12467;&#12540;&#12489;&#12395;&#12496;&#12464;&#12434;&#20181;&#36796;&#12435;&#12391;&#12375;&#12414;&#12387;&#12383;&#12392;&#12363;&#12289;
  &#35504;&#12363;&#12364;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#20869;&#23481;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#26126;&#12425;&#12363;&#12395;&#21453;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12387;&#12383;&#22580;&#21512;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#21839;&#38988;&#28857;&#12434;&#25351;&#25688;&#12375;&#12383;&#19978;&#12391;&#12381;&#12398;&#24403;&#20154;&#12395;&#23550;&#24540;&#12434;&#12362;&#39000;&#12356;&#12377;&#12427;&#12384;&#12369;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#24444;&#12399;&#12365;&#12387;&#12392;&#12381;&#12398;&#20316;&#26989;&#12434;&#24341;&#12365;&#21463;&#12369;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#26178;&#12395;&#12399;&#30456;&#25163;&#12364;&#12381;&#12398;&#12362;&#39000;&#12356;&#12434;&#32862;&#12365;&#20837;&#12428;&#12390;&#12367;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12364;&#21028;&#26029;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12362;&#39000;&#12356;&#12434;&#32862;&#12356;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12375;&#12289;&#25298;&#21542;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12290;
  &#12300;&#9675;&#9675;&#12434;&#12420;&#12387;&#12390;&#12367;&#12428;&#12390;&#24403;&#28982;&#12391;&#12375;&#12423;&#12301;&#12392;&#12356;&#12387;&#12383;&#24907;&#24230;&#12391;&#38972;&#12414;&#12428;&#12427;&#12392;&#12289;
  &#35504;&#12418;&#12354;&#12414;&#12426;&#12356;&#12356;&#27671;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#20154;&#12395;&#20316;&#26989;&#12434;&#12362;&#39000;&#12356;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;&#29366;&#27841;&#12395;&#24540;&#12376;&#12383;&#36969;&#20999;&#12394;&#26041;&#27861;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#30456;&#25163;&#12364;&#12418;&#12387;&#12392;&#12418;&#12356;&#12425;&#12388;&#12367;&#12391;&#12354;&#12429;&#12358;&#12497;&#12479;&#12540;&#12531;&#12399;&#12289;
  &#26412;&#20154;&#12395;&#12399;&#12381;&#12398;&#27671;&#12364;&#12394;&#12356;&#12398;&#12395;&#12300;&#12371;&#12428;&#12399;&#12354;&#12394;&#12383;&#12364;&#12420;&#12427;&#12398;&#12364;&#24403;&#28982;&#12391;&#12375;&#12423;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#21250;&#12431;&#12379;&#12390;&#12362;&#39000;&#12356;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12496;&#12464;&#23550;&#24540;&#12398;&#25285;&#24403;&#32773;&#12434;&#27770;&#12417;&#12427;&#12392;&#12365;&#12395;
  &#12371;&#12398;&#12497;&#12479;&#12540;&#12531;&#12364;&#12375;&#12400;&#12375;&#12400;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#38291;&#12391;&#12399;&#12289;&#35504;&#12364;&#12393;&#12398;&#20998;&#37326;&#12395;&#35443;&#12375;&#12356;&#12363;&#12399;
  &#12384;&#12356;&#12383;&#12356;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#20309;&#12363;&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#12300;&#12371;&#12428;&#12399;&#24444;&#12395;&#12420;&#12387;&#12390;&#12418;&#12425;&#12360;&#12400;&#12377;&#12368;&#12395;&#20462;&#27491;&#12391;&#12365;&#12427;&#12384;&#12429;&#12358;&#12301;
  &#12392;&#35211;&#24403;&#12364;&#12388;&#12367;&#12371;&#12392;&#12418;&#12424;&#12367;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12384;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
  &#20309;&#12398;&#21069;&#32622;&#12365;&#12418;&#12394;&#12375;&#12395;&#12356;&#12365;&#12394;&#12426;&#12381;&#12398;&#20154;&#12395;&#23550;&#24540;&#12434;&#12362;&#39000;&#12356;&#12375;&#12383;&#12426;&#12377;&#12427;&#12392;&#12289;
  &#30456;&#25163;&#12399;&#27671;&#12434;&#24746;&#12367;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12300;&#31169;&#12399;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12427;&#12435;&#12384;&#12301;&#12392;&#21916;&#12435;&#12391;&#12418;&#12425;&#12360;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12381;&#12428;&#12392;&#21516;&#26178;&#12395;&#12300;&#31169;&#12395;&#12371;&#12398;&#25216;&#34899;&#12364;&#12354;&#12427;&#12400;&#12387;&#12363;&#12426;&#12395;&#12289;
  &#12371;&#12435;&#12394;&#20316;&#26989;&#12434;&#25276;&#12375;&#20184;&#12369;&#12425;&#12428;&#12427;&#12435;&#12384;&#12301;&#12392;&#24863;&#12376;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12496;&#12464;&#23550;&#24540;&#12392;&#12356;&#12358;&#12398;&#12399;&#25216;&#34899;&#12434;&#36523;&#12395;&#12388;&#12369;&#12427;&#12383;&#12417;&#12398;&#12424;&#12356;&#20316;&#26989;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;&#12354;&#12360;&#12390;&#35504;&#12363;&#20182;&#12398;&#20154;&#12395;&#23550;&#24540;&#12434;&#20219;&#12379;&#12427;&#12398;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;!
  (&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#12395;&#12399;&#12289;&#12496;&#12464;&#22577;&#21578;&#12398;&#20869;&#23481;&#12395;&#24540;&#12376;&#12390;
  &#33258;&#21205;&#30340;&#12395;&#25285;&#24403;&#32773;&#12434;&#27770;&#12417;&#12427;&#27231;&#33021;&#12434;&#25345;&#12388;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#29992;&#12377;&#12428;&#12400;&#12289;&#12300;&#25276;&#12375;&#20184;&#12369;&#12425;&#12428;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#24863;&#35226;&#12399;&#12354;&#12414;&#12426;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12289;
  &#12371;&#12428;&#12399;&#12354;&#12367;&#12414;&#12391;&#27231;&#26800;&#30340;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12427;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#31169;&#24773;&#12364;&#25375;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12364;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;)&#12290;
</p><p>
  &#29305;&#23450;&#12398;&#20154;&#12395;&#36000;&#33655;&#12364;&#12363;&#12363;&#12425;&#12394;&#12356;&#12424;&#12358;&#12289;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#12415;&#12435;&#12394;&#12395;&#22343;&#31561;&#12395;&#20316;&#26989;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12399;&#22823;&#20999;&#12391;&#12377;&#12290;&#12383;&#12384;&#12289;&#26178;&#12395;&#12399;&#12289;
  &#12356;&#12385;&#12400;&#12435;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#20154;&#12395;&#19968;&#21051;&#12418;&#26089;&#12367;&#23550;&#24540;&#12375;&#12390;&#12418;&#12425;&#12356;&#12383;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#12392;&#12365;&#12395;&#27598;&#22238;&#26681;&#22238;&#12375;&#12434;&#12377;&#12427; (&#12300;&#12371;&#12398;&#12496;&#12464;&#12289;&#12385;&#12423;&#12387;&#12392;&#35211;&#12390;&#12367;&#12428;&#12394;&#12356;&#12363;&#12394;?&#12301;
  &#12300;&#12356;&#12356;&#12424;&#12301;&#12300;&#12431;&#12363;&#12387;&#12383;&#12290;&#12376;&#12419;&#12354;&#25285;&#24403;&#32773;&#12434;&#21531;&#12395;&#35373;&#23450;&#12377;&#12427;&#12424;&#12301;&#12300;&#12458;&#12540;&#12465;&#12540;&#12301;)
  &#26178;&#38291;&#12364;&#21106;&#12369;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#22311;&#21147;&#12434;&#24863;&#12376;&#12373;&#12379;&#12394;&#12356;&#12424;&#12358;&#12395;
  &#28129;&#12293;&#12392;&#12362;&#39000;&#12356;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12411;&#12412;&#12377;&#12409;&#12390;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12399;&#12289;
  &#25285;&#24403;&#32773;&#12434;&#27770;&#12417;&#12427;&#12392;&#12365;&#12395;&#12467;&#12513;&#12531;&#12488;&#12434;&#12388;&#12369;&#12427;&#27231;&#33021;&#12364;&#20633;&#12431;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12467;&#12513;&#12531;&#12488;&#12391;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#35328;&#12358;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
    &#21531;&#12395;&#12362;&#39000;&#12356;&#12377;&#12427;&#12424;&#12289;jrandom&#12290;&#12383;&#12406;&#12435;&#21531;&#12364;&#12356;&#12385;&#12400;&#12435;&#12371;&#12398;&#12467;&#12540;&#12489;&#12395;&#35443;&#12375;&#12356;&#12384;&#12429;&#12358;&#12363;&#12425;&#12290;
    &#12418;&#12375;&#12381;&#12398;&#26178;&#38291;&#12364;&#12394;&#12363;&#12387;&#12383;&#12425;&#12289;&#27671;&#20860;&#12397;&#12379;&#12378;&#12395;&#12388;&#12365;&#36820;&#12375;&#12390;&#12367;&#12428;&#12390;&#12418;&#12356;&#12356;&#12424;&#12290;
    (&#12391;&#12289;&#12418;&#12375;&#20170;&#24460;&#12371;&#12435;&#12394;&#20381;&#38972;&#12434;&#21463;&#12369;&#12427;&#12398;&#12364;&#12356;&#12420;&#12384;&#12387;&#12390;&#12356;&#12358;&#12398;&#12394;&#12425;&#12289;
    &#12381;&#12358;&#35328;&#12387;&#12390;&#12411;&#12375;&#12356;&#12435;&#12384;)&#12290;
   </p></blockquote></div><p>
  &#12371;&#12358;&#12377;&#12428;&#12400;&#12289;&#35504;&#12363;&#12395;&#20316;&#26989;&#12434; <span class="emphasis"><em>&#20381;&#38972;</em></span>
  &#12377;&#12427;&#12371;&#12392;&#12392;&#30456;&#25163;&#12364;&#12381;&#12428;&#12434; <span class="emphasis"><em>&#21463;&#35582;</em></span>
  &#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12289;&#12371;&#12398;&#12420;&#12426;&#21462;&#12426;&#12399;&#24403;&#20107;&#32773;&#38291;&#12384;&#12369;&#12391;&#12394;&#12367;&#20840;&#21729;&#12364;&#35211;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#20154;&#12395;&#25216;&#34899;&#12364;&#12354;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12381;&#12398;&#20154;&#12395;&#20381;&#38972;&#12434;&#21463;&#35582;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#27770;&#23450;&#27177;&#12364;&#12354;&#12427;&#12371;&#12392;&#12364;&#20840;&#21729;&#12395;&#20253;&#12431;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="sect3" title="&#22996;&#20219;&#12375;&#12383;&#12354;&#12392;&#12398;&#12501;&#12457;&#12525;&#12540;"><div class="titlepage"><div><div><h4 class="title"><a name="delegation-followup"></a>&#22996;&#20219;&#12375;&#12383;&#12354;&#12392;&#12398;&#12501;&#12457;&#12525;&#12540;</h4></div></div></div><p>
  &#35504;&#12363;&#12395;&#20309;&#12363;&#12398;&#20316;&#26989;&#12434;&#20381;&#38972;&#12375;&#12383;&#12425;&#12289;
  &#12381;&#12398;&#24460;&#12398;&#12501;&#12457;&#12525;&#12540;&#12418;&#24536;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#36890;&#24120;&#12289;&#20844;&#38283;&#12398;&#12501;&#12457;&#12540;&#12521;&#12512;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;&#27425;&#12398;&#12424;&#12358;&#12394;&#24418;&#24335;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  "&#12392;&#12371;&#12429;&#12391;&#12289;X &#12395;&#12388;&#12356;&#12390;&#12399;&#12393;&#12358;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12363;? &#25945;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#21029;&#12395;&#28961;&#29702;&#12394;&#12425;&#12381;&#12428;&#12391;&#12418;&#27671;&#12395;&#12375;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#21336;&#12395;&#27671;&#12395;&#12394;&#12387;&#12383;&#12384;&#12369;&#12394;&#12398;&#12391;&#12290;"
  &#36820;&#20107;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12375;&#12289;&#12354;&#12427;&#12356;&#12399;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12414;&#12426;&#29366;&#27841;&#12364;&#33459;&#12375;&#12367;&#12394;&#12356;&#12392;&#12356;&#12358;&#36820;&#20107;&#12364;&#12354;&#12387;&#12383;&#12425;&#12289;
  X &#12395;&#12388;&#12356;&#12390;&#20309;&#12363;&#21029;&#12398;&#23550;&#24540;&#31574;&#12434;&#32771;&#12360;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#38918;&#35519;&#12384;&#12424;&#12392;&#12356;&#12358;&#36820;&#20107;&#12364;&#12354;&#12387;&#12383;&#12425;&#12289;&#12375;&#12400;&#12425;&#12367;&#12399;&#12381;&#12398;&#20316;&#26989;&#12398;&#36914;&#25431;&#12434;&#27671;&#12395;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#36914;&#25431;&#29366;&#27841;&#12395;&#12388;&#12356;&#12390;&#12289;&#31777;&#21336;&#12395;&#12467;&#12513;&#12531;&#12488;&#12384;&#12369;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;
  (&#20154;&#12399;&#12415;&#12394;&#12289;&#33258;&#20998;&#12398;&#20316;&#26989;&#12364;&#20182;&#20154;&#12395;&#35469;&#12417;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30693;&#12427;&#12392;&#12358;&#12428;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;)&#12290;
  &#25968;&#26085;&#24453;&#12387;&#12390;&#12418;&#36820;&#20107;&#12364;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;
  &#12418;&#12358;&#19968;&#24230;&#32862;&#12356;&#12390;&#12415;&#12427;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;
  &#12300;&#36820;&#20107;&#12364;&#12394;&#12363;&#12387;&#12383;&#12435;&#12384;&#12369;&#12393;&#12289;&#35504;&#12363;&#20182;&#12395; X &#12395;&#12388;&#12356;&#12390;&#12398;&#29366;&#27841;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#20154;&#12399;&#12356;&#12414;&#12377;&#12363;?&#12301;
  &#12392;&#12356;&#12358;&#25237;&#31295;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12354;&#12427;&#12356;&#12399;&#33258;&#20998;&#12391;&#35519;&#12409;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12381;&#12398;&#22580;&#21512;&#12391;&#12418;&#12300;&#26368;&#21021;&#12398;&#21839;&#12356;&#12363;&#12369;&#12395;&#23550;&#12375;&#12390;&#36820;&#31572;&#12364;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12301;
  &#12392;&#12356;&#12358;&#25237;&#31295;&#12434;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#36820;&#20107;&#12364;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12434;&#12431;&#12374;&#12431;&#12374;&#25237;&#31295;&#12377;&#12427;&#12398;&#12399;&#12289;
  <span class="emphasis"><em>&#27770;&#12375;&#12390;</em></span> &#12381;&#12398;&#30456;&#25163;&#12434;&#38750;&#38627;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#21608;&#12426;&#12395;&#12381;&#12398;&#12424;&#12358;&#12395;&#21463;&#12369;&#21462;&#12425;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#35328;&#12356;&#22238;&#12375;&#12395;&#12399;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#30446;&#30340;&#12399;&#12289;&#21336;&#12395;&#12300;&#12371;&#12398;&#21069;&#12383;&#12378;&#12397;&#12383;&#12371;&#12392;&#12434;&#12414;&#12384;&#27671;&#12395;&#12363;&#12369;&#12390;&#12356;&#12414;&#12377;&#12424;&#12290;
  &#20309;&#12363;&#21453;&#24540;&#12364;&#12354;&#12387;&#12383;&#12425;&#12377;&#12368;&#27671;&#12389;&#12365;&#12414;&#12377;&#12424;&#12301;&#12392;&#12356;&#12358;&#23039;&#21218;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;&#27425;&#12395;&#21516;&#12376;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#12354;&#12387;&#12383;&#12392;&#12365;&#12395;&#21453;&#24540;&#12434;&#24471;&#12425;&#12428;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#21608;&#12426;&#12398;&#20154;&#12383;&#12385;&#12363;&#12425;&#12289;&#12354;&#12394;&#12383;&#12399;&#12393;&#12435;&#12394;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12371;&#12392;&#12391;&#12418;&#35211;&#36867;&#12373;&#12394;&#12356;&#20154;&#12384;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35469;&#35672;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p></div><div class="sect3" title="&#12415;&#12435;&#12394;&#12398;&#22909;&#12415;&#12434;&#30693;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="delegation-interest"></a>&#12415;&#12435;&#12394;&#12398;&#22909;&#12415;&#12434;&#30693;&#12427;</h4></div></div></div><p>
  &#33258;&#20998;&#12364;&#20309;&#12395;&#33288;&#21619;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#12431;&#12363;&#12387;&#12390;&#12418;&#12425;&#12360;&#12390;&#12356;&#12427;&#12392;&#12289;
  &#20154;&#12399;&#12358;&#12428;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;&#19968;&#33324;&#35542;&#12392;&#12375;&#12390;&#12289;
  &#21608;&#12426;&#12398;&#20154;&#12383;&#12385;&#12398;&#24615;&#26684;&#12434;&#12375;&#12387;&#12363;&#12426;&#25226;&#25569;&#12375;&#12390;&#12362;&#12369;&#12400;&#24444;&#12425;&#12399;&#12356;&#12356;&#27671;&#20998;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12354;&#12394;&#12383;&#12392;&#19968;&#32210;&#12395;&#12424;&#12426;&#22810;&#12367;&#12398;&#20316;&#26989;&#12434;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#12424;&#12358;&#12395;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12383;&#12392;&#12360;&#12400; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;
  &#12300;&#12414;&#12378;&#12399;&#20309;&#12392;&#12363;&#12375;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#12371;&#12366;&#12388;&#12369;&#12383;&#12356; (&#29694;&#22312;&#12399;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;)&#12301;
  &#12392;&#12356;&#12358;&#20154;&#12383;&#12385;&#12392;
  &#12300;&#26032;&#27231;&#33021;&#12434;&#36861;&#21152;&#12375;&#12383;&#12426;&#33288;&#21619;&#28145;&#12356;&#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12411;&#12358;&#12364;&#20808;&#27770;&#12384;&#12290;
   &#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#12364;&#12356;&#12388;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#12363;&#12394;&#12435;&#12390;&#12289;&#12381;&#12435;&#12394;&#12398;&#38306;&#20418;&#12394;&#12356;&#12424;&#12301;
  &#12392;&#12356;&#12358;&#20154;&#12383;&#12385;&#12392;&#12395;&#26126;&#30906;&#12395;&#21306;&#21029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12393;&#12385;&#12425;&#12364;&#12356;&#12356;&#12392;&#12363;&#24746;&#12356;&#12392;&#12363;&#12356;&#12358;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#19990;&#12398;&#20013;&#12395;&#12399;&#20108;&#31278;&#39006;&#12398;&#38283;&#30330;&#32773;&#12364;&#12356;&#12427;&#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12393;&#12385;&#12425;&#12398;&#12479;&#12452;&#12503;&#12398;&#38283;&#30330;&#32773;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#22810;&#22823;&#12394;&#36002;&#29486;&#12434;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#31169;&#12383;&#12385;&#12395;&#12399;&#12377;&#12368;&#12395;&#12431;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12300;1.0 &#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21521;&#12369;&#12390;&#12364;&#12435;&#12400;&#12429;&#12358;!&#12301;
  &#12392;&#12356;&#12387;&#12383;&#21205;&#27231;&#20184;&#12369;&#12391;&#12415;&#12435;&#12394;&#12434;&#19968;&#20024;&#12395;&#12391;&#12365;&#12427;&#12394;&#12435;&#12390;&#24605;&#12431;&#12394;&#12356;&#12411;&#12358;&#12364;&#12356;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12290;
  &#38651;&#23376;&#12513;&#12487;&#12451;&#12450;&#12399;&#38750;&#24120;&#12395;&#12354;&#12390;&#12395;&#12394;&#12425;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#27671;&#25345;&#12385;&#12399;&#12415;&#12435;&#12394;&#12391;&#20849;&#26377;&#12391;&#12365;&#12390;&#12356;&#12427;&#12392;&#24863;&#12376;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#23455;&#38555;&#12395;&#12381;&#12358;&#24605;&#12387;&#12390;&#12356;&#12427;&#12398;&#12399;&#24403;&#20107;&#32773;&#12384;&#12369;&#12391;&#12289;
  &#21608;&#12426;&#12398;&#20154;&#12383;&#12385;&#12399;&#12414;&#12387;&#12383;&#12367;&#21029;&#12398;&#26041;&#21521;&#12434;&#35211;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12415;&#12435;&#12394;&#12364;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20309;&#12434;&#27714;&#12417;&#12390;&#12356;&#12427;&#12398;&#12363;&#12395;&#27880;&#24847;&#12377;&#12428;&#12400;&#12377;&#12427;&#12411;&#12393;&#12289;
  &#21608;&#12426;&#12395;&#21177;&#29575;&#12424;&#12367;&#20316;&#26989;&#12434;&#20381;&#38972;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12395;&#20316;&#26989;&#12434;&#20381;&#38972;&#12375;&#12394;&#12367;&#12390;&#12418;&#12289;
  &#12300;&#12354;&#12394;&#12383;&#12364;&#20309;&#12434;&#27714;&#12417;&#12390;&#12356;&#12427;&#12398;&#12363;&#12399;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12424;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12377;&#12384;&#12369;&#12391;&#12418;&#22823;&#20107;&#12391;&#12377;&#12290;&#12381;&#12358;&#12377;&#12428;&#12400;&#12289;
  &#33258;&#20998;&#12364;&#12381;&#12398;&#20182;&#22823;&#21218;&#12398;&#12402;&#12392;&#12426;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12415;&#12435;&#12394;&#12395;&#27671;&#12389;&#12363;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div></div><div class="sect2" title="&#36062;&#36059;&#12392;&#25209;&#21028;"><div class="titlepage"><div><div><h3 class="title"><a name="praise-and-criticism"></a>&#36062;&#36059;&#12392;&#25209;&#21028;</h3></div></div></div><p>
  &#36062;&#36059;&#12392;&#25209;&#21028;&#12399;&#27770;&#12375;&#12390;&#30456;&#21453;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#22810;&#12367;&#12398;&#22580;&#21512;&#12395;&#12362;&#12356;&#12390;&#12289;&#20001;&#32773;&#12399;&#38750;&#24120;&#12395;&#20284;&#36890;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#20001;&#32773;&#12399;&#12392;&#12418;&#12395;&#12289;&#30456;&#25163;&#12398;&#27671;&#12434;&#24341;&#12367;&#12371;&#12392;&#12364;&#20027;&#30446;&#30340;&#12391;&#12354;&#12426;&#12289;
  &#20840;&#20307;&#30340;&#12394;&#12371;&#12392;&#12434;&#35328;&#12358;&#12424;&#12426;&#12418;&#29305;&#23450;&#12398;&#12371;&#12392;&#12395;&#32094;&#12387;&#12383;&#26041;&#12364;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12393;&#12385;&#12425;&#12418;&#20855;&#20307;&#30340;&#12394;&#30446;&#27161;&#12434;&#23450;&#12417;&#12383;&#19978;&#12391;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12420;&#12426;&#36942;&#12366;&#12427;&#12392;&#12289;&#12393;&#12385;&#12425;&#12398;&#21177;&#26524;&#12418;&#34180;&#12428;&#12414;&#12377;&#12290;
  &#24517;&#35201;&#20197;&#19978;&#12395;&#12411;&#12417;&#12377;&#12366;&#12383;&#12426;&#12289;&#12354;&#12414;&#12426;&#12395;&#12418;&#38971;&#32321;&#12395;&#12411;&#12417;&#12414;&#12367;&#12387;&#12390;&#12356;&#12383;&#12426;&#12377;&#12427;&#12392;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#12411;&#12417;&#35328;&#33865;&#12398;&#20385;&#20516;&#12364;&#19979;&#12364;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#25209;&#21028;&#12384;&#12387;&#12390;&#21516;&#12376;&#12391;&#12377;&#12290;&#12383;&#12384;&#23455;&#38555;&#12399;&#12289;
  &#25209;&#21028;&#12398;&#12411;&#12358;&#12395;&#12388;&#12356;&#12390;&#12399;&#20385;&#20516;&#12364;&#19979;&#12364;&#12427;&#36895;&#24230;&#12399;&#22810;&#23569;&#36933;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#25216;&#34899;&#32773;&#12398;&#25991;&#21270;&#12398;&#20013;&#12391;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#35443;&#32048;&#12363;&#12388;&#20919;&#38745;
  (&#20491;&#20154;&#30340;&#12394;&#24863;&#24773;&#12395;&#24038;&#21491;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;) &#25209;&#21028;&#12399;&#12289;&#19968;&#31278;&#12398;&#36062;&#36059;&#12392;&#12418;&#21463;&#12369;&#21462;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;
  (<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span>
  &#12398; <a class="xref" href="communications.html#rudeness" title="&#20309;&#12364;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12398;&#12363;">&#12300;&#20309;&#12364;&#22833;&#31036;&#12395;&#12354;&#12383;&#12427;&#12398;&#12363;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12414;&#12375;&#12383;)&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
  &#12381;&#12398;&#20316;&#26989;&#12399;&#12365;&#12385;&#12435;&#12392;&#31934;&#26619;&#12377;&#12427;&#12384;&#12369;&#12398;&#20385;&#20516;&#12364;&#12354;&#12427;&#12418;&#12398;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#26263;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12354;&#12367;&#12414;&#12391;&#12418; <span class="emphasis"><em>&#35443;&#32048;</em></span> &#12363;&#12388; <span class="emphasis"><em>&#20919;&#38745;</em></span>
  &#12392;&#12356;&#12358;&#12405;&#12383;&#12388;&#12398;&#26465;&#20214;&#12434;&#28288;&#12383;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#35504;&#12363;&#12364;&#12467;&#12540;&#12489;&#12395;&#12356;&#12356;&#21152;&#28187;&#12394;&#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#12392;&#12365;&#12395;&#21336;&#12395;&#12300;&#12381;&#12435;&#12394;&#12356;&#12356;&#21152;&#28187;&#12394;&#22793;&#26356;&#12399;&#12377;&#12427;&#12394;&#12301;&#12392;&#12384;&#12369;&#35328;&#12358;&#12398;&#12399;&#28961;&#24847;&#21619;&#12391;&#12377;
  (&#12392;&#12356;&#12358;&#12363;&#12289;&#26377;&#23475;&#12391;&#12373;&#12360;&#12354;&#12426;&#12414;&#12377;)&#12290;&#12356;&#12356;&#21152;&#28187;&#12394;&#12398;&#12399;&#12289;
  &#32080;&#23616;&#12399;&#12381;&#12398;&#20154;&#12398;&#24615;&#26684;&#12398;&#21839;&#38988;&#12391;&#12354;&#12426;&#12289;&#12381;&#12398;&#20316;&#26989;&#25104;&#26524;&#12392;&#12399;&#38306;&#20418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12398;&#20316;&#26989;&#25104;&#26524;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#21453;&#24540;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#22793;&#26356;&#20869;&#23481;&#12398;&#20013;&#12391;&#12414;&#12378;&#12356;&#12392;&#12371;&#12429;&#12434;&#12289;&#28129;&#12293;&#12392;&#25351;&#25688;&#12375;&#12390;&#12356;&#12367;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;
  &#21516;&#12376;&#20154;&#12364;&#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#21516;&#12376;&#12424;&#12358;&#12394;&#12465;&#12450;&#12524;&#12473;&#12511;&#12473;&#12434;&#32368;&#12426;&#36820;&#12377;&#12424;&#12358;&#12394;&#12425;&#12289;
  &#25209;&#21028;&#12398;&#26368;&#24460;&#12395;&#12300;&#21516;&#12376;&#12371;&#12392;&#12364;&#32368;&#12426;&#36820;&#12373;&#12428;&#12390;&#12356;&#12427;&#12301;&#12392;&#25351;&#25688;&#12377;&#12427;&#12398;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12384;&#12375;&#12289;&#12381;&#12398;&#22580;&#21512;&#12418;&#12289;&#24594;&#12426;&#12434;&#25233;&#12360;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#25209;&#21028;&#12434;&#21463;&#12369;&#12390;&#12418;&#30456;&#25163;&#12364;&#20309;&#12418;&#22793;&#12431;&#12425;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#12418;&#12358;&#23569;&#12375;&#12365;&#12388;&#12417;&#12394;&#23550;&#24540;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12398;&#23550;&#24540;&#12392;&#12375;&#12390;&#12399;&#12289;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#30456;&#25163;&#12434;&#20663;&#12388;&#12369;&#12394;&#12356;&#12424;&#12358;&#12395;&#24444;&#12398;&#22320;&#20301;&#12434;&#22890;&#12358;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  <span>&#26412;&#31456;&#12398;&#24460;&#21322;&#12398;</span> 
  <a class="xref" href="transitions.html" title="&#24341;&#12365;&#32153;&#12366;">&#12300;&#24341;&#12365;&#32153;&#12366;&#12301;</a> &#12391;&#12289;&#12371;&#12398;&#23455;&#20363;&#12434;&#12372;&#35239;&#12356;&#12383;&#12384;&#12365;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12399;&#28357;&#22810;&#12395;&#36215;&#12371;&#12427;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#20154;&#12399;&#12289;&#20855;&#20307;&#30340;&#12391;&#35443;&#32048;&#12394;&#25209;&#21028;&#12434;&#21463;&#12369;&#21462;&#12428;&#12400;
  (&#21475;&#12395;&#12399;&#20986;&#12373;&#12378;&#12392;&#12418;) &#20309;&#12425;&#12363;&#12398;&#25913;&#21892;&#12398;&#23039;&#21218;&#12434;&#35211;&#12379;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12411;&#12417;&#35328;&#33865;&#12399;&#35504;&#12418;&#20663;&#12388;&#12369;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12384;&#12289;&#12384;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#20309;&#12418;&#32771;&#12360;&#12378;&#12395;&#12411;&#12417;&#12414;&#12367;&#12428;&#12400;&#12356;&#12356;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#36062;&#36059;&#12399;&#12289;&#19968;&#31278;&#12398;&#36947;&#20855;&#12391;&#12354;&#12427;&#12392;&#12418;&#12356;&#12360;&#12414;&#12377;&#12290;
  &#20351;&#12358;&#21069;&#12395;&#12399;&#12289;<span class="emphasis"><em>&#12394;&#12380;</em></span> &#12381;&#12358;&#12377;&#12427;&#12398;&#12363;&#12434;&#26908;&#35342;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#19968;&#33324;&#35542;&#12392;&#12375;&#12390;&#12289;&#20154;&#12364;&#12405;&#12384;&#12435;&#12363;&#12425;&#12372;&#12367;&#26222;&#36890;&#12395;&#34892;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#12411;&#12417;&#12427;&#12398;&#12399;&#12354;&#12414;&#12426;&#12356;&#12356;&#32771;&#12360;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#12381;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#21442;&#21152;&#12377;&#12427;&#19978;&#12391;&#24403;&#28982;&#12398;&#12371;&#12392;&#12392;&#12375;&#12390;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12427;&#20316;&#26989;&#12395;&#23550;&#12375;&#12390;&#12418;&#12289;
  &#29305;&#12395;&#12411;&#12417;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12434;&#12420;&#12426;&#22987;&#12417;&#12427;&#12392;&#12289;&#12356;&#12388;&#12420;&#12417;&#12427;&#12363;&#12398;&#21028;&#26029;&#12364;&#38627;&#12375;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#24403;&#28982;&#12398;&#12371;&#12392;&#12434;&#12420;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385; <span class="emphasis"><em>&#20840;&#21729;</em></span>
  &#12434;&#20491;&#21029;&#12395;&#36062;&#36059;&#12375;&#12390;&#12414;&#12431;&#12426;&#12414;&#12377;&#12363;? &#12393;&#12371;&#12363;&#12391;&#32218;&#12434;&#24341;&#12356;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#12411;&#12417;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#20154;&#12399;&#12300;&#12394;&#12380;?&#12301;&#12392;&#24605;&#12358;&#12391;&#12375;&#12423;&#12358;&#12397;&#12290;
  &#12381;&#12428;&#12424;&#12426;&#12418;&#12289;&#12356;&#12388;&#12418;&#12392;&#12399;&#30064;&#12394;&#12427;&#20685;&#12365;&#12434;&#12375;&#12383;&#20154;&#12420;
  &#20104;&#26399;&#12379;&#12396;&#27963;&#36493;&#12434;&#12375;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;
  &#25511;&#12360;&#12417;&#12395;&#36062;&#36059;&#12398;&#35328;&#33865;&#12434;&#36104;&#12427;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12300;&#12371;&#12428;&#12363;&#12425;&#12418;&#12418;&#12387;&#12392;&#12364;&#12435;&#12400;&#12387;&#12390;&#12397;&#12301;&#12392;&#21169;&#12414;&#12377;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12513;&#12531;&#12496;&#12540;&#20840;&#20307;&#12398;&#29983;&#29987;&#24615;&#12364;&#19968;&#27573;&#38542;&#21521;&#19978;&#12375;&#12383;&#12392;&#35211;&#12394;&#12379;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12425;&#12289;
  &#36062;&#36059;&#12398;&#35328;&#33865;&#12434;&#36104;&#12427;&#22522;&#28310;&#12418;&#12381;&#12428;&#12395;&#12354;&#12431;&#12379;&#12390;&#23569;&#12375;&#21427;&#12375;&#12417;&#12395;&#22793;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#36890;&#24120;&#12398;&#34892;&#12356;&#12395;&#23550;&#12375;&#12390;&#36062;&#36059;&#12434;&#32368;&#12426;&#36820;&#12377;&#12392;&#12289;&#12381;&#12398;&#12358;&#12385;&#12395;&#12381;&#12428;&#12399;&#28961;&#24847;&#21619;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12415;&#12435;&#12394;&#12364;&#39640;&#12356;&#29983;&#29987;&#24615;&#12434;&#30330;&#25582;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12398;&#12399;
  &#12418;&#12399;&#12420;&#20104;&#24819;&#20197;&#19978;&#12398;&#20685;&#12365;&#12391;&#12418;&#12394;&#12435;&#12391;&#12418;&#12394;&#12367;&#26399;&#24453;&#36890;&#12426;&#12398;&#12418;&#12398;&#12391;&#12354;&#12427;&#12431;&#12369;&#12391;&#12289;
  &#12381;&#12428;&#12434;&#12373;&#12425;&#12395;&#19978;&#22238;&#12427;&#20685;&#12365;&#12434;&#12375;&#12383;&#26178;&#28857;&#12391;&#25913;&#12417;&#12390;&#36062;&#36059;&#12398;&#23550;&#35937;&#12392;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
</p><p>
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12399;&#12289;&#12415;&#12435;&#12394;&#12398;&#36002;&#29486;&#12434;&#21463;&#12369;&#20837;&#12428;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12418;&#12289;&#30693;&#12387;&#12390;&#12362;&#12356;&#12390;&#12411;&#12375;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12358;&#12414;&#12367;&#27231;&#33021;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;&#12415;&#12435;&#12394;&#12364;&#20309;&#12434;&#12420;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12399;
  &#12377;&#12391;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#35504;&#12363;&#12364;&#12420;&#12387;&#12383;&#20316;&#26989;&#12399;&#12513;&#12531;&#12496;&#12540;&#12415;&#12435;&#12394;&#12364;&#30693;&#12387;&#12390;&#12356;&#12427;
  (&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12289;&#12381;&#12428;&#12434;&#12420;&#12387;&#12383;&#26412;&#20154;&#12418;&#27671;&#12389;&#12356;&#12390;&#12356;&#12427;) &#12431;&#12369;&#12391;&#12377;&#12290;
  &#30452;&#25509;&#36062;&#36059;&#12398;&#35328;&#33865;&#12434;&#36104;&#12427;&#20197;&#22806;&#12395;&#12418;&#12289;&#20154;&#12398;&#20316;&#26989;&#12395;&#23550;&#12375;&#12390;&#20309;&#12425;&#12363;&#12398;&#24847;&#24535;&#12434;&#34920;&#26126;&#12377;&#12427;&#26041;&#27861;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#20309;&#12425;&#12363;&#12398;&#35696;&#35542;&#12434;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;
  &#12300;&#12371;&#12398;&#12408;&#12435;&#12395;&#12388;&#12356;&#12390;&#12399;&#24444;&#22899;&#12364;&#22810;&#12367;&#12398;&#20316;&#26989;&#12434;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12375;&#12289;
  &#24444;&#22899;&#12364;&#35443;&#12375;&#12356;&#12384;&#12429;&#12358;&#12301;&#12392;&#35328;&#12387;&#12390;&#12415;&#12427;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#12415;&#12435;&#12394;&#12395;&#35211;&#12360;&#12427;&#22580;&#25152;&#12391;&#12467;&#12540;&#12489;&#12398;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#24444;&#22899;&#12395;&#23563;&#12397;&#12390;&#12415;&#12427;&#12290;
  &#12414;&#12383;&#12399;&#12289;&#12418;&#12387;&#12392;&#12418;&#21177;&#29575;&#30340;&#12394;&#26041;&#27861;&#12392;&#12375;&#12390;&#12399;&#12289;
  &#24444;&#22899;&#12398;&#20316;&#26989;&#25104;&#26524;&#12395;&#22522;&#12389;&#12356;&#12390;&#12373;&#12425;&#12394;&#12427;&#20316;&#26989;&#12434;&#34892;&#12358;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#33258;&#20998;&#12398;&#20316;&#26989;&#12364;&#20182;&#20154;&#12395;&#35469;&#12417;&#12425;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24444;&#22899;&#12418;&#24863;&#12376;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#34892;&#28858;&#12399;&#12289;&#21029;&#12395;&#35336;&#31639;&#12398;&#19978;&#12391;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#22810;&#22823;&#12394;&#36002;&#29486;&#12434;&#12375;&#32154;&#12369;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;
  &#20309;&#12418;&#12375;&#12394;&#12367;&#12390;&#12418;&#33258;&#28982;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#24433;&#38911;&#21147;&#12434;&#39640;&#12417;&#12390;&#12356;&#12367;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#27491;&#24403;&#12394;&#35413;&#20385;&#12434;&#21463;&#12369;&#12390;&#12356;&#12394;&#12356;&#12392;&#12354;&#12394;&#12383;&#12364;&#24863;&#12376;&#12383;&#22580;&#21512;&#12434;&#38500;&#12365;&#12289;
  &#12381;&#12428;&#12434;&#24460;&#25276;&#12375;&#12377;&#12427;&#12383;&#12417;&#12395;&#20309;&#12425;&#12363;&#12398;&#20316;&#26989;&#12434;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect2" title="&#32260;&#24373;&#12426;&#24847;&#35672;&#12398;&#22238;&#36991;"><div class="titlepage"><div><div><h3 class="title"><a name="territoriality"></a>&#32260;&#24373;&#12426;&#24847;&#35672;&#12398;&#22238;&#36991;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#29305;&#23450;&#12398;&#20998;&#37326;&#12395;&#12362;&#12356;&#12390;&#12289;
  &#12384;&#12428;&#12363;&#12364;&#20316;&#26989;&#12434;&#29420;&#21344;&#12375;&#12424;&#12358;&#12392;&#12375;&#22987;&#12417;&#12383;&#12425;&#35201;&#27880;&#24847;&#12391;&#12377;&#12290;
  &#35504;&#12363;&#12364;&#22987;&#12417;&#12424;&#12358;&#12392;&#12375;&#12383;&#20316;&#26989;&#12434;&#31309;&#26997;&#30340;&#12395;&#24341;&#12365;&#32153;&#12356;&#12384;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12394;&#12393;&#12364;&#12381;&#12428;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#25391;&#12427;&#33310;&#12356;&#12399;&#12289;&#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#20581;&#20840;&#12394;&#12418;&#12398;&#12395;&#35211;&#12360;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#34920;&#38754;&#30340;&#12395;&#12399;&#12289;&#12381;&#12398;&#20154;&#12364;&#12424;&#12426;&#22810;&#12367;&#12398;&#20316;&#26989;&#12434;&#24341;&#12365;&#21463;&#12369;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12391;
  &#12381;&#12398;&#20998;&#37326;&#12398;&#20316;&#26989;&#12434;&#27963;&#30330;&#12395;&#12373;&#12379;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#35211;&#12360;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#38263;&#12356;&#30446;&#12391;&#35211;&#12383;&#22580;&#21512;&#12289;&#12371;&#12428;&#12399;&#12354;&#12414;&#12426;&#12424;&#12356;&#20806;&#20505;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21608;&#12426;&#12398;&#20154;&#12364; "&#12354;&#12381;&#12371;&#12395;&#31435;&#12385;&#20837;&#12387;&#12385;&#12419;&#12356;&#12369;&#12394;&#12356;" &#12392;&#24863;&#12376;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;
  &#12415;&#12435;&#12394;&#12381;&#12371;&#12395;&#12399;&#12363;&#12363;&#12431;&#12425;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#32080;&#26524;&#12289;&#12393;&#12358;&#12394;&#12427;&#12363;&#12290;&#12381;&#12398;&#20998;&#37326;&#12398;&#12524;&#12499;&#12517;&#12540;&#12364;&#27231;&#33021;&#12375;&#12394;&#12367;&#12394;&#12426;&#12289;
  &#12418;&#12429;&#12356;&#12418;&#12398;&#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#19968;&#20154;&#12398;&#38283;&#30330;&#32773;&#12364;&#12377;&#12409;&#12390;&#12398;&#36012;&#20219;&#12434;&#36000;&#12387;&#12390;&#12375;&#12414;&#12356;&#12289;
  &#12381;&#12398;&#20154;&#12364;&#27424;&#12369;&#12428;&#12400;&#12381;&#12428;&#12391;&#12362;&#12375;&#12414;&#12356;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12373;&#12425;&#12395;&#24746;&#12356;&#12371;&#12392;&#12395;&#12289;&#12381;&#12428;&#12399;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24179;&#31561;&#20027;&#32681;&#12420;&#21332;&#21147;&#20307;&#21046;&#12434;&#22730;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#29702;&#35542;&#19978;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#38283;&#30330;&#32773;&#12364;
  &#22909;&#12365;&#12394;&#12392;&#12365;&#12395;&#22909;&#12365;&#12394;&#20316;&#26989;&#12395;&#21442;&#21152;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#23455;&#38555;&#12395;&#12399;&#22810;&#23569;&#30064;&#12394;&#12427;&#12371;&#12392;&#12399;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#20154;&#12395;&#12424;&#12387;&#12390;&#24471;&#24847;&#12394;&#20998;&#37326;&#12420;&#12381;&#12358;&#12391;&#12394;&#12356;&#20998;&#37326;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#32032;&#20154;&#12399;&#36948;&#20154;&#12398;&#35328;&#12358;&#12371;&#12392;&#12395;&#24467;&#12358;&#12375;&#12363;&#12394;&#12356;&#12392;&#12356;&#12358;&#20998;&#37326;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12371;&#12428;&#12425;&#12399;&#12377;&#12409;&#12390;&#33258;&#30330;&#30340;&#12395;&#21442;&#21152;&#12377;&#12427;&#20316;&#26989;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#33021;&#21147;&#12420;&#23455;&#32318;&#12395;&#12418;&#12392;&#12389;&#12356;&#12390;&#38750;&#20844;&#24335;&#12395;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#27770;&#12375;&#12390;&#12381;&#12428;&#12434;&#31309;&#26997;&#30340;&#12395;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12387;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#27177;&#21147;&#12434;&#27442;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#20206;&#12395;&#26377;&#33021;&#12394;&#20154;&#12391;&#12354;&#12427;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12354;&#12367;&#12414;&#12391;&#12418;&#12381;&#12398;&#27177;&#23041;&#12399;&#38750;&#20844;&#24335;&#12394;&#12418;&#12398;&#12392;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12513;&#12531;&#12496;&#12540;&#38291;&#12398;&#21512;&#24847;&#12395;&#12424;&#12427;&#12418;&#12398;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12381;&#12398;&#27177;&#23041;&#12395;&#12424;&#12387;&#12390;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#20171;&#20837;&#12434;&#22952;&#12370;&#12427;&#12371;&#12392;&#12364;&#12354;&#12387;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#35504;&#12363;&#12398;&#20316;&#26989;&#20869;&#23481;&#12434;&#12289;&#25216;&#34899;&#30340;&#12394;&#29702;&#30001;&#12391;&#21462;&#12426;&#28040;&#12375;&#12383;&#12426;&#32232;&#38598;&#12375;&#12383;&#12426;&#12377;&#12427;&#12398;&#12399;&#12289;
  &#12418;&#12385;&#12429;&#12435;&#20840;&#28982;&#36949;&#12358;&#35441;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12289;&#27770;&#23450;&#30340;&#12394;&#35201;&#32032;&#12399;&#20316;&#26989;&#12398;&#20013;&#36523;&#12391;&#12354;&#12426;&#12289;
  &#35504;&#12364;&#12381;&#12398;&#20316;&#26989;&#12398;&#36012;&#20219;&#12434;&#36000;&#12387;&#12390;&#12356;&#12427;&#12363;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12414;&#12383;&#12414;&#29305;&#23450;&#12398;&#20998;&#37326;&#12398;&#12524;&#12499;&#12517;&#12540;&#12434;&#34892;&#12358;&#12398;&#12364;&#29305;&#23450;&#12398;&#20154;&#12395;&#38598;&#20013;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12381;&#12398;&#20154;&#12364;&#20182;&#20154;&#12398;&#20171;&#20837;&#12434;&#25298;&#21542;&#12375;&#12394;&#12356;&#38480;&#12426;&#12399;&#29305;&#12395;&#21839;&#38988;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#32260;&#24373;&#12426;&#20027;&#32681;&#12364;&#30331;&#22580;&#12377;&#12427;&#12398;&#12434;&#38450;&#12368;&#12383;&#12417;&#12395;&#12289;
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#20316;&#32773;&#21517;&#12420;&#20445;&#23432;&#25285;&#24403;&#32773;&#21517;&#12434;&#21462;&#12426;&#38500;&#12367;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#31169;&#12399;&#24515;&#12363;&#12425;&#12371;&#12398;&#32722;&#24931;&#12395;&#36059;&#21516;&#12375;&#12414;&#12377;&#12290;
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12371;&#12398;&#26041;&#24335;&#12434;&#25505;&#29992;&#12375;&#12390;&#12362;&#12426;&#12289;
  Apache Software Foundation
  &#12391;&#12418;&#12381;&#12428;&#12399;&#20107;&#23455;&#19978;&#12398;&#20844;&#24335;&#26041;&#37341;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  ASF &#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12354;&#12427; Sander Striker &#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
     <span class="emphasis"><em>
       Apache Software foundation &#12391;&#12399;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395; author
       &#12479;&#12464;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#25512;&#22888;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#12371;&#12428;&#12395;&#12399;&#12289;&#27861;&#30340;&#12394;&#21839;&#38988;&#20197;&#22806;&#12395;&#12373;&#12414;&#12374;&#12414;&#12394;&#29702;&#30001;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
       &#20849;&#21516;&#38283;&#30330;&#12392;&#12399;&#12289;&#12415;&#12435;&#12394;&#12391;&#19968;&#20024;&#12392;&#12394;&#12387;&#12390;&#20316;&#26989;&#12395;&#21462;&#12426;&#32068;&#12415;&#12289;
       &#12415;&#12435;&#12394;&#12391;&#19968;&#20024;&#12392;&#12394;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
       &#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12427;&#12398;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12392;&#12356;&#12358;&#12363;&#12289;&#12416;&#12375;&#12429;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
       &#12391;&#12418;&#12289;&#38291;&#36949;&#12387;&#12383;&#24773;&#22577;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
       &#12393;&#12435;&#12394;&#12392;&#12365;&#12395; author &#12479;&#12464;&#12434;&#36861;&#21152;&#12377;&#12427;&#12398;&#12363;&#12290;
       &#12354;&#12427;&#12356;&#12399;&#12393;&#12435;&#12394;&#12392;&#12365;&#12395;&#21066;&#38500;&#12377;&#12427;&#12398;&#12363;&#12290;
       &#26126;&#30906;&#12394;&#22522;&#28310;&#12394;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
       &#12467;&#12513;&#12531;&#12488;&#12434;&#26360;&#12365;&#25563;&#12360;&#12383;&#12384;&#12369;&#12398;&#12392;&#12365;&#12395;&#12354;&#12394;&#12383;&#12398;&#21517;&#21069;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12363;?
       &#12383;&#12387;&#12383; 1 &#34892;&#12384;&#12369;&#20462;&#27491;&#12375;&#12383;&#12392;&#12365;&#12399;?
       &#12467;&#12540;&#12489;&#12434;&#12522;&#12501;&#12449;&#12463;&#12479;&#12522;&#12531;&#12464;&#12375;&#12390;&#12289;&#20803;&#12398;&#12467;&#12540;&#12489;&#12392;&#12399; 95%
       &#12411;&#12393;&#36949;&#12358;&#12418;&#12398;&#12395;&#12394;&#12387;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
       &#12371;&#12435;&#12394;&#26178;&#12395;&#12289;&#20803;&#12398;&#20316;&#32773;&#12398; author &#12479;&#12464;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12363;?
       &#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#12385;&#12423;&#12387;&#12392;&#12378;&#12388;&#20462;&#27491;&#12375;&#12390;&#12289;
       &#33258;&#20998;&#12398;&#21517;&#21069;&#12364;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#30331;&#22580;&#12377;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#20154;&#12364;&#12356;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
       &#12354;&#12394;&#12383;&#12399;&#12381;&#12428;&#12434;&#35211;&#12390;&#12393;&#12358;&#24605;&#12356;&#12414;&#12377;&#12363;?
     </em></span>
   </p><p>
     <span class="emphasis"><em>
       &#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12427;&#12424;&#12426;&#12418;&#12356;&#12356;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
       &#31169;&#12383;&#12385;&#12392;&#12375;&#12390;&#12418;&#12381;&#12385;&#12425;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
       &#25216;&#34899;&#30340;&#12394;&#20596;&#38754;&#12363;&#12425;&#35211;&#12390;&#12289;author &#12479;&#12464;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
       &#29305;&#23450;&#12398;&#12467;&#12540;&#12489;&#12434;&#35504;&#12364;&#26360;&#12356;&#12383;&#12398;&#12363;&#12434;&#30693;&#12426;&#12383;&#12369;&#12428;&#12400;&#12289;
       &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#29992;&#12377;&#12428;&#12400;&#12377;&#12368;&#12395;&#12431;&#12363;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
       &#12414;&#12383;&#12289;author &#12479;&#12464;&#12399;&#26356;&#26032;&#12364;&#36933;&#12428;&#12390;&#29694;&#29366;&#12434;&#21453;&#26144;&#12375;&#12394;&#12367;&#12394;&#12426;&#12364;&#12385;&#12391;&#12377;&#12290;
       5 &#24180;&#21069;&#12395;&#26360;&#12356;&#12383;&#12387;&#12365;&#12426;&#12391;&#24536;&#21364;&#12398;&#24444;&#26041;&#12395;&#12354;&#12387;&#12383;&#12467;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;
       &#20491;&#20154;&#30340;&#12395;&#21839;&#12356;&#21512;&#12431;&#12379;&#12425;&#12428;&#12383;&#12392;&#12375;&#12390;&#12289;&#12354;&#12394;&#12383;&#12399;&#12393;&#12358;&#24605;&#12356;&#12414;&#12377;&#12363;?
     </em></span>
   </p></blockquote></div><p>
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12289;
  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12371;&#12381;&#12364;&#12381;&#12398;&#23384;&#22312;&#12398;&#35388;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20840;&#20307;&#12391;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#36012;&#20219;&#12434;&#25345;&#12388;&#12409;&#12365;&#12391;&#12354;&#12426;&#12289;
  &#23567;&#12373;&#12394;&#12464;&#12523;&#12540;&#12503;&#12395;&#20998;&#12369;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12391; author &#12479;&#12464;&#12420; maintainer &#12479;&#12464;&#12434;&#20351;&#29992;&#12375;&#12383;&#12356;&#12392;&#25991;&#21477;&#12434;&#35328;&#12358;&#20154;&#12418;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#35504;&#12364;&#12418;&#12387;&#12392;&#12418;&#12364;&#12435;&#12400;&#12387;&#12390;&#12356;&#12427;&#12363;&#12364;&#19968;&#30446;&#30637;&#28982;&#12395;&#12394;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#24847;&#35211;&#12395;&#12399;&#12405;&#12383;&#12388;&#12398;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12300;&#12393;&#12398;&#31243;&#24230;&#12398;&#20316;&#26989;&#12434;&#12375;&#12383;&#12425;&#21517;&#21069;&#12434;&#36861;&#21152;&#12375;&#12390;&#12418;&#12356;&#12356;&#12398;&#12363;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#12393;&#12358;&#12391;&#12418;&#12356;&#12356;&#21839;&#38988;&#12364;&#24517;&#12378;&#31435;&#12385;&#19978;&#12364;&#12387;&#12390;&#12365;&#12414;&#12377;&#12290;
  &#27425;&#12395;&#12289;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12414;&#12427;&#12391;&#27177;&#23041;&#12434;&#24471;&#12427;&#12371;&#12392;&#12391;&#12354;&#12427;&#12363;&#12398;&#12424;&#12358;&#12394;&#21208;&#36949;&#12356;&#12434;&#36215;&#12371;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#36942;&#21435;&#12395;&#12381;&#12398;&#37096;&#20998;&#12398;&#20316;&#26989;&#12434;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#12467;&#12540;&#12489;&#12398;&#12381;&#12398;&#37096;&#20998;&#12364;&#20316;&#26989;&#12434;&#12375;&#12383;&#20154;&#12398;&#12418;&#12398;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#20808;&#38957;&#12395;&#20491;&#20154;&#12398;&#21517;&#21069;&#12364;&#20006;&#12409;&#12425;&#12428;&#12390;&#12356;&#12383;&#12425;&#12289;
  &#12381;&#12435;&#12394;&#39080;&#12395;&#21208;&#36949;&#12356;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#36991;&#12369;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;&#12463;&#12524;&#12472;&#12483;&#12488;&#12399;&#26082;&#12395;&#24471;&#12425;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12525;&#12464;&#12420;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12394;&#12393;&#12391;&#12381;&#12428;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#21066;&#38500;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;
  &#20309;&#12418;&#22833;&#12431;&#12428;&#12427;&#24773;&#22577;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  <sup>[<a name="idp2661632" href="#ftn.idp2661632" class="footnote">31</a>]</sup>
</p><p>
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12300;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#20316;&#32773;&#12398;&#21517;&#21069;&#12434;&#35352;&#36617;&#12375;&#12394;&#12356;&#12301;
  &#12371;&#12392;&#12395;&#27770;&#12417;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#27770;&#12375;&#12390;&#12420;&#12426;&#36942;&#12366;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399; <code class="filename">contrib/</code>
  &#12392;&#12356;&#12358;&#38936;&#22495;&#12364;&#12354;&#12387;&#12390;&#12289;&#32048;&#12293;&#12375;&#12383;&#12484;&#12540;&#12523;&#12420;&#12504;&#12523;&#12497;&#12540;&#12473;&#12463;&#12522;&#12503;&#12488;&#39006;&#12434;&#12371;&#12371;&#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#20013;&#12395;&#12399;&#12289;&#29305;&#23450;&#12398;&#20154;&#12364;&#20316;&#25104;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12399;&#38306;&#36899;&#12398;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12395;&#12399;&#20316;&#32773;&#12398;&#21517;&#21069;&#12434;&#21547;&#12417;&#12390;&#12418;&#12363;&#12414;&#12431;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12384;&#12387;&#12390;&#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12381;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#19968;&#26041;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#12484;&#12540;&#12523;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12495;&#12483;&#12463;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12289;
  &#26412;&#26684;&#30340;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21547;&#12417;&#12383;&#12367;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#12289;&#21407;&#20316;&#32773;&#12398;&#25215;&#35469;&#12434;&#24471;&#12383;&#19978;&#12391;&#20316;&#32773;&#12398;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#21066;&#38500;&#12375;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12427;&#20182;&#12398;&#12522;&#12477;&#12540;&#12473;&#12392;&#12354;&#12431;&#12379;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#21407;&#20316;&#32773;&#12364;&#12381;&#12428;&#12434;&#12356;&#12420;&#12364;&#12387;&#12383;&#22580;&#21512;&#12289;&#22949;&#21332;&#26696;&#12392;&#12375;&#12390;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12364;&#32771;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><pre class="programlisting">
# indexclean.py: &#21476;&#12356;&#12487;&#12540;&#12479;&#12434; Scanley &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12363;&#12425;&#21066;&#38500;&#12377;&#12427;
#
# &#21407;&#20316;&#32773;: K. Maru &lt;kobayashi@yetanotheremailservice.com&gt;
# &#29694;&#22312;&#12398;&#20445;&#23432;&#25285;&#24403;&#32773;: The Scanley Project &lt;http://www.scanley.org/&gt;
#                   &#12381;&#12375;&#12390; K. Maru.
# 
# ...
</pre></blockquote></div><p>
  &#12375;&#12363;&#12375;&#12289;&#12391;&#12365;&#12428;&#12400;&#12371;&#12358;&#12375;&#12383;&#22949;&#21332;&#12399;&#36991;&#12369;&#12383;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399;&#12289;&#35328;&#12358;&#12371;&#12392;&#12434;&#32862;&#12356;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#33258;&#20998;&#12398;&#20316;&#12387;&#12383;&#12418;&#12398;&#12364;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12426;&#28145;&#12367;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12367;&#12392;&#12356;&#12358;&#12398;&#12399;&#12358;&#12428;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#12393;&#12435;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12387;&#12390;&#12418;
  &#12381;&#12398;&#20013;&#24515;&#37096;&#12392;&#21608;&#22258;&#12399;&#12365;&#12387;&#12385;&#12426;&#12388;&#12394;&#12364;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#26412;&#20307;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12501;&#12449;&#12452;&#12523;&#12399;&#26126;&#12425;&#12363;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20013;&#24515;&#12392;&#12394;&#12427;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20840;&#20307;&#12391;&#31649;&#29702;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#19968;&#26041;&#12289;&#21608;&#36794;&#12398;&#12484;&#12540;&#12523;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20013;&#12395;&#12399;&#29305;&#23450;&#12398;&#20491;&#20154;&#12364;&#20445;&#23432;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12381;&#12428;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#36899;&#12377;&#12427;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#12426;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12392;&#12418;&#12395;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#26412;&#36074;&#30340;&#12395;&#12402;&#12392;&#12426;&#12391;&#20445;&#23432;&#12434;&#25285;&#24403;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#30011;&#19968;&#30340;&#12394;&#35215;&#21063;&#12391;&#32283;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12384;&#12375;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20840;&#20307;&#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12427;&#12522;&#12477;&#12540;&#12473;&#12399;
  &#27770;&#12375;&#12390;&#20491;&#20154;&#12391;&#22258;&#12356;&#36796;&#12435;&#12391;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#33258;&#21205;&#21270;&#12398;&#21106;&#21512;"><div class="titlepage"><div><div><h3 class="title"><a name="automation"></a>&#33258;&#21205;&#21270;&#12398;&#21106;&#21512;</h3></div></div></div><p>
  &#27231;&#26800;&#12395;&#12391;&#12365;&#12427;&#12371;&#12392;&#12399;&#12289;&#12431;&#12374;&#12431;&#12374;&#20154;&#38291;&#12395;&#12373;&#12379;&#12378;&#12395;&#27231;&#26800;&#12395;&#20219;&#12379;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12362;&#12362;&#12374;&#12387;&#12401;&#12395;&#35328;&#12387;&#12390;&#12289;&#23450;&#22411;&#20316;&#26989;&#12434;&#33258;&#21205;&#21270;&#12377;&#12428;&#12400;&#23569;&#12394;&#12367;&#12392;&#12418;&#21177;&#29575;&#12364; 10 &#20493;&#12395;&#12399;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#38971;&#32321;&#12395;&#34892;&#12358;&#20316;&#26989;&#12391;&#12354;&#12387;&#12383;&#12426;&#35079;&#38609;&#12394;&#20316;&#26989;&#12391;&#12354;&#12387;&#12383;&#12426;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;
  20 &#20493;&#20197;&#19978;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#29645;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12371;&#12371;&#12391;&#12399;&#12289;&#12354;&#12394;&#12383;&#12364;&#21336;&#12394;&#12427;&#19968;&#20154;&#12398;&#38283;&#30330;&#32773;&#12391;&#12399;&#12394;&#12367;
  "&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#32773;" &#12395;&#12394;&#12387;&#12383;&#12388;&#12418;&#12426;&#12391;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#21508;&#38283;&#30330;&#32773;&#12399;&#12289;&#21508;&#20491;&#20154;&#12364;&#12420;&#12387;&#12390;&#12356;&#12427;&#26525;&#33865;&#12398;&#20316;&#26989;&#12395;&#31934;&#19968;&#26479;&#12391;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12398;&#27096;&#23376;
  (&#33258;&#21205;&#21270;&#12391;&#12365;&#12427;&#20316;&#26989;&#12434;&#12431;&#12374;&#12431;&#12374;&#25163;&#20316;&#26989;&#12391;&#12420;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12394;&#12393;)
  &#12364;&#35211;&#12360;&#12390;&#12356;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12395;&#27671;&#12389;&#12356;&#12390;&#12356;&#12427;&#20154;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#12431;&#12374;&#12431;&#12374;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#21839;&#38988;&#12434;&#35299;&#27770;&#12375;&#12424;&#12358;&#12392;&#12399;&#24605;&#12431;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#21508;&#20491;&#20154;&#12398;&#20316;&#26989;&#33258;&#20307;&#12399;&#37325;&#33655;&#12392;&#12394;&#12427;&#12411;&#12393;&#12398;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12300;&#20309;&#12392;&#12363;&#12375;&#12394;&#12365;&#12419;&#12301;&#12392;&#24605;&#12358;&#12411;&#12393;&#12395;&#12399;&#22256;&#12387;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#20491;&#12293;&#12398;&#20316;&#26989;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12399;&#12431;&#12378;&#12363;&#12394;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#21508;&#38283;&#30330;&#32773;&#12364;&#12381;&#12428;&#12434;&#34892;&#12358;&#22238;&#25968;&#12384;&#12369;&#25499;&#12369;&#12427;&#12392;&#12393;&#12358;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12373;&#12425;&#12395;&#12381;&#12398;&#32080;&#26524;&#12434;&#38283;&#30330;&#32773;&#12398;&#20154;&#25968;&#20998;&#12384;&#12369;&#25499;&#12369;&#12383;&#12425;?
  &#8230;&#8230;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#32771;&#12360;&#12384;&#12377;&#12392;&#12289;&#33258;&#21205;&#21270;&#12399;&#28961;&#35222;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12371;&#12391;&#12356;&#12358; "&#33258;&#21205;&#21270;" &#12392;&#12399;&#12289;&#24195;&#12356;&#24847;&#21619;&#12398;&#33258;&#21205;&#21270;&#12434;&#25351;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12356;&#12367;&#12388;&#12363;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25351;&#23450;&#12375;&#12390;&#21516;&#12376;&#21205;&#20316;&#12434;&#32368;&#12426;&#36820;&#12377;&#12392;&#12356;&#12358;&#12418;&#12398;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#20154;&#38291;&#12398;&#20316;&#26989;&#12434;&#25903;&#25588;&#12377;&#12427;&#25216;&#34899;&#30340;&#12394;&#20181;&#32068;&#12415;&#19968;&#33324;&#12434;&#25351;&#12375;&#12390; "&#33258;&#21205;&#21270;" &#12392;&#12356;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12356;&#12414;&#12393;&#12365;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36939;&#21942;&#12395;&#12362;&#12369;&#12427;&#26368;&#20302;&#38480;&#24517;&#35201;&#12394;&#33258;&#21205;&#21270;&#12395;&#12388;&#12356;&#12390;&#12399;
  <a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12391;&#35500;&#26126;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12425;&#20197;&#22806;&#12395;&#12418;&#21508;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#22266;&#26377;&#12398;&#21839;&#38988;&#12418;&#12354;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#25285;&#24403;&#12481;&#12540;&#12512;&#12398;&#22580;&#21512;&#12399;&#12289;
  &#24120;&#12395;&#26368;&#26032;&#29256;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12364;&#24517;&#35201;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399; XML &#12394;&#12393;&#12398;&#12510;&#12540;&#12463;&#12450;&#12483;&#12503;&#35328;&#35486;&#12391;&#20316;&#25104;&#12373;&#12428;&#12427;&#12398;&#12391;&#12289;
  &#12467;&#12531;&#12497;&#12452;&#12523;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#34920;&#31034;&#29992;&#12392;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29992;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12394;&#12393;&#12289;
  &#12371;&#12398;&#12467;&#12531;&#12497;&#12452;&#12523;&#20966;&#29702;&#12399;&#35079;&#38609;&#12394;&#12418;&#12398;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#26368;&#26032;&#29256;&#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12390;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#21453;&#26144;&#12373;&#12379;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;
  &#35079;&#38609;&#12391;&#26178;&#38291;&#12398;&#12363;&#12363;&#12427;&#20966;&#29702;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20309;&#26085;&#12363;&#12363;&#12369;&#12390;&#12391;&#12418;&#12381;&#12398;&#20181;&#32068;&#12415;&#12434;&#20316;&#25104;&#12377;&#12427;&#20385;&#20516;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26368;&#26032;&#12398;&#29366;&#24907;&#12434;&#30906;&#35469;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#20181;&#32068;&#12415;&#12364;&#12394;&#12356;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12391;&#22256;&#12427;&#12398;&#12399;&#12411;&#12435;&#12398;&#19968;&#25569;&#12426;&#12398;&#20154;&#12383;&#12385;&#12384;&#12369;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12391;&#12418;&#12289;&#12381;&#12398;&#20181;&#32068;&#12415;&#12434;&#20316;&#12427;&#12371;&#12392;&#12395;&#12424;&#12427;&#21033;&#30410;&#12399;&#35336;&#12426;&#30693;&#12428;&#12394;&#12356;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#33258;&#21205;&#21270;&#12377;&#12427;&#12392;&#12289;&#26178;&#38291;&#12398;&#28010;&#36027;&#12364;&#35299;&#28040;&#12373;&#12428;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;
  &#20154;&#38291;&#12364;&#25163;&#21205;&#12391;&#20316;&#26989;&#12375;&#12383;&#12392;&#12365;&#12398;&#20316;&#26989;&#12511;&#12473; (&#12511;&#12473;&#12399;&#24517;&#12378;&#30330;&#29983;&#12375;&#12414;&#12377;)
  &#12391;&#12356;&#12425;&#12356;&#12425;&#12377;&#12427;&#12371;&#12392;&#12418;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20309;&#27573;&#38542;&#12395;&#12418;&#21450;&#12406;&#35079;&#38609;&#12394;&#23450;&#22411;&#20316;&#26989;&#12394;&#12435;&#12390;&#12289;&#12414;&#12373;&#12395;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#12420;&#12425;&#12379;&#12427;&#12409;&#12365;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12418;&#12381;&#12418;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12364;&#30330;&#26126;&#12373;&#12428;&#12383;&#12398;&#12399;&#12381;&#12358;&#12356;&#12358;&#20316;&#26989;&#12434;&#12420;&#12425;&#12379;&#12427;&#12383;&#12417;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12381;&#12435;&#12394;&#20316;&#26989;&#12399;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12395;&#20219;&#12379;&#12289;
  &#20154;&#38291;&#12399;&#12418;&#12387;&#12392;&#21109;&#36896;&#30340;&#12394;&#20316;&#26989;&#12395;&#26178;&#38291;&#12434;&#21106;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect3" title="&#33258;&#21205;&#12486;&#12473;&#12488;"><div class="titlepage"><div><div><h4 class="title"><a name="automated-testing"></a>&#33258;&#21205;&#12486;&#12473;&#12488;</h4></div></div></div><p>
  &#12486;&#12473;&#12488;&#12398;&#33258;&#21205;&#21270;&#12399;&#12393;&#12435;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12418;&#26377;&#29992;&#12391;&#12377;&#12364;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#29305;&#12395;&#26377;&#29992;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#33258;&#21205;&#12486;&#12473;&#12488; (&#29305;&#12395;&#22238;&#24112;&#12486;&#12473;&#12488;) &#12434;&#34892;&#12358;&#12371;&#12392;&#12391;&#12289;
  &#19981;&#24931;&#12428;&#12394;&#20998;&#37326;&#12398;&#12467;&#12540;&#12489;&#12391;&#12418;&#23433;&#24515;&#12375;&#12390;&#22793;&#26356;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#38283;&#30330;&#12398;&#21177;&#29575;&#12434;&#22823;&#12365;&#12367;&#21521;&#19978;&#12373;&#12379;&#12414;&#12377;&#12290;
  &#21839;&#38988;&#12398;&#21407;&#22240;&#12434;&#20154;&#38291;&#12398;&#30446;&#12391;&#26908;&#20986;&#12377;&#12427;&#12398;&#12399;&#22823;&#22793;
  (&#12414;&#12378;&#12300;&#12371;&#12398;&#12354;&#12383;&#12426;&#12395;&#21839;&#38988;&#12364;&#12354;&#12427;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12301;&#12392;&#35211;&#24403;&#12434;&#12388;&#12369;&#12289;
  &#12381;&#12398;&#37096;&#20998;&#12395;&#21839;&#38988;&#12364;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12354;&#12425;&#12422;&#12427;&#25163;&#27573;&#12391;&#35519;&#12409;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;)
  &#12394;&#12398;&#12391;&#12289;&#12381;&#12428;&#12434;&#33258;&#21205;&#21270;&#12377;&#12428;&#12400; <span class="emphasis"><em>&#22823;&#12365;&#12394;</em></span> &#26178;&#38291;&#12398;&#31680;&#32004;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><div class="sidebar" title="&#22238;&#24112;&#12486;&#12473;&#12488;"><a name="regression-testing"></a><div class="titlepage"><div><div><p class="title"><b>&#22238;&#24112;&#12486;&#12473;&#12488;</b></p></div></div></div><p>
    <em class="firstterm">&#22238;&#24112;&#12486;&#12473;&#12488; (&#12522;&#12464;&#12524;&#12483;&#12471;&#12519;&#12531;&#12486;&#12473;&#12488;&#12289;Regression testing)</em>
    &#12392;&#12399;&#12289;&#20462;&#27491;&#28168;&#12415;&#12398;&#12496;&#12464;&#12364;&#20877;&#30330;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#35519;&#12409;&#12427;&#12486;&#12473;&#12488;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#22238;&#24112;&#12486;&#12473;&#12488;&#12434;&#34892;&#12358;&#29702;&#30001;&#12399;&#12289;
    &#12467;&#12540;&#12489;&#12434;&#22793;&#26356;&#12375;&#12383;&#12371;&#12392;&#12391;&#20104;&#26399;&#12379;&#12396;&#12392;&#12371;&#12429;&#12391;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#30772;&#22730;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#22823;&#35215;&#27169;&#12289;&#35079;&#38609;&#12395;&#12394;&#12387;&#12390;&#12356;&#12367;&#12395;&#12388;&#12428;&#12390;&#12289;
    &#20104;&#26399;&#12379;&#12396;&#21103;&#20316;&#29992;&#12364;&#12354;&#12425;&#12431;&#12428;&#12427;&#21487;&#33021;&#24615;&#12418;&#22823;&#12365;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12365;&#12385;&#12435;&#12392;&#35373;&#35336;&#12375;&#12390;&#12356;&#12428;&#12400;&#12381;&#12398;&#21487;&#33021;&#24615;&#12434;&#20302;&#12367;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    &#23436;&#20840;&#12395;&#21839;&#38988;&#12434;&#35299;&#28040;&#12377;&#12427;&#12398;&#12399;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;
  </p><p>
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12289;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;
    <em class="firstterm">&#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;</em> &#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12399;&#21029;&#12395;&#29992;&#24847;&#12373;&#12428;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12289;
    &#36942;&#21435;&#12395;&#23384;&#22312;&#12375;&#12383;&#12496;&#12464;&#12364;&#20877;&#29694;&#12377;&#12427;&#12424;&#12358;&#12394;&#20966;&#29702;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
    &#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;&#12434;&#23455;&#34892;&#12375;&#12390;&#12371;&#12428;&#12425;&#12398;&#12496;&#12464;&#12364;&#20877;&#29694;&#12375;&#12383;&#29366;&#24907;&#12434;
    <em class="firstterm">&#12522;&#12464;&#12524;&#12483;&#12471;&#12519;&#12531;</em> &#12392;&#12356;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#35504;&#12363;&#12398;&#20462;&#27491;&#12364;&#36942;&#21435;&#12395;&#20462;&#27491;&#28168;&#12415;&#12398;&#12496;&#12464;&#12434;&#20877;&#30330;&#12373;&#12379;&#12390;&#12375;&#12414;&#12387;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
  </p><p>
    <a class="ulink" href="http://en.wikipedia.org/wiki/Regression_testing" target="_top">http://en.wikipedia.org/wiki/Regression_testing</a>
    &#12418;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p></div><p>
  &#22238;&#24112;&#12486;&#12473;&#12488;&#12399;&#27770;&#12375;&#12390;&#19975;&#33021;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12496;&#12483;&#12481;&#20966;&#29702;&#30340;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12399;&#12358;&#12414;&#12367;&#21205;&#20316;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#12383;&#12392;&#12360;&#12400;&#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12394;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12391;&#25805;&#20316;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#36969;&#29992;&#12377;&#12427;&#12398;&#12399;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#21839;&#38988;&#12392;&#12375;&#12390;&#12289;&#22238;&#24112;&#12486;&#12473;&#12488;&#29992;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12364;&#38750;&#24120;&#12395;&#35079;&#38609;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#25369;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;
  &#12414;&#12392;&#12418;&#12395;&#20351;&#12356;&#12371;&#12394;&#12379;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12414;&#12391;&#12395;&#12399;&#12363;&#12394;&#12426;&#12398;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#35079;&#38609;&#12373;&#12434;&#12394;&#12435;&#12392;&#12363;&#36605;&#28187;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#26178;&#38291;&#12364;&#12363;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#21162;&#21147;&#12399;&#24517;&#12378;&#22577;&#12431;&#12428;&#12414;&#12377;&#12290;
  &#26032;&#12375;&#12356;&#12486;&#12473;&#12488;&#12434;&#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;&#12395;&#36861;&#21152;&#12375;&#12420;&#12377;&#12367;&#12377;&#12428;&#12400;&#12377;&#12427;&#12411;&#12393;&#12289;
  &#22810;&#12367;&#12398;&#38283;&#30330;&#32773;&#12364;&#12486;&#12473;&#12488;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#32080;&#26524;&#12392;&#12375;&#12390;&#12289;&#12522;&#12522;&#12540;&#12473;&#24460;&#12395;&#35211;&#12388;&#12363;&#12427;&#12496;&#12464;&#12418;&#23569;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12486;&#12473;&#12488;&#12434;&#26360;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;&#36027;&#12420;&#12375;&#12383;&#21162;&#21147;&#12399;&#12289;
  &#23558;&#26469;&#12395;&#12431;&#12383;&#12387;&#12390;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#22823;&#12365;&#12394;&#21177;&#26524;&#12434;&#21450;&#12412;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399; <em class="firstterm">"Don't break the build!"</em>
  &#12392;&#12356;&#12358;&#27770;&#12414;&#12426;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#12391;&#12365;&#12394;&#12367;&#12394;&#12387;&#12383;&#12426;
  &#23455;&#34892;&#12391;&#12365;&#12394;&#12367;&#12394;&#12387;&#12383;&#12426;&#12377;&#12427;&#12424;&#12358;&#12394;&#22793;&#26356;&#12399;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12394;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#12467;&#12511;&#12483;&#12488;&#12434;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#20154;&#12399;&#12289;
  &#12363;&#12394;&#12426;&#27671;&#12414;&#12378;&#12356;&#24605;&#12356;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#22238;&#24112;&#12486;&#12473;&#12488;&#12434;&#25505;&#29992;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#27770;&#12414;&#12426;&#12399;&#12418;&#12387;&#12392;&#26126;&#30906;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12300;&#12486;&#12473;&#12488;&#12364;&#22833;&#25943;&#12377;&#12427;&#12424;&#12358;&#12394;&#22793;&#26356;&#12399;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12394;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;&#20840;&#20307;&#12434;&#27598;&#26217;&#33258;&#21205;&#23455;&#34892;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12467;&#12511;&#12483;&#12488;&#12434;&#26908;&#20986;&#12377;&#12427;&#12371;&#12392;&#12399;&#23481;&#26131;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12486;&#12473;&#12488;&#12398;&#23455;&#34892;&#32080;&#26524;&#12399;&#38283;&#30330;&#32773;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;
  (&#12354;&#12427;&#12356;&#12399;&#12486;&#12473;&#12488;&#32080;&#26524;&#23554;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;)
  &#12395;&#36865;&#12427;&#12424;&#12358;&#12395;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12411;&#12425;&#12289;&#12371;&#12371;&#12395;&#12418;&#12414;&#12383;&#33258;&#21205;&#21270;&#12398;&#20363;&#12364;&#12402;&#12392;&#12388;&#30331;&#22580;&#12375;&#12414;&#12375;&#12383;&#12290;
</p><p>
  &#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#12390;&#20316;&#26989;&#12375;&#12420;&#12377;&#12356;&#12486;&#12473;&#12488;&#12471;&#12473;&#12486;&#12512;&#12364;&#12354;&#12428;&#12400;&#12289;
  &#12383;&#12356;&#12390;&#12356;&#12398;&#38283;&#30330;&#32773;&#12399;&#21916;&#12435;&#12391;&#22238;&#24112;&#12486;&#12473;&#12488;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#22793;&#26356;&#12434;&#12377;&#12427;&#12392;&#12365;&#12399;&#12486;&#12473;&#12488;&#12418;&#20316;&#25104;&#12377;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;&#20849;&#36890;&#35469;&#35672;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#20316;&#26989;&#12399;&#12289;&#35079;&#25968;&#12391;&#21332;&#21147;&#12375;&#12390;&#34892;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12496;&#12464;&#20462;&#27491;&#20316;&#26989;&#12434;&#20108;&#20154;&#12391;&#20998;&#25285;&#12375;&#12289;&#19968;&#20154;&#12364;&#23455;&#38555;&#12398;&#20462;&#27491;&#12434;&#34892;&#12387;&#12390;
  &#12418;&#12358;&#19968;&#20154;&#12364;&#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#12392;&#12356;&#12387;&#12383;&#12424;&#12358;&#12395;&#12391;&#12377;&#12290;
  &#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#20596;&#12398;&#25285;&#24403;&#32773;&#12398;&#12411;&#12358;&#12364;&#12289;&#20316;&#26989;&#37327;&#12399;&#22810;&#12367;&#12394;&#12426;&#12364;&#12385;&#12391;&#12377;&#12290;
  &#12418;&#12392;&#12418;&#12392;&#23455;&#38555;&#12398;&#12496;&#12464;&#20462;&#27491;&#12395;&#12367;&#12425;&#12409;&#12390;&#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#20316;&#26989;&#12399;&#12388;&#12414;&#12425;&#12394;&#12356;&#12418;&#12398;&#12394;&#12398;&#12391;&#12289;
  &#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#12398;&#12364;&#33510;&#12395;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12373;&#12425;&#12395;&#21427;&#12375;&#12356;&#35215;&#21063;&#12434;&#35373;&#12369;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12496;&#12464;&#20462;&#27491;&#12420;&#27231;&#33021;&#36861;&#21152;&#12434;&#34892;&#12358;&#38555;&#12399;&#12289;<span class="emphasis"><em>&#24517;&#12378;</em></span>
  &#26032;&#12375;&#12356;&#12486;&#12473;&#12488;&#12434;&#36861;&#21152;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#35215;&#21063;&#12434;&#35373;&#12369;&#12427;&#12371;&#12392;&#12398;&#12424;&#12375;&#12354;&#12375;&#12399;&#12289;&#22810;&#12367;&#12398;&#35201;&#32032;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
  &#12300;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12393;&#12435;&#12394;&#39006;&#12398;&#12418;&#12398;&#12394;&#12398;&#12363;&#12301;
  &#12300;&#38283;&#30330;&#12481;&#12540;&#12512;&#12398;&#27083;&#25104;&#12399;&#12393;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12394;&#12398;&#12363;&#12301;
  &#12300;&#26032;&#12375;&#12356;&#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#38627;&#26131;&#24230;&#12399;&#12393;&#12428;&#12367;&#12425;&#12356;&#12363;&#12301;
  &#12394;&#12393;&#12364;&#32771;&#24942;&#12398;&#23550;&#35937;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  CVS (<a class="ulink" href="http://www.cvshome.org/" target="_top">http://www.cvshome.org/</a>)
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#38263;&#24180;&#12371;&#12398;&#21427;&#12375;&#12417;&#12398;&#35215;&#21063;&#12434;&#25505;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#29702;&#23624;&#12398;&#19978;&#12391;&#12399;&#12289;&#12371;&#12428;&#12399;&#12424;&#12356;&#26041;&#37341;&#12391;&#12375;&#12423;&#12358;&#12290;
  CVS &#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#29992;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12354;&#12426;&#12289;
  &#12518;&#12540;&#12470;&#12540;&#12398;&#12487;&#12540;&#12479;&#12434;&#22730;&#12375;&#12390;&#24489;&#26087;&#12391;&#12365;&#12394;&#12367;&#12375;&#12390;&#12375;&#12414;&#12358;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#12354;&#12387;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#23455;&#38555;&#12395;&#36939;&#29992;&#12375;&#12390;&#12356;&#12367;&#19978;&#12391;&#12399;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  CVS &#12398;&#22238;&#24112;&#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;&#12399;&#12289;&#12402;&#12392;&#12388;&#12398;&#24040;&#22823;&#12394;&#12471;&#12455;&#12523;&#12473;&#12463;&#12522;&#12503;&#12488;&#12391;&#12391;&#12365;&#12390;&#12356;&#12414;&#12377;
  (<code class="filename">sanity.sh</code> &#12392;&#12356;&#12358;&#22793;&#12394;&#21517;&#21069;&#12364;&#12388;&#12356;&#12390;&#12356;&#12414;&#12377;)&#12290;
  &#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#35501;&#12415;&#12389;&#12425;&#12367;&#12289;&#12414;&#12383;&#20462;&#27491;&#12375;&#12383;&#12426;&#25313;&#24373;&#12375;&#12383;&#12426;&#12377;&#12427;&#12398;&#12418;&#22823;&#22793;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#26032;&#12375;&#12356;&#12486;&#12473;&#12488;&#12434;&#36861;&#21152;&#12377;&#12427;&#12398;&#12364;&#22823;&#22793;&#12391;&#12354;&#12427;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12497;&#12483;&#12481;&#12364;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12427;&#12383;&#12417;&#12395;&#12399;&#26032;&#12375;&#12356;&#12486;&#12473;&#12488;&#12364;&#24517;&#38920;&#12391;&#12354;&#12427;&#12371;&#12392;&#12290;
  &#12371;&#12428;&#12425;&#12395;&#12424;&#12387;&#12390;&#12289;CVS &#12399;&#20107;&#23455;&#19978;&#12497;&#12483;&#12481;&#12398;&#21463;&#12369;&#20837;&#12428;&#12434;&#25298;&#21542;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12384;&#12392;&#35328;&#12360;&#12414;&#12377;&#12290;
  &#12363;&#12388;&#12390;&#31169;&#12364; CVS &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12383;&#12371;&#12429;&#12289;
  &#12300;CVS &#12398;&#12497;&#12483;&#12481;&#12434;&#20316;&#25104;&#12375;&#12383;&#12435;&#12384;&#12369;&#12393;&#12289;<code class="filename">sanity.sh</code>
  &#12395;&#12486;&#12473;&#12488;&#12434;&#36861;&#21152;&#12375;&#12394;&#12365;&#12419;&#12394;&#12425;&#12394;&#12356;&#12387;&#12390;&#12356;&#12358;&#35441;&#12434;&#32862;&#12356;&#12390;&#32080;&#23616;&#12354;&#12365;&#12425;&#12417;&#12383;&#12301;
  &#12392;&#12356;&#12358;&#20154;&#12434;&#25955;&#12293;&#35211;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
</p><p>
  &#12496;&#12464;&#12398;&#20462;&#27491;&#12381;&#12398;&#12418;&#12398;&#12424;&#12426;&#26032;&#12383;&#12394;&#22238;&#24112;&#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#12411;&#12358;&#12364;&#26178;&#38291;&#12398;&#12363;&#12363;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;
  &#12372;&#12367;&#26222;&#36890;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;&#12383;&#12384;&#12289;CVS &#12398;&#22580;&#21512;&#12399;&#12381;&#12428;&#12364;&#12385;&#12423;&#12387;&#12392;&#26997;&#31471;&#12377;&#12366;&#12414;&#12377;&#12290;
  &#25968;&#26178;&#38291;&#12363;&#12369;&#12390;&#33258;&#20998;&#29992;&#12398;&#12486;&#12473;&#12488;&#12434;&#20316;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12414;&#12384;&#12381;&#12428;&#12364;&#38291;&#36949;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  35,000 &#34892;&#12395;&#12418;&#12362;&#12424;&#12406;&#12471;&#12455;&#12523;&#12473;&#12463;&#12522;&#12503;&#12488;&#12398;&#20013;&#12395;&#12399;&#12289;
  &#24605;&#12356;&#12418;&#12424;&#12425;&#12396;&#12424;&#12358;&#12394;&#36796;&#12415;&#20837;&#12387;&#12383;&#20181;&#32068;&#12415;&#12364;&#28508;&#12435;&#12391;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#38263;&#24180; CVS &#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12391;&#12373;&#12360;&#12418;&#12289;
  &#26032;&#12383;&#12394;&#12486;&#12473;&#12488;&#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#19981;&#28288;&#12434;&#12418;&#12425;&#12377;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#21407;&#22240;&#12399;&#12289;
  &#31169;&#12383;&#12385;&#12364;&#33258;&#21205;&#21270;&#12398;&#21106;&#21512;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#33258;&#21069;&#12391;&#20316;&#12427;&#12394;&#12426;&#26082;&#23384;&#12398;&#12418;&#12398;&#12434;&#20351;&#12358;&#12394;&#12426;&#12375;&#12390;&#12289;
  &#26412;&#29289;&#12398;&#12486;&#12473;&#12488;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#31227;&#34892;&#12375;&#12424;&#12358;&#12392;&#12356;&#12358;&#35430;&#12415;&#12399;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  <sup>[<a name="idp2764224" href="#ftn.idp2764224" class="footnote">32</a>]</sup>
  &#12375;&#12363;&#12375;&#12289;&#38263;&#24180;&#12381;&#12428;&#12434;&#24608;&#12387;&#12390;&#12365;&#12383;&#12484;&#12465;&#12364;&#20170;&#12414;&#12431;&#12387;&#12390;&#12365;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#20351;&#12356;&#12389;&#12425;&#12356;&#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;&#12398;&#12379;&#12356;&#12391;&#29694;&#22312;&#12398; CVS &#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12390; <span class="emphasis"><em>&#12356;&#12394;&#12356;</em></span>
  &#12496;&#12464;&#20462;&#27491;&#12420;&#26032;&#27231;&#33021;&#12387;&#12390;&#12289;&#12356;&#12387;&#12383;&#12356;&#12393;&#12428;&#12367;&#12425;&#12356;&#12395;&#12394;&#12427;&#12435;&#12391;&#12375;&#12423;&#12358;?
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12399;&#30693;&#12426;&#12424;&#12358;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12289;
  &#26032;&#12375;&#12356;&#12486;&#12473;&#12488;&#12471;&#12473;&#12486;&#12512;&#12434;&#38283;&#30330; (&#12354;&#12427;&#12356;&#12399;&#26082;&#23384;&#12398;&#12471;&#12473;&#12486;&#12512;&#12434;&#25505;&#29992;)
  &#12377;&#12427;&#26178;&#38291;&#12434;&#30906;&#20445;&#12377;&#12427;&#12383;&#12417;&#12395;&#28187;&#12387;&#12390;&#12375;&#12414;&#12358;&#12496;&#12464;&#20462;&#27491;&#12539;&#27231;&#33021;&#36861;&#21152;&#12398;&#25968;&#12424;&#12426;&#12399;&#12427;&#12363;&#12395;&#22810;&#12356;&#12371;&#12392;&#12399;&#30906;&#12363;&#12391;&#12377;&#12290;
  &#12486;&#12473;&#12488;&#12471;&#12473;&#12486;&#12512;&#12434;&#31227;&#34892;&#12377;&#12427;&#12398;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12399;&#26377;&#38480;&#12398;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;
  &#20309;&#12418;&#12379;&#12378;&#29694;&#29366;&#12398;&#12486;&#12473;&#12488;&#12473;&#12452;&#12540;&#12488;&#12434;&#20351;&#12356;&#32154;&#12369;&#12427;&#12371;&#12392;&#12395;&#12424;&#12427;&#34987;&#23475;&#12399;&#27704;&#36960;&#12395;&#32154;&#12367;&#12431;&#12369;&#12391;&#12377;&#12363;&#12425;&#12290;
</p><p>
  &#12371;&#12371;&#12391;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;&#12300;&#12486;&#12473;&#12488;&#12434;&#26360;&#12367;&#12424;&#12358;&#21427;&#12375;&#12367;&#35201;&#27714;&#12377;&#12427;&#12398;&#12399;&#12480;&#12513;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;
  &#12486;&#12473;&#12488;&#12471;&#12473;&#12486;&#12512;&#12434;&#12471;&#12455;&#12523;&#12473;&#12463;&#12522;&#12503;&#12488;&#12391;&#26360;&#12367;&#12398;&#12364;&#24517;&#12378;&#12375;&#12418;&#24746;&#12356;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12365;&#12385;&#12435;&#12392;&#35373;&#35336;&#12375;&#12383;&#19978;&#12391;&#12354;&#12428;&#12400;&#12289;&#12381;&#12428;&#12364;&#26377;&#29992;&#12394;&#22580;&#21512;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#35328;&#12356;&#12383;&#12363;&#12387;&#12383;&#12398;&#12399;&#12289;&#12300;&#12418;&#12375;&#12486;&#12473;&#12488;&#12471;&#12473;&#12486;&#12512;&#12364;&#38283;&#30330;&#12398;&#38556;&#23475;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#20309;&#12363;&#25163;&#12434;&#25171;&#12383;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#21336;&#32020;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#20182;&#12398;&#23450;&#22411;&#20316;&#26989;&#12418;&#19968;&#32210;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12428;&#12364;&#38556;&#23475;&#12420;&#12508;&#12488;&#12523;&#12493;&#12483;&#12463;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#20309;&#12425;&#12363;&#12398;&#23550;&#20966;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
</p></div></div><div class="sect2" title="&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;"><div class="titlepage"><div><div><h3 class="title"><a name="users-to-volunteers"></a>&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21332;&#21147;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;</h3></div></div></div><p>
  &#12518;&#12540;&#12470;&#12540;&#12392;&#12398;&#12420;&#12426;&#21462;&#12426;&#12399;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#26032;&#12383;&#12394;&#12513;&#12531;&#12496;&#12540;&#12434;&#36814;&#12360;&#20837;&#12428;&#12427;&#12383;&#12417;&#12398;&#12481;&#12515;&#12531;&#12473;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12431;&#12374;&#12431;&#12374;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12375;&#12390;&#12367;&#12428;&#12383;&#12426;
  &#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#12367;&#12428;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#26178;&#28857;&#12391;&#12289;&#12381;&#12398;&#20154;&#12399;
  &#12381;&#12398;&#20182;&#22823;&#21218; (&#12398;&#12289;&#12381;&#12418;&#12381;&#12418;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12371;&#12392;&#12394;&#12435;&#12363;&#30693;&#12425;&#12394;&#12356;&#20154;&#12383;&#12385;)
  &#12424;&#12426;&#12418;&#12424;&#12426;&#28145;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#33288;&#21619;&#12434;&#25345;&#12387;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#20154;&#12383;&#12385;&#12434;&#12358;&#12414;&#12367;&#37347;&#12426;&#19978;&#12370;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#12425;&#12289;&#12381;&#12398;&#20154;&#12395;&#24863;&#35613;&#12375;&#12383;&#12358;&#12360;&#12391;
  &#12300;&#12392;&#12371;&#12429;&#12391;&#12289;&#12381;&#12428;&#12434;&#33258;&#20998;&#12391;&#20462;&#27491;&#12375;&#12390;&#12415;&#12427;&#27671;&#12399;&#12394;&#12356;?&#12301;
  &#12392;&#32862;&#12356;&#12390;&#12415;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  FAQ &#12395;&#36617;&#12379;&#12427;&#12409;&#12365;&#36074;&#21839;&#12364;&#27424;&#12369;&#12390;&#12356;&#12427;&#12384;&#12392;&#12363;
  &#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#19981;&#21313;&#20998;&#12384;&#12392;&#12363;&#12356;&#12358;&#25351;&#25688;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#22580;&#21512;&#12399;
  (&#23455;&#38555;&#12395;&#12381;&#12435;&#12394;&#21839;&#38988;&#12364;&#12354;&#12387;&#12383;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;)&#12289;
  &#25351;&#25688;&#12434;&#12375;&#12387;&#12363;&#12426;&#21463;&#12369;&#20837;&#12428;&#12383;&#19978;&#12391;
  &#12300;&#12392;&#12371;&#12429;&#12391;&#12289;&#12381;&#12428;&#12434;&#33258;&#20998;&#12391;&#26360;&#12356;&#12390;&#12415;&#12427;&#27671;&#12399;&#12394;&#12356;?&#12301;
  &#12392;&#32862;&#12356;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#24403;&#28982;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12399;&#12300;&#12356;&#12360;&#12289;&#12381;&#12371;&#12414;&#12391;&#12399;&#8230;&#8230;&#12301;&#12392;&#26029;&#12425;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12391;&#12418;&#12289;&#32862;&#12356;&#12390;&#12415;&#12427;&#12371;&#12392;&#33258;&#20307;&#12395;&#12399;&#12381;&#12435;&#12394;&#12395;&#25163;&#38291;&#12399;&#12363;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12395;&#12289;&#27598;&#22238;&#12381;&#12398;&#12424;&#12358;&#12395;&#36820;&#20107;&#12434;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
  &#12381;&#12398;&#20182;&#12398;&#21442;&#21152;&#32773;&#12418;&#12300;&#20309;&#12363;&#33258;&#20998;&#12364;&#12391;&#12365;&#12427;&#12371;&#12392;&#12391;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12391;&#12365;&#12427;&#12435;&#12384;&#12394;&#12301;&#12392;&#27671;&#12389;&#12367;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><p>
  &#30446;&#27161;&#12399;&#12289;&#21336;&#12395;&#26032;&#12383;&#12394;&#38283;&#30330;&#32773;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20316;&#32773;&#12434;&#30906;&#20445;&#12377;&#12427;&#12371;&#12392;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12415;&#12435;&#12394;&#12395;&#12424;&#12426;&#12424;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12424;&#12358;&#12395;&#20181;&#21521;&#12369;&#12427;&#12371;&#12392;&#12399;&#12289;
  &#38263;&#12356;&#30446;&#12391;&#12415;&#12428;&#12400;&#21313;&#20998;&#12395;&#25505;&#31639;&#12398;&#21462;&#12428;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12411;&#12435;&#12398;&#23569;&#12375;&#12398;&#25163;&#38291;&#12391;&#24444;&#12425;&#12364;&#23558;&#26469;&#22810;&#12367;&#12398;&#12496;&#12464;&#22577;&#21578;&#12434;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12428;&#12400;&#12377;&#12400;&#12425;&#12375;&#12356;&#12392;&#24605;&#12356;&#12414;&#12379;&#12435;&#12363;?
  &#12381;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;&#21021;&#12417;&#12390;&#12496;&#12464;&#12434;&#22577;&#21578;&#12375;&#12390;&#12367;&#12428;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;&#24314;&#35373;&#30340;&#12394;&#21453;&#24540;&#12434;&#36820;&#12377;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#24314;&#35373;&#30340;&#12394;&#21453;&#24540;&#12392;&#12399;&#12289;&#21336;&#12395;&#12496;&#12464;&#12434;&#20462;&#27491;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;
  (&#12418;&#12385;&#12429;&#12435;&#12381;&#12428;&#12364;&#29702;&#24819;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;)&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12424;&#12426;&#35443;&#32048;&#12394;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;&#12424;&#12358;&#30456;&#25163;&#12395;&#27714;&#12417;&#12383;&#12426;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12383;&#12384;&#12381;&#12428;&#12364;<span class="emphasis"><em>&#12496;&#12464;&#12391;&#12354;&#12427;</em></span>&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35469;&#12417;&#12427;&#12384;&#12369;&#12391;&#12418;&#24314;&#35373;&#30340;&#12394;&#21453;&#24540;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
  &#20154;&#12399;&#35504;&#12391;&#12418;&#12289;&#33258;&#20998;&#12398;&#24847;&#35211;&#12395;&#32819;&#12434;&#20670;&#12369;&#12390;&#12411;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12496;&#12464;&#12434;&#22577;&#21578;&#12375;&#12383;&#20154;&#12399;&#12381;&#12398;&#12496;&#12464;&#12364;&#20462;&#27491;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#26395;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
  &#24460;&#32773;&#12398;&#26395;&#12415;&#12399;&#12377;&#12368;&#12395;&#12399;&#12363;&#12394;&#12360;&#12425;&#12428;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12354;&#12394;&#12383; (&#12392;&#12356;&#12358;&#12363;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;)
  &#12364;&#21069;&#32773;&#12398;&#26395;&#12415;&#12434;&#12363;&#12394;&#12360;&#12390;&#12354;&#12370;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><p>
  &#24403;&#28982;&#12398;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
  &#12300;&#20309;&#12363;&#35328;&#12356;&#12383;&#12356;&#12398;&#12399;&#12431;&#12363;&#12427;&#12369;&#12428;&#12393;&#12418;&#20855;&#20307;&#30340;&#12394;&#12371;&#12392;&#12364;&#12373;&#12387;&#12401;&#12426;&#12431;&#12363;&#12425;&#12394;&#12356;&#12301;
  &#12424;&#12358;&#12394;&#12496;&#12464;&#22577;&#21578;&#12395;&#12383;&#12356;&#12375;&#12390;&#12418;&#33145;&#12434;&#12383;&#12390;&#12383;&#12426;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#20491;&#20154;&#30340;&#12395;&#12289;&#31169;&#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#24907;&#24230;&#12399;&#27671;&#12395;&#20837;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#38283;&#30330;&#32773;&#12364;&#35211;&#12425;&#12428;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12398;&#23475;&#12399;&#26126;&#30333;&#12391;&#12377;&#12290;
  &#12363;&#12431;&#12356;&#12381;&#12358;&#12394;&#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#28961;&#24847;&#21619;&#12394;&#22577;&#21578;&#12434;&#36865;&#12387;&#12390;&#12365;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
     Scanley &#12364;&#21205;&#12363;&#12394;&#12356;&#12435;&#12384;&#12369;&#12393;&#12290;
     &#36215;&#21205;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12456;&#12521;&#12540;&#12364;&#20986;&#12427;&#12435;&#12384;&#12290;
     &#20182;&#12398;&#12415;&#12435;&#12394;&#12399;&#22823;&#19976;&#22827;&#12394;&#12398;&#12363;&#12394;?
   </p></blockquote></div><p>
  &#36942;&#21435;&#12395;&#12371;&#12398;&#39006;&#12398;&#22577;&#21578;&#12434;&#25968;&#38480;&#12426;&#12394;&#12367;&#35211;&#12390;&#12365;&#12383;&#38283;&#30330;&#32773;&#12398;&#12394;&#12363;&#12395;&#12399;&#12289;
  &#12371;&#12435;&#12394;&#31572;&#12360;&#12434;&#36820;&#12377;&#20154;&#12364;&#12356;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
     &#12385;&#12387;&#12290;&#12381;&#12435;&#12394;&#24773;&#22577;&#12384;&#12369;&#12391;&#12356;&#12387;&#12383;&#12356;&#12393;&#12358;&#12375;&#12429;&#12387;&#12390;&#35328;&#12358;&#12435;&#12384;&#12424;&#12290;
     &#12418;&#12387;&#12392;&#35443;&#12375;&#12356;&#24773;&#22577;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12394;&#12356;&#12392;&#12290;
     &#12379;&#12417;&#12390; Scanley &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#12363; OS
     &#12398;&#31278;&#39006;&#12289;&#12354;&#12392;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12367;&#12425;&#12356;&#12399;&#24517;&#35201;&#12384;&#12290;
   </p></blockquote></div><p>
  &#12371;&#12435;&#12394;&#31572;&#12360;&#12434;&#36820;&#12377;&#20154;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#30446;&#32218;&#12391;&#32771;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12435;&#12394;&#21453;&#24540;&#12364; <span class="emphasis"><em>&#12381;&#12398;&#20182;&#12398;</em></span>
  &#20154;&#12383;&#12385;&#12395;&#12393;&#12435;&#12394;&#12405;&#12358;&#12395;&#24605;&#12431;&#12428;&#12427;&#12363;&#12395;&#12418;&#32771;&#12360;&#12364;&#21450;&#12435;&#12391;&#12356;&#12394;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12398;&#32076;&#39443;&#12364;&#12394;&#12356;&#20154;&#12420;&#12496;&#12464;&#22577;&#21578;&#12398;&#32076;&#39443;&#12398;&#12394;&#12356;&#20154;&#12394;&#12393;&#12399;&#12289;
  &#27491;&#12375;&#12356;&#12496;&#12464;&#22577;&#21578;&#12398;&#26041;&#27861;&#12394;&#12435;&#12390;&#30693;&#12425;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12435;&#12394;&#20154;&#12408;&#12398;&#23550;&#24540;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;?
  &#25945;&#32946;&#12375;&#12385;&#12419;&#12360;&#12400;&#12356;&#12356;&#12435;&#12391;&#12377;!
  &#12393;&#12358;&#12379;&#12377;&#12427;&#12394;&#12425;&#12289;&#12424;&#12426;&#12424;&#12356;&#36820;&#20107;&#12434;&#12418;&#12425;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
     &#12372;&#36855;&#24785;&#12434;&#12362;&#12363;&#12369;&#12375;&#12390;&#30003;&#12375;&#35379;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
     &#20309;&#12364;&#36215;&#12371;&#12387;&#12383;&#12398;&#12363;&#12434;&#35519;&#12409;&#12427;&#12383;&#12417;&#12395;&#12399;
     &#12418;&#12358;&#23569;&#12375;&#35443;&#32048;&#12394;&#24773;&#22577;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
     Scanley &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427; OS&#12289;
     &#12381;&#12375;&#12390;&#12456;&#12521;&#12540;&#12398;&#27491;&#30906;&#12394;&#20869;&#23481;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12414;&#12379;&#12435;&#12363;?
     &#12354;&#12392;&#12289;&#23455;&#34892;&#12375;&#12383;&#12467;&#12510;&#12531;&#12489;&#12392;&#12381;&#12398;&#20986;&#21147;&#32080;&#26524;&#12434;&#27491;&#30906;&#12395;&#25945;&#12360;&#12390;&#12418;&#12425;&#12360;&#12427;&#12392;&#21161;&#12363;&#12426;&#12414;&#12377;&#12290;
     &#35443;&#32048;&#12399;
     http://www.scanley.org/how_to_report_a_bug.html
     &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
   </p></blockquote></div><p>
  &#24517;&#35201;&#12394;&#24773;&#22577;&#12434;&#12518;&#12540;&#12470;&#12540;&#12363;&#12425;&#24341;&#12365;&#20986;&#12377;&#12395;&#12399;&#12289;
  &#12371;&#12358;&#12356;&#12387;&#12383;&#24863;&#12376;&#12398;&#36820;&#31572;&#12398;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12371;&#12398;&#36820;&#31572;&#12399;&#12518;&#12540;&#12470;&#12540;&#12398;&#35222;&#28857;&#12395;&#31435;&#12387;&#12390;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12414;&#12378; 1 &#28857;&#30446;&#12290;&#12371;&#12398;&#36820;&#31572;&#12391;&#12399;&#12300;<span class="emphasis"><em>&#21839;&#38988;&#12364;&#12354;&#12387;&#12383;&#12435;&#12391;&#12377;&#12397;&#12290;
  &#12362;&#23519;&#12375;&#12375;&#12414;&#12377;&#12290;&#12373;&#12382;&#22823;&#22793;&#12384;&#12387;&#12383;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;</em></span>&#12301;
  &#12392;&#21516;&#24773;&#12398;&#24847;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;
  (&#12496;&#12464;&#22577;&#21578;&#12395;&#23550;&#12375;&#12390;&#27598;&#22238;&#12371;&#12398;&#12424;&#12358;&#12395;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12496;&#12464;&#12398;&#28145;&#21051;&#24230;&#12289;&#12381;&#12375;&#12390;&#12518;&#12540;&#12470;&#12540;&#12364;&#12393;&#12398;&#31243;&#24230;&#22256;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12395;&#24540;&#12376;&#12390;&#20351;&#12356;&#12431;&#12369;&#12414;&#12377;)&#12290;
  &#27425;&#12395; 2 &#28857;&#30446;&#12290;&#12496;&#12464;&#22577;&#21578;&#12398;&#12362;&#20316;&#27861;&#12434;&#30693;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#12496;&#12459;&#12395;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;
  &#12300;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#12289;&#12393;&#12435;&#12394;&#24773;&#22577;&#12364;&#12411;&#12375;&#12356;&#12398;&#12363;&#12301;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12372;&#12367;&#19968;&#33324;&#30340;&#12394;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12300;&#12456;&#12521;&#12540;&#12398;&#20869;&#23481;&#12434;&#25945;&#12360;&#12390;&#12301;&#12392;&#35328;&#12431;&#12428;&#12390;&#12418;&#12289;&#12381;&#12428;&#12364;
  &#12300;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#27491;&#30906;&#12395;&#25945;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#36884;&#20013;&#12414;&#12391;&#12391;&#20999;&#12387;&#12383;&#12426;
  &#22793;&#12395;&#30465;&#30053;&#12375;&#12383;&#12426;&#12375;&#12394;&#12356;&#12371;&#12392;&#12301;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12354;&#12427;&#12392;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12435;&#12394;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#24540;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12392;&#12367;&#12395;&#20107;&#32048;&#12363;&#12395;&#35500;&#26126;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26368;&#24460;&#12395; 3 &#28857;&#30446;&#12290;&#12424;&#12426;&#35443;&#12375;&#12356;&#12289;&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#12377;&#12427;&#12383;&#12417;&#12398;&#26041;&#27861;&#12364;&#12431;&#12363;&#12427;&#12424;&#12358;&#12289;
  &#12509;&#12452;&#12531;&#12479;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12358;&#12414;&#12367;&#23550;&#24540;&#12377;&#12428;&#12400;&#12289;
  &#12365;&#12387;&#12392;&#12371;&#12398;&#22577;&#21578;&#32773;&#12399;&#12522;&#12531;&#12463;&#20808;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#35501;&#12435;&#12391;&#12381;&#12398;&#20869;&#23481;&#12434;&#29702;&#35299;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#20107;&#21069;&#12395;&#12381;&#12398;&#12383;&#12417;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#29992;&#24847;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#12399;&#12289;&#38283;&#30330;&#12481;&#12540;&#12512;&#12364;
  &#12496;&#12464;&#22577;&#21578;&#12398;&#38555;&#12395;&#12393;&#12435;&#12394;&#24773;&#22577;&#12434;&#27442;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#26126;&#30906;&#12395;&#35500;&#26126;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#12496;&#12464;&#22577;&#21578;&#12398;&#20869;&#23481;&#12395;&#12354;&#12431;&#12379;&#12390;
  &#12381;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26085;&#12293;&#25913;&#33391;&#12375;&#12390;&#12356;&#12367;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
</p><p>
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#12496;&#12464;&#22577;&#21578;&#12398;&#35500;&#26126;&#12399;&#12289;&#12414;&#12373;&#12395;&#12371;&#12398;&#24418;&#24335;&#12398;&#12424;&#12356;&#20363;&#12392;&#12356;&#12360;&#12414;&#12377;
  (<a class="xref" href="bug-reporting.html" title="&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;">&#20184;&#37682;E <i>&#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;</i></a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12290;
  &#26368;&#24460;&#12398;&#12411;&#12358;&#12395;&#12289;&#12496;&#12464;&#12434;&#20462;&#27491;&#12377;&#12427;&#12383;&#12417;&#12398;&#12497;&#12483;&#12481;&#12398;&#25552;&#20379;&#12434;&#20419;&#12375;&#12390;&#12356;&#12427;&#31623;&#25152;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#30446;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#12496;&#12464;&#22577;&#21578;&#12395;&#12362;&#12369;&#12427;&#12497;&#12483;&#12481;&#12398;&#28155;&#20184;&#29575;&#12364;&#19978;&#12364;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;
  (&#12496;&#12464;&#12434;&#20462;&#27491;&#12391;&#12365;&#12427;&#12367;&#12425;&#12356;&#12398;&#12524;&#12505;&#12523;&#12398;&#20154;&#12394;&#12425;&#12289;
  &#12356;&#12385;&#12356;&#12385;&#35328;&#12431;&#12428;&#12394;&#12367;&#12390;&#12418;&#12497;&#12483;&#12481;&#12364;&#26377;&#29992;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12363;&#12425;)&#12290;
  &#30495;&#12398;&#30446;&#30340;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#35501;&#32773; (&#29305;&#12395;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21021;&#12417;&#12390;&#21442;&#21152;&#12377;&#12427;&#20154;&#12383;&#12385;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12395;&#21021;&#12417;&#12390;&#36275;&#12434;&#36367;&#12415;&#20837;&#12428;&#12427;&#20154;&#12383;&#12385;)
  &#12395;&#23550;&#12375;&#12390;&#12300;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#22810;&#12367;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#36002;&#29486;&#12395;&#12424;&#12387;&#12390;&#25104;&#12426;&#31435;&#12387;&#12390;&#12356;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#12513;&#12531;&#12496;&#12540;&#12384;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
  &#12496;&#12464;&#20462;&#27491;&#12395;&#23550;&#12377;&#12427;&#36012;&#20219;&#12364;&#12496;&#12464;&#12398;&#22577;&#21578;&#32773;&#12424;&#12426;&#37325;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#26032;&#20837;&#12426;&#12373;&#12435;&#12395;&#12399;&#12354;&#12414;&#12426;&#12394;&#12376;&#12417;&#12394;&#12356;&#32771;&#12360;&#26041;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12371;&#12428;&#12399;&#37325;&#35201;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#12415;&#12435;&#12394;&#12395;&#29702;&#35299;&#12375;&#12390;&#12418;&#12425;&#12360;&#12428;&#12400;&#12289;
  &#12496;&#12464;&#20462;&#27491;&#12398;&#12383;&#12417;&#12398;&#25163;&#21161;&#12369;&#12434;&#12424;&#12426;&#22810;&#12367;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12467;&#12540;&#12489;&#12364;&#26360;&#12369;&#12394;&#12356;&#20154;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#12496;&#12464;&#12398;&#20877;&#29694;&#25163;&#38918;&#12434;&#35443;&#32048;&#12395;&#35500;&#26126;&#12375;&#12383;&#12426;
  &#12384;&#12428;&#12363;&#12398;&#12496;&#12464;&#20462;&#27491;&#12398;&#20869;&#23481;&#12434;&#26908;&#35388;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#25903;&#25588;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#26368;&#32066;&#30340;&#12394;&#30446;&#27161;&#12399;&#12289;&#12415;&#12435;&#12394;&#12395;&#12300;&#33258;&#20998;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12450;&#12513;&#12531;&#12496;&#12540;&#12398;&#38291;&#12395;&#12399;
  <span class="emphasis"><em>&#26412;&#36074;&#30340;&#12394;</em></span> &#36949;&#12356;&#12399;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#29702;&#35299;&#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#22833;&#31036;&#12394;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#22810;&#23569;&#12365;&#12388;&#12367;&#23550;&#24540;&#12375;&#12390;&#12418;&#35377;&#12373;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12414;&#12395;&#12289;&#12496;&#12464;&#22577;&#21578;&#12420;&#33510;&#24773;&#12434;&#26360;&#12367;&#38555;&#12395;
  &#29366;&#27841;&#12434;&#32771;&#12360;&#12378;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12496;&#12459;&#12395;&#12375;&#12383;&#24907;&#24230;&#12434;&#12392;&#12427;&#20154;&#12364;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#20154;&#12399;&#12289;&#12496;&#12459;&#12395;&#12375;&#12383;&#12363;&#12392;&#24605;&#12360;&#12400;&#24613;&#12395;&#12371;&#12403;&#12408;&#12388;&#12425;&#12387;&#12390;&#12365;&#12383;&#12426;&#12289;
  &#24907;&#24230;&#12434;&#12467;&#12525;&#12467;&#12525;&#22793;&#12360;&#12427;&#12371;&#12392;&#12364;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;&#12363;&#12388;&#12390; Subversion
  &#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12371;&#12435;&#12394;&#25237;&#31295;&#12434;&#12375;&#12383;&#20154;&#12364;&#12356;&#12414;&#12375;&#12383;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
  6 &#26085;&#12418;&#12383;&#12387;&#12383;&#12398;&#12395;&#12289;&#12356;&#12414;&#12384;&#12395; Windows &#29256;&#12398;&#12496;&#12452;&#12490;&#12522;&#12364;&#12394;&#12356;&#12387;&#12390;&#12393;&#12358;&#12356;&#12358;&#12371;&#12392;?!?
  &#27598;&#22238;&#12371;&#12435;&#12394;&#12371;&#12392;&#12364;&#32154;&#12367;&#12435;&#12391;&#12289;&#12418;&#12358;&#12356;&#12425;&#12356;&#12425;&#12375;&#12387;&#12401;&#12394;&#12375;&#12384;&#12424;&#12290;
  &#12381;&#12435;&#12394;&#12398;&#33258;&#21205;&#21270;&#12375;&#12385;&#12419;&#12360;&#12400;&#12356;&#12356;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12375;&#12423;??
  "RC" &#29256;&#12434;&#20986;&#12375;&#12383;&#12387;&#12390;&#12371;&#12392;&#12399;&#12381;&#12428;&#12434;&#12415;&#12435;&#12394;&#12395;&#20351;&#12387;&#12390;&#12411;&#12375;&#12356;&#12435;&#12391;&#12375;&#12423;?
  &#12394;&#12398;&#12395;&#12371;&#12435;&#12394;&#29366;&#24907;&#12384;&#12392;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12394;&#12356;&#12376;&#12419;&#12394;&#12356;&#12363;&#12290;
  &#35430;&#12375;&#12424;&#12358;&#12364;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;&#12486;&#12473;&#12488;&#26399;&#38291;&#12394;&#12435;&#12390;&#28961;&#39364;&#12376;&#12419;&#12394;&#12356;??
</p></blockquote></div><p>
  &#12371;&#12398;&#29053;&#12426;&#27671;&#21619;&#12398;&#25237;&#31295;&#12395;&#23550;&#12377;&#12427;&#36820;&#20449;&#12399;&#12289;&#12393;&#12428;&#12418;&#39514;&#12367;&#12411;&#12393;&#33853;&#12385;&#30528;&#12356;&#12383;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12496;&#12452;&#12490;&#12522;&#29256;&#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12394;&#12356;&#26041;&#37341;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#25351;&#25688;&#12375;&#12289;
  &#12381;&#12435;&#12394;&#12395;&#12496;&#12452;&#12490;&#12522;&#12364;&#22823;&#20107;&#12394;&#12398;&#12394;&#12425;&#33258;&#20998;&#12391;&#12381;&#12428;&#12434;&#20316;&#12387;&#12390;&#25552;&#20379;&#12377;&#12427;&#12409;&#12365;&#12384;&#12392;&#36820;&#20449;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#39514;&#12367;&#12394;&#12363;&#12428;&#12289;&#24444;&#12398;&#27425;&#12398;&#25237;&#31295;&#12399;&#12371;&#12435;&#12394;&#19968;&#25991;&#12363;&#12425;&#22987;&#12414;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p>
  &#12414;&#12378;&#26368;&#21021;&#12395;&#19968;&#35328;&#12290;Subversion &#12399;&#26368;&#39640;&#12398;&#12484;&#12540;&#12523;&#12384;&#12375;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12377;&#12409;&#12390;&#12398;&#21442;&#21152;&#32773;&#12395;&#12399;&#26412;&#24403;&#12395;&#24863;&#35613;&#12375;&#12390;&#12427;&#12435;&#12384;&#12424;&#12290;[...]
</p></blockquote></div><p>
  ...&#12392;&#12356;&#12387;&#12383;&#33292;&#12398;&#26681;&#12418;&#20094;&#12363;&#12396;&#12358;&#12385;&#12395;&#12289;<span class="emphasis"><em>&#12414;&#12383;</em></span>
  &#12496;&#12452;&#12490;&#12522;&#12434;&#25552;&#20379;&#12375;&#12394;&#12356;&#12371;&#12392;&#12395;&#23550;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#25209;&#21028;&#12434;&#32154;&#12369;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12399;&#33258;&#20998;&#12391;&#12399;&#20309;&#12418;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#12289;
  50 &#20154;&#12411;&#12393;&#12364;&#24444;&#12434;&#25209;&#21028;&#12377;&#12427;&#36820;&#20449;&#12434;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#31169;&#12399;&#12381;&#12428;&#12434;&#35211;&#12390;&#12418;&#12289;&#12392;&#12367;&#12395;&#27671;&#12395;&#30149;&#12416;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  <span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a></span>
  &#12398; <a class="xref" href="setting-tone.html#prevent-rudeness" title="&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;">&#12300;&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12383;&#12289;
  &#22833;&#31036;&#12394;&#20154;&#12395;&#23550;&#12377;&#12427;&#12300;&#12476;&#12525;&#12488;&#12524;&#12521;&#12531;&#12473;  (&#24773;&#12369;&#23481;&#36198;&#12394;&#12367;)&#12301;&#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12399;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#32153;&#32154;&#30340;&#12395;&#12363;&#12363;&#12431;&#12426;&#32154;&#12369;&#12427;&#20154;&#12383;&#12385;&#12395;&#23550;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#30456;&#25163;&#12364;&#12383;&#12384;&#21336;&#12395;&#19981;&#28288;&#12434;&#12406;&#12385;&#12414;&#12369;&#12390;&#12356;&#12427;&#12384;&#12369;&#12394;&#12435;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12431;&#12363;&#12387;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;
  &#24444;&#12395;&#23550;&#12375;&#12390;&#27671;&#37197;&#12426;&#12434;&#12375;&#12390;&#12418;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
</p><p>
  &#24184;&#12356;&#12394;&#12371;&#12392;&#12395;&#12289;&#12371;&#12435;&#12394;&#29366;&#27841;&#12395;&#12394;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21021;&#24515;&#32773;&#12395;&#23550;&#12375;&#12390;&#12418;&#12424;&#12426;&#24314;&#35373;&#30340;&#12394;&#23550;&#24540;&#12434;&#24515;&#12364;&#12369;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
  &#12414;&#12378;&#12371;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#12354;&#12426;&#12360;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="Meeting In Person (Conferences, Hackfests, Code-a-Thons, Code Sprints, Retreats)"><div class="titlepage"><div><div><h3 class="title"><a name="meeting-in-person"></a>Meeting In Person (Conferences, Hackfests, Code-a-Thons, Code Sprints, Retreats)</h3></div></div></div><p><span class="emphasis"><em>24 March 2013: If you're reading this note, then
you've encountered this section while it's undergoing substantial
revision; see <a class="ulink" href="http://producingoss.com/v2.html" target="_top">producingoss.com/v2.html</a> for details.</em></span></p><p>poss2 tbd</p><p> <span class="emphasis"><em>Some examples to use: Ubuntu community sprints, Adam
Hyde's flossmanuals doc sprints, and the Danese/Noel-style public
hackathons.  Distinguish between purely dev events and
dev+user+funder+enterprise events &#8212; all are
useful, but don't confuse audiences.</em></span>
</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2631824" href="#idp2631824" class="para">30</a>] </sup>
      &#12371;&#12398;&#30097;&#21839;&#12395;&#12388;&#12356;&#12390;&#35443;&#12375;&#12367;&#35519;&#26619;&#12375;&#12383;&#12392;&#12371;&#12429;&#12289;&#33288;&#21619;&#28145;&#12356;&#32080;&#26524;&#12364;&#12391;&#12414;&#12375;&#12383;&#12290;
      Karim Lakhani &#12392; Robert G. Wolf &#12395;&#12424;&#12427;&#35542;&#25991;
      <em class="citetitle">Why Hackers Do What They Do: Understanding
      Motivation and Effort in Free/Open Source Software
      Projects</em>
      &#12395;&#12414;&#12392;&#12417;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
      <a class="ulink" href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf" target="_top">http://freesoftware.mit.edu/papers/lakhaniwolf.pdf</a>
      &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp2661632" href="#idp2661632" class="para">31</a>] </sup>
      &#12375;&#12363;&#12375;&#12289;<a class="ulink" href="http://groups.google.com/group/sage-devel/browse_thread/thread/e207ce2206f0beee" target="_top">http://groups.google.com/group/sage-devel/browse_thread/thread/e207ce2206f0beee</a>
      &#12398; <em class="citetitle">"having authors names in .py files"</em> &#12392;&#12356;&#12358;&#12473;&#12524;&#12483;&#12489;&#12289;&#29305;&#12395;
      William Stein &#12398;&#25237;&#31295;&#12399;&#12289;&#12381;&#12398;&#21453;&#35542;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#31169;&#12364;&#24605;&#12358;&#12395;&#12289;&#12371;&#12398;&#22580;&#21512;&#12398;&#12461;&#12540;&#12392;&#12394;&#12427;&#12398;&#12399;&#12289;
      &#20316;&#32773;&#12398;&#22810;&#12367;&#12364;&#12300;&#12477;&#12540;&#12473;&#12395;&#30452;&#25509;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#26360;&#12367;&#12398;&#12364;&#24403;&#28982;&#12391;&#12354;&#12426;&#12289;
      &#12381;&#12428;&#12364;&#39640;&#12367;&#35413;&#20385;&#12373;&#12428;&#12427;&#12301;&#12392;&#12356;&#12358;&#25991;&#21270; (&#25968;&#23398;&#32773;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;)
      &#12398;&#20986;&#36523;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
      &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12395;&#20316;&#32773;&#21517;&#12434;&#22475;&#12417;&#36796;&#12435;&#12391;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#12381;&#12375;&#12390;&#20491;&#12293;&#12398;&#20316;&#32773;&#12364;&#20855;&#20307;&#30340;&#12395;&#20309;&#12434;&#12375;&#12383;&#12398;&#12363;&#12434;&#27491;&#30906;&#12395;&#35352;&#36617;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
      &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#20170;&#24460;&#26032;&#12383;&#12395;&#38283;&#30330;&#12395;&#21152;&#12431;&#12427;&#20154;&#12383;&#12385;&#12395;&#12418;
      &#12300;&#12381;&#12358;&#12356;&#12358;&#12418;&#12398;&#12394;&#12435;&#12384;&#12301;&#12392;&#35469;&#35672;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp2764224" href="#idp2764224" class="para">32</a>] </sup>
      &#26082;&#23384;&#12398;&#12486;&#12473;&#12488;&#12434;&#12377;&#12409;&#12390;&#26032;&#12375;&#12356;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#31227;&#34892;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#20001;&#32773;&#12434;&#20849;&#23384;&#12373;&#12379;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#24517;&#35201;&#12395;&#12394;&#12387;&#12383;&#12418;&#12398;&#12384;&#12369;&#12434;&#26032;&#12375;&#12356;&#24418;&#24335;&#12395;&#22793;&#25563;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="releases-and-daily-development.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="share-management.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;</td></tr></table></div></body></html>
