<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="funding-non-programming.html" title="&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;"><link rel="next" href="hiring.html" title="Hiring Open Source Developers"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="funding-non-programming.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="hiring.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="marketing"></a>&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;</h2></div></div></div><p>
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12399;&#35469;&#12417;&#12383;&#12364;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    &#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12399;&#24441;&#12395;&#31435;&#12388;&#12418;&#12398;&#12391;&#12377;&#12290;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#27963;&#21205;&#12434;&#12358;&#12414;&#12367;&#12420;&#12428;&#12400;&#12289;
    &#38957;&#12398;&#22266;&#12356;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#29702;&#30001;&#12418;&#12424;&#12367;&#12431;&#12363;&#12425;&#12394;&#12356;&#12398;&#12395;&#12289;
    &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#23550;&#12375;&#12390;&#33391;&#12356;&#21360;&#35937;&#12434;&#25345;&#12388;&#12367;&#12425;&#12356;&#12395;&#12414;&#12391;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#30028;&#38536;&#12398;&#35413;&#21028;&#12434;&#20316;&#12426;&#20986;&#12377;&#12371;&#12392;&#12364;<span class="emphasis"><em>&#12391;&#12365;&#12414;&#12377;</em></span>&#12290;
    &#12371;&#12371;&#12391;&#12399;&#12289;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12395;&#12362;&#12369;&#12427;&#31478;&#20105;&#21147;&#23398;&#12434;&#19968;&#33324;&#30340;&#12395;&#20998;&#26512;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12395;&#38306;&#12431;&#12387;&#12390;&#12356;&#12427;&#20225;&#26989;&#12399;&#32080;&#23616;&#12289;&#20225;&#26989;&#33258;&#20307;&#12420;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12289;
    &#12381;&#12375;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#20225;&#26989;&#12398;&#38306;&#20418;&#12434;&#12393;&#12358;&#12420;&#12387;&#12390;&#22770;&#12426;&#36796;&#12435;&#12391;&#12356;&#12367;&#12363;&#12289;&#12434;&#32771;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#20197;&#19979;&#12391;&#12399;&#12289;&#12371;&#12358;&#12375;&#12383;&#21162;&#21147;&#12434;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#38501;&#12426;&#12364;&#12385;&#12394;&#19968;&#33324;&#30340;&#12394;&#33853;&#12392;&#12375;&#31348;&#12395;&#12388;&#12356;&#12390;&#35299;&#35500;&#12375;&#12414;&#12377;&#12290;
    <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12398; </span> <a class="xref" href="publicity.html" title="&#23459;&#20253;&#12539;&#24195;&#22577;">&#12300;&#23459;&#20253;&#12539;&#24195;&#22577;&#12301;</a> &#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><div class="sect2" title="&#35211;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24847;&#35672;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="goldfish-bowl"></a>&#35211;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24847;&#35672;&#12377;&#12427;</h3></div></div></div><p>
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12434;&#12354;&#12394;&#12383;&#12398;&#21619;&#26041;&#12395;&#20184;&#12369;&#12427;&#12395;&#12399;&#12289;
    &#12399;&#12387;&#12365;&#12426;&#12375;&#12390;&#12356;&#12394;&#12356;&#20107;&#26564;&#12399;&#21899;&#12425;&#12394;&#12356;&#12371;&#12392;&#12364; <span class="emphasis"><em>&#12392;&#12390;&#12418;</em></span> &#37325;&#35201;&#12391;&#12377;&#12290;
    &#12377;&#12409;&#12390;&#12398;&#20027;&#24373;&#12434;&#20844;&#12395;&#12377;&#12427;&#21069;&#12395;&#27880;&#24847;&#28145;&#12367;&#35519;&#12409;&#12289;&#12381;&#12398;&#20027;&#24373;&#33258;&#20307;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#25163;&#27573;&#12418;&#20844;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
    &#29420;&#33258;&#12395;&#20107;&#23455;&#12434;&#26908;&#35388;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#37325;&#35201;&#12394;&#37096;&#20998;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12399;&#12467;&#12540;&#12489;&#20197;&#22806;&#12398;&#37096;&#20998;&#12395;&#12418;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#24403;&#28982;&#12398;&#12371;&#12392;&#12394;&#12364;&#12425;&#12289;&#26908;&#35388;&#12391;&#12365;&#12394;&#12356;&#20027;&#24373;&#12434;&#12377;&#12427;&#12394;&#12392;&#20225;&#26989;&#12395;&#12450;&#12489;&#12496;&#12452;&#12473;&#12377;&#12427;&#20154;&#12394;&#12393;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12392;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#27963;&#21205;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;
    &#20027;&#24373;&#12434;&#26908;&#35388;&#12377;&#12427;&#32076;&#39443;&#12395;&#38263;&#12369;&#12383;&#20154;&#12364;&#38750;&#24120;&#12395;&#22810;&#12367;&#12356;&#12414;&#12377;&#8212;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#24195;&#12356;&#24111;&#22495;&#12398;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#25509;&#32154;&#22238;&#32218;&#12434;&#25345;&#12385;&#12289;
    &#29289;&#20107;&#12434;&#20013;&#20663;&#12377;&#12427;&#12383;&#12417;&#12395;&#31038;&#20250;&#30340;&#25509;&#35302;&#12434;&#25345;&#12388;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#20154;&#12364;&#22823;&#21218;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#21270;&#23398;&#24037;&#26989;&#12398;&#24040;&#22823;&#20225;&#26989;&#12364;&#24029;&#12434;&#27738;&#26579;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12381;&#12428;&#12399;&#26908;&#35388;&#21487;&#33021;&#12391;&#12377;&#12364;&#12289;
    &#26908;&#35388;&#12391;&#12365;&#12427;&#12398;&#12399;&#35347;&#32244;&#12434;&#21463;&#12369;&#12383;&#31185;&#23398;&#32773;&#12398;&#12415;&#12391;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#24040;&#22823;&#20225;&#26989;&#12398;&#31185;&#23398;&#32773;&#12363;&#12425;&#21453;&#35542;&#12373;&#12428;&#12289;
    &#38957;&#12434;&#12363;&#12365;&#12416;&#12375;&#12387;&#12390;&#12393;&#12358;&#32771;&#12360;&#12383;&#12425;&#12424;&#12356;&#12398;&#12363;&#22256;&#24785;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#19968;&#26041;&#12391;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12391;&#12354;&#12394;&#12383;&#12364;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#30446;&#12395;&#35211;&#12360;&#12427;&#24418;&#12391;&#35352;&#37682;&#12373;&#12428;&#12427;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#22810;&#12367;&#12398;&#20154;&#12364;&#29420;&#31435;&#12375;&#12390;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;
    &#29420;&#33258;&#12398;&#32080;&#35542;&#12434;&#19979;&#12375;&#12289;&#12381;&#12428;&#12425;&#12434;&#21475;&#12467;&#12511;&#12391;&#24195;&#12417;&#12390;&#12356;&#12367;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#21475;&#12467;&#12511;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12399;&#26082;&#12395;&#23450;&#30528;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#24433;&#38911;&#12377;&#12427;&#12363;&#12434;&#27770;&#12417;&#12427;&#35201;&#32032;&#12391;&#12354;&#12426;&#12289;
    &#12354;&#12425;&#12422;&#12427;&#31278;&#39006;&#12398;&#24773;&#22577;&#12434;&#20253;&#12360;&#12427;&#12398;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;&#21453;&#35542;&#12399;&#19981;&#21487;&#33021;&#12391;&#12399;&#12394;&#12356;&#12395;&#12375;&#12390;&#12418;&#12289;
    &#29305;&#12395;&#20154;&#12293;&#12364;&#35328;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#20107;&#23455;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#26222;&#36890;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12383;&#12392;&#12360;&#12400;&#12289;"&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;X&#12434;&#20316;&#12387;&#12383;" &#12392;&#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12364;&#35328;&#12358;&#12398;&#12399;&#12289;
    &#23455;&#38555;&#12395;&#12381;&#12358;&#12375;&#12383;&#12398;&#12391;&#12354;&#12428;&#12400;&#21839;&#38988;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12289;
    &#23455;&#38555;&#12395;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12383;&#12398;&#12364;&#22806;&#37096;&#12398;&#20154;&#38291;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;
    "X&#12392;&#12356;&#12358;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12387;&#12383;" &#12392;&#35328;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#36870;&#12395;&#12289;&#35504;&#12363;&#12364;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#20013;&#36523;&#12434;&#35223;&#12356;&#12390;&#12415;&#12390;&#12289;
    &#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#20197;&#22806;&#12398;&#20154;&#12364;&#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#36321;&#12364;&#27526;&#12393;&#12414;&#12383;&#12399;&#20840;&#12367;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#28145;&#12367;&#38306;&#19982;&#12375;&#12390;&#12356;&#12427;&#12392;&#20027;&#24373;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12381;&#12428;&#12411;&#12393;&#26132;&#12398;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12392;&#12390;&#12418;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#20250;&#31038;&#12364;&#12289;
    &#37325;&#35201;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#19979;&#12391;&#20844;&#38283;&#12375;&#12383;&#12289;
    &#12392;&#12356;&#12358;&#12450;&#12490;&#12454;&#12531;&#12473;&#12434;&#35211;&#12414;&#12375;&#12383;&#12290;&#12399;&#12376;&#12417;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#12364;&#20986;&#12383;&#24460;&#12289;
    &#31169;&#12399;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#35211;&#12390;&#12415;&#12414;&#12375;&#12383;&#12364;&#12289;
    &#12381;&#12371;&#12395;&#12399;3&#12388;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12375;&#12363;&#23384;&#22312;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
    &#35328;&#12356;&#25563;&#12360;&#12428;&#12400;&#12289;&#24444;&#12425;&#12399;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;&#12434;&#32066;&#12360;&#12383;&#12371;&#12392;&#20197;&#22806;&#12399;&#20309;&#12418;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#33258;&#20307;&#12399;&#22793;&#12394;&#20107;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#8212;
    &#12384;&#12387;&#12390;&#32080;&#23616;&#24444;&#12425;&#12399;&#12450;&#12490;&#12454;&#12531;&#12473;&#12375;&#12383;&#12384;&#12369;&#12391;&#12377;&#12363;&#12425;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12377;&#12368;&#12395;&#27963;&#30330;&#12394;&#38283;&#30330;&#12364;&#34892;&#12431;&#12428;&#12427;&#12392;&#26399;&#24453;&#12377;&#12427;&#29702;&#30001;&#12399;&#20309;&#12418;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12375;&#12400;&#12425;&#12367;&#12383;&#12387;&#12390;&#12363;&#12425;&#12289;&#21029;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;&#20197;&#19979;&#12395;&#12381;&#12428;&#12434;&#31034;&#12375;&#12414;&#12377;&#12364;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12490;&#12531;&#12496;&#12540;&#12392;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#21517;&#21069;&#12399;&#21029;&#12398;&#12418;&#12398;&#12395;&#32622;&#12365;&#25563;&#12360;&#12390;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Singer &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12424;&#12387;&#12390;&#21427;&#23494;&#12395;&#12486;&#12473;&#12488;&#12373;&#12428;&#12383;&#24460;&#12289;
    Singer 5&#12398; Linux &#29256;&#12392; Windows &#29256;&#12364;&#12289;
    &#35069;&#21697;&#12392;&#12375;&#12390;&#12398;&#20351;&#29992;&#12395;&#32784;&#12360;&#12427;&#21697;&#36074;&#12395;&#12394;&#12387;&#12383;&#12371;&#12392;&#12434;&#30330;&#34920;&#12375;&#12414;&#12377;&#12290;</em></span></p></blockquote></div><p>
    "&#21427;&#23494;&#12394;&#12486;&#12473;&#12488;" &#12395;&#12424;&#12387;&#12390;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#26126;&#12425;&#12363;&#12395;&#12375;&#12383;&#12371;&#12392;&#12434;&#30693;&#12426;&#12383;&#12356;&#12392;&#24605;&#12356;&#12289;
    &#31169;&#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#20877;&#24230;&#35211;&#12395;&#34892;&#12387;&#12390;&#26368;&#36817;&#12398;&#22793;&#26356;&#23653;&#27508;&#12434;&#35223;&#12356;&#12390;&#12415;&#12414;&#12375;&#12383;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#33258;&#20307;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12399;3&#12398;&#12414;&#12414;&#12391;&#12375;&#12383;&#12290;&#26126;&#12425;&#12363;&#12395;&#12289;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12399;&#12522;&#12522;&#12540;&#12473;&#21069;&#12395;&#20462;&#27491;&#12377;&#12409;&#12365;&#12496;&#12464;&#12434; <span class="emphasis"><em>&#12402;&#12392;&#12388;&#12418;</em></span> &#35211;&#12388;&#12369;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#65281;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12424;&#12427;&#12486;&#12473;&#12488;&#32080;&#26524;&#12364;&#12393;&#12371;&#12363;&#12395;&#35352;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12399;&#12378;&#12384;&#12392;&#32771;&#12360;&#12390;&#12289;
    &#31169;&#12399;&#27425;&#12395;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#35519;&#12409;&#12390;&#12415;&#12414;&#12375;&#12383;&#12290;&#12381;&#12371;&#12395;&#12399;&#30906;&#12363;&#12395;6&#12388;&#12398;&#21839;&#38988;&#12364;&#35352;&#37682;&#12373;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;
    &#12381;&#12398;&#12358;&#12385;&#12398;4&#12388;&#12399;&#25968;&#12534;&#26376;&#12398;&#38291;&#20445;&#30041;&#29366;&#24907;&#12398;&#12414;&#12414;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12428;&#12399;&#21247;&#35542;&#20449;&#12376;&#12364;&#12383;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12486;&#12473;&#12479;&#12540;&#12364;&#24040;&#22823;&#12363;&#12388;&#35079;&#38609;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12381;&#12428;&#12394;&#12426;&#12398;&#26178;&#38291;&#20351;&#12360;&#12400;&#12289;
    &#24444;&#12425;&#12399;&#12496;&#12464;&#12434;&#35211;&#12388;&#12369;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12381;&#12358;&#12375;&#12383;&#12496;&#12464;&#12364;&#27425;&#22238;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12486;&#12473;&#12488;&#12398;&#32080;&#26524;&#12392;&#12375;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#12398;&#27963;&#21205;&#12363;&#12289;
    &#26032;&#12375;&#12356;&#21839;&#38988;&#12364;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#26399;&#24453;&#12373;&#12428;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12393;&#12371;&#12434;&#35211;&#12390;&#12418;&#12289;&#12399;&#12376;&#12417;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#12392;&#12289;
    &#12381;&#12398;&#27425;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#12392;&#12398;&#38291;&#12395;&#27963;&#21205;&#12398;&#36321;&#12399;&#12415;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;  
</p><p>
    &#21839;&#38988;&#12399;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12486;&#12473;&#12488;&#12375;&#12383;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#12289;&#20225;&#26989;&#12364;&#22040;&#12434;&#12388;&#12356;&#12383;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12486;&#12473;&#12488;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12399;&#31169;&#12395;&#12399;&#20998;&#12363;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#24444;&#12425;&#12364;&#35328;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12393;&#12428;&#12367;&#12425;&#12356;&#22040;&#12387;&#12413;&#12356;&#12363;&#12399;&#26126;&#12425;&#12363;&#12391;&#12375;&#12383;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12418;&#12289;
    &#21427;&#23494;&#12394;&#12486;&#12473;&#12488;&#12364;&#34892;&#12431;&#12428;&#12383;&#12371;&#12392;&#12434;&#31034;&#12377;&#30165;&#36321;&#12399;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12289;
    &#20225;&#26989;&#12399;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12486;&#12473;&#12488;&#12375;&#12383;&#12392;&#12356;&#12358;&#20027;&#24373;&#12434;&#12375;&#12394;&#12356;&#12363;&#12289;
    &#30446;&#12395;&#35211;&#12360;&#12427;&#24418;&#12398;&#12486;&#12473;&#12488;&#32080;&#26524;&#12408;&#12398;&#12522;&#12531;&#12463; ("278&#20491;&#12398;&#12496;&#12464;&#12364;&#30330;&#35211;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#35443;&#32048;&#12399;&#12371;&#12371;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;") &#12434;&#25552;&#20379;&#12377;&#12409;&#12365;&#12391;&#12375;&#12383;&#12290;
    &#24460;&#32773;&#12399;&#35504;&#12391;&#12418;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#27963;&#21205;&#12524;&#12505;&#12523;&#12434;&#32032;&#26089;&#12367;&#25226;&#25569;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#23455;&#38555;&#12399;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12486;&#12473;&#12488;&#12375;&#12383;&#12371;&#12392;&#12434;&#25506;&#12377;&#12398;&#12395;2&#12289;3&#20998;&#12375;&#12363;&#12363;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12375;&#12289;
    &#26222;&#36890;&#12394;&#12425;&#35352;&#37682;&#12373;&#12428;&#12427;&#22580;&#25152;&#12395;&#12289;&#12486;&#12473;&#12488;&#12398;&#30165;&#36321;&#12364;&#20840;&#12367;&#27531;&#12387;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#26908;&#35388;&#12377;&#12427;&#12398;&#12395;&#22823;&#12375;&#12383;&#25163;&#38291;&#12399;&#12363;&#12363;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;
    &#25163;&#38291;&#12434;&#12363;&#12369;&#12383;&#12398;&#12399;&#31169;&#12384;&#12369;&#12391;&#12399;&#12394;&#12356;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><p>
     &#36879;&#26126;&#24615;&#12392;&#26908;&#35388;&#21487;&#33021;&#24615;&#12399;&#12289;&#27491;&#30906;&#12394;&#12463;&#12524;&#12472;&#12483;&#12488;&#12434;&#19982;&#12360;&#12427;&#12392;&#12365;&#12418;&#21247;&#35542;&#37325;&#35201;&#12391;&#12377;&#12290;
     &#35443;&#12375;&#12367;&#12399;&#12289;<span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398; </span><a class="xref" href="credit.html" title="&#12463;&#12524;&#12472;&#12483;&#12488;">&#12300;&#12463;&#12524;&#12472;&#12483;&#12488;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="&#31478;&#21512;&#12377;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25915;&#25731;&#12375;&#12394;&#12356;"><div class="titlepage"><div><div><h3 class="title"><a name="competing-products"></a>&#31478;&#21512;&#12377;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25915;&#25731;&#12375;&#12394;&#12356;</h3></div></div></div><p>
    &#31478;&#21512;&#12377;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12289;&#21542;&#23450;&#30340;&#12394;&#24847;&#35211;&#12434;&#36848;&#12409;&#12427;&#12398;&#12399;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#21542;&#23450;&#30340;&#12394; <span class="emphasis"><em>&#20107;&#23455;</em></span> &#12395;&#12388;&#12356;&#12390;&#12399;&#19968;&#21521;&#12395;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#8212; &#23481;&#26131;&#12395;&#35023;&#12364;&#21462;&#12428;&#12427;&#20027;&#24373;&#12399;&#12289;&#27604;&#36611;&#12398;&#35201;&#32032;&#12392;&#12375;&#12390;&#12424;&#12367;&#35211;&#12425;&#12428;&#12427;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12354;&#12356;&#12414;&#12356;&#12394;&#20107;&#26564;&#12395;&#23550;&#12375;&#12390;&#21542;&#23450;&#30340;&#12394;&#35413;&#20385;&#12434;&#34892;&#12358;&#12371;&#12392;&#12399;&#36991;&#12369;&#12383;&#26041;&#12364;&#33391;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#29702;&#30001;&#12399;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12414;&#12378;&#12289;&#12381;&#12428;&#12364;&#12365;&#12387;&#12363;&#12369;&#12391;&#24314;&#35373;&#30340;&#12391;&#12394;&#12356;&#12501;&#12524;&#12540;&#12512;&#12454;&#12457;&#12540;&#12364;&#36215;&#12371;&#12426;&#12364;&#12385;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12399;&#12289;&#12418;&#12387;&#12392;&#37325;&#35201;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
    <span class="emphasis"><em>&#12354;&#12394;&#12383;&#12398;</em></span> &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12356;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12398;&#20013;&#12363;&#12425;&#12418;&#12289;
    &#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20685;&#12367;&#20154;&#12364;&#20986;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#21069;&#32773;&#12424;&#12426;&#12289;&#24460;&#32773;&#12398;&#26041;&#12364;&#22810;&#12367;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#39640;&#12356;&#12391;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#26082;&#12395;&#21516;&#12376;&#23554;&#38272;&#38936;&#22495;&#12395;&#23646;&#12375;&#12390;&#12356;&#12390;(&#12381;&#12428;&#12422;&#12360;&#12395;&#31478;&#21512;&#38306;&#20418;&#12395;&#12354;&#12426;&#12414;&#12377;)&#12289;
    &#12381;&#12398;&#38936;&#22495;&#12391;&#23554;&#38272;&#30693;&#35672;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12399;&#12289;
    &#12381;&#12428;&#12434;&#29983;&#12363;&#12379;&#12427;&#22580;&#25152;&#12391;&#12354;&#12428;&#12400;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#36002;&#29486;&#12375;&#12390;&#12424;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#30452;&#25509;&#30340;&#12395;&#12399;&#38283;&#30330;&#32773;&#12364;&#37325;&#35079;&#12375;&#12390;&#12356;&#12394;&#12356;&#29366;&#27841;&#12391;&#12418;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12356;&#12427;&#38283;&#30330;&#32773;&#12364;&#12289;
    &#38306;&#36899;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12398;&#24314;&#35373;&#30340;&#12394;&#20154;&#38291;&#38306;&#20418;&#12434;&#32173;&#25345;&#12377;&#12427;&#33021;&#21147;&#12364;&#12289;
    &#21542;&#23450;&#30340;&#12394;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12424;&#12387;&#12390;&#20840;&#12390;&#22730;&#12428;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12384;&#12387;&#12390;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290; 
</p><p>
    &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12364;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25915;&#25731;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#29305;&#12395;&#12381;&#12398;&#35069;&#21697;&#12364;&#12510;&#12452;&#12463;&#12525;&#12477;&#12501;&#12488;&#35069;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12391;&#12399;&#24195;&#12367;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#20491;&#20154;&#30340;&#12395;&#12399;&#12289;&#12371;&#12398;&#20670;&#21521;&#12399; (&#21336;&#20992;&#30452;&#20837;&#12395;&#20107;&#23455;&#12434;&#27604;&#36611;&#12377;&#12427;&#12398;&#12391;&#12354;&#12428;&#12400;&#19968;&#21521;&#12395;&#27083;&#12431;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;)
    &#27531;&#24565;&#12395;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12371;&#12428;&#12399;&#30456;&#25163;&#12395;&#22833;&#31036;&#12391;&#12354;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#33258;&#12425;&#20316;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12398;&#35463;&#22823;&#24195;&#21578;&#12434;&#20449;&#12376;&#12289;
    &#12381;&#12428;&#12422;&#12360;&#12395;&#31478;&#21512;&#30456;&#25163;&#12364;&#23455;&#38555;&#12395;&#20778;&#12428;&#12390;&#12356;&#12427;&#28857;&#12434;&#28961;&#35222;&#12375;&#22987;&#12417;&#12427;&#12398;&#12364;&#21361;&#38522;&#12391;&#12418;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#19968;&#33324;&#30340;&#12395;&#12399;&#12289;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12289;
    &#33258;&#20998;&#12383;&#12385;&#12398;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12418;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12418;&#12398;&#12363;&#12393;&#12358;&#12363;&#12434;&#27880;&#24847;&#12375;&#12390;&#12362;&#12367;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12395;&#12362;&#37329;&#12364;&#20351;&#12431;&#12428;&#12427;&#12392;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#36948;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#25345;&#12387;&#12390;&#12356;&#12427;&#26412;&#24403;&#12398;&#24375;&#12415;&#12420;&#24369;&#28857;&#12434;&#12289;
    &#23458;&#35251;&#30340;&#12394;&#30524;&#12391;&#35211;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12383;&#12417;&#12289;&#20225;&#26989;&#12398;&#38283;&#30330;&#32773;&#12399;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#19978;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#23550;&#12375;&#12390;&#12289;
    &#20844;&#12398;&#12501;&#12457;&#12540;&#12521;&#12512;&#19978;&#12391;&#12373;&#12360;&#12354;&#12427;&#31278;&#28961;&#38306;&#24515;&#12394;&#24907;&#24230;&#12434;&#31034;&#12377;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12375;&#12289;
    &#12416;&#12375;&#12429;&#12381;&#12428;&#12364;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12399;&#12387;&#12365;&#12426;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;&#20225;&#26989;&#12398;&#38283;&#30330;&#32773;&#12399;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12395;&#12424;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#23550;&#12375;&#12390;&#12289;
    &#20844;&#12398;&#22580;&#12391;&#30683;&#30462;&#12375;&#12383;&#24907;&#24230;&#12434;&#30452;&#25509;&#31034;&#12375;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356; (&#20294;&#12375;&#12289;
    &#12381;&#12428;&#12364;&#23455;&#38555;&#12395;&#38291;&#36949;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12398;&#12394;&#12425;&#21029;&#12391;&#12377;&#12364;&#12289;
    &#12381;&#12398;&#25163;&#12398;&#20107;&#23455;&#12399;&#26089;&#12356;&#27573;&#38542;&#12363;&#12425;&#12431;&#12363;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;) &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20225;&#26989;&#12398;&#38283;&#30330;&#32773;&#12399;&#12381;&#12358;&#12375;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12493;&#12479;&#12392;&#12375;&#12390;&#25201;&#12356;&#12289;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12434;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12363;&#12425;&#29694;&#23455;&#12395;&#24341;&#12365;&#25147;&#12377;&#25163;&#27573;&#12395;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="funding-non-programming.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="hiring.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> Hiring Open Source Developers</td></tr></table></div></body></html>
