<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="non-profit.html" title="Joining or Creating a Non-Profit Organization"><link rel="next" href="types-of-involvement.html" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="non-profit.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="types-of-involvement.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><div class="titlepage"><div><div><h2 class="title"><a name="money"></a>&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="money.html#crowdfunding">Crowdfunding: Kickstarter, etc</a></span></dt><dt><span class="sect1"><a href="types-of-involvement.html">&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;</a></span></dt><dt><span class="sect1"><a href="long-term-developers.html">&#38283;&#30330;&#32773;&#12434;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#38599;&#29992;&#12377;&#12427;</a></span></dt><dt><span class="sect1"><a href="appear-as-many.html">&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;</a></span></dt><dt><span class="sect1"><a href="open-motives.html">&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;</a></span></dt><dt><span class="sect1"><a href="money-vs-love.html">&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;</a></span></dt><dt><span class="sect1"><a href="contracting.html">&#22865;&#32004;&#12377;&#12427;</a></span></dt><dd><dl><dt><span class="sect2"><a href="contracting.html#community-review-acceptance">&#12524;&#12499;&#12517;&#12540;&#12434;&#34892;&#12356;&#12289;&#22793;&#26356;&#12434;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#21462;&#12426;&#20837;&#12428;&#12427;</a></span></dt><dd><dl><dt><span class="sect3"><a href="contracting.html#cvs-pserver">&#12465;&#12540;&#12473;&#12473;&#12479;&#12487;&#12451;: CVS &#12497;&#12473;&#12527;&#12540;&#12489;&#35469;&#35388;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#22580;&#21512;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="funding-non-programming.html">&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20197;&#22806;&#12398;&#27963;&#21205;&#12434;&#25903;&#25588;&#12377;&#12427;</a></span></dt><dd><dl><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-qa">&#21697;&#36074;&#20445;&#35388; (&#12486;&#12473;&#12488;&#12398;&#23554;&#38272;&#23478;&#12394;&#12393;)</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-legal">&#27861;&#24459;&#19978;&#12398;&#21161;&#35328;&#12289;&#27177;&#21033;&#12398;&#20445;&#35703;</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-documentation-usability">&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12518;&#12540;&#12470;&#12499;&#12522;&#12486;&#12451;&#12398;&#25913;&#21892;</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-hosting">&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12420;&#25509;&#32154;&#22238;&#32218;&#12434;&#25552;&#20379;&#12377;&#12427;</a></span></dt></dl></dd><dt><span class="sect1"><a href="marketing.html">&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;</a></span></dt><dd><dl><dt><span class="sect2"><a href="marketing.html#goldfish-bowl">&#35211;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24847;&#35672;&#12377;&#12427;</a></span></dt><dt><span class="sect2"><a href="marketing.html#competing-products">&#31478;&#21512;&#12377;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25915;&#25731;&#12375;&#12394;&#12356;</a></span></dt></dl></dd><dt><span class="sect1"><a href="hiring.html">Hiring Open Source Developers</a></span></dt><dt><span class="sect1"><a href="bounties.html">Bounties</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>
    &#12371;&#12398;&#31456;&#12391;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#38283;&#30330;&#12377;&#12427;&#12383;&#12417;&#12395;&#12362;&#37329;&#12434;&#35519;&#36948;&#12377;&#12427;&#26041;&#27861;&#12434;&#35519;&#12409;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12362;&#37329;&#12434;&#36016;&#12387;&#12390;&#38599;&#12431;&#12428;&#12427;&#38283;&#30330;&#32773;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#38283;&#30330;&#12377;&#12427;&#29872;&#22659;&#12364;&#32622;&#12363;&#12428;&#12427;&#31038;&#20250;&#21147;&#23398;&#12434;&#29702;&#35299;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#31649;&#29702;&#32773;&#12418;&#23550;&#35937;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#20197;&#19979;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#35501;&#32773;(&#12354;&#12394;&#12383;&#12391;&#12377;&#65281;) &#12399;&#12362;&#37329;&#12434;&#36016;&#12387;&#12390;&#38599;&#12431;&#12428;&#12427;&#38283;&#30330;&#32773;&#12363;&#12289;
    &#38283;&#30330;&#32773;&#12434;&#31649;&#29702;&#12377;&#12427;&#20154;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#24819;&#23450;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#31456;&#12391;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12289;&#20001;&#32773;&#12395;&#24403;&#12390;&#12399;&#12414;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;&#12381;&#12358;&#12391;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#23550;&#35937;&#12392;&#12394;&#12427;&#20154;&#12399;&#25991;&#33032;&#12398;&#20013;&#12391;&#26126;&#12425;&#12363;&#12395;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12395;&#20225;&#26989;&#12364;&#12362;&#37329;&#12434;&#20986;&#12377;&#12371;&#12392;&#12399;&#26032;&#12375;&#12356;&#29694;&#35937;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#22810;&#12367;&#12398;&#38283;&#30330;&#12364;&#12289;&#12356;&#12388;&#12418;&#38750;&#20844;&#24335;&#12395;&#22888;&#21169;&#37329;&#12398;&#23550;&#35937;&#12395;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12364;&#26989;&#21209;&#12398;&#36930;&#34892;&#12434;&#21161;&#12369;&#12427;&#12383;&#12417;&#12395;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#20998;&#26512;&#12484;&#12540;&#12523;&#12434;&#26360;&#12365;&#12289;
    &#12458;&#12531;&#12521;&#12452;&#12531;&#12395;&#12381;&#12428;&#12434;&#25237;&#31295;&#12375;&#12289;
    &#12496;&#12464;&#20462;&#27491;&#12420;&#27231;&#33021;&#36861;&#21152;&#12398;&#36002;&#29486;&#12434;&#20182;&#12398;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12363;&#12425;&#21463;&#12369;&#12383;&#22580;&#21512;&#12289;
    &#38750;&#20844;&#24335;&#12395;&#22243;&#20307;&#12364;&#35373;&#31435;&#12373;&#12428;&#12390;&#12356;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#22243;&#20307;&#12434;&#32173;&#25345;&#12377;&#12427;&#12383;&#12417;&#12398;&#36039;&#37329;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#36948;&#12398;&#32102;&#26009;&#12363;&#12425;&#20986;&#12390;&#12362;&#12426;&#12289;
    &#12458;&#12501;&#12451;&#12473;&#12473;&#12506;&#12540;&#12473;&#12420;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#24111;&#22495;&#12399;&#23492;&#20184;&#12395;&#12424;&#12387;&#12390;&#36036;&#12431;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#32068;&#32340;&#12399;&#12289;&#12399;&#12376;&#12417;&#12398;&#12358;&#12385;&#12399;&#21046;&#24230;&#30340;&#12395;&#35469;&#30693;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;
    &#12418;&#12385;&#12429;&#12435;&#25237;&#36039;&#12377;&#12427;&#12371;&#12392;&#12391;&#21033;&#30410;&#12434;&#24471;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#24403;&#26178;&#12392;&#20170;&#12398;&#36949;&#12356;&#12399;&#12289;&#12371;&#12358;&#12375;&#12383;&#21162;&#21147;&#12398;&#22810;&#12367;&#12364;&#20844;&#12395;&#35469;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20225;&#26989;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12363;&#12425;&#24471;&#12425;&#12428;&#12427;&#21033;&#30410;&#12395;&#38306;&#24515;&#12434;&#31034;&#12377;&#12424;&#12358;&#12395;&#12394;&#12426;&#12289;
    &#12381;&#12398;&#38283;&#30330;&#12395;&#30452;&#25509;&#38306;&#12431;&#12426;&#12399;&#12376;&#12417;&#12414;&#12375;&#12383;&#12290;
    &#38283;&#30330;&#32773;&#36948;&#12418;&#12289;&#26412;&#24403;&#12395;&#37325;&#35201;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#23492;&#20184;&#12420;&#12289;
    &#21487;&#33021;&#12391;&#12354;&#12428;&#12400;&#38263;&#26399;&#12398;&#12473;&#12509;&#12531;&#12469;&#12540;&#12434;&#26399;&#24453;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12362;&#37329;&#12364;&#12354;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22522;&#26412;&#30340;&#12394;&#38283;&#30330;&#21147;&#23398;&#12364;&#22793;&#12431;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#38283;&#30330;&#32773;&#12398;&#25968;&#12420;&#12289;&#38283;&#30330;&#32773;&#12402;&#12392;&#12426;&#24403;&#12383;&#12426;&#12398;&#20316;&#26989;&#37327;&#12398;&#35215;&#27169;&#12399;&#21127;&#30340;&#12395;&#22793;&#12431;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#12362;&#37329;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#32068;&#32340;&#21270;&#12373;&#12428;&#12427;&#26041;&#27861;&#12420;&#12289;
    &#38306;&#20418;&#32773;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12398;&#12420;&#12426;&#12392;&#12426;&#12398;&#20181;&#26041;&#12395;&#12418;&#24433;&#38911;&#12434;&#19982;&#12360;&#12414;&#12375;&#12383;&#12290;
    &#21839;&#38988;&#12399;&#12289;&#21336;&#12395;&#12362;&#37329;&#12364;&#12393;&#12358;&#20351;&#12431;&#12428;&#12427;&#12398;&#12363;&#12392;&#12363;&#12289;
    &#25237;&#36039;&#12395;&#23550;&#12377;&#12427;&#35211;&#36820;&#12426;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#28204;&#12427;&#12363;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12392;&#12393;&#12414;&#12425;&#12378;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#12420;&#12381;&#12398;&#12503;&#12525;&#12475;&#12473;&#12395;&#12418;&#21450;&#12403;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#20225;&#26989;&#12398;&#38542;&#23652;&#30340;&#12394;&#21629;&#20196;&#31995;&#32113;&#12392;&#12289;
    &#32233;&#12420;&#12363;&#12395;&#20998;&#25955;&#12375;&#12383;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12289;
    &#12362;&#20114;&#12356;&#12395;&#29983;&#29987;&#30340;&#12395;&#21205;&#12367;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#65311;
    &#12381;&#12418;&#12381;&#12418; "&#29983;&#29987;&#30340;&#12395;" &#12392;&#12356;&#12358;&#35328;&#33865;&#12364;&#12393;&#12358;&#12356;&#12358;&#24847;&#21619;&#12394;&#12398;&#12363;&#12289;
    &#12395;&#12388;&#12356;&#12390;&#20225;&#26989;&#12392;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12399;&#19968;&#33268;&#12377;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
</p><p>
    &#37329;&#37549;&#30340;&#12394;&#25903;&#25588;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#12399;&#19968;&#33324;&#30340;&#12395;&#27475;&#36814;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#25903;&#25588;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#36556;&#36947;&#12395;&#20055;&#12427;&#21069;&#12395;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#28528;&#12375;&#12390;&#12365;&#12383;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#24369;&#28857;&#12434;&#28961;&#31209;&#24207;&#12398;&#21147;&#12395;&#22793;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12422;&#12360;&#12395;&#12289;&#20154;&#12293;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#19990;&#12395;&#36865;&#12426;&#20986;&#12375;&#12383;&#12356;&#12392;&#24375;&#12367;&#39000;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#8212; &#12388;&#12414;&#12426;&#12289;&#12371;&#12428;&#12363;&#12425;&#21521;&#12371;&#12358;6&#12533;&#26376;&#38291;&#12399;&#33258;&#20998;&#12398;&#26178;&#38291;&#12434;&#12381;&#12371;&#12425;&#12408;&#12435;&#12395;&#36578;&#12364;&#12387;&#12390;&#12356;&#12427;&#20309;&#12363;&#12395;&#20351;&#12362;&#12358;&#12289;
    &#12392;&#20154;&#12293;&#12399;&#32771;&#12360;&#12427;&#12398;&#12391;&#12377;&#12290;&#32080;&#23616;&#12289;&#20309;&#12363;&#12434;&#20449;&#12376;&#12427;&#24515;&#12399;&#12289;&#12354;&#12427;&#31243;&#24230;&#12414;&#12391;&#12399;&#20182;&#12398;&#20154;&#12395;&#20253;&#26579;&#12375;&#12420;&#12377;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;IBM &#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25903;&#25588;&#12375;&#12383;&#12392;&#12365;&#12289;
    &#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#22833;&#25943;&#12399;&#35377;&#12373;&#12428;&#12394;&#12356;&#12392;&#20154;&#12293;&#12399;&#24375;&#12367;&#24605;&#12356;&#12414;&#12375;&#12383;&#12375;&#12289;
    &#22833;&#25943;&#12375;&#12394;&#12356;&#12424;&#12358;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#27880;&#21147;&#12375;&#12424;&#12358;&#12392;&#24605;&#12358;&#24515;&#12364;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23455;&#38555;&#12395;&#22833;&#25943;&#12375;&#12394;&#12356;&#29366;&#27841;&#12434;&#20316;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12289;&#12362;&#37329;&#12434;&#20986;&#12377;&#12371;&#12392;&#12399;&#12289;&#20154;&#12434;&#25903;&#37197;&#12377;&#12427;&#24863;&#35226;&#12434;&#29983;&#12416;&#12418;&#12398;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#27880;&#24847;&#28145;&#12367;&#25201;&#12431;&#12394;&#12356;&#12392;&#12289;&#12362;&#37329;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12289;&#20210;&#38291;&#20869;&#12398;&#38283;&#30330;&#32773;&#12392;&#12381;&#12358;&#12391;&#12394;&#12356;&#38283;&#30330;&#32773;&#12395;&#20998;&#35010;&#12373;&#12379;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12364;&#12289;&#19968;&#30058;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#27231;&#33021;&#36861;&#21152;&#12420;&#35373;&#35336;&#19978;&#12398;&#27770;&#23450;&#12434;&#34892;&#12360;&#12427;&#12435;&#12384;&#12392;&#24605;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    &#23455;&#21147;&#24535;&#21521;&#12364;&#24375;&#12367;&#12289;&#12381;&#12428;&#12391;&#12356;&#12390;&#20182;&#20154;&#12398;&#21033;&#30410;&#12398;&#12383;&#12417;&#12395;&#28961;&#32102;&#12391;&#20685;&#12367;&#12371;&#12392;&#12434;&#22909;&#12414;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#31227;&#12387;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12425;&#12399;&#12289;&#27770;&#12375;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#22823;&#22768;&#12391;&#19981;&#24179;&#12434;&#35328;&#12387;&#12383;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12398;&#12363;&#12431;&#12426;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#36948;&#12364;&#30495;&#21091;&#12395;&#21462;&#12426;&#32068;&#12416;&#12371;&#12392;&#12434;&#12420;&#12417;&#12390;&#12375;&#12414;&#12358;&#12383;&#12417;&#12289;
    &#22806;&#12363;&#12425;&#21475;&#12434;&#20986;&#12377;&#20154;&#12364;&#12393;&#12435;&#12393;&#12435;&#23569;&#12394;&#12367;&#12394;&#12387;&#12390;&#12356;&#12367;&#12384;&#12369;&#12391;&#12377;&#12290;
    &#12496;&#12464;&#22577;&#21578;&#12420;&#23567;&#35215;&#27169;&#12394;&#20462;&#27491;&#12434;&#12383;&#12414;&#12395;&#34892;&#12358;&#24418;&#12391;&#27963;&#21205;&#12399;&#32154;&#12365;&#12414;&#12377;&#12364;&#12289;
    &#22823;&#35215;&#27169;&#12394;&#12467;&#12540;&#12489;&#12398;&#36002;&#29486;&#12420;&#12289;&#35373;&#35336;&#19978;&#12398;&#35696;&#35542;&#12395;&#22806;&#37096;&#12363;&#12425;&#20154;&#12364;&#21442;&#21152;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12399;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#20154;&#12293;&#12399;&#33258;&#20998;&#12395;&#20309;&#12364;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#24863;&#12376;&#21462;&#12426;&#12289;&#26399;&#24453;&#12395;&#24540;&#12360;&#12424;&#12358;&#12392;&#21205;&#12356;&#12383;&#12426;&#12289;
    &#12381;&#12428;&#12434;&#35023;&#20999;&#12387;&#12383;&#12426;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;   
</p><p>
    &#12362;&#37329;&#12399;&#27880;&#24847;&#28145;&#12367;&#25201;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12381;&#12358;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#24433;&#38911;&#21147;&#12434;&#36023;&#12360;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;&#12289;&#36023;&#12360;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#30452;&#25509;&#24433;&#38911;&#21147;&#12434;&#34892;&#20351;&#12391;&#12365;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12289;&#12392;&#12356;&#12358;&#12398;&#12364;&#12511;&#12477;&#12391;&#12377;&#12290;
    &#21336;&#32020;&#12394;&#21830;&#21462;&#24341;&#12391;&#12399;&#12289;&#27442;&#12375;&#12356;&#12418;&#12398;&#12392;&#12362;&#37329;&#12434;&#20132;&#25563;&#12375;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#36861;&#21152;&#12375;&#12390;&#27442;&#12375;&#12356;&#27231;&#33021;&#12364;&#12354;&#12428;&#12400;&#12289;
    &#22865;&#32004;&#12395;&#12469;&#12452;&#12531;&#12375;&#12289;&#12362;&#37329;&#12434;&#25173;&#12356;&#12289;&#20316;&#26989;&#12434;&#12375;&#12390;&#12418;&#12425;&#12356;&#12414;&#12377;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#20107;&#12399;&#12381;&#12358;&#31777;&#21336;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12354;&#12394;&#12383;&#12399;&#38283;&#30330;&#32773;&#36948;&#12392;&#22865;&#32004;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#24444;&#12425;&#12364;&#12418;&#12375;&#12289;
    &#12362;&#37329;&#12434;&#25173;&#12358;&#12384;&#12369;&#12391;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12381;&#12398;&#26377;&#20767;&#12398;&#25104;&#26524;&#12434;&#21462;&#12426;&#36796;&#12435;&#12391;&#12418;&#12425;&#12360;&#12427;&#12392;&#20445;&#35388;&#12375;&#12383;&#12398;&#12394;&#12425;&#12289;
    &#24444;&#12425;&#12399;  &#8212; &#12381;&#12375;&#12390;&#12354;&#12394;&#12383;&#12418; &#8212; &#21208;&#36949;&#12356;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12399;&#12289;&#25104;&#26524;&#29289;&#12381;&#12398;&#12418;&#12398;&#12398;&#21033;&#28857;&#12392;&#12289;
    &#12381;&#12428;&#12364;&#12393;&#12398;&#31243;&#24230;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12499;&#12472;&#12519;&#12531;&#12395;&#21512;&#12387;&#12390;&#12356;&#12427;&#12363;&#12395;&#24540;&#12376;&#12390;&#12381;&#12428;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12499;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#21475;&#12434;&#20986;&#12377;&#27177;&#21033;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12354;&#12394;&#12383;&#12398;&#24847;&#35211;&#12364;&#21807;&#19968;&#12398;&#22768;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12424;&#12387;&#12390;&#12289;&#12362;&#37329;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#24433;&#38911;&#21147;&#12434;&#36023;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12289;
    &#24433;&#38911;&#21147;&#12395; <span class="emphasis"><em>&#32331;&#12364;&#12427;&#12418;&#12398;</em></span> &#12434;&#36023;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12418;&#12387;&#12392;&#12418;&#26126;&#24555;&#12394;&#20363;&#12399;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12434;&#36023;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20778;&#12428;&#12383;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#36948;&#12434;&#38599;&#12360;&#12400;&#12289;&#24444;&#12425;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#12377;&#12427;&#32076;&#39443;&#12434;&#31309;&#12415;&#12289;
    &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#20449;&#38972;&#12434;&#24471;&#12427;&#12414;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24373;&#12426;&#20184;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#21516;&#12376;&#25163;&#27573;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#12381;&#12428;&#12382;&#12428;&#12364;&#25237;&#31080;&#27177;&#12434;&#25345;&#12388;&#22580;&#21512;&#12418;&#12354;&#12428;&#12400;&#12289;&#20154;&#25968;&#12364;&#22810;&#12356;&#22580;&#21512;&#12395;&#12399;&#12502;&#12525;&#12483;&#12463;&#25237;&#31080;&#27177;&#12434;&#25345;&#12388;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#23562;&#25964;&#12434;&#24471;&#12428;&#12400;&#12289;&#25237;&#31080;&#27177;&#20197;&#19978;&#12398;&#24433;&#38911;&#21147;&#12434;&#25345;&#12388;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#38599;&#12431;&#12428;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#12398;&#21205;&#27231;&#12434;&#20605;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#32080;&#23616;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#12356;&#20154;&#12399;&#35504;&#12391;&#12418;&#12289;&#12381;&#12428;&#12382;&#12428;&#12395;&#29702;&#30001;&#12364;&#12354;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#20225;&#26989;&#12364;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#22793;&#26356;&#12375;&#12383;&#12356;&#29702;&#30001;&#12364;&#12289;&#20182;&#12424;&#12426;&#27491;&#12375;&#12367;&#12394;&#12356;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20225;&#26989;&#12398;&#30446;&#27161;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#37325;&#35222;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;
    &#20225;&#26989;&#35215;&#27169;&#12420;&#20104;&#31639;&#12289;&#12418;&#12375;&#12367;&#12399;&#12499;&#12472;&#12493;&#12473;&#12503;&#12521;&#12531;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#20225;&#26989;&#12434;&#20195;&#34920;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#22320;&#20301;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="sect1" title="Crowdfunding: Kickstarter, etc"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="crowdfunding"></a>Crowdfunding: Kickstarter, etc</h2></div></div></div><p><span class="emphasis"><em>24 March 2013: If you're reading this note, then
you've encountered this section while it's undergoing substantial
revision; see <a class="ulink" href="http://producingoss.com/v2.html" target="_top">producingoss.com/v2.html</a> for details.</em></span></p><p>poss2 tbd</p><p><span class="emphasis"><em>Kickstarter is the obvious place to start, but there
are other funding systems too.  Look at campaigns that have used
indiegogo, snowdrift (if in production by then), ask around for
others.  Use Michael Bernstein's tips on how to do it
right.</em></span></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="non-profit.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="types-of-involvement.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">Joining or Creating a Non-Profit Organization </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;</td></tr></table></div></body></html>
