<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="open-motives.html" title="&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;"><link rel="next" href="contracting.html" title="&#22865;&#32004;&#12377;&#12427;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="open-motives.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="contracting.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="money-vs-love"></a>&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;</h2></div></div></div><p>
    &#12354;&#12394;&#12383;&#12364;&#12459;&#12493;&#12434;&#36016;&#12387;&#12390;&#38599;&#12431;&#12428;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12394;&#12425;&#12289;
    &#12459;&#12493;&#12391;&#36023;&#12360;&#12427;&#12418;&#12398;&#12392;&#36023;&#12360;&#12394;&#12356;&#12418;&#12398;&#12395;&#38306;&#12377;&#12427;&#22522;&#28310;&#12434;&#26089;&#12356;&#27573;&#38542;&#12363;&#12425;&#35373;&#23450;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#27671;&#39640;&#12367;&#12390;&#20405;&#12375;&#24471;&#12394;&#12356;&#24615;&#20998;&#12395;&#12388;&#12356;&#12390;&#12289;
    1&#26085;&#12395;2&#22238;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#32368;&#12426;&#36820;&#12375;&#25237;&#31295;&#12377;&#12427;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12459;&#12493;&#12364;&#20316;&#12426;&#20986;&#12377; <span class="emphasis"><em>&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;</em></span> &#33883;&#34276;&#12434;&#37806;&#12417;&#12427;&#27231;&#20250;&#12434;&#25506;&#12387;&#12390;&#12362;&#12367;&#12409;&#12365;&#12289;
    &#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12377;&#12290;&#12381;&#12358;&#12356;&#12387;&#12383;&#33883;&#34276;&#12364;&#26082;&#12395;&#12354;&#12427;&#12418;&#12398;&#12392;&#32771;&#12360;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#36215;&#12365;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#24907;&#24230;&#12391;&#31034;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12381;&#12358;&#12356;&#12387;&#12383;&#24907;&#24230;&#12434;&#31034;&#12375;&#12383;&#33391;&#12356;&#20363;&#12364; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#36215;&#12371;&#12426;&#12414;&#12375;&#12383;&#12290;
    Subversion &#12399;&#12289;&#20309;&#20154;&#12363;&#12398;&#38283;&#30330;&#32773; (&#12362;&#26029;&#12426;: &#31558;&#32773;&#12418;&#12381;&#12398;&#12358;&#12385;&#12398;&#12402;&#12392;&#12426;&#12391;&#12377;)
    &#12395;&#32102;&#26009;&#12434;&#25903;&#25173;&#12387;&#12390;&#12356;&#12383; <a class="ulink" href="http://www.collab.net/" target="_top">CollabNet</a>
    &#12364;&#22987;&#12417;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    CollabNet &#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#38283;&#22987;&#26178;&#12363;&#12425;&#12378;&#12387;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19968;&#30058;&#12459;&#12493;&#12434;&#20986;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22987;&#12414;&#12387;&#12390;&#12377;&#12368;&#12289;CollabNet &#12399; Mike Pilato &#12392;&#12356;&#12358;&#21029;&#12398;&#38283;&#30330;&#32773;&#12434;&#38599;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#12434;&#38599;&#12358;&#12414;&#12391;&#12395;&#12289;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12399;&#26082;&#12395;&#22987;&#12414;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    Subversion &#12399;&#12414;&#12384;&#38283;&#30330;&#12398;&#21021;&#26399;&#27573;&#38542;&#12391;&#12375;&#12383;&#12364;&#12289;
    &#26082;&#12395;&#22522;&#26412;&#30340;&#12394;&#12523;&#12540;&#12523;&#12434;&#20633;&#12360;&#12383;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#20986;&#26469;&#19978;&#12364;&#12387;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    Mike &#12434;&#38599;&#12358;&#12371;&#12392;&#12391;&#12289;&#38754;&#30333;&#12356;&#30097;&#21839;&#12364;&#20986;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;
    &#26032;&#12375;&#12356;&#38283;&#30330;&#32773;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#12393;&#12358;&#12420;&#12387;&#12390;&#19982;&#12360;&#12427;&#12363;&#12395;&#38306;&#12377;&#12427;&#12523;&#12540;&#12523;&#12364;&#26082;&#12395;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#12414;&#12378;&#12289;&#24444;&#12399;&#38283;&#30330;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#12356;&#12367;&#12388;&#12363;&#25237;&#31295;&#12375;&#12414;&#12377;&#12290;
    &#21313;&#20998;&#12394;&#37327;&#12398;&#20462;&#27491;&#12364;&#24444;&#12398;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12424;&#12387;&#12390;&#34892;&#12431;&#12428;&#12289;&#20182;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#36948;&#12399;&#12289;
    &#24444;&#12364;&#33258;&#20998;&#12364;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#12424;&#12367;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30693;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#24460;&#12289;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#35504;&#12363;&#12364;&#24444;&#12399;&#30452;&#25509;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12425;&#12356;&#12356;&#12376;&#12419;&#12394;&#12356;&#12363;&#12392;&#25552;&#26696;&#12375;&#12414;&#12377;(<a class="xref" href="committers.html" title="&#12467;&#12511;&#12483;&#12479;&#12540;">&#12300;&#12467;&#12511;&#12483;&#12479;&#12540;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12371;&#12398;&#25552;&#26696;&#12399;&#38750;&#20844;&#24335;&#12395;&#34892;&#12356;&#12414;&#12377;)&#12290;
    &#12381;&#12375;&#12390;&#25552;&#26696;&#12434;&#12375;&#12383;&#20154;&#12398;&#19968;&#20154;&#12364;&#24444;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12426;&#12289;&#26082;&#12395;&#12356;&#12427;&#12467;&#12511;&#12483;&#12479;&#12540;&#36948;&#12364;&#21516;&#24847;&#12377;&#12427;&#12418;&#12398;&#12392;&#35211;&#20570;&#12375;&#12390;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12509;&#12472;&#12488;&#12522;&#12408;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    CollabNet &#12399; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#23554;&#12425;&#20685;&#12356;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12395; Mike &#12434;&#38599;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#20154;&#36948;&#12398;&#12358;&#12385;&#12289;
    &#24444;&#12398;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#25216;&#34899;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12368;&#12395;&#20685;&#12369;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#30097;&#12358;&#20154;&#12399;&#35504;&#12418;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
    &#12381;&#12428;&#12395;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12399; CollabNet &#12395;&#38599;&#12431;&#12428;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#36948;&#12392;&#12392;&#12390;&#12418;&#33391;&#12356;&#38306;&#20418;&#12434;&#31689;&#12356;&#12390;&#12356;&#12390;&#12289;
    CollabNet &#12364;&#24444;&#12434;&#38599;&#12387;&#12383;&#27573;&#38542;&#12391;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12390;&#12418;&#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399;&#22810;&#20998;&#21453;&#23550;&#12375;&#12394;&#12363;&#12387;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;CollabNet &#12399;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#24746;&#12375;&#12365;&#21069;&#20363;&#12434;&#20316;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#20206;&#12395; Mike &#12395; CollabNet &#12364;&#29420;&#26029;&#12391;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    CollabNet &#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19968;&#30058;&#12459;&#12493;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#29702;&#30001;&#12384;&#12369;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#35373;&#23450;&#12375;&#12383;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#28961;&#35222;&#12377;&#12427;&#27177;&#21033;&#12364;&#12354;&#12427;&#12392;&#23459;&#35328;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12395;&#12424;&#12427;&#24433;&#38911;&#12399;&#12377;&#12368;&#12395;&#12399;&#38997;&#22312;&#21270;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    &#12459;&#12493;&#12434;&#36016;&#12387;&#12390;&#12356;&#12394;&#12356;&#38283;&#30330;&#32773;&#12364;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#36984;&#12406;&#27177;&#21033;&#12434;&#22890;&#12431;&#12428;&#12383;&#12392;&#24863;&#12376;&#12390;&#12375;&#12414;&#12358;&#20107;&#24907;&#12364;&#24464;&#12293;&#12395;&#20986;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    CollabNet &#12395;&#38599;&#12431;&#12428;&#12390;&#12356;&#12394;&#12356;&#20154;&#12364;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#24471;&#12427;&#12395;&#12399;&#12289;
    &#12381;&#12428;&#12394;&#12426;&#12398;&#21162;&#21147;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#8212; &#12375;&#12363;&#12375;&#12289;CollabNet &#12399;&#12459;&#12493;&#12434;&#20986;&#12377;&#12384;&#12369;&#12391;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#25163;&#12395;&#20837;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#29702;&#30001;&#12363;&#12425;&#12289;Mike &#12399; &#20182;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12392;&#21516;&#27096;&#12395;&#12289;
    &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12364;&#12394;&#12356;&#29366;&#24907;&#12391; CollabNet &#12391;&#12398;&#20181;&#20107;&#12434;&#22987;&#12417;&#12427;&#12371;&#12392;&#12395;&#21516;&#24847;&#12375;&#12414;&#12375;&#12383;&#12290;
    &#24444;&#12399;&#20844;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#36865;&#12426;&#12414;&#12375;&#12383;&#12290;
    &#12381;&#12428;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#20840;&#21729;&#12391;&#12524;&#12499;&#12517;&#12540;&#12391;&#12365;&#12427;&#29366;&#24907;&#12395;&#12354;&#12426;&#12414;&#12375;&#12383;&#12375;&#12289;
    &#12414;&#12383;&#29694;&#12395;&#12524;&#12499;&#12517;&#12540;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
    CollabNet &#12399; &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12289;
    Mike &#12434;&#38599;&#12387;&#12383;&#12395;&#12418;&#38306;&#12431;&#12425;&#12378; &#12431;&#12374;&#12392; &#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12390;&#12356;&#12394;&#12356;&#12392;&#23459;&#35328;&#12375;&#12383;&#12398;&#12391;&#12289;
    &#34892;&#12365;&#36949;&#12356;&#12364;&#36215;&#12371;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;Mike &#12399;&#25968;&#36913;&#38291;&#22533;&#23455;&#12395;&#20685;&#12365;&#12289;
    &#35504;&#12363;&#12364;&#24444;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#19982;&#12360;&#12390;&#12399;&#12393;&#12358;&#12363;&#12392;&#25552;&#26696;&#12375;&#12289;&#12381;&#12428;&#12399;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290;
    &#12371;&#12428;&#12399;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12427;&#12392;&#12431;&#12363;&#12387;&#12390;&#12356;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290;
    (&#25552;&#26696;&#12375;&#12383;&#20154;&#12364; CollabNet &#12364;&#38599;&#12387;&#12383;&#38283;&#30330;&#32773;&#12384;&#12387;&#12383;&#12363;&#12393;&#12358;&#12363;&#31558;&#32773;&#12399;&#35226;&#12360;&#12390;&#12356;&#12414;&#12379;&#12435;)
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#26041;&#37341;&#12434;&#19968;&#36011;&#12375;&#12390;&#23432;&#12427;&#12371;&#12392;&#12391;&#12289;&#12459;&#12493;&#12391;&#12399;&#36023;&#12360;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12427;&#12289;
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#20154;&#12293;&#12399;&#20449;&#12376;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12358;&#12356;&#12358;&#28857;&#12391;&#20449;&#29992;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12434;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12391;&#12418;&#36890;&#29992;&#12377;&#12427;&#20385;&#20516;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12354;&#12392;&#12391;&#33976;&#12375;&#36820;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#38450;&#12368;&#12371;&#12392;&#12395;&#12418;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#35696;&#35542;&#12364;&#30333;&#29105;&#12375;&#12390;&#12367;&#12427;&#12392;&#12289;&#20154;&#12399;&#25216;&#34899;&#30340;&#12391;&#12394;&#12356;&#28857;&#12391;&#35696;&#35542;&#12395;&#21213;&#12388;&#26041;&#27861;&#12434;&#25506;&#12377;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19968;&#30058;&#12459;&#12493;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#20154;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#28145;&#12367;&#38306;&#12431;&#12426;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25505;&#12427;&#26041;&#21521;&#24615;&#12395;&#12388;&#12356;&#12390;&#28145;&#12356;&#38306;&#24515;&#12364;&#12354;&#12427;&#12384;&#12369;&#12395;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12363;&#12425;&#26684;&#22909;&#12398;&#25915;&#25731;&#12398;&#23550;&#35937;&#12392;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12390;&#12377;&#12368;&#12398;&#27573;&#38542;&#12363;&#12425;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#23455;&#30452;&#12395;&#23432;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12459;&#12493;&#12434;&#20986;&#12377;&#20154;&#12399;&#33258;&#20998;&#33258;&#36523;&#12434;&#20182;&#12392;&#21516;&#21015;&#12395;&#25201;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    (&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12395;&#38306;&#12377;&#12427;&#20284;&#12383;&#12424;&#12358;&#12394;&#35441;&#12392;&#12375;&#12390;&#12289;Danese Cooper &#12398;&#12502;&#12525;&#12464;&#12456;&#12531;&#12488;&#12522;
    <a class="ulink" href="http://blogs.sun.com/roller/page/DaneseCooper/20040916" target="_top">http://blogs.sun.com/roller/page/DaneseCooper/20040916</a> &#12434;&#35211;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    Cooper &#12399; &#12381;&#12398;&#12392;&#12365; &#12469;&#12531;&#12539;&#12510;&#12452;&#12463;&#12525;&#12471;&#12473;&#12486;&#12512;&#12474; &#12398; "&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#37096;&#32626;" &#12395;&#12356;&#12414;&#12375;&#12383; &#8212;
    &#12381;&#12428;&#12364;&#24444;&#22899;&#12398;&#20844;&#12398;&#32937;&#26360;&#12365;&#12384;&#12392;&#24605;&#12356;&#12414;&#12377; &#8212; &#12371;&#12398;&#12502;&#12525;&#12464;&#12456;&#12531;&#12488;&#12522;&#12391;&#12399;&#12289;
    Tomcat &#12398;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#33258;&#20998;&#12383;&#12385;&#12392;&#21516;&#12376;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12395;&#38306;&#12377;&#12427;&#22522;&#28310;&#12434;
    &#12469;&#12531;&#12539;&#12510;&#12452;&#12463;&#12525;&#12471;&#12473;&#12486;&#12512;&#12474; &#12395;&#23432;&#12425;&#12379;&#12383;&#12363;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;)
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12459;&#12493;&#12434;&#20986;&#12377;&#20154;&#12364;&#12289;&#20182;&#12398;&#20154;&#12392;&#21516;&#12376;&#12523;&#12540;&#12523;&#12434;&#23432;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#35504;&#12363;&#12364;&#12459;&#12493;&#12434;&#20986;&#12377;&#22580;&#21512;&#12395;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12514;&#12487;&#12523; (<span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a>
    &#12398;</span> <a class="xref" href="social-infrastructure.html#benevolent-dictator" title="&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;">&#12300;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
    &#12364;&#12385;&#12423;&#12387;&#12392;&#27231;&#33021;&#12375;&#12395;&#12367;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19968;&#30058;&#12459;&#12493;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#29305;&#12395;&#12381;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#29420;&#35009;&#12395;&#12399;&#12523;&#12540;&#12523;&#12364;&#12411;&#12392;&#12435;&#12393;&#12394;&#12356;&#12398;&#12391;&#12289;&#12383;&#12392;&#12360;&#23455;&#38555;&#12395;&#23432;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12459;&#12493;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#12523;&#12540;&#12523;&#12434;&#23432;&#12387;&#12390;&#12356;&#12427;&#12392;&#35388;&#26126;&#12377;&#12427;&#12371;&#12392;&#12399;&#22256;&#38627;&#12391;&#12377;&#12290;
    &#24517;&#12378;&#12375;&#12418;&#19981;&#21487;&#33021;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12290;&#12381;&#12428;&#12395;&#12399;&#12289;&#22806;&#37096;&#12398;&#38283;&#30330;&#32773;&#12392;&#21516;&#12376;&#35222;&#28857;&#12363;&#12425;&#29289;&#20107;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
    &#36969;&#20999;&#12395;&#34892;&#21205;&#12391;&#12365;&#12427;&#20154;&#12391;&#12289;&#12363;&#12388;&#12459;&#12493;&#12434;&#20986;&#12379;&#12427;&#20154;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12540;&#12480;&#12540;&#12395;&#12394;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#22580;&#21512;&#12391;&#12418;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#19981;&#28288;&#12364;&#24195;&#12364;&#12427;&#20806;&#12375;&#12364;&#26126;&#12427;&#12415;&#12395;&#20986;&#12390;&#12375;&#12414;&#12358;&#22580;&#21512;&#12395;&#20633;&#12360;&#12390;&#12289;
    &#29420;&#35009;&#30340;&#12391;&#12399;&#12394;&#12356;&#12420;&#12426;&#26041;&#12391;&#25552;&#26696;&#12434;&#12377;&#12427;&#12398;&#12399;&#12424;&#12356;&#32771;&#12360;&#12391;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="open-motives.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="contracting.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#22865;&#32004;&#12377;&#12427;</td></tr></table></div></body></html>
