<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="appear-as-many.html" title="&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;"><link rel="next" href="money-vs-love.html" title="&#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="appear-as-many.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="money-vs-love.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="open-motives"></a>&#21205;&#27231;&#12434;&#38560;&#12375;&#31435;&#12390;&#12375;&#12394;&#12356;</h2></div></div></div><p>
    &#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#30446;&#25351;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#12289;&#12391;&#12365;&#12427;&#38480;&#12426;&#38560;&#12373;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12383;&#12384;&#12375;&#12289;&#12499;&#12472;&#12493;&#12473;&#19978;&#12398;&#31192;&#23494;&#12399;&#28431;&#12425;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12364;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#33258;&#20998;&#12398;&#39015;&#23458;&#12363;&#12425;&#24375;&#12367;&#35201;&#27714;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12289;
    &#12354;&#12427;&#27231;&#33021;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21462;&#12426;&#36796;&#12435;&#12391;&#12418;&#12425;&#12356;&#12383;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#29575;&#30452;&#12395;&#12381;&#12358;&#35328;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#39015;&#23458;&#12363;&#12425;&#33258;&#20998;&#12398;&#12371;&#12392;&#12434;&#31192;&#23494;&#12395;&#12375;&#12390;&#12411;&#12375;&#12356;&#12392;&#38972;&#12414;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12381;&#12398;&#22580;&#21512;&#12399;&#21311;&#21517;&#12391;&#20107;&#20363;&#12434;&#32057;&#20171;&#12373;&#12379;&#12390;&#12418;&#12425;&#12360;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#23569;&#12394;&#12367;&#12392;&#12418;&#32862;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#12354;&#12394;&#12383;&#12364;&#12420;&#12426;&#12383;&#12356;&#12371;&#12392;&#12398; <span class="emphasis"><em>&#21205;&#27231;</em></span> &#12434;&#30693;&#12428;&#12400;&#30693;&#12427;&#12411;&#12393;&#12289;
    &#12354;&#12394;&#12383;&#12364;&#20309;&#12434;&#25552;&#26696;&#12375;&#12390;&#12418;&#36949;&#21644;&#24863;&#12364;&#23569;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12428;&#12399;&#12289;&#30693;&#35672;&#12399;&#21147;&#12391;&#12354;&#12426;&#12289;&#20182;&#20154;&#12364;&#33258;&#20998;&#12398;&#30446;&#27161;&#12434;&#30693;&#12428;&#12400;&#30693;&#12427;&#12411;&#12393;&#22810;&#12367;&#24178;&#28169;&#12373;&#12428;&#12427;&#12289;
    &#12392;&#12356;&#12358;&#30452;&#24863;&#12395;&#21453;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#8212; &#30452;&#24863;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12398;&#12399;&#31777;&#21336;&#12391;&#12377;&#12364;&#12289;&#21462;&#12426;&#38500;&#12367;&#12398;&#12399;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12371;&#12391;&#12399;&#12381;&#12398;&#30452;&#24863;&#12399;&#38291;&#36949;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#26032;&#27231;&#33021; (&#12496;&#12464;&#20462;&#27491;&#12391;&#12418;&#12394;&#12435;&#12391;&#12418;) &#12434;&#20844;&#12398;&#22580;&#12391;&#20027;&#24373;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12354;&#12394;&#12383;&#12399; <span class="emphasis"><em>&#26082;&#12395;</em></span> &#12459;&#12540;&#12489;&#12434;&#12486;&#12540;&#12502;&#12523;&#12395;&#32622;&#12356;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12398;&#26178;&#28857;&#12391;&#21807;&#19968;&#21839;&#38988;&#12395;&#12394;&#12427;&#12398;&#12399;&#12289;&#30446;&#27161;&#12434;&#20849;&#26377;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12434;&#35480;&#23566;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12391;&#12377;&#12290;
    &#20206;&#12395;&#26395;&#12416;&#12371;&#12392;&#12384;&#12369;&#12434;&#20027;&#24373;&#12375;&#12390;&#12289;&#12381;&#12398;&#29702;&#30001;&#12392;&#12394;&#12427;&#20855;&#20307;&#20363;&#12434;&#36848;&#12409;&#12394;&#12369;&#12428;&#12400;&#12289;
    &#12381;&#12398;&#20027;&#24373;&#12399;&#24369;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12375;&#12289;&#38560;&#12428;&#12383;&#24847;&#22259;&#12364;&#12354;&#12427;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#30097;&#12431;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#29694;&#23455;&#19990;&#30028;&#12398;&#12471;&#12490;&#12522;&#12458;&#12434; 2,3 &#36848;&#12409;&#12289;&#25552;&#26696;&#12375;&#12390;&#12356;&#12427;&#26032;&#27231;&#33021;&#12364;&#12394;&#12380;&#37325;&#35201;&#12394;&#12398;&#12363;&#12434;&#31034;&#12377;&#12384;&#12369;&#12391;&#12289;
    &#35696;&#35542;&#12377;&#12427;&#19978;&#12391;&#21127;&#30340;&#12394;&#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#21029;&#12398;&#35222;&#28857;&#12363;&#12425;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#26032;&#27231;&#33021;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26032;&#12375;&#12356;&#26041;&#21521;&#24615;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12399;&#38263;&#12367;&#12289;
    &#36864;&#23624;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;&#20154;&#12293;&#12398;&#20027;&#24373;&#12399;&#12300;&#20491;&#20154;&#30340;&#12395;&#12399; X &#12364;&#27442;&#12375;&#12356;&#12435;&#12384;&#12424;&#12397;&#12301;&#12392;&#12363;&#12289;
    &#12418;&#12387;&#12392;&#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12300;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#35373;&#35336;&#12434;&#38263;&#12356;&#38291;&#12420;&#12387;&#12390;&#12365;&#12383;&#12435;&#12384;&#12369;&#12393;&#12289;
    X &#12399; &#12518;&#12540;&#12470;&#12540;&#12395;&#12392;&#12387;&#12390;&#12418;&#12398;&#20932;&#12367;&#37325;&#35201;&#12384; / &#35504;&#12418;&#28288;&#36275;&#12375;&#12394;&#12356;&#20313;&#35336;&#12394;&#39166;&#12426;&#12384;&#12424;&#12397;&#12301;
    &#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#29694;&#23455;&#19990;&#30028;&#12391;&#12398;&#20351;&#12356;&#26041;&#12364;&#31034;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12289;
    &#35696;&#35542;&#12398;&#30701;&#32302;&#12420;&#27770;&#30528;&#12395;&#32331;&#12364;&#12425;&#12394;&#12356;&#12400;&#12363;&#12426;&#12363;&#12289;&#23455;&#38555;&#12398;&#12518;&#12540;&#12470;&#12540;&#20307;&#39443;&#12363;&#12425;&#12399;&#31243;&#36960;&#12356;&#35696;&#35542;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12356;&#12387;&#12383;&#35696;&#35542;&#12434;&#27490;&#12417;&#12427;&#21147;&#12364;&#20685;&#12363;&#12394;&#12356;&#38480;&#12426;&#12289;
    &#32080;&#23616;&#12399;&#12418;&#12387;&#12392;&#12418;&#21475;&#12364;&#36948;&#32773;&#12394;&#20154;&#12420;&#12289;&#38929;&#22266;&#12394;&#20154;&#12289;
    &#12354;&#12427;&#12356;&#12399;&#19968;&#30058;&#12398;&#21476;&#21442;&#12395;&#12424;&#12387;&#12390;&#32080;&#35542;&#12364;&#27770;&#12414;&#12387;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#22823;&#37327;&#12398;&#39015;&#23458;&#12487;&#12540;&#12479;&#12434;&#25345;&#12388;&#32068;&#32340;&#12392;&#12375;&#12390;&#12289;&#12354;&#12394;&#12383;&#12395;&#12399;&#12381;&#12358;&#12356;&#12387;&#12383;&#35696;&#35542;&#12434;&#27490;&#12417;&#12427;&#12481;&#12515;&#12531;&#12473;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#20182;&#12398;&#20154;&#12364;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#20253;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#24773;&#22577;&#12408;&#12398;&#12497;&#12452;&#12503;&#24441;&#12395;&#12394;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12364;&#26395;&#12416;&#12371;&#12392;&#12398;&#26681;&#25312;&#12395;&#12394;&#12427;&#24773;&#22577;&#12399;&#24677;&#12378;&#12363;&#12375;&#12356;&#12418;&#12398;&#12391;&#12418;&#20309;&#12391;&#12418;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#12364;&#26360;&#12356;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;
    &#24195;&#12356;&#35211;&#32862;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#38283;&#30330;&#32773;&#12399;&#12417;&#12356;&#12417;&#12356;&#12364;&#12289;
    &#33258;&#20998;&#29420;&#33258;&#12398;&#12420;&#12426;&#26041;&#12391;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;&#12381;&#12375;&#12390;&#20182;&#12398;&#20351;&#12356;&#26041;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#30452;&#24863;&#12420;&#24403;&#12390;&#25512;&#37327;&#12289;&#12381;&#12375;&#12390;&#26412;&#33021;&#12395;&#38972;&#12387;&#12390;&#20316;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#38750;&#24120;&#12395;&#22810;&#12367;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#20449;&#38972;&#12391;&#12365;&#12427;&#12487;&#12540;&#12479;&#12434;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12354;&#12394;&#12383;&#12399;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#37240;&#32032;&#12395;&#20284;&#12383;&#20309;&#12363;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12375;&#12383;&#24773;&#22577;&#12434;&#36969;&#20999;&#12395;&#31034;&#12377;&#38480;&#12426;&#12289;&#24444;&#12425;&#12399;&#29105;&#29378;&#30340;&#12395;&#12381;&#12428;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
    &#29289;&#20107;&#12399;&#12354;&#12394;&#12383;&#12398;&#26395;&#12416;&#26041;&#21521;&#12395;&#36914;&#12416;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#37749;&#12392;&#12394;&#12427;&#12398;&#12399;&#12289;&#12418;&#12385;&#12429;&#12435;&#24773;&#22577;&#12434;&#36969;&#20999;&#12395;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#22823;&#37327;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#25265;&#12360;&#12390;&#12356;&#12383;&#12426;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#12354;&#12427;&#27231;&#33021;&#12434;&#24517;&#35201;&#12392;&#12375;&#12390;&#12356;&#12427; (&#12414;&#12383;&#12399;&#12381;&#12358;&#24605;&#12387;&#12390;&#12356;&#12427;) &#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
    &#33258;&#20998;&#12398;&#35299;&#27770;&#31574;&#12434;&#23455;&#35013;&#12377;&#12409;&#12365;&#12384;&#12392;&#20027;&#24373;&#12375;&#12390;&#12418;&#12358;&#12414;&#12367;&#12356;&#12363;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12416;&#12375;&#12429;&#12289;&#12354;&#12427;&#29305;&#23450;&#12398;&#35299;&#27770;&#31574;&#12395;&#12388;&#12356;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#21839;&#38988;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12425;&#12434;&#12399;&#12376;&#12417;&#12395;&#25237;&#31295;&#12377;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#39015;&#23458;&#12364;&#32076;&#39443;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#35443;&#32048;&#12395;&#35352;&#12375;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#20998;&#26512;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#19978;&#12391;&#12289;&#32771;&#12360;&#12425;&#12428;&#12358;&#12427;&#12384;&#12369;&#12398;&#29694;&#23455;&#30340;&#12394;&#35299;&#27770;&#31574;&#12434;&#25552;&#31034;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#35299;&#27770;&#31574;&#12364;&#12393;&#12428;&#12367;&#12425;&#12356;&#26377;&#21177;&#12363;&#12434;&#20154;&#12293;&#12364;&#32771;&#12360;&#22987;&#12417;&#12383;&#12425;&#12289;&#12354;&#12394;&#12383;&#12399;&#24444;&#12425;&#12398;&#30330;&#35328;&#12434;&#25793;&#35703;&#12375;&#12383;&#12426;&#12289;
    &#30064;&#35696;&#12434;&#21809;&#12360;&#12383;&#12426;&#12377;&#12427;&#12398;&#12395;&#33258;&#20998;&#12398;&#12487;&#12540;&#12479;&#12434;&#31034;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12399;&#12399;&#12376;&#12417;&#12363;&#12425;&#12378;&#12387;&#12392;&#29305;&#23450;&#12398;&#35299;&#27770;&#31574;&#12364;&#38957;&#12395;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12399;&#12376;&#12417;&#12363;&#12425;&#12381;&#12398;&#35299;&#27770;&#31574;&#12434;&#36984;&#12435;&#12391;&#29305;&#21029;&#12394;&#37197;&#24942;&#12434;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12428;&#12399;&#30456;&#25163;&#12434;&#39449;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#21336;&#12395;&#26222;&#36890;&#12398;&#12300;&#20844;&#27491;&#12394;&#20210;&#35009;&#32773;&#12301;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#32080;&#23616;&#12289;&#12354;&#12394;&#12383;&#12398;&#26412;&#24403;&#12398;&#30446;&#27161;&#12399;&#29305;&#23450;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#29305;&#23450;&#12398;&#35299;&#27770;&#31574;&#12399;&#12289;&#12381;&#12398;&#12383;&#12417;&#12398;&#25163;&#27573;&#12391;&#12375;&#12363;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#20206;&#12395;&#12354;&#12394;&#12383;&#12364;&#22909;&#12416;&#35299;&#27770;&#31574;&#12364;&#20778;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#20182;&#12398;&#38283;&#30330;&#32773;&#36948;&#12418;&#12381;&#12428;&#12434;&#32080;&#23616;&#12399;&#35469;&#12417;&#12390;&#12367;&#12428;&#12289;
    &#24444;&#12425;&#12398;&#33258;&#30001;&#24847;&#24535;&#12391;&#24540;&#25588;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12425;&#12434;&#23041;&#22151;&#12375;&#12390;&#33258;&#20998;&#12398;&#35299;&#27770;&#31574;&#12434;&#23455;&#35013;&#12373;&#12379;&#12427;&#12424;&#12426;&#12289;&#12371;&#12398;&#26041;&#12364;&#12354;&#12394;&#12383;&#12395;&#12392;&#12387;&#12390;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    (&#24444;&#12425;&#12364;&#33258;&#20998;&#12424;&#12426;&#20778;&#12428;&#12383;&#35299;&#27770;&#31574;&#12434;&#32771;&#12360;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;)
</p><p>
    &#12371;&#12428;&#12399;&#12289;&#29305;&#23450;&#12398;&#35299;&#27770;&#31574;&#12434;&#22909;&#12435;&#12391;&#12356;&#12427;&#12371;&#12392;&#12434;&#35328;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12354;&#12394;&#12383;&#12364;&#26082;&#12395;&#20869;&#37096;&#12391;&#32066;&#12360;&#12390;&#12356;&#12427;&#20998;&#26512;&#12364;&#12289;
    &#38283;&#30330;&#29992;&#12398;&#20844;&#38283;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#32368;&#12426;&#36820;&#12373;&#12428;&#12427;&#12414;&#12391;&#25105;&#24930;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12300;&#12377;&#12409;&#12390;&#12398;&#35299;&#27770;&#31574;&#12434;&#12415;&#12390;&#12365;&#12383;&#12369;&#12428;&#12393;&#12418;&#12289;&#12381;&#12428;&#12399; A, B, C &#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12358;&#12414;&#12367;&#12356;&#12363;&#12394;&#12356;&#12290;
    &#31361;&#12365;&#35440;&#12417;&#12390;&#32771;&#12360;&#12390;&#12356;&#12367;&#12392;&#12289;&#32080;&#23616;&#21807;&#19968;&#12398;&#35299;&#27770;&#31574;&#12399; ...&#12301;&#12394;&#12393;&#12392;&#30330;&#35328;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#21839;&#38988;&#12394;&#12398;&#12399;&#12289;&#12371;&#12358;&#12375;&#12383;&#30330;&#35328;&#12364;&#23562;&#22823;&#12395;&#32862;&#12371;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12424;&#12426;&#12418;&#12289;
    &#12416;&#12375;&#12429;&#12354;&#12394;&#12383;&#12364;&#12381;&#12398;&#21839;&#38988;&#12434;&#20998;&#26512;&#12377;&#12427;&#12383;&#12417;&#12395;&#12354;&#12427;&#26410;&#30693;&#25968;&#12398; (&#22810;&#20998;&#22823;&#12365;&#12356;&#12392;&#20154;&#12293;&#12399;&#24605;&#12358;&#12391;&#12375;&#12423;&#12358;)
    &#12522;&#12477;&#12540;&#12473;&#12434; <span class="emphasis"><em>&#26082;&#12395;</em></span> &#35023;&#12391;&#25237;&#20837;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#21360;&#35937;&#12434;&#19982;&#12360;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#26082;&#12395;&#29289;&#20107;&#12364;&#36914;&#34892;&#12375;&#12390;&#12356;&#12390;&#12289;&#22810;&#20998;&#27770;&#23450;&#12418;&#12394;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;
    &#20844;&#12395;&#12399;&#12381;&#12428;&#12395;&#12388;&#12356;&#12390;&#20309;&#12418;&#30693;&#12425;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12424;&#12358;&#12395;&#35211;&#12360;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#20154;&#12293;&#12398;&#24594;&#12426;&#12434;&#36023;&#12358;&#21407;&#22240;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#24403;&#28982;&#12289;<span class="emphasis"><em>&#12354;&#12394;&#12383;</em></span> &#12399;&#12381;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#35023;&#12391;&#12393;&#12398;&#12367;&#12425;&#12356;&#21162;&#21147;&#12375;&#12390;&#12365;&#12383;&#12363;&#12434;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12398;&#30693;&#35672;&#12399;&#12354;&#12427;&#24847;&#21619;&#19981;&#21033;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#38599;&#12387;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12399;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12395;&#12356;&#12427;&#20182;&#12398;&#38283;&#30330;&#32773;&#12392;&#12399;&#36949;&#12387;&#12383;&#31934;&#31070;&#29366;&#24907;&#12395;&#32622;&#12363;&#12428;&#12390;&#12375;&#12414;&#12356;&#12289;
    &#12381;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#38283;&#30330;&#32773;&#12398;&#35222;&#28857;&#12363;&#12425;&#29289;&#20107;&#12434;&#35211;&#12427;&#33021;&#21147;&#12364;&#27424;&#12369;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12424;&#12426;&#26089;&#12356;&#27573;&#38542;&#12391;&#20182;&#12398;&#20154;&#12395;&#12354;&#12394;&#12383;&#12392;&#21516;&#12376;&#35328;&#33865;&#12391;&#32771;&#12360;&#12373;&#12379;&#12428;&#12400;&#12289;&#12371;&#12358;&#12375;&#12383;&#28317;&#12399;&#23567;&#12373;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#35542;&#29702;&#12399;&#12289;&#20491;&#12293;&#12398;&#25216;&#34899;&#30340;&#12394;&#29366;&#27841;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#33258;&#20998;&#12398;&#30446;&#27161;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#38560;&#12373;&#12394;&#12356;&#12392;&#12356;&#12358;&#24195;&#32681;&#12398;&#35201;&#35531;&#12395;&#12418;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#30693;&#12425;&#12394;&#12356;&#12371;&#12392;&#12399;&#30693;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12424;&#12426;&#12418;&#19981;&#23433;&#23450;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12354;&#12394;&#12383;&#12364;&#12420;&#12426;&#12383;&#12356;&#12371;&#12392;&#12398;&#21205;&#27231;&#12434;&#20154;&#12293;&#12364;&#30693;&#12428;&#12400;&#12289;
    &#24444;&#12425;&#12399;&#12383;&#12392;&#12360;&#12381;&#12428;&#12395;&#21453;&#23550;&#12391;&#12354;&#12387;&#12390;&#12418;&#12354;&#12394;&#12383;&#12392;&#27671;&#36605;&#12395;&#35441;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#21205;&#27231;&#12364;&#20998;&#12363;&#12425;&#12394;&#12369;&#12428;&#12400;&#12289;&#24444;&#12425;&#12399;&#29289;&#20107;&#12434;&#24746;&#12356;&#26041;&#21521;&#12395;&#32771;&#12360;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12418;&#12385;&#12429;&#12435;&#12377;&#12409;&#12390;&#12434;&#20844;&#12395;&#12399;&#12391;&#12365;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;&#20154;&#12293;&#12418;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#26399;&#24453;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12377;&#12409;&#12390;&#12398;&#32068;&#32340;&#12395;&#12399;&#31192;&#23494;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12362;&#12381;&#12425;&#12367;&#21942;&#21033;&#32068;&#32340;&#12395;&#12399;&#22810;&#12367;&#12398;&#31192;&#23494;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
    &#38750;&#21942;&#21033;&#12394;&#32068;&#32340;&#12391;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12354;&#12427;&#26041;&#21521;&#24615;&#12434;&#25793;&#35703;&#12377;&#12427;&#32681;&#21209;&#12364;&#12354;&#12427;&#12369;&#12428;&#12393;&#12418;&#12289;
    &#12381;&#12398;&#29702;&#30001;&#12434;&#20840;&#12367;&#20844;&#12395;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#12381;&#12358;&#12356;&#12387;&#12383;&#21046;&#32004;&#12398;&#20013;&#12391;&#20986;&#26469;&#12427;&#12418;&#12387;&#12392;&#12418;&#20778;&#12428;&#12383;&#20027;&#24373;&#12434;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12375;&#12390;&#12289;&#35696;&#35542;&#12398;&#20013;&#12391;&#33258;&#20998;&#12364;&#26395;&#12416;&#12411;&#12393;&#24433;&#38911;&#21147;&#12434;&#34892;&#20351;&#12391;&#12365;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12289;
    &#12392;&#12356;&#12358;&#20107;&#23455;&#12434;&#21463;&#12369;&#20837;&#12428;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20840;&#20307;&#12395;&#32102;&#26009;&#12434;&#25173;&#12431;&#12394;&#12356;&#12383;&#12417;&#12395;&#34892;&#12358;&#22949;&#21332;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="appear-as-many.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="money-vs-love.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20225;&#26989;&#12398;&#20154;&#38291;&#12392;&#12375;&#12390;&#12391;&#12399;&#12394;&#12367;&#12289;&#20491;&#20154;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12459;&#12493;&#12391;&#24859;&#12399;&#36023;&#12360;&#12394;&#12356;</td></tr></table></div></body></html>
