<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="prev" href="stabilizing-a-release.html" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;"><link rel="next" href="testing-and-releasing.html" title="&#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="stabilizing-a-release.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</th><td width="20%" align="right"> <a accesskey="n" href="testing-and-releasing.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="packaging"></a>&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;</h2></div></div></div><p>
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#37197;&#24067;&#12377;&#12427;&#27161;&#28310;&#30340;&#12394;&#12420;&#12426;&#26041;&#12399;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#37197;&#24067;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12381;&#12398;&#12414;&#12414;&#23455;&#34892;&#12391;&#12365;&#12427;(i.e. Perl, Python, PHP &#12394;&#12393;&#12398;&#12424;&#12358;&#12395;&#12289;
    &#12452;&#12531;&#12479;&#12503;&#12522;&#12479;&#12395;&#12424;&#12387;&#12390;&#35299;&#37320;&#12391;&#12365;&#12427;&#12418;&#12398;)&#12363;&#12289;
    &#12399;&#12376;&#12417;&#12395;(C, C++, Java&#12394;&#12393;&#12395;&#12424;&#12387;&#12390;&#65289;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#12431;&#12425;&#12378;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
    &#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#22580;&#21512;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#22810;&#20998;&#33258;&#20998;&#12391;&#12477;&#12540;&#12473;&#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12379;&#12378;&#12289;
    &#12354;&#12425;&#12363;&#12376;&#12417;&#12499;&#12523;&#12489;&#12373;&#12428;&#12383;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    (<span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12395;&#12354;&#12427;</span> <a class="xref" href="packaging.html#binary-packages" title="&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;">&#12300;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#20803;&#12395;&#12375;&#12390;&#20316;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12477;&#12540;&#12473;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#26326;&#26151;&#12391;&#12394;&#12356;&#24418;&#12391;&#12522;&#12522;&#12540;&#12473;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364; "Scanley 2.5.0" &#12434;&#37197;&#24067;&#12377;&#12427;&#22580;&#21512;&#12289;&#12381;&#12428;&#12364;&#29305;&#12395;&#24847;&#21619;&#12377;&#12427;&#12392;&#12371;&#12429;&#12399; "&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12390;&#65288;&#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#65289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12392;&#12289;Scanley 2.5.0 &#12434;&#29983;&#25104;&#12377;&#12427;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#12484;&#12522;&#12540;&#12391;&#12354;&#12427;" &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12393;&#12358;&#12356;&#12358;&#24418;&#12391;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12409;&#12365;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12363;&#12394;&#12426;&#21427;&#26684;&#12394;&#22522;&#28310;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#22522;&#28310;&#12363;&#12425;&#22806;&#12428;&#12383;&#37096;&#20998;&#12418;&#26178;&#25240;&#35211;&#12388;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12381;&#12428;&#12399;&#12523;&#12540;&#12523;&#12391;&#12399;&#12394;&#12367;&#20363;&#22806;&#12391;&#12377;&#12290;
    &#12420;&#12416;&#12434;&#24471;&#12394;&#12356;&#29702;&#30001;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12371;&#12398;&#22522;&#28310;&#12395;&#24467;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;"><div class="titlepage"><div><div><h3 class="title"><a name="packaging-format"></a>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</h3></div></div></div><p>
    &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12399;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12434;&#20445;&#23384;&#12375;&#12390;&#12367;&#12428;&#12427;&#27161;&#28310;&#30340;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12522;&#12522;&#12540;&#12473;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    Unix &#12414;&#12383;&#12399; Unix&#12521;&#12452;&#12463;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;
    <span class="command"><strong>compress</strong></span> &#12467;&#12510;&#12531;&#12489;&#12420;&#12289;<span class="command"><strong>gzip</strong></span>&#12289;
    <span class="command"><strong>bzip</strong></span> &#12414;&#12383;&#12399; <span class="command"><strong>bzip2</strong></span> &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12387;&#12390;&#22311;&#32302;&#12375;&#12383; TAR &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#20351;&#12358;&#12392;&#12356;&#12358;&#27770;&#12414;&#12426;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Microsoft Windows &#12391;&#12399;&#12289;
    &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12434;&#20445;&#23384;&#12375;&#12383;&#29366;&#24907;&#12391;&#37197;&#24067;&#12377;&#12427;&#27161;&#28310;&#30340;&#12394;&#12420;&#12426;&#26041;&#12392;&#12375;&#12390; <em class="firstterm">zip</em> &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#20351;&#12358;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12383;&#12414;&#12383;&#12414;&#22311;&#32302;&#12418;&#12375;&#12390;&#12367;&#12428;&#12427;&#12398;&#12391;&#12289;
    &#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#20316;&#12387;&#12383;&#24460;&#12395;&#22311;&#32302;&#12434;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><div class="sidebar" title="TAR &#12501;&#12449;&#12452;&#12523;"><a name="packaging-tar"></a><div class="titlepage"><div><div><p class="title"><b>TAR &#12501;&#12449;&#12452;&#12523;</b></p></div></div></div><p>
       <em class="firstterm">TAR</em> &#12392;&#12399;&#12289;"Tape ARchive" &#12434;&#30053;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
       &#12394;&#12380;&#12394;&#12425;&#12289;tar &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12434;&#30913;&#27671;&#12486;&#12540;&#12503;&#12395;&#20445;&#23384;&#12377;&#12427;&#12398;&#12395;&#29702;&#24819;&#30340;&#12394;&#30452;&#21015;&#12398;&#12487;&#12540;&#12479;&#12473;&#12488;&#12522;&#12540;&#12512;&#12392;&#12375;&#12390;&#34920;&#29694;&#12377;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
       &#12414;&#12383;&#12289;&#12371;&#12398;&#24615;&#36074;&#12422;&#12360;&#12395;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12434;&#21336;&#19968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#37197;&#24067;&#12377;&#12427;&#12371;&#12392;&#12364;&#27161;&#28310;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#22311;&#32302;&#12373;&#12428;&#12383; tar &#12501;&#12449;&#12452;&#12523;(&#12414;&#12383;&#12399;<em class="firstterm">tar&#12508;&#12540;&#12523;</em>)&#12434;&#25552;&#20379;&#12377;&#12427;&#12398;&#12399;&#38750;&#24120;&#12395;&#31777;&#21336;&#12391;&#12377;&#12290;
       &#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;<span class="command"><strong>tar</strong></span>&#12467;&#12510;&#12531;&#12489;&#33258;&#20307;&#12364;&#22311;&#32302;&#28168;&#12415;&#12398;tar&#12508;&#12540;&#12523;&#12434;&#29983;&#25104;&#12377;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
       &#22311;&#32302;&#12377;&#12427;&#12398;&#12395;tar&#12467;&#12510;&#12531;&#12489;&#12392;&#12399;&#21029;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12358;&#12471;&#12473;&#12486;&#12512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
   </p></div></div><div class="sect2" title="&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12392;&#12524;&#12452;&#12450;&#12454;&#12488;"><div class="titlepage"><div><div><h3 class="title"><a name="packaging-name-and-layout"></a>&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12392;&#12524;&#12452;&#12450;&#12454;&#12488;</h3></div></div></div><p>
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#21517;&#21069;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#21517;&#21069;&#12392;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#24460;&#12391;&#12289;
    &#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#12420;&#12426;&#26041;&#12395;&#21512;&#12387;&#12383;&#36969;&#20999;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12398;&#25313;&#24373;&#23376;&#12434;&#26368;&#24460;&#12395;&#12388;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;Scanley 2.5.0 &#12434; Unix&#21521;&#12369;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;&#12375;&#12289;
    GNU Zip(gzip) &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#22311;&#32302;&#12375;&#12383;&#12392;&#12365;&#12398;&#21517;&#21069;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="informalexample"><div class="literallayout"><p>scanley-2.5.0.tar.gz</p></div></div><p>
    &#12414;&#12383;&#12289;Windows &#21521;&#12369;&#12395; zip &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#22311;&#32302;&#12375;&#12383;&#22580;&#21512;&#12398;&#21517;&#21069;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><div class="informalexample"><div class="literallayout"><p>scanley-2.5.0.zip</p></div></div><p>
    &#12393;&#12385;&#12425;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#23637;&#38283;&#12375;&#12390;&#12418;&#12289;
    &#12459;&#12524;&#12531;&#12488;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395; scanley-2.5.0 &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#21336;&#19968;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12364;&#29983;&#25104;&#12373;&#12428;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12399;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;(&#24517;&#35201;&#12394;&#12425;)&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12289;
    &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#29366;&#24907;&#12391;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#37197;&#32622;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12398;&#26368;&#19978;&#37096;&#12395;&#12399;&#12289;&#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#20309;&#12434;&#12377;&#12427;&#12418;&#12398;&#12391;&#12289;
    &#20170;&#22238;&#12398;&#12522;&#12522;&#12540;&#12473;&#20869;&#23481;&#12364;&#12393;&#12358;&#12356;&#12358;&#12418;&#12398;&#12363;&#12289;
    &#12381;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;Web&#12469;&#12452;&#12488;&#12420;&#12381;&#12398;&#20182;&#38754;&#30333;&#12356;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#12398;&#12522;&#12477;&#12540;&#12473;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12383; <code class="filename">README</code> &#12501;&#12449;&#12452;&#12523;&#12434;&#12503;&#12524;&#12540;&#12531;&#12486;&#12461;&#12473;&#12488;&#12391;&#37197;&#32622;&#12375;&#12414;&#12377;&#12290;
    &#20182;&#12398;&#38754;&#30333;&#12356;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#12399;&#12289;<code class="filename">README</code> &#12501;&#12449;&#12452;&#12523;&#12398;&#20804;&#24351;&#20998;&#12395;&#12354;&#12383;&#12426;&#12289;
    &#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#20840;&#12390;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12499;&#12523;&#12489;&#12375;&#12289;
    &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12383; <code class="filename">INSTALL</code> &#12501;&#12449;&#12452;&#12523;&#12364;&#12354;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;
    <span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a> &#12398;</span> <a class="xref" href="license-quickstart.html#license-quickstart-applying" title="&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12377;&#12427;&#26041;&#27861;">&#12300;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36969;&#29992;&#12377;&#12427;&#26041;&#27861;&#12301;</a> &#12391;&#12418;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#37197;&#20184;&#26465;&#20214;&#12434;&#31034;&#12375;&#12383; <code class="filename">COPYING</code> &#12420; <code class="filename">LICENSE</code>&#12501;&#12449;&#12452;&#12523;&#12418;&#12484;&#12522;&#12540;&#12398;&#26368;&#19978;&#37096;&#12395;&#37197;&#32622;&#12375;&#12414;&#12377;&#12290;
</p><p>
    &#20170;&#22238;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#26032;&#12375;&#12367;&#12394;&#12387;&#12383;&#12371;&#12392;&#12434;&#35500;&#26126;&#12377;&#12427; <code class="filename">CHANGES</code> (<code class="filename">NEWS</code> &#12392;&#21628;&#12400;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;) &#12501;&#12449;&#12452;&#12523;&#12418;&#12484;&#12522;&#12540;&#12398;&#26368;&#19978;&#37096;&#12395;&#37197;&#32622;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12398; <code class="filename">CHANGES</code> &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;
    &#12371;&#12428;&#12414;&#12391;&#34892;&#12431;&#12428;&#12383;&#12522;&#12522;&#12540;&#12473;&#20840;&#12390;&#12398;&#22793;&#26356;&#28857;&#12434;&#38598;&#12417;&#12383;&#12418;&#12398;&#12391;&#12289;
    &#20170;&#22238;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#22793;&#26356;&#28857;&#12398;&#19968;&#35239;&#12364;&#19968;&#30058;&#26368;&#21021;&#12395;&#12394;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#38918;&#30058;&#12392;&#12399;&#36870;&#38918;&#12395;&#35352;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#22793;&#26356;&#28857;&#19968;&#35239;&#12434;&#23436;&#25104;&#12373;&#12379;&#12427;&#12398;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12434;&#12522;&#12522;&#12540;&#12473;&#12391;&#12365;&#12427;&#29366;&#24907;&#12395;&#12377;&#12427;&#20316;&#26989;&#12398;&#26368;&#24460;&#12395;&#34892;&#12358;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#12375;&#12390;&#12356;&#12427;&#38291;&#12395;&#23569;&#12375;&#12378;&#12388;&#22793;&#26356;&#28857;&#12434;&#26360;&#12365;&#36275;&#12375;&#12390;&#12356;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12428;&#12400;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12525;&#12464;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12391;&#24773;&#22577;&#12434;&#38598;&#12417;&#12289;
    &#26368;&#24460;&#12395;&#12402;&#12392;&#12426;&#12398;&#20154;&#38291;&#12364;&#12414;&#12392;&#12417;&#12427;&#12414;&#12391;&#20316;&#26989;&#12434;&#20445;&#30041;&#12377;&#12427;&#12398;&#12434;&#22909;&#12416;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#22793;&#26356;&#28857;&#12398;&#19968;&#35239;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
Version 2.5.0
(2004&#24180;12&#26376;20&#26085;&#12395; /branches/2.5.x &#12363;&#12425;&#12522;&#12522;&#12540;&#12473;)
http://svn.scanley.org/repos/svn/tags/2.5.0/

 &#26032;&#27231;&#33021;&#12289;&#25913;&#33391;&#28857;:
    * &#27491;&#35215;&#34920;&#29694;&#12395;&#12424;&#12427;&#21839;&#12356;&#21512;&#12431;&#12379;&#12434;&#36861;&#21152; (&#21839;&#38988; #53)
    * UTF-8 &#12392; UTF-16 &#12391;&#26360;&#12363;&#12428;&#12383;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12469;&#12509;&#12540;&#12488;&#12434;&#36861;&#21152;
    * &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364; &#12509;&#12540;&#12521;&#12531;&#12489;&#35486;&#12289;&#12525;&#12471;&#12450;&#35486;&#12289;&#12510;&#12480;&#12460;&#12473;&#12459;&#12523;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12383;&#12290;
    * ...

 &#12496;&#12464;&#20462;&#27491;:
    * &#20877;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#26178;&#12398;&#12496;&#12464;&#12434;&#20462;&#27491; (&#21839;&#38988; #945)
    * &#21839;&#12356;&#21512;&#12431;&#12379;&#12395;&#38306;&#12377;&#12427;&#12496;&#12464;&#12434;&#12356;&#12367;&#12388;&#12363;&#20462;&#27491; (&#21839;&#38988; #815, #1007, #1008)
    * ...
</pre><p>
    &#22793;&#26356;&#28857;&#12398;&#19968;&#35239;&#12399;&#12289;&#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12393;&#12428;&#12384;&#12369;&#38263;&#12367;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#23567;&#12373;&#12394;&#12496;&#12464;&#20462;&#27491;&#12420;&#27231;&#33021;&#36861;&#21152;&#12434;&#20840;&#12390;&#21547;&#12417;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12289;&#20869;&#23481;&#12364;&#36864;&#23624;&#12395;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#30446;&#30340;&#12399;&#12289;&#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12391;&#24471;&#12425;&#12428;&#12427;&#12418;&#12398;&#12398;&#27010;&#35201;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#31034;&#12377;&#12384;&#12369;&#12391;&#12377;&#12290;
    &#23455;&#38555;&#12289;&#22793;&#26356;&#28857;&#12398;&#19968;&#35239;&#12399;&#12522;&#12522;&#12540;&#12473;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#38651;&#23376;&#12513;&#12540;&#12523;&#12395;&#26360;&#12367;&#12371;&#12392;&#12364;&#26222;&#36890;&#12394;&#12398;&#12391;&#12289;
    &#12381;&#12428;&#12434;&#35211;&#12427;&#20154;&#12398;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#26360;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sidebar" title="CHANGES &#12501;&#12449;&#12452;&#12523;&#12392; ChangeLog &#12501;&#12449;&#12452;&#12523;"><a name="changelog"></a><div class="titlepage"><div><div><p class="title"><b>CHANGES &#12501;&#12449;&#12452;&#12523;&#12392; ChangeLog &#12501;&#12449;&#12452;&#12523;</b></p></div></div></div><p>
       &#20253;&#32113;&#30340;&#12395; <em class="firstterm">ChangeLog</em> &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;
       &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12371;&#12428;&#12414;&#12391;&#34892;&#12431;&#12428;&#12383;&#12354;&#12425;&#12422;&#12427;&#22793;&#26356;&#12434;&#19968;&#35239;&#12395;&#12375;&#12414;&#12377;&#12290;
       &#8212; &#12388;&#12414;&#12426;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12383;&#20840;&#12390;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12391;&#12377;&#12290;
       ChangeLog &#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#27096;&#12293;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
       &#12393;&#12435;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12418;&#21516;&#12376;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
       &#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12398;&#35443;&#32048;&#12399;&#12371;&#12371;&#12391;&#12399;&#37325;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
       &#12381;&#12398;&#24773;&#22577;&#12392;&#12399;&#12289;&#22793;&#26356;&#26085;&#12289;&#22793;&#26356;&#12375;&#12383;&#20154;&#12289;&#22793;&#26356;&#12395;&#38306;&#12377;&#12427;&#31777;&#21336;&#12394;&#35201;&#32004;(&#12414;&#12383;&#12399;&#21336;&#12395;&#12381;&#12398;&#22793;&#26356;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#65289;&#12391;&#12377;&#12290;
   </p><p>
       <code class="filename">CHANGES</code> &#12501;&#12449;&#12452;&#12523;&#12399;&#36949;&#12356;&#12414;&#12377;&#12290;
       &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#22793;&#26356;&#28857;&#12434;&#19968;&#35239;&#12395;&#12377;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
       &#12354;&#12427;&#20154;&#36948;&#12364;&#35211;&#12390;&#37325;&#35201;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12418;&#12398;&#12418;&#19968;&#35239;&#12395;&#21152;&#12360;&#12414;&#12377;&#12290;
       &#12381;&#12375;&#12390;&#27491;&#30906;&#12394;&#22793;&#26356;&#26085;&#12420;&#22793;&#26356;&#12375;&#12383;&#20154;&#12398;&#12424;&#12358;&#12394;&#12513;&#12479;&#12487;&#12540;&#12479;&#12399;&#12424;&#12367;&#30465;&#30053;&#12373;&#12428;&#12414;&#12377;&#12290;
       &#28151;&#20081;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12289;CHANGES &#12392; ChangeLog &#12501;&#12449;&#12452;&#12523;&#12434;&#21516;&#12376;&#24847;&#21619;&#12391;&#20351;&#12431;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
       &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;"CHANGELOG" &#12391;&#12399;&#12394;&#12367;&#12289;
       "NEWS" &#12392;&#12356;&#12358;&#12501;&#12449;&#12452;&#12523;&#21517;&#12434;&#20351;&#12358;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
       &#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391; "ChangeLog" &#12392;&#12398;&#28151;&#21516;&#12399;&#36991;&#12369;&#12425;&#12428;&#12414;&#12377;&#12364;&#12289;
       &#12371;&#12398;&#21517;&#21069;&#12399;&#12404;&#12387;&#12383;&#12426;&#26469;&#12427;&#21517;&#21069;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
       CHANGES &#12501;&#12449;&#12452;&#12523;&#12399;&#20840;&#12390;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#22793;&#26356;&#28857;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
       &#20808;&#38957;&#12395;&#26360;&#12356;&#12390;&#12354;&#12427;&#26368;&#26032;&#12398;&#12491;&#12517;&#12540;&#12473;&#12395;&#21152;&#12360;&#12390;&#12289;
       &#12383;&#12367;&#12373;&#12435;&#12398;&#21476;&#12356;&#12491;&#12517;&#12540;&#12473;&#12418;&#25522;&#36617;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
   </p><p>
       ChangeLog &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#24464;&#12293;&#12395;&#28040;&#12360;&#12388;&#12388;&#12354;&#12427;&#12418;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
       &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;CVS&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#21807;&#19968;&#12398;&#36984;&#25246;&#32930;&#12384;&#12387;&#12383;&#26178;&#20195;&#12395;&#12399;&#24441;&#12395;&#31435;&#12388;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
       &#12394;&#12380;&#12394;&#12425;&#12289;CVS&#12391;&#12399;&#22793;&#26356;&#28857;&#12398;&#24773;&#22577;&#12364;&#23637;&#38283;&#12375;&#12395;&#12367;&#12363;&#12387;&#12383;&#12363;&#12425;&#12391;&#12377;&#12290;
       &#12375;&#12363;&#12375;&#12289;&#26368;&#36817;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12358;&#12392;&#12289;
       ChangeLog&#12391;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12383;&#12487;&#12540;&#12479;&#12399;&#12289;
       &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#35201;&#27714;&#12377;&#12427;&#12371;&#12392;&#12391;&#12356;&#12388;&#12391;&#12418;&#24341;&#12365;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
       &#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22793;&#26356;&#28857;&#12434;&#38745;&#30340;&#12394;&#12501;&#12449;&#12452;&#12523;&#12395;&#20445;&#23384;&#12377;&#12427;&#24847;&#21619;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
       &#8212; &#23455;&#38555;&#12395;&#12399;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#20445;&#23384;&#12373;&#12428;&#12383;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;
       ChangeLog &#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12392;&#37325;&#35079;&#12377;&#12427;&#12384;&#12369;&#12394;&#12398;&#12391;&#12289;&#12418;&#12387;&#12392;&#28961;&#24847;&#21619;&#12394;&#12371;&#12392;&#12364;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;
   </p></div><p>
    &#12484;&#12522;&#12540;&#12395;&#12354;&#12427;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12399;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12363;&#12425;&#30452;&#25509;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12481;&#12455;&#12483;&#12463;&#12450;&#12454;&#12488;&#12375;&#12383;&#12392;&#12365;&#12395;&#24471;&#12425;&#12428;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12363;&#12289;
    &#12391;&#12365;&#12427;&#12384;&#12369;&#20284;&#12383;&#12418;&#12398;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12425;&#12398;&#38291;&#12395;&#12399;&#23569;&#12375;&#36949;&#12356;&#12364;&#12354;&#12427;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12399;&#35373;&#23450;&#12420;&#12467;&#12531;&#12497;&#12452;&#12523;&#12395;&#24517;&#35201;&#12394;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;(<span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span><a class="xref" href="packaging.html#packaging-build-install" title="&#12467;&#12531;&#12497;&#12452;&#12523;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;">&#12300;&#12467;&#12531;&#12497;&#12452;&#12523;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12383;&#12426;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#31649;&#29702;&#12375;&#12390;&#12356;&#12394;&#12356;&#12364;&#12289;&#24517;&#38920;&#12398;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#12426;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#12414;&#12384;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12356;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12383;&#12392;&#12360;&#37197;&#24067;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12364;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12354;&#12427;&#38283;&#30330;&#12484;&#12522;&#12540;&#12392;&#20840;&#12367;&#21516;&#12376;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
   &#12381;&#12398;&#37197;&#24067;&#29289;&#12399;&#20316;&#26989;&#12467;&#12500;&#12540;&#12392;&#21516;&#12376;&#12391;&#12354;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;(<a class="xref" href="vc.html#vc-vocabulary-working-copy"><em class="firstterm">&#20316;&#26989;&#12467;&#12500;&#12540;</em></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
    &#12354;&#12427;&#12522;&#12522;&#12540;&#12473;&#12399;&#12289;&#38283;&#30330;&#12484;&#12522;&#12540;&#12408;&#12398;&#38745;&#30340;&#12394;&#21442;&#29031;&#12509;&#12452;&#12531;&#12488;&#12391;&#12377;&#12290;
    &#8212; &#12371;&#12428;&#12399;&#29305;&#12395;&#12289;&#12354;&#12427;&#26178;&#28857;&#12398;&#22266;&#23450;&#12373;&#12428;&#12383;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#35373;&#23450; &#12434;&#34920;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12418;&#12375;&#37197;&#24067;&#29289;&#12364;&#20316;&#26989;&#12467;&#12500;&#12540;&#12392;&#21516;&#12376;&#12384;&#12392;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12381;&#12428;&#12434;&#22793;&#26356;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12414;&#12383;&#12289;&#23455;&#38555;&#12395;&#22793;&#26356;&#12375;&#12383;&#24460;&#12391;&#12522;&#12522;&#12540;&#12473;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12427;&#12392;&#21361;&#38522;&#12391;&#12377;&#12290;
</p><p>
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20013;&#36523;&#12399;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;&#12398;&#12420;&#12426;&#26041;&#12395;&#38306;&#12431;&#12425;&#12378;&#21516;&#12376;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#8212;&#12388;&#12414;&#12426;&#12289;"Scanley 2.5.0" &#12392;&#21628;&#12406;&#22580;&#21512;&#12395;&#21442;&#29031;&#12377;&#12427;&#27491;&#30906;&#12394;&#12418;&#12398;&#12399;&#12289;
    zip&#12420;tar&#12508;&#12540;&#12523;&#12434;&#23637;&#38283;&#12375;&#12383;&#12392;&#12365;&#12395;&#29983;&#25104;&#12373;&#12428;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12371;&#12428;&#12425;&#20840;&#12390;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29992;&#12395;&#25552;&#20379;&#12375;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
</p><div class="informalexample"><div class="literallayout"><p>scanley-2.5.0.tar.bz2<br>
scanley-2.5.0.tar.gz<br>
scanley-2.5.0.zip</p></div></div><p>
    &#12375;&#12363;&#12375;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#23637;&#38283;&#12375;&#12390;&#29983;&#25104;&#12373;&#12428;&#12427;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12399;&#20840;&#12390;&#21516;&#12376;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12399;&#37197;&#24067;&#29289;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12398;&#20415;&#23452;&#12398;&#12383;&#12417;&#12384;&#12369;&#12395;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
    &#12477;&#12540;&#12473;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#36949;&#12356;&#12364;&#12354;&#12387;&#12390;&#12418;&#35377;&#12373;&#12428;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;Windows&#29992;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#12399;&#12289;
    &#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12398;&#34892;&#12399;CRLF(&#12461;&#12515;&#12522;&#12483;&#12472;&#12522;&#12479;&#12540;&#12531;&#12392;&#12521;&#12452;&#12531;&#12501;&#12451;&#12540;&#12489;)&#12467;&#12540;&#12489;&#12391;&#32066;&#12431;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12391;Unix&#29992;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#12399;&#12289;LF&#12391;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
    &#20206;&#12395;&#30064;&#12394;&#12387;&#12383;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#38291;&#12391;&#36949;&#12358;&#12467;&#12531;&#12497;&#12452;&#12523;&#29992;&#12398;&#12524;&#12452;&#12450;&#12454;&#12488;&#12364;&#24517;&#35201;&#12394;&#12425;&#12289;
    &#30064;&#12394;&#12387;&#12383;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#29992;&#12398;&#12477;&#12540;&#12473;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#12399;&#12289;
    &#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12364;&#23569;&#12375;&#30064;&#12394;&#12387;&#12390;&#12356;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12358;&#12375;&#12383;&#36949;&#12356;&#12399;&#22522;&#26412;&#30340;&#12395;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#22793;&#25563;&#12391;&#28168;&#12414;&#12379;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#22522;&#26412;&#30340;&#12394;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#21516;&#12376;&#12522;&#12522;&#12540;&#12473;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#31684;&#22258;&#12391;&#12399;&#21516;&#12376;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><div class="sect3" title="&#22823;&#25991;&#23383;&#12395;&#12377;&#12427;&#12363;&#12289;&#23567;&#25991;&#23383;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12363;"><div class="titlepage"><div><div><h4 class="title"><a name="release-capitalization"></a>&#22823;&#25991;&#23383;&#12395;&#12377;&#12427;&#12363;&#12289;&#23567;&#25991;&#23383;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12363;</h4></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12434;&#24341;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#26222;&#36890;&#12399;&#36969;&#24403;&#12394;&#21517;&#35422;&#12434;&#22823;&#25991;&#23383;&#12395;&#12375;&#12289;
    &#12418;&#12375;&#38957;&#25991;&#23383;&#12384;&#12369;&#12434;&#22823;&#25991;&#23383;&#12395;&#12377;&#12427;&#21336;&#35486;&#12364;&#12354;&#12428;&#12400;&#12289;&#12381;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400; "MySQL 5.0", "Scanley 2.5.0" &#12394;&#12393;&#12391;&#12377;&#12290;
    &#22823;&#25991;&#23383;&#12398;&#34920;&#29694;&#12434;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12391;&#12418;&#20351;&#12358;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;<code class="filename">Scanley-2.5.0.tar.gz</code> &#12392; <code class="filename">scanley-2.5.0.tar.gz</code> &#12398;&#12393;&#12385;&#12425;&#12364;&#12424;&#12356;&#12363;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;(&#31169;&#12399;&#24460;&#32773;&#12364;&#22909;&#12365;&#12391;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12471;&#12501;&#12488;&#12461;&#12540;&#12434;&#20154;&#12395;&#25171;&#12383;&#12379;&#12427;&#12398;&#12364;&#23244;&#12384;&#12363;&#12425;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#22823;&#25991;&#23383;&#12434;&#20351;&#12358;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12383;&#12367;&#12373;&#12435;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20986;&#33655;&#12373;&#12379;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;)
    &#37325;&#35201;&#12394;&#12398;&#12399;&#12289;tar&#12508;&#12540;&#12523;&#12434;&#23637;&#38283;&#12375;&#12383;&#12392;&#12365;&#12395;&#20316;&#12425;&#12428;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12364;&#21516;&#12376;&#21517;&#21069;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12391;&#12377;&#12290;
    &#12518;&#12540;&#12470;&#12540;&#12434;&#39514;&#12363;&#12379;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#37197;&#24067;&#29289;&#12434;&#23637;&#38283;&#12375;&#12390;&#29983;&#25104;&#12373;&#12428;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#21517;&#12399;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12364;&#27491;&#30906;&#12395;&#20104;&#28204;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect3" title="&#12503;&#12524;&#12522;&#12522;&#12540;&#12473;&#29256;"><div class="titlepage"><div><div><h4 class="title"><a name="release-prereleases"></a>&#12503;&#12524;&#12522;&#12522;&#12540;&#12473;&#29256;</h4></div></div></div><p>
    &#12503;&#12524;&#12522;&#12522;&#12540;&#12473;&#29256;&#12414;&#12383;&#12399;&#12522;&#12522;&#12540;&#12473;&#20505;&#35036;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12381;&#12398;&#35672;&#21029;&#23376;&#12399;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#19968;&#37096;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12395;&#12381;&#12398;&#35672;&#21029;&#23376;&#12434;&#21547;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;<a class="xref" href="development-cycle.html#release-number-components" title="&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#27083;&#25104;&#35201;&#32032;">&#12300;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12398;&#27083;&#25104;&#35201;&#32032;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12383;&#12450;&#12523;&#12501;&#12449;&#29256;&#12420;&#12505;&#12540;&#12479;&#29256;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#38918;&#30058;&#12399;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12391;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#34920;&#29694;&#12375;&#12414;&#12377;&#12290;
</p><div class="informalexample"><div class="literallayout"><p>scanley-2.3.0-alpha1.tar.gz<br>
scanley-2.3.0-alpha2.tar.gz<br>
scanley-2.3.0-beta1.tar.gz<br>
scanley-2.3.0-beta2.tar.gz<br>
scanley-2.3.0-beta3.tar.gz<br>
scanley-2.3.0.tar.gz</p></div></div><p>
    &#12399;&#12376;&#12417;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289;<code class="filename">scanley-2.3.0-alpha1</code>&#12392;&#12356;&#12358;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#23637;&#38283;&#12373;&#12428;&#12289;&#12405;&#12383;&#12388;&#12417;&#12399; <code class="filename">scanley-2.3.0-alpha2</code> &#12395;&#23637;&#38283;&#12373;&#12428;&#12427; ... &#12394;&#12393;&#12391;&#12377;&#12290;
</p></div></div><div class="sect2" title="&#12467;&#12531;&#12497;&#12452;&#12523;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;"><div class="titlepage"><div><div><h3 class="title"><a name="packaging-build-install"></a>&#12467;&#12531;&#12497;&#12452;&#12523;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</h3></div></div></div><p>
    &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;
    &#32076;&#39443;&#35914;&#23500;&#12394;&#12518;&#12540;&#12470;&#12540;&#12364;&#24467;&#12358;&#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;C, C++, &#12381;&#12398;&#20182;&#12398;&#12467;&#12531;&#12497;&#12452;&#12523;&#35328;&#35486;&#12391;&#26360;&#12363;&#12428;&#12383;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12399;&#12289;
    Unix&#12521;&#12452;&#12463;&#12394;&#12471;&#12473;&#12486;&#12512;&#12391;&#12518;&#12540;&#12470;&#12540;&#12364;&#12479;&#12452;&#12503;&#12377;&#12427;&#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><pre class="screen">
   $ ./configure
   $ make
   # make install
</pre><p>
    &#12399;&#12376;&#12417;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#33258;&#21205;&#30340;&#12395;&#23455;&#34892;&#29872;&#22659;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#25226;&#25569;&#12375;&#12289;&#12499;&#12523;&#12489;&#12398;&#28310;&#20633;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12499;&#12523;&#12489;&#12375;&#12414;&#12377;&#12290;&#65288;&#12375;&#12363;&#12375;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#34892;&#12356;&#12414;&#12379;&#12435;&#65289;
    &#26368;&#24460;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12471;&#12473;&#12486;&#12512;&#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
    &#26368;&#21021;&#12398;&#12405;&#12383;&#12388;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#36890;&#24120;&#12398;&#12518;&#12540;&#12470;&#12540;&#12391;&#23455;&#34892;&#12375;&#12289;&#26368;&#24460;&#12399;root&#12518;&#12540;&#12470;&#12540;&#12391;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12434;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#20316;&#26989;&#12398;&#35443;&#32048;&#12399;&#12289;Vaughan, Elliston, Tromey,
    Taylor &#12364;&#26360;&#12356;&#12383; <em class="citetitle">GNU Autoconf, Automake,
    and Libtool</em> &#12392;&#12356;&#12358;&#20778;&#12428;&#12383;&#26412;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#12381;&#12428;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12371;&#12398;&#26412;&#12399; &#20986;&#29256;&#31038; New Riders &#12395;&#12424;&#12387;&#12390;&#12484;&#12522;&#12540;&#12454;&#12455;&#12450;<sup>[<a name="idp2507936" href="#ftn.idp2507936" class="footnote">27</a>]</sup>&#12392;&#12375;&#12390;&#20844;&#38283;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
    <a class="ulink" href="http://sources.redhat.com/autobook/" target="_top">http://sources.redhat.com/autobook/</a> &#12391;&#12418;&#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#25163;&#38918;&#12364;&#21807;&#19968;&#12398;&#27161;&#28310;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12418;&#12387;&#12392;&#12418;&#26222;&#21450;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
    Ant (<a class="ulink" href="http://ant.apache.org/" target="_top">http://ant.apache.org/</a>) &#12499;&#12523;&#12489;&#12471;&#12473;&#12486;&#12512;&#12364;&#29305;&#12395;Java&#12391;&#26360;&#12363;&#12428;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20154;&#27671;&#12434;&#24471;&#12388;&#12388;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;Ant&#12418;&#12499;&#12523;&#12489;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12398;&#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#21516;&#27096;&#12395;&#12289;Perl&#12420;Python&#12398;&#12424;&#12358;&#12394;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12391;&#12399;&#12289;
    &#12381;&#12398;&#35328;&#35486;&#12391;&#26360;&#12363;&#12428;&#12383;&#27526;&#12393;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#21516;&#12376;&#25163;&#38918;&#12434;&#20351;&#12358;&#12371;&#12392;&#12434;&#21223;&#12417;&#12390;&#12356;&#12414;&#12377;(&#12383;&#12392;&#12360;&#12400;&#12289;Perl&#12514;&#12472;&#12517;&#12540;&#12523;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    <span class="command"><strong>perl Makefile.PL</strong></span>)
    &#33258;&#20998;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12393;&#12398;&#27161;&#28310;&#12434;&#20351;&#12358;&#12363;&#12364;&#12431;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#32076;&#39443;&#35914;&#23500;&#12394;&#38283;&#30330;&#32773;&#12395;&#23563;&#12397;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;<sup>[<a name="idp2513232" href="#ftn.idp2513232" class="footnote">28</a>]</sup>&#12290;
    &#12383;&#12392;&#12360;&#12393;&#12398;&#27161;&#28310;&#12434;&#20351;&#12358;&#12363;&#12364;&#12399;&#12376;&#12417;&#12431;&#12363;&#12425;&#12394;&#12367;&#12390;&#12418;&#12289;
    &#36969;&#29992;&#12391;&#12365;&#12427;&#27161;&#28310;&#12364; <span class="emphasis"><em>&#23384;&#22312;&#12377;&#12427;</em></span> &#12392;&#24605;&#12387;&#12390;&#12418;&#22823;&#19976;&#22827;&#12391;&#12377;&#12290;
</p><p>
    &#33258;&#20998;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36969;&#12375;&#12383;&#27161;&#28310;&#12364;&#20309;&#12391;&#12354;&#12428;&#12289;
    &#12420;&#12416;&#12434;&#24471;&#12394;&#12356;&#22580;&#21512;&#20197;&#22806;&#12399;&#12381;&#12428;&#12434;&#30772;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#27161;&#28310;&#30340;&#12394;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#25163;&#38918;&#12399;&#12289;&#12383;&#12367;&#12373;&#12435;&#12398;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12364;&#21453;&#23556;&#30340;&#12395;&#23455;&#36341;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; <code class="filename">INSTALL</code>&#12501;&#12449;&#12452;&#12523; &#12395;&#33258;&#20998;&#12364;&#39348;&#26579;&#12435;&#12384;&#25163;&#38918;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12398;&#12364;&#12431;&#12363;&#12428;&#12400;&#12289;
    &#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#27161;&#28310;&#30340;&#12394;&#35215;&#32004;&#12434;&#23432;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#20449;&#38972;&#12434;&#12377;&#12368;&#12395;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;
    &#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12434;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#35352;&#12377;&#12371;&#12392;&#12391;&#12289;&#20182;&#12398;&#12371;&#12392;&#12418;&#29702;&#35299;&#12375;&#12420;&#12377;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12414;&#12383;&#12289;<span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a>&#12398;</span> <a class="xref" href="getting-started.html#downloads" title="&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;">&#12300;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12301;</a> &#12391;&#12418;&#35696;&#35542;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#27161;&#28310;&#30340;&#12394;&#12499;&#12523;&#12489;&#25163;&#38918;&#12364;&#12354;&#12427;&#12392;&#12289;&#38283;&#30330;&#32773;&#12395;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#20154;&#12418;&#21916;&#12435;&#12391;&#12367;&#12428;&#12414;&#12377;&#12290;
</p><p>
    Windows &#12391;&#12399;&#12289;&#12499;&#12523;&#12489;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12398;&#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12364;Unix&#12521;&#12452;&#12463;&#12394;&#12471;&#12473;&#12486;&#12512;&#12411;&#12393;&#27770;&#12414;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
    Microsoft &#12398;&#27161;&#28310;&#30340;&#12394;&#38283;&#30330;&#29872;&#22659;(Developer Studio, Visual Studio, VS.NET, MSVC++,
    &#12394;&#12393;)&#12398; &#12527;&#12540;&#12463;&#12473;&#12506;&#12540;&#12473;/&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12514;&#12487;&#12523;&#12395;&#21512;&#12387;&#12383;&#24418;&#12391;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12371;&#12392;&#12364;&#27161;&#28310;&#30340;&#12394;&#35215;&#32004;&#12398;&#12424;&#12358;&#12391;&#12377;&#12290;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#24615;&#36074;&#12395;&#12418;&#12424;&#12426;&#12414;&#12377;&#12364;&#12289;Cygwin&#29872;&#22659;(<a class="ulink" href="http://www.cygwin.com/" target="_top">http://www.cygwin.com/</a>)&#32076;&#30001;&#12391;Unix&#12521;&#12452;&#12463;&#12394;&#12499;&#12523;&#12489;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#33258;&#21069;&#12398;&#12499;&#12523;&#12489;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#25163;&#38918;&#12364;&#12354;&#12427;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12420;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#8212;e.g Perl &#12420; Python &#12398;&#12424;&#12358;&#12394;&#8212; &#12364;&#12354;&#12427;&#12392;&#12365;&#12399;&#12289;
    &#29872;&#22659;&#12364; Windows, Unix, Mac OS X, &#12354;&#12427;&#12356;&#12399;&#20182;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
    &#12381;&#12428;&#12364;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#27161;&#28310;&#30340;&#12394;&#25163;&#38918;&#12434;&#25505;&#29992;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
    &#27161;&#28310;&#30340;&#12394;&#12499;&#12523;&#12489;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#25163;&#38918;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#21512;&#12431;&#12379;&#12427;&#21162;&#21147;&#12434;&#24796;&#12375;&#12414;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12499;&#12523;&#12489;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12358;&#20837;&#21475;&#12392;&#12394;&#12427;&#20316;&#26989;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12434;&#32066;&#12360;&#12383;&#12425;&#12289;&#12420;&#12416;&#12434;&#24471;&#12394;&#12356;&#12394;&#12425;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#25201;&#12356;&#12395;&#12367;&#12367;&#12390;&#12418;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12518;&#12540;&#12470;&#12540;&#12420;&#38283;&#30330;&#32773;&#12364;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#35302;&#12428;&#12427;&#26368;&#21021;&#12398;&#27573;&#38542;&#12391;&#12289;
    &#20104;&#24819;&#22806;&#12398;&#25163;&#38918;&#12434;&#36367;&#12416;&#24517;&#35201;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;&#12381;&#12428;&#12399;&#24677;&#12378;&#12363;&#12375;&#12356;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;"><div class="titlepage"><div><div><h3 class="title"><a name="binary-packages"></a>&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;</h3></div></div></div><p>
    &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;&#12375;&#12390;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12398;&#12364;&#27491;&#24335;&#12394;&#12420;&#12426;&#26041;&#12391;&#12377;&#12364;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#37197;&#24067;&#12471;&#12473;&#12486;&#12512;&#12420;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#33258;&#20307;&#12420;&#12289;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12363;&#12425;&#21462;&#24471;&#12375;&#12383;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12356;&#12358; "&#12496;&#12452;&#12490;&#12522;" &#12392;&#12356;&#12358;&#12398;&#12399;&#24517;&#12378;&#12375;&#12418; "&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12390;&#29983;&#25104;&#12375;&#12383;&#12418;&#12398;" &#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12371;&#12391;&#12399;&#21336;&#12395;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12499;&#12523;&#12489;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#25163;&#38918;&#12434;&#32076;&#12378;&#12395;&#12289;
    &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#35373;&#23450;&#28168;&#12415;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12371;&#12392;&#12434;&#12356;&#12356;&#12414;&#12377;&#12290;
    RedHat GNU/Linux &#12391;&#12399;&#12289;&#12381;&#12398;&#20181;&#32068;&#12415;&#12399;RPM&#12471;&#12473;&#12486;&#12512;&#12392;&#21628;&#12400;&#12428;&#12289;Debian GNU/Linux &#12391;&#12399;&#12289;
    APT (<code class="filename">.deb</code>) &#12471;&#12473;&#12486;&#12512;&#12392;&#12356;&#12356;&#12414;&#12377;&#12290;Microsoft Windows &#12391;&#12399;&#12289;
    <code class="literal">.MSI</code> &#12501;&#12449;&#12452;&#12523; &#12420;&#12289;&#23455;&#34892;&#12377;&#12428;&#12400;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#34892;&#12387;&#12390;&#12367;&#12428;&#12427; <code class="literal">.exe</code> &#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
</p><p>
    &#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20316;&#12427;&#20154;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#28145;&#12367;&#38306;&#12431;&#12387;&#12390;&#12356;&#12427;&#20154;&#12391;&#12354;&#12428;&#12289;
    &#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12391;&#12354;&#12428;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#12381;&#12428;&#12425;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20844;&#24335;&#12394;&#12522;&#12522;&#12540;&#12473;&#12392;&#12375;&#12390;<span class="emphasis"><em>&#25201;&#12356;</em></span>&#12289;
    &#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12390;&#12496;&#12464;&#22577;&#21578;&#12471;&#12473;&#12486;&#12512;&#12395;&#21839;&#38988;&#12434;&#30331;&#37682;&#12375;&#12390;&#12365;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12395;&#26126;&#30906;&#12394;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#25552;&#20379;&#12375;&#12289;
    &#24444;&#12425;&#12364;&#25552;&#20379;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#36969;&#20999;&#12395;&#34920;&#29694;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#24444;&#12425;&#12392;&#32202;&#23494;&#12395;&#36899;&#25658;&#12377;&#12427;&#12371;&#12392;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38306;&#24515;&#20107;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12364;&#20027;&#12395;&#30693;&#12387;&#12390;&#12362;&#12367;&#12409;&#12365;&#12371;&#12392;&#12399;&#12289;&#29983;&#25104;&#12377;&#12427;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#12458;&#12501;&#12451;&#12471;&#12515;&#12523;&#12394;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#20803;&#12395;&#12377;&#12409;&#12365;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12518;&#12540;&#12470;&#12540;&#12395;&#12496;&#12464;&#20462;&#27491;&#12420;&#27231;&#33021;&#36861;&#21152;&#12434;&#25552;&#20379;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12399;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12467;&#12500;&#12540;&#12420;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#24460;&#12395;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12383;&#20462;&#27491;&#12434;&#36984;&#12435;&#12391;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12371;&#12358;&#12375;&#12383;&#32722;&#24931;&#12399;&#12289;&#23455;&#38555;&#12395;&#12399;&#22810;&#12367;&#12398;&#28151;&#20081;&#12434;&#24341;&#12365;&#12362;&#12371;&#12375;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12522;&#12522;&#12540;&#12473;&#28168;&#12415;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#35211;&#12388;&#12363;&#12387;&#12383;&#12496;&#12464;&#22577;&#21578;&#12420;&#12289;
    &#26368;&#36817;&#12398; trunk &#12420;&#20027;&#35201;&#12394;&#12502;&#12521;&#12531;&#12481;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#12496;&#12464;&#22577;&#21578;&#65288;&#12388;&#12414;&#12426;&#12289;
    &#27880;&#24847;&#28145;&#12367;&#26368;&#20808;&#31471;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#35211;&#12388;&#12369;&#12383;&#12496;&#12464;&#65289;&#12434;&#21463;&#12369;&#20184;&#12369;&#12427;&#28310;&#20633;&#12434;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12496;&#12464;&#22577;&#21578;&#12364;&#12354;&#12364;&#12387;&#12390;&#12367;&#12427;&#12392;&#12289;
    &#24540;&#31572;&#12377;&#12427;&#20154;&#12399;&#12381;&#12398;&#12496;&#12464;&#12364;&#12354;&#12427;&#26178;&#28857;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12391;&#30330;&#29983;&#12375;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12420;&#12289;
    &#20462;&#27491;&#28168;&#12415;&#12391;&#12354;&#12427;&#12371;&#12392;&#12289;&#12381;&#12375;&#12390;&#12518;&#12540;&#12470;&#12540;&#12364;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12409;&#12365;&#12363;&#12289;
    &#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#24453;&#12388;&#12409;&#12365;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#20206;&#12395;&#12414;&#12384;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12464;&#12398;&#22580;&#21512;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12398;&#26178;&#28857;&#12364;&#26126;&#30906;&#12391;&#12354;&#12428;&#12400;&#12289;
    &#12381;&#12428;&#12398;&#20877;&#29694;&#12420;&#12496;&#12464;&#22577;&#21578;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#12398;&#12496;&#12464;&#12398;&#20998;&#39006;&#12418;&#12420;&#12426;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#25913;&#36896;&#12434;&#21152;&#12360;&#12383;&#12418;&#12398;&#12420;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#27770;&#12414;&#12387;&#12390;&#12356;&#12394;&#12356;&#20013;&#38291;&#30340;&#12394;&#12467;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#12496;&#12464;&#22577;&#21578;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#21463;&#12369;&#20184;&#12369;&#12427;&#28310;&#20633;&#12364;&#12391;&#12365;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12358;&#12375;&#12383;&#22577;&#21578;&#12399;&#20877;&#29694;&#12373;&#12379;&#12427;&#12398;&#12364;&#38627;&#12375;&#12367;&#12289;
    &#24460;&#12398;&#38283;&#30330;&#12391;&#21152;&#12360;&#12425;&#12428;&#12427;&#21029;&#12398;&#22793;&#26356;&#12395;&#20104;&#24819;&#22806;&#12398;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#21487;&#33021;&#24615;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12383;&#12417;&#12289;&#38283;&#30330;&#32773;&#12364;&#36012;&#20219;&#12434;&#21462;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#19981;&#27491;&#12394;&#25391;&#33310;&#12356;&#12434;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#36215;&#12371;&#12375;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
    &#36942;&#21435;&#12395;&#30330;&#29983;&#12375;&#12390;&#12356;&#12383;&#12399;&#12378;&#12398;&#12496;&#12464;&#12364; <span class="emphasis"><em>&#30330;&#29983;&#12375;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;</em></span> &#12383;&#12417;&#12395;&#12289;
    &#22810;&#12367;&#12398;&#26178;&#38291;&#12434;&#28010;&#36027;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12370;&#12435;&#12394;&#12426;&#12375;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12518;&#12540;&#12470;&#12540;&#12364;&#20844;&#24335;&#12398;&#12522;&#12522;&#12540;&#12473;(&#20840;&#12367;&#21516;&#12376;&#12391;&#12399;&#12394;&#12356;)&#12395;&#12385;&#12423;&#12387;&#12392;&#25913;&#36896;&#12434;&#21152;&#12360;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12356;&#12383;&#12383;&#12417;&#12391;&#12377;&#12290;
    &#12496;&#12464;&#12364;&#30330;&#29983;&#12375;&#12394;&#12363;&#12387;&#12383;&#12398;&#12364;&#20104;&#24819;&#22806;&#12384;&#12387;&#12383;&#12398;&#12391;&#12289;
    &#38283;&#30330;&#32773;&#20840;&#21729;&#12364;&#12381;&#12398;&#29702;&#30001;&#12434;&#35519;&#12409;&#12427;&#12383;&#12417;&#12395;&#35443;&#32048;&#12394;&#35519;&#26619;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
</p><p>
    &#12373;&#12425;&#12395;&#12289;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#12399;&#22793;&#26356;&#12364;&#24517;&#35201;&#12384;&#12392;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12364;&#20027;&#24373;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#12395;&#12371;&#12358;&#12375;&#12383;&#22793;&#26356;&#12434;&#22577;&#21578;&#12375;&#12289;&#22793;&#26356;&#12398;&#35336;&#30011;&#12434;&#35500;&#26126;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12364;&#21152;&#12360;&#12383;&#22793;&#26356;&#12399;&#12289;&#38283;&#30330;&#32773;&#12364;&#21463;&#12369;&#20837;&#12428;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#21463;&#12369;&#20837;&#12428;&#12390;&#12418;&#12425;&#12360;&#12394;&#12367;&#12390;&#12418;&#12289;&#33258;&#20998;&#12364;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#29702;&#30001;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#30693;&#12425;&#12379;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20104;&#24819;&#22806;&#12398;&#12496;&#12464;&#22577;&#21578;&#12434;&#35211;&#24373;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#20813;&#36012;&#20107;&#38917;&#12434;&#35352;&#36617;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#12496;&#12464;&#22577;&#21578;&#12395;&#23550;&#24540;&#12375;&#12390;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12414;&#12383;&#12289;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12289;
    &#33258;&#20998;&#12383;&#12385;&#12364;&#20351;&#12387;&#12390;&#12356;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20844;&#24335;&#12395;&#12522;&#12522;&#12540;&#12473;&#12375;&#12383;&#12418;&#12398;&#12392;&#12399;&#27491;&#30906;&#12395;&#21516;&#12376;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12434;&#30693;&#12425;&#12379;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#36969;&#20999;&#12394;&#22580;&#25152;&#12391;&#20316;&#26989;&#12434;&#12377;&#12427;&#12424;&#12358;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12395;&#27714;&#12417;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#29366;&#27841;&#12391;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12392;&#38283;&#30330;&#32773;&#12364;&#12356;&#12364;&#12415;&#21512;&#12358;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#23550;&#31435;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;&#30446;&#25351;&#12377;&#12418;&#12398;&#12364;&#38283;&#30330;&#32773;&#12392;&#23569;&#12375;&#36949;&#12358;&#12384;&#12369;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12399;&#12518;&#12540;&#12470;&#12540;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12428;&#12400;&#12377;&#12368;&#12395;&#20351;&#12360;&#12427;&#12418;&#12398;&#12434;&#20027;&#12395;&#27714;&#12417;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12418;&#12418;&#12385;&#12429;&#12435;&#12381;&#12428;&#12434;&#36861;&#27714;&#12375;&#12390;&#12399;&#12356;&#12414;&#12377;&#12364;&#12289;&#24444;&#12425;&#12399;&#19968;&#36011;&#12375;&#12383;&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#20184;&#12369;&#12289;
    &#20114;&#25563;&#24615;&#12434;&#20445;&#35388;&#12377;&#12427;&#12383;&#12417;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12364;&#20351;&#12387;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#30693;&#12425;&#12394;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#12405;&#12383;&#12388;&#12398;&#30446;&#27161;&#12399;&#12383;&#12403;&#12383;&#12403;&#23550;&#31435;&#12375;&#12414;&#12377;&#12290;&#23550;&#31435;&#12364;&#36215;&#12365;&#12383;&#12392;&#12365;&#12395;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12434;&#25304;&#26463;&#12375;&#12390;&#12356;&#12394;&#12356;&#12375;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12392;&#38283;&#30330;&#32773;&#12399;&#12289;
    &#25345;&#12385;&#12388;&#25345;&#12383;&#12428;&#12388;&#12398;&#38306;&#20418;&#12395;&#12354;&#12427;&#12371;&#12392;&#12434;&#24605;&#12356;&#20986;&#12377;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12427;&#12384;&#12369;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
    &#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12395;&#12392;&#12387;&#12390;&#33391;&#12356;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399;&#20107;&#23455;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12418;&#12518;&#12540;&#12470;&#12540;&#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#24195;&#12417;&#12427;&#12383;&#12417;&#12395;&#22320;&#36947;&#12394;&#20316;&#26989;&#12398;&#12411;&#12392;&#12435;&#12393;&#12434;&#12371;&#12394;&#12377;&#12371;&#12392;&#12391;&#12289;
    &#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#12424;&#12356;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;&#12371;&#12398;&#20316;&#26989;&#12399;&#12289;&#12392;&#12390;&#12388;&#12418;&#12394;&#12356;&#25968;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#23550;&#35937;&#12395;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12497;&#12483;&#12465;&#12540;&#12472;&#12515;&#12540;&#12395;&#21453;&#23550;&#12398;&#24847;&#24605;&#12434;&#31034;&#12377;&#12398;&#12399;&#12424;&#12356;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;&#21927;&#22057;&#12434;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#12364;&#20986;&#12379;&#12427;&#26368;&#33391;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#19990;&#12395;&#36865;&#12426;&#20986;&#12377;&#12371;&#12392;&#12398;&#12415;&#12395;&#27880;&#21147;&#12377;&#12428;&#12400;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2507936" href="#idp2507936" class="para">27</a>] </sup>&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12420;&#12381;&#12398;&#20182;&#12398;&#21360;&#21047;&#29289;&#12434;&#25351;&#12377;&#12495;&#12483;&#12459;&#12540;&#29992;&#35486;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp2513232" href="#idp2513232" class="para">28</a>] </sup> Python &#12391;&#12399; <span class="command"><strong>python setup.py install</strong></span> &#12392;&#12356;&#12358;&#12289;Distutils &#12434;&#20351;&#12387;&#12383;&#27161;&#28310;&#30340;&#12394;&#12467;&#12510;&#12531;&#12489;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Ruby &#12398;&#22580;&#21512;&#12399; Rubygems &#32076;&#30001;&#12391; <span class="command"><strong>gem install [&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;]</strong></span> &#12392;&#12356;&#12358;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="stabilizing-a-release.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="testing-and-releasing.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473;</td></tr></table></div></body></html>
