<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#29305;&#35377;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;"><link rel="prev" href="dual-licensing.html" title="&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;"><link rel="next" href="licensing-further-resources.html" title="&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29305;&#35377;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="dual-licensing.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</th><td width="20%" align="right"> <a accesskey="n" href="licensing-further-resources.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#29305;&#35377;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="patents"></a>&#29305;&#35377;</h2></div></div></div><p>
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12391;&#29694;&#22312;&#27880;&#30446;&#12373;&#12428;&#12390;&#12356;&#12427;&#21839;&#38988;&#12391;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#38450;&#12368;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12289;
    &#29694;&#23455;&#30340;&#12394;&#21807;&#19968;&#12398;&#33029;&#23041;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#33879;&#20316;&#27177;&#12392;&#21830;&#27161;&#12398;&#21839;&#38988;&#12399;&#12356;&#12388;&#12391;&#12418;&#22238;&#36991;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#20206;&#12395;&#12354;&#12394;&#12383;&#12398;&#12467;&#12540;&#12489;&#12364;&#20182;&#12398;&#20154;&#12398;&#12467;&#12540;&#12489;&#12392;&#20284;&#12390;&#12356;&#12390;&#12289;&#35504;&#12363;&#12398;&#33879;&#20316;&#27177;&#12434;&#20405;&#23475;&#12375;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12354;&#12394;&#12383;&#12399;&#12381;&#12398;&#37096;&#20998;&#12434;&#26360;&#12365;&#30452;&#12379;&#12400;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#35504;&#12363;&#12364;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12395;&#23550;&#12375;&#12390;&#21830;&#27161;&#27177;&#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#26368;&#24746;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12434;&#22793;&#12360;&#12428;&#12400;&#28168;&#12415;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21517;&#12398;&#22793;&#26356;&#12399;&#19968;&#26178;&#30340;&#12395;&#12399;&#19981;&#20415;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#38263;&#12356;&#30446;&#12391;&#35211;&#12428;&#12400;&#21839;&#38988;&#12395;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#12467;&#12540;&#12489;&#12381;&#12428;&#33258;&#20307;&#12399;&#12356;&#12388;&#12418;&#36890;&#12426;&#21205;&#12367;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12289;&#29305;&#35377;&#12399;&#12354;&#12427;&#12450;&#12452;&#12487;&#12451;&#12450;&#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12395;&#23550;&#12375;&#12390;&#19968;&#24459;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#35504;&#12364;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12363;&#12399;&#38306;&#20418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12393;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12434;&#20351;&#12358;&#12363;&#12373;&#12360;&#38306;&#20418;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#35504;&#12363;&#12364;&#29305;&#35377;&#12434;&#20405;&#23475;&#12375;&#12390;&#12356;&#12427;&#12392;&#20027;&#24373;&#12375;&#12390;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#35380;&#12360;&#12383;&#36884;&#31471;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#29305;&#23450;&#12398;&#27231;&#33021;&#12398;&#23455;&#35013;&#12434;&#12420;&#12417;&#12427;&#12363;&#12289;&#12459;&#12493;&#12392;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#35009;&#21028;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#12424;&#12358;&#12394;&#35009;&#21028;&#12434;&#36215;&#12371;&#12377;&#12398;&#12399;&#12289;&#21313;&#20998;&#12394;&#36039;&#21147;&#12364;&#12354;&#12427;&#20225;&#26989;&#12394;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377; &#8212;
    &#12388;&#12414;&#12426;&#12289;&#12399;&#12376;&#12417;&#12363;&#12425;&#29305;&#35377;&#12434;&#36023;&#21454;&#12377;&#12427;&#36039;&#37329;&#12364;&#12354;&#12426;&#12289;&#12381;&#12358;&#12377;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#32068;&#32340;&#12391;&#12377; &#8212;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#29305;&#35377;&#12434;&#36023;&#12356;&#21462;&#12427;&#20313;&#35029;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#23550;&#35937;&#12392;&#12394;&#12427;&#29305;&#35377;&#12364;&#27861;&#24311;&#12391;&#25304;&#26463;&#21147;&#12364;&#12394;&#12356;&#12392;&#24375;&#12367;&#24605;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12377;&#12368;&#12395;&#38477;&#20239;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#29366;&#27841;&#12434;&#12399;&#12376;&#12417;&#12363;&#12425;&#38450;&#12368;&#12395;&#12399;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12467;&#12540;&#12489;&#12434;&#29992;&#24515;&#28145;&#12367;&#26360;&#12356;&#12390;&#12289;
    &#12383;&#12392;&#12360;&#26368;&#33391;&#12363;&#12388;&#21807;&#19968;&#12398;&#35299;&#27770;&#31574;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#29305;&#35377;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#20351;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;
    <sup>[<a name="idp3234752" href="#ftn.idp3234752" class="footnote">41</a>]</sup>&#12290;
</p><p>
    &#35519;&#26619;&#12420;&#20107;&#20363;&#12364;&#31034;&#12377;&#36890;&#12426;&#12289;&#12371;&#12428;&#12399;&#22823;&#22810;&#25968;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    <span class="emphasis"><em>&#12377;&#12409;&#12390;&#12398;</em></span> &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#22810;&#12367;&#12364;&#12289;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12434;&#20840;&#38754;&#30340;&#12395;&#24259;&#27490;&#12377;&#12409;&#12365;&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;
    <sup>[<a name="idp3245280" href="#ftn.idp3245280" class="footnote">42</a>]</sup>&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;&#29305;&#12395;&#24375;&#12367;&#12381;&#12358;&#24863;&#12376;&#12390;&#12362;&#12426;&#12289;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12434;&#38598;&#12417;&#12383;&#12426;&#12289;
    &#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12395;&#24375;&#12367;&#38306;&#20418;&#12375;&#12377;&#12366;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20685;&#12367;&#12398;&#12434;&#25298;&#21542;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12354;&#12394;&#12383;&#12398;&#32068;&#32340;&#12364;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12434;&#38598;&#12417;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#29305;&#35377;&#12434;&#36969;&#29992;&#12375;&#12394;&#12356;&#12371;&#12392;&#12289;
    &#12381;&#12375;&#12390;&#21029;&#12398;&#32068;&#32340;&#12364;&#29305;&#35377;&#36949;&#21453;&#12398;&#35009;&#21028;&#12434;&#36215;&#12371;&#12375;&#12383;&#22580;&#21512;&#12398;&#12289;
    &#38450;&#24481;&#12398;&#25163;&#27573;&#12392;&#12375;&#12390;&#12398;&#12415;&#29305;&#35377;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#21462;&#12426;&#28040;&#12379;&#12394;&#12356;&#12420;&#12426;&#26041;&#12391;&#26126;&#30906;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12364;&#21807;&#19968;&#12398;&#27491;&#12375;&#12356;&#25163;&#27573;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21516;&#22763;&#12364;&#36899;&#25658;&#12377;&#12427;&#12371;&#12392;&#12418;&#12424;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
    <sup>[<a name="idp3050736" href="#ftn.idp3050736" class="footnote">43</a>]</sup>
</p><p>
    &#19981;&#24184;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;&#27861;&#30340;&#12394;&#38450;&#24481;&#12434;&#30446;&#30340;&#12392;&#12375;&#12390;&#29305;&#35377;&#12434;&#38598;&#12417;&#12427;&#12398;&#12399;&#21512;&#29702;&#30340;&#12394;&#34892;&#21205;&#12391;&#12377;&#12290;
    &#29694;&#22312;&#12398;&#29305;&#35377;&#12398;&#20181;&#32068;&#12415;&#12399;&#12381;&#12398;&#26412;&#36074;&#19978;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12450;&#12513;&#12522;&#12459;&#12391;&#12399;&#36557;&#25313;&#31478;&#20105;&#12391;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#31478;&#20105;&#30456;&#25163;&#12364;&#12383;&#12367;&#12373;&#12435;&#12398;&#29305;&#35377;&#12434;&#21462;&#24471;&#12375;&#12383;&#22580;&#21512;&#12289;
    &#26368;&#33391;&#12398;&#38450;&#24481;&#26041;&#27861;&#12399;&#12289;&#29305;&#35377;&#36949;&#21453;&#12391;&#35380;&#12360;&#12425;&#12428;&#12383;&#12392;&#12365;&#12395;&#36870;&#12395;&#35380;&#12360;&#36820;&#12379;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#22810;&#12367;&#12398;&#29305;&#35377;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377; &#8212; &#12371;&#12358;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;
    &#12362;&#20114;&#12356;&#12364;&#12362;&#37329;&#12434;&#25173;&#12431;&#12394;&#12356;&#12391;&#28168;&#12416;&#12424;&#12358;&#12289;
    &#21452;&#26041;&#12364;&#26426;&#12395;&#12388;&#12356;&#12390;&#12463;&#12525;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#21462;&#24341;&#12434;&#12377;&#12427;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#30693;&#30340;&#36001;&#29987;&#27177;&#23554;&#38272;&#12398;&#27861;&#24459;&#23478;&#12395;&#12399;&#25173;&#12431;&#12394;&#12356;&#12392;&#12356;&#12369;&#12414;&#12379;&#12435;&#12364;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12364;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#21450;&#12412;&#12377;&#23475;&#12399;&#12289;
    &#12467;&#12540;&#12489;&#12398;&#38283;&#30330;&#12395;&#21450;&#12412;&#12377;&#12418;&#12398;&#12424;&#12426;&#12418;&#38512;&#28287;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12399;&#12501;&#12449;&#12540;&#12512;&#12454;&#12455;&#12450;&#12398;&#35373;&#35336;&#32773;&#36948;&#12395;&#31192;&#23494;&#20027;&#32681;&#12398;&#38640;&#22258;&#27671;&#12434;&#21161;&#38263;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#33258;&#20998;&#12383;&#12385;&#12364;&#35373;&#35336;&#12375;&#12383;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#35443;&#32048;&#12434;&#20844;&#12395;&#12377;&#12427;&#12392;&#12289;
    &#29305;&#35377;&#36949;&#21453;&#12391;&#35380;&#12360;&#12427;&#12383;&#12417;&#12395;&#12354;&#12425;&#25506;&#12375;&#12434;&#12375;&#12390;&#12356;&#12427;&#31478;&#20105;&#30456;&#25163;&#12434;&#25216;&#34899;&#30340;&#12395;&#21161;&#12369;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#24515;&#37197;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#26426;&#19978;&#12398;&#31354;&#35542;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12499;&#12487;&#12458;&#12459;&#12540;&#12489;&#26989;&#30028;&#12391;&#26126;&#12425;&#12363;&#12395;&#36215;&#12365;&#12390;&#12365;&#12383;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#12499;&#12487;&#12458;&#12459;&#12540;&#12489;&#12513;&#12540;&#12459;&#12540;&#12399;&#12289;
    &#39640;&#36895;&#12395;&#21205;&#12367;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12394;&#12487;&#12496;&#12452;&#12473;&#12489;&#12521;&#12452;&#12496;&#12434;&#20316;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20181;&#27096;&#12434;&#20844;&#12395;&#12375;&#12390;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12381;&#12358;&#12375;&#12383;&#12459;&#12540;&#12489;&#12398;&#27231;&#33021;&#12434;&#23436;&#20840;&#12395;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12501;&#12522;&#12540;&#12394;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#20316;&#12427;&#12398;&#12364;&#19981;&#21487;&#33021;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12394;&#12380;&#12513;&#12540;&#12459;&#12540;&#12399;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392;&#12395;
    <span class="emphasis"><em>&#21453;&#23550;&#12377;&#12427;&#12371;&#12392;</em></span> &#12399;&#29702;&#12395;&#12363;&#12394;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#22810;&#12367;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#21205;&#12367;&#12371;&#12392;&#12364;&#12289;
    &#12499;&#12487;&#12458;&#12459;&#12540;&#12489;&#12398;&#22770;&#12426;&#19978;&#12370;&#12395;&#12388;&#12394;&#12364;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;
    &#12354;&#12427;&#12392;&#12365;&#12399;&#25925;&#24847;&#12395;&#12289;&#12354;&#12427;&#12392;&#12365;&#12399;&#20598;&#28982;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#12513;&#12540;&#12459;&#12540;&#12377;&#12409;&#12390;&#12364;&#12487;&#12470;&#12452;&#12531;&#12523;&#12540;&#12512;&#12398;&#35023;&#12391;&#20114;&#12356;&#12395;&#29305;&#35377;&#12434;&#20405;&#23475;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#26126;&#12425;&#12363;&#12395;&#12394;&#12387;&#12390;&#12365;&#12390;&#12356;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#12289;&#12513;&#12540;&#12459;&#12540;&#12399;&#25954;&#12360;&#12390;&#23436;&#20840;&#12394;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#20181;&#27096;&#12434;&#20844;&#38283;&#12375;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#20844;&#38283;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#29305;&#35377;&#12434;&#20405;&#23475;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#31478;&#20105;&#30456;&#25163;&#12395;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
    (&#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12358;&#12356;&#12387;&#12383;&#24615;&#36074;&#12398;&#12371;&#12392;&#12399;&#19968;&#27425;&#24773;&#22577;&#28304;&#12363;&#12425;&#35377;&#21487;&#12434;&#24471;&#12390;&#26360;&#12369;&#12427;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
     &#31169;&#12399;&#12371;&#12398;&#12371;&#12392;&#12434;&#20491;&#20154;&#30340;&#12394;&#12420;&#12426;&#12392;&#12426;&#12391;&#30693;&#12426;&#12414;&#12375;&#12383;&#12290;)
</p><p>
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20013;&#12395;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12392;&#25126;&#12387;&#12383;&#12426;&#12289;
    &#12418;&#12375;&#12367;&#12399;&#25298;&#32118;&#12377;&#12427;&#12383;&#12417;&#12398;&#29305;&#21029;&#12394;&#25991;&#35328;&#12434;&#20837;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;GNU GPL &#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#25991;&#35328;&#12434;&#21547;&#12417;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><pre class="screen">
    7. &#29305;&#35377;&#20405;&#23475;&#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#20182;&#12398;&#29702;&#30001;(&#29305;&#35377;&#38306;&#20418;&#12395;&#38480;&#12425;&#12394;&#12356;)&#12363;&#12425;&#12289;&#35009;&#21028;&#25152;&#12398;&#21028;&#27770;&#12354;&#12427;&#12356;&#12399;
       &#30003;&#12375;&#31435;&#12390;&#12398;&#32080;&#26524;&#12392;&#12375;&#12390;&#12354;&#12394;&#12383;&#12395;(&#35009;&#21028;&#25152;&#21629;&#20196;&#12420;&#22865;&#32004;&#12394;&#12393;&#12395;&#12424;&#12426;)&#12371;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#26465;
       &#20214;&#12392;&#30683;&#30462;&#12377;&#12427;&#21046;&#32004;&#12364;&#35506;&#12373;&#12428;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;&#12354;&#12394;&#12383;&#12364;&#12371;&#12398;&#22865;&#32004;&#26360;&#12398;&#26465;&#20214;&#12434;&#20813;&#38500;&#12373;&#12428;&#12427;&#12431;
       &#12369;&#12391;&#12399;&#12394;&#12356;&#12290;&#12418;&#12375;&#12371;&#12398;&#22865;&#32004;&#26360;&#12398;&#19979;&#12391;&#12354;&#12394;&#12383;&#12395;&#35506;&#12379;&#12425;&#12428;&#12383;&#36012;&#20219;&#12392;&#20182;&#12398;&#38306;&#36899;&#12377;&#12427;&#36012;&#20219;&#12434;
       &#21516;&#26178;&#12395;&#28288;&#12383;&#12377;&#12424;&#12358;&#12394;&#24418;&#12391;&#38930;&#24067;&#12391;&#12365;&#12394;&#12356;&#12394;&#12425;&#12400;&#12289;&#32080;&#26524;&#12392;&#12375;&#12390;&#12354;&#12394;&#12383;&#12399;&#12302;&#12503;&#12525;&#12464;&#12521;&#12512;&#12303;
       &#12434;&#38930;&#24067;&#12377;&#12427;&#12371;&#12392;&#12364;&#20840;&#12367;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12354;&#12427;&#12290;&#20363;&#12360;&#12400;&#29305;&#35377;&#12521;&#12452;&#12475;&#12531;&#12473;&#12364;&#12289;&#12354;&#12394;
       &#12383;&#12363;&#12425;&#30452;&#25509;&#38291;&#25509;&#12434;&#21839;&#12431;&#12378;&#12467;&#12500;&#12540;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#20154;&#12364;&#35504;&#12391;&#12418;&#12302;&#12503;&#12525;&#12464;&#12521;&#12512;&#12303;&#12434;&#20351;&#29992;&#26009;&#28961;
       &#26009;&#12391;&#20877;&#38930;&#24067;&#12377;&#12427;&#12371;&#12392;&#12434;&#35469;&#12417;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12354;&#12394;&#12383;&#12364;&#12381;&#12398;&#21046;&#32004;&#12392;&#12371;&#12398;&#22865;&#32004;&#26360;&#12434;&#20001;&#26041;&#12392;
       &#12418;&#28288;&#12383;&#12377;&#12395;&#12399;&#12302;&#12503;&#12525;&#12464;&#12521;&#12512;&#12303;&#12398;&#38930;&#24067;&#12434;&#23436;&#20840;&#12395;&#20013;&#27490;&#12377;&#12427;&#12375;&#12363;&#12394;&#12356;&#12384;&#12429;&#12358;&#12290; 

       [...]

       &#29305;&#35377;&#12420;&#12381;&#12398;&#20182;&#12398;&#36001;&#29987;&#27177;&#12434;&#20405;&#23475;&#12375;&#12383;&#12426;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#27177;&#21033;&#12398;&#20027;&#24373;&#12398;&#21177;&#21147;&#12395;&#30064;&#35696;&#12434;&#21809;&#12360;&#12383;
       &#12426;&#12377;&#12427;&#12424;&#12358;&#12354;&#12394;&#12383;&#12434;&#35480;&#24785;&#12377;&#12427;&#12371;&#12392;&#12364;&#12371;&#12398;&#31680;&#12398;&#30446;&#30340;&#12391;&#12399;&#12394;&#12356;&#12290;&#12371;&#12398;&#31680;&#12395;&#12399;&#12289;&#20154;&#12293;&#12395;&#12424;
       &#12387;&#12390;&#12521;&#12452;&#12475;&#12531;&#12473;&#24931;&#34892;&#12392;&#12375;&#12390;&#23455;&#29694;&#12373;&#12428;&#12390;&#12365;&#12383;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38930;&#24067;&#12398;&#12471;&#12473;&#12486;&#12512;&#12398;
       &#23436;&#20840;&#24615;&#12434;&#35703;&#12427;&#12392;&#12356;&#12358;&#30446;&#30340;&#12375;&#12363;&#12394;&#12356;&#12290;&#22810;&#12367;&#12398;&#20154;&#12293;&#12364;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38930;&#24067;&#12471;&#12473;
       &#12486;&#12512;&#12364;&#39318;&#23614;&#19968;&#36011;&#12375;&#12390;&#36969;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#20449;&#38972;&#12395;&#22522;&#12389;&#12365;&#12289;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12434;&#36890;&#12376;&#12390;&#38930;
       &#24067;&#12373;&#12428;&#12427;&#22810;&#27096;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#23515;&#22823;&#12394;&#36002;&#29486;&#12434;&#12375;&#12390;&#12365;&#12383;&#12398;&#12399;&#20107;&#23455;&#12391;&#12354;&#12427;&#12364;&#12289;&#20154;&#12364;&#12393;&#12398;
       &#12424;&#12358;&#12394;&#12471;&#12473;&#12486;&#12512;&#12434;&#36890;&#12376;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#38930;&#24067;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#12363;&#12399;&#12354;&#12367;&#12414;&#12391;&#12418;&#20316;&#32773;/&#23492;&#19982;
       &#32773;&#27425;&#31532;&#12391;&#12354;&#12426;&#12289;&#12354;&#12394;&#12383;&#12364;&#36984;&#25246;&#12434;&#25276;&#12375;&#12388;&#12369;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12290;
       <sup>[<a name="idp3207504" href="#ftn.idp3207504" class="footnote">44</a>]</sup>
</pre><p>
    Apache License &#12496;&#12540;&#12472;&#12519;&#12531; 2.0 (<a class="ulink" href="http://www.apache.org/licenses/LICENSE-2.0" target="_top">http://www.apache.org/licenses/LICENSE-2.0</a>)
    &#12418;&#29305;&#35377;&#12395;&#21453;&#23550;&#12377;&#12427;&#26465;&#20214;&#12434;&#21547;&#12417;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12414;&#12378;&#31532;&#19968;&#12395;&#12289;&#12371;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#12467;&#12540;&#12489;&#12434;&#37197;&#24067;&#12377;&#12427;&#20154;&#12399;&#12289;
    &#33258;&#20998;&#12364;&#20445;&#26377;&#12375;&#12390;&#12356;&#12427;&#29305;&#35377;&#12391;&#12289;&#37197;&#24067;&#12377;&#12427;&#12467;&#12540;&#12489;&#12395;&#36969;&#29992;&#12391;&#12365;&#12427;&#12418;&#12398;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#12525;&#12452;&#12516;&#12522;&#12486;&#12451;&#12540;&#12364;&#12363;&#12363;&#12425;&#12394;&#12356;&#29305;&#35377;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#19982;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20108;&#12388;&#12417;&#12395;&#12289;
    &#37197;&#24067;&#12375;&#12383;&#12467;&#12540;&#12489;&#12434;&#26681;&#25312;&#12395;&#29305;&#35377;&#20405;&#23475;&#12398;&#35380;&#12360;&#12434;&#36215;&#12371;&#12375;&#12383;&#26178;&#28857;&#12391;&#12381;&#12398;&#29305;&#35377;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#33258;&#21205;&#30340;&#12395;&#32066;&#20102;&#12373;&#12379;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12381;&#12358;&#12375;&#12383;&#20154;&#12434;&#24039;&#12415;&#12395;&#25490;&#38500;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><pre class="screen">
    3. &#29305;&#35377;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20184;&#19982;

       &#26412;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#26465;&#38917;&#12395;&#24467;&#12387;&#12390;&#12289;&#21508;&#12467;&#12531;&#12488;&#12522;&#12499;&#12517;&#12540;&#12479;&#12540;&#12399;&#12354;&#12394;&#12383;&#12395;&#23550;&#12375;&#12289;&#25104;&#26524;&#29289;
       &#12434;&#20316;&#25104;&#12375;&#12383;&#12426;&#12289;&#20351;&#29992;&#12375;&#12383;&#12426;&#12289;&#36009;&#22770;&#12375;&#12383;&#12426;&#12289;&#36009;&#22770;&#29992;&#12395;&#25552;&#20379;&#12375;&#12383;&#12426;&#12289;&#12452;&#12531;&#12509;&#12540;&#12488;&#12375;
       &#12383;&#12426;&#12289;&#12381;&#12398;&#20182;&#12398;&#26041;&#27861;&#12391;&#31227;&#36578;&#12375;&#12383;&#12426;&#12377;&#12427;&#12289;&#28961;&#26399;&#38480;&#12391;&#19990;&#30028;&#35215;&#27169;&#12391;&#38750;&#29420;&#21344;&#30340;&#12391;&#20351;&#29992;&#26009;
       &#28961;&#26009;&#12391;&#21462;&#12426;&#28040;&#12375;&#19981;&#33021;&#12394;&#65288;&#12371;&#12398;&#38917;&#12391;&#26126;&#35352;&#12375;&#12383;&#12418;&#12398;&#12399;&#38500;&#12367;&#65289;&#29305;&#35377;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#20184;&#19982;
       &#12375;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;&#12467;&#12531;&#12488;&#12522;&#12499;&#12517;&#12540;&#12479;&#12540;&#12395;&#12424;&#12387;&#12390;&#12521;&#12452;
       &#12475;&#12531;&#12473;&#21487;&#33021;&#12394;&#29305;&#35377;&#30003;&#35531;&#12398;&#12358;&#12385;&#12289;&#24403;&#35442;&#12467;&#12531;&#12488;&#12522;&#12499;&#12517;&#12540;&#12479;&#12540;&#12398;&#12467;&#12531;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;
       &#12531;&#12434;&#21336;&#29420;&#12414;&#12383;&#12399;&#35442;&#24403;&#12377;&#12427;&#25104;&#26524;&#29289;&#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#29992;&#12356;&#12427;&#12371;&#12392;&#12391;&#24517;&#28982;&#30340;&#12395;&#20405;&#23475;&#12373;&#12428;
       &#12427;&#12418;&#12398;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#35504;&#12363;&#12395;&#23550;&#12375;&#12289;&#20132;&#24046;&#35531;&#27714;&#12420;&#21453;&#35380;&#12434;&#21547;&#12417;&#12390;&#12289;
       &#25104;&#26524;&#29289;&#12354;&#12427;&#12356;&#12399;&#25104;&#26524;&#29289;&#12395;&#32068;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12531;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12364;&#30452;&#25509;&#12414;&#12383;&#12399;&#38291;&#25509;
       &#30340;&#12394;&#29305;&#35377;&#20405;&#23475;&#12395;&#24403;&#12383;&#12427;&#12392;&#12375;&#12390;&#29305;&#35377;&#35380;&#35359;&#12434;&#36215;&#12371;&#12375;&#12383;&#22580;&#21512;&#12289;&#26412;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#22522;&#12389;&#12356;
       &#12390;&#12354;&#12394;&#12383;&#12395;&#20184;&#19982;&#12373;&#12428;&#12383;&#29305;&#35377;&#12521;&#12452;&#12475;&#12531;&#12473;&#12399;&#12289;&#12381;&#12358;&#12375;&#12383;&#35380;&#35359;&#12364;&#27491;&#24335;&#12395;&#36215;&#12371;&#12373;&#12428;&#12383;&#26178;
       &#28857;&#12391;&#32066;&#20102;&#12377;&#12427;&#12418;&#12398;&#12392;&#12375;&#12414;&#12377;&#12290;
       <sup>[<a name="idp3097616" href="#ftn.idp3097616" class="footnote">45</a>]</sup>
</pre><p>
    &#12371;&#12398;&#12424;&#12358;&#12395;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#29305;&#35377;&#12363;&#12425;&#38450;&#24481;&#12377;&#12427;&#12383;&#12417;&#12398;&#20181;&#25499;&#12369;&#12434;&#12375;&#12390;&#12362;&#12367;&#12398;&#12399;&#12289;
    &#27861;&#30340;&#12395;&#12418;&#25919;&#27835;&#30340;&#12395;&#12418;&#24441;&#12395;&#31435;&#12388;&#12418;&#12398;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#26368;&#32066;&#30340;&#12395;&#12399;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#23550;&#12377;&#12427;&#29305;&#35377;&#36949;&#21453;&#35009;&#21028;&#12398;&#33029;&#23041;&#12364;&#12418;&#12383;&#12425;&#12377;&#12289;
    &#33806;&#32302;&#30340;&#21177;&#26524;&#12434;&#25173;&#25325;&#12377;&#12427;&#12395;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12364;&#12391;&#12365;&#12427;&#21807;&#19968;&#12398;&#25163;&#27573;&#12399;&#12289;&#22269;&#38555;&#30340;&#12394;&#29305;&#35377;&#27861;&#12398;&#26412;&#36074;&#12420;&#35299;&#37320;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12289;&#12381;&#12375;&#12390;&#12371;&#12398;&#21839;&#38988;&#12392;&#20154;&#12293;&#12364;&#12393;&#12358;&#25126;&#12387;&#12390;&#12365;&#12383;&#12398;&#12363;&#12434;&#12373;&#12425;&#12395;&#30693;&#12427;&#12395;&#12399;&#12289;
    <a class="ulink" href="http://www.nosoftwarepatents.com/" target="_top">http://www.nosoftwarepatents.com/</a> &#12434;&#35370;&#12428;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    Wikipedia &#12398;&#35352;&#20107; (<a class="ulink" href="http://en.wikipedia.org/wiki/Software_patent" target="_top">http://en.wikipedia.org/wiki/Software_patent</a>)
    &#12395;&#12418;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12395;&#38306;&#12377;&#12427;&#26377;&#30410;&#12394;&#24773;&#22577;&#12364;&#22810;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#31169;&#33258;&#36523;&#12418;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377;&#12395;&#21453;&#23550;&#12377;&#12427;&#35696;&#35542;&#12434;&#12414;&#12392;&#12417;&#12383;&#12456;&#12531;&#12488;&#12522;&#12434;&#12502;&#12525;&#12464;&#12395;&#36617;&#12379;&#12390;&#12356;&#12414;&#12377;&#12290;
    <a class="ulink" href="http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/" target="_top">http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/</a>
</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3234752" href="#idp3234752" class="para">41</a>] </sup>
          &#12469;&#12531;&#12539;&#12510;&#12452;&#12463;&#12525;&#12471;&#12473;&#12486;&#12512;&#12474; &#12392; IBM &#12399;&#12289;
          &#12371;&#12398;&#21839;&#38988;&#12395;&#23550;&#12375;&#12390;&#23569;&#12394;&#12367;&#12392;&#12418;&#21029;&#12398;&#26041;&#21521;&#24615;&#12434;&#25171;&#12385;&#20986;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
          &#24444;&#12425;&#12399;&#22823;&#37327;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#29305;&#35377; &#8212; &#12381;&#12428;&#12382;&#12428; 1600 &#12392; 500 &#20491; &#8212;
          &#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12501;&#12522;&#12540;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;
          &#31169;&#12399;&#27861;&#24459;&#23478;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12289;
          &#12371;&#12428;&#12425;&#12398;&#29305;&#35377;&#12364;&#20184;&#19982;&#12373;&#12428;&#12383;&#12371;&#12392;&#12364;&#12393;&#12428;&#12367;&#12425;&#12356;&#26377;&#29992;&#12394;&#12398;&#12363;&#12434;&#35413;&#20385;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
          &#12375;&#12363;&#12375;&#12383;&#12392;&#12360;&#12371;&#12428;&#12425;&#12364;&#12377;&#12409;&#12390;&#37325;&#35201;&#12394;&#29305;&#35377;&#12391;&#12354;&#12426;&#12289;
          &#29305;&#35377;&#12434;&#20184;&#19982;&#12377;&#12427;&#26465;&#20214;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20351;&#12358;&#12383;&#12417;&#12395;&#26412;&#24403;&#12395;&#12501;&#12522;&#12540;&#12394;&#12418;&#12398;&#12395;&#12375;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
          &#12381;&#12428;&#12399;&#27703;&#23665;&#12398;&#19968;&#35282;&#12395;&#36942;&#12366;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      </p></div><div class="footnote"><p><sup>[<a id="ftn.idp3245280" href="#idp3245280" class="para">42</a>] </sup>
        &#35519;&#26619;&#12398;&#19968;&#20363;&#12392;&#12375;&#12390;&#12289;&#20197;&#19979;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        <a class="ulink" href="http://groups.csail.mit.edu/mac/projects/lpf/Whatsnew/survey.html" target="_top">http://groups.csail.mit.edu/mac/projects/lpf/Whatsnew/survey.html</a>
      </p></div><div class="footnote"><p><sup>[<a id="ftn.idp3050736" href="#idp3050736" class="para">43</a>] </sup>
        &#12383;&#12392;&#12360;&#12400; RedHat &#12399;&#12289;
        &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#29305;&#35377;&#12395;&#36949;&#21453;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#32004;&#26463;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        <a class="ulink" href="http://www.redhat.com/legal/patent_policy.html" target="_top">http://www.redhat.com/legal/patent_policy.html</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
      </p></div><div class="footnote"><p><sup>[<a id="ftn.idp3207504" href="#idp3207504" class="para">44</a>] </sup>
              GNU General Public License &#12496;&#12540;&#12472;&#12519;&#12531; 2 &#12398;&#12418;&#12398;&#12290;
              <a class="ulink" href="http://www.opensource.jp/gpl/gpl.ja.html.euc-jp" target="_top">http://www.opensource.jp/gpl/gpl.ja.html.euc-jp</a> &#12424;&#12426;&#24341;&#29992;&#12290;
          </p></div><div class="footnote"><p><sup>[<a id="ftn.idp3097616" href="#idp3097616" class="para">45</a>] </sup>
              &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12464;&#12523;&#12540;&#12503;&#12539;&#12472;&#12515;&#12497;&#12531; wiki &#12424;&#12426;&#24341;&#29992;&#12290;
              <a class="ulink" href="http://sourceforge.jp/projects/opensource/wiki/licenses%2FApache_License_2.0" target="_top">http://sourceforge.jp/projects/opensource/wiki/licenses%2FApache_License_2.0</a>
          </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="dual-licensing.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="licensing-further-resources.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#28304;</td></tr></table></div></body></html>
