<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24207;&#25991;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="producingoss.jp.foreword.html" title="&#26085;&#26412;&#35486;&#29256;&#12395;&#23492;&#12379;&#12390;"><link rel="next" href="audience.html" title="&#12393;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#35501;&#12435;&#12391;&#12411;&#12375;&#12356;&#65311;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24207;&#25991;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="producingoss.jp.foreword.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="audience.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="preface" title="&#24207;&#25991;"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>&#24207;&#25991;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="preface.html#why">&#12371;&#12398;&#26412;&#12434;&#26360;&#12356;&#12383;&#29702;&#30001;&#12399;&#65311;</a></span></dt><dt><span class="sect1"><a href="audience.html">&#12393;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#35501;&#12435;&#12391;&#12411;&#12375;&#12356;&#65311;</a></span></dt><dt><span class="sect1"><a href="sources.html">&#24773;&#22577;&#28304;</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">&#35613;&#36766;</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">&#20813;&#36012;</a></span></dt><dt><span class="sect1"><a href="aboutjpversion.html">&#26085;&#26412;&#35486;&#29256;&#12395;&#12388;&#12356;&#12390;</a></span></dt></dl></div><div class="sect1" title="&#12371;&#12398;&#26412;&#12434;&#26360;&#12356;&#12383;&#29702;&#30001;&#12399;&#65311;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>&#12371;&#12398;&#26412;&#12434;&#26360;&#12356;&#12383;&#29702;&#30001;&#12399;&#65311;</h2></div></div></div><p>
    &#12497;&#12540;&#12486;&#12451;&#12398;&#22580;&#12391;&#12300;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#12435;&#12391;&#12377;&#12301;&#12392;&#35328;&#12387;&#12390;&#12418;&#12289;
    &#20197;&#21069;&#12398;&#12424;&#12358;&#12395;&#24618;&#12375;&#12370;&#12394;&#30446;&#12434;&#21521;&#12369;&#12425;&#12428;&#12427;&#12371;&#12392;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
   &#12300;&#12354;&#12353;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12397;&#12290;Linux&#12415;&#12383;&#12356;&#12394;&#12418;&#12398;&#12391;&#12375;&#12423;&#65311;&#12301;&#12392;&#12415;&#12435;&#12394;&#12377;&#12368;&#12395;&#12431;&#12363;&#12387;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
   &#12300;&#12381;&#12358;&#12381;&#12358;&#65281;&#12288;&#12381;&#12358;&#12394;&#12435;&#12384;&#12301;&#12290;&#12418;&#12399;&#12420;&#23436;&#20840;&#12394;&#36794;&#22659;&#12391;&#12394;&#12367;&#12394;&#12387;&#12383;&#12398;&#12399;&#23305;&#12375;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#27425;&#12395;&#12367;&#12427;&#36074;&#21839;&#12399;&#12289;&#12385;&#12423;&#12387;&#12392;&#21069;&#12414;&#12391;&#12399;&#12300;&#12381;&#12428;&#12391;&#12289;&#12393;&#12358;&#12420;&#12387;&#12390;&#12362;&#37329;&#12434;&#31292;&#12356;&#12391;&#12356;&#12427;&#12398;&#65311;&#12301;&#12395;&#27770;&#12414;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#31572;&#12360;&#12392;&#12375;&#12390;&#12289;&#31169;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#32076;&#28168;&#23398;&#12395;&#12388;&#12356;&#12390;&#25163;&#30701;&#12395;&#36848;&#12409;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12377;&#12394;&#12431;&#12385;&#12289;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12391;&#21033;&#30410;&#12434;&#24471;&#12427;&#32068;&#32340;&#12364;&#12354;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12381;&#12398;&#32068;&#32340;&#12399;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#36009;&#22770;&#12377;&#12427;&#24517;&#35201;&#12399;&#12394;&#12367;&#12289;
    &#12383;&#12384;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#21033;&#29992;&#21487;&#33021;&#12391;&#12354;&#12426;&#20445;&#23432;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#30906;&#12363;&#12417;&#12383;&#12356;&#12398;&#12391;&#12377;&#12289;&#21830;&#21697;&#12391;&#12399;&#12394;&#12367;&#36947;&#20855;&#12392;&#12375;&#12390;&#12290;
</p><p>
   &#12375;&#12363;&#12375;&#12289;&#26368;&#36817;&#12399;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12393;&#12358;&#12420;&#12387;&#12390;&#20786;&#12369;&#12427;&#12398;&#65311;&#12301;&#30340;&#12394;&#36074;&#21839;&#12399;&#23569;&#12394;&#12367;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12356;&#12414;&#12420;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;
    <sup>[<a name="idp135648" href="#ftn.idp135648" class="footnote">2</a>]</sup>
    &#12391;&#12362;&#37329;&#12434;&#31292;&#12368;&#12371;&#12392;&#12399;&#19981;&#24605;&#35696;&#12391;&#12418;&#20309;&#12391;&#12418;&#12394;&#12367;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12434;&#20181;&#20107;&#12395;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12364;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12289;
    &#38283;&#30330;&#32773;&#20197;&#22806;&#12391;&#12418;&#22810;&#12367;&#12398;&#20154;&#12364;&#29702;&#35299;&#12375;&#12390;&#12356;&#12414;&#12377;&#8212;&#12354;&#12427;&#12356;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#39514;&#12363;&#12394;&#12356;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12365;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#26368;&#36817;&#12399;&#12289;&#12371;&#12435;&#12394;&#36074;&#21839;&#12395;&#22793;&#12431;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;<span class="emphasis"><em>&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12387;&#12390;&#12289;&#12356;&#12387;&#12383;&#12356;&#12393;&#12358;&#12356;&#12358;&#20181;&#32068;&#12415;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12435;&#12391;&#12377;&#12363;&#65311;&#12301;</em></span>
</p><p>
    &#24403;&#26178;&#12398;&#31169;&#12399;&#12289;&#12381;&#12398;&#36074;&#21839;&#12395;&#12358;&#12414;&#12367;&#31572;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#32771;&#12360;&#12428;&#12400;&#32771;&#12360;&#12427;&#12411;&#12393;&#12289;
    &#12381;&#12398;&#35441;&#38988;&#12364;&#35079;&#38609;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12424;&#12358;&#12395;&#24605;&#12360;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12377;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;&#26222;&#36890;&#12398;&#21830;&#22770;&#12392;&#12399;&#12385;&#12423;&#12387;&#12392;&#36949;&#12356;&#12414;&#12377;
   &#65288;&#12383;&#12392;&#12360;&#12400;&#12289;&#20250;&#12387;&#12383;&#12371;&#12392;&#12418;&#12394;&#12356;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#12464;&#12523;&#12540;&#12503;&#12434;&#30456;&#25163;&#12395;&#12375;&#12390;&#33258;&#31038;&#12398;&#35069;&#21697;&#12395;&#12388;&#12356;&#12390;&#12398;&#20132;&#28169;&#12434;&#27598;&#26085;&#12398;&#12424;&#12358;&#12395;&#34892;&#12358;&#12394;&#12435;&#12390;&#12371;&#12392;&#12399;&#26222;&#36890;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12424;&#12397;&#65311;&#65289;&#12290;
    &#12414;&#12383;&#12289;&#12372;&#12367;&#19968;&#33324;&#30340;&#12394;&#38750;&#21942;&#21033;&#32068;&#32340;&#12434;&#36939;&#21942;&#12375;&#12383;&#12426;&#25919;&#24220;&#12434;&#36939;&#21942;&#12375;&#12383;&#12426;&#12392;&#12356;&#12358;&#12398;&#12392;&#12418;&#23569;&#12293;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
&#12288;  &#12414;&#12353;&#12381;&#12428;&#12382;&#12428;&#20284;&#12390;&#12356;&#12427;&#28857;&#12418;&#12354;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;&#24464;&#12293;&#12395;&#12431;&#12363;&#12387;&#12390;&#12365;&#12383;&#12398;&#12399;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#29420;&#29305; <span class="foreignphrase"><em class="foreignphrase">&#65288;sui generis&#65289;</em></span> &#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#27604;&#36611;&#23550;&#35937;&#12392;&#12394;&#12427;&#12418;&#12398;&#12399;&#12356;&#12367;&#12425;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12381;&#12398;&#20013;&#12398;&#12393;&#12428;&#12392;&#12418;&#36949;&#12358;&#12398;&#12391;&#12377;&#12290;
    &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12300;&#36939;&#21942;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12301;&#12392;&#12356;&#12358;&#20206;&#23450;&#12373;&#12360;&#12418;&#30906;&#12363;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;<span class="emphasis"><em>&#12300;&#22987;&#12417;&#12427;&#12301;</em></span>&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#20154;&#12383;&#12385;&#12364;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20013;&#12395;&#12399;&#24375;&#28872;&#12395;&#24433;&#38911;&#12434;&#21450;&#12412;&#12377;&#20154;&#12418;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#33258;&#20307;&#12399;&#29305;&#23450;&#12398;&#20491;&#20154;&#12398;&#25152;&#26377;&#29289;&#12392;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#33288;&#21619;&#12434;&#25345;&#12388;&#20154;&#12364;&#12393;&#12371;&#12363;&#12395;&#12402;&#12392;&#12426;&#12391;&#12418;&#12356;&#12427;&#38480;&#12426;&#12289;&#19968;&#26041;&#30340;&#12395;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32066;&#20102;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#35504;&#12418;&#12364;&#38480;&#12426;&#12394;&#12356;&#21147;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12392;&#21516;&#26178;&#12395;&#12289;&#35504;&#12418;&#12364;&#28961;&#21147;&#12384;&#12392;&#12356;&#12358;&#19968;&#38754;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#33288;&#21619;&#28145;&#12356;&#35441;&#12391;&#12377;&#12290;
</p><p>
    &#12392;&#12356;&#12387;&#12383;&#12431;&#12369;&#12391;&#12289;&#31169;&#12399;&#26412;&#26360;&#12434;&#22519;&#31558;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#29420;&#29305;&#12398;&#25991;&#21270;&#12434;&#30330;&#23637;&#12373;&#12379;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#24605;&#12356;&#36890;&#12426;&#12398;&#20181;&#20107;&#12434;&#12373;&#12379;&#12427;&#33258;&#30001;&#12364;&#20027;&#35201;&#12394;&#20449;&#26465;&#12392;&#12394;&#12427;&#27671;&#39080;&#12391;&#12377;&#12290;&#12381;&#12428;&#12391;&#12394;&#12362;&#12381;&#12398;&#33258;&#30001;&#12398;&#32080;&#26524;&#12289;
    &#20491;&#12293;&#20154;&#12364;&#12400;&#12425;&#12400;&#12425;&#12395;&#12467;&#12540;&#12489;&#12392;&#12392;&#12418;&#12395;&#25105;&#12364;&#36947;&#12434;&#34892;&#12367;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#29105;&#29378;&#30340;&#12394;&#20849;&#21516;&#20316;&#26989;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#23455;&#38555;&#12289;&#21332;&#35519;&#24615;&#12392;&#12356;&#12358;&#12398;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#30028;&#12391;&#26368;&#12418;&#35413;&#20385;&#12373;&#12428;&#12427;&#12473;&#12461;&#12523;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12367;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;&#12354;&#12427;&#31278;&#12398;&#32933;&#22823;&#21270;&#12375;&#12383;&#20849;&#21516;&#20316;&#26989;&#12395;&#24467;&#20107;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12381;&#12371;&#12391;&#12399;&#20182;&#20154;&#12392;&#20316;&#26989;&#12434;&#12377;&#12427;&#33021;&#21147;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;&#20849;&#21516;&#20316;&#26989;&#12434;&#36914;&#12417;&#12427;&#12383;&#12417;&#12398;&#26032;&#12383;&#12394;&#25163;&#27861;&#12434;&#21109;&#12426;&#20986;&#12377;&#33021;&#21147;&#12395;&#12424;&#12426;&#12289;
    &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#20855;&#20307;&#30340;&#12394;&#21033;&#30410;&#12434;&#12418;&#12383;&#12425;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#26412;&#26360;&#12391;&#12399;&#12289;&#12371;&#12398;&#12424;&#12358;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12358;&#12414;&#12367;&#36914;&#12417;&#12390;&#12356;&#12367;&#12383;&#12417;&#12398;&#31192;&#35363;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
    &#27770;&#12375;&#12390;&#23436;&#29863;&#12394;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#21021;&#12417;&#12398;&#19968;&#27497;&#12392;&#12375;&#12390;&#12399;&#21313;&#20998;&#12384;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#12424;&#12356;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12427;&#12371;&#12392;&#12399;&#12289;&#26412;&#36074;&#30340;&#12395;&#20385;&#20516;&#12398;&#12354;&#12427;&#30446;&#27161;&#12391;&#12377;&#12290;
    &#12381;&#12398;&#26041;&#27861;&#12434;&#27169;&#32034;&#12375;&#12390;&#12356;&#12427;&#35501;&#32773;&#12398;&#12415;&#12394;&#12373;&#12435;&#12364;&#12289;&#26412;&#26360;&#12391;&#20309;&#12363;&#12398;&#12498;&#12531;&#12488;&#12434;&#24471;&#12390;&#12367;&#12384;&#12373;&#12428;&#12400;&#24184;&#12356;&#12391;&#12377;&#12290;
    &#12414;&#12383;&#12381;&#12428;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#23455;&#38555;&#12395;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38283;&#30330;&#32773;&#12383;&#12385;&#12398;&#12481;&#12540;&#12512;&#12395;&#21442;&#21152;&#12375;&#12390;&#12289;
    &#19968;&#32210;&#12395;&#20316;&#26989;&#12434;&#36914;&#12417;&#12390;&#12356;&#12383;&#12384;&#12369;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#26395;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
    &#24535;&#12398;&#39640;&#12356;&#12513;&#12531;&#12496;&#12540;&#12392;&#12392;&#12418;&#12395;&#20316;&#26989;&#12434;&#36914;&#12417;&#12289;&#12518;&#12540;&#12470;&#12540;&#12392;&#30452;&#25509;&#23550;&#35441;&#12377;&#12427;&#12398;&#12399;&#38750;&#24120;&#12395;&#27005;&#12375;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12358;&#12414;&#12367;&#21205;&#12356;&#12390;&#12356;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12398;&#20316;&#26989;&#12399;&#12411;&#12435;&#12392;&#12358;&#12395; <span class="emphasis"><em>&#12300;&#27005;&#12375;&#12356;&#12301;</em></span> &#12418;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#12381;&#12398;&#27005;&#12375;&#12373;&#12364;&#12354;&#12427;&#12363;&#12425;&#12371;&#12381;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12358;&#12414;&#12367;&#36914;&#12416;&#12398;&#12391;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp135648" href="#idp135648" class="para">2</a>] </sup>
      &#12371;&#12371;&#12391;&#12399;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12392;&#12300;&#12501;&#12522;&#12540;&#12301;&#12434;&#12411;&#12412;&#21516;&#12376;&#24847;&#21619;&#12391;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#35443;&#32048;&#12399;&#12289;<span><a class="xref" href="introduction.html" title="&#31532;1&#31456; &#23566;&#20837;">1&#31456;<i>&#23566;&#20837;</i></a></span> &#12398;
      <a class="xref" href="introduction.html#free-vs-open-source" title="&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;">&#12300;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="producingoss.jp.foreword.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="audience.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#26085;&#26412;&#35486;&#29256;&#12395;&#23492;&#12379;&#12390; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12393;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#35501;&#12435;&#12391;&#12411;&#12375;&#12356;&#65311;</td></tr></table></div></body></html>
