<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#26085;&#26412;&#35486;&#29256;&#12395;&#23492;&#12379;&#12390;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="next" href="preface.html" title="&#24207;&#25991;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#26085;&#26412;&#35486;&#29256;&#12395;&#23492;&#12379;&#12390;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="preface.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="preface" title="&#26085;&#26412;&#35486;&#29256;&#12395;&#23492;&#12379;&#12390;"><div class="titlepage"><div><div><h2 class="title"><a name="producingoss.jp.foreword"></a>&#26085;&#26412;&#35486;&#29256;&#12395;&#23492;&#12379;&#12390;</h2></div><div><div class="author"><h3 class="author"><span class="surname">Fogel</span> <span class="firstname">Karl</span> [FAMILY Given]</h3></div></div><div><p class="pubdate">2009&#24180;5&#26376;6&#26085; &#12491;&#12517;&#12540;&#12520;&#12540;&#12463;&#12395;&#12390;&#35352;&#12377;</p></div></div></div><p>
      &#12288;&#26412;&#26360;&#12398;&#33521;&#35486;&#29256;&#65288;&#12302;Producing Open Source Software&#12303;&#65289;&#12364;&#19990;&#12395;&#20986;&#12383;&#12354;&#12392;&#12289;
        &#12371;&#12398;&#26412;&#12399;&#32763;&#35379;&#32773;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#32763;&#35379;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
        &#12371;&#12428;&#12399;&#21517;&#35465;&#12394;&#12371;&#12392;&#12391;&#12377;&#12375;&#12289;&#31169;&#12395;&#12392;&#12387;&#12390;&#20104;&#24819;&#22806;&#12398;&#12371;&#12392;&#12391;&#12354;&#12426;&#12289;&#21916;&#12400;&#12375;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
        &#32763;&#35379;&#20316;&#26989;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;&#31169;&#12399;&#24444;&#12425;&#12398;&#32763;&#35379;&#12398;&#12411;&#12392;&#12435;&#12393;&#12434;&#21463;&#21205;&#30340;&#12395;&#21463;&#12369;&#20837;&#12428;&#12390;&#12356;&#12383;&#12384;&#12369;&#12391;&#12375;&#12383;&#12290;
        &#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#31169;&#12399;&#26085;&#26412;&#35486;&#12364;&#35501;&#12417;&#12394;&#12356;&#12398;&#12391;&#12289;&#12371;&#12398;&#26085;&#26412;&#35486;&#29256;&#12398;&#32763;&#35379;&#12395;&#12388;&#12356;&#12390;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#35328;&#12360;&#12414;&#12377;&#12290;
  </p><p>
      &#31169;&#12399;&#32763;&#35379;&#12398;&#20013;&#36523;&#12395;&#12388;&#12356;&#12390;&#12399;&#12467;&#12513;&#12531;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12364;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#32763;&#35379;&#12375;&#12390;&#12367;&#12428;&#12383;&#20154;&#12383;&#12385;&#12395;&#12388;&#12356;&#12390;&#12399;&#12467;&#12513;&#12531;&#12488;&#12391;&#12365;&#12414;&#12377;&#12290;&#24444;&#12425;&#12399;&#21021;&#12417;&#12363;&#12425;&#32066;&#12431;&#12426;&#12414;&#12391;&#32763;&#35379;&#12434;&#27005;&#12375;&#12435;&#12391;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;&#31169;&#12398;&#20181;&#20107;&#12399;&#12392;&#12356;&#12360;&#12400;&#12289;&#24444;&#12425;&#12364;&#20316;&#26989;&#12377;&#12427;&#12383;&#12417;&#12398;&#29872;&#22659;&#65288;&#12522;&#12509;&#12472;&#12488;&#12522;&#12420;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12394;&#12393;&#65289;&#12434;&#25972;&#12360;&#12390;&#12289;&#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#36074;&#21839;&#12395;&#31572;&#12360;&#12383;&#12425;&#12289;&#12354;&#12392;&#12399;&#24444;&#12425;&#12398;&#20316;&#26989;&#12398;&#37034;&#39764;&#12434;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12384;&#12369;&#12391;&#12375;&#12383;&#12290;
&#12288;&#31169;&#12364;&#25972;&#12360;&#12383;&#20316;&#26989;&#29872;&#22659;&#12418;&#12289;&#29305;&#12395;&#20316;&#26989;&#12375;&#12420;&#12377;&#12356;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;&#32763;&#35379;&#20316;&#26989;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12398;&#35328;&#35486;&#12392;&#20154;&#38291;&#12398;&#35328;&#35486;&#12398;&#20013;&#38291;&#12395;&#12354;&#12383;&#12427;&#12289;&#25991;&#26360;&#12434;&#29983;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#35328;&#35486;&#12434;XML&#12391;&#35352;&#36848;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;&#12373;&#12425;&#12395;&#12289;&#25991;&#31456;&#12434;&#35352;&#36848;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12392;&#12356;&#12358;&#12424;&#12426;&#12399;&#12416;&#12375;&#12429;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#31649;&#29702;&#12377;&#12427;&#12398;&#12395;&#21521;&#12356;&#12390;&#12356;&#12427;&#12481;&#12455;&#12483;&#12463;&#12452;&#12531;&#65295;&#12481;&#12455;&#12483;&#12463;&#12450;&#12454;&#12488;&#26041;&#24335;&#12398;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;
      <sup>[<a name="idp23808" href="#ftn.idp23808" class="footnote">1</a>]</sup>&#12290;

    &#12288;&#24444;&#12425;&#12399;&#12371;&#12358;&#12375;&#12383;&#36000;&#25285;&#12395;&#25991;&#21477;&#12418;&#35328;&#12431;&#12378;&#25105;&#24930;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12375;&#12289;&#32763;&#35379;&#12434;&#12375;&#12394;&#12364;&#12425;&#33521;&#35486;&#29256;&#12398;&#38291;&#36949;&#12356;&#12414;&#12391;&#20462;&#27491;&#12375;&#12390;&#12367;&#12428;&#12427;&#20154;&#12418;&#12356;&#12414;&#12375;&#12383;&#12290;&#12385;&#12423;&#12358;&#12393;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12424;&#12358;&#12395;&#12289;&#12467;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390;&#22810;&#12367;&#12398;&#30524;&#12434;&#20809;&#12425;&#12379;&#12427;&#12371;&#12392;&#12391;&#12289;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#20316;&#32773;&#12364;&#35211;&#36867;&#12375;&#12390;&#12356;&#12383;&#12496;&#12464;&#65288;&#38291;&#36949;&#12356;&#65289;&#12434;&#30330;&#35211;&#12375;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  </p><p>
    &#12288;&#12418;&#12385;&#12429;&#12435;&#12289;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#20316;&#32773;&#12364;&#35211;&#36867;&#12375;&#12390;&#12356;&#12383;&#38291;&#36949;&#12356;&#12364;&#35211;&#12388;&#12363;&#12427;&#12398;&#12399;&#12289;&#20123;&#32048;&#12394;&#21103;&#20316;&#29992;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#20197;&#19978;&#12395;&#12289;300&#12506;&#12540;&#12472;&#12434;&#36229;&#12360;&#12427;&#26412;&#20840;&#20307;&#12364;&#26085;&#26412;&#20154;&#12398;&#35501;&#32773;&#12398;&#27597;&#22269;&#35486;&#12391;&#35501;&#12417;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#37325;&#35201;&#12394;&#25104;&#26524;&#12391;&#12377;&#12290;&#12458;&#12531;&#12521;&#12452;&#12531;&#12391;&#28961;&#26009;&#12391;&#35501;&#12416;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;&#12362;&#22909;&#12415;&#12391;&#12354;&#12428;&#12400;&#12289;&#12503;&#12525;&#12398;&#25163;&#12391;&#21360;&#21047;&#12373;&#12428;&#12390;&#35069;&#26412;&#12373;&#12428;&#12383;&#12418;&#12398;&#12418;&#26377;&#20767;&#12391;&#35501;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  </p>

&#12288;<p>&#12371;&#12398;&#24847;&#21619;&#12395;&#12388;&#12356;&#12390;&#12289;&#12385;&#12423;&#12387;&#12392;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;</p><p>
    &#12288;&#30456;&#23550;&#30340;&#12395;&#12415;&#12390;&#12289;&#12371;&#12398;&#26412;&#12398;&#23550;&#35937;&#35501;&#32773;&#12399;&#22810;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#31169;&#12399;&#12371;&#12398;&#26412;&#12434;&#12511;&#12522;&#12458;&#12531;&#12475;&#12521;&#12540;&#12395;&#12375;&#12424;&#12358;&#12392;&#12399;&#24605;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12375;&#12289;&#12381;&#12428;&#12399;&#20986;&#29256;&#20803;&#12418;&#21516;&#27096;&#12391;&#12375;&#12383;&#12290;&#12381;&#12428;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#12501;&#12522;&#12540;&#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12392;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#24515;&#12364;&#12354;&#12387;&#12383;&#12363;&#12425;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12289;2&#20154;&#12398;&#20154;&#38291;&#12364;&#12371;&#12398;&#26412;&#20840;&#20307;&#12434;&#26085;&#26412;&#35486;&#12395;&#32763;&#35379;&#12375;&#12424;&#12358;&#12392;&#19968;&#27497;&#12434;&#36367;&#12415;&#20986;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;&#24444;&#12425;&#12398;&#21162;&#21147;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#32763;&#35379;&#12375;&#12394;&#12369;&#12428;&#12400;&#35501;&#12417;&#12394;&#12363;&#12387;&#12383;&#12391;&#12354;&#12429;&#12358;&#20309;&#30334;&#19975;&#20154;&#12418;&#12398;&#20154;&#12293;&#12364;&#12289;&#12371;&#12398;&#26412;&#12434;&#35501;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12362;&#12381;&#12425;&#12367;&#24444;&#12425;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399;&#27770;&#12375;&#12390;&#12371;&#12398;&#32763;&#35379;&#12434;&#35501;&#12416;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12365;&#12387;&#12392;&#35501;&#12416;&#20154;&#12418;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358; &#8212; &#12385;&#12423;&#12358;&#12393;&#31169;&#12364;&#12289;&#12371;&#12398;&#26412;&#12364;&#12393;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12427;&#12363;&#12399;&#20104;&#24819;&#12391;&#12365;&#12394;&#12356;&#12398;&#12392;&#21516;&#27096;&#12395;&#12289;&#32763;&#35379;&#12377;&#12427;&#20154;&#12418;&#31169;&#12418;&#12289;&#26032;&#12375;&#12356;&#35501;&#32773;&#12364;&#32763;&#35379;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#20351;&#12358;&#12363;&#12399;&#20104;&#24819;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  </p><p>
      &#12371;&#12428;&#12399;&#33521;&#35486;&#29256;&#12364;&#12501;&#12522;&#12540;&#12391;&#12289;&#21046;&#38480;&#12398;&#12394;&#12356;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#12289;&#12458;&#12531;&#12521;&#12452;&#12531;&#19978;&#12395;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12383;&#12363;&#12425;&#12371;&#12381;&#36215;&#12371;&#12387;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290;&#32763;&#35379;&#12377;&#12427;&#20154;&#12383;&#12385;&#12399;&#12289;&#12458;&#12522;&#12472;&#12490;&#12523;&#12434;&#26085;&#26412;&#35486;&#12395;&#32763;&#35379;&#12375;&#12424;&#12358;&#12392;&#33258;&#20998;&#12383;&#12385;&#12391;&#27770;&#12417;&#12414;&#12375;&#12383;&#12290;&#24444;&#12425;&#12399;&#35504;&#12398;&#35377;&#21487;&#12418;&#24471;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12375;&#12289;&#31169;&#12398;&#21332;&#21147;&#12364;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#65288;&#12418;&#12385;&#12429;&#12435;&#12289;&#31169;&#12399;&#21916;&#12435;&#12391;&#21332;&#21147;&#12375;&#12414;&#12375;&#12383;&#12364;&#65289;&#12377;&#12409;&#12390;&#12398;&#32763;&#35379;&#12434;&#12420;&#12426;&#36930;&#12370;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12371;&#12391;&#36848;&#12409;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12381;&#12398;&#12418;&#12398;&#12392;&#26126;&#12425;&#12363;&#12395;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;&#20309;&#12363;&#12364;&#12501;&#12522;&#12540;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#22806;&#35211;&#12364;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12434;&#24825;&#12365;&#12388;&#12369;&#12427;&#39749;&#21147;&#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#22580;&#21512;&#12395;&#12399;&#12289;&#12393;&#12435;&#12394;&#12371;&#12392;&#12391;&#12418;&#21487;&#33021;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;&#31169;&#12399;&#33258;&#20998;&#12398;&#23567;&#12373;&#12394;&#26412;&#12364;&#12371;&#12435;&#12394;&#12395;&#22810;&#12367;&#12398;&#28508;&#22312;&#30340;&#12394;&#26032;&#12375;&#12356;&#35501;&#32773;&#12434;&#29554;&#24471;&#12377;&#12427;&#12392;&#12399;&#24605;&#12356;&#12418;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;2&#20154;&#12398;&#32763;&#35379;&#32773;&#12395;&#12424;&#12387;&#12390;&#12289;&#12381;&#12428;&#12364;&#25104;&#12375;&#36930;&#12370;&#12425;&#12428;&#12383;&#12398;&#12391;&#12377;&#12290;
  </p><p>
    &#12288;&#12501;&#12522;&#12540;&#12391;&#12394;&#12356;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#26412;&#12398;&#22580;&#21512;&#12289;&#12388;&#12414;&#12426;&#12289;&#20253;&#32113;&#30340;&#12394;&#33879;&#20316;&#27177;&#12395;&#22522;&#12389;&#12367;&#21046;&#38480;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12399;&#12393;&#12358;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;&#12288;&#27531;&#24565;&#12391;&#12377;&#12364;&#12289;&#12381;&#12358;&#12375;&#12383;&#26412;&#12399;&#32763;&#35379;&#12373;&#12428;&#12427;&#22810;&#12367;&#12398;&#21487;&#33021;&#24615;&#12398;&#33469;&#12434;&#25688;&#12435;&#12391;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12371;&#12398;&#26412;&#12399;&#26085;&#26412;&#35486;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#32004;60&#20154;&#12398;&#32763;&#35379;&#32773;&#12395;&#12424;&#12387;&#12390;8&#12388;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#32763;&#35379;&#12364;&#26082;&#12395;&#23436;&#20102;&#12375;&#12390;&#12356;&#12427;&#35328;&#35486;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;&#12414;&#12384;&#29694;&#22312;&#36914;&#34892;&#20013;&#12398;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12371;&#12398;&#26412;&#12399;&#30456;&#23550;&#30340;&#12395;&#12510;&#12452;&#12490;&#12540;&#12394;&#26412;&#12394;&#12398;&#12391;&#12377;&#65281;&#12288;&#26412;&#23627;&#12395;&#20006;&#12435;&#12391;&#12356;&#12427;&#12411;&#12392;&#12435;&#12393;&#12398;&#26412;&#12399;&#65288;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#35328;&#35486;&#12398;&#31684;&#30087;&#12391;&#12399;&#65289;&#31169;&#12398;&#26412;&#12424;&#12426;&#20154;&#27671;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#32763;&#35379;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#23569;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  </p><p>
      &#12371;&#12428;&#12399;&#23569;&#12293;&#27531;&#24565;&#12395;&#24605;&#12360;&#12414;&#12377;&#12290;
      &#31169;&#12399;&#12371;&#12398;&#26412;&#12391;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#21205;&#12356;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#12431;&#12363;&#12426;&#12420;&#12377;&#12367;&#35500;&#26126;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12420;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#21407;&#29702;&#12364;&#31038;&#20250;&#30340;&#12414;&#12383;&#12399;&#36947;&#24499;&#30340;&#12395;&#12393;&#12398;&#12424;&#12358;&#12394;&#24847;&#21619;&#21512;&#12356;&#12434;&#25345;&#12388;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#35302;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12371;&#12398;&#26085;&#26412;&#35486;&#29256;&#12395;&#21521;&#12369;&#12383;&#24207;&#25991;&#12398;&#20013;&#12391;&#12289;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;&#30452;&#25509;&#35302;&#12428;&#12390;&#12362;&#12367;&#12371;&#12392;&#12395;&#12375;&#12414;&#12377;&#12290;&#26085;&#26412;&#35486;&#29256;&#12398;&#32763;&#35379;&#12399;&#12289;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#26412;&#12364;&#12501;&#12522;&#12540;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;2&#20154;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12364;&#26368;&#22823;&#38480;&#12395;&#27963;&#29992;&#12375;&#12383;&#12363;&#12425;&#12371;&#12381;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;&#20206;&#12395;&#21516;&#27096;&#12398;&#33258;&#30001;&#12364;&#22810;&#12367;&#12398;&#26412;&#12395;&#24195;&#12414;&#12428;&#12400; &#8212; &#12416;&#12375;&#12429;&#12289;&#12394;&#12380;&#12377;&#12409;&#12390;&#12398;&#26412;&#12395;&#24195;&#12414;&#12425;&#12394;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311; &#8212; &#26085;&#26412;&#20154;&#12399;&#12289;&#12424;&#12426;&#22810;&#12367;&#12398;&#27915;&#26360;&#12434;&#26085;&#26412;&#35486;&#12391;&#35501;&#12417;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#20182;&#12398;&#22269;&#12398;&#20154;&#12293;&#12384;&#12387;&#12390;&#21516;&#12376;&#12391;&#12377;&#12290;
  </p><p>
    &#12288;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12391;&#20309;&#24180;&#12418;&#20685;&#12356;&#12390;&#12365;&#12390;&#12289;&#31169;&#12399;&#26412;&#12398;&#32763;&#35379;&#12434;&#20986;&#29256;&#12377;&#12427;&#12398;&#12395;&#12356;&#12385;&#12356;&#12385;&#35377;&#21487;&#12434;&#27714;&#12417;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12399;&#22793;&#12384;&#12392;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#31169;&#12398;&#26412;&#12391;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12392;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12300;&#39364;&#30446;&#12301;&#12392;&#35328;&#12358;&#20154;&#12364;&#35504;&#12418;&#12356;&#12394;&#12356;&#12398;&#12391;&#12289;&#32763;&#35379;&#12399;&#33258;&#28982;&#30330;&#29983;&#30340;&#12395;&#22987;&#12417;&#12425;&#12428;&#12414;&#12377;&#12290;&#12354;&#12394;&#12383;&#12364;&#12371;&#12398;&#26085;&#26412;&#35486;&#29256;&#12434;&#35501;&#12416;&#12392;&#12365;&#12395;&#12399;&#12289;&#12371;&#12398;&#26412;&#12395;&#26360;&#12356;&#12390;&#12354;&#12427;&#21147;&#23398;&#12392;&#21516;&#12376;&#21147;&#12364;&#20685;&#12356;&#12383;&#32080;&#26524;&#12392;&#12375;&#12390;&#12289;&#12371;&#12398;&#26412;&#12364;&#12354;&#12427;&#12398;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24515;&#12395;&#30041;&#12417;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#21147;&#23398;&#12392;&#12399;&#12289;&#26082;&#23384;&#12398;&#20316;&#21697;&#12434;&#33258;&#20998;&#12383;&#12385;&#12398;&#37117;&#21512;&#12395;&#21512;&#12431;&#12379;&#12390;&#25913;&#22793;&#12377;&#12427;&#23436;&#20840;&#12394;&#33258;&#30001;&#12364;&#19982;&#12360;&#12425;&#12428;&#12390;&#12356;&#12390;&#12289;&#20182;&#20154;&#12392;&#21332;&#21147;&#12377;&#12427;&#12398;&#12418;&#33258;&#30001;&#12394;&#22580;&#21512;&#12395;&#20154;&#12293;&#12399;&#20309;&#12434;&#12377;&#12427;&#12398;&#12363;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#26085;&#26412;&#35486;&#29256;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12371;&#12358;&#12375;&#12383;&#33258;&#30001;&#12364;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#26360;&#31821;&#12420;&#20182;&#12398;&#31278;&#39006;&#12398;&#20316;&#21697;&#12395;&#12418;&#24195;&#12414;&#12387;&#12390;&#12356;&#12369;&#12400;&#12289;&#12392;&#12390;&#12418;&#32032;&#26228;&#12425;&#12375;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
  </p><p>
      &#26085;&#26412;&#35486;&#29256;&#12398;&#35379;&#32773;&#12391;&#12354;&#12427;&#39640;&#26408;&#27491;&#24344;&#27663;&#12392;&#39640;&#23713;&#33459;&#25104;&#27663;&#12395;&#12399;&#24515;&#12363;&#12425;&#12362;&#31036;&#12434;&#30003;&#12375;&#19978;&#12370;&#12414;&#12377;&#12290;&#24444;&#12425;&#12398;&#24525;&#32784;&#24375;&#12373;&#12392;&#29105;&#24847;&#12434;&#22810;&#12367;&#12398;&#35501;&#32773;&#12364;&#35413;&#20385;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12434;&#39000;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  </p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp23808" href="#idp23808" class="para">1</a>] </sup>
          &#23455;&#38555;&#12399; DocBook &#12392;&#21628;&#12400;&#12428;&#12427;&#25991;&#26360;&#29992;&#12398;&#12510;&#12540;&#12463;&#12450;&#12483;&#12503;&#35328;&#35486;&#12434; XML &#12391;&#35352;&#36848;&#12375;&#12289;Subversion &#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
          XML &#12420; Subversion &#12395;&#24931;&#12428;&#12394;&#12356;&#32763;&#35379;&#32773;&#12418;&#12356;&#12383;&#12398;&#12391;&#12289;&#33510;&#21172;&#12375;&#12390;&#12356;&#12383;&#20154;&#12418;&#12356;&#12383;&#12398;&#12399;&#20107;&#23455;&#12391;&#12377;&#12290;
        </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="preface.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#24207;&#25991;</td></tr></table></div></body></html>
