<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="bug-reporting.html" title="&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363;"><link rel="next" href="copyright.html" title="&#20184;&#37682;G &#33879;&#20316;&#27177;&#34920;&#31034;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-reporting.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="copyright.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="appendix" title="&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;"><div class="titlepage"><div><div><h2 class="title"><a name="producingoss.ja.afterwords"></a>&#20184;&#37682;F &#35379;&#32773;&#12354;&#12392;&#12364;&#12365;</h2></div></div></div><div class="simplesect"><div class="titlepage"><div><div><div class="authorgroup"><div class="author"><h3 class="author"><span class="surname">&#39640;&#23713;</span> <span class="firstname">&#33459;&#25104;</span> [FAMILY Given]</h3></div></div></div><div><p class="pubdate">2009&#24180;3&#26376;</p></div></div></div><p>
&#39640;&#26408;&#12373;&#12435;&#12364;&#12392;&#12354;&#12427;&#12477;&#12540;&#12471;&#12515;&#12523;&#12502;&#12483;&#12463;&#12510;&#12540;&#12463;&#12469;&#12540;&#12499;&#12473;&#12395;&#21407;&#33879;&#12398;&#12458;&#12531;&#12521;&#12452;&#12531;&#29256;&#12434;&#12502;&#12483;&#12463;&#12510;&#12540;&#12463;&#12375;&#12383;&#12371;&#12392;&#12290;&#12381;&#12428;&#12364;&#20840;&#12390;&#12398;&#12399;&#12376;&#12414;&#12426;&#12384;&#12387;&#12383;&#12290;&#12374;&#12387;&#12392;&#35501;&#12435;&#12391;&#12415;&#12383;&#12354;&#12392;&#12289;&#12371;&#12428;&#12414;&#12391;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#32773;&#12364;&#26263;&#40665;&#12398;&#12358;&#12385;&#12395;&#21463;&#12369;&#20837;&#12428;&#12390;&#12365;&#12383;&#12289;&#12414;&#12383;&#12399;&#23455;&#36341;&#12375;&#12390;&#12365;&#12383;&#12494;&#12454;&#12495;&#12454;&#12434;&#12371;&#12371;&#12414;&#12391;&#12399;&#12387;&#12365;&#12426;&#12392;&#35328;&#33865;&#12395;&#12375;&#12383;&#25991;&#31456;&#12399;&#35211;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#12392;&#30452;&#24863;&#12375;&#12383;&#12290;&#12300;&#12371;&#12428;&#12399;&#30342;&#12395;&#20253;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12301;&#12392;&#24605;&#12387;&#12383;&#30636;&#38291;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12434;&#36016;&#12358;&#12409;&#12367;&#22868;&#36208;&#12375;&#12390;&#12356;&#12383;&#12290;
</p><p>
&#12381;&#12428;&#12363;&#12425;1&#24180;&#21322;&#12289;&#24444;&#12392;&#12405;&#12383;&#12426;&#12391;&#20096;&#12398;&#12424;&#12358;&#12394;&#12473;&#12500;&#12540;&#12489;&#12391;&#32763;&#35379;&#12434;&#32154;&#12369;&#12390;&#12365;&#12383;&#12290;&#27491;&#30452;&#12289;&#12424;&#12367;&#32154;&#12356;&#12383;&#12418;&#12398;&#12384;&#12392;&#24605;&#12358;&#12290;&#12362;&#20114;&#12356;&#12395;&#26412;&#26989;&#12364;&#12354;&#12427;&#20013;&#12391;&#12506;&#12540;&#12473;&#12434;&#32173;&#25345;&#12391;&#12365;&#12383;&#12398;&#12399;&#12289;&#21407;&#33879;&#12364;&#25345;&#12388;&#28611;&#12356;&#20869;&#23481;&#12434;&#26085;&#26412;&#35486;&#12391;&#26159;&#38750;&#20253;&#12360;&#12383;&#12356;&#12392;&#24605;&#12358;&#12514;&#12481;&#12505;&#12540;&#12471;&#12519;&#12531;&#12392;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#21407;&#33879;&#32773;&#12398; Karl Fogel &#12364;&#12367;&#12428;&#12383;&#27096;&#12293;&#12394;&#21169;&#12414;&#12375;&#12364;&#12354;&#12387;&#12383;&#12363;&#12425;&#12395;&#20182;&#12394;&#12425;&#12394;&#12356;&#12290;Karl &#12399;&#12414;&#12373;&#12395;&#12300;&#27671;&#37197;&#12426;&#12301;&#12398;&#20154;&#12391;&#12354;&#12427;&#12290;&#26412;&#26360;&#12391;&#12418;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12434;&#32113;&#27835;&#12377;&#12427;&#12395;&#24403;&#12383;&#12387;&#12390;&#12398;&#27096;&#12293;&#12394;&#12418;&#12398;&#12398;&#35328;&#12356;&#26041;&#12289;&#27671;&#37197;&#12426;&#12395;&#12388;&#12356;&#12390;&#35302;&#12428;&#12390;&#12356;&#12427;&#12364;&#12289;&#24444;&#12399;&#12381;&#12428;&#12434;&#24544;&#23455;&#12395;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24605;&#12360;&#12383;&#12290;&#31169;&#12399;&#26412;&#26360;&#12398;&#32763;&#35379;&#12434;&#36890;&#12375;&#12390;&#22810;&#12367;&#12398;&#12371;&#12392;&#12434;&#23398;&#12403;&#12289;&#23455;&#38555;&#12395;&#12513;&#12531;&#12486;&#12490;&#12540;&#12434;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36939;&#21942;&#12395;&#29983;&#12363;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12390;&#12356;&#12427;&#12290;
</p><p>
&#26085;&#26412;&#35486;&#29256;&#12434;&#21002;&#34892;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;Karl &#12392;&#39640;&#26408;&#12373;&#12435;&#12398;&#20182;&#12395;&#12418;&#27096;&#12293;&#12394;&#26041;&#12293;&#12398;&#21161;&#12369;&#12434;&#38914;&#12356;&#12383;&#12290;&#12371;&#12371;&#12391;&#20840;&#12390;&#12398;&#21517;&#21069;&#12434;&#25369;&#12370;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12364;&#12289;&#32763;&#35379;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12289;&#12467;&#12513;&#12531;&#12488;&#12434;&#12367;&#12428;&#12383;&#12473;&#12521;&#12483;&#12471;&#12517;&#12489;&#12483;&#12488;&#12472;&#12515;&#12497;&#12531;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#26041;&#12293;&#12289;&#12381;&#12375;&#12390;&#30452;&#25509;&#12513;&#12540;&#12523;&#12391;&#27096;&#12293;&#12394;&#25351;&#25688;&#12434;&#12375;&#12390;&#12367;&#12428;&#12383;&#35501;&#32773;&#12398;&#23384;&#22312;&#12399;&#35211;&#36867;&#12379;&#12394;&#12356;&#12290;&#12414;&#12383;&#12289;&#32232;&#38598;&#32773;&#12398;&#27611;&#21033;&#12373;&#12435;&#12395;&#12399;&#27096;&#12293;&#12394;&#32048;&#12363;&#12356;&#20316;&#26989;&#12434;&#12375;&#12390;&#38914;&#12356;&#12383;&#12290;&#12373;&#12425;&#12395;&#12289;&#12501;&#12522;&#12540;&#12398;&#12458;&#12531;&#12521;&#12452;&#12531;&#29256;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#30693;&#12426;&#12394;&#12364;&#12425;&#12289;&#26412;&#26360;&#12398;&#20986;&#29256;&#12434;&#27770;&#12417;&#12390;&#12367;&#12428;&#12383;&#12458;&#12521;&#12452;&#12522;&#12540;&#12539;&#12472;&#12515;&#12497;&#12531;&#12398;&#25040;&#12398;&#28145;&#12373;&#12395;&#12399;&#25964;&#26381;&#12379;&#12374;&#12427;&#12434;&#24471;&#12394;&#12356;&#12290;&#12371;&#12398;&#12354;&#12392;&#12364;&#12365;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#20170;&#12289;&#12371;&#12371;&#12414;&#12391;&#36799;&#12426;&#30528;
&#12356;&#12383;&#12371;&#12392;&#12434;&#32032;&#30452;&#12395;&#21916;&#12403;&#12289;&#24444;&#12425;&#12395;&#24515;&#12363;&#12425;&#24863;&#35613;&#12398;&#24847;&#12434;&#34920;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#12290;
</p><p>
&#32763;&#35379;&#12392;&#12356;&#12358;&#12398;&#12399;&#12300;&#20195;&#24321;&#12301;&#12392;&#12418;&#12356;&#12360;&#12427;&#12290;&#12383;&#12392;&#12360;&#20195;&#24321;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#21172;&#21147;&#12434;&#25173;&#12387;&#12390;&#20253;&#12360;&#12383;&#12356;&#12392;&#24605;&#12358;&#12493;&#12479;&#12387;&#12390;&#12381;&#12358;&#12399;&#12394;&#12356;&#12392;&#24605;&#12358;&#12290;&#26412;&#26360;&#12399;&#31169;&#12395;&#12392;&#12387;&#12390;&#12414;&#12373;&#12395;&#12381;&#12398;&#21172;&#21147;&#12434;&#25173;&#12358;&#12395;&#20516;&#12377;&#12427;&#20869;&#23481;&#12391;&#12354;&#12427;&#12392;&#20449;&#12376;&#12390;&#12356;&#12427;&#12375;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#24515;&#12364;&#12354;&#12427;&#38283;&#30330;&#32773;&#12395;&#12418;&#24433;&#38911;&#12434;&#19982;&#12360;&#12425;&#12428;&#12427;&#20869;&#23481;&#12391;&#12354;&#12427;&#12392;&#20449;&#12376;&#12390;&#12420;&#12414;&#12394;&#12356;&#12290;&#12371;&#12398;&#26412;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12395;&#39131;&#12403;&#36796;&#12416;&#19968;&#21161;&#12392;&#12394;&#12427;&#12371;&#12392;&#12434;&#39000;&#12387;&#12390;&#12356;&#12427;&#12290;
</p><p>
May the Source Be With You!
</p><pre class="programlisting">


--------------------------------------------------------------------------------

</pre></div><div class="simplesect"><div class="titlepage"><div><div><div class="authorgroup"><div class="author"><h3 class="author"><span class="surname">&#39640;&#26408;</span> <span class="firstname">&#27491;&#24344;</span> [FAMILY Given]</h3></div></div></div><div><p class="pubdate">2009&#24180;3&#26376;</p></div></div></div><p>
&#21407;&#33879;&#12300;Producing Open Source Software&#12301;&#12398;&#20840;&#25991;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30693;&#12387;&#12383;&#12398;&#12399;2007&#24180;5&#26376;&#12398;&#12371;&#12392;&#12290;&#12354;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12364;&#33618;&#12428;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#12363;&#12397;&#12383;&#20154;&#12364;&#12300;&#12415;&#12435;&#12394;&#12371;&#12428;&#12434;&#35501;&#12416;&#12392;&#12356;&#12356;&#12424;&#12301;&#12392;&#32057;&#20171;&#12375;&#12390;&#12356;&#12425;&#12375;&#12383;&#12398;&#12364;&#12365;&#12387;&#12363;&#12369;&#12391;&#12375;&#12383;
<sup>[<a name="idp3591792" href="#ftn.idp3591792" class="footnote">47</a>]</sup>&#12290;&#24444;&#12364;&#32057;&#20171;&#12375;&#12390;&#12356;&#12383;&#37096;&#20998;&#12434;&#35501;&#12435;&#12391;&#28145;&#12367;&#24863;&#37528;&#12434;&#21463;&#12369;&#12383;&#31169;&#12399;&#12289;&#12373;&#12387;&#12381;&#12367;&#12381;&#12398;&#26085;&#26412;&#35486;&#35379;&#12398;&#20316;&#25104;&#12395;&#21462;&#12426;&#32068;&#12416;&#12371;&#12392;&#12434;&#27770;&#12417;&#12383;&#12398;&#12391;&#12377;&#12290;&#12381;&#12398;&#38915;&#12395;&#12399;&#12289;&#12414;&#12373;&#12363;2&#24180;&#24460;&#12395;&#26085;&#26412;&#35486;&#29256;&#12364;&#20986;&#29256;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12392;&#12399;&#24605;&#12387;&#12390;&#12418;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
</p><p>
&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12367;&#12395;&#12399;&#12289;&#12424;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26360;&#12367;&#12371;&#12392;&#20197;&#22806;&#12395;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#12371;&#12392;&#12434;&#32771;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12398;&#20105;&#12356;&#12398;&#12375;&#12378;&#12417;&#12363;&#12383;&#12394;&#12393;&#12418;&#12381;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;&#12371;&#12428;&#12414;&#12391;&#21475;&#20253;&#12391;&#21463;&#12369;&#32153;&#12364;&#12428;&#12390;&#12356;&#12367;&#12371;&#12392;&#12364;&#22810;&#12363;&#12387;&#12383;&#12371;&#12428;&#12425;&#12398;&#20107;&#26564;&#12434;&#65297;&#20874;&#12398;&#26360;&#31821;&#12392;&#12375;&#12390;&#12414;&#12392;&#12417;&#12354;&#12370;&#12383;&#26412;&#26360;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12363;&#12363;&#12431;&#12427;&#12377;&#12409;&#12390;&#12398;&#26041;&#12395;&#12392;&#12387;&#12390;&#26377;&#29992;&#12394;&#12418;&#12398;&#12392;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
&#26085;&#26412;&#35486;&#35379;&#12434;&#36914;&#12417;&#12390;&#12356;&#12367;&#19978;&#12391;&#12289;&#22810;&#12367;&#12398;&#26041;&#12395;&#12362;&#19990;&#35441;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;&#21407;&#33879;&#32773;&#12398;KarlFogel&#12373;&#12435;&#12399;&#12289;&#12377;&#12400;&#12425;&#12375;&#12356;&#20869;&#23481;&#12398;&#25991;&#31456;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#25552;&#20379;&#12375;&#12390;&#12367;&#12384;&#12373;&#12387;&#12383;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#31169;&#12383;&#12385;&#12398;&#32763;&#35379;&#20316;&#26989;&#12434;&#21147;&#24375;&#12367;&#12501;&#12457;&#12525;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12426;&#12414;&#12375;&#12383;&#12290;&#24444;&#12363;&#12425;&#12356;&#12383;&#12384;&#12356;&#12383;&#12450;&#12489;&#12496;&#12452;&#12473;&#12420;&#21169;&#12414;&#12375;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#32763;&#35379;&#20316;&#26989;&#12434;&#12473;&#12512;&#12540;&#12474;&#12395;&#36914;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;&#32763;&#35379;&#20316;&#26989;&#12398;&#20013;&#30436;&#20197;&#38477;&#12399;&#12289;&#20849;&#21516;&#32763;&#35379;&#32773;&#12398;&#39640;&#23713;&#12373;&#12435;&#12398;&#12497;&#12527;&#12540;&#12395;&#21161;&#12369;&#12425;&#12428;&#12387;&#12401;&#12394;&#12375;&#12391;&#12375;&#12383;&#12290;&#24444;&#12364;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;&#12371;&#12398;&#32763;&#35379;&#12364;&#23436;&#25104;&#12377;&#12427;&#12371;&#12392;&#12418;&#12394;&#12363;&#12387;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;&#21407;&#33879;&#12392;&#21516;&#27096;&#12289;&#26085;&#26412;&#35486;&#29256;&#12398;&#21407;&#31295;&#12418;&#12414;&#12383;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;
<sup>[<a name="idp3596608" href="#ftn.idp3596608" class="footnote">48</a>]</sup>&#12290;&#12381;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#22810;&#12367;&#12398;&#26041;&#12363;&#12425;&#32763;&#35379;&#12408;&#12398;&#12501;&#12451;&#12540;&#12489;&#12496;&#12483;&#12463;&#12434;&#12356;&#12383;&#12384;&#12365;&#12414;&#12375;&#12383;&#12290;IRC&#12420;&#12513;&#12540;&#12523;&#12394;&#12393;&#12391;&#20309;&#24230;&#12392;&#12394;&#12367;&#32048;&#12363;&#12356;&#25351;&#25688;&#12434;&#12375;&#12390;&#12367;&#12384;&#12373;&#12387;&#12383;&#26041;&#12418;&#12356;&#12425;&#12387;&#12375;&#12419;&#12356;&#12414;&#12375;&#12383;&#12375;&#12289;&#12473;&#12521;&#12483;&#12471;&#12517;&#12489;&#12483;&#12488;&#12472;&#12515;&#12497;&#12531;&#12395;&#12497;&#12483;&#12481;&#12434;&#25237;&#31295;&#12375;&#12390;&#12367;&#12384;&#12373;&#12387;&#12383;&#26041;&#12418;&#12356;&#12425;&#12387;&#12375;&#12419;&#12356;&#12414;&#12375;&#12383;&#12290;&#12371;&#12371;&#12391;&#20840;&#21729;&#12398;&#12362;&#21517;&#21069;&#12434;&#12354;&#12370;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12364;&#12289;&#12415;&#12394;&#12373;&#12435;&#12398;&#25351;&#25688;&#12399;&#12392;&#12390;&#12418;&#24441;&#31435;&#12385;&#12414;&#12375;&#12383;&#12290;
</p><p>
&#12381;&#12375;&#12390;&#26368;&#24460;&#12395;&#12290;&#20840;&#25991;&#12364;&#12454;&#12455;&#12502;&#19978;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#26412;&#26360;&#12398;&#26360;&#31821;&#21270;&#12434;&#27770;&#26029;&#12375;&#12390;&#12367;&#12384;&#12373;&#12387;&#12383;&#12458;&#12521;&#12452;&#12522;&#12540;&#12539;&#12472;&#12515;&#12497;&#12531;&#12289;&#20986;&#29256;&#12395;&#12354;&#12383;&#12387;&#12390;&#25968;&#22810;&#12367;&#12398;&#25163;&#21161;&#12369;&#12434;&#12356;&#12383;&#12384;&#12356;&#12383;&#32232;&#38598;&#12398;&#27611;&#21033;&#12373;&#12435;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#12415;&#12394;&#12373;&#12435;&#12398;&#12362;&#25163;&#20803;&#12395;&#26412;&#26360;&#12434;&#12362;&#23626;&#12369;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;&#31169;&#12364;&#21407;&#33879;&#12363;&#12425;&#24433;&#38911;&#12434;&#21463;&#12369;&#12383;&#12398;&#12392;&#21516;&#27096;&#12289;&#12415;&#12394;&#12373;&#12435;&#12364;&#26412;&#26360;&#12363;&#12425;&#20309;&#12363;&#12434;&#24471;&#12390;&#12356;&#12383;&#12384;&#12367;&#12371;&#12392;&#12364;&#12354;&#12428;&#12400;&#24184;&#12356;&#12391;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3591792" href="#idp3591792" class="para">47</a>] </sup>
    <a class="ulink" href="http://blog.thepimp.net/archives/Good-reading-for-Mailing-list-members.html" target="_top">http://blog.thepimp.net/archives/Good-reading-for-Mailing-list-members.html</a>
  </p></div><div class="footnote"><p><sup>[<a id="ftn.idp3596608" href="#idp3596608" class="para">48</a>] </sup>
    <a class="ulink" href="http://producingoss.com/ja/index.html" target="_top">http://producingoss.com/ja/index.html</a>
  </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-reporting.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="copyright.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20184;&#37682;E &#12496;&#12464;&#22577;&#21578;&#12398;&#12420;&#12426;&#26041;&#12434;&#35500;&#26126;&#12375;&#12383;&#20363; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20184;&#37682;G &#33879;&#20316;&#27177;&#34920;&#31034;</td></tr></table></div></body></html>
