<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#23459;&#20253;&#12539;&#24195;&#22577;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;"><link rel="prev" href="bug-tracker-usage.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356;"><link rel="next" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#23459;&#20253;&#12539;&#24195;&#22577;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-tracker-usage.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</th><td width="20%" align="right"> <a accesskey="n" href="development-cycle.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#23459;&#20253;&#12539;&#24195;&#22577;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="publicity"></a>&#23459;&#20253;&#12539;&#24195;&#22577;</h2></div></div></div><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12391;&#12399;&#12289;
  &#20869;&#37096;&#12391;&#12398;&#35696;&#35542;&#12392;&#19968;&#33324;&#21521;&#12369;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#38291;&#12395;&#26126;&#30906;&#12394;&#36949;&#12356;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#19968;&#22240;&#12392;&#12375;&#12390;&#12399;&#12289;&#24819;&#23450;&#12377;&#12427;&#35501;&#12415;&#25163;&#12364;&#12399;&#12387;&#12365;&#12426;&#23450;&#32681;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12411;&#12412;&#12377;&#12409;&#12390;&#12398;&#25237;&#31295;&#12364;&#19968;&#33324;&#21521;&#12369;&#12395;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12377;&#12428;&#12400;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#37096;&#12398;&#20154;&#12383;&#12385;&#12364;&#12381;&#12398;&#25237;&#31295;&#12434;&#12393;&#12358;&#21463;&#12369;&#21462;&#12427;&#12363;&#12394;&#12393;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#37096;&#12395;&#20844;&#38283;&#12377;&#12427;&#12388;&#12418;&#12426;&#12394;&#12393;&#12414;&#12387;&#12383;&#12367;&#12394;&#12363;&#12387;&#12383;&#25237;&#31295;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12383;&#12392;&#12360;&#12400; <a class="ulink" href="http://slashdot.org/" target="_top">slashdot.org</a>
  &#12408;&#12398;&#12479;&#12524;&#12467;&#12511;&#12394;&#12393;&#12398;&#24433;&#38911;&#12391;&#20309;&#30334;&#19975;&#12418;&#12398;&#20154;&#12395;&#35501;&#12414;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12367;&#12395;&#12354;&#12383;&#12387;&#12390;&#12371;&#12428;&#12399;&#36991;&#12369;&#12425;&#12428;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#36890;&#24120;&#12381;&#12398;&#12522;&#12473;&#12463;&#12399;&#12354;&#12414;&#12426;&#22823;&#12365;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#19968;&#33324;&#12395;&#12289;&#27491;&#12375;&#12356;&#26041;&#27861;&#12391;&#24773;&#22577;&#12398;&#22577;&#36947;&#20385;&#20516;&#12434;&#31034;&#12375;&#12390;&#12362;&#12365;&#12373;&#12360;&#12377;&#12428;&#12400;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#37096;&#12395;&#20253;&#12360;&#12427;&#12409;&#12365;&#24773;&#22577;&#12399;&#12365;&#12385;&#12435;&#12392;&#20253;&#12431;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#37325;&#35201;&#12394;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#22580;&#21512;&#12289;&#12381;&#12398;&#20844;&#38283;&#26041;&#27861;&#12399; 4 &#36890;&#12426;&#12363; 5 &#36890;&#12426;&#12367;&#12425;&#12356;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#21508;&#26041;&#38754;&#12408;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#12399;&#12411;&#12412;&#21516;&#26178;&#12395;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
      &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12399;&#12289;&#12362;&#12381;&#12425;&#12367;&#26368;&#12418;&#22810;&#12367;&#12398;&#20154;&#12383;&#12385;&#12364;&#30446;&#12395;&#12377;&#12427;&#22580;&#25152;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#37325;&#22823;&#12394;&#12450;&#12490;&#12454;&#12531;&#12473;&#12395;&#38306;&#12375;&#12390;&#12399;&#12289;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12395;&#12418;&#25522;&#36617;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
      &#12371;&#12371;&#12395;&#25522;&#36617;&#12377;&#12427;&#12398;&#12399;&#27010;&#35201;&#12384;&#12369;&#12392;&#12375;&#12289;&#35443;&#32048;&#12394;&#24773;&#22577;&#12434;&#30693;&#12426;&#12383;&#12356;&#20154;&#12398;&#12383;&#12417;&#12395;&#12399;
      &#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473; (&#20197;&#19979;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;) &#12408;&#12398;&#12522;&#12531;&#12463;&#12434;&#29992;&#24847;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12414;&#12383;&#12289;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#19978;&#12395;&#12399;&#12300;&#12491;&#12517;&#12540;&#12473;&#12301;&#12420;&#12300;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12301;
      &#12392;&#38988;&#12375;&#12383;&#22580;&#25152;&#12434;&#35373;&#12369;&#12289;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#35443;&#32048;&#12399;&#12381;&#12371;&#12395;&#26360;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
      &#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12398;&#30446;&#30340;&#12398;&#12402;&#12392;&#12388;&#12399;&#12289;
      &#20182;&#12398;&#12469;&#12452;&#12488;&#12363;&#12425;&#12398;&#12522;&#12531;&#12463;&#12398;&#38555;&#12395;&#20351;&#29992;&#12377;&#12427;&#12289;&#27491;&#35215;&#12398;
      &#12300;&#12450;&#12490;&#12454;&#12531;&#12473;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12301;&#12434;&#29992;&#24847;&#12377;&#12427;&#12371;&#12392;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12399;&#36969;&#20999;&#12394;&#27083;&#36896;&#12395;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12372;&#12392;&#12395;&#20491;&#21029;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#29992;&#24847;&#12377;&#12427;&#12395;&#12375;&#12390;&#12418;&#12289;
      &#12402;&#12392;&#12388;&#12398;blog&#12398;&#20491;&#21029;&#12398;&#12456;&#12531;&#12488;&#12522;&#12392;&#12377;&#12427;&#12395;&#12375;&#12390;&#12418;&#12289;
      &#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#20182;&#12398;&#24418;&#24335;&#12395;&#12377;&#12427;&#12392;&#12375;&#12390;&#12418;&#12289;
      &#20182;&#12398;&#12469;&#12452;&#12488;&#12363;&#12425;&#12522;&#12531;&#12463;&#12377;&#12427;&#38555;&#12395;
      &#21029;&#12398;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12392;&#21306;&#21029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    </p></li><li class="listitem"><p>
      &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364; RSS &#12501;&#12451;&#12540;&#12489;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;
      (<a class="xref" href="rss.html" title="RSS &#12501;&#12451;&#12540;&#12489;">&#12300;RSS &#12501;&#12451;&#12540;&#12489;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12289;
      &#12381;&#12371;&#12395;&#12418;&#12450;&#12490;&#12454;&#12531;&#12473;&#12434;&#21547;&#12417;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#12469;&#12452;&#12488;&#12398;&#27083;&#31689;&#26041;&#27861;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
      &#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12383;&#12425;&#33258;&#21205;&#30340;&#12395;&#12501;&#12451;&#12540;&#12489;&#12418;&#26356;&#26032;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
   </p></li><li class="listitem"><p>
      &#26032;&#12383;&#12394;&#12522;&#12522;&#12540;&#12473;&#12364;&#20844;&#38283;&#12373;&#12428;&#12383;&#12392;&#12356;&#12358;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#22580;&#21512;&#12399;&#12289;
      <a class="ulink" href="http://freecode.com/" target="_top">http://freecode.com/</a>
      &#19978;&#12398;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12398;&#12456;&#12531;&#12488;&#12522;&#12418;&#26356;&#26032;&#12375;&#12414;&#12375;&#12423;&#12358;
      (Freshmeat &#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#20316;&#25104;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;
      <a class="xref" href="announcing.html" title="&#24195;&#22577;">&#12300;&#24195;&#22577;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12290;
      Freecode &#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#26356;&#26032;&#12377;&#12427;&#12392;&#12289;
      Freecode &#12398;&#22793;&#26356;&#23653;&#27508;&#12434;&#25201;&#12358;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12381;&#12398;&#12456;&#12531;&#12488;&#12522;&#12398;&#20869;&#23481;&#12364;&#25237;&#31295;&#12373;&#12428;&#12414;&#12377;&#12290;
      &#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12373;&#12428;&#12427;&#12398;&#12399;
      Freecode &#12398;&#26356;&#26032;&#24773;&#22577;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#12381;&#12428;&#20197;&#22806;&#12395;&#12418;&#12289;&#22810;&#25968;&#12398;&#20154;&#12364;&#27880;&#30446;&#12375;&#12390;&#12356;&#12427;&#12509;&#12540;&#12479;&#12523;&#12469;&#12452;&#12488;
      (<a class="ulink" href="http://slashdot.org" target="_top">http://slashdot.org</a> &#12394;&#12393;)
      &#12398;&#26356;&#26032;&#24773;&#22577;&#12418;&#25237;&#31295;&#12373;&#12428;&#12414;&#12377;&#12290;
      Freecode &#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12487;&#12540;&#12479;&#12434; RSS &#12501;&#12451;&#12540;&#12489;&#12391;&#12418;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12388;&#12414;&#12426;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; RSS
      &#12501;&#12451;&#12540;&#12489;&#12434;&#36092;&#35501;&#12375;&#12390;&#12356;&#12394;&#12356;&#20154;&#12383;&#12385;&#12395;&#12418;
      Freecode &#32076;&#30001;&#12391;&#24773;&#22577;&#12434;&#20253;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12450;&#12490;&#12454;&#12531;&#12473;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;
      &#12450;&#12490;&#12454;&#12531;&#12473;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21517;&#21069;&#12399; "announce" &#12392;&#12375;&#12414;&#12377;&#12290;
      &#12388;&#12414;&#12426; <code class="literal">announce@yourprojectdomain.org</code>
      &#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
      &#12371;&#12428;&#12399;&#20107;&#23455;&#19978;&#12398;&#27161;&#28310;&#12392;&#12375;&#12390;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#21517;&#21069;&#12391;&#12354;&#12426;&#12289;
      &#12371;&#12398;&#21517;&#21069;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#27969;&#12373;&#12428;&#12427;&#12513;&#12540;&#12523;&#12399;
      &#37325;&#35201;&#12394;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#12415;&#12395;&#38480;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#27969;&#12428;&#12427;&#12513;&#12540;&#12523;&#12398;&#12411;&#12392;&#12435;&#12393;&#12399;
      &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#26032;&#12383;&#12394;&#12522;&#12522;&#12540;&#12473;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
      &#12381;&#12428;&#20197;&#22806;&#12395;&#12418;&#36039;&#37329;&#38598;&#12417;&#12398;&#12362;&#30693;&#12425;&#12379;&#12420;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#33030;&#24369;&#24615;&#12398;&#30330;&#35211;
      (<span>&#26412;&#31456;&#12391;&#24460;&#12411;&#12393;&#12392;&#12426;&#12354;&#12370;&#12427;</span>
      <a class="xref" href="publicity.html#security" title="&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;">&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
      &#12395;&#38306;&#12377;&#12427;&#12513;&#12540;&#12523;&#12418;&#36865;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;
      &#12354;&#12427;&#12356;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22823;&#12365;&#12367;&#26041;&#21521;&#36578;&#25563;&#12377;&#12427;&#38555;&#12398;&#12362;&#30693;&#12425;&#12379;&#12394;&#12393;&#12418;&#25237;&#31295;&#12373;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
      <code class="literal">announce</code> &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#27969;&#37327;&#12399;&#12354;&#12414;&#12426;&#22810;&#12367;&#12394;&#12367;&#12289;
      &#12414;&#12383;&#37325;&#35201;&#12394;&#20869;&#23481;&#12398;&#12415;&#12395;&#20351;&#29992;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
      &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21508;&#31278;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#20013;&#12391;&#12418;
      &#36092;&#35501;&#32773;&#12398;&#31649;&#29702;&#12395;&#26368;&#12418;&#21147;&#12434;&#20837;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;
      (&#12354;&#12414;&#12426;&#20081;&#29992;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#29087;&#32771;&#12375;&#12390;&#12363;&#12425;&#25237;&#31295;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;)&#12290;
      &#35504;&#12418;&#12364;&#22909;&#12365;&#21213;&#25163;&#12395;&#12450;&#12490;&#12454;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12383;&#12426;
      &#12473;&#12497;&#12512;&#12384;&#12425;&#12369;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12289;
      <code class="literal">announce</code> &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;
      &#24517;&#12378;&#12514;&#12487;&#12524;&#12540;&#12488;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    </p></li></ol></div><p>
  &#12371;&#12428;&#12425;&#12398;&#21508;&#25152;&#12395;&#20986;&#12377;&#12450;&#12490;&#12454;&#12531;&#12473;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#21516;&#26178;&#12395;&#12394;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#27969;&#12373;&#12428;&#12383;&#12450;&#12490;&#12454;&#12531;&#12473;&#12364;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12420;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12395;&#21453;&#26144;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#12381;&#12428;&#12434;&#35211;&#12383;&#20154;&#12399;&#28151;&#20081;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#22793;&#26356; (&#12513;&#12540;&#12523;&#12398;&#36865;&#20449;&#12289;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12398;&#32232;&#38598;&#12394;&#12393;)
  &#12434;&#20107;&#21069;&#12395;&#28310;&#20633;&#12375;&#12390;&#12362;&#12356;&#12390;&#21516;&#26178;&#12395;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;
  &#24773;&#22577;&#12398;&#19968;&#36011;&#24615;&#12364;&#22833;&#12431;&#12428;&#12427;&#12371;&#12392;&#12364;&#23569;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12381;&#12428;&#12411;&#12393;&#37325;&#35201;&#12391;&#12418;&#12394;&#12356;&#20986;&#26469;&#20107;&#12398;&#22580;&#21512;&#12399;&#12289;
  &#19978;&#12391;&#12354;&#12370;&#12383;&#25163;&#27861;&#12398;&#12358;&#12385;&#12356;&#12367;&#12388;&#12363; (&#12354;&#12427;&#12356;&#12399;&#12377;&#12409;&#12390;) &#12434;&#30465;&#30053;&#12375;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#20986;&#26469;&#20107;&#12398;&#37325;&#35201;&#24615;&#12395;&#24540;&#12376;&#12390;&#12289;&#12381;&#12428;&#12391;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#37096;&#12395;&#12399;&#33258;&#28982;&#12395;&#20253;&#12431;&#12387;&#12390;&#12356;&#12367;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12300;&#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12364;&#20844;&#38283;&#12373;&#12428;&#12414;&#12375;&#12383;&#12301;&#12392;&#12356;&#12358;&#12398;&#12399;&#37325;&#35201;&#12394;&#20986;&#26469;&#20107;&#12391;&#12377;&#12364;&#12289;
  &#12383;&#12384;&#21336;&#12395;&#12300;&#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#20844;&#38283;&#20104;&#23450;&#26085;&#12364;&#27770;&#12414;&#12426;&#12414;&#12375;&#12383;&#12301;
  &#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#23455;&#38555;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#27604;&#12409;&#12390;&#12381;&#12428;&#12411;&#12393;&#37325;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12522;&#12522;&#12540;&#12473;&#20104;&#23450;&#26085;&#12364;&#27770;&#12414;&#12387;&#12383;&#12392;&#12356;&#12358;&#31243;&#24230;&#12398;&#24773;&#22577;&#12394;&#12425;
  (&#12450;&#12490;&#12454;&#12531;&#12473;&#23554;&#29992;&#12391;&#12399;&#12394;&#12367;) &#36890;&#24120;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12375;&#12289;
  &#12354;&#12392;&#12399;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#19978;&#12398;&#12479;&#12452;&#12512;&#12521;&#12452;&#12531;&#12434;&#26356;&#26032;&#12375;&#12390;&#12362;&#12367;&#12367;&#12425;&#12356;&#12391;&#21313;&#20998;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#24515;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;&#12289;
  &#12522;&#12522;&#12540;&#12473;&#20104;&#23450;&#26085;&#12364;&#27770;&#12414;&#12387;&#12383;&#12392;&#12356;&#12358;&#35441;&#38988;&#12434;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12398;&#20182;&#12398;&#22580;&#25152;&#12391;&#25345;&#12385;&#20986;&#12377;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12369;&#12428;&#12393;&#12418;
  &#12383;&#12384;&#35441;&#12434;&#32862;&#12356;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#33258;&#20998;&#12399;&#19968;&#20999;&#30330;&#35328;&#12375;&#12394;&#12356;&#12392;&#12356;&#12358;&#20154;&#12383;&#12385;&#12364;&#12289;
  &#24517;&#12378;&#12375;&#12418;&#20182;&#12398;&#22580;&#25152;&#12391;&#12418;&#21516;&#12376;&#12424;&#12358;&#12395;&#40665;&#12387;&#12390;&#12356;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21475;&#12467;&#12511;&#12398;&#24433;&#38911;&#12399;&#20398;&#12428;&#12414;&#12379;&#12435;&#12290;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12450;&#12490;&#12454;&#12531;&#12473;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12364;&#27491;&#12375;&#12356;&#20869;&#23481;&#12391;&#21608;&#12426;&#12395;&#24195;&#12414;&#12427;&#12424;&#12358;&#24515;&#12364;&#12369;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#20855;&#20307;&#30340;&#12395;&#35328;&#12358;&#12392;&#12289;&#20182;&#12398;&#20154;&#12395;&#24341;&#29992;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#24819;&#23450;&#12375;&#12383;&#25237;&#31295;&#12391;&#12399;&#12289;
  &#12393;&#12398;&#37096;&#20998;&#12434;&#24341;&#29992;&#12375;&#12390;&#12418;&#12425;&#12356;&#12383;&#12356;&#12398;&#12363;&#12434;&#26126;&#30906;&#12395;&#12375;&#12289;
  &#12381;&#12398;&#37096;&#20998;&#12399;&#20844;&#24335;&#12398;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12392;&#22793;&#12431;&#12425;&#12394;&#12356;&#12524;&#12505;&#12523;&#12391;&#26360;&#12367;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
       &#38283;&#30330;&#12398;&#26368;&#26032;&#29366;&#27841;&#12434;&#12362;&#30693;&#12425;&#12379;&#12375;&#12414;&#12377;&#12290;Scanley &#12398;&#12496;&#12540;&#12472;&#12519;&#12531; 2.0 &#12434;&#12289;
       2005 &#24180; 8 &#26376;&#20013;&#26092;&#12395;&#12522;&#12522;&#12540;&#12473;&#20104;&#23450;&#12391;&#12377;&#12290;&#35443;&#32048;&#12394;&#24773;&#22577;&#12399;
       http://www.scanley.org/status.html &#12391;&#12418;&#12372;&#35239;&#12356;&#12383;&#12384;&#12369;&#12414;&#12377;&#12290;
       &#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#36861;&#21152;&#12373;&#12428;&#12427;&#20027;&#35201;&#12394;&#27231;&#33021;&#12399;&#12289;&#27491;&#35215;&#34920;&#29694;&#12395;&#12424;&#12427;&#26908;&#32034;&#12391;&#12377;&#12290;
     </em></span></p><p><span class="emphasis"><em>
       &#12381;&#12398;&#20182;&#12398;&#26032;&#27231;&#33021;&#12399;&#12289; ... &#12414;&#12383;&#12289;
       &#27425;&#12398;&#12424;&#12358;&#12394;&#12496;&#12464;&#12398;&#20462;&#27491;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377; ...
     </em></span></p></blockquote></div><p>
  &#26368;&#21021;&#12398;&#12497;&#12521;&#12464;&#12521;&#12501;&#12391;&#12399;&#12289;&#12405;&#12383;&#12388;&#12398;&#37325;&#35201;&#12394;&#24773;&#22577;
  (&#12522;&#12522;&#12540;&#12473;&#20104;&#23450;&#26085;&#12392;&#26032;&#27231;&#33021;) &#12434;&#31777;&#28500;&#12395;&#35500;&#26126;&#12375;&#12289;
  &#12373;&#12425;&#12395;&#35443;&#32048;&#12394;&#24773;&#22577;&#12434;&#30693;&#12427;&#12383;&#12417;&#12398; URL &#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#37096;&#20998;&#12384;&#12369;&#12375;&#12363;&#35501;&#12414;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#20869;&#23481;&#12364;&#20253;&#12431;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12523;&#12398;&#27531;&#12426;&#12398;&#37096;&#20998;&#12399;&#12289;&#20182;&#12395;&#20253;&#12431;&#12427;&#38555;&#12395;&#12399;&#28961;&#35222;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#20013;&#12395;&#12399;&#12513;&#12540;&#12523;&#20840;&#20307;&#12408;&#12522;&#12531;&#12463;&#12377;&#12427;&#20154;&#12418;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399;&#12513;&#12540;&#12523;&#12398;&#19968;&#37096;&#12434;&#24341;&#29992;&#12377;&#12427;&#12398;&#12415;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12391;&#12354;&#12427;&#20197;&#19978;&#12289;&#19968;&#37096;&#12434;&#24341;&#29992;&#12377;&#12427;&#20154;&#12364;&#24341;&#29992;&#12375;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#24515;&#12364;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12358;&#12414;&#12367;&#24341;&#29992;&#12375;&#12390;&#12418;&#12425;&#12360;&#12400;&#12289;&#24773;&#22577;&#12434;&#24195;&#12367;&#20253;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;"><div class="titlepage"><div><div><h3 class="title"><a name="security"></a>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;</h3></div></div></div><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#20966;&#29702;&#12398;&#12375;&#12363;&#12383;&#12399;&#12289;
  &#20182;&#12398;&#12496;&#12464;&#22577;&#21578;&#12398;&#22580;&#21512;&#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#36890;&#24120;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12391;&#12399;&#12289;
  &#29289;&#20107;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12375;&#12390;&#35504;&#12395;&#12391;&#12418;&#35211;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#24403;&#12383;&#12426;&#21069;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#19968;&#33324;&#30340;&#12394;&#12496;&#12464;&#22577;&#21578;&#12398;&#23550;&#24540;&#29366;&#27841;&#12399;&#12289;&#33288;&#21619;&#12398;&#12354;&#12427;&#20154;&#12394;&#12425;&#35504;&#12395;&#12391;&#12418;&#35211;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12356;&#12388;&#12496;&#12464;&#12364;&#22577;&#21578;&#12373;&#12428;&#12383;&#12398;&#12363;&#12289;&#12393;&#12398;&#12424;&#12358;&#12394;&#35696;&#35542;&#12364;&#12394;&#12373;&#12428;&#12383;&#12398;&#12363;&#12289;
  &#12381;&#12375;&#12390;&#26368;&#32066;&#30340;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#20462;&#27491;&#12373;&#12428;&#12383;&#12398;&#12363;&#12290;
  &#12371;&#12428;&#12425;&#12399;&#12377;&#12409;&#12390;&#12289;&#30693;&#12426;&#12383;&#12369;&#12428;&#12400;&#35504;&#12391;&#12418;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
</p><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#12496;&#12464;&#12398;&#22580;&#21512;&#12399;&#12289;&#12371;&#12428;&#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#12496;&#12464;&#12364;&#21407;&#22240;&#12391;&#12518;&#12540;&#12470;&#12540;&#12398;&#12487;&#12540;&#12479;&#12364;&#28431;&#27945;&#12375;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
  &#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12434;&#30772;&#22730;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#21839;&#38988;&#12434;&#12458;&#12540;&#12503;&#12531;&#12394;&#22580;&#12391;&#35696;&#35542;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#21839;&#38988;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#20840;&#19990;&#30028;&#12395;&#30693;&#12425;&#12375;&#12417;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#24403;&#28982;&#12381;&#12398;&#20013;&#12395;&#12399;&#12289;&#12381;&#12398;&#12496;&#12464;&#12434;&#24746;&#29992;&#12375;&#12424;&#12358;&#12392;&#12356;&#12358;&#20154;&#12383;&#12385;&#12418;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21336;&#12395;&#28129;&#12293;&#12392;&#12496;&#12464;&#12434;&#20462;&#27491;&#12375;&#12390;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12384;&#12369;&#12391;&#12418;&#12289;&#12496;&#12464;&#12398;&#23384;&#22312;&#12434;&#19990;&#12395;&#12373;&#12425;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;
  (&#25915;&#25731;&#32773;&#12398;&#20013;&#12395;&#12399;&#12289;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12483;&#12488;&#12525;&#12464;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#22793;&#26356;&#20869;&#23481;&#12434;&#35519;&#12409;&#12428;&#12400;&#12289;&#22793;&#26356;&#21069;&#12398;&#12467;&#12540;&#12489;&#12395;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#21839;&#38988;&#12364;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
  &#12371;&#12398;&#38283;&#25918;&#24615;&#12392;&#31192;&#23494;&#20027;&#32681;&#12398;&#23550;&#31435;&#12395;&#25240;&#12426;&#21512;&#12356;&#12434;&#12388;&#12369;&#12427;&#12383;&#12417;&#12395;
  &#21516;&#12376;&#12424;&#12358;&#12394;&#26041;&#37341;&#12434;&#12392;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12381;&#12398;&#26041;&#37341;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
      &#20462;&#27491;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#12399;&#12496;&#12464;&#12398;&#12371;&#12392;&#12434;&#21475;&#22806;&#12375;&#12394;&#12356;&#12290;
      &#12381;&#12375;&#12390;&#12289;&#12496;&#12464;&#12364;&#12354;&#12387;&#12383;&#12371;&#12392;&#12434;&#12450;&#12490;&#12454;&#12531;&#12473;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20844;&#38283;&#12377;&#12427;&#12290;
    </p></li><li class="listitem"><p>
      &#20462;&#27491;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#21487;&#33021;&#12394;&#38480;&#12426;&#36805;&#36895;&#12395;&#25552;&#20379;&#12377;&#12427;&#12290;
      &#12381;&#12398;&#12496;&#12464;&#12364;&#22806;&#37096;&#12363;&#12425;&#12398;&#22577;&#21578;&#12391;&#30330;&#35226;&#12375;&#12383;&#12418;&#12398;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#29305;&#12395;&#24613;&#12368;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22806;&#37096;&#12398;&#20154;&#38291;&#12398;&#20013;&#12395;&#23569;&#12394;&#12367;&#12392;&#12418;
      1 &#20154;&#12399;&#12381;&#12398;&#33030;&#24369;&#24615;&#12434;&#31361;&#12367;&#25915;&#25731;&#12364;&#12391;&#12365;&#12427;&#20154;&#12364;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12399;&#12387;&#12365;&#12426;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    </p></li></ol></div><p>
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12371;&#12398;&#35215;&#21063;&#12399;&#27161;&#28310;&#21270;&#12375;&#12383;&#25163;&#38918;&#12392;&#12375;&#12390;&#12414;&#12392;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#25163;&#38918;&#12395;&#12388;&#12356;&#12390;&#12289;&#20197;&#19979;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#35299;&#35500;&#12375;&#12414;&#12377;&#12290;
</p><div class="sect3" title="&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="security-receiving"></a>&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#12427;</h4></div></div></div><p>
  &#24403;&#28982;&#12398;&#12371;&#12392;&#12394;&#12364;&#12425;&#12289;&#21508;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12398;&#22577;&#21578;&#12434;&#19968;&#33324;&#12363;&#12425;&#21463;&#12369;&#20184;&#12369;&#12427;&#12383;&#12417;&#12398;&#31379;&#21475;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12399;&#36890;&#24120;&#12398;&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#20184;&#12369;&#12427;&#12450;&#12489;&#12524;&#12473;&#12392;&#19968;&#32210;&#12395;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#36890;&#24120;&#12398;&#12496;&#12464;&#12399;&#35504;&#12395;&#12391;&#12418;&#35211;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12371;&#12391;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#38306;&#36899;&#12398;&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#21462;&#12427;&#12383;&#12417;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#21029;&#36884;&#29992;&#24847;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#19968;&#33324;&#12395;&#20844;&#38283;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#21442;&#21152;&#36039;&#26684;&#12399;&#21427;&#12375;&#12367;&#21046;&#38480;&#12377;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38263;&#12367;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12390;
  &#20449;&#38972;&#12391;&#12365;&#12427;&#38283;&#30330;&#32773;&#12383;&#12385;&#12398;&#12415;&#12434;&#12513;&#12531;&#12496;&#12540;&#12395;&#21152;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375; "&#20449;&#38972;&#12391;&#12365;&#12427;" &#12398;&#20855;&#20307;&#30340;&#12394;&#23450;&#32681;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;&#12383;&#12392;&#12360;&#12400;
  "&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#24471;&#12390;&#12363;&#12425; 2 &#24180;&#20197;&#19978;&#32076;&#36942;&#12375;&#12390;&#12356;&#12427;"
  &#12394;&#12393;&#12392;&#12356;&#12387;&#12383;&#26465;&#20214;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#21442;&#21152;&#36039;&#26684;&#12395;&#38306;&#12375;&#12390; "&#12360;&#12371;&#12402;&#12356;&#12365;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;?"
  &#12392;&#12356;&#12387;&#12383;&#25209;&#21028;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#12513;&#12531;&#12496;&#12540;&#12364;&#12289;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12395;&#23550;&#24540;&#12377;&#12427;&#12513;&#12531;&#12496;&#12540;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#38306;&#36899;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#12473;&#12497;&#12512;&#23550;&#31574;&#12420;&#12514;&#12487;&#12524;&#12540;&#12488;&#12399;&#34892;&#12431;&#12394;&#12356;&#12398;&#12364;&#29702;&#24819;&#12391;&#12377;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#37325;&#35201;&#12394;&#22577;&#21578;&#12364;&#12473;&#12497;&#12512;&#25201;&#12356;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12392;&#22256;&#12426;&#12414;&#12377;&#12375;&#12289;
  &#12383;&#12414;&#12383;&#12414;&#12381;&#12398;&#36913;&#26411;&#12395;&#12377;&#12409;&#12390;&#12398;&#12514;&#12487;&#12524;&#12540;&#12479;&#12364;&#12513;&#12540;&#12523;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12394;&#12363;&#12387;&#12383;&#12394;&#12393;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;
  &#37325;&#35201;&#12394;&#22577;&#21578;&#12395;&#27671;&#12389;&#12367;&#12398;&#12364;&#36933;&#12428;&#12427;&#12392;&#12356;&#12358;&#12398;&#12418;&#22256;&#12426;&#12414;&#12377;&#12290;
  &#20309;&#12425;&#12363;&#12398;&#12473;&#12497;&#12512;&#23550;&#31574;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12377;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#21487;&#33021;&#12394;&#38480;&#12426;&#32233;&#12420;&#12363;&#30446;&#12398;&#35373;&#23450;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#37325;&#35201;&#12394;&#22577;&#21578;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12375;&#12390;&#12375;&#12414;&#12358;&#12367;&#12425;&#12356;&#12394;&#12425;&#12289;
  &#22810;&#23569;&#12398;&#12473;&#12497;&#12512;&#12364;&#28151;&#12374;&#12387;&#12390;&#12375;&#12414;&#12358;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#12414;&#12375;&#12391;&#12377;&#12290;
  &#20316;&#25104;&#12375;&#12383;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#12358;&#12414;&#12367;&#27963;&#29992;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
  &#12381;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#21608;&#30693;&#12373;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#12514;&#12487;&#12524;&#12540;&#12488;&#12373;&#12428;&#12390;&#12362;&#12425;&#12378;&#12289;
  &#12414;&#12383;&#12473;&#12497;&#12512;&#23550;&#31574;&#12418;&#29976;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;
  &#12381;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#23459;&#20253;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;&#12450;&#12489;&#12524;&#12473;&#12434;&#38560;&#12377;&#12383;&#12417;&#12395;&#20309;&#12425;&#12363;&#12398;&#32048;&#24037;&#12364;&#24517;&#38920;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#35443;&#32048;&#12399; <span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12398;</span>
  <a class="xref" href="mailing-lists.html#address-hiding" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;">&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#24184;&#12356;&#12395;&#12418;&#12289;&#12450;&#12489;&#12524;&#12473;&#12434;&#35501;&#12415;&#12395;&#12367;&#12356;&#12418;&#12398;&#12395;&#12394;&#12393;&#12375;&#12394;&#12367;&#12390;&#12418;&#12450;&#12489;&#12524;&#12473;&#12434;&#38560;&#12377;&#12371;&#12392;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290;
  <a class="ulink" href="http://subversion.tigris.org/security.html" target="_top">http://subversion.tigris.org/security.html</a> &#12434;&#12372;&#35239;&#12395;&#12394;&#12387;&#12383;&#12358;&#12360;&#12391;&#12289;
  &#12381;&#12398;&#12506;&#12540;&#12472;&#12398; HTML &#12477;&#12540;&#12473;&#12434;&#30906;&#35469;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect3" title="&#22823;&#33267;&#24613;&#12381;&#12428;&#12434;&#20462;&#27491;&#12377;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="security-finding-a-fix"></a>&#22823;&#33267;&#24613;&#12381;&#12428;&#12434;&#20462;&#27491;&#12377;&#12427;</h4></div></div></div><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#22577;&#21578;&#12364;&#26469;&#12383;&#12425;&#12289;&#27425;&#12399;&#20309;&#12434;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;?
  &#12414;&#12378;&#26368;&#21021;&#12395;&#12377;&#12409;&#12365;&#12371;&#12392;&#12399;&#12289;&#12381;&#12398;&#21839;&#38988;&#12398;&#37325;&#22823;&#24230; (severity)
  &#12392;&#32202;&#24613;&#24615; (urgency) &#12434;&#35413;&#20385;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
      &#12381;&#12398;&#33030;&#24369;&#24615;&#12399;&#12393;&#12428;&#12367;&#12425;&#12356;&#28145;&#21051;&#12394;&#12418;&#12398;&#12391;&#12375;&#12423;&#12358;?
      &#24746;&#24847;&#12398;&#12354;&#12427;&#25915;&#25731;&#32773;&#12364;&#12289;
      &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12434;&#20055;&#12387;&#21462;&#12387;&#12390;&#12375;&#12414;&#12360;&#12427;&#12411;&#12393;&#12398;&#12418;&#12398;&#12391;&#12377;&#12363;?
      &#12381;&#12428;&#12392;&#12418;&#12289;&#12383;&#12384;&#21336;&#12395;&#20309;&#12425;&#12363;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#12364;&#28431;&#27945;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#12418;&#12398;&#12391;&#12377;&#12363;?
    </p></li><li class="listitem"><p>
      &#12381;&#12398;&#33030;&#24369;&#24615;&#12434;&#31361;&#12367;&#25915;&#25731;&#12398;&#38627;&#26131;&#24230;&#12399;&#12393;&#12398;&#31243;&#24230;&#12391;&#12377;&#12363;?
      &#12473;&#12463;&#12522;&#12503;&#12488;&#12434;&#20351;&#12387;&#12390;&#35504;&#12391;&#12418;&#25915;&#25731;&#12391;&#12365;&#12427;&#31243;&#24230;&#12398;&#12418;&#12398;?
      &#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#22580;&#12398;&#29366;&#27841;&#12434;&#29087;&#30693;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;
      &#39640;&#24230;&#12395;&#38957;&#12434;&#20685;&#12363;&#12379;&#12390;&#12418;&#12289;&#12372;&#12367;&#12414;&#12428;&#12395;&#12375;&#12363;&#25104;&#21151;&#12375;&#12394;&#12356;&#12418;&#12398;?
    </p></li><li class="listitem"><p>
      <span class="emphasis"><em>&#35504;&#12364;</em></span> &#12381;&#12398;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12363;?
      &#12371;&#12398;&#21839;&#12356;&#12408;&#12398;&#31572;&#12360;&#12395;&#12424;&#12387;&#12390;&#33030;&#24369;&#24615;&#12381;&#12398;&#12418;&#12398;&#12398;&#24615;&#36074;&#12364;&#22793;&#12431;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
      &#20182;&#12395;&#12393;&#12428;&#12367;&#12425;&#12356;&#12398;&#20154;&#12364;&#12381;&#12398;&#21839;&#38988;&#12395;&#27671;&#12389;&#12356;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12434;&#25512;&#28204;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
      &#12418;&#12375;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#33258;&#36523;&#12363;&#12425;&#22577;&#21578;&#12373;&#12428;&#12383;&#12398;&#12394;&#12425;&#12289;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;
      (&#26412;&#24403;&#12395;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;) &#23433;&#24515;&#12391;&#12365;&#12414;&#12377;&#12290;
      &#12362;&#12381;&#12425;&#12367;&#12289;&#12381;&#12398;&#22577;&#21578;&#32773;&#12399;&#20182;&#20154;&#12395;&#12381;&#12398;&#21839;&#38988;&#12434;&#28431;&#12425;&#12375;&#12390;&#12356;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
      &#19968;&#26041;&#12289;&#12418;&#12375; <code class="literal">anonymous14@globalhackerz.net</code>
      &#12392;&#12363;&#12356;&#12358;&#12450;&#12489;&#12524;&#12473;&#12363;&#12425;&#12398;&#12513;&#12540;&#12523;&#12391;&#22577;&#21578;&#12434;&#21463;&#12369;&#12383;&#12398;&#12394;&#12425;&#12289;
      &#19968;&#21051;&#12418;&#26089;&#12367;&#23550;&#24540;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#12354;&#12394;&#12383;&#12395;&#12381;&#12398;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12390;&#12367;&#12428;&#12383;&#20154;&#12399;&#12289;
      &#12354;&#12394;&#12383;&#20197;&#22806;&#12398;&#20154;&#12395;&#12418;&#12381;&#12398;&#24773;&#22577;&#12434;&#28431;&#12425;&#12375;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
      &#12354;&#12427;&#12356;&#12399;&#22577;&#21578;&#12434;&#21463;&#12369;&#12383;&#12392;&#12365;&#12395;&#12399;&#26082;&#12395;&#12381;&#12398;&#33030;&#24369;&#24615;&#12434;&#31361;&#12356;&#12383;&#25915;&#25731;&#12434;&#22987;&#12417;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    </p></li></ol></div><p>
  &#12371;&#12371;&#12391;&#32771;&#12360;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;&#12354;&#12367;&#12414;&#12391;&#12418;
  <span class="emphasis"><em>&#32202;&#24613; (urgent)</em></span> &#12392;
  <span class="emphasis"><em>&#36229;&#32202;&#24613; (extremely urgent</em></span>)
  &#12398;&#12393;&#12385;&#12425;&#12363;&#12392;&#12356;&#12358;&#12524;&#12505;&#12523;&#12398;&#35441;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#20170;&#22238;&#12398;&#22577;&#21578;&#12364;&#26082;&#30693;&#12398;&#20449;&#38972;&#12391;&#12365;&#12427;&#12392;&#12371;&#12429;&#12363;&#12425;&#12398;&#12418;&#12398;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12428;&#12424;&#12426;&#12378;&#12387;&#12392;&#21069;&#12395;&#20182;&#12398;&#20154;&#12364;&#21516;&#12376;&#21839;&#38988;&#12434;&#30330;&#35211;&#12375;&#12390;&#12356;&#12427;&#12364;
  &#12383;&#12384;&#22577;&#21578;&#12375;&#12390;&#12356;&#12394;&#12356;&#12384;&#12369;&#12394;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#32202;&#24613;&#24615;&#12364;&#20302;&#12356;&#12392;&#12356;&#12360;&#12427;&#12398;&#12399;&#12289;
  &#12381;&#12398;&#12496;&#12464;&#12364;&#26412;&#36074;&#30340;&#12395;&#28145;&#21051;&#12394;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21839;&#38988;&#12434;&#24341;&#12365;&#36215;&#12371;&#12373;&#12394;&#12356;&#12392;&#12356;&#12360;&#12427;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;
</p><p>
  &#12392;&#12371;&#12429;&#12391;&#12289;&#12373;&#12365;&#12411;&#12393;&#12398; "<code class="literal">anonymous14@globalhackerz.net</code>"
  &#12398;&#20363;&#12399;&#12289;&#27770;&#12375;&#12390;&#20887;&#35527;&#12391;&#35328;&#12387;&#12383;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12289;&#12371;&#12398;&#12424;&#12358;&#12395;&#12393;&#12371;&#12398;&#35504;&#12384;&#12363;&#12431;&#12363;&#12425;&#12394;&#12356;&#12424;&#12358;&#12394;&#30456;&#25163;&#12363;&#12425;&#12496;&#12464;&#12398;&#22577;&#21578;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#24471;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#33258;&#20998;&#12398;&#36523;&#20803;&#12434;&#26126;&#12363;&#12377;&#12371;&#12392;&#12418;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#21619;&#26041;&#12394;&#12398;&#12363;&#25973;&#12394;&#12398;&#12363;&#12373;&#12360;&#12399;&#12387;&#12365;&#12426;&#12373;&#12379;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12391;&#12418;&#12381;&#12435;&#12394;&#12398;&#38306;&#20418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12354;&#12394;&#12383;&#12395;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12507;&#12540;&#12523;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#21521;&#12371;&#12358;&#12399;&#12354;&#12394;&#12383;&#12395;&#23550;&#12375;&#12390;&#12402;&#12392;&#12388;&#36024;&#12375;&#12434;&#20316;&#12387;&#12383;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#12289;&#35488;&#24847;&#12434;&#25345;&#12387;&#12390;&#23550;&#24540;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#22577;&#21578;&#12375;&#12390;&#12367;&#12428;&#12383;&#12371;&#12392;&#12395;&#23550;&#12375;&#12390;&#24863;&#35613;&#12375;&#12289;
  &#20462;&#27491;&#29256;&#12434;&#20844;&#24335;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#20104;&#23450;&#26085;&#12434;&#24444;&#12425;&#12395;&#20253;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#26178;&#12395;&#12399; <span class="emphasis"><em>&#22577;&#21578;&#32773;&#20596;&#12363;&#12425;</em></span> &#26085;&#26178;&#12434;&#25351;&#23450;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12300;&#12496;&#12464;&#12364;&#20462;&#27491;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
  &#9675;&#26376;&#9675;&#26085;&#12395;&#12394;&#12428;&#12400;&#12371;&#12398;&#21839;&#38988;&#12434;&#20844;&#34920;&#12377;&#12427;&#12301;&#12394;&#12393;&#12393;&#12375;&#12390;&#26263;&#40665;&#12398;&#33029;&#12375;&#12434;&#12363;&#12369;&#12390;&#12367;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#21336;&#12394;&#12427;&#24369;&#12356;&#29289;&#12356;&#12376;&#12417;&#12395;&#24863;&#12376;&#12425;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12362;&#12381;&#12425;&#12367;&#12381;&#12398;&#22577;&#21578;&#32773;&#12364;&#36942;&#21435;&#12395;&#32076;&#39443;&#12375;&#12383;&#12356;&#12420;&#12394;&#24605;&#12356;&#20986;
  (&#12379;&#12387;&#12363;&#12367;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21839;&#38988;&#12434;&#22577;&#21578;&#12375;&#12390;&#12420;&#12387;&#12383;&#12398;&#12395;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20316;&#32773;&#12395;&#12414;&#12392;&#12418;&#12395;&#21462;&#12426;&#21512;&#12387;&#12390;&#12418;&#12425;&#12360;&#12394;&#12363;&#12387;&#12383;&#12394;&#12393;)
  &#12395;&#22522;&#12389;&#12367;&#20808;&#21046;&#25915;&#25731;&#12392;&#32771;&#12360;&#12383;&#12411;&#12358;&#12364;&#36969;&#20999;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;&#22577;&#21578;&#32773;&#12434;&#12356;&#12385;&#12356;&#12385;&#24594;&#12425;&#12379;&#12390;&#12356;&#12427;&#20313;&#35029;&#12394;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#12418;&#12375;&#12381;&#12398;&#12496;&#12464;&#12364;&#28145;&#21051;&#12394;&#12418;&#12398;&#12394;&#12398;&#12384;&#12392;&#12375;&#12383;&#12425;&#12289;
  &#12381;&#12398;&#22577;&#21578;&#32773;&#12399;&#12518;&#12540;&#12470;&#12540;&#12395;&#21839;&#38988;&#12434;&#24341;&#12365;&#36215;&#12371;&#12373;&#12379;&#12427;&#26041;&#27861;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#24444;&#12398;&#27231;&#23244;&#12434;&#25613;&#12397;&#12394;&#12356;&#12424;&#12358;&#19969;&#37325;&#12395;&#25201;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12365;&#12387;&#12392;&#30456;&#25163;&#12418;&#12371;&#12385;&#12425;&#12434;&#23562;&#37325;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12398;&#22577;&#21578;&#32773;&#12392;&#12375;&#12390;&#12411;&#12363;&#12395;&#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12289;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#23554;&#38272;&#23478;&#12391;&#12377;&#12290;&#24444;&#12425;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12540;&#12489;&#12434;&#30435;&#26619;&#12377;&#12427;&#12398;&#12434;&#20181;&#20107;&#12395;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#33030;&#24369;&#24615;&#12395;&#12388;&#12356;&#12390;&#12398;&#26368;&#26032;&#24773;&#22577;&#12434;&#36861;&#12356;&#12363;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#25163;&#12398;&#20154;&#12383;&#12385;&#12399;&#12289;&#12496;&#12464;&#12434;&#22577;&#21578;&#12377;&#12427;&#20596;&#12384;&#12369;&#12391;&#12394;&#12367;&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#21462;&#12427;&#20596;&#12392;&#12375;&#12390;&#12398;&#32076;&#39443;&#12418;&#35914;&#23500;&#12391;&#12377;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12393;&#12398;&#12513;&#12531;&#12496;&#12540;&#12424;&#12426;&#12418;&#32076;&#39443;&#12434;&#31309;&#12435;&#12391;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#24444;&#12425;&#12398;&#29305;&#24500;&#12392;&#12375;&#12390;&#12399;&#12289;&#26399;&#26085;&#12434;&#25351;&#23450;&#12375;&#12390;&#12381;&#12398;&#26085;&#12414;&#12391;&#12398;&#23550;&#24540;&#12434;&#36843;&#12426;&#12289;
  &#26399;&#26085;&#12364;&#12367;&#12428;&#12400;&#12496;&#12464;&#12434;&#19968;&#33324;&#12395;&#20844;&#34920;&#12377;&#12427;&#12392;&#12356;&#12358;&#12420;&#12426;&#26041;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#20132;&#28169;&#27425;&#31532;&#12391;&#26399;&#26085;&#12434;&#24341;&#12365;&#24310;&#12400;&#12377;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12428;&#12399;&#30456;&#25163;&#12395;&#12424;&#12426;&#12414;&#12377;&#12290;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#23554;&#38272;&#23478;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#22577;&#21578;&#20808;&#12395;&#12414;&#12392;&#12418;&#12395;&#21462;&#12426;&#21512;&#12387;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12398;
  &#21807;&#19968;&#21177;&#26524;&#30340;&#12394;&#26041;&#27861;&#12364;&#26399;&#26085;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12364;&#26399;&#26085;&#12434;&#25351;&#23450;&#12375;&#12390;&#12365;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#12381;&#12428;&#12434;&#22833;&#31036;&#12384;&#12392;&#12399;&#24605;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12428;&#12394;&#12426;&#12398;&#29702;&#30001;&#12364;&#12354;&#12387;&#12390;&#32154;&#12356;&#12390;&#12356;&#12427;&#20253;&#32113;&#12394;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
</p><p>
  &#37325;&#22823;&#24230;&#12392;&#32202;&#24613;&#24615;&#12434;&#21028;&#23450;&#12375;&#32066;&#12360;&#12383;&#12425;&#12289;&#23455;&#38555;&#12398;&#20316;&#26989;&#12395;&#21462;&#12426;&#25499;&#12363;&#12426;&#22987;&#12417;&#12414;&#12377;&#12290;
  &#20462;&#27491;&#12434;&#12456;&#12524;&#12460;&#12531;&#12488;&#12395;&#34892;&#12358;&#12363;&#12289;&#12381;&#12428;&#12392;&#12418;&#12392;&#12395;&#12363;&#12367;&#12377;&#12400;&#12420;&#12367;&#20462;&#27491;&#12377;&#12427;&#12398;&#12363;&#12398;&#12488;&#12524;&#12540;&#12489;&#12458;&#12501;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12392;&#12365;&#12398;&#12383;&#12417;&#12395;&#12289;&#12414;&#12378;&#26368;&#21021;&#12395;&#32202;&#24613;&#24615;&#12434;&#21028;&#23450;&#12375;&#12390;&#12362;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#20462;&#27491;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12399;&#12289;&#24403;&#28982;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#20869;&#12391;&#12398;&#12415;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#21839;&#38988;&#12398;&#22577;&#21578;&#32773;&#12364;&#12418;&#12375;&#35696;&#35542;&#12408;&#12398;&#21442;&#21152;&#12434;&#24076;&#26395;&#12377;&#12427;&#12394;&#12425;&#12289;&#22577;&#21578;&#32773;&#12418;&#12381;&#12398;&#35696;&#35542;&#12395;&#21442;&#21152;&#12373;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#25216;&#34899;&#30340;&#12394;&#29702;&#30001;&#12391;&#12381;&#12428;&#20197;&#22806;&#12398;&#38283;&#30330;&#32773;&#12364;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#20462;&#27491;&#20869;&#23481;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#19968;&#33324;&#12395;&#20844;&#38283;&#12377;&#12427;&#12414;&#12391;&#12399;&#12497;&#12483;&#12481;&#24418;&#24335;&#12391;&#31649;&#29702;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#20206;&#12395;&#12381;&#12428;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;&#12289;
  &#12383;&#12392;&#12360;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36969;&#24403;&#12395;&#21462;&#12426;&#32341;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;
  &#35211;&#12427;&#20154;&#12364;&#35211;&#12428;&#12400;&#12381;&#12398;&#22793;&#26356;&#12398;&#24847;&#21619;&#12377;&#12427;&#12392;&#12371;&#12429;&#12434;&#24863;&#12389;&#12363;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12393;&#12371;&#12398;&#35504;&#12364;&#12393;&#12358;&#12356;&#12358;&#30446;&#30340;&#12391;&#12354;&#12394;&#12383;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12356;&#12427;&#12363;&#12394;&#12435;&#12390;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#36865;&#20449;&#12434;&#12420;&#12417;&#12383;&#12392;&#12375;&#12390;&#12418;&#28961;&#24847;&#21619;&#12391;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#36865;&#20449;&#12364;&#31361;&#28982;&#27490;&#12414;&#12387;&#12383;&#12392;&#12356;&#12358;&#26178;&#28857;&#12391;
  &#12300;&#12394;&#12395;&#12363;&#24618;&#12375;&#12356;&#12301;&#12392;&#24605;&#12431;&#12428;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#26377;&#28961;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
  &#12381;&#12398;&#20869;&#23481;&#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12487;&#12540;&#12479;&#12392;&#12375;&#12390;&#27531;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#20462;&#27491;&#12398;&#38283;&#30330;&#12399;&#12377;&#12409;&#12390;&#12497;&#12483;&#12481;&#24418;&#24335;&#12391;&#34892;&#12356;&#12289;&#12497;&#12483;&#12481;&#12399;&#38548;&#38626;&#12373;&#12428;&#12383;&#22580;&#25152;&#12391;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12496;&#12464;&#12398;&#23550;&#24540;&#12434;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12384;&#12369;&#12364;&#30693;&#12387;&#12390;&#12356;&#12427;&#20491;&#21029;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12394;&#12393;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;
  (Arch &#12420; SVK &#12392;&#12356;&#12387;&#12383;&#20013;&#22830;&#31649;&#29702;&#22411;&#12391;&#12399;&#12394;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289;
  &#23436;&#20840;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12373;&#12428;&#12383;&#29872;&#22659;&#12391;&#20316;&#26989;&#12434;&#36914;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12496;&#12464;&#12408;&#12398;&#23550;&#24540;&#20013;&#12399;&#12289;&#22806;&#37096;&#12363;&#12425;&#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12369;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;)&#12290;
</p></div><div class="sect3" title="CAN/CVE &#30058;&#21495;"><div class="titlepage"><div><div><h4 class="title"><a name="security-cve"></a>CAN/CVE &#30058;&#21495;</h4></div></div></div><p>
  &#12371;&#12428;&#12414;&#12391;&#12395;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#21839;&#38988;&#12398;&#20013;&#12391; <em class="firstterm">CAN &#30058;&#21495;</em>
  &#12420; <em class="firstterm">CVE &#30058;&#21495;</em> &#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12434;&#12415;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#20154;&#12364;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400; "CAN-2004-0397" &#12354;&#12427;&#12356;&#12399; "CVE-2002-0092"
  &#12392;&#12356;&#12387;&#12383;&#24418;&#24335;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12398;&#30058;&#21495;&#12399;&#12289;&#12393;&#12385;&#12425;&#12418;&#21516;&#12376;&#22411;&#12398;&#20869;&#23481;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;
  <a class="ulink" href="http://cve.mitre.org/" target="_top">http://cve.mitre.org/</a> &#12391;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12427;
  "Common Vulnerabilities and Exposures"
  &#12522;&#12473;&#12488;&#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12522;&#12473;&#12488;&#12398;&#30446;&#30340;&#12399;&#12289;
  &#26082;&#30693;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12398;&#20849;&#36890;&#12398;&#21628;&#12403;&#21517;&#12434;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#20491;&#12293;&#12398;&#21839;&#38988;&#12434;&#12399;&#12387;&#12365;&#12426;&#21306;&#21029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#35443;&#32048;&#12394;&#24773;&#22577;&#12434;&#25506;&#12377;&#12383;&#12417;&#12398;&#20013;&#22830;&#24195;&#22580;&#12392;&#12375;&#12390;&#12398;&#20685;&#12365;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  "CAN" &#30058;&#21495;&#12392; "CVE" &#30058;&#21495;&#12398;&#21807;&#19968;&#12398;&#36949;&#12356;&#12399;&#12289;
  &#21069;&#32773;&#12399;&#12414;&#12384;&#27491;&#24335;&#12395;&#35469;&#23450;&#12373;&#12428;&#12427;&#21069;&#12398;&#29366;&#24907;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  CVE Editorial Board &#12395;&#12424;&#12387;&#12390;&#35469;&#23450;&#12373;&#12428;&#12390;&#20844;&#24335;&#12522;&#12473;&#12488;&#12395;&#30331;&#22580;&#12375;&#12383;&#12418;&#12398;&#12364;&#24460;&#32773;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12393;&#12385;&#12425;&#12398;&#24773;&#22577;&#12418;&#19968;&#33324;&#12395;&#20844;&#38283;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#35469;&#23450;&#12398;&#21069;&#24460;&#12391;&#30058;&#21495;&#33258;&#20307;&#12399;&#22793;&#12431;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21336;&#12395;&#12289;&#30058;&#21495;&#12398;&#21069;&#12398; "CAN" &#12364; "CVE" &#12395;&#32622;&#12365;&#25563;&#12431;&#12427;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  CAN/CVE &#12398;&#12456;&#12531;&#12488;&#12522;&#33258;&#20307;&#12395;&#12399;&#12289;
  &#12496;&#12464;&#12398;&#35443;&#32048;&#12394;&#35500;&#26126;&#12420;&#23550;&#20966;&#26041;&#27861;&#12394;&#12393;&#12399;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;&#12381;&#12398;&#12496;&#12464;&#12398;&#27010;&#35201;&#35500;&#26126;&#12392;&#22806;&#37096;&#12522;&#12477;&#12540;&#12473;
  (&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12394;&#12393;) &#12408;&#12398;&#12522;&#12531;&#12463;&#12434;&#29992;&#24847;&#12375;&#12289;
  &#35443;&#32048;&#12394;&#24773;&#22577;&#12364;&#30693;&#12426;&#12383;&#12356;&#20154;&#12399;&#12381;&#12385;&#12425;&#12434;&#21442;&#29031;&#12377;&#12428;&#12400;&#12356;&#12356;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  <a class="ulink" href="http://cve.mitre.org/" target="_top">http://cve.mitre.org/</a> &#12398;&#30495;&#12398;&#30446;&#30340;&#12399;&#12289;
  &#12365;&#12385;&#12435;&#12392;&#25972;&#29702;&#25972;&#38931;&#12373;&#12428;&#12383;&#22580;&#25152;&#12434;&#29992;&#24847;&#12375;&#12390;&#12377;&#12409;&#12390;&#12398;&#33030;&#24369;&#24615;&#12395;&#21517;&#21069;&#12434;&#12388;&#12369;&#12289;
  &#35443;&#32048;&#12394;&#12487;&#12540;&#12479;&#12434;&#24471;&#12427;&#12383;&#12417;&#12398;&#36947;&#31563;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12456;&#12531;&#12488;&#12522;&#12398;&#20363;&#12392;&#12375;&#12390;
  <a class="ulink" href="http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092" target="_top">http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092</a>
  &#12434;&#35211;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12381;&#12398;&#35352;&#36848;&#20869;&#23481;&#12399;&#38750;&#24120;&#12395;&#31777;&#28500;&#12394;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#12394;&#12395;&#12420;&#12425;&#24618;&#12375;&#12370;&#12394;&#30053;&#35486;&#12434;&#12388;&#12369;&#12383;&#12522;&#12531;&#12463;&#12364;&#12354;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#30053;&#35486;&#12398;&#24847;&#21619;&#12395;&#12388;&#12356;&#12390;&#12399; <a class="ulink" href="http://cve.mitre.org/data/refs/refkey.html" target="_top">http://cve.mitre.org/data/refs/refkey.html</a>
  &#12391;&#12372;&#30906;&#35469;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
  &#12354;&#12394;&#12383;&#12364;&#23550;&#24540;&#12375;&#12383;&#33030;&#24369;&#24615;&#12364; CVE &#12398;&#26465;&#20214;&#12434;&#28288;&#12383;&#12377;&#12424;&#12358;&#12394;&#12425;&#12289;CAN &#30058;&#21495;&#12398;&#21462;&#24471;&#12434;&#26908;&#35342;&#12377;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#21462;&#24471;&#26041;&#27861;&#12399;&#12289;&#24847;&#22259;&#30340;&#12395;&#38627;&#12375;&#12367;&#12375;&#12390;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#22522;&#26412;&#30340;&#12395;&#12289;&#12414;&#12378;&#12354;&#12394;&#12383;&#12364;&#35504;&#12363;&#12398;&#30693;&#12426;&#21512;&#12356;&#12391;&#12354;&#12427;&#12363;&#12289;&#35504;&#12363;&#12398;&#30693;&#12426;&#21512;&#12356;&#12398;&#30693;&#12426;&#21512;&#12356;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12394;&#12435;&#12384;&#12363;&#12424;&#12367;&#12431;&#12363;&#12425;&#12394;&#12356;&#35328;&#12356;&#26041;&#12391;&#12377;&#12364;&#12289;&#35201;&#12399;&#12371;&#12358;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#33030;&#24369;&#24615;&#12391;&#12418;&#12394;&#12356;&#20869;&#23481;&#12420;&#20013;&#36523;&#12398;&#12394;&#12356;&#12424;&#12358;&#12394;&#22577;&#21578;&#12395;&#23550;&#24540;&#12377;&#12427;&#12398;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12289;
  CVE Editorial Board &#12399;&#26082;&#30693;&#12398;&#20449;&#38972;&#12391;&#12365;&#12427;&#24773;&#22577;&#28304;&#12363;&#12425;&#12398;&#22577;&#21578;&#12375;&#12363;&#21463;&#12369;&#21462;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#33030;&#24369;&#24615;&#12434;&#12522;&#12473;&#12488;&#12395;&#36617;&#12379;&#12390;&#12418;&#12425;&#12358;&#12395;&#12399;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392; CVE Editorial Board &#12398;&#27211;&#28193;&#12375;&#12434;&#12377;&#12427;&#20210;&#20171;&#24441;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#21608;&#22258;&#12398;&#38283;&#30330;&#32773;&#12395;&#32862;&#12356;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12381;&#12398;&#20013;&#12395;&#19968;&#20154;&#12367;&#12425;&#12356;&#12399;&#12289;
  &#12300;&#20197;&#21069;&#12395;&#19968;&#24230; CAN &#12434;&#21462;&#24471;&#12375;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#12301;&#12392;&#12363;
  &#12300;&#30693;&#12426;&#21512;&#12356;&#12364; CAN &#12434;&#21462;&#24471;&#12375;&#12390;&#12356;&#12383;&#12301;&#12392;&#12363;&#12356;&#12358;&#20154;&#12364;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#26041;&#24335;&#12398;&#21033;&#28857;&#12399;&#12289;&#30693;&#12426;&#21512;&#12356;&#12398;&#12388;&#12390;&#12434;&#12383;&#12393;&#12387;&#12390;&#12356;&#12367;&#12358;&#12385;&#12395;
  a) &#12381;&#12428;&#12399; MITRE &#12398;&#35328;&#12358;&#12392;&#12371;&#12429;&#12398;&#33030;&#24369;&#24615;&#12395;&#35442;&#24403;&#12375;&#12394;&#12356;&#12363;&#12425;&#25237;&#31295;&#12377;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;
  &#12392;&#12363;
  b) &#12381;&#12398;&#33030;&#24369;&#24615;&#12395;&#12399;&#12377;&#12391;&#12395; CAN &#12354;&#12427;&#12356;&#12399; CVE &#30058;&#21495;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12390;&#12356;&#12427;
  &#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#25945;&#12360;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#24460;&#32773;&#12398;&#21487;&#33021;&#24615;&#12392;&#12375;&#12390;&#12399;&#12289;&#12381;&#12398;&#12496;&#12464;&#12364;&#26082;&#12395;&#21029;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400; <a class="ulink" href="http://www.cert.org/" target="_top">http://www.cert.org/</a>&#12289;&#12354;&#12427;&#12356;&#12399; <a class="ulink" href="http://www.securityfocus.com/" target="_top">http://www.securityfocus.com/</a>
  &#12398;  BugTraq &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12394;&#12393;&#12364;&#12371;&#12428;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;
  (&#12418;&#12375;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#20309;&#12418;&#36899;&#32097;&#12364;&#12394;&#12356;&#12414;&#12414;&#24460;&#32773;&#12398;&#29366;&#24907;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12384;&#12392;&#12375;&#12383;&#12425;&#12289;
  &#33258;&#20998;&#12383;&#12385;&#12398;&#12358;&#12363;&#12364;&#12356;&#30693;&#12428;&#12394;&#12356;&#12392;&#12371;&#12429;&#12391;&#20309;&#12363;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24515;&#37197;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;)&#12290;
</p><p>
  &#12393;&#12358;&#12379; CAN/CVE &#30058;&#21495;&#12434;&#24471;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#26222;&#36890;&#12399;&#12496;&#12464;&#12398;&#35519;&#26619;&#27573;&#38542;&#12398;&#12391;&#12365;&#12427;&#12384;&#12369;&#26089;&#12356;&#12358;&#12385;&#12395;&#30058;&#21495;&#12434;&#21462;&#24471;&#12375;&#12383;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12381;&#12398;&#24460;&#12398;&#12420;&#12426;&#12392;&#12426;&#12399;&#12381;&#12398;&#30058;&#21495;&#12434;&#20351;&#29992;&#12375;&#12390;&#36914;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  CAN &#12456;&#12531;&#12488;&#12522;&#12399;&#12289;&#19968;&#33324;&#12395;&#20844;&#38283;&#12373;&#12428;&#12427;&#26085;&#12414;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12414;&#12391;&#12399;&#31354;&#12398;&#12456;&#12531;&#12488;&#12522;&#12364;&#23384;&#22312;&#12377;&#12427;&#12384;&#12369; (&#22580;&#25152;&#12434;&#30906;&#20445;&#12377;&#12427;&#12384;&#12369;)
  &#12391;&#12354;&#12426;&#12289;&#12354;&#12394;&#12383;&#12364;&#12496;&#12464;&#12398;&#23384;&#22312;&#12392;&#20462;&#27491;&#12434;&#20844;&#34920;&#12377;&#12427;&#12414;&#12391;&#12289;
  &#12381;&#12371;&#12395;&#12399;&#20309;&#12398;&#24773;&#22577;&#12418;&#25522;&#36617;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  CAN/CVE &#12398;&#12503;&#12525;&#12475;&#12473;&#12395;&#12388;&#12356;&#12390;&#12398;&#12424;&#12426;&#35443;&#32048;&#12394;&#24773;&#22577;&#12399;
  <a class="ulink" href="http://cve.mitre.org/cve/identifiers/candidates_explained.html" target="_top">http://cve.mitre.org/cve/identifiers/candidates_explained.html</a>
  &#12391;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383; CAN/CVE &#30058;&#21495;&#12434;&#38750;&#24120;&#12395;&#12358;&#12414;&#12367;&#20351;&#12387;&#12390;&#12356;&#12427;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20363;&#12392;&#12375;&#12390;&#12399;
  <a class="ulink" href="http://www.debian.org/security/cve-compatibility" target="_top">http://www.debian.org/security/cve-compatibility</a>
  &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect3" title="&#20107;&#21069;&#36890;&#30693;"><div class="titlepage"><div><div><h4 class="title"><a name="security-prenotification"></a>&#20107;&#21069;&#36890;&#30693;</h4></div></div></div><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#23550;&#31574;&#12481;&#12540;&#12512; (&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21839;&#38988;&#12398;&#23550;&#24540;&#25285;&#24403;&#32773;) &#12364;&#20462;&#27491;&#12434;&#23436;&#20102;&#12375;&#12383;&#12425;&#12289;
  &#27425;&#12399;&#12381;&#12428;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#20844;&#34920;&#12377;&#12427;&#12398;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#21336;&#12395;&#20462;&#27491;&#12434;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12392;&#12363;&#20840;&#19990;&#30028;&#12395;&#20844;&#34920;&#12377;&#12427;&#12392;&#12363;&#12384;&#12392;&#12289;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;
  &#20107;&#23455;&#19978;&#21363;&#26178;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12434;&#36843;&#12425;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12373;&#12418;&#12394;&#12356;&#12392;&#12289;&#25915;&#25731;&#12434;&#21463;&#12369;&#12427;&#21361;&#38522;&#24615;&#12364;&#29983;&#12376;&#12427;&#12431;&#12369;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12354;&#12427;&#31278;&#12398;&#37325;&#35201;&#12394;&#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12395;&#12399;
  <em class="firstterm">&#20107;&#21069;&#36890;&#30693;</em> &#12434;&#12375;&#12390;&#12362;&#12367;&#12411;&#12358;&#12364;&#36969;&#20999;&#12394;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12356;&#12431;&#12422;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;/&#12469;&#12540;&#12496;&#22411;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12394;&#12393;&#12391;&#12399;&#29305;&#12395;&#12371;&#12428;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;
  &#26377;&#21517;&#12394;&#12469;&#12540;&#12496;&#12364;&#12289;&#19968;&#26178;&#30340;&#12395;&#12391;&#12418;&#25915;&#25731;&#12398;&#23550;&#35937;&#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12469;&#12540;&#12496;&#12398;&#31649;&#29702;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#12399;
  1 &#26085;&#12363;&#12425; 2 &#26085;&#12398;&#26178;&#38291;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#33030;&#24369;&#24615;&#12364;&#19968;&#33324;&#12395;&#20844;&#38283;&#12373;&#12428;&#12427;&#21069;&#12395;&#12381;&#12398;&#12367;&#12425;&#12356;&#12398;&#29494;&#20104;&#12364;&#12354;&#12428;&#12400;&#12289;
  &#12469;&#12540;&#12496;&#12398;&#31649;&#29702;&#32773;&#12399;&#12354;&#12426;&#12364;&#12383;&#12356;&#12392;&#24605;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#20107;&#21069;&#36890;&#30693;&#12392;&#12399;&#12289;&#21336;&#12395;&#19968;&#33324;&#20844;&#38283;&#21069;&#12395;&#12381;&#12428;&#12425;&#12398;&#31649;&#29702;&#32773;&#21521;&#12369;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#20449;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
  &#36890;&#30693;&#12513;&#12540;&#12523;&#12391;&#12399;&#12289;&#33030;&#24369;&#24615;&#12398;&#20869;&#23481;&#12392;&#12381;&#12398;&#23550;&#20966;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#20107;&#21069;&#36890;&#30693;&#12398;&#36865;&#20449;&#20808;&#12399;&#12289;&#12381;&#12398;&#24773;&#22577;&#12434;&#36969;&#20999;&#12395;&#25201;&#12387;&#12390;&#12367;&#12428;&#12427;&#12392;&#20449;&#38972;&#12391;&#12365;&#12427;&#30456;&#25163;&#12395;&#38480;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#20107;&#21069;&#36890;&#30693;&#12434;&#21463;&#12369;&#21462;&#12427;&#36039;&#26684;&#12364;&#12354;&#12427;&#12398;&#12399;&#12289;&#27425;&#12398;&#12405;&#12383;&#12388;&#12398;&#26465;&#20214;&#12434;&#28288;&#12383;&#12377;&#30456;&#25163;&#12384;&#12369;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#25915;&#25731;&#12434;&#21463;&#12369;&#12427;&#12392;&#28145;&#21051;&#12394;&#21839;&#38988;&#12392;&#12394;&#12427;&#12424;&#12358;&#12394;&#24040;&#22823;&#12391;&#37325;&#35201;&#12394;&#12469;&#12540;&#12496;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
  <span class="emphasis"><em>&#12373;&#12425;&#12395;</em></span>&#12289;&#19968;&#33324;&#20844;&#38283;&#12398;&#21069;&#12395;&#12381;&#12398;&#21839;&#38988;&#12434;&#12506;&#12521;&#12506;&#12521;&#12375;&#12419;&#12409;&#12387;&#12390;&#12375;&#12414;&#12358;&#12424;&#12358;&#12394;
  &#21475;&#12398;&#36605;&#12356;&#20154;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
</p><p>
  &#20107;&#21069;&#36890;&#30693;&#12398;&#12513;&#12540;&#12523;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#30456;&#25163;&#12395;&#20491;&#21029;&#12395; (&#19968;&#24230;&#12395;&#19968;&#36890;&#12378;&#12388;) &#36865;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#20840;&#21729;&#12395;&#19968;&#25324;&#36865;&#20449;&#12394;&#12393;&#12375;&#12390;&#12399; <span class="emphasis"><em>&#12356;&#12369;&#12414;&#12379;&#12435;</em></span>&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12428;&#12400;&#12289;&#12381;&#12428;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#20154;&#12383;&#12385;&#12395;&#12300;&#31169;&#12398;&#12411;&#12363;&#12395;&#12393;&#12435;&#12394;&#30456;&#25163;&#12395;&#36865;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12301;
  &#12434;&#30693;&#12425;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12364;&#20309;&#12434;&#24847;&#21619;&#12377;&#12427;&#12398;&#12363;&#12290;&#12381;&#12428;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#20154;&#12399;
  &#12300;(&#31169;&#20197;&#22806;&#12398;) &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#12469;&#12540;&#12496;&#12395;&#12418;&#21516;&#12376;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12507;&#12540;&#12523;&#12364;&#12354;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20840;&#21729;&#12434;&#12502;&#12521;&#12452;&#12531;&#12489;&#12459;&#12540;&#12508;&#12531;&#12467;&#12500;&#12540; (BCC) &#12391;&#25351;&#23450;&#12377;&#12428;&#12400;&#12356;&#12356;&#12392;&#12356;&#12358;&#21839;&#38988;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21463;&#12369;&#21462;&#12426;&#20808;&#12364;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12473;&#12497;&#12512;&#12501;&#12451;&#12523;&#12479;&#12398;&#35373;&#23450;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;BCC
  &#12391;&#36865;&#20449;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12434;&#12502;&#12525;&#12483;&#12463;&#12375;&#12383;&#12426;&#20778;&#20808;&#24230;&#12434;&#19979;&#12370;&#12383;&#12426;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;
  (&#26368;&#36817;&#12398;&#12473;&#12497;&#12512;&#12395;&#12399;&#12289;BCC &#12434;&#20351;&#29992;&#12375;&#12390;&#36865;&#12425;&#12428;&#12390;&#12367;&#12427;&#12418;&#12398;&#12364;&#22810;&#12356;&#12398;&#12391;&#12377;)&#12290;
</p><p>&#20107;&#21069;&#36890;&#30693;&#12513;&#12540;&#12523;&#12398;&#20363;&#12434;&#12289;&#12371;&#12371;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p><pre class="screen">
From: &#12354;&#12394;&#12383;&#12398;&#21517;&#21069;
To: admin@large-famous-server.com
Reply-to: &#12354;&#12394;&#12383;&#12398;&#21517;&#21069; (&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)
Subject: [&#27231;&#23494;] &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#36890;&#30693;


&#12371;&#12398;&#12513;&#12540;&#12523;&#12399;&#12289;Scanley &#12469;&#12540;&#12496;&#12395;&#12362;&#12369;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35686;&#21578;&#12395;&#38306;&#12377;&#12427;&#26997;&#31192;&#12398;&#20107;&#21069;
&#36890;&#30693;&#12391;&#12377;&#12290;

&#12371;&#12398;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12399;&#12289;&#27770;&#12375;&#12390;&#20182;&#20154;&#12395;&#36578;&#36865;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#19968;&#33324;&#21521;&#12369;&#12395;&#12399; 5 &#26376;
19 &#26085;&#12395;&#20844;&#34920;&#12377;&#12427;&#20104;&#23450;&#12391;&#12377;&#12290;&#12381;&#12428;&#12414;&#12391;&#12399;&#12371;&#12398;&#24773;&#22577;&#12434;&#21475;&#22806;&#12375;&#12394;&#12356;&#12424;&#12358;&#12362;&#39000;&#12356;&#12356;&#12383;&#12375;
&#12414;&#12377;&#12290;

&#12354;&#12394;&#12383;&#12395;&#12371;&#12398;&#12362;&#30693;&#12425;&#12379;&#12434;&#36865;&#20449;&#12375;&#12383;&#29702;&#30001;&#12399;&#12289;(&#12362;&#12381;&#12425;&#12367;) &#12354;&#12394;&#12383;&#12364; Scanley &#12469;&#12540;
&#12496;&#12434;&#12372;&#21033;&#29992;&#12356;&#12383;&#12384;&#12356;&#12390;&#12362;&#12426;&#12289;5 &#26376; 19 &#26085;&#12395;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12507;&#12540;&#12523;&#12434;&#20844;&#34920;&#12377;&#12427;&#21069;&#12395;
&#12497;&#12483;&#12481;&#12434;&#36969;&#29992;&#12375;&#12383;&#12356;&#12391;&#12354;&#12429;&#12358;&#12392;&#32771;&#12360;&#12425;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;

&#21442;&#29031;:
=====

   CAN-2004-1771: Scanley stack overflow in queries

&#33030;&#24369;&#24615;:
=======

   &#12469;&#12540;&#12496;&#12398;&#12525;&#12465;&#12540;&#12523;&#12398;&#35373;&#23450;&#12364;&#27491;&#12375;&#12367;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12363;&#12425;&#19981;&#27491;&#12394;
   &#12463;&#12456;&#12522;&#12434;&#36865;&#20449;&#12377;&#12427;&#12392;&#12469;&#12540;&#12496;&#19978;&#12391;&#20219;&#24847;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;

&#37325;&#22823;&#24230;:
=======

   &#38750;&#24120;&#12395;&#28145;&#21051;&#12290;&#12469;&#12540;&#12496;&#19978;&#12391;&#20219;&#24847;&#12398;&#12467;&#12540;&#12489;&#12398;&#23455;&#34892;&#12434;&#35377;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;

&#22238;&#36991;&#26041;&#27861;:
=========

   scanley.conf &#12391; 'natural-language-processing' &#12458;&#12503;&#12471;&#12519;&#12531;&#12434; 'off'
   &#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12371;&#12398;&#33030;&#24369;&#24615;&#12434;&#22238;&#36991;&#21487;&#33021;&#12391;&#12377;&#12290;

&#12497;&#12483;&#12481;:
=======

   &#20197;&#19979;&#12398;&#12497;&#12483;&#12481;&#12399; Scanley 3.0&#12289;3.1 &#12362;&#12424;&#12403; 3.2 &#12395;&#36969;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;

   &#26032;&#12375;&#12356;&#20844;&#38283;&#12522;&#12522;&#12540;&#12473; (Scanley 3.2.1) &#12364; 5 &#26376; 19 &#26085;&#12398;&#30452;&#21069;&#12395;&#20844;&#38283;&#12373;&#12428;&#12414;&#12377;&#12290;
   &#12388;&#12414;&#12426;&#12289;&#12371;&#12398;&#33030;&#24369;&#24615;&#12434;&#20844;&#34920;&#12377;&#12427;&#12398;&#12392;&#21516;&#26178;&#12395;&#20844;&#38283;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#20197;&#19979;&#12398;
   &#12497;&#12483;&#12481;&#12434;&#36969;&#29992;&#12377;&#12427;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12364;&#30330;&#34920;&#12373;&#12428;&#12427;&#12398;&#12434;&#12362;&#24453;&#12385;&#12367;&#12384;
   &#12373;&#12356;&#12290;3.2 &#12392; 3.2.1 &#12398;&#36949;&#12356;&#12399;&#12289;&#20197;&#19979;&#12398;&#12497;&#12483;&#12481;&#12398;&#12415;&#12391;&#12377;&#12290;

[...&#12371;&#12371;&#12395;&#12497;&#12483;&#12481;&#12434;&#31034;&#12375;&#12414;&#12377;...]
</pre><p>
  CAN &#30058;&#21495;&#12434;&#21462;&#24471;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12428;&#12434;&#20107;&#21069;&#36890;&#30693;&#12395;&#21547;&#12417;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;
  (&#20808;&#12411;&#12393;&#12398;&#20363;&#12391;&#31034;&#12375;&#12383;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;)&#12290;&#12414;&#12384;&#24773;&#22577;&#12399;&#20844;&#38283;&#12373;&#12428;&#12390;&#12362;&#12425;&#12378;
  MITRE &#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#20309;&#12418;&#25522;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12428;&#12391;&#12418;&#21547;&#12417;&#12427;&#20385;&#20516;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  CAN &#30058;&#21495;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12289;&#12381;&#12428;&#12434;&#21463;&#12369;&#21462;&#12387;&#12383;&#30456;&#25163;&#12399;&#12300;&#12371;&#12398;&#36890;&#30693;&#12391;&#30693;&#12387;&#12383;&#12496;&#12464;&#12392;
  &#24460;&#26085;&#27491;&#24335;&#12395;&#20844;&#38283;&#12373;&#12428;&#12427;&#12496;&#12464;&#12364;&#30906;&#12363;&#12395;&#21516;&#12376;&#12418;&#12398;&#12391;&#12354;&#12427;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#27491;&#24335;&#12395;&#12496;&#12464;&#12364;&#20844;&#38283;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#20313;&#35336;&#12394;&#24515;&#37197;&#12434;&#12379;&#12378;&#12395;&#12377;&#12416;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12414;&#12373;&#12395;&#12371;&#12428;&#12371;&#12381;&#12364;&#12289;CAN/CVE &#30058;&#21495;&#12398;&#37325;&#35201;&#12394;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
</p></div><div class="sect3" title="&#20462;&#27491;&#12434;&#19968;&#33324;&#12395;&#20844;&#38283;&#12377;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="security-announcing"></a>&#20462;&#27491;&#12434;&#19968;&#33324;&#12395;&#20844;&#38283;&#12377;&#12427;</h4></div></div></div><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12408;&#12398;&#23550;&#24540;&#12391;&#26368;&#24460;&#12395;&#34892;&#12358;&#12398;&#12364;&#12289;
  &#20462;&#27491;&#20869;&#23481;&#12434;&#19968;&#33324;&#12395;&#20844;&#38283;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12402;&#12392;&#12388;&#12398;&#21253;&#25324;&#30340;&#12394;&#12450;&#12490;&#12454;&#12531;&#12473;&#12391;&#12289;&#20197;&#19979;&#12398;&#20869;&#23481;&#12434;&#35500;&#26126;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12378;&#12381;&#12398;&#21839;&#38988;&#12398;&#20869;&#23481;&#12289;&#12381;&#12375;&#12390; CAN/CVE &#30058;&#21495;&#12434;&#21462;&#24471;&#12375;&#12390;&#12356;&#12428;&#12400;&#12381;&#12398;&#30058;&#21495;&#12289;
  &#24403;&#38754;&#12398;&#22238;&#36991;&#31574;&#12392;&#26412;&#36074;&#30340;&#12394;&#20462;&#27491;&#26041;&#27861;&#12394;&#12393;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
  "&#20462;&#27491;" &#12399;&#12289;&#36890;&#24120;&#12399;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12408;&#12398;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#24418;&#24335;&#12391;&#23455;&#34892;&#12373;&#12428;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12394;&#12393;&#12391;&#12399;&#12289;
  &#12497;&#12483;&#12481;&#12398;&#36969;&#29992;&#12434;&#12418;&#12387;&#12390; "&#20462;&#27491;" &#12392;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12381;&#12428;&#12364;&#36890;&#24120;&#12398;&#12522;&#12522;&#12540;&#12473;&#12392;&#12399;&#30064;&#12394;&#12426;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12497;&#12483;&#12481;&#12398;&#36969;&#29992;&#12395;&#12424;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#26126;&#31034;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;&#20445;&#23432;&#30340;&#12394;&#31649;&#29702;&#32773;&#12391;&#12354;&#12387;&#12390;&#12418;
  &#21103;&#20316;&#29992;&#12434;&#27671;&#12395;&#12379;&#12378;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#24403;&#28982;&#12289;&#20170;&#22238;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20462;&#27491;&#12399;&#23558;&#26469;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#12418;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12289;
  &#23558;&#26469;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12398;&#38555;&#12395;&#12418;&#24515;&#37197;&#12379;&#12378;&#12395;&#12377;&#12415;&#12414;&#12377;
  (&#12522;&#12522;&#12540;&#12473;&#25163;&#32154;&#12365;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<span>
  <a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a> &#12398;</span> <a class="xref" href="release-lines.html#security-releases" title="&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;">&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;&#12301;</a>
  &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;)&#12290;
</p><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#23550;&#24540;&#12398;&#20462;&#27491;&#12391;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12363;&#21542;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
  &#36890;&#24120;&#12398;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12522;&#12522;&#12540;&#12473;&#12392;&#21516;&#31243;&#24230;&#12398;&#20778;&#20808;&#24230;&#12391;&#12450;&#12490;&#12454;&#12531;&#12473;&#12434;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; <code class="literal">announce</code>
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12387;&#12383;&#12426;&#12503;&#12524;&#12473;&#12522;&#12522;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12383;&#12426;
  Freecode &#12398;&#12456;&#12531;&#12488;&#12522;&#12434;&#26356;&#26032;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35413;&#21028;&#12434;&#27671;&#12395;&#12375;&#12390;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12398;&#23384;&#22312;&#12434;&#29976;&#12367;&#35211;&#12427;&#12394;&#12435;&#12390;&#12371;&#12392;&#12399;&#35542;&#22806;&#12391;&#12377;&#12364;&#12289;
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#12450;&#12490;&#12454;&#12531;&#12473;&#12398;&#24433;&#38911;&#12392;&#23455;&#38555;&#12398;&#21839;&#38988;&#12398;&#37325;&#22823;&#24230;&#12392;&#12398;&#20860;&#12397;&#21512;&#12356;&#12395;&#12399;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12507;&#12540;&#12523;&#12364;&#21336;&#12395;&#20123;&#32048;&#12394;&#24773;&#22577;&#12364;&#28431;&#27945;&#12377;&#12427;&#12392;&#12356;&#12358;&#12384;&#12369;&#12398;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;
  &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#20840;&#20307;&#12364;&#12398;&#12387;&#12392;&#12425;&#12428;&#12390;&#12375;&#12414;&#12358;&#12411;&#12393;&#12398;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#22580;&#21512;&#12399;&#12289;
  &#12354;&#12414;&#12426;&#22823;&#39442;&#12366;&#12375;&#12394;&#12356;&#12411;&#12358;&#12364;&#12356;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;
  <code class="literal">announce</code> &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#25237;&#31295;&#12418;&#25511;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12360;&#12414;&#12377;&#12290;
  &#12373;&#12373;&#12356;&#12394;&#12371;&#12392;&#12391;&#27598;&#22238;&#22823;&#39442;&#12366;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12393;&#12358;&#24605;&#12358;&#12391;&#12375;&#12423;&#12358;?
  &#23455;&#38555;&#12395;&#12399;&#12381;&#12428;&#12411;&#12393;&#12391;&#12399;&#12394;&#12356;&#12398;&#12395;&#12300;&#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12354;&#12414;&#12426;&#23433;&#20840;&#12391;&#12399;&#12394;&#12356;&#12301;
  &#12392;&#24605;&#12431;&#12428;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#26412;&#24403;&#12395;&#28145;&#21051;&#12394;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#12381;&#12428;&#12434;&#12450;&#12490;&#12454;&#12531;&#12473;&#12375;&#12390;&#12418;&#12289;
  &#12300;&#12414;&#12383;&#12356;&#12388;&#12418;&#12398;&#12420;&#12388;&#12384;&#12429;&#12358;&#12301;&#12392;&#28961;&#35222;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#37325;&#35201;&#24230;&#12398;&#21028;&#26029;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  <a class="ulink" href="http://cve.mitre.org/about/terminology.html" target="_top">http://cve.mitre.org/about/terminology.html</a>
  &#12395;&#12377;&#12400;&#12425;&#12375;&#12356;&#20837;&#38272;&#25991;&#26360;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#12380;&#12402;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21839;&#38988;&#12398;&#23550;&#20966;&#26041;&#27861;&#12364;&#12424;&#12367;&#12431;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
  &#32076;&#39443;&#12364;&#12354;&#12426;&#12381;&#12358;&#12394;&#20154;&#12434;&#25506;&#12375;&#12390;&#30456;&#35527;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#33030;&#24369;&#24615;&#12398;&#35413;&#20385;&#12420;&#12381;&#12398;&#20966;&#29702;&#12398;&#25216;&#34899;&#12399;&#12289;&#32076;&#39443;&#12434;&#31309;&#12414;&#12394;&#12356;&#12392;&#12394;&#12363;&#12394;&#12363;&#24471;&#12425;&#12428;&#12394;&#12356;&#12418;&#12398;&#12391;&#12289;
  &#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#22833;&#25943;&#12377;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
</p></div><p>
  &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#25201;&#12356;&#12395;&#38306;&#12377;&#12427; Apache Software Foundation &#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12364;
  <a class="ulink" href="http://www.apache.org/security/committers.html" target="_top">http://www.apache.org/security/committers.html</a>
  &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12385;&#12425;&#12418;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#32032;&#26228;&#12425;&#12375;&#12356;&#12481;&#12455;&#12483;&#12463;&#12522;&#12473;&#12488;&#12434;&#35211;&#12428;&#12400;&#12289;
  &#33258;&#20998;&#12364;&#12377;&#12409;&#12390;&#12434;&#27880;&#24847;&#28145;&#12367;&#34892;&#12387;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-tracker-usage.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="development-cycle.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#35696;&#35542;&#12375;&#12394;&#12356; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</td></tr></table></div></body></html>
