<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="prev" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="next" href="stabilizing-a-release.html" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="development-cycle.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</th><td width="20%" align="right"> <a accesskey="n" href="stabilizing-a-release.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-branches"></a>&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;</h2></div></div></div><p>
    &#38283;&#30330;&#32773;&#12398;&#35222;&#28857;&#12363;&#12425;&#35211;&#12427;&#12392;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#32153;&#32154;&#12375;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12390;&#12356;&#12427;&#29366;&#24907;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#36890;&#24120;&#12289;&#26368;&#26032;&#12398;&#21033;&#29992;&#21487;&#33021;&#12394;&#12467;&#12540;&#12489;&#12434;&#12356;&#12388;&#12418;&#23455;&#34892;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12496;&#12464;&#12434;&#30330;&#35211;&#12375;&#12383;&#12356;&#12391;&#12377;&#12375;&#12289;
    &#26368;&#26032;&#12384;&#12364;&#27231;&#33021;&#12392;&#12375;&#12390;&#19981;&#23433;&#23450;&#12394;&#38936;&#22495;&#12434;&#36991;&#12369;&#12388;&#12388;&#12289;
    &#38291;&#36817;&#12394;&#12392;&#12371;&#12429;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#36861;&#12356;&#12363;&#12369;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#24444;&#12425;&#12399;&#27598;&#26085;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12467;&#12500;&#12540;&#12434;&#26356;&#26032;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#19968;&#26085;&#12395;&#19968;&#22238;&#20197;&#19978;&#26356;&#26032;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#22793;&#26356;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12418;&#65298;&#65300;&#26178;&#38291;&#20197;&#20869;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#22793;&#26356;&#12398;&#12467;&#12500;&#12540;&#12434;&#20837;&#25163;&#12377;&#12427;&#12392;&#26399;&#24453;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12391;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12393;&#12358;&#12420;&#12387;&#12390;&#27491;&#24335;&#12395;&#12522;&#12522;&#12540;&#12473;&#12377;&#12409;&#12365;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;
    &#12354;&#12427;&#26178;&#28857;&#12398;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#21462;&#24471;&#12375;&#12390;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12414;&#12392;&#12417;&#12289;
    &#12383;&#12392;&#12360;&#12400;&#12496;&#12540;&#12472;&#12519;&#12531; "3.5.0" &#12392;&#12375;&#12390;&#19990;&#30028;&#20013;&#12395;&#37197;&#24067;&#12377;&#12409;&#12365;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;
    &#24120;&#35672;&#12363;&#12425;&#12356;&#12387;&#12390;&#31572;&#12360;&#12399;NO&#12391;&#12377;&#12290;&#31532;&#19968;&#12289;&#38283;&#30330;&#12484;&#12522;&#12540;&#20840;&#20307;&#12364;&#32186;&#40599;&#12395;&#12394;&#12387;&#12390;&#12356;&#12390;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12398;&#28310;&#20633;&#12364;&#12391;&#12365;&#12390;&#12356;&#12427;&#30636;&#38291;&#12394;&#12435;&#12390;&#22810;&#20998;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#38283;&#30330;&#12434;&#22987;&#12417;&#12383;&#26032;&#27231;&#33021;&#12398;&#12467;&#12540;&#12489;&#12364;&#12289;&#27096;&#12293;&#12394;&#23436;&#25104;&#24230;&#12391;&#12381;&#12371;&#12425;&#12376;&#12421;&#12358;&#12395;&#36578;&#12364;&#12387;&#12390;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12496;&#12464;&#12434;&#30452;&#12377;&#12383;&#12417;&#12395;&#22823;&#12365;&#12394;&#22793;&#26356;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#20154;&#12418;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12381;&#12398;&#22793;&#26356;&#12395;&#12399;&#35696;&#35542;&#12398;&#20313;&#22320;&#12364;&#12354;&#12426;&#12289;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#12392;&#12387;&#12383;&#12392;&#12365;&#12395;&#12399;&#35696;&#35542;&#20013;&#12398;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#22580;&#21512;&#12289;&#35696;&#35542;&#12364;&#32066;&#12431;&#12427;&#12414;&#12391;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12398;&#21462;&#24471;&#12434;&#36933;&#12425;&#12379;&#12427;&#12384;&#12369;&#12391;&#12399;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#21029;&#12398;&#38306;&#20418;&#12394;&#12356;&#35696;&#35542;&#12364;&#12381;&#12398;&#38291;&#12395;&#22987;&#12414;&#12387;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#12381;&#12358;&#12394;&#12427;&#12392; <span class="emphasis"><em>&#12381;&#12398;&#35696;&#35542;&#12418;</em></span> &#32066;&#12431;&#12427;&#12414;&#12391;&#24453;&#12383;&#12397;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399;&#12356;&#12388;&#32066;&#12431;&#12427;&#12398;&#12363;&#20445;&#35388;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12392;&#12395;&#12363;&#12367;&#12289;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12398;&#23436;&#20840;&#12394;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#20351;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    &#12383;&#12392;&#12360;&#12484;&#12522;&#12540;&#12434;&#12522;&#12522;&#12540;&#12473;&#12391;&#12365;&#12427;&#29366;&#24907;&#12395;&#12418;&#12387;&#12390;&#12356;&#12369;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12381;&#12398;&#12392;&#12365;&#36914;&#34892;&#12375;&#12390;&#12356;&#12427;&#38283;&#30330;&#12434;&#22952;&#12370;&#12390;&#12375;&#12414;&#12356;&#12364;&#12385;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#29694;&#22312;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12434;&#20206;&#12395; "3.5.0" &#12392;&#12375;&#12289;
    &#27425;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12364; "3.5.1" &#12395;&#12394;&#12427;&#12392;&#12375;&#12390;&#12289;
    "3.5.1" &#12395;&#12399;&#12522;&#12522;&#12540;&#12473; 3.5.0 &#12391;&#35211;&#12388;&#12363;&#12387;&#12383;&#12496;&#12464;&#12398;&#20462;&#27491;&#12364;&#27526;&#12393;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#20001;&#26041;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12364;&#21516;&#12376;&#12484;&#12522;&#12540;&#12395;&#12354;&#12427;&#12392;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#12371;&#12398;&#12405;&#12383;&#12388;&#12364;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12390;&#12356;&#12427;&#38291;&#20309;&#12434;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
    &#20114;&#25563;&#24615;&#12395;&#38306;&#12377;&#12427;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#26032;&#27231;&#33021;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#38283;&#30330;&#32773;&#20840;&#21729;&#12364; 3.5.0 &#12398;&#12467;&#12540;&#12489;&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#12496;&#12464;&#12434;&#29105;&#24515;&#12395;&#20462;&#27491;&#12377;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#26032;&#27231;&#33021;&#12434;&#23436;&#25104;&#12373;&#12379;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12418;&#12356;&#12414;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12364;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12434;&#19981;&#33258;&#28982;&#12394;&#20241;&#27490;&#29366;&#24907;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#29702;&#30001;&#12384;&#12369;&#12391;&#12289;
    &#33258;&#20998;&#12364;&#33288;&#21619;&#12364;&#12394;&#12356;&#12371;&#12392;&#12395;&#21462;&#12426;&#32068;&#12416;&#12363;&#12289;
    &#12412;&#12369;&#12387;&#12392;&#12375;&#12390;&#12356;&#12427;&#12363;&#12434;&#36984;&#12400;&#12397;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12387;&#12383;&#12425;&#12289;&#38283;&#30330;&#32773;&#12399;&#24594;&#12387;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#21839;&#38988;&#12395;&#23550;&#12377;&#12427;&#35299;&#12399;&#12289;
    &#12356;&#12388;&#12418; <em class="firstterm">&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;</em> &#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#21336;&#12394;&#12427;&#12502;&#12521;&#12531;&#12481;&#65288;<a class="xref" href="vc.html#vc-vocabulary-branch"><em class="firstterm">&#12502;&#12521;&#12531;&#12481;</em></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12391;&#12377;&#12290;
    &#12381;&#12371;&#12391;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12467;&#12540;&#12489;&#12364;&#38283;&#30330;&#12398;&#26412;&#32218;&#12363;&#12425;&#38548;&#38626;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12398;&#27010;&#24565;&#12399;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#29983;&#12414;&#12428;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12383;&#12367;&#12373;&#12435;&#12398;&#21830;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12481;&#12540;&#12512;&#12418;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#21830;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#38283;&#30330;&#12391;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12399;&#36101;&#27810;&#12394;&#12418;&#12398;&#12384;&#12392;&#32771;&#12360;&#12425;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;
    &#8212; &#12388;&#12414;&#12426;&#12289;&#38283;&#30330;&#12481;&#12540;&#12512;&#12364;&#12513;&#12452;&#12531;&#12484;&#12522;&#12540;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#20316;&#26989;&#12434;&#24613;&#12356;&#12391;&#12356;&#12427;&#38291;&#12399;&#12289;
    &#22823;&#12365;&#12394;&#32224;&#20999;&#12395;&#36861;&#12431;&#12428;&#12390;&#30465;&#30053;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#19968;&#31278;&#12398; "&#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;" &#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12289;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19981;&#21487;&#27424;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#31169;&#12399;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#28961;&#12375;&#12391;&#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12387;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#35211;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12356;&#12388;&#12418;&#12412;&#12369;&#12387;&#12392;&#12375;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12364;&#12356;&#12427;&#19968;&#26041;&#12391; &#8212;
    &#36890;&#24120;&#12399;&#23569;&#25968;&#12398; &#8212; &#38283;&#30330;&#32773;&#12364;&#12522;&#12522;&#12540;&#12473;&#12434;&#19990;&#12395;&#20986;&#12377;&#12383;&#12417;&#12395;&#20685;&#12356;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#35079;&#25968;&#12398;&#28857;&#12391;&#24746;&#12356;&#32080;&#26524;&#12434;&#12418;&#12383;&#12425;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12414;&#12378;&#31532;&#19968;&#12395;&#12289;&#38283;&#30330;&#20840;&#20307;&#12398;&#21218;&#12356;&#12364;&#34928;&#12360;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12395;&#12289;&#12522;&#12522;&#12540;&#12473;&#12398;&#36074;&#12364;&#24517;&#35201;&#20197;&#19978;&#12395;&#19979;&#12364;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#65298;, &#65299;&#20154;&#12375;&#12363;&#20685;&#12356;&#12390;&#12356;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12364;&#26089;&#12367;&#38283;&#30330;&#12395;&#24489;&#24112;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#24613;&#12356;&#12391;&#20316;&#26989;&#12434;&#32066;&#12360;&#12424;&#12358;&#12392;&#12375;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#65299;&#12388;&#12417;&#12399;&#12289;&#30064;&#12394;&#12387;&#12383;&#20181;&#20107;&#12364;&#38283;&#30330;&#32773;&#21516;&#22763;&#12434;&#19981;&#24517;&#35201;&#12395;&#34909;&#31361;&#12373;&#12379;&#12390;&#12375;&#12414;&#12358;&#12383;&#12417;&#12289;
    &#38283;&#30330;&#32773;&#12481;&#12540;&#12512;&#12364;&#31934;&#31070;&#30340;&#12395;&#20998;&#35010;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12412;&#12540;&#12387;&#12392;&#12375;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12399;&#12289;&#33258;&#20998;&#36948;&#12398;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12420;&#33288;&#21619;&#12395;&#27839;&#12387;&#12390;&#34892;&#21205;&#12434;&#36984;&#12409;&#12427;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395; <span class="emphasis"><em>&#23569;&#12375;</em></span> &#27880;&#24847;&#12434;&#21521;&#12369;&#12427;&#12384;&#12369;&#12391;&#22810;&#20998;&#24184;&#12379;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12502;&#12521;&#12531;&#12481;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;&#24444;&#12425;&#12364;&#36984;&#12409;&#12427;&#12398;&#12399; "&#20474;&#12399;&#20170;&#26085;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12434;&#12420;&#12429;&#12358;&#12363;&#12289;
    &#12381;&#12428;&#12392;&#12418;&#26412;&#32218;&#12391;&#38283;&#30330;&#12375;&#12390;&#12356;&#12427;&#26032;&#27231;&#33021;&#12398;&#20316;&#26989;&#12434;&#12375;&#12424;&#12358;&#12363;&#65311;" &#12392;&#12356;&#12358;&#20108;&#25246;&#12391;&#12399;&#12394;&#12367;&#12289;
    "&#20474;&#12399;&#20170;&#26085;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12424;&#12358;&#12363;&#12289;&#12381;&#12428;&#12392;&#12418;&#12420;&#12417;&#12385;&#12419;&#12362;&#12358;&#12363;&#65311;" &#12392;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;  
</p><div class="sect2" title="&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12398;&#20351;&#12356;&#26041;"><div class="titlepage"><div><div><h3 class="title"><a name="release-branch-mechanics"></a>&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12398;&#20351;&#12356;&#26041;</h3></div></div></div><p>
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#12427;&#27491;&#30906;&#12394;&#25163;&#38918;&#12399;&#12289;
    &#21033;&#29992;&#12375;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12364;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#19968;&#33324;&#30340;&#12394;&#27010;&#24565;&#12399;&#21247;&#35542;&#21516;&#12376;&#12391;&#12377;&#12290;
    &#12502;&#12521;&#12531;&#12481;&#12399;&#36890;&#24120;&#21029;&#12398;&#12502;&#12521;&#12531;&#12481;&#12363;&#12289;trunk&#65288;&#24185;&#65289;&#12363;&#12425;&#27966;&#29983;&#12375;&#12414;&#12377;&#12290;
    &#20253;&#32113;&#30340;&#12395;&#12289;trunk &#12391;&#12399;&#26412;&#32218;&#12398;&#38283;&#30330;&#12364;&#36914;&#12435;&#12391;&#12362;&#12426;&#12289;&#12522;&#12522;&#12540;&#12473;&#12398;&#21046;&#38480;&#12434;&#21463;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12522;&#12522;&#12540;&#12473; "1.0" &#29992;&#12398;&#12399;&#12376;&#12417;&#12390;&#12398;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12399; trunk &#12363;&#12425;&#27966;&#29983;&#12375;&#12414;&#12377;&#12290;
    CVS &#12391;&#12399;&#12289;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12377;&#12427;&#12467;&#12510;&#12531;&#12489;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><pre class="screen">
$ cd trunk-working-copy
$ cvs tag -b RELEASE_1_0_X
</pre><p>Subversion&#12391;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p><pre class="screen">
$ svn copy http://.../repos/trunk http://.../repos/branches/1.0.x
</pre><p>
    &#65288;&#12371;&#12428;&#12425;&#12398;&#20363;&#12399;&#12377;&#12409;&#12390;&#12289;&#65299;&#12388;&#12398;&#25968;&#12391;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12434;&#20184;&#12369;&#12427;&#12420;&#12426;&#26041;&#12434;&#24819;&#23450;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12382;&#12428;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#20351;&#12431;&#12428;&#12427;&#27491;&#30906;&#12394;&#12467;&#12510;&#12531;&#12489;&#12434;&#31034;&#12377;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12364;&#12289;
    CVS &#12392; Subversion &#12398;&#20363;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12289;
    &#20182;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#23550;&#24540;&#12377;&#12427;&#12467;&#12510;&#12531;&#12489;&#12364;&#20104;&#28204;&#12391;&#12365;&#12428;&#12400;&#12356;&#12356;&#12394;&#12392;&#24605;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#65289;
</p><p>
    "1.0.0" &#12391;&#12399;&#12394;&#12367;&#12289;
    (&#25991;&#23383;&#36890;&#12426; "x" &#12392;&#12356;&#12358;&#25991;&#23383;&#12434;&#20351;&#12387;&#12390;&#65289;"1.0.x" &#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12375;&#12383;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12371;&#12428;&#12399;&#21516;&#12376;&#12510;&#12452;&#12490;&#12540;&#12521;&#12452;&#12531; &#8212; &#12388;&#12414;&#12426;&#12289;&#21516;&#12376;&#12502;&#12521;&#12531;&#12481;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377; &#8212;
    &#12364;&#20840;&#12390;&#12398;&#12510;&#12452;&#12463;&#12525;&#12522;&#12522;&#12540;&#12473;&#12391;&#20351;&#12431;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12398;&#12383;&#12417;&#12395;&#12502;&#12521;&#12531;&#12481;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#23455;&#38555;&#12398;&#12503;&#12525;&#12475;&#12473;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    <span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span> <a class="xref" href="stabilizing-a-release.html" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12392;&#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12398;&#38306;&#20418;&#12395;&#12384;&#12369;&#27880;&#24847;&#12434;&#25173;&#12358;&#12371;&#12392;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#12502;&#12521;&#12531;&#12481;&#12364;&#23433;&#23450;&#12375;&#12289;&#12522;&#12522;&#12540;&#12473;&#12398;&#28310;&#20633;&#12364;&#12391;&#12365;&#12383;&#12425;&#12289;
    &#12502;&#12521;&#12531;&#12481;&#12398;&#12473;&#12490;&#12483;&#12503;&#12471;&#12519;&#12483;&#12488;&#12395;&#12479;&#12464;&#12434;&#25171;&#12388;&#12392;&#12365;&#12391;&#12377;&#12290;
    CVS &#12391;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><pre class="screen">
$ cd RELEASE_1_0_X-working-copy
$ cvs tag RELEASE_1_0_0
</pre><p>Subversion &#12391;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p><pre class="screen">
$ svn copy http://.../repos/branches/1.0.x http://.../repos/tags/1.0.0
</pre><p>
    &#12371;&#12398;&#12479;&#12464;&#12399; 1.0.0 &#12364;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#26178;&#28857;&#12398;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12398;&#27491;&#30906;&#12394;&#29366;&#24907;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#65288;&#12371;&#12428;&#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12373;&#12428;&#12383;&#37197;&#24067;&#29289;&#12420;&#12496;&#12452;&#12490;&#12522;&#12364;&#21066;&#38500;&#12373;&#12428;&#12383;&#24460;&#12391;&#12289;
    &#21476;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#21462;&#24471;&#12375;&#12383;&#12356;&#22580;&#21512;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;&#65289;
    &#21516;&#12376;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12391;&#12398;&#27425;&#12398;&#12510;&#12452;&#12463;&#12525;&#12522;&#12522;&#12540;&#12473;&#12399;&#12289;
    &#21516;&#12376;&#12367; 1.0.x &#12502;&#12521;&#12531;&#12481;&#19978;&#12391;&#28310;&#20633;&#12373;&#12428;&#12289;&#12522;&#12522;&#12540;&#12473;&#12398;&#28310;&#20633;&#12364;&#20986;&#26469;&#27425;&#31532;&#12289;
    1.0.1 &#12398;&#12479;&#12464;&#12364;&#25171;&#12383;&#12428;&#12414;&#12377;&#12290;
    1.0.2 &#12395;&#21521;&#12369;&#12390;&#32368;&#12426;&#36820;&#12375;&#12502;&#12521;&#12531;&#12481;&#12434;&#32186;&#40599;&#12395;&#12375;&#12390;&#12356;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    1.1.x &#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#22987;&#12417;&#12427;&#26178;&#26399;&#12364;&#26469;&#12383;&#12425;&#12289;
    &#26032;&#12375;&#12356;&#12502;&#12521;&#12531;&#12481;&#12434; trunk &#12363;&#12425;&#20316;&#12426;&#12414;&#12377;&#12290;
    CVS &#12391;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><pre class="screen">
$ cd trunk-working-copy
$ cvs tag -b RELEASE_1_1_X
</pre><p>Subversion &#12391;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p><pre class="screen">
$ svn copy http://.../repos/trunk http://.../repos/branches/1.1.x
</pre><p>
    &#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12399; 1.0.x &#12392; 1.1.x &#12521;&#12452;&#12531;&#12395;&#23550;&#12375;&#12390;&#20006;&#34892;&#12375;&#12390;&#32154;&#12369;&#12425;&#12428;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12399;&#20001;&#26041;&#12398;&#12521;&#12452;&#12531;&#12363;&#12425;&#29420;&#31435;&#12375;&#12390;&#34892;&#12360;&#12414;&#12377;&#12290;
    &#23455;&#38555;&#12289;&#12405;&#12383;&#12388;&#12398;&#30064;&#12394;&#12387;&#12383;&#12521;&#12452;&#12531;&#12363;&#12425;&#12411;&#12392;&#12435;&#12393;&#21516;&#26178;&#12395;&#12522;&#12522;&#12540;&#12473;&#12364;&#34892;&#12431;&#12428;&#12427;&#12371;&#12392;&#12418;&#29645;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#21476;&#12356;&#12521;&#12452;&#12531;&#12363;&#12425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12399;&#12289;
    &#19968;&#27671;&#12395;&#65288;&#12383;&#12392;&#12360;&#12400;&#65289;1.1 &#12408;&#12496;&#12540;&#12472;&#12519;&#12531;&#12450;&#12483;&#12503;&#12375;&#12383;&#12356;&#12392;&#12365;&#12399;&#12289;
    &#24517;&#12378;&#21608;&#21040;&#12394;&#28310;&#20633;&#12434;&#12375;&#12383;&#12356;&#12392;&#26395;&#12416;&#20445;&#23432;&#30340;&#12394;&#12469;&#12452;&#12488;&#31649;&#29702;&#32773;&#12395;&#12362;&#34214;&#12417;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12391;&#22823;&#32966;&#12394;&#12518;&#12540;&#12470;&#12540;&#12399;&#36890;&#24120;&#12289;
    &#19981;&#23433;&#23450;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12522;&#12473;&#12463;&#12434;&#36000;&#12387;&#12390;&#12391;&#12418;&#12289;
    &#24517;&#12378;&#26368;&#26032;&#12398;&#27231;&#33021;&#12434;&#20351;&#12358;&#12383;&#12417;&#12395;&#12289;
    &#12424;&#12426;&#26032;&#12375;&#12356;&#12521;&#12452;&#12531;&#12398;&#26368;&#26032;&#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#25505;&#29992;&#12375;&#12414;&#12377;&#12290;
</p></div><p>
    &#12371;&#12371;&#12391;&#35500;&#26126;&#12375;&#12383;&#12371;&#12392;&#12364;&#12289;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12398;&#21807;&#19968;&#12398;&#20351;&#12356;&#26041;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#33258;&#20998;&#12364;&#21442;&#21152;&#12375;&#12390;&#12356;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12392;&#12390;&#12418;&#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12383;&#12398;&#12395;&#12289;
    &#12354;&#12427;&#29366;&#27841;&#19979;&#12391;&#12399;&#12358;&#12414;&#12367;&#12356;&#12363;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12358;&#12414;&#12367;&#12356;&#12365;&#12381;&#12358;&#12394;&#12420;&#12426;&#26041;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#20197;&#19979;&#12398;&#28857;&#12399;&#37325;&#35201;&#12394;&#12398;&#12391;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12398;&#30446;&#30340;&#12399;&#12289;
    &#26085;&#12293;&#12398;&#38283;&#30330;&#20316;&#26989;&#12395;&#12424;&#12387;&#12390;&#29983;&#12414;&#12428;&#12427;&#22793;&#21270;&#12363;&#12425;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12434;&#20998;&#38626;&#12377;&#12427;&#12371;&#12392;&#12392;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12434;&#32068;&#32340;&#30340;&#12395;&#34892;&#12358;&#12383;&#12417;&#12395;&#12289;
    &#29289;&#29702;&#30340;&#12394;&#20316;&#26989;&#12473;&#12506;&#12540;&#12473;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#19982;&#12360;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399;&#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="development-cycle.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="stabilizing-a-release.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;</td></tr></table></div></body></html>
