<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="prev" href="release-lines.html" title="&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;"><link rel="next" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="release-lines.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</th><td width="20%" align="right"> <a accesskey="n" href="managing-volunteers.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="releases-and-daily-development"></a>&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;</h2></div></div></div><p>
    &#24179;&#34892;&#12375;&#12390;&#34892;&#12431;&#12428;&#12427;&#12522;&#12522;&#12540;&#12473;&#12434;&#21516;&#26178;&#12395;&#31649;&#29702;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12363;&#12425;&#12289;
    &#26085;&#12293;&#12398;&#38283;&#30330;&#12398;&#12420;&#12426;&#26041;&#12434;&#25512;&#28204;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#29305;&#12395;&#12289;&#27425;&#12398;&#12371;&#12392;&#12399;&#12393;&#12435;&#12394;&#12392;&#12365;&#12391;&#12418;&#25512;&#22888;&#12373;&#12428;&#12427;&#24375;&#21046;&#30340;&#12394;&#35215;&#24459;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12467;&#12511;&#12483;&#12488;&#12398;&#12402;&#12392;&#12388;&#12402;&#12392;&#12388;&#12399;&#12289;&#35542;&#29702;&#30340;&#12394;&#22793;&#26356;&#21336;&#20301;&#12391;&#12354;&#12427;&#12371;&#12392;&#12289;
    &#12381;&#12375;&#12390;&#38306;&#36899;&#12398;&#12394;&#12356;&#22793;&#26356;&#12434;&#12372;&#12387;&#12385;&#12419;&#12395;&#12375;&#12390;&#19968;&#24230;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#22793;&#26356;&#12377;&#12427;&#37327;&#12364;&#12392;&#12390;&#12418;&#22810;&#12356;&#12289;&#12414;&#12383;&#12399;&#19968;&#24230;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12398;&#12364;&#30772;&#22730;&#30340;&#12391;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12381;&#12428;&#12434;N&#22238;&#12398;&#12467;&#12511;&#12483;&#12488;&#12395;&#20998;&#21106;&#12375;&#12289;
    &#12381;&#12428;&#12382;&#12428;&#12398;&#12467;&#12511;&#12483;&#12488;&#12364;&#22793;&#26356;&#20840;&#20307;&#12434;&#12358;&#12414;&#12367;&#20998;&#21106;&#12375;&#12383;&#12469;&#12502;&#12475;&#12483;&#12488;&#12391;&#12354;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#22793;&#26356;&#20840;&#20307;&#12395;&#38306;&#20418;&#12398;&#12394;&#12356;&#12418;&#12398;&#12399;&#19968;&#20999;&#21547;&#12414;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><p>
    &#27425;&#12395;&#31034;&#12377;&#12398;&#12399;&#12289;&#12414;&#12392;&#12414;&#12426;&#12398;&#12394;&#12356;&#24746;&#12356;&#12467;&#12511;&#12483;&#12488;&#12398;&#20363;&#12391;&#12377;&#12290;:
</p><pre class="screen">
------------------------------------------------------------------------
r6228 | jrandom | 2004-06-30 22:13:07 -0500 (Wed, 30 Jun 2004) | 8 lines

&#21839;&#38988; #1729 &#12434;&#20462;&#27491; : &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20316;&#25104;&#12434;&#19978;&#21697;&#12395;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12383;&#12290;&#12371;&#12428;&#12395;&#20276;&#12356;&#12289;
&#12501;&#12449;&#12452;&#12523;&#12395;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#20316;&#25104;&#12375;&#12390;&#12356;&#12427;&#26368;&#20013;&#12395;&#12518;&#12540;&#12470;&#12540;&#12364;&#12501;&#12449;&#12452;&#12523;&#12434;&#22793;&#26356;&#12375;&#12390;&#12356;&#12383;&#12425;&#35686;&#21578;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12290;

* ui/repl.py
  (ChangingFile): &#26032;&#12375;&#12356;&#20363;&#22806;&#12463;&#12521;&#12473;
  (DoIndex): &#26032;&#12375;&#12356;&#20363;&#22806;&#12434;&#20966;&#29702;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;

* indexer/index.py
  (FollowStream): &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#20316;&#25104;&#20013;&#12395;&#12501;&#12449;&#12452;&#12523;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12425;&#12289;&#20363;&#22806;&#12434;&#29983;&#25104;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;
  (BuildDir): &#19978;&#35352;&#12392;&#12399;&#38306;&#20418;&#12394;&#12356;&#12364;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#21476;&#12356;&#12467;&#12513;&#12531;&#12488;&#12434;&#21066;&#38500;&#12375;&#12289;
  &#12467;&#12540;&#12489;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#12356;&#12367;&#12388;&#12363;&#20462;&#27491;&#12375;&#12383;&#12290;&#12414;&#12383;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20316;&#25104;&#26178;&#12398;&#12456;&#12521;&#12540;&#12481;&#12455;&#12483;&#12463;&#12434;&#20462;&#27491;&#12375;&#12383;&#12290;

&#12381;&#12398;&#20182;&#38306;&#36899;&#12398;&#12394;&#12356;&#12463;&#12522;&#12540;&#12531;&#12450;&#12483;&#12503;:

* www/index.html: typo&#12434;&#20462;&#27491;&#12375;&#12289;&#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#26085;&#12434;&#35373;&#23450;&#12290;
------------------------------------------------------------------------
</pre><p>
    &#21839;&#38988;&#28857;&#12364;&#28014;&#12365;&#24427;&#12426;&#12395;&#12394;&#12427;&#12398;&#12399;&#12289;&#26469;&#12427;&#12409;&#12365;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12522;&#12522;&#12540;&#12473;&#12395;&#20633;&#12360;&#12390;&#12289;
    <code class="function">BuildDir</code> &#38306;&#25968;&#12398;&#12456;&#12521;&#12540;&#12481;&#12455;&#12483;&#12463;&#12434;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#31227;&#26893;&#12377;&#12427;&#24517;&#35201;&#12364;&#20986;&#12390;&#12365;&#12383;&#12392;&#12365;&#12391;&#12377;&#12290;
    &#31227;&#26893;&#12377;&#12427;&#20154;&#12399;&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#22793;&#26356;&#28857;&#12399;&#12356;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#21839;&#38988; #1729 &#12398;&#20462;&#27491;&#33258;&#20307;&#12434;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12399;&#35469;&#12417;&#12425;&#12428;&#12378;&#12289;
    <code class="filename">index.html</code> &#12398;&#35519;&#25972;&#12418;&#12371;&#12371;&#12391;&#12399;&#38306;&#20418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;<code class="function">BuildDir</code> &#12398;&#22793;&#26356;&#12434;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12510;&#12540;&#12472;&#27231;&#33021;&#12434;&#20351;&#12387;&#12390;&#23481;&#26131;&#12395;&#21462;&#12426;&#20986;&#12377;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;
    &#12371;&#12398;&#22793;&#26356;&#12434;&#20182;&#12398;&#38306;&#20418;&#12398;&#12394;&#12356;&#12418;&#12398;&#12392;&#12464;&#12523;&#12540;&#12503;&#21270;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#23455;&#38555;&#12395;&#12399;&#12289;&#12510;&#12540;&#12472;&#12377;&#12427;&#21069;&#12391;&#12373;&#12360;&#21839;&#38988;&#12364;&#20986;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#25237;&#31080;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#22793;&#26356;&#28857;&#12434;&#32645;&#21015;&#12377;&#12427;&#22580;&#21512;&#12391;&#12377;&#12290;:
    &#25237;&#31080;&#12434;&#25552;&#26696;&#12377;&#12427;&#20154;&#12399;&#12289;&#35442;&#24403;&#12377;&#12427;&#22793;&#26356;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434;&#19982;&#12360;&#12427;&#20195;&#12431;&#12426;&#12395;&#12289;
    &#25552;&#26696;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12511;&#12483;&#12488;&#12398;&#19968;&#37096;&#20998;&#12434;&#20998;&#38626;&#12377;&#12427;&#12383;&#12417;&#12384;&#12369;&#12395;&#12289;&#29305;&#21029;&#12394;&#12497;&#12483;&#12481;&#12434;&#20316;&#12387;&#12383;&#12426;&#12289;
    &#22793;&#26356;&#29992;&#12398;&#12502;&#12521;&#12531;&#12481;&#12434;&#20999;&#12425;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#12383;&#12417;&#12289;&#20182;&#12398;&#20154;&#12364;&#12358;&#12435;&#12374;&#12426;&#12377;&#12427;&#37327;&#12398;&#20181;&#20107;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12392;&#12356;&#12358;&#12398;&#12418;&#12377;&#12409;&#12390;&#12289;&#22793;&#26356;&#28857;&#12434;&#35542;&#29702;&#30340;&#12394;&#12464;&#12523;&#12540;&#12503;&#12395;&#20998;&#21106;&#12377;&#12427;&#12398;&#12434;&#38754;&#20498;&#33261;&#12364;&#12387;&#12383;&#12467;&#12511;&#12483;&#12479;&#12540;&#12398;&#12379;&#12356;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#23455;&#38555;&#12395;&#12399;&#12289;&#12371;&#12398;&#12467;&#12511;&#12483;&#12488;&#12399; <span class="emphasis"><em>4&#12388;</em></span> &#12395;&#20998;&#21106;&#12377;&#12409;&#12365;&#12391;&#12375;&#12383;&#12290;
    &#12402;&#12392;&#12388;&#12399; &#21839;&#38988; #1729 &#12398;&#20462;&#27491;&#12289;
    &#12418;&#12358;&#12402;&#12392;&#12388;&#12399; &#21476;&#12356;&#12467;&#12513;&#12531;&#12488;&#12398;&#21066;&#38500;&#12392; <code class="function">BuildDir</code> &#38306;&#25968;&#12398;&#12467;&#12540;&#12489;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12398;&#20462;&#27491;&#12289;
    &#12381;&#12375;&#12390; <code class="function">BuildDir</code> &#38306;&#25968;&#12398;&#12456;&#12521;&#12540;&#12481;&#12455;&#12483;&#12463;&#12398;&#20462;&#27491;&#12289;
    &#26368;&#24460;&#12395; <code class="filename">index.html</code> &#12398;&#24494;&#35519;&#25972;&#12391;&#12377;&#12290;
    3&#30058;&#30446;&#12398;&#12467;&#12511;&#12483;&#12488;&#12371;&#12381;&#12364;&#12289;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12522;&#12522;&#12540;&#12473;&#12398;&#12502;&#12521;&#12531;&#12481;&#12395;&#21547;&#12417;&#12427;&#12424;&#12358;&#25552;&#26696;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12381;&#12428;&#12382;&#12428;&#12398;&#12467;&#12511;&#12483;&#12488;&#12434;&#35542;&#29702;&#30340;&#12394;&#22793;&#26356;&#21336;&#20301;&#12395;&#20998;&#21106;&#12377;&#12427;&#12398;&#12364;&#26395;&#12414;&#12375;&#12356;&#12398;&#12399;&#12289;
    &#12418;&#12385;&#12429;&#12435;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12383;&#12417;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#24515;&#29702;&#30340;&#12395;&#12418;&#12289;&#24847;&#21619;&#12364;&#12414;&#12392;&#12414;&#12387;&#12390;&#12356;&#12427;&#12467;&#12511;&#12483;&#12488;&#12399;&#12524;&#12499;&#12517;&#12540;&#12375;&#12420;&#12377;&#12367;&#12289;
    &#24517;&#35201;&#12394;&#26178;&#12395;&#20803;&#12395;&#25147;&#12375;&#12420;&#12377;&#12356; (&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#22793;&#26356;&#12434;&#20803;&#12395;&#25147;&#12377;&#12371;&#12392;&#12391;&#12289;&#29305;&#27530;&#12394;&#12510;&#12540;&#12472;&#12434;&#34892;&#12358;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;) &#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#21069;&#12418;&#12387;&#12390;&#30342;&#12364;&#35215;&#24459;&#12434;&#12385;&#12423;&#12387;&#12392;&#23432;&#12387;&#12390;&#12362;&#12369;&#12400;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#24460;&#12395;&#38957;&#30171;&#12398;&#31278;&#12434;&#22810;&#12367;&#25265;&#12360;&#12378;&#12395;&#28168;&#12416;&#12398;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#12522;&#12522;&#12540;&#12473;&#12398;&#35336;&#30011;&#12434;&#31435;&#12390;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="planning"></a>&#12522;&#12522;&#12540;&#12473;&#12398;&#35336;&#30011;&#12434;&#31435;&#12390;&#12427;</h3></div></div></div><p>
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;&#27508;&#21490;&#30340;&#12395;&#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#30064;&#12394;&#12427;&#28857;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12398;&#35336;&#30011;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#29420;&#21344;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#30906;&#22266;&#12392;&#12375;&#12383;&#12294;&#20999;&#12364;&#12354;&#12427;&#12398;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12381;&#12398;&#29702;&#30001;&#12399;&#12289;&#39015;&#23458;&#12395;&#12354;&#12427;&#26178;&#28857;&#12391;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12434;&#25552;&#20379;&#12377;&#12427;&#12392;&#32004;&#26463;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12418;&#12354;&#12428;&#12400;&#12289;
    &#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12434;&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;&#19978;&#12398;&#29702;&#30001;&#12363;&#12425;&#20182;&#12398;&#20181;&#20107;&#12392;&#36899;&#25658;&#12373;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12387;&#12383;&#12426;&#12392;&#12363;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#12356;&#12427;&#12505;&#12531;&#12481;&#12515;&#12540;&#12461;&#12515;&#12500;&#12479;&#12523;&#12398;&#20154;&#12364;&#12289;
    &#12373;&#12425;&#12395;&#25237;&#36039;&#12434;&#12377;&#12427;&#21069;&#12395;&#25104;&#26524;&#12434;&#35211;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#19968;&#26041;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#25991;&#23383;&#36890;&#12426;&#12398;&#24847;&#21619;&#12391;&#12398;&#12300;&#36947;&#27005;&#12301;&#12364;&#26368;&#36817;&#12414;&#12391;&#12411;&#12392;&#12435;&#12393;&#12398;&#21205;&#27231;&#20184;&#12369;&#12392;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;:
    &#12388;&#12414;&#12426;&#12289;&#22909;&#12365;&#12384;&#12363;&#12425;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#20840;&#12390;&#12398;&#27231;&#33021;&#12364;&#25539;&#12358;&#21069;&#12395;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#24517;&#35201;&#24615;&#12434;&#24863;&#12376;&#12427;&#20154;&#12399;&#12356;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12381;&#12418;&#12381;&#12418;&#12394;&#12380;&#12381;&#12358;&#12377;&#12409;&#12365;&#12394;&#12398;&#12391;&#12375;&#12423;&#12358;&#65311;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#30342;&#12398;&#20181;&#20107;&#12364;&#12402;&#12392;&#12388;&#12398;&#29983;&#29987;&#12521;&#12452;&#12531;&#12395;&#20055;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#26368;&#36817;&#12391;&#12399;&#12289;&#22810;&#12367;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20225;&#26989;&#12363;&#12425;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12289;
    &#12381;&#12428;&#12395;&#20276;&#12387;&#12390;&#20225;&#26989;&#12398;&#12294;&#20999;&#25991;&#21270;&#12398;&#24433;&#38911;&#12434;&#12424;&#12426;&#22810;&#12367;&#21463;&#12369;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12365;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#22810;&#12367;&#12398;&#28857;&#12391;&#12399;&#33391;&#12356;&#12371;&#12392;&#12394;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12362;&#37329;&#12434;&#36016;&#12387;&#12390;&#38599;&#12431;&#12428;&#12390;&#12356;&#12427;&#38283;&#30330;&#32773;&#12392;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12398;&#38291;&#12391;&#12289;
    &#20778;&#20808;&#38918;&#20301;&#12398;&#34909;&#31361;&#12364;&#36215;&#12365;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#34909;&#31361;&#12399;&#12522;&#12522;&#12540;&#12473;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12434;&#12356;&#12388;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#21839;&#38988;&#12391;&#12424;&#12367;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
    &#12503;&#12524;&#12483;&#12471;&#12515;&#12540;&#12364;&#24375;&#12356;&#38599;&#12431;&#12428;&#38283;&#30330;&#32773;&#12399;&#12289;&#24403;&#28982;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#26085;&#31243;&#12434;&#27770;&#12417;&#12383;&#12364;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#12399;&#20182;&#12398;&#21839;&#38988;&#24847;&#35672;&#12398;&#26041;&#12364;&#24375;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435; &#8212; 
    &#12381;&#12428;&#12399;&#33258;&#20998;&#12383;&#12385;&#12364;&#27714;&#12417;&#12427;&#27231;&#33021;&#12420;&#12289;&#20181;&#19978;&#12370;&#12390;&#12362;&#12365;&#12383;&#12356;&#12486;&#12473;&#12488;&#12391;&#12354;&#12387;&#12383;&#12426;&#12375;&#12414;&#12377; &#8212; 
    &#12424;&#12387;&#12390;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#38283;&#30330;&#32773;&#36948;&#12399;&#12522;&#12522;&#12540;&#12473;&#12434;&#24453;&#12388;&#12409;&#12365;&#12384;&#12392;&#24863;&#12376;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12418;&#12385;&#12429;&#12435;&#12371;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#35696;&#35542;&#12375;&#12289;&#22949;&#21332;&#12377;&#12427;&#20197;&#22806;&#12395;&#19968;&#33324;&#30340;&#12394;&#35299;&#27770;&#31574;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#25552;&#26696;&#12373;&#12428;&#12390;&#12356;&#12427;&#12522;&#12522;&#12540;&#12473;&#12398; <span class="emphasis"><em>&#23384;&#22312;</em></span> &#12363;&#12425;&#12289;
    &#26085;&#20184;&#12434;&#20999;&#12426;&#38626;&#12377;&#12371;&#12392;&#12391;&#12289;&#34909;&#31361;&#12398;&#38971;&#24230;&#12420;&#24230;&#21512;&#12356;&#12434;&#26368;&#23567;&#38480;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12399;&#12376;&#12417;&#12399;&#12374;&#12387;&#12367;&#12426;&#12392;&#12375;&#12383;&#35211;&#31309;&#12426;<sup>[<a name="idp2619904" href="#ftn.idp2619904" class="footnote">29</a>]</sup> &#20197;&#22806;&#12399;&#26085;&#20184;&#12395;&#12388;&#12356;&#12390;&#35302;&#12428;&#12378;&#12289;
    &#30452;&#36817;&#12363;&#12425;&#20013;&#26399;&#30340;&#12394;&#27573;&#38542;&#12391;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12393;&#12358;&#12356;&#12387;&#12383;&#24418;&#12398;&#12522;&#12522;&#12540;&#12473;&#12364;&#12391;&#12365;&#12427;&#12363;&#12289;
    &#12381;&#12375;&#12390;&#12381;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#12393;&#12435;&#12394;&#27231;&#33021;&#12434;&#21547;&#12417;&#12427;&#12398;&#12363;&#12289;&#12392;&#12356;&#12358;&#26041;&#21521;&#12395;&#35696;&#35542;&#12434;&#35480;&#23566;&#12375;&#12390;&#12415;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#27231;&#33021;&#12395;&#12388;&#12356;&#12390;&#26089;&#26399;&#12395;&#30906;&#23450;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12289;
    &#20491;&#12293;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12364;&#35079;&#38609;&#12395;&#12394;&#12427;&#24230;&#21512;&#12356;&#12434;&#28187;&#12425;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;
    &#20104;&#28204;&#21487;&#33021;&#24615;&#12434;&#39640;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#26032;&#27231;&#33021;&#12420;&#20182;&#12398;&#35079;&#38609;&#12394;&#12371;&#12392;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12398;&#23450;&#32681;&#12434;&#25313;&#22823;&#35299;&#37320;&#12377;&#12427;&#25552;&#26696;&#12395;&#21453;&#23550;&#12373;&#12379;&#12427;&#12354;&#12427;&#31278;&#12398;&#20808;&#20837;&#35251;&#12434;&#26893;&#12360;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12522;&#12522;&#12540;&#12473;&#12398;&#26085;&#21462;&#12426;&#12364;&#27770;&#12414;&#12387;&#12390;&#12356;&#12394;&#12367;&#12390;&#12418;&#12289;
    &#12381;&#12398;&#20869;&#23481;&#12364;&#12358;&#12414;&#12367;&#27770;&#12414;&#12387;&#12390;&#12356;&#12428;&#12400;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12398;&#20869;&#23481;&#12434;&#25313;&#22823;&#12377;&#12427;&#12398;&#12434;&#27491;&#24403;&#21270;&#12377;&#12427;&#12398;&#12399;&#12381;&#12428;&#12434;&#25552;&#26696;&#12377;&#12427;&#20154;&#12398;&#36012;&#20219;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12488;&#12510;&#12473;&#12539;&#12472;&#12455;&#12501;&#12449;&#12540;&#12477;&#12531; &#12398;&#20253;&#35352; <em class="citetitle">Jefferson and His Time</em> &#12391;&#12399;&#12289;
    Dumas Malone &#12364;&#12289;&#12496;&#12540;&#12472;&#12491;&#12450;&#22823;&#23398;&#12398;&#32068;&#32340;&#12434;&#27770;&#12417;&#12427;&#12383;&#12417;&#12398;&#21021;&#12511;&#12540;&#12486;&#12451;&#12531;&#12464;&#12434;&#24444;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#36914;&#12417;&#12383;&#12363;&#12395;&#12388;&#12356;&#12390;&#35486;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#22823;&#23398;&#12434;&#35373;&#31435;&#12377;&#12427;&#12392;&#12356;&#12358;&#12450;&#12452;&#12487;&#12451;&#12450;&#12399;&#12418;&#12392;&#12418;&#12392;&#12472;&#12455;&#12501;&#12449;&#12540;&#12477;&#12531;&#12398;&#12450;&#12452;&#12487;&#12451;&#12450;&#12391;&#12375;&#12383;&#12364;&#12289;
    (&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38480;&#12425;&#12378;&#12289;&#12393;&#12371;&#12391;&#12391;&#12418;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#12364;) 
    &#20182;&#12398;&#22810;&#12367;&#12398;&#38306;&#20418;&#32773;&#12364;&#12289;&#33258;&#20998;&#12383;&#12385;&#12398;&#33288;&#21619;&#12364;&#12354;&#12427;&#12371;&#12392;&#12420;&#35696;&#38988;&#12434;&#25345;&#12387;&#12390;&#20250;&#35696;&#12395;&#20055;&#12426;&#36796;&#12435;&#12391;&#12365;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#24444;&#12425;&#12364;&#12511;&#12540;&#12486;&#12451;&#12531;&#12464;&#12395;&#38598;&#12414;&#12387;&#12390;&#12381;&#12428;&#12425;&#12434;&#24505;&#24213;&#30340;&#12395;&#35696;&#35542;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;
    &#12472;&#12455;&#12501;&#12449;&#12540;&#12477;&#12531;&#12399;&#21608;&#21040;&#12395;&#28310;&#20633;&#12375;&#12383;&#24314;&#31689;&#22259;&#38754;&#12420;&#12289;&#12381;&#12398;&#20104;&#31639;&#12420;&#23455;&#20316;&#26989;&#12289;&#25552;&#26696;&#12373;&#12428;&#12390;&#12356;&#12427;&#12459;&#12522;&#12461;&#12517;&#12521;&#12512;&#12289;
    &#12381;&#12375;&#12390;&#33258;&#20998;&#12364;&#12520;&#12540;&#12525;&#12483;&#12497;&#12363;&#12425;&#36664;&#20837;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12383;&#29305;&#21029;&#12394;&#23398;&#37096;&#12398;&#21517;&#21069;&#12434;&#31034;&#12375;&#12390;&#35211;&#12379;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#20250;&#35696;&#23460;&#12395;&#12356;&#12383;&#20154;&#12398;&#20013;&#12395;&#12289;&#24444;&#20197;&#22806;&#12391;&#12381;&#12358;&#12375;&#12383;&#35696;&#38988;&#12395;&#12388;&#12356;&#12390;&#12411;&#12435;&#12398;&#12431;&#12378;&#12363;&#12391;&#12418;&#28310;&#20633;&#12395;&#12375;&#12383;&#20154;&#12399;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#24444;&#12425;&#12399;&#12381;&#12358;&#12375;&#12383;&#35696;&#38988;&#12395;&#12388;&#12356;&#12390;&#12399;&#12472;&#12455;&#12501;&#12449;&#12540;&#12477;&#12531;&#12398;&#12499;&#12472;&#12519;&#12531;&#12395;&#24467;&#12431;&#12374;&#12427;&#12434;&#24471;&#12414;&#12379;&#12435;&#12290;&#32080;&#23616;&#12289;
    &#12496;&#12540;&#12472;&#12491;&#12450;&#22823;&#23398;&#35373;&#31435;&#12399;&#22810;&#12363;&#12428;&#23569;&#12394;&#12363;&#12428;&#24444;&#12398;&#35336;&#30011;&#36890;&#12426;&#12395;&#36914;&#12435;&#12384;&#12398;&#12391;&#12377;&#12290;
    &#24314;&#31689;&#36027;&#12364;&#20104;&#31639;&#12434;&#12458;&#12540;&#12496;&#12540;&#12375;&#12390;&#12356;&#12383;&#12426;&#12289;&#24444;&#12398;&#12450;&#12452;&#12487;&#12451;&#12450;&#12398;&#22810;&#12367;&#12399;&#27096;&#12293;&#12394;&#29702;&#30001;&#12391;&#23455;&#29694;&#12375;&#12394;&#12363;&#12387;&#12383;&#12426;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;
    &#12472;&#12455;&#12501;&#12449;&#12540;&#12477;&#12531;&#12399;&#12381;&#12428;&#12425;&#12377;&#12409;&#12390;&#12364;&#36215;&#12371;&#12427;&#12371;&#12392;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#23436;&#20840;&#12395;&#20104;&#24819;&#12375;&#12390;&#12356;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24444;&#12398;&#29401;&#12356;&#12399;&#25126;&#30053;&#30340;&#12391;&#12375;&#12383;&#12290;&#12511;&#12540;&#12486;&#12451;&#12531;&#12464;&#12391;&#20182;&#12398;&#20154;&#12364;&#20462;&#27491;&#12434;&#25552;&#26696;&#12379;&#12374;&#12427;&#12434;&#12360;&#12394;&#12356;&#12424;&#12358;&#12394;&#29694;&#23455;&#30340;&#12394;&#36335;&#32218;&#12434;&#25552;&#31034;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12398;&#32080;&#26524;&#12289;&#20840;&#20307;&#12398;&#26528;&#32068;&#12415;&#12289;&#12381;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12418;&#12289;&#12384;&#12356;&#12383;&#12356;&#24444;&#12364;&#26395;&#12416;&#12418;&#12398;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;"&#12511;&#12540;&#12486;&#12451;&#12531;&#12464;" &#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#23567;&#12373;&#12394;&#25552;&#26696;&#12398;&#31309;&#12415;&#37325;&#12397;&#12399;&#12289;&#12381;&#12398;&#12411;&#12392;&#12435;&#12393;&#12364;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12394;&#12383;&#12364;&#12385;&#12423;&#12387;&#12392;&#20449;&#38972;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;
    &#12356;&#12429;&#12356;&#12429;&#12394;&#26032;&#27231;&#33021;&#12420;&#25913;&#21892;&#12420;&#12496;&#12464;&#20462;&#27491;&#12434;&#12479;&#12540;&#12466;&#12483;&#12488;&#12392;&#12394;&#12427;&#12522;&#12522;&#12540;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12399;&#12376;&#12417;&#12428;&#12400;&#12289;
    &#12450;&#12490;&#12454;&#12531;&#12473;&#12375;&#12383;&#20840;&#20307;&#12398;&#12503;&#12521;&#12531;&#12395;&#24467;&#12387;&#12390;&#12289;&#20154;&#12293;&#12399;&#12354;&#12394;&#12383;&#12395;&#12388;&#12356;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12356;&#12387;&#12383;&#12435;&#12381;&#12428;&#12425;&#12364;&#22810;&#12363;&#12428;&#23569;&#12394;&#12363;&#12428;&#12354;&#12394;&#12383;&#12398;&#24605;&#12356;&#36890;&#12426;&#12395;&#36914;&#12417;&#12400;&#12289;
    &#23455;&#38555;&#12398;&#12522;&#12522;&#12540;&#12473; <span class="emphasis"><em>&#26178;&#26399;</em></span> &#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12418;&#12424;&#12426;&#36914;&#12415;&#12420;&#12377;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12418;&#12385;&#12429;&#12435;&#12289;&#20491;&#12293;&#12398;&#27770;&#23450;&#12434;&#12414;&#12427;&#12391;&#25991;&#26360;&#12391;&#30906;&#23450;&#12375;&#12383;&#12363;&#12398;&#12424;&#12358;&#12395;&#31034;&#12373;&#12394;&#12356;&#12398;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;
    &#29305;&#23450;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#21839;&#38988;&#12398;&#35299;&#27770;&#12434;&#12377;&#12427;&#12392;&#27770;&#12417;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;
    &#12467;&#12513;&#12531;&#12488;&#12391;&#35696;&#35542;&#12395;&#21442;&#21152;&#12375;&#12390;&#12418;&#12425;&#12356;&#12289;&#21453;&#23550;&#24847;&#35211;&#12434;&#36848;&#12409;&#12390;&#12418;&#12425;&#12387;&#12383;&#12426;&#12375;&#12289;
    &#21487;&#33021;&#12394;&#26178;&#12399;&#12356;&#12388;&#12391;&#12418;&#12289;&#30495;&#25711;&#12395;&#35500;&#24471;&#12395;&#24540;&#12376;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#21336;&#12395;&#27177;&#21147;&#12434;&#34892;&#20351;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#21147;&#12434;&#25391;&#12426;&#12363;&#12374;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#35336;&#30011;&#12434;&#31435;&#12390;&#12427;&#36942;&#31243;&#12391;&#20182;&#12398;&#20154;&#12364;&#35696;&#35542;&#12395;&#21442;&#21152;&#12377;&#12428;&#12400;&#12377;&#12427;&#12411;&#12393; 
    (<span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a> &#12398;</span> <a class="xref" href="share-management.html" title="&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;">&#12300;&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;) &#12289;
    &#33258;&#20998;&#12364;&#26412;&#24403;&#12395;&#37325;&#35222;&#12375;&#12390;&#12356;&#12427;&#21839;&#38988;&#12398;&#20778;&#20808;&#24230;&#12434;&#39640;&#12417;&#12427;&#12371;&#12392;&#12395;&#36059;&#21516;&#12377;&#12427;&#12424;&#12358;&#35500;&#24471;&#12377;&#12427;&#12371;&#12392;&#12418;&#23481;&#26131;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12522;&#12522;&#12540;&#12473;&#35336;&#30011;&#12434;&#31435;&#12390;&#12427;&#12392;&#12365;&#12395;&#32202;&#24373;&#12434;&#32233;&#12417;&#12427;&#21029;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12434;&#38971;&#32321;&#12395;&#34892;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#38291;&#38548;&#12364;&#38263;&#26399;&#38291;&#31354;&#12367;&#12392;&#12289;
    &#12381;&#12428;&#12382;&#12428;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#37325;&#35201;&#24615;&#12364;&#12513;&#12531;&#12496;&#12540;&#12398;&#20013;&#12391;&#22679;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#33258;&#20998;&#12383;&#12385;&#12398;&#12467;&#12540;&#12489;&#12364;&#21462;&#12426;&#36796;&#12414;&#12428;&#12394;&#12363;&#12387;&#12383;&#12392;&#12365;&#12398;&#12471;&#12519;&#12483;&#12463;&#12364;&#22823;&#12365;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#27425;&#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#12481;&#12515;&#12531;&#12473;&#12414;&#12391;&#12393;&#12428;&#12367;&#12425;&#12356;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12363;&#12364;&#12431;&#12363;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12398;&#35079;&#38609;&#12373;&#12392;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24615;&#36074;&#12395;&#12418;&#12424;&#12426;&#12414;&#12377;&#12364;&#12289;
    3&#12534;&#26376;&#12363;&#12425;6&#12534;&#26376;&#12398;&#38291;&#12367;&#12425;&#12356;&#12364;&#12289;&#26222;&#36890;&#12399;&#36969;&#20999;&#12394;&#12522;&#12522;&#12540;&#12473;&#38291;&#38548;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;
    &#23433;&#23450;&#29256;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12399;&#12289;&#12418;&#12358;&#12377;&#12371;&#12375;&#26089;&#12356;&#38291;&#38548;&#12391;&#12510;&#12452;&#12463;&#12525;&#12522;&#12522;&#12540;&#12473;&#12434;&#20986;&#12375;&#12383;&#26041;&#12364;&#12424;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2619904" href="#idp2619904" class="para">29</a>] </sup>&#21029;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12392;&#12375;&#12390;&#12289;
    Martin Michlmayr &#12398; Ph.D&#35542;&#25991; <em class="citetitle">Quality Improvement in Volunteer Free and Open Source Software Projects: Exploring the Impact of Release Management</em> (<a class="ulink" href="http://www.cyrius.com/publications/michlmayr-phd.html" target="_top">http://www.cyrius.com/publications/michlmayr-phd.html</a>) &#12434;&#35501;&#12416;&#12392;&#12424;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12428;&#12399;&#24040;&#22823;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12356;&#12390;&#12289;
    &#27231;&#33021;&#12505;&#12540;&#12473;&#12398;&#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12392;&#12399;&#27491;&#21453;&#23550;&#12398;&#12289;
    &#26178;&#38291;&#36600;&#12434;&#12505;&#12540;&#12473;&#12392;&#12375;&#12383;&#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12434;&#25505;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#38306;&#12377;&#12427;&#35542;&#25991;&#12391;&#12377;&#12290;
    Michlmayr &#12399;&#12289;Google &#12391;&#12371;&#12428;&#12434;&#38988;&#26448;&#12395;&#12375;&#12383;&#35611;&#28436;&#12418;&#34892;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;Google Video &#12391;&#35222;&#32884;&#21487;&#33021;&#12391;&#12377;&#12290;<a class="ulink" href="http://video.google.com/videoplay?docid=-5503858974016723264" target="_top">http://video.google.com/videoplay?docid=-5503858974016723264</a>
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="release-lines.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="managing-volunteers.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</td></tr></table></div></body></html>
