<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="prev" href="testing-and-releasing.html" title="&#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473;"><link rel="next" href="releases-and-daily-development.html" title="&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="testing-and-releasing.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</th><td width="20%" align="right"> <a accesskey="n" href="releases-and-daily-development.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-lines"></a>&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;</h2></div></div></div><p>
    &#12411;&#12392;&#12435;&#12393;&#12398;&#25104;&#29087;&#12375;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#24179;&#34892;&#12375;&#12390;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400; &#12496;&#12540;&#12472;&#12519;&#12531; 1.0.0 &#12364;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#24460;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#26126;&#31034;&#30340;&#12395;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12398;&#32173;&#25345;&#12434;&#12420;&#12417;&#12427;&#12414;&#12391;&#12289;
    &#12510;&#12452;&#12463;&#12525;(&#12496;&#12464;&#20462;&#27491;)&#12522;&#12522;&#12540;&#12473;&#12434; 1.0.1, 1.0.2 &#12394;&#12393;&#12398;&#24418;&#12391;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#12383;&#12384; (&#12510;&#12452;&#12490;&#12540;&#30058;&#21495;&#12364;&#19978;&#12364;&#12387;&#12383;) 1.1.0 &#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12371;&#12392;&#12364;&#12289;
    1.0.x &#12521;&#12452;&#12531;&#12398;&#32173;&#25345;&#12434;&#12420;&#12417;&#12427;&#21313;&#20998;&#12394;&#29702;&#30001;&#12395;&#12399;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#26032;&#12375;&#12356;&#12510;&#12452;&#12490;&#12540;(&#12513;&#12472;&#12515;&#12540;)&#12471;&#12522;&#12540;&#12474;&#12398;&#12399;&#12376;&#12417;&#12398;&#12522;&#12522;&#12540;&#12473;&#12399;&#32118;&#23550;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12398;&#23550;&#35937;&#12395;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#12509;&#12522;&#12471;&#12540;&#12395;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12418;&#12356;&#12414;&#12377; &#8212;
    &#12388;&#12414;&#12426;&#12289;&#24444;&#12425;&#12399;&#12383;&#12392;&#12360;&#12400; 1.1.0 &#12398;&#38291;&#12399;&#20182;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12496;&#12464;&#12434;&#25506;&#12373;&#12379;&#12289;
    1.1.1 &#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#24453;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#24517;&#12378;&#12375;&#12418;&#33258;&#20998;&#21213;&#25163;&#12394;&#34892;&#21205;&#12392;&#12399;&#35328;&#12360;&#12414;&#12379;&#12435;&#12290;
    (&#24444;&#12425;&#12399;&#12289;&#26032;&#27231;&#33021;&#12420;&#12289;&#12496;&#12464;&#20462;&#27491;&#12398;&#24681;&#24693;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12434;&#25511;&#12360;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;)
    &#12383;&#12384;&#12289;&#29702;&#30001;&#12364;&#20309;&#12391;&#12354;&#12428;&#12289;&#24444;&#12425;&#12399;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12434;&#12392;&#12390;&#12418;&#24910;&#37325;&#12395;&#34892;&#12358;&#12392;&#27770;&#12417;&#12383;&#12384;&#12369;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364; 1.1.0 &#12398;&#12522;&#12522;&#12540;&#12473;&#12434;&#30446;&#21069;&#12395;&#12375;&#12390; 1.0.3 &#12391;&#37325;&#22823;&#12394;&#12496;&#12464;&#12434;&#30330;&#35211;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;
    &#12385;&#12423;&#12387;&#12392;&#21427;&#12375;&#12356;&#12391;&#12377;&#12364; 1.1.0 &#12391;&#12381;&#12398;&#20462;&#27491;&#12434;&#34892;&#12356;&#12289;
    &#12377;&#12409;&#12390;&#12398; 1.0.x &#31995;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12434;&#25512;&#22888;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12398;&#22580;&#21512;&#12289;1.1.0 &#12392; 1.0.4 &#12434;&#20001;&#26041;&#12522;&#12522;&#12540;&#12473;&#12375;&#12383;&#12392;&#12375;&#12390;&#12289;&#38283;&#30330;&#32773;&#12392;&#12518;&#12540;&#12470;&#12540;&#12398;&#21452;&#26041;&#12364;&#12495;&#12483;&#12500;&#12540;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
    &#12381;&#12358;&#12391;&#12399;&#12394;&#12356;&#12391;&#12377;&#12424;&#12397;&#12290;
</p><p>
    1.1.x &#12521;&#12452;&#12531;&#12398;&#32173;&#25345;&#12364;&#12358;&#12414;&#12367;&#12356;&#12367;&#12392;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399; 1.0.x &#12521;&#12452;&#12531;&#12398; <em class="firstterm">&#32173;&#25345;&#12434;&#12420;&#12417;&#12427;</em> &#12392;&#23459;&#35328;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#23459;&#35328;&#12399;&#20844;&#24335;&#12394;&#12418;&#12398;&#12392;&#12375;&#12390;&#34892;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;&#12381;&#12398;&#21578;&#30693;&#12399;&#21336;&#29420;&#12391;&#34892;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;
    1.1.x &#12521;&#12452;&#12531;&#12398;&#12522;&#12522;&#12540;&#12473;&#21578;&#30693;&#12392;&#19968;&#32210;&#12395;&#34892;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12393;&#12398;&#26041;&#27861;&#12434;&#12392;&#12427;&#12395;&#12375;&#12390;&#12418;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12399;&#21476;&#12356;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12364;&#32173;&#25345;&#12373;&#12428;&#12394;&#12367;&#12394;&#12427;&#12371;&#12392;&#12434;&#30693;&#12425;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12398;&#21578;&#30693;&#12395;&#24467;&#12387;&#12390;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12434;&#12377;&#12427;&#27770;&#26029;&#12364;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#20197;&#21069;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12398;&#12469;&#12509;&#12540;&#12488;&#12434;&#20445;&#35388;&#12377;&#12427;&#26399;&#38291;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#25991;&#33032;&#12391;&#12356;&#12360;&#12400;&#12289;"&#12469;&#12509;&#12540;&#12488;" &#12392;&#12399;&#12381;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12395;&#23550;&#12377;&#12427;&#12496;&#12464;&#22577;&#21578;&#12434;&#21463;&#12369;&#20184;&#12369;&#12289;
    &#12496;&#12464;&#12364;&#21313;&#20998;&#20986;&#23613;&#12367;&#12377;&#12414;&#12391;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12391;&#12289;&#26126;&#31034;&#30340;&#12395;&#12469;&#12509;&#12540;&#12488;&#26399;&#38291;&#12399;&#35373;&#23450;&#12375;&#12394;&#12356;&#12418;&#12398;&#12398;&#12289;
    &#21476;&#12356;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#25968;&#12434;&#25226;&#25569;&#12377;&#12427;&#12383;&#12417;&#12289;
    &#12496;&#12464;&#22577;&#21578;&#12398;&#25968;&#12434;&#35211;&#24373;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#21476;&#12356;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#20351;&#12358;&#12518;&#12540;&#12470;&#12540;&#12398;&#29575;&#12364;&#12354;&#12427;&#20516;&#12424;&#12426;&#19979;&#12364;&#12387;&#12383;&#26178;&#28857;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12381;&#12398;&#12521;&#12452;&#12531;&#12398;&#32173;&#25345;&#12434;&#12420;&#12417;&#12427;&#12392;&#23459;&#35328;&#12375;&#12289;&#12469;&#12509;&#12540;&#12488;&#12434;&#12420;&#12417;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12358;&#12372;&#12392;&#12395;&#12289;&#24517;&#12378; <em class="firstterm">&#12479;&#12540;&#12466;&#12483;&#12488;&#12496;&#12540;&#12472;&#12519;&#12531;</em> &#12414;&#12383;&#12399; <em class="firstterm">&#12479;&#12540;&#12466;&#12483;&#12488;&#12392;&#12394;&#12427;&#12510;&#12452;&#12523;&#12473;&#12488;&#12540;&#12531;</em> &#12434;&#12496;&#12464;&#22577;&#21578;&#12471;&#12473;&#12486;&#12512;&#12395;&#35373;&#23450;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#36969;&#20999;&#12394;&#12522;&#12522;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#12496;&#12464;&#12434;&#22577;&#21578;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#20013;&#12398;&#26368;&#26032;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;
     "development" &#12420; "latest" &#12392;&#21628;&#12400;&#12428;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#21517;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12518;&#12540;&#12470;&#12540;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289; &#8212; &#27963;&#30330;&#12394;&#38283;&#30330;&#32773;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435; &#8212; &#20844;&#24335;&#12394;&#12522;&#12522;&#12540;&#12473;&#12424;&#12426;&#26032;&#12375;&#12356;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;"><div class="titlepage"><div><div><h3 class="title"><a name="security-releases"></a>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;</h3></div></div></div><p>
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12431;&#12427;&#12496;&#12464;&#12434;&#25201;&#12358;&#26041;&#27861;&#12398;&#35443;&#32048;&#12399;<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12398; </span> <a class="xref" href="publicity.html#security" title="&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;">&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12398;&#21578;&#30693;&#12301;</a> &#12391;&#25201;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12358;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;&#29305;&#12395;&#35696;&#35542;&#12377;&#12409;&#12365;&#12371;&#12392;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    <em class="firstterm">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;</em> &#12392;&#12399;&#12289;
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#33030;&#24369;&#24615;&#12434;&#20462;&#27491;&#12377;&#12427;&#12383;&#12417;&#12384;&#12369;&#12395;&#34892;&#12431;&#12428;&#12427;&#12522;&#12522;&#12540;&#12473;&#12391;&#12377;&#12290;
    &#33030;&#24369;&#24615;&#12434;&#20462;&#27491;&#12375;&#12383;&#12467;&#12540;&#12489;&#12399;&#12522;&#12522;&#12540;&#12473;&#12364;&#20844;&#12395;&#12394;&#12427;&#12414;&#12391;&#26126;&#12425;&#12363;&#12395;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12428;&#12399;&#20462;&#27491;&#12364;&#12522;&#12522;&#12540;&#12473;&#12398;&#26085;&#12414;&#12391;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12467;&#12511;&#12483;&#12488;&#12391;&#12365;&#12394;&#12356;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#12414;&#12391;&#20844;&#12398;&#22580;&#12391;&#12486;&#12473;&#12488;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12418;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#12289;&#24403;&#28982;&#12398;&#12371;&#12392;&#12394;&#12364;&#12425;&#33258;&#20998;&#12383;&#12385;&#12391;&#20462;&#27491;&#31623;&#25152;&#12434;&#35519;&#12409;&#12289;&#20869;&#37096;&#12391;&#12486;&#12473;&#12488;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
    &#24195;&#12367;&#12518;&#12540;&#12470;&#12540;&#12395;&#12486;&#12473;&#12488;&#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#12424;&#12358;&#12395;&#12486;&#12473;&#12488;&#12364;&#19981;&#36275;&#12377;&#12427;&#12371;&#12392;&#12363;&#12425;&#12289;
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;&#12399;&#24120;&#12395;&#26082;&#12395;&#23384;&#22312;&#12377;&#12427;&#12522;&#12522;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#20462;&#27491;&#12434;&#34892;&#12356;&#12289;
    &#12381;&#12428;&#20197;&#22806;&#12395;&#12399; <span class="emphasis"><em>&#20309;&#12418;&#22793;&#26356;&#12375;&#12394;&#12356;</em></span> &#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12486;&#12473;&#12488;&#12394;&#12375;&#12395;&#22810;&#12367;&#12398;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12377;&#12428;&#12400;&#12377;&#12427;&#12411;&#12393;&#12289;&#26032;&#12375;&#12356;&#12496;&#12464;&#12364;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#39640;&#12367;&#12394;&#12427;&#12358;&#12360;&#12289;
    &#26032;&#12375;&#12356;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#33030;&#24369;&#24615;&#12364;&#30330;&#29983;&#12377;&#12427;&#21487;&#33021;&#24615;&#12377;&#12425;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#65281;
    &#12371;&#12398;&#20445;&#23432;&#30340;&#12394;&#12420;&#12426;&#26041;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#20462;&#27491;&#12434;&#23637;&#38283;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#20462;&#27491;&#12392;&#12381;&#12428;&#20197;&#22806;&#12398;&#20462;&#27491;&#12434;&#21516;&#26178;&#12395;&#12510;&#12471;&#12531;&#12395;&#23637;&#38283;&#12375;&#12394;&#12356;&#12392;&#12356;&#12358;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12509;&#12522;&#12471;&#12540;&#12434;&#25345;&#12388;&#31649;&#29702;&#32773;&#12395;&#12418;&#39348;&#26579;&#12415;&#12420;&#12377;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12522;&#12522;&#12540;&#12473;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#12289;&#12518;&#12540;&#12470;&#12540;&#12434;&#12385;&#12423;&#12387;&#12392;&#39449;&#12377;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364; 1.1.3 &#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21521;&#12369;&#12390;&#21205;&#12356;&#12390;&#12356;&#12390;&#12289;
    1.1.2 &#12395;&#23550;&#12377;&#12427;&#12496;&#12464;&#20462;&#27491;&#12434;&#34892;&#12358;&#12392;&#20844;&#12395;&#23459;&#35328;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12289;
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12431;&#12427;&#12496;&#12464;&#22577;&#21578;&#12364;&#34892;&#12431;&#12428;&#12383;&#22580;&#21512;&#12391;&#12377;&#12290;
    &#24403;&#28982;&#12289;&#38283;&#30330;&#32773;&#36948;&#12399;&#12381;&#12398;&#20462;&#27491;&#12364;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12427;&#12414;&#12391;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#35441;&#12377;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12381;&#12398;&#12392;&#12365;&#12414;&#12391; 1.1.3 &#12399;&#35336;&#30011;&#36890;&#12426; 1.1.2 &#12398;&#12496;&#12464;&#20462;&#27491;&#12364;&#21547;&#12414;&#12428;&#12383;&#12418;&#12398;&#12395;&#12394;&#12427;&#12392;&#35328;&#12356;&#32154;&#12369;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#23455;&#38555;&#12395; 1.1.3 &#12364;&#20986;&#12390;&#12415;&#12427;&#12392;&#12289;1.1.2 &#12395;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12398;&#20462;&#27491;&#12364;&#21152;&#12431;&#12387;&#12383;&#12371;&#12392;&#12384;&#12369;&#12364;&#22793;&#26356;&#28857;&#12391;&#12289;
    &#20182;&#12398;&#20462;&#27491;&#12399; 1.1.4 &#12395;&#20808;&#36865;&#12426;&#12373;&#12428;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;(&#12371;&#12428;&#12399;&#12418;&#12385;&#12429;&#12435;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12496;&#12464;&#12398;&#20462;&#27491;&#12395;&#21152;&#12360;&#12289;
    <span class="emphasis"><em>&#20182;&#12398;&#20462;&#27491;&#12418;</em></span> 1.1.4 &#12395;&#12399;&#21547;&#12414;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;)
</p><p>
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#20462;&#27491;&#12384;&#12369;&#12364;&#21547;&#12414;&#12428;&#12383;&#12522;&#12522;&#12540;&#12473;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12377;&#12383;&#12417;&#12395;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12395;&#36861;&#21152;&#12398;&#27083;&#25104;&#35201;&#32032;&#12434;&#21152;&#12360;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289; 1.1.2.1 &#12392;&#12356;&#12358;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12399;&#12289; 
    1.1.2 &#12395;&#23550;&#12375;&#12390;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20462;&#27491;&#12384;&#12369;&#12364;&#21152;&#12431;&#12387;&#12383;&#12522;&#12522;&#12540;&#12473;&#12384;&#12392;&#21306;&#21029;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#12381;&#12428;&#12424;&#12426; "&#22823;&#12365;&#12356;" &#12522;&#12522;&#12540;&#12473;&#30058;&#21495; (e.g. 1.1.3, 1.2.0 &#12394;&#12393;) &#12399;&#12289;
    &#21516;&#12376;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20462;&#27491;&#12364;&#21152;&#12360;&#12425;&#12428;&#12383;&#12522;&#12522;&#12540;&#12473;&#12391;&#12354;&#12427;&#12392;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
    &#19968;&#26041;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38291;&#36817;&#12391;&#36861;&#12356;&#12363;&#12369;&#12390;&#12356;&#12394;&#12356;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12399;3&#12388;&#12398;&#25968;&#23383;&#12391;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12364;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12395;&#12289;
    &#12521;&#12531;&#12480;&#12512;&#12395;&#12289;&#12392;&#12365;&#12393;&#12365;4&#12388;&#12398;&#30058;&#21495;&#12434;&#35211;&#12427;&#12392;&#23569;&#12375;&#28151;&#20081;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#31169;&#12364;&#35211;&#12390;&#12365;&#12383;&#12411;&#12392;&#12435;&#12393;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#30058;&#21495;&#12434;&#19968;&#36011;&#12373;&#12379;&#12427;&#26041;&#37341;&#12434;&#25505;&#29992;&#12375;&#12289;
    &#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#20462;&#27491;&#12364;&#21547;&#12414;&#12428;&#12383;&#12522;&#12522;&#12540;&#12473;&#12398;&#22580;&#21512;&#12418;&#12289;
    &#12383;&#12392;&#12360;&#12381;&#12428;&#12364;&#20182;&#12398;&#12522;&#12522;&#12540;&#12473;&#35336;&#30011;&#12434;&#30058;&#21495;&#12402;&#12392;&#12388;&#20998;&#12378;&#12425;&#12377;&#12371;&#12392;&#12434;&#24847;&#21619;&#12377;&#12427;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#26368;&#26032;&#12522;&#12522;&#12540;&#12473;&#12398;&#27425;&#12398;&#30058;&#21495;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="testing-and-releasing.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="releases-and-daily-development.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;</td></tr></table></div></body></html>
