<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>RSS &#12501;&#12451;&#12540;&#12489;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="irc.html" title="IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;"><link rel="next" href="wikis.html" title="Wiki"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">RSS &#12501;&#12451;&#12540;&#12489;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="irc.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="wikis.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="RSS &#12501;&#12451;&#12540;&#12489;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="rss"></a>RSS &#12501;&#12451;&#12540;&#12489;</h2></div></div></div><p>
  <em class="firstterm">RSS</em> (Really Simple Syndication)
  &#12399;&#12289;&#12491;&#12517;&#12540;&#12473;&#12398;&#27010;&#35201;&#12434;&#34920;&#12377;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434; "&#36092;&#35501;&#32773;" &#12395;&#37197;&#20449;&#12377;&#12427;&#12383;&#12417;&#12398;&#20181;&#32068;&#12415;&#12391;&#12377;&#12290;
  "&#36092;&#35501;&#32773;" &#12392;&#12399;&#12289;&#12381;&#12398;&#27010;&#35201;&#12434;&#21463;&#20449;&#12375;&#12383;&#12356;&#12392;&#12356;&#12358;&#24847;&#24605;&#12434;&#31034;&#12375;&#12383;&#20154;&#12383;&#12385;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  RSS &#12477;&#12540;&#12473;&#12398;&#12371;&#12392;&#12434;&#36890;&#24120;&#12399; <em class="firstterm">&#12501;&#12451;&#12540;&#12489;</em> &#12392;&#21628;&#12403;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#12501;&#12451;&#12540;&#12489;&#12434;&#36092;&#35501;&#12377;&#12427;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#12371;&#12392;&#12434;
  <em class="firstterm">&#12501;&#12451;&#12540;&#12489;&#12522;&#12540;&#12480;&#12540;</em> &#12420;
  <em class="firstterm">&#12501;&#12451;&#12540;&#12489;&#12450;&#12464;&#12522;&#12466;&#12540;&#12479;</em> &#12394;&#12393;&#12392;&#12356;&#12356;&#12414;&#12377;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398; RSS &#12522;&#12540;&#12480;&#12540;&#12392;&#12375;&#12390;&#12399;&#12289;&#12383;&#12392;&#12360;&#12400;
  <a class="ulink" href="http://www.rssbandit.org/" target="_top">RSS Bandit</a> &#12420;&#12289;
  &#12381;&#12398;&#12414;&#12435;&#12414;&#12398;&#21517;&#21069;&#12391;&#12354;&#12427; <a class="ulink" href="http://www.feedreader.com/" target="_top">Feedreader</a>
  &#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12371;&#12391;&#12399;&#12289;RSS &#12395;&#12388;&#12356;&#12390;&#12398;&#25216;&#34899;&#30340;&#12394;&#35443;&#32048;&#12434;&#35500;&#26126;&#12377;&#12427;&#12371;&#12392;&#12399;&#25511;&#12360;&#12414;&#12377;
  <sup>[<a name="idp1312480" href="#ftn.idp1312480" class="footnote">22</a>]</sup>&#12364;&#12289;&#27425;&#12398;&#12405;&#12383;&#12388;&#12399;&#12375;&#12387;&#12363;&#12426;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12378;&#12289;&#36092;&#35501;&#32773;&#12364;&#12501;&#12451;&#12540;&#12489;&#12522;&#12540;&#12480;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#36092;&#35501;&#12375;&#12390;&#12356;&#12427;&#12501;&#12451;&#12540;&#12489;&#12434;
  <span class="emphasis"><em>&#21516;&#12376;&#12424;&#12358;&#12395;</em></span> &#25201;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12364; RSS &#12398;&#12475;&#12540;&#12523;&#12473;&#12509;&#12452;&#12531;&#12488;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
  &#20309;&#12363;&#12402;&#12392;&#12388;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#36984;&#25246;&#12377;&#12428;&#12400;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#12501;&#12451;&#12540;&#12489;&#12364;&#21516;&#12376;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12391;&#20351;&#29992;&#12391;&#12365;&#12289;
  &#37197;&#20449;&#12373;&#12428;&#12427;&#20869;&#23481;&#12395;&#38598;&#20013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#27425;&#12395;&#12289;RSS &#12399;&#20170;&#12420;&#12354;&#12425;&#12422;&#12427;&#12392;&#12371;&#12429;&#12391;&#21033;&#29992;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399;&#30693;&#12425;&#12378;&#30693;&#12425;&#12378;&#12398;&#12358;&#12385;&#12395;&#12381;&#12428;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#19990;&#38291;&#19968;&#33324;&#12398;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;RSS &#12392;&#12356;&#12358;&#12398;&#12399;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#19978;&#12398;
  "&#12371;&#12398;&#12469;&#12452;&#12488;&#12434;&#36092;&#35501;" &#12392;&#12363; "&#12491;&#12517;&#12540;&#12473;&#12501;&#12451;&#12540;&#12489;" &#12392;&#12363;&#35328;&#12358;&#12385;&#12387;&#12385;&#12419;&#12394;&#12508;&#12479;&#12531;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12428;&#12400;&#12289;&#12501;&#12451;&#12540;&#12489;&#12522;&#12540;&#12480;&#12540;
  (&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12395;&#22475;&#12417;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12524;&#12483;&#12488;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;)
  &#12399;&#33258;&#21205;&#30340;&#12395;&#12381;&#12398;&#12469;&#12452;&#12488;&#12398;&#12491;&#12517;&#12540;&#12473;&#12398;&#26356;&#26032;&#24773;&#22577;&#12434;&#21462;&#24471;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12425;&#12434;&#36367;&#12414;&#12360;&#12427;&#12392;&#12289;&#12354;&#12394;&#12383;&#12364;&#36939;&#21942;&#12377;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12362;&#12381;&#12425;&#12367;
  RSS &#12501;&#12451;&#12540;&#12489;&#12434;&#25552;&#20379;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;
  (&#12354;&#12425;&#12363;&#12376;&#12417;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;
   &#8212; <a class="xref" href="web-site.html#canned-hosting" title="&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;">&#12300;&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12301;</a>
  &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356; &#8212; &#12398;&#22810;&#12367;&#12399;&#12289;&#12371;&#12398;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;)&#12290;
  &#19968;&#26085;&#12395;&#12394;&#12435;&#12393;&#12418;&#12491;&#12517;&#12540;&#12473;&#12434;&#25237;&#31295;&#12375;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12383;&#12425;&#12289;&#36092;&#35501;&#32773;&#12383;&#12385;&#12399;
  &#12393;&#12428;&#12364;&#26412;&#24403;&#12395;&#22823;&#20999;&#12394;&#12491;&#12517;&#12540;&#12473;&#12394;&#12398;&#12363;&#12434;&#21028;&#26029;&#12391;&#12365;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12354;&#12414;&#12426;&#12395;&#12418;&#22823;&#37327;&#12398;&#12491;&#12517;&#12540;&#12473;&#12364;&#25237;&#31295;&#12373;&#12428;&#12427;&#12392;&#12289;
  &#12381;&#12398;&#12501;&#12451;&#12540;&#12489;&#12434;&#28961;&#35222;&#12373;&#12428;&#12390;&#12375;&#12414;&#12387;&#12383;&#12426;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#33145;&#12364;&#31435;&#12387;&#12390;&#12381;&#12398;&#12501;&#12451;&#12540;&#12489;&#12398;&#36092;&#35501;&#12434;&#12420;&#12417;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#29702;&#24819;&#12434;&#35328;&#12360;&#12400;&#12289;&#29992;&#36884;&#12395;&#24540;&#12376;&#12390;&#20491;&#21029;&#12398;&#12501;&#12451;&#12540;&#12489;&#12434;&#25552;&#20379;&#12377;&#12427;&#12398;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#22823;&#20107;&#12394;&#21578;&#30693;&#29992;&#12398;&#12501;&#12451;&#12540;&#12489;&#12289;&#12383;&#12392;&#12360;&#12400;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#29992;&#12398;&#12501;&#12451;&#12540;&#12489;&#12289;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#25237;&#31295;&#29992;&#12398;&#12501;&#12451;&#12540;&#12489;&#12394;&#12392;&#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12391;&#12377;&#12290;
  &#12392;&#12399;&#35328;&#12360;&#12289;&#23455;&#38555;&#12395;&#12371;&#12428;&#12434;&#12377;&#12427;&#12398;&#12399;&#22823;&#22793;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#35370;&#12428;&#12427;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12418;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#32773;&#12395;&#12392;&#12387;&#12390;&#12418;&#12289;
  &#20309;&#12434;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#28151;&#20081;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12488;&#12483;&#12503;&#12506;&#12540;&#12472;&#12395;&#12399; RSS &#12501;&#12451;&#12540;&#12489;&#12434;&#25552;&#20379;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#12501;&#12451;&#12540;&#12489;&#12391;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#24773;&#22577;&#12420;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35686;&#21578;&#12392;&#12356;&#12387;&#12383;&#37325;&#35201;&#12394;&#21578;&#30693;&#12434;&#37197;&#20449;&#12375;&#12414;&#12377;&#12290;
  <sup>[<a name="idp1282800" href="#ftn.idp1282800" class="footnote">23</a>]</sup>
</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1312480" href="#idp1312480" class="para">22</a>] </sup>
      &#35443;&#32048;&#12399;
      <a class="ulink" href="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html" target="_top">http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html</a>
      &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp1282800" href="#idp1282800" class="para">23</a>] </sup>
      &#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#26360;&#31821;&#12392;&#12375;&#12390;&#20986;&#29256;&#12373;&#12428;&#12383;&#21021;&#29256;&#12395;&#12399;&#23384;&#22312;&#12375;&#12414;&#12379;&#12435;&#12290;
      Brian Aker &#12398;&#12502;&#12525;&#12464;&#12398;&#12456;&#12531;&#12488;&#12522;
      <a class="ulink" href="http://krow.livejournal.com/564980.html" target="_top">"Release Criteria, Open Source, Thoughts On..."</a>
      &#12434;&#35501;&#12435;&#12391;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427; RSS &#12501;&#12451;&#12540;&#12489;&#12398;&#26377;&#29992;&#24615;&#12395;&#27671;&#12389;&#12356;&#12383;&#12398;&#12391;&#36861;&#35352;&#12375;&#12414;&#12375;&#12383;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="irc.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="wikis.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> Wiki</td></tr></table></div></body></html>
