<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;"><link rel="prev" href="license-quickstart.html" title="&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992;"><link rel="next" href="announcing.html" title="&#24195;&#22577;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="license-quickstart.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</th><td width="20%" align="right"> <a accesskey="n" href="announcing.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="setting-tone"></a>&#12358;&#12414;&#12367;&#24341;&#12387;&#24373;&#12387;&#12390;&#12356;&#12367;</h2></div></div></div><p>
  &#12371;&#12371;&#12414;&#12391;&#21462;&#12426;&#19978;&#12370;&#12390;&#12365;&#12383;&#12398;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#26178;&#12395;&#19968;&#24230;&#12384;&#12369;&#24517;&#35201;&#12392;&#12394;&#12427;&#20316;&#26989;&#12391;&#12375;&#12383;&#12290;
  &#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12420;&#26368;&#21021;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#20316;&#25104;&#12394;&#12393;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#38283;&#22987;&#26178;&#12395;&#26368;&#12418;&#22823;&#20999;&#12394;&#12398;&#12399;&#12289;&#12381;&#12428;&#20197;&#22806;&#12398;&#21205;&#30340;&#12394;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#27770;&#12417;&#12427;&#12394;&#12435;&#12390;&#12356;&#12358;&#12398;&#12399;&#31777;&#21336;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12391;&#12418;&#12289;&#12381;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12398;&#12420;&#12426;&#21462;&#12426;&#12434;&#26377;&#30410;&#12391;&#21069;&#21521;&#12365;&#12394;&#12418;&#12398;&#12395;&#20445;&#12388;&#12398;&#12399;
  &#12381;&#12428;&#12392;&#12399;&#12414;&#12387;&#12383;&#12367;&#21029;&#12398;&#35441;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#20309;&#24180;&#12395;&#12418;&#12431;&#12383;&#12387;&#12390;&#31038;&#20869;&#12398;&#38281;&#12376;&#12383;&#29872;&#22659;&#12391;&#38283;&#30330;&#12364;&#36914;&#12417;&#12425;&#12428;&#12390;&#12365;&#12383;&#12418;&#12398;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#12392;&#12289;
  &#12381;&#12398;&#38283;&#30330;&#12503;&#12525;&#12475;&#12473;&#12399;&#12371;&#12428;&#12414;&#12391;&#12392;&#12399;&#12363;&#12431;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12414;&#12391;&#12398;&#38283;&#30330;&#32773;&#12383;&#12385;&#12395;&#23550;&#12375;&#12390;&#12289;
  &#12381;&#12398;&#22793;&#26356;&#12395;&#23550;&#24540;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#28310;&#20633;&#12434;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#26368;&#12418;&#22256;&#38627;&#12394;&#12398;&#12364;&#12289;&#12399;&#12376;&#12417;&#12398;&#19968;&#27497;&#12391;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#20170;&#24460;&#12398;&#26041;&#21521;&#24615;&#12395;&#38306;&#12377;&#12427;&#20808;&#20363;&#12418;&#12394;&#12369;&#12428;&#12400;
  &#20170;&#24460;&#12393;&#12398;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12367;&#12398;&#12363;&#12418;&#12414;&#12384;&#12399;&#12387;&#12365;&#12426;&#12431;&#12363;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#23433;&#23450;&#24615;&#12399;&#12289;&#24418;&#24335;&#24373;&#12387;&#12383;&#26041;&#37341;&#12363;&#12425;&#12367;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#38283;&#30330;&#32773;&#12398;&#38291;&#12391;&#24464;&#12293;&#12395;&#12391;&#12365;&#12354;&#12364;&#12387;&#12390;&#12356;&#12367;&#38598;&#21512;&#30693;&#12395;&#12424;&#12387;&#12390;&#12418;&#12383;&#12425;&#12373;&#12428;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12371;&#12428;&#12399;&#12375;&#12387;&#12363;&#12426;&#12392;&#12425;&#12360;&#12395;&#12367;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#26126;&#25991;&#21270;&#12373;&#12428;&#12383;&#35215;&#21063;&#12364;&#12354;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12381;&#12428;&#12399;&#12383;&#12356;&#12390;&#12356;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#26412;&#24403;&#12395;&#21205;&#12363;&#12375;&#12390;&#12356;&#12427;&#12371;&#12428;&#12425;&#12398;&#28961;&#24418;&#12398;&#21512;&#24847;&#12434;&#12414;&#12392;&#12417;&#12354;&#12370;&#12383;&#12418;&#12398;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
  &#26126;&#25991;&#21270;&#12373;&#12428;&#12383;&#26041;&#37341;&#12395;&#12424;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25991;&#21270;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12375;&#12289;
  &#12381;&#12428;&#12395;&#36817;&#12389;&#12367;&#12371;&#12392;&#12373;&#12360;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12395;&#12399;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#29702;&#30001;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#25104;&#38263;&#12392;&#22793;&#21270;&#12398;&#36895;&#12373;&#12399;&#12289;&#20154;&#12364;&#32771;&#12360;&#12427;&#12411;&#12393;&#12395;&#12399;&#25991;&#21270;&#12398;&#33988;&#31309;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12414;&#12379;&#12435;&#12290;
  &#22793;&#21270;&#12398;&#36895;&#24230;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#39640;&#36895;&#12395;&#12394;&#12425;&#12394;&#12356;&#38480;&#12426;&#12289;&#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#12381;&#12428;&#12434;&#23398;&#12406;&#26178;&#38291;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#23398;&#12403;&#32066;&#12360;&#12383;&#24460;&#12399;&#12289;&#33258;&#20998;&#33258;&#36523;&#12391;&#12381;&#12398;&#12420;&#12426;&#12363;&#12383;&#12434;&#35036;&#24375;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#31461;&#35617;&#12364;&#12289;&#12356;&#12387;&#12383;&#12356;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#20309;&#30334;&#24180;&#12418;&#27468;&#12356;&#32153;&#12364;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#29694;&#22312;&#12398;&#23376;&#12393;&#12418;&#12383;&#12385;&#12364;&#27468;&#12387;&#12390;&#12356;&#12427;&#31461;&#35617;&#12399;&#12289;&#22522;&#26412;&#30340;&#12395;&#12399;&#25968;&#30334;&#24180;&#21069;&#12398;&#23376;&#12393;&#12418;&#12383;&#12385;&#12398;&#27468;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#26132;&#12398;&#23376;&#12393;&#12418;&#12383;&#12385;&#12364;&#31461;&#35617;&#12434;&#27468;&#12387;&#12390;&#12356;&#12383;&#38915;&#12395;&#12399;&#29694;&#22312;&#12398;&#23376;&#12393;&#12418;&#12383;&#12385;&#12399;&#12414;&#12384;&#29987;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#23376;&#12393;&#12418;&#12383;&#12385;&#12399;&#12381;&#12398;&#27468;&#12434;&#24180;&#38263;&#32773;&#12363;&#12425;&#32862;&#12356;&#12390;&#35226;&#12360;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#23376;&#12393;&#12418;&#12383;&#12385;&#12364;&#25104;&#38263;&#12377;&#12427;&#12392;&#12289;
  &#24180;&#23569;&#32773;&#12398;&#21069;&#12391;&#12381;&#12428;&#12434;&#27468;&#12387;&#12390;&#32862;&#12363;&#12379;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#12289;
  &#23376;&#12393;&#12418;&#12383;&#12385;&#12399;&#24847;&#35672;&#30340;&#12395;&#12381;&#12358;&#12377;&#12427;&#12424;&#12358;&#25351;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20309;&#30334;&#24180;&#12418;&#21516;&#12376;&#27468;&#12364;&#27468;&#12356;&#32153;&#12364;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#20107;&#23455;&#12399;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#20253;&#25215;&#12364;&#24120;&#12395;&#32368;&#12426;&#36820;&#12375;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27508;&#21490;&#12364;&#20170;&#24460;&#20309;&#30334;&#24180;&#12418;&#32154;&#12367;&#12363;&#12393;&#12358;&#12363;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;
  (&#12393;&#12358;&#12394;&#12427;&#12363;&#12399;&#12414;&#12384;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;) &#12364;&#12289;&#12371;&#12398;&#20181;&#32068;&#12415;&#12399;&#20284;&#12383;&#12426;&#23492;&#12387;&#12383;&#12426;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#22238;&#36578;&#29575;&#12399;&#12424;&#12426;&#39640;&#36895;&#12395;&#12394;&#12427;&#12398;&#12391;&#12289;
  &#12424;&#12426;&#27963;&#30330;&#12363;&#12388;&#24910;&#37325;&#12395;&#20253;&#25215;&#12434;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12371;&#12398;&#21205;&#12365;&#12399;&#12289;&#20154;&#12364;&#22522;&#26412;&#30340;&#12395;&#31038;&#20250;&#35215;&#31684;&#12434;&#27714;&#12417;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#24615;&#36074;&#12364;&#12354;&#12427;&#12398;&#12391;&#25104;&#21151;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12371;&#12381;&#12364;&#20154;&#12364;&#23384;&#22312;&#12377;&#12427;&#29702;&#30001;&#12394;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#19968;&#33324;&#30340;&#12394;&#26041;&#27861;&#12391;&#12414;&#12392;&#12417;&#12354;&#12370;&#12425;&#12428;&#12383;&#38598;&#22243;&#12394;&#12425;&#12289;&#12381;&#12371;&#12395;&#21442;&#21152;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#20154;&#12293;&#12399;
  &#26412;&#33021;&#30340;&#12395;&#12381;&#12398;&#38598;&#22243;&#12398;&#19968;&#21729;&#12392;&#12375;&#12390;&#25391;&#12427;&#33310;&#12358;&#12383;&#12417;&#12398;&#12420;&#12426;&#12363;&#12383;&#12434;&#35211;&#12388;&#12369;&#12424;&#12358;&#12392;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12424;&#12426;&#26089;&#12356;&#26178;&#26399;&#12395;&#20808;&#20363;&#12434;&#30906;&#31435;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24441;&#31435;&#12388;
  &#12300;&#12464;&#12523;&#12540;&#12503;&#12392;&#12375;&#12390;&#12398;&#12301;&#25391;&#12427;&#33310;&#12356;&#12434;&#20316;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12356;&#12387;&#12383;&#12435;&#12391;&#12365;&#12354;&#12364;&#12387;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;
  &#12354;&#12392;&#12399;&#21213;&#25163;&#12395;&#12381;&#12428;&#12364;&#24195;&#12414;&#12387;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#20197;&#19979;&#12395;&#31034;&#12377;&#12356;&#12367;&#12388;&#12363;&#12398;&#20363;&#12399;&#12289;
  &#12424;&#12426;&#12424;&#12356;&#20808;&#20363;&#12434;&#20316;&#12427;&#12383;&#12417;&#12395;&#12391;&#12365;&#12427;&#20855;&#20307;&#30340;&#12394;&#12371;&#12392;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12384;&#12369;&#12434;&#34892;&#12360;&#12400;&#23436;&#20840;&#12384;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#21336;&#12395;&#12289;
  &#12300;&#26089;&#12356;&#12358;&#12385;&#12395;&#21332;&#21147;&#30340;&#12394;&#12512;&#12540;&#12489;&#12434;&#20316;&#12426;&#19978;&#12370;&#12390;&#12362;&#12367;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12424;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#35500;&#26126;&#12377;&#12427;&#12383;&#12417;&#12384;&#12369;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#29289;&#29702;&#30340;&#12395;&#12399;&#12289;&#20491;&#12293;&#12398;&#38283;&#30330;&#32773;&#12364;&#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#22580;&#25152;&#12391;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12414;&#12427;&#12391;&#21516;&#12376;&#37096;&#23627;&#12391;&#19968;&#32210;&#12395;&#38283;&#30330;&#12375;&#12390;&#12356;&#12427;&#12363;&#12398;&#12424;&#12358;&#12395; <span class="emphasis"><em>&#24863;&#12376;&#12373;&#12379;&#12427;</em></span>
  &#12383;&#12417;&#12395;&#12289;&#12356;&#12429;&#12356;&#12429;&#12394;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12364;&#12371;&#12398;&#12424;&#12358;&#12395;&#24863;&#12376;&#12390;&#12367;&#12428;&#12428;&#12400;&#12367;&#12428;&#12427;&#12411;&#12393;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12424;&#12426;&#26178;&#38291;&#12434;&#12373;&#12365;&#12383;&#12356;&#12392;&#24605;&#12358;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20197;&#19979;&#12398;&#20363;&#12399;&#12289;Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488; (<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>)
  &#12363;&#12425;&#36984;&#12403;&#12414;&#12375;&#12383;&#12290;&#31169;&#12399;&#12289;&#38283;&#22987;&#24403;&#26178;&#12363;&#12425;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12425;&#12398;&#20363;&#12399;&#27770;&#12375;&#12390; Subversion &#29420;&#29305;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21516;&#27096;&#12398;&#29366;&#27841;&#12399;&#22823;&#21322;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#36215;&#12371;&#12426;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#29255;&#36275;&#12434;&#31361;&#12387;&#36796;&#12416;&#38555;&#12395;&#12399;&#24847;&#35672;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12400;&#12363;&#12426;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#20491;&#20154;&#30340;&#12394;&#35696;&#35542;&#12434;&#36991;&#12369;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="avoid-private-discussions"></a>&#20491;&#20154;&#30340;&#12394;&#35696;&#35542;&#12434;&#36991;&#12369;&#12427;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#19968;&#33324;&#12395;&#21521;&#12369;&#12390;&#20844;&#38283;&#12375;&#12383;&#24460;&#12391;&#12418;&#12289;&#38627;&#12375;&#12356;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12398;&#35441;&#12375;&#21512;&#12356;&#12399;
  &#20869;&#36650;&#12398;&#38306;&#20418;&#32773;&#12383;&#12385;&#12384;&#12369;&#12391;&#34892;&#12356;&#12383;&#12356;&#12392;&#32771;&#12360;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22987;&#12414;&#12387;&#12383;&#12400;&#12363;&#12426;&#12398;&#12392;&#12365;&#12395;&#12399;&#12354;&#12426;&#24471;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#35441;&#12375;&#21512;&#12358;&#12409;&#12365;&#12371;&#12392;&#12399;&#23665;&#12411;&#12393;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;&#36890;&#24120;&#12399;
  &#12381;&#12398;&#35441;&#12375;&#21512;&#12356;&#12395;&#21442;&#21152;&#12377;&#12427;&#36039;&#26684;&#12398;&#12354;&#12427;&#22806;&#37096;&#12398;&#21332;&#21147;&#32773;&#12399;&#12411;&#12392;&#12435;&#12393;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12391;&#35696;&#35542;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12427;&#12373;&#12414;&#12374;&#12414;&#12394;&#25613;&#22833;&#12364;&#12354;&#12394;&#12383;&#12398;&#38957;&#12398;&#20013;&#12395;&#28014;&#12363;&#12406;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12513;&#12540;&#12523;&#12391;&#12398;&#12420;&#12426;&#12392;&#12426;&#12395;&#29305;&#26377;&#12398;&#12398;&#12435;&#12403;&#12426;&#12375;&#12383;&#36895;&#24230;&#12289;
  &#21512;&#24847;&#12434;&#24418;&#25104;&#12377;&#12427;&#12398;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12289;&#26412;&#24403;&#12399;&#20309;&#12418;&#12431;&#12363;&#12387;&#12390;&#12356;&#12394;&#12356;&#12398;&#12395;
  &#12300;&#33258;&#20998;&#12399;&#12377;&#12409;&#12390;&#12431;&#12363;&#12387;&#12390;&#12356;&#12427;&#12301;&#12392;&#21208;&#36949;&#12356;&#12375;&#12390;&#12356;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12408;&#12398;&#23550;&#24540;
  (&#12393;&#12435;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12371;&#12398;&#25163;&#12398;&#20154;&#12364;&#12356;&#12414;&#12377;&#12290;&#24444;&#12425;&#12398;&#12358;&#12385;&#20309;&#20154;&#12363;&#12399;&#23558;&#26469;&#12377;&#12400;&#12425;&#12375;&#12356;&#36002;&#29486;&#12434;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#20013;&#12395;&#12399;&#12378;&#12387;&#12392;&#21208;&#36949;&#12356;&#12375;&#12383;&#12414;&#12414;&#12398;&#20154;&#12384;&#12387;&#12390;&#12356;&#12414;&#12377;)&#12289;&#12354;&#12427;&#21839;&#38988; X &#12364;&#12424;&#12426;&#22823;&#12365;&#12356;&#21839;&#38988; Y &#12398;&#19968;&#37096;&#12391;&#12354;&#12427;&#12392;&#12365;&#12395;&#12289;
  &#12394;&#12380;&#21839;&#38988; Y &#12391;&#12399;&#12394;&#12367;&#21839;&#38988; X &#12384;&#12369;&#12434;&#35299;&#27770;&#12375;&#12383;&#12356;&#12398;&#12363;&#12434;&#29702;&#35299;&#12375;&#12390;&#12367;&#12428;&#12394;&#12356;&#20154;&#12383;&#12385;&#12289;
  &#12394;&#12393;&#12394;&#12393;&#12290;&#12371;&#12435;&#12394;&#12392;&#12365;&#12395;&#12289;&#23494;&#23460;&#12398;&#35441;&#12375;&#21512;&#12356;&#12391;&#27770;&#12417;&#12383;&#20869;&#23481;&#12434; "&#26082;&#25104;&#20107;&#23455; (<span class="foreignphrase"><em class="foreignphrase">faits accomplis</em></span>)"&#12289;
  &#12354;&#12427;&#12356;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#26377;&#21147;&#12394;&#36984;&#25246;&#32930;&#12392;&#12375;&#12390;&#25552;&#31034;&#12391;&#12365;&#12428;&#12400;&#12393;&#12435;&#12394;&#12395;&#27005;&#12394;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12391;&#12418;&#12289;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12383;&#12392;&#12360;&#20844;&#38283;&#12398;&#22580;&#12391;&#12398;&#35696;&#35542;&#12398;&#36914;&#34892;&#12364;&#36933;&#12367;&#12390;&#21380;&#20171;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#38263;&#12356;&#30446;&#12391;&#35211;&#12428;&#12400;&#12381;&#12428;&#12364;&#19968;&#30058;&#26395;&#12414;&#12375;&#12356;&#26041;&#27861;&#12391;&#12377;&#12290;
  &#37325;&#35201;&#12394;&#27770;&#23450;&#12434;&#20869;&#36650;&#12391;&#12371;&#12387;&#12381;&#12426;&#34892;&#12358;&#12398;&#12399;&#12289;&#12414;&#12427;&#12391;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;
  &#12300;&#36002;&#29486;&#32773;&#12424;&#12369;&#12473;&#12503;&#12524;&#12540;&#12301;&#12434;&#25391;&#12426;&#12414;&#12367;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#31192;&#23494;&#12398;&#21332;&#35696;&#20250;&#12364;&#12377;&#12409;&#12390;&#12398;&#37325;&#35201;&#12394;&#27770;&#23450;&#12434;&#34892;&#12358;&#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#29872;&#22659;&#12391;&#12399;&#12289;
  &#12420;&#12427;&#27671;&#12398;&#12354;&#12427;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12399;&#27770;&#12375;&#12390;&#12388;&#12356;&#12390;&#12371;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#20844;&#38283;&#12398;&#22580;&#12391;&#12398;&#35696;&#35542;&#12395;&#12399;&#12424;&#12356;&#21103;&#20316;&#29992;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
      &#12381;&#12398;&#35696;&#35542;&#12364;&#12289;&#26032;&#12375;&#12367;&#21442;&#21152;&#12377;&#12427;&#38283;&#30330;&#32773;&#12398;&#35347;&#32244;&#12420;&#25945;&#32946;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;
      &#12381;&#12398;&#35696;&#35542;&#12434;&#12356;&#12387;&#12383;&#12356;&#12393;&#12428;&#12384;&#12369;&#12398;&#20154;&#12364;&#27880;&#30446;&#12375;&#12390;&#12356;&#12427;&#12363;&#12399;&#27770;&#12375;&#12390;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#22823;&#21322;&#12398;&#20154;&#12383;&#12385;&#12399;&#21336;&#12394;&#12427;&#20621;&#35251;&#32773;&#12392;&#12375;&#12390;&#35211;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12289;
      &#40665;&#12387;&#12390;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12388;&#12356;&#12390;&#12398;&#24773;&#22577;&#12434;&#36861;&#12356;&#12363;&#12369;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    </p></li><li class="listitem"><p>
      &#12381;&#12398;&#35696;&#35542;&#12399;&#12289;<span class="emphasis"><em>&#12354;&#12394;&#12383;&#33258;&#36523;</em></span> &#12398;&#35347;&#32244;&#12395;&#12418;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12434;&#12289;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12354;&#12414;&#12426;&#35443;&#12375;&#12367;&#12394;&#12356;&#20154;&#12383;&#12385;&#12395;&#12418;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#35500;&#26126;&#12377;&#12427;&#12392;&#12356;&#12358;&#25216;&#34899;&#12434;&#30952;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
      &#12371;&#12428;&#12399;&#23455;&#38555;&#12395;&#24517;&#35201;&#12392;&#12394;&#12427;&#25216;&#34899;&#12391;&#12354;&#12426;&#12289;
      &#12377;&#12391;&#12395;&#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12388;&#12356;&#12390;&#29087;&#30693;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12392;&#35441;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12399;&#36523;&#12395;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    </p></li><li class="listitem"><p>
      &#35696;&#35542;&#12398;&#20869;&#23481;&#12392;&#12381;&#12398;&#32080;&#35542;&#12364;&#20844;&#38283;&#12373;&#12428;&#12383;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#27531;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#24460;&#12395;&#21516;&#12376;&#12424;&#12358;&#12394;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#21516;&#12376;&#35696;&#35542;&#12434;&#32368;&#12426;&#36820;&#12377;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#35443;&#32048;&#12399; <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span>
      &#12398; <a class="xref" href="growth.html#using-archives" title="&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;">&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#30446;&#12395;&#20184;&#12365;&#12420;&#12377;&#12367;&#12377;&#12427;&#26041;&#27861;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></li></ul></div><p>

</p><p>
  &#26368;&#24460;&#12395;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12398;&#35504;&#12363;&#12364;&#12381;&#12398;&#12420;&#12426;&#21462;&#12426;&#12395;&#23550;&#12375;&#12390;&#30495;&#12398;&#36002;&#29486;&#12434;&#12375;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12354;&#12394;&#12383;&#12364;&#24605;&#12356;&#12418;&#12375;&#12394;&#12363;&#12387;&#12383;&#26032;&#12383;&#12394;&#32771;&#12360;&#26041;&#12434;&#31034;&#12375;&#12390;&#12367;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12364;&#12393;&#12398;&#12367;&#12425;&#12356;&#12398;&#38971;&#24230;&#12391;&#36215;&#12371;&#12427;&#12398;&#12363;&#12399;&#26029;&#35328;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12467;&#12540;&#12489;&#12398;&#35079;&#38609;&#12373;&#12364;&#12393;&#12428;&#12367;&#12425;&#12356;&#12363;&#12289;&#12381;&#12375;&#12390;&#12393;&#12398;&#31243;&#24230;&#12398;&#23554;&#38272;&#30693;&#35672;&#12434;&#35201;&#12377;&#12427;&#12363;&#12395;&#12424;&#12387;&#12390;&#12418;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#31169;&#12398;&#12371;&#12428;&#12414;&#12391;&#12398;&#32076;&#39443;&#19978;&#12289;&#12381;&#12398;&#38971;&#24230;&#12399;&#12415;&#12394;&#12373;&#12435;&#12364;&#24605;&#12387;&#12390;&#12356;&#12427;&#12424;&#12426;&#12418;&#12363;&#12394;&#12426;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12289;&#31169;&#12383;&#12385; (&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38283;&#22987;&#12375;&#12383;&#24403;&#26178;&#12398;&#12513;&#12531;&#12496;&#12540;)
  &#12399;&#28145;&#12367;&#35079;&#38609;&#12394;&#12373;&#12414;&#12374;&#12414;&#12394;&#21839;&#38988;&#12395;&#30452;&#38754;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#31169;&#12383;&#12385;&#12399;&#20309;&#12534;&#26376;&#12418;&#24745;&#12415;&#32154;&#12369;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#29575;&#30452;&#12395;&#35328;&#12387;&#12390;&#12289;&#24403;&#26178;&#12391;&#12365;&#12383;&#12390;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12356;&#12427;&#12513;&#12531;&#12496;&#12540;&#12364;&#12371;&#12398;&#25163;&#12398;&#35696;&#35542;&#12395;&#36002;&#29486;&#12375;&#12390;&#12367;&#12428;&#12427;&#12392;&#12399;&#26399;&#24453;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12381;&#12371;&#12391;&#31169;&#12383;&#12385;&#12399;&#23433;&#26131;&#12394;&#26041;&#27861;&#12434;&#12392;&#12427;&#12371;&#12392;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;&#25216;&#34899;&#30340;&#12394;&#12450;&#12452;&#12487;&#12450;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12434;&#20491;&#20154;&#30340;&#12394;&#12513;&#12540;&#12523;&#12398;&#12420;&#12426;&#12392;&#12426;&#12391;&#34892;&#12358;&#12424;&#12358;&#12395;&#12375;&#12384;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#27096;&#23376;&#12434;&#21957;&#12366;&#20184;&#12369;&#12383;&#20154;
  <sup>[<a name="idp678736" href="#ftn.idp678736" class="footnote">13</a>]</sup>
  &#12363;&#12425;&#12300;&#35696;&#35542;&#12399;&#20844;&#38283;&#12373;&#12428;&#12383;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12375;&#12390;&#12367;&#12428;&#12301;
  &#12392;&#35328;&#12431;&#12428;&#12427;&#12414;&#12391;&#12289;&#12381;&#12398;&#29366;&#24907;&#12364;&#32154;&#12365;&#12414;&#12375;&#12383;&#12290;&#31169;&#12383;&#12385;&#12399;&#12381;&#12428;&#12434;&#21463;&#12369;&#20837;&#12428;&#12289;&#12381;&#12398;&#35441;&#38988;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#31227;&#21205;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#12392;&#12383;&#12435;&#12289;&#25968;&#12293;&#12398;&#27934;&#23519;&#12395;&#28288;&#12385;&#12383;&#24847;&#35211;&#12420;&#25552;&#26696;&#12364;&#23492;&#12379;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12289;&#31169;&#12383;&#12385;&#12399;&#39514;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#23492;&#12379;&#12425;&#12428;&#12383;&#24847;&#35211;&#12398;&#22810;&#12367;&#12399;&#12289;&#12371;&#12428;&#12414;&#12391;&#31169;&#12383;&#12385;&#12364;&#32771;&#12360;&#12418;&#12375;&#12394;&#12363;&#12387;&#12383;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290;
  &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12395;&#12399;&#12289;<span class="emphasis"><em>&#38750;&#24120;&#12395;</em></span> &#20778;&#31168;&#12394;&#20154;&#38291;&#12364;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12383;&#12384;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12395;&#12493;&#12479;&#12364;&#25237;&#19979;&#12373;&#12428;&#12427;&#12398;&#12434;&#24453;&#12385;&#12431;&#12403;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#30906;&#12363;&#12395;&#12289;&#12377;&#12409;&#12390;&#23494;&#23460;&#12398;&#35696;&#35542;&#12391;&#12377;&#12414;&#12379;&#12427;&#12398;&#12395;&#27604;&#12409;&#12428;&#12400;&#26178;&#38291;&#12399;&#12363;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#26178;&#38291;&#12434;&#12363;&#12369;&#12383;&#12398;&#12395;&#21313;&#20998;&#35211;&#21512;&#12358;&#12384;&#12369;&#12398;&#25104;&#26524;&#12364;&#24471;&#12425;&#12428;&#12414;&#12375;&#12383;&#12290;
</p><p>
  "&#19977;&#20154;&#23492;&#12428;&#12400;&#25991;&#27530;&#12398;&#30693;&#24693;" &#12384;&#12392;&#12363; "&#20491;&#20154;&#12424;&#12426;&#12418;&#38598;&#22243;&#12398;&#12411;&#12358;&#12364;&#24120;&#12395;&#12424;&#12356;&#21028;&#26029;&#12364;&#12391;&#12365;&#12427;"
  &#12392;&#12363;&#12356;&#12358;&#12424;&#12358;&#12395;&#19968;&#33324;&#21270;&#12375;&#12390;&#36867;&#12370;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#38598;&#22243;&#12398;&#12411;&#12358;&#12364;&#12424;&#12356;&#32080;&#26524;&#12364;&#12391;&#12427;&#27963;&#21205;&#12392;&#12375;&#12390;&#12399;&#12393;&#12435;&#12394;&#12418;&#12398;&#12364;&#12354;&#12427;&#12398;&#12363;&#12434;&#30693;&#12387;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#22823;&#35215;&#27169;&#12394;&#12500;&#12450;-&#12524;&#12499;&#12517;&#12540;&#12394;&#12393;&#12364;&#12381;&#12398;&#20363;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#12392;&#12395;&#12363;&#12367;&#12383;&#12367;&#12373;&#12435;&#12398;&#26696;&#12434;&#25163;&#26089;&#12367;&#20986;&#12375;&#12390;&#12356;&#12367;&#12392;&#12356;&#12387;&#12383;&#20316;&#26989;&#12418;&#12381;&#12428;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12450;&#12452;&#12487;&#12450;&#12398;&#36074;&#12399;&#12381;&#12428;&#12434;&#32771;&#12360;&#12383;&#20154;&#12383;&#12385;&#12398;&#36074;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12364;&#12289;
  &#22256;&#38627;&#12394;&#21839;&#38988;&#12434;&#30342;&#12395;&#12406;&#12388;&#12369;&#12390;&#12415;&#12427;&#12414;&#12391;&#12289;&#35504;&#12364;&#12393;&#12398;&#12424;&#12358;&#12394;&#26696;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12363;&#12399;&#12431;&#12363;&#12425;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#24403;&#28982;&#12289;&#20869;&#23481;&#12395;&#12424;&#12387;&#12390;&#12399;&#20491;&#20154;&#30340;&#12395;&#35696;&#35542;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#26412;&#26360;&#12398;&#20013;&#12391;&#12418;&#12381;&#12398;&#12424;&#12358;&#12394;&#20363;&#12364;&#12356;&#12367;&#12388;&#12363;&#30331;&#22580;&#12375;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#22522;&#26412;&#26041;&#37341;&#12392;&#12375;&#12390;&#12289;<span class="emphasis"><em>&#38560;&#12377;&#24517;&#35201;&#12364;&#12394;&#12356;&#12418;&#12398;&#12399;&#12289;&#12377;&#12409;&#12390;&#20844;&#38283;&#12377;&#12409;&#12365;&#12391;&#12354;&#12427;</em></span>
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#24120;&#12395;&#24515;&#12395;&#12362;&#12356;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12381;&#12398;&#12383;&#12417;&#12395;&#12399;&#20309;&#12425;&#12363;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#24120;&#12395;&#20844;&#38283;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12375;&#12424;&#12358;&#12392;&#24515;&#12364;&#12369;&#12427;&#12384;&#12369;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#38560;&#12377;&#24517;&#35201;&#12364;&#12394;&#12356;&#20869;&#23481;&#12398;&#12513;&#12540;&#12523;&#12434;&#20182;&#12398;&#20154;&#12363;&#12425;&#21463;&#12369;&#21462;&#12387;&#12383;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12418;&#27969;&#12377;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#35504;&#12363;&#12364;&#20491;&#20154;&#30340;&#12395;&#35696;&#35542;&#12434;&#22987;&#12417;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12289;&#12418;&#12375;&#12381;&#12428;&#12364;&#20491;&#20154;&#30340;&#12395;&#12377;&#12427;&#24517;&#35201;&#12398;&#12394;&#12356;&#12418;&#12398;&#12394;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#20491;&#20154;&#30340;&#12395;&#34892;&#12358;&#12398;&#12363;&#20844;&#38283;&#12391;&#34892;&#12358;&#12398;&#12363;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12434;&#12377;&#12368;&#12395;&#22987;&#12417;&#12427;&#36012;&#20219;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#39318;&#23614;&#12424;&#12367;&#12381;&#12398;&#35696;&#35542;&#12434;&#20844;&#38283;&#12398;&#22580;&#12395;&#25345;&#12385;&#20986;&#12377;&#12363;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#20491;&#20154;&#30340;&#12395;&#35441;&#12375;&#21512;&#12358;&#12398;&#12364;&#36969;&#20999;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12427;&#12414;&#12391;&#12289;
  &#20803;&#12398;&#35441;&#38988;&#12395;&#12399;&#12467;&#12513;&#12531;&#12488;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#24120;&#12395;&#12371;&#12398;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#24515;&#12364;&#12369;&#12428;&#12400;&#12289;
  &#20154;&#12399;&#12420;&#12364;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20844;&#38283;&#12398;&#22580;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="prevent-rudeness"></a>&#28814;&#19978;&#12434;&#38459;&#27490;&#12377;&#12427;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#19968;&#33324;&#12395;&#20844;&#38283;&#12375;&#12383;&#12425;&#12289;
  &#12501;&#12457;&#12540;&#12521;&#12512;&#12395;&#12362;&#12369;&#12427;&#22833;&#31036;&#12394;&#25391;&#12427;&#33310;&#12356;&#12420;&#20398;&#36785;&#30340;&#12394;&#30330;&#35328;&#12395;&#12399;&#12476;&#12525;&#12488;&#12524;&#12521;&#12531;&#12473;&#12391; (&#24773;&#12369;&#23481;&#36198;&#12394;&#12367;)
  &#23550;&#20966;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12300;&#12476;&#12525;&#12488;&#12524;&#12521;&#12531;&#12473;&#12391;&#12301;&#12392;&#12399;&#12289;
  &#20309;&#12363;&#25216;&#34899;&#30340;&#12395;&#29305;&#21029;&#12394;&#12371;&#12392;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21029;&#12398;&#21442;&#21152;&#32773;&#12434;&#32629;&#20498;&#12375;&#12383;&#21442;&#21152;&#32773;&#12434;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12363;&#12425;&#24375;&#21046;&#36864;&#20250;&#12373;&#12379;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
  &#20154;&#12434;&#20663;&#12388;&#12369;&#12427;&#12424;&#12358;&#12394;&#12467;&#12513;&#12531;&#12488;&#12434;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12381;&#12398;&#20154;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#21093;&#22890;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;
  (&#29702;&#23624;&#19978;&#12399;&#12289;&#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12381;&#12358;&#12356;&#12387;&#12383;&#25514;&#32622;&#12434;&#12392;&#12425;&#12374;&#12427;&#12434;&#24471;&#12394;&#12356;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12399;&#12373;&#12414;&#12374;&#12414;&#12394;&#23550;&#31574;&#12364;&#12377;&#12409;&#12390;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12398;&#26368;&#24460;&#12398;&#25163;&#27573;&#12392;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#22987;&#24403;&#21021;&#12395;&#12399;&#12381;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#36215;&#12371;&#12426;&#12414;&#12379;&#12435;)&#12290;
  &#12371;&#12371;&#12391;&#35328;&#12358;&#12476;&#12525;&#12488;&#12524;&#12521;&#12531;&#12473;&#12392;&#12399;&#12289;&#12381;&#12435;&#12394;&#25391;&#12427;&#33310;&#12356;&#12434;&#27770;&#12375;&#12390;&#35211;&#36942;&#12372;&#12373;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#25216;&#34899;&#30340;&#12394;&#12467;&#12513;&#12531;&#12488;&#12392;&#12356;&#12387;&#12375;&#12423;&#12395;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#38283;&#30330;&#32773;&#12395;&#23550;&#12377;&#12427;&#20491;&#20154;&#25915;&#25731; (<span class="foreignphrase"><em class="foreignphrase">ad hominem</em></span>)
  &#12434;&#21547;&#12416;&#12467;&#12513;&#12531;&#12488;&#12364;&#25237;&#31295;&#12373;&#12428;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#12289;<span class="emphasis"><em>&#12414;&#12378;</em></span>
  &#12381;&#12398;&#20491;&#20154;&#25915;&#25731;&#12395;&#23550;&#12377;&#12427;&#25351;&#25688;&#12434;&#12375;&#12383;&#12358;&#12360;&#12391;&#12289;&#25216;&#34899;&#30340;&#12394;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#12399;&#12381;&#12428;&#12392;&#12399;&#20998;&#12369;&#12390;&#36820;&#31572;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#27531;&#24565;&#12394;&#12364;&#12425;&#12289;&#12371;&#12428;&#12399;&#26131;&#12375;&#12356;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12383;&#12356;&#12390;&#12356;&#12399;&#24314;&#35373;&#30340;&#12394;&#35696;&#35542;&#12364;&#19981;&#27611;&#12394;&#32629;&#20498;&#21512;&#25126;&#12395;&#38501;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#20154;&#12399;&#12289;&#38754;&#12392;&#21521;&#12363;&#12387;&#12390;&#12399;&#27770;&#12375;&#12390;&#35328;&#12360;&#12394;&#12356;&#12371;&#12392;&#12391;&#12418;&#12513;&#12540;&#12523;&#12391;&#12399;&#24179;&#27671;&#12391;&#35328;&#12387;&#12390;&#12375;&#12414;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#35696;&#35542;&#12398;&#20869;&#23481;&#12418;&#12371;&#12398;&#20670;&#21521;&#12395;&#25293;&#36554;&#12434;&#12363;&#12369;&#12414;&#12377;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;&#12395;&#38306;&#12375;&#12390;&#12289;&#22810;&#12367;&#12398;&#20154;&#12399;&#12300;&#12411;&#12392;&#12435;&#12393;&#12398;&#36074;&#21839;&#12395;&#12399;&#27491;&#35299;&#12364;&#12402;&#12392;&#12388;&#12375;&#12363;&#12394;&#12356;&#12301;
  &#12392;&#32771;&#12360;&#12364;&#12385;&#12391;&#12377;&#12290;&#12381;&#12375;&#12390;&#12381;&#12398;&#31572;&#12360;&#12395;&#21516;&#24847;&#12375;&#12394;&#12356;&#20154;&#12398;&#12371;&#12392;&#12434;&#28961;&#30693;&#12391;&#24858;&#12363;&#12394;&#20154;&#12384;&#12392;&#24605;&#12387;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
  &#35504;&#12363;&#12398;&#25216;&#34899;&#30340;&#12394;&#25552;&#26696;&#12434;&#21542;&#23450;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#20154;&#33258;&#36523;&#12398;&#20154;&#26684;&#12434;&#21542;&#23450;&#12375;&#12383;&#12424;&#12358;&#12395;&#21463;&#12369;&#21462;&#12425;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12289;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12364;&#20154;&#26684;&#25915;&#25731;&#12395;&#20999;&#12426;&#26367;&#12431;&#12427;&#30636;&#38291;&#12434;&#35211;&#26997;&#12417;&#12427;&#12398;&#12399;&#38750;&#24120;&#12395;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#21427;&#12375;&#12417;&#12398;&#36820;&#31572;&#12420;&#20966;&#32624;&#12364;&#12356;&#12356;&#32771;&#12360;&#12391;&#12399;&#12394;&#12356;&#12402;&#12392;&#12388;&#12398;&#29702;&#30001;&#12364;&#12371;&#12371;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12363;&#12431;&#12426;&#12395;&#12289;&#12385;&#12423;&#12387;&#12392;&#38640;&#22258;&#27671;&#12364;&#24618;&#12375;&#12367;&#12394;&#12387;&#12390;&#12365;&#12383;&#12394;&#12392;&#24863;&#12376;&#12383;&#12425;&#12289;
  &#35696;&#35542;&#12434;&#21451;&#22909;&#30340;&#12395;&#36914;&#12417;&#12427;&#12424;&#12358;&#12395;&#20419;&#12377;&#25237;&#31295;&#12434;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#38555;&#12395;&#12289;&#29305;&#23450;&#12398;&#20154;&#29289;&#12364;&#24847;&#22259;&#30340;&#12395;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#38750;&#38627;&#12377;&#12427;&#12371;&#12392;&#12399;&#36991;&#12369;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394; "&#30010;&#12398;&#12362;&#12414;&#12431;&#12426;&#12373;&#12435;" &#30340;&#12394;&#25237;&#31295;&#12399;&#12289;
  &#26178;&#12392;&#12375;&#12390;&#22290;&#20816;&#12434;&#12375;&#12388;&#12369;&#12427;&#24188;&#31258;&#22290;&#12398;&#20808;&#29983;&#12398;&#12424;&#12358;&#12395;&#35211;&#12360;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#20670;&#21521;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        &#12414;&#12378;&#26368;&#21021;&#12395;&#12402;&#12392;&#12371;&#12392;&#12290;&#20491;&#20154;&#25915;&#25731;&#12395;&#12388;&#12394;&#12364;&#12427; (&#12354;&#12427;&#12356;&#12399;&#12381;&#12398;&#24656;&#12428;&#12398;&#12354;&#12427;)
        &#12467;&#12513;&#12531;&#12488;&#12399;&#25511;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;J &#12364;&#35373;&#35336;&#12375;&#12383;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#23652;&#12395;&#12388;&#12356;&#12390;
        "&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#22522;&#30990;&#30693;&#35672;&#12395;&#27424;&#12369;&#12427;&#28961;&#33021;&#12394;&#35373;&#35336;&#12384;"
        &#12392;&#35486;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12428;&#12364;&#27491;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#12399;&#21029;&#12395;&#12375;&#12390;&#12289;
        &#12371;&#12428;&#12399;&#35696;&#35542;&#12398;&#36914;&#12417;&#26041;&#12392;&#12375;&#12390;&#12399;&#38291;&#36949;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
        J &#12399;&#20449;&#24565;&#12434;&#25345;&#12387;&#12390;&#12371;&#12398;&#25552;&#26696;&#12434;&#12375;&#12383;&#12431;&#12369;&#12391;&#12377;&#12290;
        &#12418;&#12375;&#21839;&#38988;&#12364;&#12354;&#12427;&#12394;&#12425;&#12381;&#12398;&#21839;&#38988;&#12434;&#25351;&#25688;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
        &#12381;&#12375;&#12390;&#30342;&#12391;&#12381;&#12428;&#12434;&#20462;&#27491;&#12377;&#12427;&#12363;&#12289;&#26032;&#12375;&#12367;&#35373;&#35336;&#12434;&#12420;&#12426;&#12394;&#12362;&#12379;&#12400;&#12356;&#12356;&#12376;&#12419;&#12394;&#12356;&#12391;&#12377;&#12363;&#12290;
        M &#12399;&#27770;&#12375;&#12390; J &#12434;&#20491;&#20154;&#25915;&#25731;&#12377;&#12427;&#12388;&#12418;&#12426;&#12364;&#12394;&#12356;&#12371;&#12392;&#12399;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
        &#12391;&#12418;&#12289;&#12381;&#12398;&#35328;&#12356;&#26041;&#12399;&#12385;&#12423;&#12387;&#12392;&#12414;&#12378;&#12363;&#12387;&#12383;&#12290;&#12418;&#12387;&#12392;&#24314;&#35373;&#30340;&#12394;&#35696;&#35542;&#12434;&#36914;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
      </em></span></p><p><span class="emphasis"><em>
        &#12373;&#12390;&#12289;&#25552;&#26696;&#20869;&#23481;&#12395;&#35441;&#12434;&#25147;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
        &#31169;&#12399;&#12289;M &#12398;&#35328;&#12358;&#12371;&#12392;&#12399;&#12418;&#12387;&#12392;&#12418;&#12384;&#12392;&#24605;&#12356;&#12414;&#12377;&#8230;&#8230;
      </em></span></p></blockquote></div><p>
  &#12385;&#12423;&#12387;&#12392;&#22533;&#33510;&#12375;&#12367;&#24863;&#12376;&#12427;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12428;&#12399;&#12363;&#12394;&#12426;&#12398;&#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#20309;&#12363;&#12354;&#12387;&#12383;&#12425;&#24517;&#12378;&#21475;&#12434;&#20986;&#12377;&#12364;&#12289;&#27770;&#12375;&#12390;&#25915;&#25731;&#20596;&#12395;&#35613;&#32618;&#12434;&#35201;&#27714;&#12375;&#12383;&#12426;&#33853;&#12385;&#24230;&#12434;&#35469;&#12417;&#12373;&#12379;&#12383;&#12426;&#12375;&#12394;&#12356;&#12290;
  &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;&#12381;&#12398;&#12414;&#12414;&#25918;&#12387;&#12390;&#12362;&#12356;&#12390;&#27425;&#22238;&#12399;&#12424;&#12426;&#12362;&#12384;&#12420;&#12363;&#12395;&#25391;&#33310;&#12358;&#12424;&#12358;&#12395;&#20419;&#12377;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#24444;&#12425;&#12399;&#12365;&#12387;&#12392;&#12381;&#12428;&#12395;&#24467;&#12387;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12434;&#12358;&#12414;&#12367;&#34892;&#12358;&#31192;&#35363;&#12398;&#12402;&#12392;&#12388;&#12399;&#12289;&#12393;&#12387;&#12385;&#12364;&#24746;&#12356;&#12363;&#12392;&#12363;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;&#12392;&#12356;&#12387;&#12383;
  &#12513;&#12479;&#35696;&#35542;&#12434;&#20027;&#38988;&#12395;&#12375;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#26412;&#38988;&#12395;&#20837;&#12427;&#21069;&#12398;&#21069;&#32622;&#12365;&#31243;&#24230;&#12398;&#25201;&#12356;&#12395;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12300;&#12371;&#12371;&#12391;&#12399;&#12381;&#12435;&#12394;&#25391;&#12427;&#33310;&#12356;&#12399;&#12420;&#12417;&#12390;&#12367;&#12384;&#12373;&#12356;&#12301;&#12392;&#25351;&#25688;&#12375;&#12383;&#24460;&#12399;&#12377;&#12368;&#12395;&#26412;&#38988;&#12395;&#31227;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#30456;&#25163;&#20596;&#12395;&#12418;&#26412;&#38988;&#12395;&#36820;&#31572;&#12377;&#12427;&#27231;&#20250;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12428;&#12391;&#12418;&#12300;&#12354;&#12394;&#12383;&#12395;&#38750;&#38627;&#12373;&#12428;&#12427;&#12356;&#12431;&#12428;&#12399;&#12394;&#12356;&#12301;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#35328;&#12431;&#12428;&#12383;&#12425;&#12289;
  &#12418;&#12358;&#12381;&#12428;&#20197;&#19978;&#12381;&#12398;&#35441;&#38988;&#12434;&#24341;&#12365;&#12378;&#12427;&#12398;&#12399;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#21336;&#12395;&#12381;&#12398;&#35441;&#38988;&#12395;&#38306;&#12377;&#12427;&#36820;&#20449;&#12434;&#12420;&#12417;&#12390;&#12362;&#12367; (&#21336;&#12395;&#24444;&#12425;&#12399;&#33258;&#20998;&#12398;&#20027;&#24373;&#12434;&#25391;&#12426;&#12363;&#12374;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12354;&#12426;&#12289;
  &#36820;&#20107;&#12434;&#27714;&#12417;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12373;&#12381;&#12358;&#12394;&#22580;&#21512;) &#12363;&#12289;&#12354;&#12427;&#12356;&#12399;
  &#12300;&#20986;&#12377;&#12366;&#12383;&#12414;&#12397;&#12434;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12372;&#12417;&#12435;&#12394;&#12373;&#12356;&#12290;&#12513;&#12540;&#12523;&#12391;&#12399;&#12394;&#12363;&#12394;&#12363;&#12491;&#12517;&#12450;&#12531;&#12473;&#12364;&#20253;&#12431;&#12426;&#12395;&#12367;&#12356;&#12398;&#12391;&#12301;
  &#12392;&#35613;&#12387;&#12383;&#12358;&#12360;&#12391;&#26412;&#38988;&#12395;&#25147;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#19981;&#36969;&#20999;&#12394;&#25391;&#12427;&#33310;&#12356;&#12434;&#12375;&#12383;&#20154;&#12383;&#12385;&#12398;&#20027;&#24373;&#12399;&#12289;&#20844;&#38283;&#12398;&#22580;&#12391;&#12354;&#12427;&#12363;&#21542;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;
  &#27770;&#12375;&#12390;&#35469;&#12417;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#12418;&#12375;&#12363;&#12428;&#12425;&#12398;&#26041;&#12363;&#12425;&#35613;&#32618;&#12364;&#12354;&#12428;&#12400;&#12377;&#12400;&#12425;&#12375;&#12356;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
  &#12371;&#12385;&#12425;&#12363;&#12425;&#35613;&#32618;&#12434;&#35201;&#27714;&#12375;&#12390;&#12418;&#30456;&#25163;&#12434;&#12373;&#12425;&#12395;&#24594;&#12425;&#12379;&#12427;&#12384;&#12369;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#26368;&#32066;&#30340;&#12394;&#30446;&#27161;&#12399;&#12289;&#12381;&#12398;&#38598;&#22243;&#12395;&#12300;&#31036;&#20736;&#12434;&#12431;&#12365;&#12414;&#12360;&#12427;&#12301;&#12392;&#12356;&#12358;&#31354;&#27671;&#12434;&#20316;&#12426;&#19978;&#12370;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#22823;&#12365;&#12394;&#21161;&#12369;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;&#38283;&#30330;&#32773;&#12364;
  (&#33258;&#20998;&#12364;&#22909;&#12435;&#12391;&#12469;&#12509;&#12540;&#12488;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;) &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#32629;&#20498;&#21512;&#25126;&#12395;&#24059;&#12365;&#36796;&#12414;&#12428;&#12427;&#24515;&#37197;&#12364;&#12394;&#12367;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12364;&#21407;&#22240;&#12391;&#38283;&#30330;&#32773;&#20505;&#35036;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#38626;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#12289;&#12354;&#12394;&#12383;&#12399;&#27671;&#12389;&#12363;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#35504;&#12363;&#12364;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12402;&#12387;&#12381;&#12426;&#21442;&#21152;&#12375;&#12390;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#27841;&#12434;&#35251;&#23519;&#12375;&#12289;
  &#21442;&#21152;&#12377;&#12427;&#12383;&#12417;&#12398;&#38556;&#22721;&#12364;&#21402;&#12356;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12289;&#32080;&#23616;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12434;&#12354;&#12365;&#12425;&#12417;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12501;&#12457;&#12540;&#12521;&#12512;&#12434;&#21451;&#22909;&#30340;&#12394;&#38640;&#22258;&#27671;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#12289;&#38263;&#26399;&#30340;&#12395;&#29983;&#12365;&#27531;&#12427;&#12383;&#12417;&#12398;&#20316;&#25126;&#12392;&#12375;&#12390;&#26377;&#21177;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12371;&#12428;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#23567;&#12373;&#12356;&#12358;&#12385;&#12363;&#12425;&#24515;&#12364;&#12369;&#12390;&#12362;&#12356;&#12383;&#12411;&#12358;&#12364;&#23455;&#29694;&#12375;&#12420;&#12377;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12356;&#12385;&#12393;&#12381;&#12435;&#12394;&#25991;&#21270;&#12364;&#12391;&#12365;&#12354;&#12364;&#12387;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;&#12354;&#12394;&#12383;&#12402;&#12392;&#12426;&#12364;&#12356;&#12385;&#12356;&#12385;&#12381;&#12428;&#12434;&#20027;&#24373;&#12375;&#12390;&#22238;&#12427;&#24517;&#35201;&#12418;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#30342;&#12364;&#12381;&#12358;&#12356;&#12358;&#12405;&#12358;&#12395;&#25345;&#12387;&#12390;&#34892;&#12387;&#12390;&#12367;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;"><div class="titlepage"><div><div><h3 class="title"><a name="code-review"></a>&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;</h3></div></div></div><p>
  &#38283;&#30330;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12434;&#12358;&#12414;&#12367;&#32946;&#12390;&#12390;&#12356;&#12367;&#12383;&#12417;&#12395;&#26368;&#36969;&#12394;&#26041;&#27861;&#12399;&#12289;
  &#38283;&#30330;&#32773;&#12393;&#12358;&#12375;&#12364;&#12362;&#20114;&#12356;&#12398;&#12467;&#12540;&#12489;&#12434;&#35211;&#12379;&#21512;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12434;&#21177;&#29575;&#30340;&#12395;&#34892;&#12358;&#12395;&#12399;&#12289;&#25216;&#34899;&#30340;&#12394;&#25903;&#25588;&#12364;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;&#29305;&#12395;&#20415;&#21033;&#12394;&#12398;&#12364;&#12289;&#12467;&#12511;&#12483;&#12488;&#26178;&#12398;&#12513;&#12540;&#12523;&#36890;&#30693;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399; <a class="xref" href="vc.html#commit-emails" title="&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;">&#12300;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12301;</a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12392;&#12399;&#12289;&#35504;&#12363;&#12364;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#21152;&#12360;&#12383;&#22793;&#26356;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12383;&#12403;&#12395;
  &#12381;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12392;&#22793;&#26356;&#20869;&#23481;&#12434;&#12513;&#12540;&#12523;&#12391;&#36865;&#12427;&#27231;&#33021;&#12398;&#12371;&#12392;&#12391;&#12377;
  (<a class="xref" href="vc.html#vc-vocabulary" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#29992;&#35486;&#38598;">&#12300;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#29992;&#35486;&#38598;&#12301;</a> &#12398; <a class="xref" href="vc.html#vc-vocabulary-diff"><em class="firstterm">&#24046;&#20998;</em></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
  <em class="firstterm">&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;</em> &#12392;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12364;&#12420;&#12387;&#12390;&#12367;&#12427;&#12383;&#12403;&#12395;&#12381;&#12398;&#20869;&#23481;&#12434;&#30906;&#35469;&#12375;&#12289;
  &#12496;&#12464;&#12420;&#25913;&#21892;&#28857;&#12364;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#25506;&#12377;&#20316;&#26989;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
  <sup>[<a name="idp641696" href="#ftn.idp641696" class="footnote">14</a>]</sup>
</p><p>
  &#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12399;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#28857;&#12391;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#19990;&#30028;&#12395;&#12362;&#12369;&#12427;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#26368;&#22823;&#12398;&#21177;&#26524;&#12399;&#12289;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#21697;&#36074;&#12434;&#19968;&#23450;&#12395;&#20445;&#12388;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12496;&#12464;&#12364;&#21547;&#12414;&#12428;&#12427;&#21407;&#22240;&#12399;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12383;&#12467;&#12540;&#12489;&#12434;&#12365;&#12385;&#12435;&#12392;&#12481;&#12455;&#12483;&#12463;&#12375;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#22810;&#12367;&#12398;&#30446;&#12391;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
  &#12496;&#12464;&#12434;&#27531;&#12375;&#12383;&#12414;&#12414;&#20844;&#38283;&#12375;&#12390;&#12375;&#12414;&#12358;&#21361;&#38522;&#24615;&#12434;&#28187;&#12425;&#12377;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#30446;&#30340;&#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#30452;&#25509;&#30340;&#12394;&#12418;&#12398;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12395;&#12424;&#12387;&#12390;&#12289;&#33258;&#20998;&#12383;&#12385;&#12398;&#20316;&#26989;&#12398;&#20869;&#23481;&#12434;&#30906;&#35469;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#20316;&#26989;&#12395;&#12388;&#12356;&#12390;&#12424;&#12367;&#30693;&#12387;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#20182;&#12398;&#20154;&#12364;&#33258;&#20998;&#12398;&#20316;&#26989;&#12434;&#35413;&#20385;&#12377;&#12427;&#12392;&#30693;&#12387;&#12390;&#12356;&#12428;&#12400;&#12289;
  &#20154;&#12399;&#26368;&#21892;&#12434;&#23613;&#12367;&#12375;&#12390;&#20316;&#26989;&#12434;&#34892;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12524;&#12499;&#12517;&#12540;&#12399;&#20844;&#38283;&#12398;&#22580;&#12391;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#38283;&#30330;&#32773;&#21516;&#22763;&#12364;&#29289;&#29702;&#30340;&#12395;&#21516;&#12376;&#37096;&#23627;&#12395;&#12356;&#12427;&#22580;&#21512;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#35504;&#12363;&#12364;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12392;&#12365;&#12395;&#12381;&#12398;&#12524;&#12499;&#12517;&#12540;&#12434;&#37096;&#23627;&#12398;&#20013;&#12384;&#12369;&#12391;&#28168;&#12414;&#12379;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#38754;&#20498;&#12391;&#12418;&#38283;&#30330;&#32773;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#12524;&#12499;&#12517;&#12540;&#12434;&#35211;&#12427;&#12371;&#12392;&#12391;&#12289;&#21442;&#21152;&#32773;&#20840;&#21729;&#12364;&#20309;&#12363;&#12434;&#24471;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12524;&#12499;&#12517;&#12540;&#12398;&#32080;&#26524;&#12289;&#20309;&#12425;&#12363;&#12398;&#12467;&#12513;&#12531;&#12488;&#12434;&#12375;&#12383;&#12426;&#12289;
  &#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#19981;&#20855;&#21512;&#12434;&#35211;&#12388;&#12369;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12524;&#12499;&#12517;&#12540;&#12399;&#26085;&#24120;&#12398;&#20316;&#26989;&#12398;&#12402;&#12392;&#12388;&#12392;&#12392;&#12425;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12290;&#12385;&#12423;&#12358;&#12393;&#30399;&#27927;&#12356;&#12420;&#33437;&#29983;&#12398;&#25163;&#20837;&#12428;&#12392;&#21516;&#12376;&#12424;&#12358;&#12394;&#24863;&#35226;&#12391;&#12377;&#12290;
</p><p>
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#22987;&#24403;&#21021;&#12399;&#12289;&#26085;&#24120;&#30340;&#12394;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12488;&#12364;&#12524;&#12499;&#12517;&#12540;&#12398;&#23550;&#35937;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#20445;&#35388;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;
  &#22793;&#26356;&#12373;&#12428;&#12383;&#12467;&#12540;&#12489;&#12398;&#20869;&#23481;&#12395;&#33288;&#21619;&#12398;&#12354;&#12427;&#20154;&#12364;&#12381;&#12428;&#12434;&#30522;&#12417;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#24403;&#26178;&#12398;&#12467;&#12540;&#12489;&#12395;&#32027;&#12428;&#36796;&#12435;&#12391;&#12356;&#12383;&#12496;&#12464;&#12399;&#30330;&#35211;&#21487;&#33021;&#12391;&#12375;&#12383;&#12375;&#35211;&#12388;&#12369;&#12425;&#12428;&#12427;&#12409;&#12365;&#12391;&#12375;&#12383;&#12290;
  &#24403;&#26178;&#12398;&#38283;&#30330;&#32773;&#12398;&#12402;&#12392;&#12426;&#12391;&#12354;&#12427; Greg Stein &#12399;&#12289;
  &#36942;&#21435;&#12398;&#32076;&#39443;&#12363;&#12425;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12364;&#24441;&#31435;&#12388;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#12289;&#12522;&#12509;&#12472;&#12488;&#12522;&#12408;&#12398; <span class="emphasis"><em>&#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12488;</em></span>
  &#12398;&#65297;&#34892;&#65297;&#34892;&#12398;&#20869;&#23481;&#12434;&#35443;&#32048;&#12395;&#12414;&#12391;&#12431;&#12383;&#12387;&#12390;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#35504;&#12363;&#12364;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12383;&#12403;&#12395;&#12381;&#12398;&#12467;&#12511;&#12483;&#12488;&#12395;&#12388;&#12356;&#12390;&#12398; Greg &#12363;&#12425;&#12398;&#12513;&#12540;&#12523;&#12364;
  &#38283;&#30330;&#32773;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#27969;&#12428;&#12414;&#12375;&#12383;&#12290;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12399;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#32048;&#12363;&#12367;&#20999;&#12426;&#21051;&#12435;&#12391;&#20998;&#26512;&#12375;&#12289;&#36215;&#12371;&#12426;&#12358;&#12427;&#21839;&#38988;&#12434;&#25351;&#25688;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#26178;&#12395;&#12399;&#12289;&#20778;&#12428;&#12383;&#12467;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390;&#36062;&#36059;&#12434;&#36865;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#12289;&#12496;&#12464;&#12434;&#35211;&#12388;&#12369;&#12383;&#12426;
  &#27880;&#24847;&#12375;&#12394;&#12356;&#12392;&#12388;&#12414;&#12389;&#12367;&#12367;&#24656;&#12428;&#12398;&#12354;&#12427;&#12354;&#12414;&#12426;&#12424;&#12356;&#26360;&#12365;&#26041;&#12391;&#12399;&#12394;&#12356;&#12467;&#12540;&#12489;&#12434;&#35211;&#12388;&#12369;&#12383;&#12426;&#12375;&#12390;&#12356;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12398;&#12364;&#33258;&#20998;&#12402;&#12392;&#12426;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#12289;
  &#34920;&#31435;&#12387;&#12390;&#12399;&#19981;&#24179;&#12434;&#36848;&#12409;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12363;&#12394;&#12426;&#12398;&#26178;&#38291;&#12434;&#12524;&#12499;&#12517;&#12540;&#12395;&#36027;&#12420;&#12375;&#12390;&#12356;&#12383;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;&#12371;&#12392;&#12354;&#12427;&#12372;&#12392;&#12395;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#12377;&#12400;&#12425;&#12375;&#12373;&#12395;&#12388;&#12356;&#12390;&#30330;&#35328;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12420;&#12364;&#12390;&#12289;&#31169;&#12434;&#21547;&#12417;&#12383;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12418;&#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#23450;&#26399;&#30340;&#12395;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#20309;&#12364;&#12381;&#12358;&#12373;&#12379;&#12383;&#12398;&#12391;&#12375;&#12423;&#12358;? &#27770;&#12375;&#12390; Greg &#12364;&#31169;&#12383;&#12385;&#12395;&#12381;&#12428;&#12434;&#24375;&#21046;&#12375;&#12383;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12399;&#12300;&#12467;&#12540;&#12489;&#12398;&#12524;&#12499;&#12517;&#12540;&#12364;&#26178;&#38291;&#12434;&#12363;&#12369;&#12427;&#12384;&#12369;&#12398;&#20385;&#20516;&#12398;&#12354;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#12301;&#12371;&#12392;&#12289;&#12381;&#12375;&#12390;
  &#12300;&#20182;&#20154;&#12398;&#12467;&#12540;&#12489;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12371;&#12392;&#12399;&#26032;&#12375;&#12356;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12398;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#12395;&#37325;&#35201;&#12391;&#12354;&#12427;&#12301;
  &#12371;&#12392;&#12434;&#33258;&#36523;&#12398;&#34892;&#21205;&#12434;&#12418;&#12387;&#12390;&#35388;&#26126;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12356;&#12374;&#12381;&#12358;&#12356;&#12358;&#32722;&#24931;&#12364;&#36523;&#12395;&#12388;&#12367;&#12392;&#12289;&#33258;&#20998;&#12398;&#12467;&#12511;&#12483;&#12488;&#12395;&#20309;&#12398;&#21453;&#24540;&#12418;&#12394;&#12369;&#12428;&#12400;&#36870;&#12395;&#19981;&#23433;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12300;&#35504;&#12363;&#31169;&#12398;&#12467;&#12540;&#12489;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#12367;&#12428;&#12394;&#12356;&#12363;&#12394;?&#12301;
  &#12392;&#32862;&#12356;&#12390;&#12415;&#12383;&#12426;&#12394;&#12435;&#12363;&#12375;&#12390;&#12290;&#24460;&#12395;&#12289;Greg &#12399;&#21029;&#12398;&#20181;&#20107;&#12434;&#24471;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12289;
  Subversion &#12395;&#12354;&#12414;&#12426;&#26178;&#38291;&#12434;&#12363;&#12369;&#12425;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#23450;&#26399;&#30340;&#12394;&#12524;&#12499;&#12517;&#12540;&#12434;&#12354;&#12365;&#12425;&#12417;&#12374;&#12427;&#12434;&#24471;&#12394;&#12367;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12398;&#12392;&#12365;&#12395;&#12399;&#12377;&#12391;&#12395;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;&#12364;&#31169;&#12383;&#12385;&#12395;&#12418;&#28145;&#12367;&#26681;&#20184;&#12356;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12414;&#12427;&#12391;&#22826;&#21476;&#12398;&#26132;&#12363;&#12425;&#12381;&#12428;&#12364;&#24403;&#12383;&#12426;&#21069;&#12391;&#12354;&#12387;&#12383;&#12363;&#12398;&#12424;&#12358;&#12395;&#12290;
</p><p>
  &#12467;&#12540;&#12489;&#12398;&#12524;&#12499;&#12517;&#12540;&#12399;&#12289;&#26368;&#21021;&#12398;&#12467;&#12511;&#12483;&#12488;&#12398;&#26178;&#28857;&#12363;&#12425;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#24046;&#20998;&#12434;&#35211;&#12428;&#12400;&#31777;&#21336;&#12395;&#30330;&#35211;&#12391;&#12365;&#12427;&#21839;&#38988;&#12392;&#12375;&#12390;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#33030;&#24369;&#24615;&#12420;&#12513;&#12514;&#12522;&#12522;&#12540;&#12463;&#12289;
  &#12467;&#12513;&#12531;&#12488;&#12420; API &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#19981;&#36275;&#12289;&#12300;&#12402;&#12392;&#12388;&#12378;&#12428;&#12385;&#12419;&#12387;&#12383; (off-by-one)
  &#12456;&#12521;&#12540;&#12301;&#12289;&#21628;&#12403;&#20986;&#12375;&#20803;&#12392;&#21628;&#12403;&#20986;&#12375;&#20808;&#12398;&#35215;&#32004;&#12398;&#19981;&#19968;&#33268;&#12394;&#12393;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#24046;&#20998;&#12398;&#21069;&#24460;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12391;&#30330;&#35211;&#12391;&#12365;&#12427;&#21839;&#38988;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12424;&#12426;&#35215;&#27169;&#12398;&#22823;&#12365;&#12356;&#21839;&#38988;&#12289;
  &#12383;&#12392;&#12360;&#12400;&#32368;&#12426;&#36820;&#12375;&#30331;&#22580;&#12377;&#12427;&#12497;&#12479;&#12540;&#12531;&#12434;&#19968;&#12363;&#25152;&#12395;&#12414;&#12392;&#12417;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12394;&#12393;&#12399;&#12289;
  &#23450;&#26399;&#30340;&#12394;&#12524;&#12499;&#12517;&#12540;&#12434;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#35211;&#12388;&#12369;&#12395;&#12367;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#36942;&#21435;&#12398;&#26356;&#26032;&#12398;&#23653;&#27508;&#12398;&#35352;&#25014;&#12434;&#20170;&#22238;&#12398;&#24046;&#20998;&#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12391;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12398;&#21839;&#38988;&#12418;&#35211;&#12388;&#12369;&#12420;&#12377;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#20309;&#12418;&#12467;&#12513;&#12531;&#12488;&#12377;&#12409;&#12365;&#28857;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12435;&#12376;&#12419;&#12394;&#12356;&#12363;&#12392;&#12363;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#12467;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;&#29087;&#30693;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12376;&#12419;&#12394;&#12356;&#12392;&#12363;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#27671;&#12395;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12354;&#12425;&#12422;&#12427;&#12467;&#12511;&#12483;&#12488;&#12395;&#12399;&#20309;&#12363;&#12375;&#12425;&#35328;&#12358;&#12409;&#12365;&#12371;&#12392;&#12364;&#12354;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#20309;&#12418;&#30097;&#21839;&#28857;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#20309;&#12363;&#36062;&#36059;&#12398;&#35328;&#33865;&#12434;&#36104;&#12428;&#12400;&#12356;&#12356;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#23550;&#12375;&#12390;
  &#12300;&#12354;&#12394;&#12383;&#12398;&#20316;&#26989;&#20869;&#23481;&#12434;&#35211;&#12390;&#12356;&#12427;&#12375;&#12289;&#29702;&#35299;&#12418;&#12375;&#12390;&#12356;&#12427;&#12301;&#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20253;&#12360;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12300;&#24460;&#12391;&#12411;&#12363;&#12398;&#20154;&#12395;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12363;&#12425;&#12289;&#12467;&#12511;&#12483;&#12488;&#21069;&#12398;&#12481;&#12455;&#12483;&#12463;&#12420;&#12486;&#12473;&#12488;&#12399;&#19981;&#35201;&#12301;
  &#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#26412;&#26469;&#33258;&#20998;&#33258;&#36523;&#12391;&#30330;&#35211;&#12377;&#12409;&#12365;&#21839;&#38988;&#12434;&#12289;
  &#20182;&#20154;&#12398;&#12524;&#12499;&#12517;&#12540;&#12395;&#38972;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect2" title="&#12418;&#12392;&#12418;&#12392;&#38750;&#20844;&#38283;&#12384;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289; &#22793;&#21270;&#12398;&#22823;&#12365;&#12373;&#12395;&#27671;&#12434;&#12388;&#12369;&#12424;&#12358;"><div class="titlepage"><div><div><h3 class="title"><a name="opening-closed-projects"></a>&#12418;&#12392;&#12418;&#12392;&#38750;&#20844;&#38283;&#12384;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12289;
&#22793;&#21270;&#12398;&#22823;&#12365;&#12373;&#12395;&#27671;&#12434;&#12388;&#12369;&#12424;&#12358;</h3></div></div></div><p>
  &#26082;&#23384;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
  &#12463;&#12525;&#12540;&#12474;&#12489;&#29872;&#22659;&#12391;&#12398;&#38283;&#30330;&#12395;&#24931;&#12428;&#12365;&#12387;&#12383;&#26082;&#23384;&#12398;&#38283;&#30330;&#32773;&#12364;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#29872;&#22659;&#12364;&#22823;&#12365;&#12367;&#22793;&#12431;&#12427;&#12371;&#12392;&#12434;&#24444;&#12425;&#12395;&#29702;&#35299;&#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12289;
  &#12414;&#12383;&#12289;&#24444;&#12425;&#20596;&#12398;&#35222;&#28857;&#12391;&#32771;&#12360;&#12383;&#22580;&#21512;&#12395;&#20309;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#22793;&#12431;&#12427;&#12398;&#12363;&#12434;
  &#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#29702;&#35299;&#12377;&#12427;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
</p><p>
  &#24444;&#12425;&#12395;&#12392;&#12387;&#12390;&#12381;&#12398;&#29366;&#27841;&#12364;&#12393;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12363;&#12434;&#24819;&#20687;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12399;&#12289;&#12393;&#12398;&#12424;&#12358;&#12394;&#35373;&#35336;&#12391;&#12393;&#12398;&#12424;&#12358;&#12394;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12398;&#12363;&#12434;&#27770;&#12417;&#12427;&#12398;&#12399;
  &#29305;&#23450;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12398;&#38598;&#22243;&#12391;&#12375;&#12383;&#12290;&#12414;&#12383;&#12289;&#24444;&#12425;&#12399;&#21516;&#12376;&#31649;&#29702;&#32773;&#12398;&#12418;&#12392;&#12391;&#20685;&#12365;&#12289;
  &#21516;&#12376;&#12424;&#12358;&#12394;&#37325;&#22311;&#12434;&#21463;&#12369;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12375;&#12390;&#12362;&#20114;&#12356;&#12398;&#12473;&#12461;&#12523;&#12420;&#24369;&#28857;&#12418;&#12424;&#12367;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#20170;&#12420;&#12381;&#12358;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#33258;&#20998;&#12398;&#26360;&#12356;&#12383;&#12467;&#12540;&#12489;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12395;
  &#12393;&#12371;&#12398;&#35504;&#12392;&#12418;&#12431;&#12363;&#12425;&#12394;&#12356;&#20154;&#12395;&#21521;&#12363;&#12387;&#12390;&#20844;&#38283;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#32020;&#31883;&#12395;&#12467;&#12540;&#12489;&#12398;&#20869;&#23481;&#12384;&#12369;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#21028;&#26029;&#12434;&#19979;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#20197;&#22806;&#12398;&#12499;&#12472;&#12493;&#12473;&#19978;&#12398;&#21839;&#38988;&#12394;&#12393;&#12399;&#32771;&#24942;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#33258;&#20998;&#12398;&#12467;&#12540;&#12489;&#12395;&#12388;&#12356;&#12390;&#12289;&#35211;&#30693;&#12425;&#12396;&#20154;&#12363;&#12425;&#12373;&#12414;&#12374;&#12414;&#12394;&#36074;&#21839;&#12364;&#23492;&#12379;&#12425;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12435;&#12394;&#12395;&#33510;&#21172;&#12375;&#12390;&#20316;&#12387;&#12383;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#12289;<span class="emphasis"><em>&#12414;&#12384;</em></span>
  &#19981;&#21313;&#20998;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#21028;&#26126;&#12375;&#12390; (&#12362;&#27770;&#12414;&#12426;&#12398;&#12497;&#12479;&#12540;&#12531;&#12391;&#12377;)
  &#34909;&#25731;&#12434;&#21463;&#12369;&#12427;&#30636;&#38291;&#12391;&#12377;&#12290;
  &#26032;&#20837;&#12426;&#12373;&#12435;&#12399;&#12289;&#12415;&#12435;&#12394;&#35504;&#12418;&#30693;&#12425;&#12394;&#12356;&#24471;&#20307;&#12398;&#30693;&#12428;&#12394;&#12356;&#20154;&#12383;&#12385;&#12400;&#12363;&#12426;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#26082;&#23384;&#12398;&#38283;&#30330;&#32773;&#12398;&#20013;&#12395;&#33258;&#20998;&#12398;&#12473;&#12461;&#12523;&#12395;&#19981;&#23433;&#12398;&#12354;&#12427;&#20154;&#12364;&#12356;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#26032;&#20837;&#12426;&#12373;&#12435;&#12364;&#20309;&#12418;&#32771;&#12360;&#12378;&#12395;&#24444;&#12398;&#12467;&#12540;&#12489;&#12398;&#21839;&#38988;&#12434;&#25351;&#25688;&#12375;&#12383;&#12425;&#12289;
  &#24444;&#12395;&#12393;&#12398;&#12424;&#12358;&#12394;&#24746;&#24433;&#38911;&#12434;&#21450;&#12412;&#12377;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;&#29305;&#12395;&#12289;
  &#24444;&#12398;&#21516;&#20698;&#12398;&#30446;&#12398;&#21069;&#12391;&#12381;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#36215;&#12371;&#12387;&#12383;&#12425;&#12289;&#12373;&#12425;&#12395;&#29366;&#27841;&#12399;&#24746;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#23436;&#20840;&#28961;&#27424;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12364;&#38598;&#12414;&#12387;&#12383;&#12481;&#12540;&#12512;&#12391;&#12418;&#12394;&#12356;&#38480;&#12426;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#21839;&#38988;&#12364;&#36215;&#12371;&#12427;&#12371;&#12392;&#12399;&#36991;&#12369;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#23455;&#38555;&#12289;&#12377;&#12409;&#12390;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#19968;&#24230;&#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#32076;&#39443;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#27770;&#12375;&#12390;&#24444;&#12425;&#12364;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#12375;&#12390;&#21155;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12427;&#31243;&#24230;&#20197;&#19978;&#12398;&#12469;&#12452;&#12474;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12399;&#12289;&#24517;&#12378;&#12496;&#12464;&#12364;&#21547;&#12414;&#12428;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12467;&#12540;&#12489;&#12398;&#12524;&#12499;&#12517;&#12540;&#12395;&#12424;&#12387;&#12390;&#12381;&#12428;&#12364;&#35211;&#12388;&#12363;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;
  (<span>&#26412;&#31456;&#12398;&#21069;&#21322;&#12395;&#12354;&#12427;</span>
  <a class="xref" href="setting-tone.html#code-review" title="&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;">&#12300;&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)&#12290;
  &#12392;&#21516;&#26178;&#12395;&#12289;&#26032;&#20837;&#12426;&#12373;&#12435;&#33258;&#36523;&#12399;&#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#33258;&#20998;&#12398;&#12467;&#12540;&#12489;&#12434;&#12524;&#12499;&#12517;&#12540;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12354;&#12427;&#31243;&#24230;&#12394;&#12376;&#12416;&#12414;&#12391;&#12399;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#26082;&#23384;&#12398;&#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;&#12300;&#22900;&#12425;&#12363;&#12425;&#12373;&#12435;&#12374;&#12435;&#25209;&#21028;&#12373;&#12428;&#12427;&#12384;&#12369;&#12391;&#12289;
  &#12371;&#12385;&#12425;&#12363;&#12425;&#12399;&#35328;&#12356;&#36820;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#29366;&#27841;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12289;&#21476;&#26666;&#12398;&#38283;&#30330;&#32773;&#12383;&#12385;&#12395;&#23550;&#12377;&#12427;&#32207;&#25915;&#25731;&#29366;&#24907;&#12395;&#12394;&#12427;&#21361;&#38522;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12434;&#36991;&#12369;&#12427;&#26368;&#33391;&#12398;&#26041;&#27861;&#12399;&#12289;&#12371;&#12428;&#12363;&#12425;&#20309;&#12364;&#36215;&#12371;&#12427;&#12398;&#12363;&#12434;&#24444;&#12425;&#12395;&#35500;&#26126;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#19981;&#24555;&#12395;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12364;&#12381;&#12428;&#12399;&#24403;&#28982;&#12398;&#24515;&#29702;&#12391;&#12354;&#12427;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12356;&#12388;&#12363;&#12399;&#12358;&#12414;&#12367;&#12356;&#12367;&#12424;&#12358;&#12395;&#12394;&#12427;&#12371;&#12392;&#12434;&#35500;&#26126;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#35686;&#21578;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#21069;&#12395;
  &#38281;&#12376;&#12383;&#22580;&#25152;&#12391;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#20844;&#38283;&#12373;&#12428;&#12383;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;
  &#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#26041;&#24335;&#12364;&#26032;&#12375;&#12367;&#12394;&#12387;&#12383;&#12301;&#12300;&#12394;&#12428;&#12427;&#12395;&#12399;&#23569;&#12293;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#30693;&#12425;&#12379;&#12427;&#12398;&#12418;&#21177;&#26524;&#30340;&#12391;&#12377;&#12290;
  &#19968;&#30058;&#12356;&#12356;&#12398;&#12399;&#12289;&#12394;&#12395;&#12363;&#20363;&#12434;&#31034;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#26082;&#23384;&#12398;&#38283;&#30330;&#32773;&#12383;&#12385;&#12364;&#12354;&#12414;&#12426;&#21021;&#24515;&#32773;&#12398;&#36074;&#21839;&#12395;&#31572;&#12360;&#12390;&#12356;&#12394;&#12356;&#12424;&#12358;&#12394;&#12425;&#12289;
  &#24444;&#12425;&#12395;&#12300;&#12418;&#12387;&#12392;&#36820;&#20107;&#12434;&#26360;&#12356;&#12390;&#12354;&#12370;&#12390;&#12424;&#12301;&#12392;&#12356;&#12387;&#12390;&#12418;&#12354;&#12414;&#12426;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12425;&#12399;&#21336;&#12395;&#12289;&#12393;&#12358;&#31572;&#12360;&#12428;&#12400;&#12356;&#12356;&#12398;&#12363;&#12364;&#12431;&#12363;&#12425;&#12394;&#12356;&#12384;&#12369;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#20182;&#20154;&#12398;&#36074;&#21839;&#12395;&#31572;&#12360;&#12427;&#12424;&#12426;&#12418;
  &#23455;&#38555;&#12395;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12411;&#12358;&#12364;&#22823;&#20999;&#12384;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12425;&#12434;&#36074;&#21839;&#12395;&#31572;&#12360;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12414;&#12378;&#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#12362;&#25163;&#26412;&#12434;&#35211;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#12289;&#35504;&#12363;&#12398;&#36074;&#21839;&#12395;&#23550;&#12375;&#12390;&#31572;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#36074;&#21839;&#12434;&#12358;&#12414;&#12367;&#12373;&#12400;&#12367;&#12384;&#12369;&#12398;&#23554;&#38272;&#30693;&#35672;&#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
  &#12381;&#12428;&#12395;&#23550;&#24540;&#12391;&#12365;&#12427;&#38283;&#30330;&#32773;&#12395;&#26126;&#31034;&#30340;&#12395;&#23550;&#24540;&#12434;&#20381;&#38972;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#24444;&#12364;&#30906;&#12363;&#12395;&#31572;&#12360;&#12434;&#36820;&#12377;&#12371;&#12392;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#20309;&#12425;&#12363;&#12398;&#36820;&#20107;&#12434;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#38263;&#24180;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12365;&#12383;&#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#12399;
  &#12393;&#12358;&#12375;&#12390;&#12418;&#38281;&#12376;&#12383;&#22580;&#12391;&#12398;&#35696;&#35542;&#12398;&#12411;&#12358;&#12364;&#12420;&#12426;&#12420;&#12377;&#12367;&#24863;&#12376;&#12425;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12399;&#12378;&#12387;&#12392;&#12381;&#12358;&#12375;&#12390;&#12365;&#12383;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12381;&#12435;&#12394;&#12371;&#12392;&#12364;&#36215;&#12371;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#20869;&#36650;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#21205;&#12365;&#12418;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;
  &#24517;&#35201;&#12394;&#35696;&#35542;&#12399;&#20844;&#38283;&#12398;&#22580;&#12391;&#34892;&#12358;&#12424;&#12358;&#12395;&#24444;&#12425;&#12434;&#35480;&#23566;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12428;&#12414;&#12391;&#12399;&#38281;&#12376;&#12383;&#29872;&#22659;&#12395;&#12354;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;
  &#12371;&#12428;&#12425;&#20197;&#22806;&#12395;&#12418;&#38263;&#26399;&#30340;&#12394;&#25080;&#26696;&#20107;&#38917;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  <a class="xref" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;">5&#31456;<i>&#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</i></a> &#12391;&#12399;&#12289;&#32102;&#26009;&#12434;&#12418;&#12425;&#12387;&#12390;&#38283;&#30330;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12392;
  &#28961;&#20767;&#12391;&#38283;&#30330;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12392;&#12434;&#12358;&#12414;&#12367;&#20849;&#23384;&#12373;&#12379;&#12427;&#26041;&#27861;&#12434;&#32771;&#12360;&#12414;&#12377;&#12290;&#12414;&#12383;
  <a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a> &#12391;&#12399;&#12289;&#27861;&#30340;&#12394;&#21162;&#21147;&#12398;&#24517;&#35201;&#24615;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#12414;&#12377;&#12290;
  &#20182;&#12398;&#22243;&#20307;&#12364;&#26360;&#12356;&#12383;&#12289;&#12354;&#12427;&#12356;&#12399; "&#25152;&#26377;&#12375;&#12390;&#12356;&#12427;" &#12467;&#12540;&#12489;&#12434;&#21547;&#12416;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20844;&#38283;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
  &#12381;&#12428;&#12394;&#12426;&#12398;&#27880;&#24847;&#12364;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp678736" href="#idp678736" class="para">13</a>] </sup>
      &#12371;&#12371;&#12414;&#12391;&#12399;&#12414;&#12384;&#20491;&#20154;&#12398;&#21517;&#21069;&#12434;&#25369;&#12370;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12364;&#12289;
      &#12371;&#12428;&#20197;&#38477;&#12391;&#12399;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#21517;&#21069;&#12434;&#25369;&#12370;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12356;&#12358;&#12300;&#21957;&#12366;&#20184;&#12369;&#12383;&#20154;&#12301;
      &#12392;&#12399; Brian Behlendorf &#12398;&#12371;&#12392;&#12391;&#12377;&#12290;&#24444;&#12399;&#12289;
      &#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12398;&#20405;&#23475;&#12398;&#24656;&#12428;&#12364;&#12394;&#12356;&#35696;&#35542;&#12399;&#12377;&#12409;&#12390;&#20844;&#38283;&#12398;&#22580;&#12391;&#34892;&#12358;&#12409;&#12365;&#12384;&#12392;&#12356;&#12358;&#19968;&#33324;&#35542;&#12434;&#25351;&#25688;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp641696" href="#idp641696" class="para">14</a>] </sup>
      &#12371;&#12428;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12372;&#12367;&#19968;&#33324;&#30340;&#12395;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#26041;&#27861;&#12434;&#31034;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
      &#12424;&#12426;&#20013;&#22830;&#38598;&#27177;&#30340;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#35079;&#25968;&#12398;&#20154;&#12364;&#38598;&#12414;&#12387;&#12390;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#12503;&#12522;&#12531;&#12488;&#12450;&#12454;&#12488;&#12434;&#35211;&#12388;&#12417;&#12289;
      &#29305;&#23450;&#12398;&#21839;&#38988;&#12420;&#12497;&#12479;&#12540;&#12531;&#12434;&#25506;&#12377;&#12371;&#12392;&#12434;&#31216;&#12375;&#12390; "&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;" &#12392;&#12356;&#12358;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="license-quickstart.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="announcing.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#36984;&#25246;&#12392;&#36969;&#29992; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#24195;&#22577;</td></tr></table></div></body></html>
