<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><link rel="prev" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><link rel="next" href="transitions.html" title="&#24341;&#12365;&#32153;&#12366;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="managing-volunteers.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</th><td width="20%" align="right"> <a accesskey="n" href="transitions.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="share-management"></a>&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;</h2></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12367;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;
  &#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#35079;&#38609;&#12395;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;
  &#12513;&#12531;&#12496;&#12540;&#12420;&#24773;&#22577;&#12398;&#27969;&#12428;&#12398;&#31649;&#29702;&#20316;&#26989;&#12364;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#31649;&#29702;&#20316;&#26989;&#12384;&#12387;&#12390;&#12415;&#12435;&#12394;&#12391;&#21332;&#21147;&#12375;&#12390;&#12420;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#21029;&#12395;&#12488;&#12483;&#12503;&#12480;&#12454;&#12531;&#12398;&#38542;&#23652;&#12364;&#12394;&#12367;&#12383;&#12387;&#12390;&#12381;&#12428;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#34892;&#12358;&#20316;&#26989;&#12392;&#12356;&#12358;&#12398;&#12399;&#36557;&#38538;&#24335;&#12398;&#21629;&#20196;&#31995;&#32113;&#12391;&#12399;&#12394;&#12367;
  &#12500;&#12450;&#12484;&#12540;&#12500;&#12450;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12488;&#12509;&#12525;&#12472;&#12540;&#12395;&#36817;&#12356;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12300;&#9675;&#9675;&#31649;&#29702;&#32773;&#12301;&#12434;&#27491;&#24335;&#12395;&#20219;&#21629;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12428;&#12400;&#12289;
  &#12381;&#12398;&#22580;&#12398;&#12494;&#12522;&#12391;&#27770;&#12417;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#12300;&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;
  &#12300;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;&#12300;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;
  &#12300;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540; (&#38750;&#20844;&#24335;&#12391;&#12377;&#12364;)&#12301;&#12381;&#12375;&#12390;
  &#12300;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;&#12364;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#20013;&#12395;&#12399;&#24847;&#35672;&#12375;&#12390;&#20219;&#21629;&#12375;&#12383;&#12418;&#12398;&#12418;&#12354;&#12428;&#12400;&#12289;
  &#21213;&#25163;&#12395;&#31435;&#20505;&#35036;&#12375;&#12390;&#12367;&#12428;&#12383;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25104;&#38263;&#12377;&#12427;&#12395;&#12388;&#12428;&#12390;&#12289;
  &#12373;&#12425;&#12395;&#12356;&#12429;&#12356;&#12429;&#12394;&#24441;&#21106;&#12364;&#36861;&#21152;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#20197;&#19979;&#12391;&#12289;&#12371;&#12428;&#12425;&#12398;&#24441;&#21106; (&#12395;&#21152;&#12360;&#12390;&#12373;&#12425;&#12395;&#12356;&#12367;&#12388;&#12363;&#12398;&#12418;&#12398;)
  &#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377; (&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#12388;&#12356;&#12390;&#12399;&#30465;&#30053;&#12375;&#12414;&#12377;&#12290;
  &#12377;&#12391;&#12395; <span>&#26412;&#31456;&#12398;&#21069;&#21322;&#12398;</span>
  <a class="xref" href="stabilizing-a-release.html#release-manager" title="&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;</a> &#12420;
  <a class="xref" href="stabilizing-a-release.html#release-owner" title="&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;&#12301;</a> &#12391;&#21462;&#12426;&#19978;&#12370;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;)&#12290;
</p><p>
  &#20197;&#19979;&#12398;&#35500;&#26126;&#12434;&#35501;&#12416;&#12395;&#12354;&#12383;&#12387;&#12390;&#12399;&#12289;
  &#12371;&#12428;&#12425;&#12398;&#24441;&#21106;&#12398;&#25285;&#24403;&#31684;&#22258;&#12364;&#12364;&#27770;&#12375;&#12390;&#12362;&#20114;&#12356;&#12395;&#25490;&#20182;&#30340;&#12394;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#21839;&#38988;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12391;&#12394;&#12367;&#12390;&#12418;&#21839;&#38988;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  FAQ &#12398;&#32232;&#38598;&#27177;&#12434; FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#29420;&#21344;&#12373;&#12379;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#24441;&#21106;&#12392;&#12356;&#12358;&#12398;&#12399;&#12354;&#12367;&#12414;&#12391;&#12418;&#36012;&#20219;&#12398;&#31684;&#22258;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  &#29420;&#21344;&#12373;&#12379;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21508;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#20181;&#20107;&#12391;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;
  &#12300;&#35504;&#12363;&#12364;&#33258;&#20998;&#12398;&#25285;&#24403;&#20998;&#37326;&#12398;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27671;&#12389;&#12356;&#12383;&#12425;&#12289;
  &#12381;&#12398;&#20154;&#12364;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12369;&#12427;&#12424;&#12358;&#12395;&#33258;&#20998;&#12398;&#26041;&#37341;&#12434;&#20253;&#12360;&#12427;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12415;&#12435;&#12394;&#12398;&#20316;&#26989;&#12364;&#31478;&#21512;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;&#33258;&#20998;&#12398;&#25285;&#24403;&#20998;&#37326;&#12398;&#20316;&#26989;&#25163;&#38918;&#26360;&#12434;&#20316;&#25104;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#20316;&#26989;&#12434;&#12391;&#12365;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;
  &#35504;&#12363;&#12364;&#12377;&#12368;&#12395;&#24460;&#12434;&#24341;&#12365;&#32153;&#12368;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
  &#29305;&#23450;&#12398;&#24441;&#21106;&#12434;&#24076;&#26395;&#12377;&#12427;&#20154;&#12364;&#35079;&#25968;&#12354;&#12425;&#12431;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#12381;&#12428;&#12434;&#12358;&#12414;&#12367;&#20966;&#29702;&#12377;&#12427;&#26041;&#27861;&#12395;&#12399;&#12300;&#12371;&#12428;&#12364;&#27491;&#35299;!&#12301;&#12392;&#12356;&#12358;&#12418;&#12398;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#24076;&#26395;&#32773;&#12395;&#25152;&#20449;&#34920;&#26126;&#12434;&#20986;&#12375;&#12390;&#12418;&#12425;&#12356;&#12289;
  &#12381;&#12428;&#12434;&#12418;&#12392;&#12395;&#12467;&#12511;&#12483;&#12479;&#12540;&#12395;&#12424;&#12427;&#25237;&#31080;&#12434;&#34892;&#12358;&#12392;&#12356;&#12358;&#25163;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12371;&#12428;&#12399;&#38754;&#20498;&#12391;&#12377;&#12375;&#12289;&#24460;&#12395;&#23614;&#12434;&#24341;&#12356;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12424;&#12426;&#12399;&#12289;&#24076;&#26395;&#32773;&#12383;&#12385;&#12364;&#12362;&#20114;&#12356;&#12395;&#35441;&#12375;&#21512;&#12387;&#12390;&#27770;&#12417;&#12390;&#12418;&#12425;&#12358;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#32080;&#26524;&#12364;&#12393;&#12358;&#12391;&#12354;&#12428;&#12289;
  &#20182;&#20154;&#12395;&#27770;&#12417;&#12425;&#12428;&#12390;&#12375;&#12414;&#12358;&#12424;&#12426;&#12399;&#28288;&#36275;&#12398;&#12356;&#12367;&#12418;&#12398;&#12395;&#12394;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;"><div class="titlepage"><div><div><h3 class="title"><a name="patch-manager"></a>&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</h3></div></div></div><p>
  &#12497;&#12483;&#12481;&#12364;&#12383;&#12367;&#12373;&#12435;&#36865;&#12425;&#12428;&#12390;&#12367;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
  &#12300;&#12393;&#12435;&#12394;&#12497;&#12483;&#12481;&#12364;&#25237;&#31295;&#12373;&#12428;&#12383;&#12398;&#12363;&#12301;&#12300;&#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#12393;&#12358;&#20966;&#29702;&#12377;&#12427;&#12371;&#12392;&#12395;&#12375;&#12383;&#12398;&#12363;&#12301;
  &#12392;&#12356;&#12387;&#12383;&#24773;&#22577;&#12434;&#36861;&#12356;&#12363;&#12369;&#12427;&#12398;&#12399;&#22823;&#22793;&#12391;&#12377;&#12290;
  &#20013;&#22830;&#31649;&#29702;&#20307;&#21046;&#12391;&#12394;&#12356;&#22580;&#21512;&#12394;&#12393;&#12399;&#29305;&#12395;&#12381;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#22823;&#21322;&#12398;&#12497;&#12483;&#12481;&#12399;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38283;&#30330;&#32773;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12373;&#12428;&#12414;&#12377;
  (&#20013;&#12395;&#12399;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#25237;&#31295;&#12375;&#12383;&#12426;
  &#22806;&#37096;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12391;&#20844;&#38283;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
  &#12381;&#12375;&#12390;&#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#20966;&#29702;&#12377;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#20309;&#36890;&#12426;&#12418;&#12398;&#12497;&#12479;&#12540;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#26178;&#12395;&#12399;&#12289;&#12497;&#12483;&#12481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12383;&#32080;&#26524;&#20309;&#12363;&#21839;&#38988;&#12364;&#35211;&#12388;&#12363;&#12426;&#12289;
  &#20803;&#12398;&#25237;&#31295;&#32773;&#12395;&#24046;&#12375;&#25147;&#12375;&#12392;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12420;&#12426;&#21462;&#12426;&#12399;&#12289;&#36890;&#24120;&#12399;&#20309;&#24230;&#12363; (&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;)
  &#32368;&#12426;&#36820;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20803;&#12398;&#25237;&#31295;&#32773;&#12364;&#12497;&#12483;&#12481;&#12434;&#20309;&#24230;&#12363;&#26360;&#12365;&#30452;&#12375;&#12289;
  &#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#20596;&#12364;&#20309;&#12418;&#25991;&#21477;&#12398;&#12388;&#12369;&#12424;&#12358;&#12364;&#12394;&#12367;&#12394;&#12427;&#12414;&#12391;&#12371;&#12428;&#12364;&#32154;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#32368;&#12426;&#36820;&#12375;&#12364;&#12356;&#12388;&#23436;&#20102;&#12377;&#12427;&#12398;&#12363;&#12364;&#12399;&#12387;&#12365;&#12426;&#12431;&#12363;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#12524;&#12499;&#12517;&#12540;&#12375;&#12383;&#20154;&#12364;&#12497;&#12483;&#12481;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12428;&#12400;
  &#12300;&#12371;&#12428;&#12391;&#23436;&#20102;&#12301;&#12392;&#12399;&#12387;&#12365;&#12426;&#12431;&#12363;&#12427;&#12398;&#12391;&#12377;&#12364;&#12289;&#12381;&#12358;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12356;&#12429;&#12356;&#12429;&#12394;&#29702;&#30001;&#12364;&#32771;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
  &#12300;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#26178;&#38291;&#12364;&#12394;&#12356;&#12384;&#12369;&#12301;&#12300;&#12381;&#12418;&#12381;&#12418;&#12381;&#12398;&#20154;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#12364;&#12394;&#12367;&#12289;
  &#20182;&#12398;&#38283;&#30330;&#32773;&#12395;&#12467;&#12511;&#12483;&#12488;&#12434;&#20381;&#38972;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12301;&#12394;&#12393;&#12398;&#29702;&#30001;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12497;&#12483;&#12481;&#12395;&#23550;&#12377;&#12427;&#21453;&#24540;&#12392;&#12375;&#12390;&#12424;&#12367;&#12354;&#12427;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#12497;&#12479;&#12540;&#12531;&#12399;&#12289;
  &#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#12493;&#12479;&#12395;&#12375;&#12390;&#35696;&#35542;&#12364;&#32027;&#31998;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#35696;&#35542;&#12398;&#20869;&#23481;&#12399;&#12497;&#12483;&#12481;&#12381;&#12398;&#12418;&#12398;&#12391;&#12354;&#12427;&#24517;&#35201;&#12399;&#12394;&#12367;&#12289;
  &#12381;&#12398;&#12497;&#12483;&#12481;&#12398;&#32972;&#26223;&#12395;&#12354;&#12427;&#32771;&#12360;&#26041;&#12398;&#12424;&#12375;&#12354;&#12375;&#12395;&#12388;&#12356;&#12390;&#12364;&#35441;&#38988;&#12395;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12427;&#29305;&#23450;&#12398;&#12496;&#12464;&#12434;&#20462;&#27491;&#12377;&#12427;&#12497;&#12483;&#12481;&#12364;&#25237;&#31295;&#12373;&#12428;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#38283;&#30330;&#32773;&#20596;&#12391;&#12399;&#12418;&#12387;&#12392;&#21029;&#12398;&#20462;&#27491;&#26041;&#27861;&#12398;&#12411;&#12358;&#12364;&#12424;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;
  (&#21839;&#38988;&#12434;&#12424;&#12426;&#19968;&#33324;&#21270;&#12375;&#12390;&#12289;&#12418;&#12387;&#12392;&#24195;&#12356;&#31684;&#22258;&#12434;&#20462;&#27491;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#12356;&#12427;&#12394;&#12393;)
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#38283;&#30330;&#32773;&#20596;&#12398;&#32771;&#12360;&#12427;&#20462;&#27491;&#26041;&#27861;&#12399;&#12289;
  &#20309;&#12418;&#20197;&#21069;&#12363;&#12425;&#38957;&#12395;&#12354;&#12387;&#12383;&#12418;&#12398;&#12391;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#25237;&#31295;&#12373;&#12428;&#12383;&#12497;&#12483;&#12481;&#12434;&#35211;&#12427;&#12371;&#12392;&#12391;&#12289;&#21029;&#12398;&#20462;&#27491;&#26041;&#27861;&#12434;&#12402;&#12425;&#12417;&#12367;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12383;&#12414;&#12395;&#12289;&#25237;&#31295;&#12375;&#12383;&#12497;&#12483;&#12481;&#12364;&#23436;&#20840;&#12395;&#12473;&#12523;&#12540;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;<span class="emphasis"><em>&#12383;&#12414;&#12383;&#12414;</em></span>
  &#12381;&#12398;&#12392;&#12365;&#12395;&#12497;&#12483;&#12481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#26247;&#12398;&#12354;&#12427;&#38283;&#30330;&#32773;&#12364;&#12356;&#12394;&#12363;&#12387;&#12383;&#12384;&#12369;
  (&#12415;&#12435;&#12394;&#12289;&#35504;&#12363;&#20182;&#12398;&#20154;&#12364;&#12415;&#12390;&#12367;&#12428;&#12427;&#12384;&#12429;&#12358;&#12392;&#24605;&#12387;&#12390;&#12356;&#12383;&#12384;&#12369;)
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#22810;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;&#12300;&#35504;&#12363;&#12364;&#30456;&#25163;&#12434;&#12377;&#12427;&#12398;&#12434;&#24453;&#12388;&#12301;
  &#12398;&#12395;&#26178;&#38291;&#12398;&#21046;&#38480;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;&#12381;&#12428;&#20197;&#22806;&#12395;&#12418;&#37325;&#35201;&#12394;&#20316;&#26989;&#12399;&#12356;&#12367;&#12425;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12363;&#12367;&#12375;&#12390;&#12381;&#12398;&#12497;&#12483;&#12481;&#12399;&#35504;&#12398;&#30446;&#12395;&#12392;&#12414;&#12427;&#12371;&#12392;&#12418;&#12394;&#12367;&#12420;&#12415;&#12395;&#33900;&#12426;&#21435;&#12425;&#12428;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#12379;&#12387;&#12363;&#12367;&#12398;&#26377;&#29992;&#12394;&#12497;&#12483;&#12481;&#12364;&#12371;&#12435;&#12394;&#12371;&#12392;&#12391;&#35211;&#36942;&#12372;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12373;&#12425;&#12395;&#24746;&#12356;&#21103;&#20316;&#29992;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12379;&#12387;&#12363;&#12367;&#26178;&#38291;&#12434;&#21106;&#12356;&#12390;&#12367;&#12428;&#12383;
  &#12497;&#12483;&#12481;&#20316;&#32773;&#12398;&#12420;&#12427;&#27671;&#12434;&#12381;&#12356;&#12391;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12373;&#12425;&#12395;&#12300;&#12497;&#12483;&#12481;&#12398;&#12402;&#12392;&#12388;&#12391;&#12418;&#26360;&#12356;&#12390;&#12420;&#12429;&#12358;&#12363;&#12301;
  &#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12381;&#12398;&#20182;&#12398;&#20154;&#12383;&#12385;&#12395;&#12392;&#12387;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#39749;&#21147;&#12354;&#12427;&#12418;&#12398;&#12395;&#12399;&#35211;&#12360;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#24441;&#21106;&#12399;&#12289;&#12371;&#12398;&#25163;&#12398;&#12300;&#38343;&#12395;&#33900;&#12426;&#21435;&#12425;&#12428;&#12390;&#12375;&#12414;&#12358;&#12301;
  &#12497;&#12483;&#12481;&#12434;&#12394;&#12367;&#12377;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12395;&#12289;
  &#27425;&#12398;&#12424;&#12358;&#12394;&#25163;&#38918;&#12391;&#12377;&#12409;&#12390;&#12398;&#12497;&#12483;&#12481;&#12434;&#23433;&#23450;&#12375;&#12383;&#29366;&#24907;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12377;&#12409;&#12390;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#30435;&#35222;&#12375;&#12289;
  &#12497;&#12483;&#12481;&#12434;&#21547;&#12416;&#25237;&#31295;&#12434;&#25342;&#12356;&#20986;&#12375;&#12414;&#12377;&#12290;
  &#26368;&#32066;&#30340;&#12395;&#12381;&#12398;&#12497;&#12483;&#12481;&#12364;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#29305;&#12395;&#20309;&#12418;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12524;&#12499;&#12517;&#12540;&#12392;&#20462;&#27491;&#12434;&#32368;&#12426;&#36820;&#12375;&#12383;&#32080;&#26524;&#12289;&#26368;&#32066;&#29256;&#12398;&#12497;&#12483;&#12481;&#12364;&#12414;&#12384;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#22580;&#21512;&#12399;&#12289;
  &#26368;&#32066;&#29256;&#12398;&#12497;&#12483;&#12481; (&#12392;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12398;&#35696;&#35542;) &#12434;&#21839;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#25237;&#31295;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#38283;&#30330;&#32773;&#12364;&#24460;&#12391;&#12381;&#12398;&#35352;&#37682;&#12434;&#36861;&#12358;&#12398;&#12364;&#23481;&#26131;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12497;&#12483;&#12481;&#12364;&#29305;&#23450;&#12398;&#21839;&#38988;&#12434;&#20462;&#27491;&#12377;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12394;&#12425;&#12289;
  &#21839;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#19978;&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12381;&#12398;&#21839;&#38988;&#12398;&#12467;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#12497;&#12483;&#12481;&#12398;&#24773;&#22577;&#12434;&#21152;&#12360;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#26032;&#12383;&#12394;&#21839;&#38988;&#12392;&#12375;&#12390;&#25237;&#31295;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12497;&#12483;&#12481;&#12395;&#23550;&#12377;&#12427;&#21453;&#24540;&#12364;&#20309;&#12418;&#12394;&#12356;&#12414;&#12414;&#25968;&#26085;&#12364;&#32076;&#36942;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#12300;&#35504;&#12363;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#20154;&#12399;&#12356;&#12414;&#12379;&#12435;&#12363;?&#12301;&#12392;&#12501;&#12457;&#12525;&#12540;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#26222;&#36890;&#12399;&#20309;&#12425;&#12363;&#12398;&#21453;&#24540;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12300;&#12381;&#12398;&#12497;&#12483;&#12481;&#12399;&#36969;&#29992;&#12377;&#12427;&#20385;&#20516;&#12364;&#12354;&#12427;&#12392;&#12399;&#24605;&#12360;&#12394;&#12356;&#12290;&#12394;&#12380;&#12394;&#12425;&#8230;&#8230;&#12301;
  &#12392;&#12363;&#12300;&#12376;&#12419;&#12354;&#31169;&#12364;&#12524;&#12499;&#12517;&#12540;&#12375;&#12414;&#12375;&#12423;&#12358;&#12363;?&#12301;&#12394;&#12393;&#12391;&#12377;&#12290;
  &#21453;&#24540;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#20808;&#12411;&#12393;&#35500;&#26126;&#12375;&#12383;&#12424;&#12358;&#12394;&#25163;&#38918;&#12391;&#20966;&#29702;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12391;&#12418;&#35504;&#12418;&#21453;&#24540;&#12375;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;
  &#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#21839;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#30331;&#37682;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#21028;&#26029;&#12391;&#27770;&#12417;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12497;&#12483;&#12481;&#12398;&#25237;&#31295;&#32773;&#12395;&#23550;&#12375;&#12390;&#12399; <span class="emphasis"><em>&#20309;&#12425;&#12363;&#12398;</em></span>
  &#21453;&#24540;&#12434;&#36820;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#20219;&#21629;&#12375;&#12383;&#12362;&#12363;&#12370;&#12391;&#12289;
  Subversion &#12398;&#38283;&#30330;&#12481;&#12540;&#12512;&#12399;&#26178;&#38291;&#12392;&#27671;&#21147;&#12434;&#22823;&#24133;&#12395;&#31680;&#32004;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#23554;&#20219;&#12398;&#25285;&#24403;&#32773;&#12364;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;&#38283;&#30330;&#32773;&#12415;&#12435;&#12394;&#12364;
  &#12300;&#20170;&#12377;&#12368;&#12395;&#12399;&#36820;&#20107;&#12391;&#12365;&#12381;&#12358;&#12395;&#12394;&#12356;&#12369;&#12428;&#12393;&#12289;&#35504;&#12363;&#20182;&#12398;&#20154;&#12364;&#21453;&#24540;&#12375;&#12390;&#12367;&#12428;&#12427;&#12398;&#12363;&#12394;&#12354;?
  &#12381;&#12428;&#12392;&#12418;&#31169;&#12364;&#24460;&#12391;&#23550;&#24540;&#12375;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12398;&#12363;&#12394;?
  &#12391;&#12418;&#12289;&#12418;&#12375;&#35504;&#12363;&#20182;&#12398;&#20154;&#12418;&#21516;&#12376;&#12424;&#12358;&#12395;&#32771;&#12360;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#26178;&#38291;&#12398;&#28961;&#39364;&#12384;&#12394;&#12354;&#12301;
  &#12392;&#24120;&#12395;&#24515;&#37197;&#12377;&#12427;&#12399;&#12417;&#12395;&#12394;&#12387;&#12390;&#12356;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#35023;&#35501;&#12415;&#12434;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#21508;&#38283;&#30330;&#32773;&#12399;&#12289;&#12497;&#12483;&#12481;&#12434;&#35211;&#12383;&#12392;&#12365;&#12398;&#29366;&#27841;&#12395;&#24540;&#12376;&#12390;&#12393;&#12358;&#20966;&#29702;&#12377;&#12427;&#12363;&#12434;&#27770;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12381;&#12428;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12383;&#12356;&#12398;&#12394;&#12425;&#12381;&#12358;&#12375;&#12414;&#12377;&#12290;
  &#12510;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#36969;&#20999;&#12395;&#12501;&#12457;&#12525;&#12540;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#23436;&#20840;&#12395;&#28961;&#35222;&#12375;&#12383;&#12356;&#12398;&#12394;&#12425;&#12381;&#12428;&#12418;&#32080;&#27083;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#35211;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#12365;&#12385;&#12435;&#12392;&#25201;&#12387;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#20181;&#32068;&#12415;&#12364;&#12358;&#12414;&#12367;&#21205;&#20316;&#12377;&#12427;&#12398;&#12399;&#12289;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#12365;&#12385;&#12435;&#12392;&#20966;&#29702;&#12375;&#12390;&#12367;&#12428;&#12427;&#12392;&#12415;&#12435;&#12394;&#12364;&#20449;&#38972;&#12391;&#12365;&#12427;&#12392;&#12365;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12371;&#12398;&#24441;&#21106;&#12398;&#25285;&#24403;&#32773;&#12399;&#12494;&#12522;&#12391;&#27770;&#12417;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#27491;&#24335;&#12394;&#25163;&#32154;&#12365;&#12434;&#36367;&#12435;&#12391;&#27770;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12399;&#12289;&#12414;&#12378;&#38283;&#30330;&#32773;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12392;
  &#12518;&#12540;&#12470;&#12540;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#21578;&#30693;&#12434;&#34892;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#20309;&#20154;&#12363;&#12364;&#31435;&#20505;&#35036;&#12375;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;&#26368;&#21021;&#12395;&#36820;&#20107;&#12434;&#12367;&#12428;&#12383;&#20154;&#12434;&#25285;&#24403;&#32773;&#12392;&#12375;&#12390;&#20219;&#21629;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#24460;&#12395;&#12381;&#12398;&#20154;&#12364;&#25285;&#24403;&#12434;&#38477;&#12426;&#12383;&#12392;&#12365; (<span>&#26412;&#31456;&#12398;&#24460;&#21322;&#12398;</span>
  <a class="xref" href="transitions.html" title="&#24341;&#12365;&#32153;&#12366;">&#12300;&#24341;&#12365;&#32153;&#12366;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
  &#12395;&#12418;&#12289;&#21516;&#12376;&#25163;&#38918;&#12434;&#32368;&#12426;&#36820;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#21516;&#26178;&#12395;&#35079;&#25968;&#21517;&#12434;&#20219;&#21629;&#12377;&#12427;&#12371;&#12392;&#12399;&#27770;&#12375;&#12390;&#12375;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
  &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12358;&#12377;&#12427;&#12392;&#25285;&#24403;&#32773;&#38291;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#25163;&#38291;&#12364;&#12363;&#12363;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12497;&#12483;&#12481;&#12398;&#37327;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#22810;&#12356;&#22580;&#21512;&#12395;&#12399;
  &#35079;&#25968;&#25285;&#24403;&#32773;&#21046;&#12434;&#25975;&#12367;&#12398;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;"><div class="titlepage"><div><div><h3 class="title"><a name="translation-manager"></a>&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</h3></div></div></div><p>
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427; "&#32763;&#35379;"
  &#12395;&#12399;&#12289;&#12405;&#12383;&#12388;&#12398;&#30064;&#12394;&#12427;&#24847;&#21619;&#21512;&#12356;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#32763;&#35379;&#12377;&#12427;&#12371;&#12392;&#12392;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12381;&#12398;&#12418;&#12398;&#12434;&#32763;&#35379;&#12377;&#12427;
  (&#12456;&#12521;&#12540;&#34920;&#31034;&#12420;&#12504;&#12523;&#12503;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12518;&#12540;&#12470;&#12540;&#12398;&#22909;&#12365;&#12394;&#35328;&#35486;&#12391;&#34920;&#31034;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;)
  &#12371;&#12392;&#12391;&#12377;&#12290;&#12393;&#12385;&#12425;&#12418;&#35079;&#38609;&#12394;&#20316;&#26989;&#12391;&#12377;&#12364;&#12289;&#12356;&#12387;&#12383;&#12435;&#20181;&#32068;&#12415;&#12434;&#30906;&#31435;&#12375;&#12390;&#12375;&#12414;&#12360;&#12400;
  &#12371;&#12428;&#12399;&#20182;&#12398;&#38283;&#30330;&#12392;&#12399;&#20998;&#12369;&#12390;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12393;&#12385;&#12425;&#12398;&#32763;&#35379;&#12418;&#12420;&#12427;&#12371;&#12392;&#12399;&#12411;&#12412;&#21516;&#12376;&#12394;&#12398;&#12391;&#12289;(&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;)
  &#20001;&#26041;&#12398;&#20316;&#26989;&#12434;&#19968;&#20154;&#12398;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#31649;&#29702;&#12375;&#12390;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#20154;&#12395;&#31649;&#29702;&#12373;&#12379;&#12390;&#12418;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#19968;&#20154;&#12398;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#20001;&#26041;&#12434;&#31649;&#29702;&#12373;&#12379;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#24444;&#12364;&#23455;&#38555;&#12395;&#33258;&#20998;&#12391;&#32763;&#35379;&#12434;&#34892;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12402;&#12392;&#12388;&#12420;&#12405;&#12383;&#12388;&#12398;&#35328;&#35486;&#12395;&#12388;&#12356;&#12390;&#12399;&#20316;&#26989;&#12391;&#12365;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#12418;&#12375;&#12377;&#12409;&#12390;&#12398;&#32763;&#35379;&#12434;&#33258;&#20998;&#12391;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;&#29694;&#26178;&#28857;&#12391;&#24444;&#12399;
  10&#12363;&#22269;&#35486; (&#26041;&#35328;&#12418;&#32771;&#24942;&#12377;&#12427;&#12392;12&#12363;&#22269;&#35486;) &#12434;&#25805;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;!
  &#12381;&#12428;&#12399;&#28961;&#29702;&#12394;&#12398;&#12391;&#12289;&#24444;&#12399;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#32763;&#35379;&#32773;&#12398;&#12481;&#12540;&#12512;&#12434;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#24444;&#12398;&#20181;&#20107;&#12399;&#32763;&#35379;&#32773;&#12383;&#12385;&#12364;&#12362;&#20114;&#12356;&#12395;&#21332;&#21147;&#12375;&#21512;&#12360;&#12427;&#12424;&#12358;&#12395;&#25903;&#25588;&#12377;&#12427;&#12371;&#12392;&#12391;&#12354;&#12426;&#12289;
  &#32763;&#35379;&#12481;&#12540;&#12512;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12369;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12395;&#12289;
  &#32763;&#35379;&#32773;&#12383;&#12385;&#12399;&#19968;&#33324;&#30340;&#12394;&#38283;&#30330;&#32773;&#12392;&#12399;&#23569;&#12375;&#30064;&#12394;&#12427;&#12392;&#12356;&#12358;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#24444;&#12425;&#12398;&#20013;&#12395;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#20351;&#29992;&#32076;&#39443;&#12364;&#27973;&#12356;&#20154;&#12418;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#12481;&#12540;&#12512;&#12398;&#19968;&#21729;&#12392;&#12375;&#12390;&#20685;&#12356;&#12383;&#12371;&#12392;&#12398;&#12394;&#12356;&#20154;&#12364;&#12356;&#12427;&#21487;&#33021;&#24615;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12434;&#21029;&#12395;&#12377;&#12428;&#12400;&#12289;&#24444;&#12425;&#12399;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12392;&#12375;&#12390;&#26368;&#39640;&#12398;&#20154;&#12383;&#12385;&#12391;&#12354;&#12427;&#12392;&#12418;&#12356;&#12360;&#12414;&#12377;&#12290;
  &#29305;&#23450;&#12398;&#20998;&#37326;&#12395;&#38306;&#12377;&#12427;&#30693;&#35672;&#12434;&#25345;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#12381;&#12428;&#12434;&#29983;&#12363;&#12375;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21332;&#21147;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#24444;&#12425;&#12399;&#12289;&#20316;&#26989;&#12434;&#12377;&#12427;&#12383;&#12417;&#12394;&#12425;&#12424;&#12429;&#12371;&#12435;&#12391;&#21193;&#24375;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12425;&#12395;&#24517;&#35201;&#12394;&#12398;&#12399;&#12289;&#12393;&#12358;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12363;&#12434;&#25945;&#12360;&#12390;&#12354;&#12370;&#12427;&#20154;&#12391;&#12377;&#12290;
  &#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;&#32763;&#35379;&#20316;&#26989;&#12364;&#36890;&#24120;&#12398;&#38283;&#30330;&#12434;&#19981;&#35201;&#12395;&#22952;&#12370;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12375;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#32763;&#35379;&#32773;&#20840;&#20307;&#12398;&#20195;&#34920;&#12392;&#12375;&#12390;&#20685;&#12367;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#32763;&#35379;&#20316;&#26989;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12424;&#12358;&#12394;&#22793;&#26356;&#12434;&#38283;&#30330;&#32773;&#12364;&#34892;&#12387;&#12383;&#22580;&#21512;&#12395;&#12289;
  &#12381;&#12428;&#12434;&#32763;&#35379;&#32773;&#12383;&#12385;&#12395;&#20253;&#12360;&#12427;&#12398;&#12364;&#12381;&#12398;&#24441;&#30446;&#12391;&#12377;&#12290;
</p><p>
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#12392;&#12387;&#12390;&#19968;&#30058;&#22823;&#20999;&#12394;&#12398;&#12399;
  &#25216;&#34899;&#30340;&#12394;&#33021;&#21147;&#12391;&#12399;&#12394;&#12367;&#22806;&#20132;&#21147;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12289;
  &#21508;&#22269;&#35486;&#12398;&#32763;&#35379;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418; 2 &#20154;&#20197;&#19978;&#12391;&#34892;&#12358;&#12371;&#12392;&#12392;&#12356;&#12358;&#27770;&#12414;&#12426;&#12434;&#35373;&#12369;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12358;&#12375;&#12394;&#12356;&#12392;&#12289;&#32763;&#35379;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;Subversion &#12434;&#12510;&#12521;&#12460;&#12471;&#35486;&#12395;&#32763;&#35379;&#12375;&#12383;&#12356;&#12392;&#12356;&#12358;&#20154;&#12364;&#12354;&#12425;&#12431;&#12428;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;6 &#12363;&#26376;&#21069;&#12395;&#21516;&#12376;&#12371;&#12392;&#12434;&#30003;&#12375;&#20986;&#12390;&#12365;&#12383;&#21029;&#12398;&#20154;&#12392;&#12506;&#12450;&#12434;&#32068;&#12414;&#12379;&#12390;&#32763;&#35379;&#12434;&#20219;&#12379;&#12427;&#12363;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#12300;&#12384;&#12428;&#12363;&#12418;&#12358;&#12402;&#12392;&#12426;&#12510;&#12521;&#12460;&#12471;&#35486;&#12398;&#12431;&#12363;&#12427;&#20154;&#12434;&#36899;&#12428;&#12390;&#12365;&#12390;&#12289;
  &#12405;&#12383;&#12426;&#12391;&#20316;&#26989;&#12434;&#12375;&#12390;&#12411;&#12375;&#12356;&#12301;&#12392;&#12362;&#39000;&#12356;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#20154;&#12364;&#38598;&#12414;&#12387;&#12383;&#12425;&#12289;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#24444;&#12425;&#12395;&#36969;&#20999;&#12394;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#27770;&#12414;&#12426;&#20107; (&#12467;&#12511;&#12483;&#12488;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26360;&#12365;&#26041;&#12394;&#12393;)
  &#12434;&#35500;&#26126;&#12375;&#12383;&#12358;&#12360;&#12391;&#24444;&#12425;&#12398;&#20316;&#26989;&#12434;&#35211;&#23432;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12392;&#38283;&#30330;&#32773;&#12392;&#12398;&#12420;&#12426;&#12392;&#12426;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12392;&#21508;&#32763;&#35379;&#12481;&#12540;&#12512;&#12392;&#12398;&#12420;&#12426;&#12392;&#12426;&#12399;&#12289;
  &#36890;&#24120;&#12399;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20803;&#12293;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#35328;&#35486;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#32763;&#35379;&#12398;&#20803;&#12392;&#12394;&#12427;&#35328;&#35486;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12371;&#12428;&#12399;&#33521;&#35486;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20107;&#24773;&#12395;&#12424;&#12387;&#12390;&#12381;&#12428;&#20197;&#22806;&#12398;&#35328;&#35486;&#12392;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12387;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;
  (&#12392;&#12399;&#12356;&#12360;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#19990;&#30028;&#12395;&#24195;&#12417;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;
  &#33521;&#35486;&#12434;&#20351;&#12358;&#12398;&#12364;&#19968;&#30058;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;)&#12290;
</p><p>
  &#12375;&#12363;&#12375;&#12289;&#20491;&#12293;&#12398;&#32763;&#35379;&#12481;&#12540;&#12512;&#20869;&#12391;&#12398;&#12420;&#12426;&#12392;&#12426;&#12399;
  &#24444;&#12425;&#12398;&#35328;&#35486;&#12391;&#34892;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#20181;&#20107;&#12398;&#12402;&#12392;&#12388;&#12399;&#12289;
  &#20491;&#12293;&#12398;&#32763;&#35379;&#12481;&#12540;&#12512;&#29992;&#12395;&#23554;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#29992;&#24847;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#32763;&#35379;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12434;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#26412;&#20307;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12376;&#12419;&#12414;&#12434;&#12379;&#12378;&#12395;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#26412;&#20307;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#32763;&#35379;&#12398;&#35696;&#35542;&#12434;&#12375;&#12390;&#12418;&#12289;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399;&#12381;&#12398;&#35328;&#35486;&#12434;&#29702;&#35299;&#12391;&#12365;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
</p><div class="sidebar" title="&#22269;&#38555;&#21270; (Internationalization) &#12392;&#22320;&#22495;&#21270; (Localization)"><a name="i7n"></a><div class="titlepage"><div><div><p class="title"><b>&#22269;&#38555;&#21270; (Internationalization) &#12392;&#22320;&#22495;&#21270; (Localization)</b></p></div></div></div><p>
    <em class="firstterm">&#22269;&#38555;&#21270;</em>
    (<em class="firstterm">I18N</em>) &#12392; <em class="firstterm">&#22320;&#22495;&#21270;</em>
    (<em class="firstterm">L10N</em>) &#12399;&#12393;&#12385;&#12425;&#12418;&#12289;
    &#20803;&#12293;&#12398;&#35328;&#35486;&#12420;&#25991;&#21270;&#20197;&#22806;&#12398;&#29872;&#22659;&#12391;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#21205;&#20316;&#12373;&#12379;&#12427;&#12383;&#12417;&#12398;&#25163;&#32154;&#12365;&#12398;&#12371;&#12392;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12425;&#12398;&#29992;&#35486;&#12399;&#12424;&#12367;&#28151;&#21516;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#27491;&#30906;&#12395;&#12399;&#30064;&#12394;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    <a class="ulink" href="http://en.wikipedia.org/wiki/G11n" target="_top">http://en.wikipedia.org/wiki/G11n</a> &#12395;&#12424;&#12427;&#12392;&#12289;
    &#12381;&#12398;&#36949;&#12356;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  </p><div class="blockquote"><blockquote class="blockquote"><p>
       The distinction between them is subtle but important:
       Internationalization is the adaptation of products
       for <span class="emphasis"><em>potential</em></span> use virtually everywhere, while
       localization is the addition of special features for use in
       a <span class="emphasis"><em>specific</em></span> locale.
     </p><p>
       (&#12371;&#12428;&#12425;&#12398;&#36949;&#12356;&#12399;&#12289;&#20123;&#32048;&#12394;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;
       &#22269;&#38555;&#21270;&#12392;&#12399;&#12289;&#12381;&#12398;&#35069;&#21697;&#12434;&#20107;&#23455;&#19978;&#12393;&#12398;&#22269;&#12391;&#12418;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;
       &#22320;&#22495;&#21270;&#12392;&#12399;&#29305;&#23450;&#12398;&#27231;&#33021;&#12434; <span class="emphasis"><em>&#29305;&#23450;&#12398;</em></span>
       &#12525;&#12465;&#12540;&#12523;&#12391;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;)&#12290;
     </p></blockquote></div><p>
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12394;&#12383;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;
    Unicode (<a class="ulink" href="http://ja.wikipedia.org/wiki/Unicode" target="_top">http://ja.wikipedia.org/wiki/Unicode</a>)
    &#12486;&#12461;&#12473;&#12488;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12434;&#25201;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12300;&#22269;&#38555;&#21270;&#12301;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#29305;&#23450;&#12398;&#35328;&#35486;&#12395;&#38306;&#20418;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#22810;&#22269;&#35486;&#12398;&#12486;&#12461;&#12473;&#12488;&#12434;&#25201;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12300;&#12473;&#12525;&#12505;&#12491;&#12450;&#35486;&#12398;&#29872;&#22659;&#12391;&#21205;&#12363;&#12375;&#12383;&#12392;&#12365;&#12399;
    &#12377;&#12409;&#12390;&#12398;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12473;&#12525;&#12505;&#12491;&#12450;&#35486;&#12391;&#34920;&#31034;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12301;
    &#12392;&#12356;&#12358;&#22793;&#26356;&#12399;&#12300;&#22320;&#22495;&#21270;&#12301;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;&#12290;
  </p><p>
    &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#20316;&#26989;&#12399;&#20027;&#12395;&#22320;&#22495;&#21270;&#12395;&#12363;&#12363;&#12431;&#12427;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
    &#22269;&#38555;&#21270;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  </p></div></div><div class="sect2" title="&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;"><div class="titlepage"><div><div><h3 class="title"><a name="documentation-manager"></a>&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</h3></div></div></div><p>
  &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26368;&#26032;&#12398;&#29366;&#24907;&#12395;&#20445;&#12388;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#26524;&#12390;&#12375;&#12394;&#12367;&#32154;&#12367;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#12467;&#12540;&#12489;&#12395;&#26032;&#27231;&#33021;&#12420;&#25313;&#24373;&#27231;&#33021;&#12364;&#36861;&#21152;&#12373;&#12428;&#12383;&#12425;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#12418;&#12381;&#12428;&#12434;&#21453;&#26144;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#12354;&#12427;&#19968;&#23450;&#12398;&#12524;&#12505;&#12523;&#12395;&#36948;&#12375;&#12383;&#12425;&#12289;
  &#12467;&#12540;&#12489;&#33258;&#20307;&#12408;&#12398;&#12497;&#12483;&#12481;&#12384;&#12369;&#12391;&#12394;&#12367;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12408;&#12398;&#12497;&#12483;&#12481;&#12418;&#36865;&#12425;&#12428;&#12390;&#12367;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#12467;&#12540;&#12489;&#12398;&#12496;&#12464;&#12434;&#20462;&#27491;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12356;&#12369;&#12428;&#12393;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#38291;&#36949;&#12356;&#12394;&#12425;&#30452;&#12379;&#12427;&#12301;&#12392;&#12356;&#12358;&#20154;&#12399;&#12383;&#12367;&#12373;&#12435;&#12356;&#12414;&#12377;&#12290;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#35501;&#12417;&#12414;&#12377;&#12364;&#12289;
  &#23455;&#38555;&#12395;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#26360;&#12369;&#12427;&#12518;&#12540;&#12470;&#12540;&#12399;&#12381;&#12398;&#19968;&#37096;&#12384;&#12369;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12408;&#12398;&#12497;&#12483;&#12481;&#12399;&#12289;&#12467;&#12540;&#12489;&#12408;&#12398;&#12497;&#12483;&#12481;&#12395;&#27604;&#12409;&#12390;
  &#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#36969;&#29992;&#12377;&#12427;&#12398;&#12364;&#23481;&#26131;&#12391;&#12377;&#12290;
  &#12486;&#12473;&#12488;&#12398;&#24517;&#35201;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
  &#22793;&#26356;&#20869;&#23481;&#12418;&#12374;&#12387;&#12392;&#35211;&#12428;&#12400;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#12497;&#12483;&#12481;&#12398;&#25968;&#12399;&#22810;&#12356;&#12369;&#12428;&#12393;&#12381;&#12398;&#12524;&#12499;&#12517;&#12540;&#12398;&#25163;&#38291;&#12399;&#23569;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12289;
  &#31649;&#29702;&#20316;&#26989;&#12392;&#23455;&#38555;&#12398;&#29983;&#29987;&#30340;&#12394;&#20316;&#26989;&#12398;&#21106;&#21512;&#12399;
  &#12467;&#12540;&#12489;&#12398;&#12497;&#12483;&#12481;&#12424;&#12426;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12497;&#12483;&#12481;&#12398;&#12411;&#12358;&#12364;&#39640;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#12418;&#12392;&#12398;&#20316;&#32773;&#12398;&#26360;&#12365;&#26041;&#12392;&#12398;&#19968;&#36011;&#24615;&#12434;&#20445;&#12388;&#12383;&#12417;&#12395;&#12399;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#12497;&#12483;&#12481;&#12395;&#23550;&#12375;&#12390;&#22810;&#23569;&#12398;&#35519;&#25972;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#22810;&#12367;&#12398;&#22580;&#21512;&#12289;&#12402;&#12392;&#12388;&#12398;&#12497;&#12483;&#12481;&#12364;&#20182;&#12398;&#12497;&#12483;&#12481;&#12395;&#24433;&#38911;&#12434;&#21450;&#12412;&#12375;&#12383;&#12426;
  &#20182;&#12398;&#12497;&#12483;&#12481;&#12392;&#20869;&#23481;&#12364;&#37325;&#35079;&#12375;&#12390;&#12356;&#12383;&#12426;&#12375;&#12414;&#12377;&#12290;
  &#12362;&#20114;&#12356;&#12398;&#12497;&#12483;&#12481;&#12398;&#20869;&#23481;&#12434;&#23562;&#37325;&#12375;&#12390;&#12381;&#12428;&#12425;&#12434;&#35519;&#25972;&#12375;&#12390;&#12363;&#12425;&#12467;&#12511;&#12483;&#12488;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12497;&#12483;&#12481;&#12399;&#32202;&#24613;&#12395;&#20966;&#29702;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12289;
  &#12381;&#12375;&#12390;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#26368;&#26032;&#12395;&#20445;&#12388;&#12395;&#12399;
  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#36880;&#27425;&#30435;&#35222;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12394;&#12393;&#12434;&#32771;&#12360;&#12427;&#12392;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#23554;&#20219;&#12398;&#25285;&#24403;&#32773;&#12434;&#20309;&#21517;&#12363;&#12362;&#12356;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12425;&#12398;&#20316;&#26989;&#12399;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12393;&#12371;&#12364;&#12393;&#12358;&#22793;&#12431;&#12387;&#12383;&#12398;&#12363;&#12434;&#27491;&#30906;&#12395;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#21453;&#26144;&#12373;&#12379;&#12427;&#12371;&#12392;&#12290;
  &#12381;&#12375;&#12390;&#24444;&#12425;&#12395;&#24517;&#35201;&#12394;&#12398;&#12399;&#12289;&#22823;&#37327;&#12398;&#12497;&#12483;&#12481;&#12434;&#21177;&#29575;&#12424;&#12367;&#12373;&#12400;&#12367;&#33021;&#21147;&#12391;&#12377;&#12290;
</p><p>
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12358;&#12375;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12497;&#12483;&#12481;&#12434;&#36969;&#29992;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12497;&#12483;&#12481;&#12394;&#12425;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12381;&#12398;&#22580;&#12391;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12418;&#12363;&#12414;&#12431;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540; (<span>&#12373;&#12365;&#12411;&#12393;&#12398;</span>
  <a class="xref" href="share-management.html#patch-manager" title="&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;">&#12300;&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;)
  &#12399;&#12467;&#12540;&#12489;&#12392;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12497;&#12483;&#12481;&#12434;&#25226;&#25569;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
  &#38283;&#30330;&#12481;&#12540;&#12512;&#12392;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12481;&#12540;&#12512;&#12398;&#20001;&#26041;&#12395;&#23550;&#12375;&#12390;&#36969;&#20999;&#12394;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377;
  (&#12392;&#12399;&#12356;&#12360;&#12289;&#12418;&#12375;&#12497;&#12483;&#12481;&#12398;&#37327;&#12364;&#22810;&#12367;&#12394;&#12426;&#12377;&#12366;&#12390; 1 &#20154;&#12391;&#12399;&#31649;&#29702;&#12375;&#12365;&#12428;&#12394;&#12367;&#12394;&#12387;&#12392;&#22580;&#21512;&#12394;&#12393;&#12399;&#12289;
  &#12414;&#12378;&#12399;&#12467;&#12540;&#12489;&#12398;&#12497;&#12483;&#12481;&#12398;&#25285;&#24403;&#32773;&#12392;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12497;&#12483;&#12481;&#12398;&#25285;&#24403;&#32773;&#12434;&#20998;&#12369;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12481;&#12540;&#12512;&#12398;&#12509;&#12452;&#12531;&#12488;&#12399;&#12289;&#21508;&#12513;&#12531;&#12496;&#12540;&#12364;
  &#12300;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#12365;&#12385;&#12435;&#12392;&#12414;&#12392;&#12417;&#12390;&#26368;&#26032;&#12398;&#29366;&#24907;&#12395;&#20445;&#12385;&#12289;&#19968;&#36011;&#24615;&#12398;&#12354;&#12427;&#12418;&#12398;&#12395;&#12377;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#24441;&#21106;&#12434;&#33258;&#35226;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#23455;&#38555;&#12398;&#20316;&#26989;&#12392;&#12375;&#12390;&#12399;&#12289;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#27083;&#25104;&#12434;&#29087;&#30693;&#12375;&#12383;&#12358;&#12360;&#12391;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#22793;&#26356;&#28857;&#12434;&#36861;&#36321;&#12375;&#12289;
  &#12414;&#12383; <span class="emphasis"><em>&#21029;&#12398;&#20154;</em></span> &#12395;&#12424;&#12427;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12408;&#12398;&#12467;&#12511;&#12483;&#12488;&#12420;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#23550;&#12377;&#12427;&#12497;&#12483;&#12481;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12289;&#12375;&#12363;&#12427;&#12409;&#12365;&#23550;&#24540;&#12434;&#12377;&#12427;&#12371;&#12392;&#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;"><div class="titlepage"><div><div><h3 class="title"><a name="issue-manager"></a>&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</h3></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#25237;&#31295;&#12373;&#12428;&#12427;&#21839;&#38988;&#12398;&#25968;&#12399;&#12289;
  &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12358;&#20154;&#12398;&#25968;&#12395;&#27604;&#20363;&#12375;&#12390;&#22679;&#12360;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12356;&#12367;&#12425;&#12496;&#12464;&#12434;&#20462;&#27491;&#12375;&#12390;&#23433;&#20840;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20844;&#38283;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12418;&#12289;
  &#26410;&#23550;&#24540;&#12398;&#21839;&#38988;&#12398;&#25968;&#12399;&#38555;&#38480;&#12394;&#12367;&#22679;&#12360;&#12390;&#12356;&#12367;&#12371;&#12392;&#12434;&#35226;&#24735;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21516;&#12376;&#21839;&#38988;&#12364;&#20309;&#24230;&#12418;&#25237;&#31295;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#22810;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#20309;&#12364;&#35328;&#12356;&#12383;&#12356;&#12398;&#12363;&#12373;&#12387;&#12401;&#12426;&#12431;&#12363;&#12425;&#12394;&#12356;&#12496;&#12464;&#22577;&#21578;&#12418;&#22679;&#12360;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#24441;&#21106;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12434;&#36605;&#28187;&#12377;&#12427;&#12383;&#12417;&#12395;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#24120;&#12395;&#30435;&#35222;&#12375;&#12289;&#23450;&#26399;&#30340;&#12395;&#25972;&#29702;&#25972;&#38931;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20027;&#12394;&#20316;&#26989;&#12399;&#12289;&#12496;&#12464;&#22577;&#21578;&#12398;&#20869;&#23481;&#12434;&#35036;&#36275;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12496;&#12464;&#22577;&#21578;&#12398;&#20013;&#12395;&#12399;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#38917;&#30446;&#12364;&#27491;&#12375;&#12367;&#22475;&#12417;&#12425;&#12428;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12428;&#12400;
  &#26082;&#23384;&#12398;&#12496;&#12464;&#12392;&#21516;&#12376;&#20869;&#23481;&#12434;&#22577;&#21578;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#12418;&#12398;&#12418;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#25285;&#24403;&#32773;&#12364;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20869;&#23481;&#12395;&#31934;&#36890;&#12375;&#12390;&#12356;&#12428;&#12400;&#12356;&#12427;&#12411;&#12393;&#12289;
  &#26082;&#23384;&#12398;&#12496;&#12464;&#12392;&#37325;&#35079;&#12375;&#12390;&#12356;&#12427;&#12496;&#12464;&#22577;&#21578;&#12434;&#35211;&#12388;&#12369;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12364;&#12289;&#12496;&#12464;&#22577;&#21578;&#12398;&#23550;&#24540;&#12395;&#23554;&#20219;&#12398;&#25285;&#24403;&#32773;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#21033;&#28857;&#12398;&#12402;&#12392;&#12388;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#20840;&#21729;&#12364;&#33256;&#27231;&#24540;&#22793;&#12395;&#23550;&#24540;&#12377;&#12427;&#12424;&#12426;&#12289;&#12381;&#12398;&#12411;&#12358;&#12364;&#21177;&#29575;&#30340;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12496;&#12464;&#23550;&#24540;&#12434;&#19968;&#20803;&#31649;&#29702;&#12379;&#12378;&#12395;&#20998;&#25955;&#31649;&#29702;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;
  &#32080;&#23616;&#35504;&#19968;&#20154;&#12392;&#12375;&#12390;&#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20869;&#23481;&#12395;&#31934;&#36890;&#12375;&#12383;&#20154;&#12364;&#12356;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;&#20491;&#12293;&#12398;&#12496;&#12464;&#22577;&#21578;&#12395;&#23550;&#12375;&#12390;
  &#20491;&#21029;&#12398;&#38283;&#30330;&#32773;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#20316;&#26989;&#12418;&#25163;&#20253;&#12356;&#12414;&#12377;&#12290;
  &#22823;&#37327;&#12398;&#12496;&#12464;&#22577;&#21578;&#12364;&#39131;&#12403;&#20132;&#12358;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;
  &#20013;&#12395;&#12399;&#12496;&#12464;&#22577;&#21578;&#12398;&#36890;&#30693;&#29992;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12398;&#12364;
  &#12362;&#12387;&#12367;&#12358;&#12395;&#12394;&#12427;&#38283;&#30330;&#32773;&#12418;&#20986;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#38283;&#30330;&#12481;&#12540;&#12512;&#12398;&#35504;&#12363;&#12364;&#12377;&#12409;&#12390;&#12398;&#22577;&#21578;&#12395;&#12365;&#12385;&#12435;&#12392;&#30446;&#12434;&#36890;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12395;&#12377;&#12428;&#12400;&#12289;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12391;&#12418;&#36969;&#20999;&#12394;&#25285;&#24403;&#32773;&#12395;&#12365;&#12385;&#12435;&#12392;&#12496;&#12464;&#23550;&#24540;&#12434;&#12362;&#39000;&#12356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12398;&#20316;&#26989;&#12399;&#38283;&#30330;&#12398;&#22952;&#12370;&#12395;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#27880;&#24847;&#12375;&#12390;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#23550;&#24540;&#12434;&#12362;&#39000;&#12356;&#12377;&#12427;&#30456;&#25163;&#12398;&#29366;&#27841;&#12434;&#32771;&#24942;&#12377;&#12427;&#12371;&#12392;&#12418;&#22823;&#20999;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12371;&#12392;&#12434;&#32771;&#12360;&#12427;&#12392;&#12289;
  &#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#38283;&#30330;&#32773;&#12481;&#12540;&#12512;&#12398;&#20013;&#12363;&#12425;&#20219;&#21629;&#12377;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#21033;&#29992;&#12377;&#12427;&#12398;&#12363;&#12395;&#12418;&#12424;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#20778;&#20808;&#38918;&#20301;&#12395;&#24540;&#12376;&#12390;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#35519;&#25972;&#12377;&#12427;&#24441;&#21106;&#12418;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#12399;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
  &#21508;&#12496;&#12464;&#22577;&#21578;&#12395;&#23550;&#12375;&#12390;&#12300;&#23558;&#26469;&#12398;&#12393;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#23550;&#24540;&#12377;&#12427;&#12363;&#12301;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#35504;&#12363;&#12395;&#12300;&#12354;&#12398;&#12496;&#12464;&#12399;&#12356;&#12388;&#20462;&#27491;&#12373;&#12428;&#12427;&#12398;&#65311;&#12301;&#12392;&#32862;&#12363;&#12428;&#12383;&#12392;&#12365;&#12395;
  &#27491;&#30906;&#12394;&#26085;&#20184;&#12364;&#12431;&#12363;&#12425;&#12394;&#12367;&#12390;&#12418;&#12300;&#27425;&#12398;&#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#23550;&#24540;&#12375;&#12414;&#12377;&#12301;&#12392;&#31572;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12300;&#12522;&#12522;&#12540;&#12473;&#12301;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#12399;&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12510;&#12452;&#12523;&#12473;&#12488;&#12540;&#12531;&#12301;
  &#12392;&#12356;&#12358;&#38917;&#30446;&#12391;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;IssueZilla
  <sup>[<a name="idp2789136" href="#ftn.idp2789136" class="footnote">33</a>]</sup>
  &#12395;&#12399;&#12371;&#12398;&#38917;&#30446;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12523;&#12540;&#12523;&#12392;&#12375;&#12390;&#12289;
  &#21508;&#12522;&#12522;&#12540;&#12473;&#12395;&#12399;&#12402;&#12392;&#12388;&#12398;&#22823;&#12365;&#12394;&#26032;&#27231;&#33021;&#36861;&#21152;&#12392;&#12356;&#12367;&#12388;&#12363;&#12398;&#12496;&#12464;&#20462;&#27491;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#23558;&#26469;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21521;&#12369;&#12383;&#21508;&#12496;&#12464;&#22577;&#21578; (&#26032;&#27231;&#33021;&#12418;&#21547;&#12415;&#12414;&#12377;&#12290;
  &#26032;&#27231;&#33021;&#12418;&#21516;&#12376;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;) &#12395;&#23550;&#12375;&#12390;&#36969;&#20999;&#12394;
  &#12479;&#12540;&#12466;&#12483;&#12488;&#12510;&#12452;&#12523;&#12473;&#12488;&#12540;&#12531;&#12434;&#35373;&#23450;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12289;
  &#12381;&#12428;&#12434;&#35211;&#12428;&#12400;&#20170;&#24460;&#12398;&#12522;&#12522;&#12540;&#12473;&#12398;&#20104;&#23450;&#12364;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#19968;&#24230;&#35373;&#23450;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12510;&#12452;&#12523;&#12473;&#12488;&#12540;&#12531;&#12364;&#12378;&#12387;&#12392;&#12381;&#12398;&#12414;&#12414;&#12391;&#12356;&#12427;&#12371;&#12392;&#12399;
  &#12417;&#12387;&#12383;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#26032;&#12375;&#12356;&#12496;&#12464;&#12364;&#39131;&#12403;&#36796;&#12435;&#12391;&#12367;&#12427;&#12392;&#12289;
  &#20316;&#26989;&#12398;&#20778;&#20808;&#38918;&#20301;&#12364;&#22793;&#12431;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#26082;&#23384;&#12398;&#12496;&#12464;&#12398;&#12510;&#12452;&#12523;&#12473;&#12488;&#12540;&#12531;&#12434;&#31227;&#21205;&#12373;&#12379;&#12394;&#12356;&#12392;
  &#12522;&#12522;&#12540;&#12473;&#35336;&#30011;&#12434;&#31649;&#29702;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12358;&#12356;&#12387;&#12383;&#20316;&#26989;&#12434;&#12362;&#12371;&#12394;&#12358;&#12395;&#12399;&#12289;&#12420;&#12399;&#12426;&#29305;&#23450;&#12398;&#25285;&#24403;&#32773;&#12434;&#21106;&#12426;&#24403;&#12390;&#12390;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20840;&#20307;&#12398;&#29366;&#27841;&#12392;&#21508;&#22577;&#21578;&#12398;&#20869;&#23481;&#12434;&#25226;&#25569;&#12373;&#12379;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12377;&#12290;
</p><p>
  &#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#24441;&#21106;&#12399;&#12289;
  &#12496;&#12464;&#22577;&#21578;&#12398;&#20869;&#23481;&#12364;&#29694;&#29366;&#12395;&#21363;&#12375;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12395;&#12394;&#12387;&#12383;&#22580;&#21512;&#12398;&#23550;&#24540;&#12391;&#12377;&#12290;
  &#20840;&#28982;&#38306;&#20418;&#12394;&#12356;&#21029;&#12398;&#22793;&#26356;&#12398;&#32080;&#26524;&#12289;&#20598;&#28982;&#12395;&#12496;&#12464;&#12364;&#12394;&#12362;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#26368;&#21021;&#12399;&#12496;&#12464;&#12392;&#12375;&#12390;&#23550;&#20966;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12383;&#12369;&#12428;&#12393;
  &#32080;&#23616;&#12381;&#12428;&#12399;&#20181;&#27096;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#29694;&#29366;&#12395;&#21363;&#12375;&#12390;&#12356;&#12394;&#12356;&#12496;&#12464;&#22577;&#21578;&#12434;&#35211;&#12388;&#12369;&#12427;&#12398;&#12399;&#22823;&#22793;&#12394;&#25163;&#38291;&#12398;&#12363;&#12363;&#12427;&#20316;&#26989;&#12391;&#12377;&#12290;
  &#27231;&#26800;&#30340;&#12395;&#12420;&#12427;&#12392;&#12377;&#12427;&#12394;&#12425;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12496;&#12464;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#26178;&#12434;&#32076;&#12390;&#22577;&#21578;&#12398;&#37327;&#12364;&#22679;&#12360;&#12390;&#12367;&#12428;&#12400;&#12367;&#12427;&#12411;&#12393;&#12289;
  &#32207;&#12481;&#12455;&#12483;&#12463;&#12356;&#12358;&#12398;&#12399;&#29694;&#23455;&#30340;&#12391;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#31243;&#24230;&#12398;&#27573;&#38542;&#12395;&#12394;&#12427;&#12392;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#12414;&#12392;&#12418;&#12394;&#29366;&#24907;&#12395;&#20445;&#12388;&#21807;&#19968;&#12398;&#26041;&#27861;&#12399;
  &#12300;&#20998;&#21106;&#12375;&#12390;&#32113;&#27835;&#12301;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12496;&#12464;&#22577;&#21578;&#12434;&#12459;&#12486;&#12468;&#12522;&#20998;&#12369;&#12375;&#12289;&#12381;&#12428;&#12382;&#12428;&#12434;&#36969;&#20999;&#12394;&#38283;&#30330;&#32773; (&#12354;&#12427;&#12356;&#12399;&#12481;&#12540;&#12512;)
  &#12395;&#25391;&#12426;&#20998;&#12369;&#12427;&#12398;&#12391;&#12377;&#12290;&#12381;&#12398;&#24460;&#12398;&#23550;&#24540;&#12399;&#12377;&#12409;&#12390;&#25391;&#12426;&#20998;&#12369;&#12425;&#12428;&#12383;&#20596;&#12364;&#36012;&#20219;&#12434;&#25345;&#12388;&#12371;&#12392;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12411;&#12393;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#24040;&#22823;&#21270;&#12377;&#12427;&#12392;&#12289;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;
  &#12393;&#12385;&#12425;&#12363;&#12392;&#12356;&#12358;&#12392;&#20840;&#20307;&#12398;&#35519;&#25972;&#24441;&#12392;&#12375;&#12390;&#20685;&#12367;&#12371;&#12392;&#12364;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#33258;&#20998;&#33258;&#36523;&#12391;&#20491;&#12293;&#12398;&#12496;&#12464;&#12434;&#20966;&#29702;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#36969;&#20999;&#12394;&#20154;&#12395;&#12381;&#12428;&#12434;&#25391;&#12426;&#20998;&#12369;&#12427;&#24441;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;"><div class="titlepage"><div><div><h3 class="title"><a name="faq-manager"></a>FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</h3></div></div></div><p>
  FAQ &#12398;&#20445;&#23432;&#12392;&#12356;&#12358;&#20316;&#26989;&#12399;&#12289;&#24605;&#12356;&#12398;&#12411;&#12363;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#22823;&#21322;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289;&#20316;&#32773;&#12364;&#20107;&#21069;&#12395;&#32244;&#12426;&#36796;&#12435;&#12384;&#20869;&#23481;&#12434;&#35352;&#36848;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289;FAQ &#12399;&#22522;&#26412;&#30340;&#12395;&#21463;&#12369;&#36523;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12392;&#12394;&#12426;&#12414;&#12377;
  (<a class="xref" href="getting-started.html#starting-a-faq" title="FAQ &#12398;&#31649;&#29702;">FAQ &#12398;&#31649;&#29702;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;)&#12290;
  &#12393;&#12428;&#12384;&#12369;&#12383;&#12367;&#12373;&#12435;&#12398;&#37327;&#12434;&#26360;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#27425;&#12395;&#12393;&#12435;&#12394;&#20869;&#23481;&#12364;&#36861;&#21152;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12399;&#27770;&#12375;&#12390;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#24120;&#12395;&#32048;&#20999;&#12428;&#12398;&#20869;&#23481;&#12364;&#36861;&#21152;&#12373;&#12428;&#32154;&#12369;&#12427;&#12398;&#12391;
  &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#20840;&#20307;&#12392;&#12375;&#12390;&#12398;&#19968;&#36011;&#24615;&#12420;&#12414;&#12392;&#12414;&#12426;&#12399;&#31777;&#21336;&#12395;&#23849;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12402;&#12393;&#12356;&#22580;&#21512;&#12399;&#21516;&#12376;&#20869;&#23481;&#12364;&#37325;&#35079;&#12375;&#12390;&#12375;&#12414;&#12387;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#21839;&#38988;&#12364;&#12394;&#12356;&#12424;&#12358;&#12395;&#35211;&#12360;&#12427;&#12418;&#12398;&#12391;&#12418;&#12289;
  &#30446;&#31435;&#12383;&#12394;&#12356;&#12392;&#12371;&#12429;&#12391;&#38306;&#36899;&#38917;&#30446;&#38291;&#12398;&#30456;&#20114;&#20381;&#23384;&#12398;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#26412;&#26469;&#12399;&#12522;&#12531;&#12463;&#12377;&#12427;&#12409;&#12365;&#12392;&#12371;&#12429;&#12364;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12394;&#12393;&#12391;&#12377;&#12290;
  &#12362;&#20114;&#12356;&#12398;&#38917;&#30446;&#12364;&#26178;&#26399;&#12434;&#12378;&#12425;&#12375;&#12390;&#36861;&#21152;&#12373;&#12428;&#12383;&#22580;&#21512;&#12394;&#12393;&#12395;&#12371;&#12428;&#12364;&#36215;&#12371;&#12426;&#12360;&#12414;&#12377;&#12290;
</p><p>
  FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#24441;&#21106;&#12399;&#12289;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12399; FAQ &#20840;&#20307;&#12398;&#21697;&#36074;&#12434;&#20445;&#25345;&#12377;&#12427;&#12371;&#12392;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;FAQ &#12398;&#20013;&#12391;&#12393;&#12435;&#12394;&#38917;&#30446;&#12364;&#21462;&#12426;&#19978;&#12370;&#12425;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#36074;&#21839;&#12384;&#12369;&#12391;&#12418;&#25226;&#25569;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#26082;&#23384;&#12398;&#38917;&#30446;&#12395;&#38306;&#36899;&#12377;&#12427;&#20869;&#23481;&#12420;&#37325;&#35079;&#12377;&#12427;&#20869;&#23481;&#12364;&#26032;&#12383;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;
  &#36969;&#20999;&#12394;&#20966;&#29702;&#12434;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12420;&#25522;&#31034;&#26495;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12289;
  &#12393;&#12435;&#12394;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12420;&#12393;&#12435;&#12394;&#36074;&#21839;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12428;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356; FAQ &#12434;&#26360;&#12365;&#36914;&#12417;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#24460;&#32773;&#12398;&#20316;&#26989;&#12399;&#38750;&#24120;&#12395;&#35079;&#38609;&#12394;&#12418;&#12398;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#21508;&#12473;&#12524;&#12483;&#12489;&#12434;&#36861;&#12356;&#12363;&#12369;&#12289;&#12381;&#12371;&#12391;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#36074;&#21839;&#12398;&#20869;&#23481;&#12434;&#25226;&#25569;&#12375;&#12390;
  &#26032;&#12383;&#12394; FAQ &#12456;&#12531;&#12488;&#12522;&#12398;&#36861;&#21152;&#12434;&#25552;&#26696;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#12467;&#12513;&#12531;&#12488;&#12394;&#12393;&#12418;&#32771;&#24942;&#12375;&#12390;
  (FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#12377;&#12409;&#12390;&#12398;&#20869;&#23481;&#12398;&#12456;&#12461;&#12473;&#12497;&#12540;&#12488;&#12391;&#12354;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;)
  &#12456;&#12531;&#12488;&#12522;&#12398;&#20869;&#23481;&#12434;&#12405;&#12367;&#12425;&#12414;&#12379;&#12289;&#12354;&#12427;&#31243;&#24230;&#12414;&#12392;&#12414;&#12387;&#12383;&#27573;&#38542;&#12391;&#12381;&#12428;&#12434;&#23455;&#38555;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;FAQ &#33258;&#20307;&#12398;&#26360;&#24335;&#12395;&#12388;&#12356;&#12390;&#12418;&#36012;&#20219;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
  FAQ &#12398;&#20307;&#35009;&#12395;&#38306;&#12377;&#12427;&#27880;&#24847;&#28857;&#12399;&#12373;&#12414;&#12374;&#12414;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;
  (<span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12398;</span>
  <a class="xref" href="growth.html#all-as-archives" title="&#20840;&#12522;&#12477;&#12540;&#12473;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#21516;&#27096;&#12395;&#25201;&#12358;">&#12300;&#20840;&#12522;&#12477;&#12540;&#12473;&#12434;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#21516;&#27096;&#12395;&#25201;&#12358;&#12301;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;)&#12290;
  &#19981;&#29305;&#23450;&#22810;&#25968;&#12364; FAQ &#12434;&#32232;&#38598;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;
  &#12371;&#12428;&#12425;&#12398;&#27880;&#24847;&#20107;&#38917;&#12364;&#12362;&#12429;&#12381;&#12363;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12435;&#12394;&#22580;&#21512;&#12391;&#12418; FAQ &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#12365;&#12385;&#12435;&#12392;&#27880;&#24847;&#12375;&#12390;&#12381;&#12428;&#12434;&#20462;&#27491;&#12375;&#12390;&#12356;&#12369;&#12400;&#22823;&#19976;&#22827;&#12391;&#12377;&#12290;
</p><p>
  FAQ &#12398;&#31649;&#29702;&#12434;&#25903;&#25588;&#12377;&#12427;&#12383;&#12417;&#12398;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12418;&#25968;&#22810;&#12367;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
  FAQ &#12398;&#21697;&#36074;&#12434;&#20302;&#19979;&#12373;&#12379;&#12394;&#12356;&#31684;&#22258;&#12391;&#12381;&#12428;&#12425;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12358;&#12398;&#12399;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#36942;&#24230;&#12395;&#33258;&#21205;&#21270;&#12375;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;FAQ &#12398;&#20445;&#23432;&#12434;&#23436;&#20840;&#12395;&#33258;&#21205;&#21270;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  wiki (<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a> &#12398;</span>
  <a class="xref" href="wikis.html" title="Wiki">&#12300;Wiki&#12301;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;) &#12394;&#12393;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;
  &#35504;&#12391;&#12418;&#33258;&#30001;&#12395; FAQ &#12398;&#38917;&#30446;&#12434;&#36861;&#21152;/&#32232;&#38598;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12394;&#12393;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399; Faq-O-Matic
  (<a class="ulink" href="http://faqomatic.sourceforge.net/" target="_top">http://faqomatic.sourceforge.net/</a>)
  &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12424;&#12367;&#35211;&#12363;&#12369;&#12414;&#12377;&#12364;&#12289;
  &#31169;&#12398;&#35211;&#12427;&#38480;&#12426;&#12391;&#12399; Faq-O-Matic
  &#12364;&#12418;&#12392;&#12418;&#12392;&#24819;&#23450;&#12375;&#12390;&#12356;&#12427;&#31684;&#22258;&#12434;&#36229;&#12360;&#12383;&#20351;&#12356;&#26041;&#12384;&#12392;&#24863;&#12376;&#12414;&#12377;&#12290;
  FAQ &#12398;&#31649;&#29702;&#12434;&#20998;&#25955;&#21270;&#12377;&#12427;&#12371;&#12392;&#12391;&#12383;&#12392;&#12360;&#20840;&#20307;&#12398;&#20316;&#26989;&#37327;&#12434;&#36605;&#28187;&#12391;&#12365;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#32080;&#26524;&#12391;&#12365;&#12354;&#12364;&#12427; FAQ &#12399;&#12393;&#12358;&#12375;&#12390;&#12418;&#21697;&#36074;&#12364;&#21155;&#12387;&#12383;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12371;&#12395;&#12399; FAQ &#20840;&#20307;&#12434;&#25226;&#25569;&#12375;&#12390;&#12356;&#12427;&#20154;&#12418;&#12356;&#12394;&#12369;&#12428;&#12400;
  &#26356;&#26032;&#12434;&#35201;&#12377;&#12427;&#38917;&#30446;&#12420;&#26178;&#20195;&#36933;&#12428;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#38917;&#30446;&#12434;&#35211;&#12388;&#12369;&#12427;&#20154;&#12418;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12373;&#12425;&#12395;&#21508;&#38917;&#30446;&#38291;&#12398;&#12388;&#12394;&#12364;&#12426;&#12434;&#31649;&#29702;&#12391;&#12365;&#12427;&#20154;&#12418;&#12356;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12435;&#12394;&#29366;&#24907;&#12391;&#12391;&#12365;&#12354;&#12364;&#12387;&#12383; FAQ &#12399;&#12289;
  &#25506;&#12375;&#12383;&#12356;&#24773;&#22577;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12393;&#12371;&#12429;&#12363;
  &#38291;&#36949;&#12387;&#12383;&#24773;&#22577;&#12434;&#19982;&#12360;&#12390;&#12375;&#12414;&#12358;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; FAQ &#12434;&#31649;&#29702;&#12377;&#12427;&#12398;&#12395;&#12393;&#12435;&#12394;&#12484;&#12540;&#12523;&#12434;&#20351;&#12358;&#12398;&#12418;&#33258;&#30001;&#12391;&#12377;&#12364;&#12289;
  &#12484;&#12540;&#12523;&#12398;&#20415;&#21033;&#12373;&#12395;&#24785;&#12431;&#12373;&#12428;&#12390; FAQ &#33258;&#20307;&#12398;&#21697;&#36074;&#12395;&#22949;&#21332;&#12375;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><p>
  Sean Michael Kerner &#12364;&#26360;&#12356;&#12383; <em class="citetitle">The FAQs on
  FAQs</em> &#12392;&#12356;&#12358;&#35352;&#20107;&#12364;
  <a class="ulink" href="http://osdir.com/Article1722.phtml" target="_top">http://osdir.com/Article1722.phtml</a>
  &#12391;&#35501;&#12417;&#12414;&#12377;&#12290;&#12371;&#12398;&#35352;&#20107;&#12391;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;
  FAQ &#31649;&#29702;&#12484;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12392;&#12381;&#12398;&#35413;&#20385;&#12434;&#34892;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2789136" href="#idp2789136" class="para">33</a>] </sup>
      IssueZilla &#12399;&#31169;&#12383;&#12385;&#12364;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;
      BugZilla &#12398;&#24460;&#32153;&#12395;&#12354;&#12383;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="managing-volunteers.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="transitions.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#24341;&#12365;&#32153;&#12366;</td></tr></table></div></body></html>
