<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="social-networking.html" title="Social Networking Services"><link rel="next" href="consensus-democracy.html" title="&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="social-networking.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="consensus-democracy.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;"><div class="titlepage"><div><div><h2 class="title"><a name="social-infrastructure"></a>&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="social-infrastructure.html#benevolent-dictator">&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;</a></span></dt><dd><dl><dt><span class="sect2"><a href="social-infrastructure.html#benevolent-dictator-qualifications">&#35504;&#12364;&#12424;&#12365;&#12300;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12301;&#12395;&#12394;&#12428;&#12427;&#12363;&#65311;</a></span></dt></dl></dd><dt><span class="sect1"><a href="consensus-democracy.html">&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;</a></span></dt><dd><dl><dt><span class="sect2"><a href="consensus-democracy.html#version-control-relaxation">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12434;&#34892;&#12394;&#12358;&#12392;&#22533;&#12367;&#12394;&#12425;&#12378;&#12395;&#28168;&#12416;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#voting">&#21512;&#24847;&#12395;&#33267;&#12425;&#12394;&#12369;&#12428;&#12400;&#25237;&#31080;&#12377;&#12427;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#when-to-vote">&#12356;&#12388;&#25237;&#31080;&#12434;&#34892;&#12394;&#12358;&#12409;&#12365;&#12363;?</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#electorate">&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#polls">&#19990;&#35542;&#35519;&#26619; v.s &#25237;&#31080;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#veto">&#25298;&#21542;&#27177;</a></span></dt></dl></dd><dt><span class="sect1"><a href="written-rules.html">&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;</a></span></dt><dt><span class="sect1"><a href="non-profit.html">Joining or Creating a Non-Profit Organization</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12388;&#12356;&#12390;&#20154;&#12293;&#12364;&#12424;&#12367;&#12377;&#12427;&#26368;&#21021;&#12398;&#36074;&#21839;&#12399;&#12289;
    "&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12393;&#12358;&#12356;&#12358;&#20181;&#32068;&#12415;&#12391;&#21205;&#12367;&#12398;&#65311;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32173;&#25345;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12399;&#20309;&#65311; &#35504;&#12395;&#27770;&#23450;&#27177;&#12364;&#12354;&#12427;&#12398;&#65311;" &#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290; 
    &#31169;&#12399;&#12289;&#23455;&#21147;&#20027;&#32681;&#12420;&#12289;&#21332;&#21147;&#12398;&#31934;&#31070;&#12289;&#35501;&#12417;&#12400;&#20309;&#12434;&#12420;&#12387;&#12390;&#12356;&#12427;&#12363;&#12431;&#12363;&#12427;&#12467;&#12540;&#12489;&#12289; &#12394;&#12393;&#12395;&#12388;&#12356;&#12390;&#24403;&#12383;&#12426;&#38556;&#12426;&#12394;&#12367;&#31572;&#12360;&#12390;&#12289;
    &#12356;&#12388;&#12418;&#37320;&#28982;&#12392;&#12375;&#12394;&#12356;&#24605;&#12356;&#12364;&#12375;&#12414;&#12377;&#12290; &#23455;&#12398;&#12392;&#12371;&#12429;&#12289;&#12371;&#12358;&#12375;&#12383;&#36074;&#21839;&#12395;&#31572;&#12360;&#12427;&#12398;&#12399;&#31777;&#21336;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#23455;&#21147;&#20027;&#32681;&#12289;&#21332;&#21147;&#12289;&#12381;&#12375;&#12390;&#21205;&#12367;&#12467;&#12540;&#12489;&#12399;&#20840;&#12390;&#31572;&#12360;&#12398;&#19968;&#37096;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289; 
    &#26085;&#12293;&#12398;&#21336;&#20301;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12393;&#12358;&#21205;&#12356;&#12390;&#12356;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#27526;&#12393;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#36215;&#12371;&#12427;&#34909;&#31361;&#12434;&#12393;&#12358;&#12420;&#12387;&#12390;&#35299;&#27770;&#12377;&#12427;&#12398;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#20309;&#12418;&#35302;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; 
</p><p>
    &#12371;&#12398;&#31456;&#12391;&#12399;&#12289;&#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20849;&#36890;&#12375;&#12390;&#12356;&#12427;&#12289;
    &#22522;&#26412;&#30340;&#12394;&#20181;&#32068;&#12415;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
    "&#25104;&#21151;&#12375;&#12390;&#12356;&#12427;" &#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#12383;&#12384;&#25216;&#34899;&#30340;&#12395;&#36074;&#12364;&#39640;&#12356;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20581;&#20840;&#12395;&#36939;&#21942;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#29983;&#12365;&#27531;&#12427;&#21147;&#12364;&#24375;&#12356;&#12371;&#12392;&#12434;&#35328;&#12356;&#12414;&#12377;&#12290;
    &#26032;&#12375;&#12356;&#12467;&#12540;&#12489;&#12420;&#38283;&#30330;&#32773;&#12434;&#21463;&#12369;&#20837;&#12428;&#12383;&#12426;&#12289;
    &#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12395;&#32032;&#26089;&#12367;&#21453;&#24540;&#12377;&#12427;&#12371;&#12392;&#12434;&#32153;&#32154;&#12391;&#12365;&#12390;&#12356;&#12428;&#12400;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#20581;&#20840;&#12395;&#36939;&#21942;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
    &#29305;&#23450;&#12398;&#20491;&#20154;&#12420;&#12473;&#12509;&#12531;&#12469;&#12540;&#12395;&#20381;&#23384;&#12375;&#12394;&#12367;&#12390;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32154;&#12369;&#12425;&#12428;&#12428;&#12400;&#12289;
    &#29983;&#12365;&#27531;&#12427;&#21147;&#12364;&#24375;&#12356;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290; &#8212; 
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12383;&#12513;&#12531;&#12496;&#12540;&#20840;&#21729;&#12364;&#20182;&#12395;&#31227;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#29983;&#12365;&#27531;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    <sup>[<a name="idp1383856" href="#ftn.idp1383856" class="footnote">24</a>]</sup>
    &#25216;&#34899;&#30340;&#12395;&#25104;&#21151;&#12377;&#12427;&#12371;&#12392;&#12399;&#38627;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#38283;&#30330;&#32773;&#12398;&#23652;&#12364;&#34180;&#12363;&#12387;&#12383;&#12426;&#12289;&#31038;&#20250;&#30340;&#12394;&#22522;&#30436;&#12364;&#24369;&#12363;&#12387;&#12383;&#12426;&#12377;&#12427;&#12392;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21021;&#26399;&#27573;&#38542;&#12391;&#25104;&#21151;&#12375;&#12390;&#33192;&#24373;&#12375;&#12383;&#12426;&#12289;
    &#12459;&#12522;&#12473;&#12510;&#30340;&#12394;&#20154;&#12364;&#12356;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#12289;&#23550;&#24540;&#12391;&#12365;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25104;&#21151;&#12373;&#12379;&#12427;&#26041;&#27861;&#12399;&#12383;&#12367;&#12373;&#12435;&#12354;&#12426;&#12414;&#12377;&#12290;   
    &#35696;&#35542;&#12434;&#12414;&#12392;&#12417;&#12383;&#12426;&#12289;&#26032;&#12375;&#12356;&#38283;&#30330;&#32773;&#12434;&#21223;&#35480;&#12375;&#12383;&#12426;&#65288;&#26178;&#12395;&#12399;&#36861;&#12356;&#20986;&#12375;&#12383;&#12426;&#65289;&#12289;
    &#26032;&#12375;&#12356;&#27231;&#33021;&#12434;&#20225;&#30011;&#12377;&#12427;&#12394;&#12393;&#12398;&#12289;
    &#22411;&#12395;&#12399;&#12414;&#12387;&#12383;&#32113;&#27835;&#12398;&#20181;&#32068;&#12415;&#12418;&#12354;&#12428;&#12400;&#12289;
    &#24418;&#12395;&#12394;&#12387;&#12390;&#34920;&#12428;&#12394;&#12356;&#12418;&#12398;&#12392;&#12375;&#12390;&#12289;
    &#12513;&#12531;&#12496;&#12540;&#12364;&#20449;&#38972;&#12375;&#12289;&#20107;&#23455;&#19978;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#25903;&#37197;&#12377;&#12427;&#20844;&#24179;&#12394;&#38640;&#22258;&#27671;&#12434;&#20316;&#12426;&#20986;&#12377;&#12383;&#12417;&#12395;&#12289;
    &#12424;&#12426;&#24847;&#35672;&#30340;&#12395;&#33258;&#21046;&#12377;&#12427;&#12371;&#12392;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;
    &#21442;&#21152;&#12377;&#12427;&#20154;&#36948;&#12364;&#12424;&#12367;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#32722;&#24931;&#12420;&#25163;&#32154;&#12365;&#12395;&#25903;&#12360;&#12425;&#12428;&#12390;&#23384;&#32154;&#12377;&#12427;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12289;
    &#12393;&#12385;&#12425;&#12418;&#34892;&#12365;&#30528;&#12367;&#12392;&#12371;&#12429;&#12399;&#21516;&#12376;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12425;&#12398;&#26041;&#27861;&#12399;&#12289;&#20013;&#22830;&#38598;&#27177;&#30340;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12424;&#12426;&#12289;
    &#33258;&#30330;&#30340;&#12395;&#25104;&#38263;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#37325;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#33258;&#30330;&#30340;&#12395;&#25104;&#38263;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12375;&#12400;&#12425;&#12367;&#12399;&#12289;
    &#12424;&#12367;&#12394;&#12356;&#12371;&#12392;&#12364;&#20840;&#20307;&#12395;&#24433;&#38911;&#12377;&#12427;&#12371;&#12392;&#12434;&#21442;&#21152;&#12377;&#12427;&#20154;&#12364;&#24847;&#35672;&#12375;&#12390;&#12356;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><div class="sect1" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#21487;&#33021;&#24615;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="forkability"></a>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#21487;&#33021;&#24615;</h2></div></div></div><p>
    &#38283;&#30330;&#32773;&#12434;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#32331;&#12366;&#27490;&#12417;&#12289;
    &#24517;&#35201;&#12394;&#26178;&#12395;&#22949;&#21332;&#12375;&#12390;&#12418;&#12425;&#12358;&#12398;&#12395;&#19981;&#21487;&#27424;&#12394;&#35201;&#32032;&#12399;&#12289;
    &#12467;&#12540;&#12489;&#12364; <em class="firstterm">&#27966;&#29983;&#12377;&#12427;</em> &#12371;&#12392;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#35504;&#12363;&#12364;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#12387;&#12390;&#12289;
    &#26032;&#12375;&#12356;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399; <em class="firstterm">&#12501;&#12457;&#12540;&#12463;</em> &#12392;&#12356;&#12358;&#29992;&#35486;&#12391;&#12418;&#30693;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#36870;&#35500;&#30340;&#12394;&#12398;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427; <span class="emphasis"><em>&#21487;&#33021;&#24615;</em></span> &#12398;&#26041;&#12364;&#12289;
    &#12414;&#12428;&#12394;&#12364;&#12425;&#23455;&#38555;&#12395;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12424;&#12426;&#12418;&#12289;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#22823;&#12365;&#12394;&#21147;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12399;&#19975;&#20154;&#12395;&#12392;&#12387;&#12390;&#12424;&#12367;&#12394;&#12356;&#12371;&#12392;&#12394;&#12398;&#12391;&#12289;
    (&#35443;&#32048;&#12394;&#29702;&#30001;&#12399;&#12289;<span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a></span> &#12398; <a class="xref" href="forks.html" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;">&#12300;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20998;&#35010;&#12301;</a> &#12391;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;)
    &#12381;&#12398;&#24656;&#12428;&#12364;&#22823;&#12365;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;
    &#20154;&#12293;&#12399;&#12381;&#12428;&#12434;&#36991;&#12369;&#12424;&#12358;&#12392;&#12375;&#12390;&#22949;&#21332;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#22823;&#12365;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12289;&#12356;&#12420;&#12416;&#12375;&#12429;&#12381;&#12398;&#21487;&#33021;&#24615;&#12392;&#35328;&#12387;&#12383;&#26041;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12398;&#21487;&#33021;&#24615;&#12371;&#12381;&#12364;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#26412;&#24403;&#12398;&#24847;&#21619;&#12391;&#12398;&#29420;&#35009;&#32773;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#29702;&#30001;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391; "&#29420;&#35009;&#32773;" &#12392;&#12363; "&#26292;&#21531;" &#12392;&#21628;&#12400;&#12428;&#12427;&#20154;&#12364;&#12356;&#12427;&#12392;&#12424;&#12367;&#32862;&#12367;&#12371;&#12392;&#12434;&#24605;&#12360;&#12400;&#12289;&#31361;&#39131;&#12394;&#20027;&#24373;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#25163;&#12398; "&#26292;&#25919;" &#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#29305;&#21029;&#12394;&#12418;&#12398;&#12391;&#12289;&#20253;&#32113;&#30340;&#12395;&#29702;&#35299;&#12373;&#12428;&#12390;&#12356;&#12427;&#26292;&#25919;&#12398;&#24847;&#21619;&#12392;&#12399;&#36949;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12356;&#12388;&#12391;&#12418;&#33258;&#20998;&#12398;&#29579;&#22269;&#12434;&#12467;&#12500;&#12540;&#12391;&#12365;&#12289;
    &#12356;&#12356;&#12424;&#12358;&#12395;&#25903;&#37197;&#12377;&#12427;&#12383;&#12417;&#12395;&#12381;&#12398;&#12467;&#12500;&#12540;&#12434;&#25345;&#12385;&#27497;&#12369;&#12427;&#23478;&#26469;&#12364;&#12356;&#12427;&#29579;&#27096;&#12434;&#24819;&#20687;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12381;&#12435;&#12394;&#29579;&#27096;&#12364;&#12289;&#33258;&#20998;&#12364;&#20309;&#12434;&#12375;&#12424;&#12358;&#12392;&#23478;&#26469;&#12364;&#33258;&#20998;&#12398;&#25903;&#37197;&#19979;&#12395;&#12356;&#12427;&#12392;&#27770;&#12414;&#12387;&#12390;&#12356;&#12427;&#29579;&#27096;&#12392;&#21516;&#12376;&#25391;&#33310;&#12356;&#12434;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12377;&#12427;&#12399;&#12378;&#12364;&#12394;&#12356;&#12391;&#12377;&#12424;&#12397;&#12290;
</p><p>
    &#12381;&#12435;&#12394;&#12431;&#12369;&#12391;&#12289;&#27665;&#20027;&#20027;&#32681;&#12395;&#24467;&#12387;&#12390;&#32068;&#32340;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12373;&#12360;&#12289;
    &#37325;&#35201;&#12394;&#27770;&#23450;&#12434;&#12377;&#12427;&#27573;&#12395;&#12394;&#12427;&#12392;&#27665;&#20027;&#20027;&#32681;&#12398;&#20181;&#32068;&#12415;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
    &#12467;&#12540;&#12489;&#12434;&#35079;&#35069;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;&#12381;&#12428;&#12434;&#20351;&#12387;&#12390;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12373;&#12379;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
    &#12381;&#12428;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#21512;&#24847;&#12364;&#24418;&#25104;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#20840;&#21729;&#12364;&#12402;&#12392;&#12426;&#12398;&#12522;&#12540;&#12480;&#12540;&#12395;&#24467;&#12358;&#12371;&#12392;&#65288;&#12418;&#12387;&#12392;&#12418;&#26377;&#21517;&#12394;&#20363;&#12364;&#12289;Linux kernel &#38283;&#30330;&#12398; Linus Torvalds &#12391;&#12377;&#65289;&#12418;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12371;&#12428;&#12399; &#23436;&#20840;&#12395;&#12402;&#12397;&#12367;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12418;&#12394;&#12367;&#12289;&#24746;&#24847;&#12364;&#12354;&#12427;&#12431;&#12369;&#12391;&#12418;&#12394;&#12367;&#12289;&#24444;&#12425;&#12364;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12434; <span class="emphasis"><em>&#36984;&#12435;&#12391;&#12356;&#12427;</em></span> &#12363;&#12425;&#12391;&#12377;&#12290;
    &#29420;&#35009;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#39764;&#27861;&#12398;&#12424;&#12358;&#12395;&#25903;&#37197;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#20840;&#12390;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#24403;&#12390;&#12399;&#12414;&#12427;&#12289;&#37749;&#12392;&#12394;&#12427;&#24615;&#36074;&#12399;&#12289;
    &#12467;&#12540;&#12489;&#12398;&#22793;&#26356;&#12398;&#12375;&#12363;&#12383;&#12420;&#12289;&#20351;&#29992;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12289;&#29305;&#23450;&#12398;&#38598;&#22243;&#12434;&#24046;&#21029;&#12375;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#20206;&#12395;&#29420;&#35009;&#32773;&#12364;&#31361;&#28982;&#12424;&#12367;&#12394;&#12356;&#27770;&#26029;&#12434;&#12375;&#12399;&#12376;&#12417;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12398;&#22580;&#21512;&#19981;&#31311;&#12394;&#31354;&#27671;&#12364;&#28418;&#12356;&#12289;&#32080;&#23616;&#21453;&#20081;&#12364;&#36215;&#12365;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12375;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12371;&#12414;&#12391;&#12402;&#12393;&#12367;&#12394;&#12427;&#12371;&#12392;&#12399;&#28357;&#22810;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12381;&#12358;&#12394;&#12427;&#21069;&#12395;&#29420;&#35009;&#32773;&#12398;&#12411;&#12358;&#12364;&#35698;&#27497;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12290;
</p><p>
    &#12375;&#12363;&#12375;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#12371;&#12392;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#27177;&#21147;&#12434;&#34892;&#20351;&#12377;&#12427;&#12371;&#12392;&#12395;&#27503;&#27490;&#12417;&#12434;&#12363;&#12369;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32113;&#29575;&#12377;&#12427;&#12420;&#12426;&#26041;&#12395;&#37325;&#22823;&#12394;&#36949;&#12356;&#12364;&#12354;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#27770;&#26029;&#12434;&#12377;&#12427;&#12383;&#12403;&#12395;&#12289;&#31478;&#21512;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12424;&#12358;&#12392;&#24605;&#12387;&#12390;&#12427;&#20154;&#12356;&#12427;&#65311; &#12392;&#36074;&#21839;&#12375;&#12383;&#12367;&#12399;&#12394;&#12356;&#12399;&#12378;&#12391;&#12377;&#12290;
    &#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12428;&#12400;&#12377;&#12368;&#12395;&#30130;&#12428;&#12390;&#12375;&#12414;&#12356;&#12289;&#20181;&#20107;&#12434;&#12377;&#12427;&#27963;&#21147;&#12364;&#22833;&#12431;&#12428;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
    &#27425;&#12398;&#12405;&#12383;&#12388;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#27770;&#26029;&#12434;&#20870;&#28369;&#12395;&#34892;&#12360;&#12427;&#12424;&#12358;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32113;&#29575;&#12377;&#12427;&#26041;&#27861;&#12434;&#35519;&#12409;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12371;&#12391;&#12399;&#12405;&#12383;&#12388;&#20363;&#12434;&#12354;&#12370;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12356;&#12373;&#12373;&#12363;&#26997;&#24230;&#12395;&#29702;&#24819;&#30340;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12405;&#12383;&#12388;&#12398;&#29366;&#24907;&#12398;&#38291;&#12398;&#12393;&#12371;&#12363;&#12395;&#20301;&#32622;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
</p></div></div><div class="sect1" title="&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="benevolent-dictator"></a>&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;</h2></div></div></div><p>
    <em class="firstterm">&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;(Benevolent Dictator)</em> &#12514;&#12487;&#12523;&#12392;&#12399;&#12289;
    &#27491;&#30906;&#12395;&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#26368;&#32066;&#30340;&#12394;&#27770;&#26029;&#12434;&#34892;&#12358;&#27177;&#38480;&#12364;&#12289;
    &#20154;&#26684;&#12420;&#32076;&#39443;&#12364;&#20778;&#12428;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#12289;
    &#36066;&#26126;&#12395;&#27177;&#38480;&#12434;&#34892;&#20351;&#12391;&#12365;&#12427;&#12402;&#12392;&#12426;&#12398;&#20154;&#12395;&#22996;&#12397;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    "&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;" &#65288;&#30053;&#12375;&#12390; <em class="firstterm">BD</em> &#12392;&#12418;&#12356;&#12356;&#12414;&#12377;&#65289;&#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#24441;&#21106;&#12395;&#23550;&#12375;&#12390;&#27161;&#28310;&#30340;&#12395;&#20351;&#12431;&#12428;&#12427;&#29992;&#35486;&#12391;&#12377;&#12364;&#12289;
    &#12416;&#12375;&#12429; "&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#35469;&#12417;&#12383;&#35519;&#20572;&#32773;" &#12418;&#12375;&#12367;&#12399; "&#23529;&#21028;" &#12392;&#32771;&#12360;&#12383;&#26041;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#19968;&#33324;&#30340;&#12395;&#12399;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#23455;&#38555;&#12395;&#20840;&#12390;&#12398;&#12289;
    &#12418;&#12375;&#12367;&#12399;&#12411;&#12392;&#12435;&#12393;&#12398;&#27770;&#23450;&#12434;&#34892;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12354;&#12427;&#20154;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20840;&#12390;&#12398;&#38936;&#22495;&#12395;&#28193;&#12387;&#12390;&#12289;
    &#20778;&#12428;&#12383;&#27770;&#26029;&#12434;&#19968;&#36011;&#12375;&#12390;&#34892;&#12358;&#21313;&#20998;&#12394;&#25216;&#33021;&#12364;&#12354;&#12427;&#12371;&#12392;&#12399;&#12414;&#12428;&#12391;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#20778;&#12428;&#12383;&#38283;&#30330;&#32773;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26041;&#21521;&#24615;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12425;&#12428;&#12394;&#12369;&#12428;&#12400;&#12289;
    &#32080;&#23616;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#21435;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12399;&#26222;&#36890;&#22810;&#12367;&#25351;&#31034;&#12434;&#20986;&#12375;&#12383;&#12426;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
    &#12416;&#12375;&#12429;&#12356;&#12388;&#12391;&#12418;&#21487;&#33021;&#12394;&#38480;&#12426;&#12289;&#35696;&#35542;&#12420;&#23455;&#39443;&#12434;&#34892;&#12358;&#20316;&#26989;&#12434;&#38283;&#30330;&#32773;&#12395;&#20219;&#12379;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12399;&#35696;&#35542;&#12381;&#12398;&#12418;&#12398;&#12395;&#12399;&#21442;&#21152;&#12375;&#12414;&#12377;&#12364;&#12289;&#26222;&#36890;&#12398;&#38283;&#30330;&#32773;&#12392;&#12375;&#12390;&#12289;
    &#33258;&#20998;&#12424;&#12426;&#20778;&#12428;&#12383;&#25216;&#33021;&#12434;&#25345;&#12388;&#12513;&#12531;&#12486;&#12490;&#12540;&#12398;&#38936;&#22495;&#12391;&#12399;&#12289;&#12383;&#12403;&#12383;&#12403;&#24444;&#12425;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;
    &#32080;&#35542;&#12364;&#20986;&#12378;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12464;&#12523;&#12540;&#12503;&#12364;&#38283;&#30330;&#12434;&#32154;&#12369;&#12427;&#12383;&#12417;&#12395;&#35504;&#12363;&#12364;&#21028;&#26029;&#12398;&#25351;&#37341;&#12434;&#31034;&#12377;&#12371;&#12392;&#12434;&#26126;&#30906;&#12395; <span class="emphasis"><em>&#26395;&#12435;&#12391;&#12356;&#12427;</em></span> &#22580;&#21512;&#12384;&#12369;&#12289;
    &#24444;&#12425;&#12399;&#25954;&#12360;&#12390;&#30064;&#12434;&#21809;&#12360;&#12390;&#12371;&#12358;&#12356;&#12358;&#12398;&#12391;&#12377;&#12290;&#12300;&#12371;&#12428;&#12364;&#12354;&#12427;&#12409;&#12365;&#26041;&#21521;&#24615;&#12384;&#12301;&#12392;&#12290;
    &#21629;&#20196;&#12377;&#12427;&#12371;&#12392;&#12391;&#27770;&#23450;&#12377;&#12427;&#12398;&#12434;&#25105;&#24930;&#12377;&#12427;&#12398;&#12399;&#12289;
    &#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12395;&#20107;&#23455;&#19978;&#20849;&#36890;&#12377;&#12427;&#29305;&#24615;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12364;&#12289;&#24444;&#12425;&#12364;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12392;&#12356;&#12358;&#24441;&#21106;&#12434;&#32173;&#25345;&#12375;&#12390;&#12356;&#12427;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><div class="sect2" title="&#35504;&#12364;&#12424;&#12365;&#12300;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12301;&#12395;&#12394;&#12428;&#12427;&#12363;&#65311;"><div class="titlepage"><div><div><h3 class="title"><a name="benevolent-dictator-qualifications"></a>&#35504;&#12364;&#12424;&#12365;&#12300;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12301;&#12395;&#12394;&#12428;&#12427;&#12363;&#65311;</h3></div></div></div><p>
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12395;&#12394;&#12427;&#12395;&#12399;&#35079;&#25968;&#12398;&#29305;&#24615;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
    &#12414;&#12378;&#31532;&#19968;&#12395;&#12289;&#33258;&#20998;&#33258;&#36523;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21450;&#12412;&#12377;&#24433;&#38911;&#12395;&#12388;&#12356;&#12390;&#24863;&#35226;&#12434;&#30740;&#12366;&#28548;&#12414;&#12377;&#12371;&#12392;&#12289;
    &#12371;&#12428;&#12399;&#35328;&#12356;&#26367;&#12360;&#12428;&#12400;&#33258;&#21046;&#12434;&#20685;&#12363;&#12379;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#35696;&#35542;&#12398;&#26368;&#21021;&#12398;&#27573;&#38542;&#12391;&#12399;&#12289;
    &#33258;&#20998;&#12398;&#24847;&#35211;&#12395;&#21453;&#23550;&#12377;&#12427;&#12398;&#12399;&#30340;&#22806;&#12428;&#12384;&#12392;&#30906;&#20449;&#12375;&#12390;&#24847;&#35211;&#12420;&#32080;&#35542;&#12434;&#36848;&#12409;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#20154;&#12293;&#12395;&#12399;&#12289;&#12383;&#12392;&#12360;&#39340;&#40575;&#12370;&#12383;&#12450;&#12452;&#12487;&#12451;&#12450;&#12391;&#12354;&#12387;&#12390;&#12418;&#33258;&#30001;&#12395;&#36848;&#12409;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12391;&#12354;&#12387;&#12390;&#12418;&#24517;&#12378;&#24858;&#12363;&#12394;&#32771;&#12360;&#12434;&#36848;&#12409;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12384;&#12363;&#12425;&#12289;&#33258;&#20998;&#12364;&#24746;&#12356;&#27770;&#26029;&#12434;&#19979;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#12381;&#12428;&#12434;&#35469;&#35672;&#12375;&#12289;
    &#21463;&#12369;&#20837;&#12428;&#12427;&#33021;&#21147;&#12418;&#24517;&#35201;&#12395;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;&#8212;
    &#12391;&#12377;&#12364;&#12289;&#12371;&#12398;&#36039;&#36074;&#12399;&#20778;&#12428;&#12383;&#38283;&#30330;&#32773;&#12391;&#12354;&#12428;&#12400;&#12289;
    &#29305;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38263;&#12356;&#38291;&#30041;&#12414;&#12387;&#12390;&#12356;&#12427;&#20154;&#12391;&#12354;&#12428;&#12400;&#12394;&#12362;&#12373;&#12425; <span class="emphasis"><em>&#35504;&#12391;&#12418;</em></span> &#25345;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12398;&#36039;&#36074;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#36949;&#12358;&#12398;&#12399;&#12289;
    &#33258;&#20998;&#12398;&#20449;&#38972;&#12395;&#38263;&#12356;&#38291;&#20663;&#12364;&#20184;&#12356;&#12390;&#12375;&#12414;&#12358;&#12435;&#12376;&#12419;&#12394;&#12356;&#12363;&#12392;&#24656;&#12428;&#12427;&#12371;&#12392;&#12394;&#12367;&#12289;
    &#12383;&#12403;&#12383;&#12403;&#38291;&#36949;&#12356;&#12434;&#29359;&#12377;&#20313;&#35029;&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#24180;&#23395;&#12364;&#20837;&#12387;&#12390;&#12356;&#12394;&#12356;&#38283;&#30330;&#32773;&#12399;&#12289;&#33258;&#20998;&#12364;&#20445;&#35703;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#24863;&#12376;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12384;&#12363;&#12425;&#12371;&#12381;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12399;&#12289;
    &#25216;&#34899;&#30340;&#12394;&#38754;&#12391;&#12418;&#31934;&#31070;&#30340;&#12394;&#38754;&#12391;&#12418;&#12289;&#33258;&#20998;&#12398;&#35328;&#33865;&#12364;&#20253;&#12360;&#12427;&#37325;&#12415;&#12395;&#25935;&#24863;&#12395;&#12394;&#12387;&#12390;&#12289;
    &#25209;&#21028;&#12434;&#12375;&#12383;&#12426;&#21453;&#23550;&#24847;&#35211;&#12434;&#36848;&#12409;&#12427;&#12409;&#12365;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12356;&#12427;&#35504;&#12424;&#12426;&#12418;&#25216;&#34899;&#30340;&#12394;&#12473;&#12461;&#12523;&#12364;&#20778;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12399; <span class="emphasis"><em>&#12354;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;
    &#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#33021;&#21147;&#12395;&#21313;&#20998;&#20778;&#12428;&#12289;
    &#12467;&#12540;&#12489;&#12395;&#21152;&#12360;&#12425;&#12428;&#12383;&#12354;&#12425;&#12422;&#12427;&#22793;&#26356;&#12434;&#29702;&#35299;&#12375;&#12289;
    &#24605;&#12356;&#12420;&#12426;&#12434;&#12418;&#12387;&#12390;&#12381;&#12428;&#12395;&#12467;&#12513;&#12531;&#12488;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12428;&#12384;&#12369;&#12391;&#12377;&#12290;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12398;&#31435;&#22580;&#12399;&#12289;&#35504;&#12363;&#12363;&#12425;&#25945;&#12431;&#12387;&#12390;&#24471;&#12383;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12473;&#12461;&#12523;&#12364;&#24656;&#12429;&#12375;&#12367;&#12354;&#12427;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#24471;&#12383;&#12418;&#12398;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    <span class="emphasis"><em>&#37325;&#35201;&#12394;&#12398;&#12399;</em></span> &#32076;&#39443;&#12392;&#32207;&#21512;&#30340;&#12394;&#35373;&#35336;&#12475;&#12531;&#12473;&#12391;&#12377;&#12290;&#8212;
    &#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#20778;&#12428;&#12383;&#35373;&#35336;&#12434;&#29983;&#12415;&#20986;&#12377;&#33021;&#21147;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#20778;&#12428;&#12383;&#35373;&#35336;&#12434;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12363;&#12425;&#35469;&#35672;&#12377;&#12427;&#33021;&#21147;&#12394;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21109;&#22987;&#32773;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#26222;&#36890;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#21109;&#22987;&#32773;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12392;&#12394;&#12427;&#21407;&#22240;&#20197;&#19978;&#12398;&#30456;&#38306;&#38306;&#20418;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#27491;&#30906;&#12395;&#12356;&#12358;&#12392;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12358;&#12414;&#12367;&#22987;&#12417;&#12425;&#12428;&#12427;&#36039;&#36074; &#8212; &#25216;&#34899;&#30340;&#12394;&#12473;&#12461;&#12523;&#12289;
    &#20182;&#12398;&#20154;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12424;&#12358;&#35500;&#24471;&#12391;&#12365;&#12427;&#12371;&#12392;&#12289;&#12394;&#12393;&#12394;&#12393; &#8212;
    &#12364;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12395;&#12394;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#36039;&#36074;&#12391;&#12377;&#12290;
    &#12381;&#12375;&#12390;&#12418;&#12385;&#12429;&#12435;&#12289;&#21109;&#22987;&#32773;&#12399;&#33258;&#21205;&#30340;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21476;&#26666;&#12392;&#12375;&#12390;&#12473;&#12479;&#12540;&#12488;&#12377;&#12427;&#12398;&#12391;&#12289;
    &#12381;&#12398;&#12371;&#12392;&#12391;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12408;&#12398;&#36947;&#12364;&#27526;&#12393;&#25269;&#25239;&#12394;&#12375;&#12395;&#38283;&#12363;&#12428;&#12427;&#12371;&#12392;&#12399;&#24448;&#12293;&#12395;&#12375;&#12390;&#12354;&#12426;&#24471;&#12414;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20998;&#35010;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#20108;&#12388;&#12354;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12399;&#20182;&#12398;&#20154;&#12392;&#21516;&#27096;&#12289;&#23481;&#26131;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20998;&#35010;&#12373;&#12379;&#12425;&#12428;&#12414;&#12377;&#12375;&#12289;
    &#22823;&#22810;&#25968;&#12398;&#38283;&#30330;&#32773;&#12364;&#26395;&#12435;&#12391;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26041;&#21521;&#24615;&#12364;&#12289;
    &#33258;&#20998;&#12364;&#26395;&#12416;&#12418;&#12398;&#12392;&#36949;&#12387;&#12390;&#12356;&#12427;&#12392;&#24863;&#12376;&#12383;&#12392;&#12365;&#12399;&#12289;
    &#26178;&#25240;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#20197;&#22806;&#12398;&#20154;&#12418;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12467;&#12540;&#12489;&#12399;&#12467;&#12500;&#12540;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;
    &#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12452;&#12531;&#12469;&#12540;&#12496;&#12398; root &#27177;&#38480;&#65288;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12398;&#27177;&#38480;&#65289;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#21839;&#38988;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20154;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12469;&#12540;&#12496;&#12398;&#31649;&#29702;&#27177;&#38480;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26368;&#32066;&#30340;&#12394;&#27177;&#38480;&#12398;&#28304;&#12391;&#12354;&#12427;&#12363;&#12398;&#12424;&#12358;&#12395;&#35441;&#12377;&#12402;&#12392;&#12364;&#12356;&#12414;&#12377;&#12364;&#12289;&#23455;&#38555;&#12399;&#28961;&#38306;&#20418;&#12391;&#12377;&#12290;
    &#12354;&#12427;&#29305;&#23450;&#12398;&#12469;&#12540;&#12496;&#12391;&#38283;&#30330;&#32773;&#12398;&#12467;&#12511;&#12483;&#12488;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#36861;&#21152;&#12375;&#12383;&#12426;&#12289;&#21066;&#38500;&#12375;&#12383;&#12426;&#12391;&#12365;&#12427;&#27177;&#38480;&#12399;&#12289;
    &#12381;&#12398;&#12469;&#12540;&#12496;&#12395;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12500;&#12540;&#12395;&#12398;&#12415;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290;
    &#12381;&#12358;&#12375;&#12383;&#27177;&#38480;&#12395;&#38306;&#12377;&#12427;&#33510;&#24773;&#12364;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12420;&#20182;&#12398;&#38283;&#30330;&#32773;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#20418;&#12394;&#12367;&#38263;&#26399;&#38291;&#32154;&#12367;&#12392;&#12289;
    &#21336;&#12395;&#38283;&#30330;&#12364;&#20182;&#12398;&#12469;&#12540;&#12496;&#12395;&#31227;&#12387;&#12390;&#12356;&#12367;&#12384;&#12369;&#12391;&#12377;&#12290;
</p></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#12356;&#12427;&#26041;&#12364;&#12358;&#12414;&#12367;&#12356;&#12367;&#12363;&#12289;
    &#20013;&#22830;&#38598;&#27177;&#12434;&#12356;&#12367;&#12425;&#12363;&#32233;&#12417;&#12383;&#20181;&#32068;&#12415;&#12398;&#26041;&#12364;&#12358;&#12414;&#12367;&#12356;&#12367;&#12363;&#12399;&#12289;
    &#24441;&#21106;&#12434;&#26524;&#12383;&#12377;&#20154;&#36948;&#12364;&#12393;&#12428;&#12384;&#12369;&#12356;&#12427;&#12363;&#12395;&#12363;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#19968;&#33324;&#30340;&#12394;&#12523;&#12540;&#12523;&#12392;&#12375;&#12390;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12395;&#35504;&#12364;&#12394;&#12387;&#12390;&#12418;&#12356;&#12356;&#12371;&#12392;&#12364;&#26126;&#12425;&#12363;&#12394;&#22580;&#21512;&#12399;&#12289;
    &#12381;&#12358;&#12377;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;&#35504;&#12418;&#12394;&#12426;&#25163;&#12364;&#12356;&#12394;&#12356;&#12398;&#12364;&#26126;&#12425;&#12363;&#12394;&#22580;&#21512;&#12399;&#12289;
    &#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#36848;&#12409;&#12427;&#20998;&#27177;&#30340;&#12394;&#27770;&#23450;&#12503;&#12525;&#12475;&#12473;&#12434;&#20351;&#12358;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1383856" href="#idp1383856" class="para">24</a>] </sup><em class="firstterm">&#12496;&#12473;&#20418;&#25968;</em> &#12392;&#12356;&#12358;&#29992;&#35486;&#12364;&#30693;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;(&#12383;&#12392;&#12360;&#12390;&#35328;&#12358;&#12392;)&#12393;&#12428;&#12367;&#12425;&#12356;&#12398;&#20154;&#12364;&#12496;&#12473;&#12395;&#36706;&#12363;&#12428;&#12383;&#12425;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#30772;&#32187;&#12377;&#12427;&#12363;&#12434;&#31034;&#12377;&#25968;&#12391;&#12377;&#12290;
    <a class="ulink" href="https://en.wikipedia.org/wiki/Bus_factor" target="_top">https://en.wikipedia.org/wiki/Bus_factor</a> &#12418;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="social-networking.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="consensus-democracy.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">Social Networking Services </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;</td></tr></table></div></body></html>
