<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24773;&#22577;&#28304;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="preface.html" title="&#24207;&#25991;"><link rel="prev" href="audience.html" title="&#12393;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#35501;&#12435;&#12391;&#12411;&#12375;&#12356;&#65311;"><link rel="next" href="acknowledgments.html" title="&#35613;&#36766;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24773;&#22577;&#28304;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="audience.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#24207;&#25991;</th><td width="20%" align="right"> <a accesskey="n" href="acknowledgments.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#24773;&#22577;&#28304;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sources"></a>&#24773;&#22577;&#28304;</h2></div></div></div><p>
    &#26412;&#26360;&#12391;&#21462;&#12426;&#19978;&#12370;&#12390;&#12356;&#12427;&#12493;&#12479;&#12398;&#22823;&#21322;&#12399;&#12289;
    5&#24180;&#12395;&#12431;&#12383;&#12427; Subversion&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#65288;<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>&#65289;&#12391;&#12398;&#32076;&#39443;&#12391;&#12377;&#12290;
    Subversion &#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;&#20309;&#12418;&#12394;&#12356;&#12392;&#12371;&#12429;&#12363;&#12425;&#20316;&#12426;&#19978;&#12370;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12362;&#12369;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;
    <span class="foreignphrase"><em class="foreignphrase">&#12487;&#12501;&#12449;&#12463;&#12488;&#12473;&#12479;&#12531;&#12480;&#12540;&#12489;</em></span>&#12398;&#24231;&#12434;&#12289;CVS&#12363;&#12425;&#22890;&#12356;&#21462;&#12427;&#12371;&#12392;&#12434;&#30446;&#27161;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12418;&#12392;&#12418;&#12392;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#31169;&#12398;&#38599;&#29992;&#20027;&#12391;&#12354;&#12427;CollabNet
    &#65288;<a class="ulink" href="http://www.collab.net/" target="_top">http://www.collab.net/</a>&#65289;&#12364;2000&#24180;&#12398;&#21021;&#12417;&#12395;&#38283;&#22987;&#12375;&#12383;&#12418;&#12398;&#12391;&#12375;&#12383;
     <sup>[<a name="idp73488" href="#ftn.idp73488" class="footnote">3</a>]</sup>&#12290;
    CollabNet &#12399;&#24403;&#21021;&#12363;&#12425;&#12371;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#30495;&#12395;&#21332;&#21147;&#30340;&#12394;&#12418;&#12398;&#12392;&#12375;&#12289;
    &#12373;&#12414;&#12374;&#12414;&#12394;&#20154;&#12383;&#12385;&#12364;&#21442;&#21152;&#12375;&#12420;&#12377;&#12367;&#12377;&#12427;&#12383;&#12417;&#12398;&#26041;&#27861;&#12434;&#29702;&#35299;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
    &#12381;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#38283;&#22987;&#24403;&#21021;&#12363;&#12425;&#22810;&#12367;&#12398;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#38283;&#30330;&#32773;&#12398;&#21332;&#21147;&#12434;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12289;
    &#29694;&#22312;&#12391;&#12399;50&#20154;&#20197;&#19978;&#12398;&#38283;&#30330;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12431;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12381;&#12398;&#20013;&#12395;CollabNet&#12398;&#31038;&#21729;&#12399;&#12411;&#12435;&#12398;&#25968;&#20154;&#12375;&#12363;&#12356;&#12414;&#12379;&#12435;&#12290;
</p><p>
    Subversion &#12399;&#12289;&#12356;&#12429;&#12435;&#12394;&#24847;&#21619;&#12391;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20856;&#22411;&#20363;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
    &#26412;&#26360;&#12391;&#12399;&#12289;&#24403;&#21021;&#24819;&#23450;&#12375;&#12390;&#12356;&#12383;&#12424;&#12426;&#12418;&#12363;&#12394;&#12426;&#22810;&#12367;&#12398;&#26448;&#26009;&#12434;Subversion&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#24471;&#12414;&#12375;&#12383;&#12290;
    &#12381;&#12358;&#12394;&#12387;&#12383;&#21407;&#22240;&#12398;&#12402;&#12392;&#12388;&#12399;&#12289;&#12381;&#12398;&#12411;&#12358;&#12364;&#22909;&#37117;&#21512;&#12384;&#12387;&#12383;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#20309;&#12363;&#29305;&#23450;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12398;&#20363;&#12364;&#24517;&#35201;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12289;
    &#31169;&#12398;&#38957;&#12398;&#20013;&#12395;&#26368;&#21021;&#12395;&#28014;&#12363;&#12435;&#12391;&#12367;&#12427;&#12398;&#12399;&#12356;&#12388;&#12418;Subversion&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12356;&#12356;&#12363;&#12370;&#12435;&#12394;&#24773;&#22577;&#12434;&#26360;&#12363;&#12394;&#12356;&#12383;&#12417;&#12395;&#12392;&#12356;&#12358;&#19968;&#38754;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12414;&#12391;&#12395;&#31169;&#12399;&#12356;&#12429;&#12356;&#12429;&#12394;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#28145;&#12367;&#31435;&#12385;&#20837;&#12387;&#12383;&#12418;&#12398;&#12418;&#12354;&#12428;&#12400;&#12411;&#12435;&#12398;&#12385;&#12423;&#12387;&#12392;&#38306;&#12431;&#12387;&#12383;&#12384;&#12369;&#12392;&#12356;&#12358;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#21516;&#12376;&#12424;&#12358;&#12394;&#31435;&#22580;&#12398;&#21451;&#20154;&#12420;&#30693;&#20154;&#12392;&#12418;&#25968;&#22810;&#12367;&#35441;&#12375;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12383;&#12384;&#12289;&#12356;&#12374;&#12381;&#12398;&#20869;&#23481;&#12434;&#20986;&#29256;&#12377;&#12427;&#12392;&#12394;&#12427;&#12392;&#12289;&#12381;&#12398;&#35441;&#12398;&#20869;&#23481;&#12364;&#27491;&#12375;&#12356;&#12363;&#12393;&#12358;&#12363;&#12434;&#25913;&#12417;&#12390;&#30906;&#12363;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#20869;&#23481;&#12434;&#35501;&#12435;&#12384;&#12384;&#12369;&#12391;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36215;&#12371;&#12387;&#12383;&#12356;&#12429;&#12356;&#12429;&#12394;&#20986;&#26469;&#20107;&#12395;&#12388;&#12356;&#12390;&#35486;&#12427;&#12431;&#12369;&#12395;&#12399;&#12356;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#35504;&#12363;&#20182;&#12398;&#20154;&#12364; Subversion &#12395;&#12388;&#12356;&#12390;&#21516;&#12376;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#12375;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#31169;&#12364;&#12381;&#12428;&#12434;&#35501;&#12417;&#12400;&#12289;&#12362;&#12381;&#12425;&#12367;&#21322;&#20998;&#12367;&#12425;&#12356;&#12399;&#38291;&#36949;&#12387;&#12383;&#20869;&#23481;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12392;&#27671;&#12389;&#12367;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12371;&#12391;&#12289;&#31169;&#12364;&#30452;&#25509;&#38306;&#12431;&#12387;&#12383;&#12371;&#12392;&#12398;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12434;&#20363;&#12395;&#20986;&#12377;&#12392;&#12365;&#12395;&#12399;&#12289;
    &#12414;&#12378;&#12381;&#12398;&#24403;&#20107;&#32773;&#12395;&#30452;&#25509;&#35441;&#12434;&#32884;&#12365;&#12289;&#12381;&#12398;&#12392;&#12365;&#20309;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12383;&#12398;&#12363;&#12434;&#30693;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12383;&#12290;
</p><p>
    &#31169;&#12399;&#36942;&#21435;5&#24180;&#38291;Subversion&#12395;&#38306;&#12431;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12364;&#12289;
    &#12381;&#12428;&#20197;&#21069;&#12418;&#21547;&#12417;&#12427;&#12392;&#12363;&#12428;&#12371;&#12428; 12 &#24180;&#12411;&#12393;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#12431;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    Subversion &#20197;&#22806;&#12395;&#26412;&#26360;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243;&#65288;FSF&#65289;&#12398;&#12300;GNU Emacs&#12301;&#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12290;
            &#31169;&#12399;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12356;&#12367;&#12388;&#12363;&#20445;&#23432;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p></li><li class="listitem"><p>CVS&#65288;Concurrent Versions System&#65289;&#12290;
            1994&#8211;1995&#38915;&#12289;Jim Blandy&#12392;&#12392;&#12418;&#12395;&#29105;&#24515;&#12395;&#21462;&#12426;&#32068;&#12435;&#12391;&#12356;&#12414;&#12375;&#12383;&#12290;
            &#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#20197;&#38477;&#12399;&#12383;&#12414;&#12395;&#12375;&#12363;&#21442;&#21152;&#12391;&#12365;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
            </p></li><li class="listitem"><p>
            Apache&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243;(Apache Software Foundation) &#12398;&#12373;&#12414;&#12374;&#12414;&#12394;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12289;
            &#29305;&#12395;APR&#65288;Apache Portable Runtime&#65289;&#12420;Apache HTTP Server&#12290;
            </p></li><li class="listitem"><p>
            OpenOffice.org&#12289;Sleepycat&#12398;Berkeley DB&#12289;MySQL&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12290;
            &#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12399; &#35242;&#23494;&#12395;&#38306;&#12431;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;&#12424;&#12367;&#35251;&#23519;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12375;&#12390;&#26178;&#12395;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21442;&#21152;&#32773;&#12392;&#20250;&#35441;&#12434;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            </p></li><li class="listitem"><p>GNU Debugger (GDB) (&#21516;&#19978;)</p></li><li class="listitem"><p>Debian &#12503;&#12525;&#12472;&#12455;&#12463;&#12488; (&#21516;&#19978;)</p></li></ul></div><p>
    &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12364;&#12377;&#12409;&#12390;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20182;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12392;&#21516;&#27096;&#12289;
    &#21336;&#12395;&#22823;&#12414;&#12363;&#12394;&#27969;&#12428;&#12434;&#25226;&#25569;&#12377;&#12427;&#12392;&#12356;&#12358;&#30446;&#30340;&#12391;&#12356;&#12429;&#12435;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21205;&#12365;&#12434;&#12422;&#12427;&#12420;&#12363;&#12395;&#36861;&#12356;&#12363;&#12369;&#12383;&#12426;&#12418;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12425;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12434;&#12377;&#12409;&#12390;&#12371;&#12371;&#12391;&#25369;&#12370;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12364;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#26412;&#25991;&#20013;&#12391;&#21517;&#21069;&#12434;&#20986;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp73488" href="#idp73488" class="para">3</a>] </sup>
         &#26085;&#26412;&#35486;&#29256;&#27880;&#65306;Karl Fogel&#27663;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#65288;<a class="ulink" href="http://www.red-bean.com/kfogel/" target="_top">http://www.red-bean.com/kfogel/</a>&#65289;&#12394;&#12393;&#12395;&#12424;&#12427;&#12392;&#12289;
         2009&#24180;7&#26376;&#29694;&#22312;&#12399; CollabNet &#12391;&#12399;&#12394;&#12367;&#12289;Ubuntu&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12510;&#12540;&#12471;&#12515;&#12523;&#12473;&#12509;&#12531;&#12469;&#12540;&#12391;&#12418;&#12354;&#12427; Canonical&#31038;
        &#65288;<a class="ulink" href="http://canonical.com/" target="_top">http://canonical.com/</a>&#65289;&#12391;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12540;&#12499;&#12473; Launchpad
        &#65288;<a class="ulink" href="http://launchpad.net/" target="_top">http://launchpad.net/</a>&#65289;&#12394;&#12393;&#12395;&#38306;&#20418;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;&#26412;&#26360;&#12398;&#26412;&#25991;&#12391;&#12399;&#12289;
         &#27663;&#12392;CollabNet&#12398;&#38599;&#29992;&#38306;&#20418;&#12395;&#22522;&#12389;&#12356;&#12383;&#35352;&#36848;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12377;&#12409;&#12390;&#22519;&#31558;&#26178;&#28857;&#12398;&#12418;&#12398;&#12392;&#12375;&#12390;&#12362;&#35501;&#12415;&#12367;&#12384;&#12373;&#12356;&#12290;
     </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="audience.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="acknowledgments.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12393;&#12435;&#12394;&#20154;&#12383;&#12385;&#12395;&#35501;&#12435;&#12391;&#12411;&#12375;&#12356;&#65311; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#35613;&#36766;</td></tr></table></div></body></html>
