<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;"><link rel="prev" href="release-branches.html" title="&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;"><link rel="next" href="packaging.html" title="&#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="release-branches.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</th><td width="20%" align="right"> <a accesskey="n" href="packaging.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="stabilizing-a-release"></a>&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;</h2></div></div></div><p>
    <em class="firstterm">&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;</em> &#12392;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12434;&#12522;&#12522;&#12540;&#12473;&#12391;&#12365;&#12427;&#29366;&#24907;&#12395;&#25345;&#12387;&#12390;&#12356;&#12367;&#20316;&#26989;&#12391;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12393;&#12398;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#12363;&#12289;&#21547;&#12417;&#12394;&#12356;&#12363;&#12434;&#27770;&#23450;&#12375;&#12289;
    &#12381;&#12398;&#26041;&#37341;&#12395;&#24467;&#12387;&#12390;&#12502;&#12521;&#12531;&#12481;&#12434;&#25972;&#20633;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12398; "&#27770;&#23450;" &#12392;&#12356;&#12358;&#35328;&#33865;&#12395;&#12399;&#12289;&#21380;&#20171;&#12394;&#12371;&#12392;&#12364;&#12383;&#12367;&#12373;&#12435;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#30452;&#21069;&#12395;&#26032;&#27231;&#33021;&#12364;&#12383;&#12367;&#12373;&#12435;&#20986;&#12390;&#12367;&#12427;&#12398;&#12399;&#12289;
    &#21332;&#35519;&#30340;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#26085;&#24120;&#33590;&#39151;&#20107;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#12522;&#12522;&#12540;&#12473;&#12364;&#36817;&#12356;&#12371;&#12392;&#12434;&#30693;&#12427;&#12392;&#12289;
    &#12381;&#12428;&#12395;&#20055;&#12426;&#36933;&#12428;&#12414;&#12356;&#12392;&#12375;&#12390;&#22823;&#24613;&#12366;&#12391;&#22793;&#26356;&#20316;&#26989;&#12434;&#32066;&#12360;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#21247;&#35542;&#12289;&#12522;&#12522;&#12540;&#12473;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#12414;&#12373;&#12395;&#36215;&#12371;&#12387;&#12390;&#27442;&#12375;&#12367;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#12398;&#22909;&#12365;&#12394;&#12506;&#12540;&#12473;&#12391;&#26032;&#27231;&#33021;&#12434;&#23455;&#35013;&#12375;&#12390;&#12356;&#12428;&#12400;&#12356;&#12356;&#12398;&#12391;&#12354;&#12387;&#12390;&#12289;
    &#33258;&#20998;&#12398;&#22793;&#26356;&#12364;&#20170;&#22238;&#12289;&#12414;&#12383;&#12399;&#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12414;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#24515;&#37197;&#12375;&#12394;&#12356;&#26041;&#12364;&#12356;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#22810;&#12367;&#12398;&#22793;&#26356;&#12434;&#30452;&#21069;&#12395;&#35440;&#12417;&#36796;&#12418;&#12358;&#12392;&#12377;&#12428;&#12400;&#12377;&#12427;&#12411;&#12393;&#12289;
    &#12467;&#12540;&#12489;&#12399;&#19981;&#23433;&#23450;&#12395;&#12394;&#12426;&#12289;&#65288;&#26222;&#36890;&#65289;&#22810;&#12367;&#12398;&#12496;&#12464;&#12364;&#30330;&#29983;&#12375;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12411;&#12392;&#12435;&#12393;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12456;&#12531;&#12472;&#12491;&#12450;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#21270;&#12377;&#12427;&#36942;&#31243;&#12391;&#12393;&#12398;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12409;&#12365;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;
    &#12362;&#12362;&#12414;&#12363;&#12394;&#28857;&#12391;&#19968;&#33268;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#28145;&#21051;&#12394;&#12496;&#12464;&#12289;
    &#29305;&#12395;&#22238;&#36991;&#12375;&#12424;&#12358;&#12364;&#12394;&#12356;&#12496;&#12464;&#12398;&#20462;&#27491;&#12399;&#21547;&#12417;&#12390;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#26356;&#26032;&#12418;&#21547;&#12417;&#12390;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20462;&#27491;&#65288;&#20294;&#12375;&#12289;&#12381;&#12428;&#12364;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#19968;&#37096;&#12392;&#32771;&#12360;&#12425;&#12428;&#12390;&#12356;&#12390;&#12289;
    &#23433;&#23450;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#22580;&#21512;&#12399;&#21029;&#12391;&#12377;&#65289;&#12418;&#21516;&#27096;&#12391;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12522;&#12473;&#12463;&#12364;&#20302;&#12356;&#12363;&#12289;&#12467;&#12450;&#12395;&#24433;&#38911;&#12375;&#12394;&#12356;&#22793;&#26356;&#12418;&#21463;&#12369;&#20837;&#12428;&#12414;&#12377;&#12375;&#12289;
    &#12522;&#12473;&#12463;&#12434;&#28204;&#12427;&#12383;&#12417;&#12398;&#27491;&#24335;&#12394;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12393;&#12435;&#12394;&#22522;&#28310;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#20154;&#38291;&#12398;&#21028;&#26029;&#12399;&#24517;&#12378;&#24517;&#35201;&#12391;&#12377;&#12290;
    &#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12363;&#21542;&#12363;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#27770;&#12417;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#12398;&#12399;&#26085;&#24120;&#33590;&#39151;&#20107;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#21361;&#38522;&#12394;&#12398;&#12399;&#12289;&#38283;&#30330;&#32773;&#12381;&#12428;&#12382;&#12428;&#12364;&#33258;&#20998;&#12398;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12383;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#22793;&#26356;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12434;&#26395;&#12416;&#20154;&#12399;&#22810;&#12356;&#12398;&#12395;&#12289;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390; NO &#12392;&#12356;&#12358;&#20154;&#12364;&#23569;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12381;&#12358;&#12356;&#12358;&#12431;&#12369;&#12391;&#12289;&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#21270;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12364; "NO" &#12392;&#35328;&#12358;&#20181;&#32068;&#12415;&#12434;&#20316;&#12427;&#12371;&#12392;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#29305;&#26377;&#12394;&#12398;&#12399;&#12289;
    &#38283;&#30330;&#32773;&#12434;&#20663;&#12388;&#12369;&#12383;&#12426;&#12289;&#12364;&#12387;&#12363;&#12426;&#12373;&#12379;&#12427;&#12371;&#12392;&#12394;&#12367; "NO" &#12392;&#12356;&#12356;&#12388;&#12388;&#12289;
    &#20385;&#20516;&#12364;&#12354;&#12427;&#22793;&#26356;&#12399;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12424;&#12358;&#12395;&#12377;&#12427;&#26041;&#27861;&#12395;&#30693;&#24693;&#12434;&#32094;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12383;&#12367;&#12373;&#12435;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12356;&#12387;&#12383;&#12435;&#38283;&#30330;&#12481;&#12540;&#12512;&#12364;&#12381;&#12428;&#12425;&#12434;&#37325;&#35201;&#12394;&#22522;&#28310;&#12392;&#12375;&#12390;&#27880;&#30446;&#12377;&#12428;&#12400;&#12289;
    &#22522;&#28310;&#12434;&#28288;&#12383;&#12377;&#20181;&#32068;&#12415;&#12434;&#20316;&#12427;&#12398;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
    &#12371;&#12371;&#12391;&#12399;&#12418;&#12387;&#12392;&#12418;&#20154;&#27671;&#12398;&#12354;&#12427;&#12289;&#20001;&#26997;&#31471;&#12394;&#12420;&#12426;&#26041;&#12434;&#12405;&#12383;&#12388;&#31777;&#21336;&#12395;&#35500;&#26126;&#12375;&#12414;&#12377;&#12364;&#12289;
    &#20108;&#12388;&#12384;&#12369;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#21109;&#36896;&#24615;&#12434;&#12394;&#12367;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    &#20182;&#12398;&#12420;&#12426;&#26041;&#12399;&#12383;&#12367;&#12373;&#12435;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12425;&#12289;
    &#31169;&#12364;&#23455;&#38555;&#12395;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#12405;&#12383;&#12388;&#12384;&#12369;&#12395;&#30041;&#12417;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;"><div class="titlepage"><div><div><h3 class="title"><a name="release-owner"></a>&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;</h3></div></div></div><p>
    &#38283;&#30330;&#32773;&#12464;&#12523;&#12540;&#12503;&#12399;&#29305;&#23450;&#12398;&#20154;&#29289;&#12364;<em class="firstterm">&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;</em>&#12395;&#12394;&#12427;&#12371;&#12392;&#12395;&#21516;&#24847;&#12375;&#12414;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12399;&#12393;&#12398;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12363;&#12434;&#27770;&#12417;&#12427;&#26368;&#32066;&#30340;&#12394;&#27177;&#38480;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
    &#21247;&#35542;&#12289;&#12381;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#36890;&#24120;&#35696;&#35542;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12375;&#12289;&#26399;&#24453;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#38283;&#30330;&#32773;&#12464;&#12523;&#12540;&#12503;&#12399;&#32080;&#23616;&#12289;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#26368;&#32066;&#30340;&#12394;&#27770;&#26029;&#12434;&#34892;&#12358;&#12383;&#12417;&#12398;&#21313;&#20998;&#12394;&#27177;&#38480;&#12434;&#19982;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12371;&#12398;&#20181;&#32068;&#12415;&#12364;&#12358;&#12414;&#12367;&#27231;&#33021;&#12377;&#12427;&#12395;&#12399;&#12289;&#21152;&#12360;&#12425;&#12428;&#12383;&#20840;&#12390;&#12398;&#22793;&#26356;&#12434;&#29702;&#35299;&#12391;&#12365;&#12427;&#21331;&#36234;&#12375;&#12383;&#25216;&#34899;&#21147;&#12434;&#25345;&#12385;&#12289;
    &#31038;&#20250;&#30340;&#12395;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12362;&#12426;&#12289;&#22810;&#12367;&#12398;&#20154;&#12434;&#20663;&#12388;&#12369;&#12378;&#12395;&#12522;&#12522;&#12540;&#12473;&#12395;&#12418;&#12387;&#12390;&#12356;&#12369;&#12427;&#12424;&#12358;&#35696;&#35542;&#12434;&#23566;&#12367;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#33021;&#21147;&#12364;&#12354;&#12427;&#20154;&#12434;&#36984;&#12400;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12289;"&#12371;&#12398;&#22793;&#26356;&#12399;&#38291;&#36949;&#12387;&#12390;&#12394;&#12356;&#12369;&#12393;&#12289;&#12486;&#12473;&#12488;&#12434;&#12377;&#12427;&#21313;&#20998;&#12394;&#26178;&#38291;&#12364;&#12392;&#12428;&#12390;&#12356;&#12394;&#12356;&#12290;
    &#12384;&#12363;&#12425;&#12289;&#20170;&#22238;&#12398;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12290;" &#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#36899;&#12375;&#12383;&#25216;&#34899;&#12398;&#30693;&#35672;&#12434;&#24195;&#12367;&#25345;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#22823;&#12356;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12375;&#12289;
    &#12381;&#12398;&#22793;&#26356;&#12364;&#28508;&#22312;&#30340;&#12395;&#12467;&#12540;&#12489;&#12434;&#19981;&#23433;&#23450;&#12395;&#12377;&#12427;&#65288;&#12383;&#12392;&#12360;&#12400;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20182;&#12398;&#37096;&#20998;&#12395;&#19982;&#12360;&#12427;&#24433;&#38911;&#12420;&#12289;&#31227;&#26893;&#24615;&#12395;&#38306;&#12377;&#12427;&#12371;&#12392;&#12394;&#12393;&#65289;&#29702;&#30001;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12398;&#27770;&#23450;&#12364;&#27491;&#12375;&#12356;&#12371;&#12392;&#12434;&#35388;&#26126;&#12379;&#12424;&#12392;&#12356;&#12358;&#20154;&#12420;&#12289;
    &#35211;&#12383;&#30446;&#12411;&#12393;&#12381;&#12398;&#22793;&#26356;&#12399;&#12522;&#12473;&#12461;&#12540;&#12391;&#12394;&#12356;&#12392;&#20027;&#24373;&#12377;&#12427;&#20154;&#12418;&#29694;&#12428;&#12414;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12540;&#12458;&#12540;&#12490;&#12540;&#12399;&#12289;&#12371;&#12358;&#12375;&#12383;&#20027;&#24373;&#12398;&#12377;&#12409;&#12390;&#12364;&#33258;&#20998;&#12398;&#27770;&#23450;&#12395;&#21453;&#23550;&#12375;&#12390;&#12356;&#12427;&#12363;&#12289;
    &#21453;&#23550;&#12395;&#22266;&#22519;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12392;&#21028;&#26029;&#12391;&#12365;&#12428;&#12400;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#20027;&#24373;&#12395;&#30495;&#27491;&#38754;&#12363;&#12425;&#12406;&#12388;&#12363;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12540;&#12480;&#12540;&#12364;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12394;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    (&#12381;&#12418;&#12381;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12540;&#12480;&#12540;&#12364;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a></span> &#12398; <a class="xref" href="social-infrastructure.html#benevolent-dictator" title="&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;">&#12300;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
    &#23455;&#38555;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12540;&#12480;&#12540;&#12392;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12399;&#20860;&#20219; <span class="emphasis"><em>&#12375;&#12394;&#12356;</em></span> &#12411;&#12358;&#12364;&#12424;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#20778;&#12428;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12540;&#12480;&#12540;&#12395;&#12394;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12473;&#12461;&#12523;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12394;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12381;&#12428;&#12392;&#21516;&#12376;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#37325;&#35201;&#12394;&#23616;&#38754;&#12391;&#12399;&#12289;
    &#35504;&#12363;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12522;&#12540;&#12480;&#12540;&#12398;&#21028;&#26029;&#12434;&#30456;&#27578;&#12377;&#12427;&#12367;&#12425;&#12356;&#12398;&#26041;&#12364;&#36066;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    <span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12395;&#12354;&#12427;</span>
    <a class="xref" href="stabilizing-a-release.html#release-manager" title="&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12301;</a> &#12391;&#35500;&#26126;&#12377;&#12427;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12392;&#12399;&#23550;&#29031;&#30340;&#12395;&#29420;&#35009;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect2" title="&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#22793;&#26356;&#12434;&#25237;&#31080;&#12391;&#27770;&#12417;&#12427;"><div class="titlepage"><div><div><h3 class="title"><a name="release-voting"></a>&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#22793;&#26356;&#12434;&#25237;&#31080;&#12391;&#27770;&#12417;&#12427;</h3></div></div></div><p>
    &#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12398;&#29420;&#35009;&#12392;&#27491;&#21453;&#23550;&#12398;&#12420;&#12426;&#26041;&#12391;&#12377;&#12364;&#12289;
    &#38283;&#30330;&#32773;&#12399;&#12393;&#12398;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12363;&#12434;&#25237;&#31080;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#12522;&#12522;&#12540;&#12473;&#12398;&#23433;&#23450;&#21270;&#12377;&#12427;&#12503;&#12525;&#12475;&#12473;&#12391;&#19968;&#30058;&#37325;&#35201;&#12394;&#12398;&#12399;&#22793;&#26356;&#12434;&#38500;&#22806;&#12377;&#12427;&#12371;&#12392;&#12394;&#12398;&#12391;&#12289;
    &#35079;&#25968;&#12398;&#38283;&#30330;&#32773;&#12364;&#31309;&#26997;&#30340;&#12395;&#36059;&#25104;&#12375;&#12383;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12417;&#12427;&#12424;&#12358;&#12395;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#35373;&#35336;&#12377;&#12427;&#12371;&#12392;&#12364;&#37325;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12395;&#12399;&#12289;&#36942;&#21322;&#25968;&#20197;&#19978;&#12398;&#36059;&#25104;&#12364;&#24517;&#35201;&#12392;&#12377;&#12409;&#12365;&#12391;&#12377;(<span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a></span> &#12398; <a class="xref" href="consensus-democracy.html#electorate" title="&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?">&#12300;&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?&#12301;</a>) &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
    &#21029;&#12398;&#12420;&#12426;&#26041;&#12392;&#12375;&#12390;&#12289;&#19968;&#20154;&#12364;&#36059;&#25104;&#12375;&#12289;&#20182;&#12398;&#20154;&#12364;&#21453;&#23550;&#12375;&#12394;&#12369;&#12428;&#12400;&#21313;&#20998;&#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    &#19981;&#24184;&#12394;&#25919;&#27835;&#21147;&#23398;&#12395;&#12424;&#12387;&#12390;&#12289;&#21508;&#12293;&#12398;&#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#12364;&#21152;&#12360;&#12383;&#22793;&#26356;&#12395;&#36059;&#25104;&#31080;&#12434;&#25237;&#12376;&#12427;&#12364;&#12289;
    &#22577;&#24489;&#12434;&#24656;&#12428;&#12390;&#20182;&#12398;&#38283;&#30330;&#32773;&#12398;&#22793;&#26356;&#12395;&#12399;&#21453;&#23550;&#31080;&#12434;&#25237;&#12376;&#12383;&#12364;&#12425;&#12394;&#12367;&#12394;&#12427;&#12392;&#12356;&#12358;&#29366;&#27841;&#12364;&#29983;&#12414;&#12428;&#12414;&#12377;&#12290;
    &#12371;&#12428;&#12434;&#36991;&#12369;&#12427;&#12395;&#12399;&#12289;&#38283;&#30330;&#32773;&#36948;&#12395;&#12354;&#12425;&#12422;&#12427;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12417;&#12427;&#12424;&#12358;&#21332;&#21147;&#12375;&#12390;&#34892;&#21205;&#12373;&#12379;&#12427;&#12424;&#12358;&#12395;&#12289;&#12471;&#12473;&#12486;&#12512;&#12434;&#22793;&#12360;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#22810;&#12367;&#12398;&#38283;&#30330;&#32773;&#12364;&#20491;&#12293;&#12398;&#22793;&#26356;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#12381;&#12428;&#12382;&#12428;&#12398;&#38283;&#30330;&#32773;&#12364;&#22793;&#26356;&#12395;&#23550;&#12375;&#12390;&#21453;&#23550;&#31080;&#12434;&#12383;&#12417;&#12425;&#12431;&#12378;&#12395;&#25237;&#12376;&#12427;&#12371;&#12392;&#12418;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#33258;&#20998;&#12398;&#24847;&#35211;&#12392;&#12399;&#21453;&#23550;&#12398;&#31080;&#12434;&#25237;&#12376;&#12427;&#20154;&#12364;&#12289;&#33258;&#20998;&#12434;&#20398;&#36785;&#12375;&#12390;&#12356;&#12427;&#12392;&#24605;&#12358;&#20154;&#12399;&#12356;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#21442;&#21152;&#12377;&#12427;&#20154;&#12364;&#22810;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;&#20491;&#20154;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#22793;&#26356;&#12395;&#38306;&#12377;&#12427;&#35696;&#35542;&#12364;&#22810;&#12367;&#34892;&#12431;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
    Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;
    &#12358;&#12414;&#12367;&#12496;&#12521;&#12531;&#12473;&#12364;&#12392;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12394;&#12398;&#12391;&#12289;&#31169;&#12399;&#12371;&#12371;&#12391;&#12381;&#12428;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;
    &#12354;&#12427;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#36969;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;
    &#23569;&#12394;&#12367;&#12392;&#12418;&#65299;&#20154;&#12398;&#38283;&#30330;&#32773;&#12364;&#36059;&#25104;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;&#21453;&#23550;&#12377;&#12427;&#20154;&#12364;&#12402;&#12392;&#12426;&#12418;&#12356;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
    "&#21453;&#23550;" &#12398;&#31080;&#12364;&#12402;&#12392;&#12388;&#12391;&#12418;&#12354;&#12428;&#12400;&#12289;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#12398;&#12434;&#27490;&#12417;&#12427;&#12398;&#12395;&#21313;&#20998;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12395;&#12362;&#12369;&#12427; "&#21453;&#23550;" &#31080;&#12399;&#25298;&#21542;&#27177;&#12392;&#21516;&#12376;&#12395;&#12394;&#12426;&#12414;&#12377;(<a class="xref" href="consensus-democracy.html#veto" title="&#25298;&#21542;&#27177;">&#12300;&#25298;&#21542;&#27177;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
    &#24403;&#28982;&#12398;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;&#12371;&#12398;&#25163;&#12398;&#21453;&#23550;&#31080;&#12434;&#25237;&#12376;&#12427;&#12395;&#12399;&#27491;&#24403;&#12394;&#29702;&#30001;&#12364;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#29702;&#23624;&#12398;&#19978;&#12391;&#12399;&#21313;&#20998;&#22810;&#12367;&#12398;&#20154;&#12364;&#19981;&#24403;&#12384;&#12392;&#24863;&#12376;&#12428;&#12400;&#35206;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;
    &#29305;&#21029;&#12394;&#25237;&#31080;&#12364;&#12354;&#12387;&#12390;&#12418;&#21516;&#27096;&#12391;&#12377;&#12290;&#23455;&#38555;&#12289;&#12371;&#12435;&#12394;&#12371;&#12392;&#12399;&#27770;&#12375;&#12390;&#36215;&#12371;&#12426;&#12414;&#12379;&#12435;&#12375;&#12289;
    &#36215;&#12371;&#12387;&#12390;&#27442;&#12375;&#12367;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#20154;&#12293;&#12399;&#12522;&#12522;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#12399;&#20445;&#23432;&#30340;&#12391;&#12377;&#12375;&#12289;
    &#35504;&#12363;&#12364;&#12354;&#12427;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12395;&#25298;&#21542;&#27177;&#12434;&#25237;&#12376;&#12383;&#12356;&#12392;&#24375;&#12367;&#24863;&#12376;&#12427;&#12392;&#12365;&#12399;&#12289;
    &#26222;&#36890;&#12399;&#21313;&#20998;&#12394;&#29702;&#30001;&#12364;&#12354;&#12427;&#12392;&#12365;&#12391;&#12377;&#12290;
</p><p>
    &#12522;&#12522;&#12540;&#12473;&#12398;&#25163;&#32154;&#12365;&#12399;&#12431;&#12374;&#12392;&#20445;&#23432;&#20027;&#32681;&#12395;&#20559;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#27491;&#24403;&#12394;&#29702;&#30001;&#12364;&#20184;&#12369;&#12425;&#12428;&#12383;&#21453;&#23550;&#31080;&#12399;&#12289;&#25216;&#34899;&#30340;&#12392;&#12356;&#12358;&#12424;&#12426;&#25163;&#32154;&#12365;&#30340;&#12395;&#25201;&#12431;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12427;&#22793;&#26356;&#12399;&#12424;&#12367;&#26360;&#12363;&#12428;&#12390;&#12356;&#12390;&#12289;&#12496;&#12464;&#12399;&#36215;&#12371;&#12373;&#12394;&#12356;&#12384;&#12429;&#12358;&#12369;&#12393;&#12289;
    &#12510;&#12452;&#12463;&#12525;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12427;&#12395;&#12399;&#22793;&#26356;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12356;&#12363;&#12425;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#21453;&#23550;&#31080;&#12434;&#25237;&#12376;&#12427;&#20154;&#12364;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#8212; &#22810;&#20998;&#12381;&#12398;&#22793;&#26356;&#12399;&#26032;&#27231;&#33021;&#12434;&#21152;&#12360;&#12427;&#12418;&#12398;&#12363;&#12289;
    &#24494;&#22937;&#12394;&#28857;&#12391;&#20114;&#25563;&#24615;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#23436;&#20840;&#12395;&#28310;&#25312;&#12375;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12354;&#12427;&#22793;&#26356;&#12395;&#12418;&#12387;&#12392;&#12486;&#12473;&#12488;&#12364;&#24517;&#35201;&#12384;&#12392;&#30452;&#24863;&#12391;&#24605;&#12387;&#12383;&#12392;&#12356;&#12358;&#29702;&#30001;&#12391;&#21453;&#23550;&#31080;&#12434;&#25237;&#12376;&#12427;&#38283;&#30330;&#32773;&#12434;&#35211;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#32191;&#23494;&#12395;&#35519;&#12409;&#12390;&#12418;&#20309;&#12398;&#12496;&#12464;&#12418;&#35211;&#20184;&#12369;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#38283;&#30330;&#32773;&#12383;&#12385;&#12399;&#12385;&#12423;&#12387;&#12392;&#19981;&#24179;&#12434;&#12356;&#12356;&#12414;&#12375;&#12383;&#12364;&#12289;&#21453;&#23550;&#31080;&#12399;&#26377;&#21177;&#12394;&#12414;&#12414;&#12289;
    &#12381;&#12398;&#22793;&#26356;&#12399;&#12522;&#12522;&#12540;&#12473;&#12395;&#21547;&#12417;&#12425;&#12428;&#12394;&#12363;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
    &#65288;&#12391;&#12377;&#12364;&#12289;&#24460;&#12398;&#12486;&#12473;&#12488;&#12391;&#12496;&#12464;&#12364;&#35211;&#20184;&#12363;&#12387;&#12383;&#12363;&#12393;&#12358;&#12363;&#12434;&#31169;&#12399;&#35226;&#12360;&#12390;&#12356;&#12414;&#12379;&#12435;&#65289;
</p><div class="sect3" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12434;&#31649;&#29702;&#12377;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="release-stabilization-collaboration"></a>
    &#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12434;&#31649;&#29702;&#12377;&#12427;
</h4></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12434;&#22793;&#12360;&#12427;&#36984;&#25246;&#12434;&#12375;&#12383;&#22580;&#21512;&#12289;
    &#25237;&#31080;&#29992;&#32025;&#12420;&#27770;&#36984;&#25237;&#31080;&#12434;&#34892;&#12358;&#29289;&#29702;&#30340;&#12394;&#20181;&#32068;&#12415;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#20415;&#21033;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#27714;&#12417;&#12425;&#12428;&#12414;&#12377;&#12290;
    &#12383;&#12367;&#12373;&#12435;&#12398;&#38651;&#23376;&#25237;&#31080;&#12471;&#12473;&#12486;&#12512;&#12364;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#23455;&#38555;&#12418;&#12387;&#12392;&#12418;&#31777;&#21336;&#12394;&#12398;&#12399;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395; <code class="filename">STATUS</code> &#12414;&#12383;&#12399; <code class="filename">VOTES</code> &#12392;&#12356;&#12387;&#12383;&#12486;&#12461;&#12473;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;&#29992;&#24847;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#25552;&#26696;&#12373;&#12428;&#12390;&#12356;&#12427;&#22793;&#26356;&#12434;&#19968;&#35239;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#8212;
    &#38283;&#30330;&#32773;&#12391;&#12354;&#12428;&#12400;&#35504;&#12391;&#12418;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#12424;&#12358;&#25552;&#26696;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#8212; &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#20840;&#12390;&#12398;&#25237;&#31080;&#12392;&#12289;&#12381;&#12428;&#12395;&#23550;&#12377;&#12427;&#36059;&#25104;&#12289;&#21453;&#23550;&#24847;&#35211;&#12289;&#12381;&#12428;&#12395;&#21152;&#12360;&#12390;&#12354;&#12425;&#12422;&#12427;&#12513;&#12514;&#12289;&#12381;&#12375;&#12390;&#12467;&#12513;&#12531;&#12488;&#12364;&#26360;&#12365;&#36796;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#65288;&#12392;&#12371;&#12429;&#12391;&#12289;&#22793;&#26356;&#12434;&#25552;&#26696;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
    &#24517;&#12378;&#12375;&#12418;&#12381;&#12398;&#22793;&#26356;&#12395;&#36059;&#25104;&#31080;&#12434;&#25237;&#12376;&#12390;&#12356;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12289;
    &#12381;&#12398;&#12405;&#12383;&#12388;&#12399;&#21516;&#26178;&#12395;&#34892;&#12431;&#12428;&#12427;&#12371;&#12392;&#12364;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;&#65289;
    &#12371;&#12358;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12456;&#12531;&#12488;&#12522;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><pre class="screen">
* r2401 (&#21839;&#38988; #49)
  &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;/&#12469;&#12540;&#12496;&#12398;&#12495;&#12531;&#12489;&#12471;&#12455;&#12452;&#12463;&#12364;&#65298;&#24230;&#34892;&#12431;&#12428;&#12427;&#12398;&#12434;&#36991;&#12369;&#12427;&#12290;
  &#22793;&#26356;&#12377;&#12427;&#29702;&#30001;:
    &#20313;&#35336;&#12394;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12479;&#12540;&#12531;&#12450;&#12521;&#12454;&#12531;&#12489;&#26178;&#38291;&#12434;&#28187;&#12425;&#12377;&#12290;&#22793;&#26356;&#12398;&#35215;&#27169;&#12399;&#23567;&#12373;&#12367;&#12289;&#12524;&#12499;&#12517;&#12540;&#12375;&#12420;&#12377;&#12356;&#12290;
  &#12513;&#12514;:
    &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399; http://.../mailing-lists/message-7777.html
    &#21450;&#12403;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#12354;&#12427;&#20182;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#35696;&#35542;&#12373;&#12428;&#12383;&#12290;
  &#25237;&#31080;:
    +1: jsmith, kimf
    -1: tmartin (&#12496;&#12540;&#12472;&#12519;&#12531; 1.0&#20197;&#21069;&#12398;&#12469;&#12540;&#12496;&#12392;&#12398;&#20114;&#25563;&#24615;&#12364;&#22730;&#12428;&#12390;&#12375;&#12414;&#12358;&#12290;
                 &#30906;&#12363;&#12395;&#12289;1.0&#20197;&#21069;&#12398;&#12469;&#12540;&#12496;&#12399;&#12496;&#12464;&#12364;&#22810;&#12356;&#12364;&#12289;&#12384;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;
                 &#20309;&#25925;&#24517;&#35201;&#12418;&#12394;&#12356;&#12398;&#12395;&#20114;&#25563;&#24615;&#12434;&#22730;&#12377;&#12398;&#12363;&#65311;)
</pre><p>
    &#12371;&#12398;&#22580;&#21512;&#12289;&#25552;&#26696;&#12373;&#12428;&#12383;&#22793;&#26356;&#12399;&#36059;&#25104;&#31080;&#12434;2&#12388;&#24471;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    tmartin &#12395;&#12424;&#12387;&#12390;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    tmartin &#12399;&#25324;&#24359;&#12388;&#12365;&#12398;&#12513;&#12514;&#12391;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12375;&#12383;&#29702;&#30001;&#12434;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#27491;&#30906;&#12394;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12393;&#12398;&#12424;&#12358;&#12395;&#27770;&#12417;&#12390;&#12418;&#12424;&#12356;&#12398;&#12391;&#12377; &#8212; &#22810;&#20998;&#12289;
    tmartin &#12364;&#25298;&#21542;&#27177;&#12434;&#34892;&#20351;&#12375;&#12383;&#29702;&#30001;&#12399; "&#12513;&#12514;:" &#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12395;&#31227;&#12377;&#12363;&#12289;
    &#22793;&#26356;&#12398;&#29702;&#30001;&#12399;&#20182;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12395;&#21512;&#12431;&#12379;&#12390; "&#35500;&#26126;:" &#12504;&#12483;&#12480;&#12434;&#12388;&#12369;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#22793;&#26356;&#12434;&#35413;&#20385;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#20840;&#12390;&#12398;&#24773;&#22577;&#12434;&#21040;&#36948;&#21487;&#33021;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12392;&#12289;
    &#27770;&#36984;&#25237;&#31080;&#12434;&#12377;&#12427;&#20181;&#32068;&#12415;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#31777;&#21336;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#25552;&#26696;&#12373;&#12428;&#12390;&#12356;&#12427;&#22793;&#26356;&#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;&#12391;&#21442;&#29031;&#12375;&#12414;&#12377;&#12290;
    &#65288;&#20170;&#22238;&#12398;&#22580;&#21512;&#12399;&#12289;&#21336;&#19968;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531; r2401 &#12391;&#12377;&#12364;&#12289;&#35079;&#25968;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12391;&#12418;&#31777;&#21336;&#12395;&#12391;&#12365;&#12414;&#12377;&#65289;
    &#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;&#12399;&#12289;trunk &#12395;&#21152;&#12360;&#12425;&#12428;&#12383;&#22793;&#26356;&#12434;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12364;&#24819;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#26082;&#12395;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#22793;&#26356;&#12364;&#21152;&#12360;&#12425;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#25237;&#31080;&#12377;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12418;&#12375;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#20491;&#12293;&#12398;&#22793;&#26356;&#12434;&#21442;&#29031;&#12377;&#12427;&#26126;&#31034;&#30340;&#12394;&#25991;&#27861;&#12434;&#25345;&#12387;&#12390;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#20316;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#25237;&#31080;&#12434;&#23455;&#21177;&#24615;&#12398;&#12354;&#12427;&#12418;&#12398;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
    &#23550;&#35937;&#12392;&#12394;&#12427;&#21508;&#12293;&#12398;&#22793;&#26356;&#12399;&#26326;&#26151;&#12391;&#12394;&#12356;&#29366;&#24907;&#12391;&#35672;&#21029;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#22793;&#26356;&#12398;&#25552;&#26696;&#12289;&#12418;&#12375;&#12367;&#12399;&#25237;&#31080;&#12398;&#23550;&#35937;&#12395;&#12394;&#12427;&#22793;&#26356;&#12399;&#12289;
    &#24517;&#12378;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#32186;&#40599;&#12395;&#36969;&#29992;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#34909;&#31361;&#12379;&#12378;&#12395;&#36969;&#29992;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#65288;<a class="xref" href="vc.html#vc-vocabulary-conflict"><em class="firstterm">&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;</em></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;
    &#12418;&#12375;&#34909;&#31361;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#32186;&#40599;&#12395;&#36969;&#29992;&#12377;&#12427;&#12424;&#12358;&#35519;&#25972;&#12375;&#12383;&#12497;&#12483;&#12481;&#12363;&#12289;
    &#22793;&#26356;&#12434;&#35519;&#25972;&#12375;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#26684;&#32013;&#12375;&#12383;&#19968;&#26178;&#12502;&#12521;&#12531;&#12481;&#12434;&#25237;&#31080;&#12398;&#12456;&#12531;&#12488;&#12522;&#12395;&#35352;&#36848;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><pre class="screen">
* r13222, r13223, r13232
  libsvn_fs_fs &#12398;&#33258;&#21205;&#12510;&#12540;&#12472;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#26360;&#12365;&#30452;&#12375;&#12383;
  &#22793;&#26356;&#12377;&#12427;&#29702;&#30001;:
    30&#19975;&#12522;&#12499;&#12472;&#12519;&#12531;&#12364;&#26684;&#32013;&#12373;&#12428;&#12383;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#35377;&#23481;&#12391;&#12365;&#12394;&#12356;
    (&#23567;&#12373;&#12394;&#12467;&#12511;&#12483;&#12488;&#12434;&#12375;&#12390;&#12418;50&#20998;&#20197;&#19978;&#12363;&#12363;&#12427;)
  &#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#12502;&#12521;&#12531;&#12481;:
    1.1.x-r13222@13517
  &#25237;&#31080;:
    +1: epg, ghudson
</pre><p>
    &#12371;&#12398;&#20363;&#12399;&#23455;&#22312;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12289;
    &#12388;&#12414;&#12426; Subversion 1.1.4 &#12398;&#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12391;&#20316;&#12425;&#12428;&#12383; STATUS &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#24341;&#29992;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#22793;&#26356;&#12364;&#36215;&#12371;&#12375;&#12383;&#34909;&#31361;&#12434;&#35519;&#25972;&#12375;&#12383;&#12502;&#12521;&#12531;&#12481;&#12364;&#12354;&#12427;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
    &#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#12289;&#12393;&#12358;&#12420;&#12387;&#12390;&#22793;&#26356;&#12434;&#34920;&#29694;&#12377;&#12427;&#35215;&#21063;&#30340;&#12394;&#21517;&#21069;&#12395;&#12375;&#12390;&#12356;&#12427;&#12363;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#65288;&#12381;&#12398;&#12502;&#12521;&#12531;&#12481;&#12418;&#12289;&#22793;&#26356;&#12434;&#12522;&#12522;&#12540;&#12473;&#12395;&#12510;&#12540;&#12472;&#12377;&#12427;&#12398;&#12434;&#23481;&#26131;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#65299;&#12388;&#12398;trunk&#12522;&#12499;&#12472;&#12519;&#12531;&#12434; r13517 &#12392;&#12356;&#12358;&#12522;&#12499;&#12472;&#12519;&#12531;&#12395;&#12414;&#12392;&#12417;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;&#35377;&#12373;&#12428;&#12427;&#12399;&#12378;&#12391;&#12377;&#65289;
    &#12371;&#12398;&#20363;&#12395;&#12399;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12364;&#35352;&#36848;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#27531;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12418;&#12387;&#12392;&#12418;&#12524;&#12499;&#12517;&#12540;&#12375;&#12420;&#12377;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#19968;&#26178;&#30340;&#12394;&#12502;&#12521;&#12531;&#12481;&#12395;&#12399;&#12381;&#12358;&#12375;&#12383;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#24773;&#22577;&#12398;&#37325;&#35079;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#65288;<span><a class="xref" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;">3&#31456;<i>&#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</i></a></span> &#12398; <a class="xref" href="vc.html#vc-singularity" title="&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;">&#12300;&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12289;
    &#12502;&#12521;&#12531;&#12481;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;"r13222, r13223, r13232 &#12434; 1.1.x &#12502;&#12521;&#12531;&#12481;&#29992;&#12395;&#35519;&#25972;&#12375;&#12383;" &#12392;&#31777;&#21336;&#12395;&#12377;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#22793;&#26356;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12399;&#20840;&#12390;&#12458;&#12522;&#12472;&#12490;&#12523;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12363;&#12425;&#36861;&#12356;&#12363;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div><div class="sect3" title="&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;"><div class="titlepage"><div><div><h4 class="title"><a name="release-manager"></a>&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</h4></div></div></div><p>
    &#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#22793;&#26356;&#12434;&#23455;&#38555;&#12395;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#12510;&#12540;&#12472;&#12377;&#12427;(<a class="xref" href="vc.html#vc-vocabulary-merge"><em class="firstterm">&#12510;&#12540;&#12472; (&#12354;&#12427;&#12356;&#12399;&#12509;&#12540;&#12488;)</em></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;&#38283;&#30330;&#32773;&#12391;&#12354;&#12428;&#12400;&#35504;&#12391;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#22793;&#26356;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#23554;&#38272;&#12398;&#20154;&#12434;&#32622;&#12367;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12418;&#12375;&#22793;&#26356;&#12364;&#12383;&#12367;&#12373;&#12435;&#12354;&#12428;&#12400;&#12289;
    &#12510;&#12540;&#12472;&#12377;&#12427;&#36000;&#25285;&#12434;&#20998;&#25955;&#12373;&#12379;&#12383;&#26041;&#12364;&#12424;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#25237;&#31080;&#12377;&#12427;&#12371;&#12392;&#12392;&#22793;&#26356;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#12371;&#12392;&#12399;&#21029;&#12293;&#12395;&#34892;&#12431;&#12428;&#12414;&#12377;&#12364;&#12289;
    &#23455;&#38555;&#12395;&#12399;&#12522;&#12522;&#12540;&#12473;&#12503;&#12525;&#12475;&#12473;&#12434;&#25351;&#25582;&#12377;&#12427;&#20154;&#12364;&#12402;&#12392;&#12426;&#12363;&#12405;&#12383;&#12426;&#12399;&#12356;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#24441;&#21106;&#12434;&#27491;&#24335;&#12395; <em class="firstterm">&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;</em> &#12392;&#21628;&#12406;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12393;&#12398;&#22793;&#26356;&#12434;&#21462;&#12426;&#36796;&#12416;&#12363;&#12395;&#38306;&#12377;&#12427;&#26368;&#32066;&#30340;&#12394;&#27770;&#23450;&#27177;&#12364;&#12354;&#12427;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#65288;<span>&#12371;&#12398;&#31456;&#12398;&#12399;&#12376;&#12417;&#12398;&#26041;&#12398;</span> <a class="xref" href="stabilizing-a-release.html#release-owner" title="&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12458;&#12540;&#12490;&#12540;&#12395;&#12424;&#12427;&#29420;&#35009;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12392;&#12399;&#20840;&#12367;&#21029;&#29289;&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#20505;&#35036;&#12395;&#12394;&#12427;&#22793;&#26356;&#12398;&#25968;&#12420;&#12289;
    &#23455;&#38555;&#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12383;&#22793;&#26356;&#12398;&#25968;&#12289;&#12381;&#12375;&#12390;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#39640;&#12356;&#22793;&#26356;&#12398;&#25968;&#12394;&#12393;&#12434;&#36861;&#12356;&#12363;&#12369;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#37325;&#35201;&#12394;&#22793;&#26356;&#12395;&#23550;&#12375;&#12390;&#38283;&#30330;&#32773;&#12364;&#21313;&#20998;&#12395;&#27880;&#24847;&#12434;&#25173;&#12431;&#12378;&#12289;
    &#25237;&#31080;&#12418;&#12373;&#12428;&#12378;&#12395;&#25918;&#32622;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12392;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#24863;&#12376;&#12383;&#22580;&#21512;&#12289;
    &#24444;&#12425;&#12399;&#20182;&#12398;&#38283;&#30330;&#32773;&#12395;&#23567;&#35328;&#12434;&#35328;&#12387;&#12390;&#12524;&#12499;&#12517;&#12540;&#12420;&#25237;&#31080;&#12434;&#12377;&#12427;&#12424;&#12358;&#20419;&#12375;&#12414;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12395;&#21462;&#12426;&#36796;&#12416;&#22793;&#26356;&#12364;&#12383;&#12414;&#12387;&#12390;&#12365;&#12383;&#12425;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12364;&#24341;&#12365;&#21462;&#12387;&#12390;&#12414;&#12392;&#12417;&#12390;&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481;&#12395;&#12510;&#12540;&#12472;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#22793;&#26356;&#12434;&#26126;&#31034;&#30340;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#20197;&#22806;&#12398;&#20181;&#20107;&#12434;&#20840;&#12390;&#24444;&#12425;&#12395;&#12420;&#12425;&#12379;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12392;&#29702;&#35299;&#12375;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
    &#20182;&#12398;&#38283;&#30330;&#32773;&#12364;&#12381;&#12358;&#12375;&#12383;&#20181;&#20107;&#12434;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#20219;&#12379;&#12425;&#12428;&#12427;&#12398;&#12399;&#12424;&#12356;&#29366;&#24907;&#12391;&#12377;&#12290;
    &#12522;&#12522;&#12540;&#12473;&#12434;&#19990;&#12395;&#20986;&#12377;&#26178;&#12364;&#12365;&#12383;&#12425;(<span>&#12371;&#12398;&#31456;&#12398;&#24460;&#21322;&#12398;</span> <a class="xref" href="testing-and-releasing.html" title="&#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473;">&#12300;&#12486;&#12473;&#12488;&#12392;&#12522;&#12522;&#12540;&#12473;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12289;
    &#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#26368;&#32066;&#30340;&#12394;&#12522;&#12522;&#12540;&#12473;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20316;&#25104;&#12375;&#12383;&#12426;&#12289;
    &#12487;&#12472;&#12479;&#12523;&#32626;&#21517;&#12434;&#38598;&#12417;&#12383;&#12426;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12375;&#12383;&#12426;&#12289;
    &#20844;&#24335;&#12395;&#12450;&#12490;&#12454;&#12531;&#12473;&#12434;&#20986;&#12377;&#20316;&#26989;&#12395;&#27880;&#24847;&#12434;&#25173;&#12356;&#12414;&#12377;&#12290;
</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="release-branches.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="packaging.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12522;&#12522;&#12540;&#12473;&#12502;&#12521;&#12531;&#12481; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12497;&#12483;&#12465;&#12540;&#12472;&#12531;&#12464;</td></tr></table></div></body></html>
