<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="announcing.html" title="&#24195;&#22577;"><link rel="next" href="mailing-lists.html" title="&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="announcing.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="mailing-lists.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="chapter" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><div class="titlepage"><div><div><h2 class="title"><a name="technical-infrastructure"></a>&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="technical-infrastructure.html#tools-needed">&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398;</a></span></dt><dt><span class="sect1"><a href="mailing-lists.html">&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</a></span></dt><dd><dl><dt><span class="sect2"><a href="mailing-lists.html#spam-prevention">&#12473;&#12497;&#12512;&#23550;&#31574;</a></span></dt><dd><dl><dt><span class="sect3"><a href="mailing-lists.html#spam-filtering">&#25237;&#31295;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;</a></span></dt><dt><span class="sect3"><a href="mailing-lists.html#address-hiding">&#12450;&#12540;&#12459;&#12452;&#12502;&#12391;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12398;&#20966;&#29702;</a></span></dt></dl></dd><dt><span class="sect2"><a href="mailing-lists.html#header-management">&#35672;&#21029;&#12375;&#12420;&#12377;&#12356;&#12504;&#12483;&#12480;</a></span></dt><dt><span class="sect2"><a href="mailing-lists.html#reply-to">Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;</a></span></dt><dd><dl><dt><span class="sect3"><a href="mailing-lists.html#reply-fantasies">&#31169;&#12398;&#12405;&#12383;&#12388;&#12398;&#22818;</a></span></dt></dl></dd><dt><span class="sect2"><a href="mailing-lists.html#archiving">&#12450;&#12540;&#12459;&#12452;&#12502;</a></span></dt><dt><span class="sect2"><a href="mailing-lists.html#mailing-list-software">&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</a></span></dt></dl></dd><dt><span class="sect1"><a href="vc.html">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;</a></span></dt><dd><dl><dt><span class="sect2"><a href="vc.html#vc-vocabulary">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#29992;&#35486;&#38598;</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-choosing">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#36984;&#25246;</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-using">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#20351;&#29992;&#27861;</a></span></dt><dd><dl><dt><span class="sect3"><a href="vc.html#version-everything">&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-browsing">&#12454;&#12455;&#12502;&#12391;&#38322;&#35239;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;</a></span></dt><dt><span class="sect3"><a href="vc.html#commit-emails">&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;</a></span></dt><dt><span class="sect3"><a href="vc.html#branches">&#12502;&#12521;&#12531;&#12481;&#12398;&#27963;&#29992;</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-singularity">&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-authz">&#25215;&#35469;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="bug-tracker.html">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</a></span></dt><dd><dl><dt><span class="sect2"><a href="bug-tracker.html#bug-tracker-mailing-list-interaction">&#35696;&#35542;&#12398;&#22580;&#12392;&#12375;&#12390;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12434;&#20351;&#12358;</a></span></dt><dt><span class="sect2"><a href="bug-tracker.html#bug-filtering">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;</a></span></dt></dl></dd><dt><span class="sect1"><a href="irc.html">IRC / &#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12395;&#34892;&#12394;&#12431;&#12428;&#12427;&#12481;&#12515;&#12483;&#12488;&#12471;&#12473;&#12486;&#12512;</a></span></dt><dd><dl><dt><span class="sect2"><a href="irc.html#bots">&#12508;&#12483;&#12488;</a></span></dt><dt><span class="sect2"><a href="irc.html#irc-archiving">IRC&#12398;&#20250;&#35441;&#12434;&#20445;&#23384;&#12377;&#12427;</a></span></dt></dl></dd><dt><span class="sect1"><a href="rss.html">RSS &#12501;&#12451;&#12540;&#12489;</a></span></dt><dt><span class="sect1"><a href="wikis.html">Wiki</a></span></dt><dt><span class="sect1"><a href="web-site.html">&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</a></span></dt><dd><dl><dt><span class="sect2"><a href="web-site.html#canned-hosting">&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;</a></span></dt><dd><dl><dt><span class="sect3"><a href="web-site.html#canned-hosting-choosing">&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#36984;&#12406;</a></span></dt><dt><span class="sect3"><a href="web-site.html#anonymity">&#21311;&#21517;&#24615;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21442;&#21152;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="social-networking.html">Social Networking Services</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12367;&#12395;&#12399;&#12289;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#24773;&#22577;&#12434;&#21462;&#25448;&#36984;&#25246;&#12377;&#12427;&#25216;&#34899;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#25216;&#34899;&#12434;&#20351;&#12356;&#12371;&#12394;&#12379;&#12400;&#12371;&#12394;&#12377;&#12411;&#12393;&#12289;&#12414;&#12383;&#21608;&#12426;&#12398;&#20154;&#12395;&#20351;&#12431;&#12379;&#12428;&#12400;&#20351;&#12431;&#12379;&#12427;&#12411;&#12393;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12358;&#12414;&#12367;&#12356;&#12367;&#21487;&#33021;&#24615;&#12364;&#39640;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#27169;&#12364;&#22823;&#12365;&#12367;&#12394;&#12428;&#12400;&#12394;&#12427;&#12411;&#12393;&#12289;&#12371;&#12398;&#20670;&#21521;&#12399;&#24375;&#12414;&#12426;&#12414;&#12377;&#12290;
  &#12358;&#12414;&#12367;&#24773;&#22577;&#12434;&#31649;&#29702;&#12375;&#12394;&#12356;&#12392;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;
  &#12502;&#12523;&#12483;&#12463;&#12473;&#12398;&#27861;&#21063;
  <sup>[<a name="idp94480" href="#ftn.idp94480" class="footnote">15</a>]</sup>
  (&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#32066;&#30436;&#12395;&#12394;&#12387;&#12390;&#12363;&#12425;&#20154;&#12434;&#22679;&#12420;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;
  &#12363;&#12360;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#23436;&#25104;&#12364;&#36933;&#12428;&#12390;&#12375;&#12414;&#12358;) &#12398;&#32608;&#12395;&#38501;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  Fred Brooks &#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35079;&#38609;&#24230;&#12399;&#12381;&#12428;&#12395;&#12363;&#12363;&#12431;&#12427;&#38306;&#20418;&#32773;&#12398;&#25968;&#12398;
  <span class="emphasis"><em>&#65298;&#20055;</em></span>&#12395;&#27604;&#20363;&#12377;&#12427;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12513;&#12531;&#12496;&#12540;&#12398;&#25968;&#12364;&#12411;&#12435;&#12398;&#25968;&#20154;&#12398;&#26178;&#12399;&#12289;&#31777;&#21336;&#12395;&#12362;&#20114;&#12356;&#12398;&#24847;&#24605;&#30094;&#36890;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12513;&#12531;&#12496;&#12540;&#12364;&#25968;&#30334;&#20154;&#35215;&#27169;&#12395;&#33192;&#12428;&#19978;&#12364;&#12427;&#12392;&#12289;
  &#12418;&#12399;&#12420;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#20309;&#12434;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#12377;&#12409;&#12390;&#25226;&#25569;&#12377;&#12427;&#12371;&#12392;&#12399;&#19981;&#21487;&#33021;&#12391;&#12377;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31649;&#29702;&#12377;&#12427;&#31192;&#35363;&#12399;&#12289;
  &#12362;&#20114;&#12356;&#12364;&#12414;&#12427;&#12391;&#12402;&#12392;&#12388;&#12398;&#37096;&#23627;&#12395;&#38598;&#12414;&#12387;&#12390;&#12392;&#12418;&#12395;&#20685;&#12356;&#12390;&#12356;&#12427;&#12363;&#12398;&#12424;&#12358;&#12395;&#24863;&#12376;&#12373;&#12379;&#12427;&#12371;&#12392;&#12384;&#12392;&#12356;&#12356;&#12414;&#12377;&#12290;
  &#12391;&#12399;&#12289;&#12418;&#12375;&#28151;&#38609;&#12375;&#12383;&#37096;&#23627;&#12395;&#35440;&#12417;&#36796;&#12414;&#12428;&#12383;&#12513;&#12531;&#12496;&#12540;&#12364;&#12415;&#12435;&#12394;&#12356;&#12387;&#12379;&#12356;&#12395;&#35441;&#12375;&#22987;&#12417;&#12383;&#12425;&#12289;
  &#12393;&#12435;&#12394;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;?
</p><p>
  &#12371;&#12428;&#12399;&#12289;&#29305;&#12395;&#30446;&#26032;&#12375;&#12356;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#35441;&#12391;&#12399;&#12394;&#12356;&#23455;&#38555;&#12398;&#28151;&#38609;&#12375;&#12383;&#37096;&#23627;&#12391;&#12399;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12398;&#35299;&#27770;&#27861;&#12399;
  <em class="firstterm">&#35696;&#20250;&#21046;</em>&#12289;&#12388;&#12414;&#12426;&#22823;&#20154;&#25968;&#12398;&#38598;&#22243;&#12391;&#35696;&#35542;&#12434;&#34892;&#12358;&#38555;&#12398;&#25163;&#38918;&#12434;&#27770;&#12417;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#37325;&#35201;&#12394;&#30064;&#35696;&#12364;&#12300;&#30064;&#35696;&#12394;&#12375;!&#12301;&#12398;&#22823;&#21512;&#21809;&#12395;&#12363;&#12365;&#28040;&#12373;&#12428;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12289;
  &#12356;&#12367;&#12388;&#12363;&#12398;&#23567;&#22996;&#21729;&#20250;&#12434;&#27083;&#25104;&#12375;&#12383;&#12426;&#12289;&#35696;&#27770;&#26041;&#27861;&#12434;&#23450;&#32681;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#21046;&#24230;&#12391;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12381;&#12398;&#38598;&#22243;&#12364;&#24773;&#22577;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#21033;&#29992;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
  "&#27491;&#24335;&#12395;&#35352;&#37682;&#12373;&#12428;&#12427;" &#24773;&#22577;&#12418;&#12354;&#12428;&#12400;&#12289;&#12381;&#12358;&#12391;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#35352;&#37682;&#33258;&#20307;&#12399;&#26041;&#21521;&#24615;&#12434;&#27770;&#12417;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12300;&#20309;&#12364;&#36215;&#12371;&#12387;&#12383;&#12398;&#12363;&#12301;&#12434;&#21336;&#12395;&#26360;&#12365;&#35352;&#12375;&#12383;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12381;&#12398;&#38598;&#22243;&#12391;&#20309;&#12434; <span class="emphasis"><em>&#21512;&#24847;</em></span> &#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#34920;&#12377;&#12418;&#12398;&#12392;&#32771;&#12360;&#12414;&#12377;&#12290;
  &#35352;&#37682;&#12399;&#12289;&#30446;&#30340;&#12395;&#12424;&#12387;&#12390;&#12373;&#12414;&#12374;&#12414;&#12394;&#24418;&#24335;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#20491;&#21029;&#12398;&#25171;&#12385;&#21512;&#12431;&#12379;&#12398;&#35696;&#20107;&#37682;&#12289;&#12377;&#12409;&#12390;&#12398;&#25171;&#12385;&#21512;&#12431;&#12379;&#12398;&#35696;&#20107;&#37682;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12289;
  &#12381;&#12398;&#27010;&#35201;&#12289;&#35696;&#38988;&#12289;&#12467;&#12513;&#12531;&#12488;&#12289;&#22996;&#21729;&#20250;&#12398;&#22577;&#21578;&#26360;&#12289;
  &#12381;&#12398;&#22580;&#12395;&#12356;&#12394;&#12356;&#36890;&#20449;&#21729;&#12363;&#12425;&#12398;&#22577;&#21578;&#12289;&#23487;&#38988;&#12398;&#19968;&#35239;&#12394;&#12393;&#12364;&#35352;&#37682;&#12395;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;
</p><p>
  &#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12399;&#23455;&#38555;&#12398;&#37096;&#23627;&#12392;&#12399;&#30064;&#12394;&#12427;&#12398;&#12391;&#12289;
  &#12300;&#35504;&#12363;&#12364;&#30330;&#35328;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12399;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#38745;&#12363;&#12395;&#12381;&#12428;&#12434;&#32884;&#12367;&#12301;
  &#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#12375;&#12365;&#12383;&#12426;&#12395;&#12371;&#12384;&#12431;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#24773;&#22577;&#31649;&#29702;&#25216;&#34899;&#12434;&#39366;&#20351;&#12377;&#12427;&#12392;&#12289;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#35696;&#35542;&#12398;&#25163;&#38918;&#12399;&#12424;&#12426;&#21177;&#29575;&#30340;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12411;&#12412;&#12377;&#12409;&#12390;&#12398;&#12420;&#12426;&#12392;&#12426;&#12399;&#25991;&#23383;&#12395;&#12424;&#12387;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;
  &#12381;&#12371;&#12391;&#12289;&#24773;&#22577;&#12434;&#25391;&#12426;&#20998;&#12369;&#12383;&#12426;&#36969;&#20999;&#12394;&#12521;&#12505;&#12523;&#20184;&#12369;&#12434;&#12375;&#12383;&#12426;&#12377;&#12427;&#12383;&#12417;&#12398;&#12471;&#12473;&#12486;&#12512;&#12364;&#30330;&#36948;&#12375;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#32368;&#12426;&#36820;&#12375;&#12434;&#26368;&#23567;&#38480;&#12395;&#25233;&#12360;&#12390;&#38291;&#36949;&#12387;&#12383;&#26041;&#21521;&#12395;&#36914;&#12415;&#12395;&#12367;&#12356;&#12424;&#12358;&#12395;&#12375;&#12383;&#12426;&#12289;
  &#12487;&#12540;&#12479;&#12434;&#20445;&#23384;&#12375;&#12390;&#26908;&#32034;&#12375;&#12420;&#12377;&#12367;&#12375;&#12383;&#12426;&#12289;
  &#38291;&#36949;&#12387;&#12383;&#24773;&#22577;&#12420;&#21476;&#12403;&#12383;&#24773;&#22577;&#12434;&#35330;&#27491;&#12375;&#12383;&#12426;&#12289;
  &#12354;&#12385;&#12371;&#12385;&#12395;&#25955;&#12425;&#12400;&#12387;&#12383;&#24773;&#22577;&#12434;&#12414;&#12392;&#12417;&#12390;&#12381;&#12428;&#12425;&#12398;&#12388;&#12394;&#12364;&#12426;&#12434;&#35211;&#20986;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#20316;&#26989;&#12398;&#12383;&#12417;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#31309;&#26997;&#30340;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;&#12289;
  &#12371;&#12428;&#12425;&#12398;&#12486;&#12463;&#12491;&#12483;&#12463;&#12434;&#33258;&#28982;&#12395;&#36523;&#12395;&#30528;&#12369;&#12390;&#12362;&#12426;&#12289;
  &#24773;&#22577;&#12364;&#27491;&#12375;&#12367;&#12356;&#12365;&#12431;&#12383;&#12427;&#12424;&#12358;&#12395;&#35079;&#38609;&#12394;&#25163;&#20316;&#26989;&#12434;&#34892;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20840;&#20307;&#12391;&#32771;&#12360;&#12427;&#12392;&#12289;&#12371;&#12428;&#12425;&#12398;&#20316;&#26989;&#12395;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12469;&#12509;&#12540;&#12488;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
  &#21487;&#33021;&#12394;&#38480;&#12426;&#12289;&#36890;&#20449;&#12395;&#20351;&#29992;&#12377;&#12427;&#12513;&#12487;&#12451;&#12450;&#33258;&#36523;&#12364;
  &#25391;&#12426;&#20998;&#12369;&#12420;&#12521;&#12505;&#12523;&#20184;&#12369;&#12289;&#20869;&#23481;&#12398;&#20445;&#23384;&#12392;&#12356;&#12387;&#12383;&#20316;&#26989;&#12434;&#34892;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12381;&#12398;&#24773;&#22577;&#12399;&#12289;&#20154;&#38291;&#12364;&#35211;&#12420;&#12377;&#12356;&#24418;&#24335;&#12391;&#21033;&#29992;&#21487;&#33021;&#12395;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#29694;&#23455;&#30340;&#12395;&#12399;&#12414;&#12384;&#12381;&#12371;&#12414;&#12391;&#20840;&#33258;&#21205;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#36884;&#20013;&#12391;&#20309;&#12425;&#12363;&#12398;&#20154;&#25163;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#19968;&#33324;&#35542;&#12392;&#12375;&#12390;&#12289;&#20154;&#38291;&#20596;&#12391;&#25391;&#12426;&#20998;&#12369;&#12420;&#12521;&#12505;&#12523;&#20184;&#12369;&#12398;&#12383;&#12417;&#12398;&#24773;&#22577;&#12434;&#19968;&#24230;&#25552;&#20379;&#12375;&#12383;&#12425;&#12289;
  &#12354;&#12392;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#20596;&#12391;&#12381;&#12398;&#12417;&#12383;&#12487;&#12540;&#12479;&#12434;&#26368;&#22823;&#38480;&#12395;&#27963;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
  &#26412;&#31456;&#12391;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12289;&#23455;&#29992;&#30340;&#12394;&#12418;&#12398;&#12400;&#12363;&#12426;&#12391;&#12377;&#12290;
  &#12393;&#12428;&#12418;&#29305;&#23450;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12420;&#12381;&#12398;&#20351;&#29992;&#20363;&#12395;&#12418;&#12392;&#12389;&#12356;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12392;&#12399;&#12356;&#12360;&#12289;&#21336;&#12395;&#29305;&#23450;&#12398;&#12486;&#12463;&#12491;&#12483;&#12463;&#12434;&#25945;&#12360;&#12427;&#12384;&#12369;&#12392;&#12356;&#12358;&#12388;&#12418;&#12426;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#20363;&#12434;&#12383;&#12367;&#12373;&#12435;&#12372;&#35239;&#12356;&#12383;&#12384;&#12367;&#12371;&#12392;&#12391;&#12289;
  &#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#24773;&#22577;&#31649;&#29702;&#12434;&#12424;&#12426;&#12424;&#12367;&#12377;&#12427;&#12383;&#12417;&#12398;
  &#19968;&#33324;&#30340;&#12394;&#26041;&#27861;&#12434;&#36523;&#12395;&#12388;&#12369;&#12390;&#12356;&#12383;&#12384;&#12367;&#12388;&#12418;&#12426;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12395;&#12399;&#12289;&#25216;&#34899;&#30340;&#12394;&#12473;&#12461;&#12523;&#12384;&#12369;&#12391;&#12394;&#12367;&#31038;&#20250;&#30340;&#12394;&#12473;&#12461;&#12523;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#12473;&#12461;&#12523;&#12399;&#24517;&#35201;&#19981;&#21487;&#27424;&#12391;&#12377;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12289;
  &#24773;&#22577;&#31649;&#29702;&#29992;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#24120;&#12395;&#20309;&#12425;&#12363;&#12398;&#35373;&#23450;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#36939;&#29992;&#20013;&#12395;&#12418;&#12354;&#12427;&#31243;&#24230;&#12398;&#20445;&#23432;&#20316;&#26989;&#12364;&#24517;&#35201;&#12391;&#12377;
  (&#12383;&#12392;&#12360;&#12400;&#12289;&#22823;&#12365;&#12367;&#25104;&#38263;&#12375;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#25201;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;
  <span>&#26412;&#31456;&#12398;&#24460;&#21322;</span> &#12398;
  <a class="xref" href="bug-tracker.html#bug-filtering" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;">&#12300;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;&#12301;</a> &#12391;&#21462;&#12426;&#19978;&#12370;&#12390;&#12356;&#12414;&#12377;)&#12290;
  &#12414;&#12383;&#12289;&#31038;&#20250;&#30340;&#12394;&#12473;&#12461;&#12523;&#12418;&#24517;&#38920;&#12391;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12289;
  &#20154;&#38291;&#12398;&#38598;&#12414;&#12426;&#12395;&#12388;&#12356;&#12390;&#12418;&#32173;&#25345;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#12484;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#21033;&#30410;&#12434;&#21463;&#12369;&#12427;&#26041;&#27861;&#12399;&#12289;
  &#12377;&#12368;&#12395;&#26126;&#12425;&#12363;&#12395;&#12394;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12381;&#12398;&#20351;&#29992;&#27861;&#12434;&#12417;&#12368;&#12387;&#12390;&#20105;&#12356;&#12364;&#36215;&#12371;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;
  (&#20363;&#12392;&#12375;&#12390;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12363;&#12425;&#37197;&#36865;&#12373;&#12428;&#12427;&#12513;&#12540;&#12523;&#12398;
  <code class="systemitem">Reply-to</code> &#12504;&#12483;&#12480;&#12398;&#35373;&#23450;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12434;
  <a class="xref" href="mailing-lists.html" title="&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;">&#12300;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12301;</a> &#12391;&#21462;&#12426;&#19978;&#12370;&#12390;&#12356;&#12414;&#12377;)&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;&#12415;&#12394;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#24773;&#22577;&#12434;&#12358;&#12414;&#12367;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12398;&#26041;&#27861;&#12434;&#24517;&#35201;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#28145;&#12367;&#12363;&#12363;&#12431;&#12428;&#12400;&#12363;&#12363;&#12431;&#12427;&#12411;&#12393;&#12289;
  &#23398;&#12400;&#12397;&#12400;&#12394;&#12425;&#12394;&#12356;&#12486;&#12463;&#12491;&#12483;&#12463;&#12399;&#35079;&#38609;&#12391;&#23554;&#38272;&#30340;&#12394;&#12418;&#12398;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#24773;&#22577;&#31649;&#29702;&#12395;&#12399;&#12289;&#26376;&#20006;&#12415;&#12394;&#35299;&#27770;&#31574;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#32771;&#24942;&#12377;&#12409;&#12365;&#28857;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#22810;&#12377;&#12366;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#26368;&#32066;&#30340;&#12395;&#26395;&#12415;&#12393;&#12362;&#12426;&#12398;&#25163;&#27573;&#12364;&#35211;&#12388;&#12363;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12398;&#21442;&#21152;&#32773;&#12398;&#12411;&#12392;&#12435;&#12393;&#12418;&#12381;&#12398;&#26041;&#27861;&#12434;&#21033;&#29992;&#12375;&#12390;&#12367;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12373;&#12425;&#12395;&#25104;&#38263;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#12381;&#12398;&#26041;&#27861;&#12364;&#12381;&#12398;&#12414;&#12414;&#20351;&#12360;&#12427;&#12392;&#12399;&#38480;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25104;&#38263;&#12364;&#23433;&#23450;&#12375;&#12289;
  &#38283;&#30330;&#32773;&#12392;&#12518;&#12540;&#12470;&#12540;&#12398;&#20001;&#26041;&#12364;&#29694;&#22312;&#12398;&#24773;&#22577;&#31649;&#29702;&#25216;&#34899;&#12395;&#24931;&#12428;&#12390;&#12365;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#12384;&#12428;&#12363;&#12364;&#12414;&#12387;&#12383;&#12367;&#26032;&#12375;&#12356;&#24773;&#22577;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#30330;&#26126;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#26032;&#12375;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#12513;&#12531;&#12496;&#12540;&#12399;&#12365;&#12387;&#12392;&#12371;&#12358;&#35328;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12300;&#20309;&#12391;&#12354;&#12398;&#20415;&#21033;&#12394;&#12484;&#12540;&#12523;&#12434;&#20351;&#12431;&#12394;&#12356;&#12398;?&#12301;
  Wiki (<a class="ulink" href="http://ja.wikipedia.org/wiki/Wiki" target="_top">http://ja.wikipedia.org/wiki/Wiki</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
  &#12364;&#30331;&#22580;&#12375;&#12384;&#12375;&#12383;&#38915;&#12395;&#12289;&#24403;&#26178;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22810;&#12367;&#12391;&#12414;&#12373;&#12395;&#12371;&#12428;&#12392;&#21516;&#12376;&#12371;&#12392;&#12364;&#36215;&#12371;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#12393;&#12398;&#12424;&#12358;&#12394;&#25163;&#27573;&#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12434;&#27770;&#12417;&#12427;&#12395;&#12399;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#21028;&#26029;&#26448;&#26009;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;&#20596;&#12392;&#24773;&#22577;&#12434;&#21033;&#29992;&#12377;&#12427;&#20596;&#12398;&#12393;&#12385;&#12425;&#12398;&#21033;&#20415;&#24615;&#12434;&#20778;&#20808;&#12373;&#12379;&#12427;&#12363;&#12418;
  &#21028;&#26029;&#26448;&#26009;&#12398;&#12402;&#12392;&#12388;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#12354;&#12427;&#12356;&#12399;&#12289;
  &#24773;&#22577;&#31649;&#29702;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#35373;&#23450;&#12398;&#38627;&#26131;&#24230;&#12392;&#12289;
  &#12381;&#12428;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12418;&#12383;&#12425;&#12377;&#21033;&#30410;&#12392;&#12398;&#12488;&#12524;&#12540;&#12489;&#12458;&#12501;&#12395;&#12388;&#12356;&#12390;&#12418;&#32771;&#12360;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12354;&#12414;&#12426;&#12395;&#12394;&#12435;&#12391;&#12418;&#12363;&#12435;&#12391;&#12418;&#33258;&#21205;&#21270;&#12375;&#12377;&#12366;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#23455;&#38555;&#12289;&#20154;&#25163;&#12364;&#12363;&#12363;&#12431;&#12427;&#12409;&#12365;&#12392;&#12371;&#12429;&#12414;&#12391;&#33258;&#21205;&#21270;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#20181;&#32068;&#12415;&#12399;&#37325;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12358;&#12414;&#12367;&#36939;&#21942;&#12377;&#12427;&#12383;&#12417;&#12395;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;
  &#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#20154;&#12408;&#12398;&#27671;&#37197;&#12426;&#8212;&#27770;&#12375;&#12390;&#12362;&#12375;&#12388;&#12369;&#12364;&#12414;&#12375;&#12367;&#12394;&#12356;&#27671;&#37197;&#12426;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#25216;&#34899;&#30340;&#12394;&#20181;&#32068;&#12415;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#12371;&#12398;&#27671;&#37197;&#12426;&#12434;&#12358;&#12414;&#12367;&#34892;&#12358;&#12383;&#12417;&#12398;&#25163;&#27573;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;
</p></div><div class="sect1" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="tools-needed"></a>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398;</h2></div></div></div><p>
  &#12411;&#12392;&#12435;&#12393;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;
  &#24773;&#22577;&#31649;&#29702;&#29992;&#12398;&#12484;&#12540;&#12523;&#12392;&#12375;&#12390;&#23569;&#12394;&#12367;&#12392;&#12418;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><div class="variablelist"><dl><dt><span class="term">&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</span></dt><dd><p>
       &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12388;&#12356;&#12390;&#12398;&#24773;&#22577;&#12434;&#12289;
       &#31649;&#29702;&#32773;&#20596;&#12363;&#12425;&#19968;&#33324;&#12395;&#21521;&#12369;&#12390;&#20844;&#38283;&#12377;&#12427;&#22580;&#25152;&#12391;&#12377;&#12290;
       &#12414;&#12383;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12377;&#12427;&#12381;&#12398;&#20182;&#12398;&#12484;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;&#12398;
       &#31649;&#29702;&#29992;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12418;&#12371;&#12371;&#12391;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</span></dt><dd><p>
         &#36890;&#24120;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12362;&#12369;&#12427;&#26368;&#12418;&#27963;&#30330;&#12394;&#35696;&#35542;&#12398;&#22580;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
         &#12414;&#12383;&#12289;&#35696;&#35542;&#12398;&#12300;&#35352;&#37682;&#23186;&#20307;&#12301;&#12392;&#12375;&#12390;&#12398;&#24847;&#21619;&#21512;&#12356;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
       </p></dd><dt><span class="term">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</span></dt><dd><p>
         &#38283;&#30330;&#32773;&#12364;&#12289;&#12467;&#12540;&#12489;&#12398;&#22793;&#26356;&#28857;&#12434;&#36861;&#12356;&#12363;&#12369;&#12420;&#12377;&#12367;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
         &#22793;&#26356;&#20869;&#23481;&#12434;&#20803;&#12395;&#25147;&#12375;&#12383;&#12426;&#12289;&#20182;&#12395;&#31227;&#26893;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
         &#12371;&#12428;&#12434;&#35211;&#12427;&#12392;&#12289;&#12467;&#12540;&#12489;&#12395;&#20309;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#35504;&#12418;&#12364;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
       </p></dd><dt><span class="term">&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</span></dt><dd><p>
         &#38283;&#30330;&#32773;&#12364;&#33258;&#20998;&#12398;&#20316;&#26989;&#20869;&#23481;&#12434;&#30906;&#35469;&#12375;&#12383;&#12426;&#12289;
         &#20182;&#12398;&#38283;&#30330;&#32773;&#12392;&#20316;&#26989;&#12434;&#35519;&#25972;&#12375;&#12383;&#12426;&#12289;&#12522;&#12522;&#12540;&#12473;&#26178;&#26399;&#12398;&#20104;&#23450;&#12434;&#12383;&#12390;&#12383;&#12426;&#12377;&#12427;&#12383;&#12417;&#12395;&#29992;&#12356;&#12414;&#12377;&#12290;
         &#29305;&#23450;&#12398;&#12496;&#12464;&#12398;&#29366;&#27841;&#12420;&#38306;&#36899;&#24773;&#22577; (&#20877;&#29694;&#25163;&#38918;&#12394;&#12393;)
         &#12395;&#12388;&#12356;&#12390;&#12289;&#35504;&#12418;&#12364;&#35519;&#12409;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
         &#12496;&#12464;&#12384;&#12369;&#12395;&#38480;&#12425;&#12378;&#12289;&#12420;&#12427;&#12409;&#12365;&#20316;&#26989;&#12420;&#12522;&#12522;&#12540;&#12473;&#26178;&#26399;&#12289;
         &#26032;&#27231;&#33021;&#12398;&#36861;&#21152;&#12394;&#12393;&#12395;&#12388;&#12356;&#12390;&#12418;&#12371;&#12371;&#12391;&#25201;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
       </p></dd><dt><span class="term">&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12481;&#12515;&#12483;&#12488;</span></dt><dd><p>
         &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#35696;&#35542;&#12420;&#36074;&#21839;&#12398;&#12420;&#12426;&#21462;&#12426;&#12398;&#12383;&#12417;&#12398;&#22580;&#12391;&#12377;&#12290;
         &#35696;&#35542;&#12398;&#20869;&#23481;&#12364;&#12450;&#12540;&#12459;&#12452;&#12502;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
       </p></dd></dl></div><p>
  &#12371;&#12371;&#12391;&#12354;&#12370;&#12383;&#12484;&#12540;&#12523;&#12399;&#12393;&#12428;&#12418;&#30064;&#12394;&#12427;&#12491;&#12540;&#12474;&#12434;&#28288;&#12383;&#12377;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
  &#12381;&#12398;&#27231;&#33021;&#12395;&#12399;&#30456;&#38306;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;
  &#21508;&#31278;&#12484;&#12540;&#12523;&#32676;&#12399;&#21332;&#35519;&#12375;&#12390;&#21205;&#20316;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#20197;&#38477;&#12391;&#12399;&#12289;
  &#12381;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12424;&#12426;&#37325;&#35201;&#12394;&#12371;&#12392;&#12392;&#12375;&#12390;&#12289;
  &#12513;&#12531;&#12496;&#12540;&#12395;&#12381;&#12428;&#12434;&#20351;&#12387;&#12390;&#12418;&#12425;&#12358;&#12383;&#12417;&#12395;&#12399;&#12393;&#12358;&#12377;&#12428;&#12400;&#12356;&#12356;&#12398;&#12363;&#12418;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12399;&#24460;&#22238;&#12375;&#12395;&#12375;&#12414;&#12377;&#12290;&#12392;&#12356;&#12358;&#12398;&#12418;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12399;&#12289;
  &#29420;&#31435;&#12375;&#12383;&#12484;&#12540;&#12523;&#12392;&#12356;&#12358;&#12424;&#12426;&#12399;
  &#20182;&#12398;&#12484;&#12540;&#12523;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12383;&#12417;&#12398;&#25509;&#30528;&#21092;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12393;&#12435;&#12394;&#12484;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12424;&#12358;&#12363;&#12392;&#12356;&#12387;&#12383;&#21839;&#38988;&#12395;&#24745;&#12414;&#12373;&#12428;&#12383;&#12367;&#12394;&#12356;&#12392;&#12356;&#12358;&#22580;&#21512;&#12399;&#12289;
  &#20986;&#26469;&#21512;&#12356;&#12398; <em class="firstterm">&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;</em> &#12469;&#12452;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12373;&#12428;&#12383;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36939;&#21942;&#12395;&#24517;&#35201;&#12394;&#12484;&#12540;&#12523;&#12418;&#12402;&#12392;&#12392;&#12362;&#12426;&#12381;&#12429;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  <span>&#26412;&#31456;&#12398;&#24460;&#21322;</span>&#12398;
  <a class="xref" href="web-site.html#canned-hosting" title="&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;">&#12300;&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12301;</a> &#12391;&#12289;
  &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#21033;&#28857;&#12392;&#27424;&#28857;&#12434;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp94480" href="#idp94480" class="para">15</a>] </sup>
      1975 &#24180;&#12395;&#20986;&#29256;&#12373;&#12428;&#12383;&#24444;&#12398;&#33879;&#26360; <em class="citetitle">The Mythical Man Month</em>
      (&#37030;&#38988;:&#12300;&#20154;&#26376;&#12398;&#31070;&#35441;&#12301;) &#12395;&#30331;&#22580;&#12375;&#12383;&#27861;&#21063;&#12290;
      <a class="ulink" href="http://en.wikipedia.org/wiki/The_Mythical_Man-Month" target="_top">http://en.wikipedia.org/wiki/The_Mythical_Man-Month</a> &#12362;&#12424;&#12403;
      <a class="ulink" href="http://en.wikipedia.org/wiki/Brooks_Law" target="_top">http://en.wikipedia.org/wiki/Brooks_Law</a>
      (<a class="ulink" href="http://ja.wikipedia.org/wiki/%E3%83%96%E3%83%AB%E3%83%83%E3%82%AF%E3%82%B9%E3%81%AE%E6%B3%95%E5%89%87" target="_top">
      &#26085;&#26412;&#35486;</a>) &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="announcing.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="mailing-lists.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24195;&#22577; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</td></tr></table></div></body></html>
