<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#29694;&#29366;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="introduction.html" title="&#31532;1&#31456; &#23566;&#20837;"><link rel="prev" href="introduction.html" title="&#31532;1&#31456; &#23566;&#20837;"><link rel="next" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29694;&#29366;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="introduction.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;1&#31456; &#23566;&#20837;</th><td width="20%" align="right"> <a accesskey="n" href="getting-started.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#29694;&#29366;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="today"></a>&#29694;&#29366;</h2></div></div></div><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12377;&#12427;&#12395;&#12354;&#12383;&#12387;&#12390;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#37325;&#12356;&#21746;&#23398;&#30340;&#12394;&#20869;&#23481;&#12434;&#26085;&#12293;&#12398;&#20316;&#26989;&#12391;&#24847;&#35672;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12418;&#12300;&#12415;&#12435;&#12394;&#12371;&#12398;&#24605;&#24819;&#12395;&#21516;&#24847;&#12377;&#12409;&#12365;&#12384;&#12301;&#12394;&#12435;&#12390;&#12356;&#12358;&#12424;&#12358;&#12395;&#20027;&#24373;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;
  (&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#35328;&#12358;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12399;&#12289;
  &#33258;&#20998;&#12364;&#12393;&#12435;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12358;&#12414;&#12367;&#12420;&#12387;&#12390;&#12356;&#12369;&#12394;&#12356;&#12371;&#12392;&#12395;&#12377;&#12368;&#27671;&#12389;&#12367;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12375;&#12363;&#12375;&#12300;&#12501;&#12522;&#12540;&#12301;&#12392;&#12300;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12301;&#12398;&#36949;&#12356;&#12392;&#12356;&#12358;&#21839;&#38988;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#24847;&#35672;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12402;&#12392;&#12388;&#12395;&#12399;&#12289;&#21442;&#21152;&#32773;&#12395;&#21453;&#30446;&#12377;&#12427;&#12424;&#12358;&#12394;&#20869;&#23481;&#12398;&#30330;&#35328;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#38283;&#30330;&#32773;&#12398;&#21205;&#27231;&#12434;&#29702;&#35299;&#12377;&#12427;&#12392;&#12356;&#12358;&#12398;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12358;&#12414;&#12367;&#21462;&#12426;&#12414;&#12392;&#12417;&#12427;&#12383;&#12417;&#12398;&#26368;&#33391;&#12398;&#26041;&#27861; (&#12354;&#12427;&#24847;&#21619;&#12289;&#21807;&#19968;&#12398;&#26041;&#27861;) &#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#36984;&#25246;&#12398;&#25991;&#21270;&#12391;&#12377;&#12290;
  &#25104;&#21151;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;&#12414;&#12378;&#31532;&#19968;&#12395;&#12415;&#12435;&#12394;&#12364;&#12394;&#12380;&#12381;&#12428;&#12434;&#36984;&#25246;&#12375;&#12383;&#12398;&#12363;&#12434;&#29702;&#35299;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#39640;&#39131;&#36554;&#12394;&#24907;&#24230;&#12391;&#12399;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#23621;&#24515;&#22320;&#12364;&#24746;&#12367;&#12394;&#12427;&#12392;&#12289;&#12377;&#12368;&#12395;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#31227;&#21205;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#38598;&#22243;&#12398;&#20013;&#12391;&#12418;&#12381;&#12398;&#32080;&#12403;&#12388;&#12365;&#12398;&#36605;&#12373;&#12364;&#32676;&#12434;&#25244;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12411;&#12392;&#12435;&#12393;&#12398;&#21442;&#21152;&#32773;&#12399;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#38996;&#12434;&#12388;&#12365;&#21512;&#12431;&#12379;&#12383;&#12371;&#12392;&#12364;&#12394;&#12367;&#12289;
  &#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#31354;&#12365;&#26178;&#38291;&#12434;&#12388;&#12363;&#12387;&#12390;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21332;&#21147;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#20154;&#12392;&#20154;&#12434;&#32080;&#12403;&#12388;&#12369;&#12427;&#12418;&#12398;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32154;&#12369;&#12373;&#12379;&#12427;&#35201;&#22240;&#12392;&#12394;&#12427;&#12418;&#12398;&#12399;&#12289;
  &#38651;&#32218;&#12434;&#36890;&#12376;&#12390;&#36939;&#12400;&#12428;&#12427;&#26360;&#12365;&#35328;&#33865;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12289;&#12375;&#12387;&#12363;&#12426;&#12414;&#12392;&#12414;&#12387;&#12383;&#29105;&#24847;&#12398;&#12354;&#12427;&#12464;&#12523;&#12540;&#12503;&#12434;&#32946;&#12390;&#12427;&#12395;&#12399;&#38263;&#12356;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;
  &#36870;&#12395;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21332;&#21147;&#12375;&#12390;&#12367;&#12428;&#12381;&#12358;&#12394;&#20154;&#12383;&#12385;&#12434;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#38626;&#12428;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;&#65301;&#20998;&#12418;&#12354;&#12428;&#12400;&#21313;&#20998;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31532;&#19968;&#21360;&#35937;&#12364;&#24746;&#12369;&#12428;&#12400;&#12289;
  &#21021;&#12417;&#12390;&#35370;&#12428;&#12383;&#20154;&#12399;&#20108;&#24230;&#12392;&#12381;&#12371;&#12395;&#25147;&#12387;&#12390;&#12367;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#21442;&#21152;&#32773;&#21516;&#22763;&#12398;&#32080;&#12403;&#12388;&#12365;&#12398;&#12399;&#12363;&#12394;&#12373;&#12289;&#12354;&#12427;&#12356;&#12399;&#28508;&#22312;&#30340;&#12394;&#12399;&#12363;&#12394;&#12373;&#12364;&#12289;
  &#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#31435;&#12385;&#21521;&#12363;&#12358;&#38555;&#12398;&#21807;&#19968;&#12395;&#12375;&#12390;&#26368;&#22823;&#12398;&#38627;&#38306;&#12392;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12425;&#12434;&#32013;&#24471;&#12373;&#12379;&#12289;&#12415;&#12435;&#12394;&#12391;&#20309;&#12363;&#12434;&#20316;&#12426;&#19978;&#12370;&#12424;&#12358;&#12392;&#12373;&#12379;&#12427;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#65311;
  &#12371;&#12398;&#36074;&#21839;&#12408;&#12398;&#31572;&#12360;&#12399;&#35079;&#38609;&#12395;&#12394;&#12426;&#12377;&#12366;&#12427;&#12398;&#12391;&#26412;&#26360;&#12391;&#12399;&#25201;&#12356;&#12365;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12364;&#12289;&#19968;&#35328;&#12391;&#35328;&#12358;&#12394;&#12425;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>
        &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12398;&#12388;&#12394;&#12364;&#12426;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21450;&#12412;&#12377;&#24433;&#38911;&#12399;&#12289;
        &#12354;&#12394;&#12383;&#12364;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12393;&#12428;&#12384;&#12369;&#12398;&#12371;&#12392;&#12434;&#12375;&#12383;&#12363;&#12395;&#27491;&#27604;&#20363;&#12377;&#12427;&#12371;&#12392;&#12434;&#23455;&#24863;&#12373;&#12379;&#12424;&#12358;&#12290;
      </em></span></p></blockquote></div><p>
  &#38283;&#30330;&#32773;&#12420;&#38283;&#30330;&#32773;&#20104;&#20633;&#36557;&#12364;&#12289;
  &#25216;&#34899;&#30340;&#12394;&#29702;&#30001;&#20197;&#22806;&#12391;&#36605;&#35222;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12363;&#24046;&#21029;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12363;&#24863;&#12376;&#12390;&#12356;&#12427;&#12424;&#12358;&#12391;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#29305;&#12395;&#12289;&#20225;&#26989;&#12398;&#25903;&#25588;&#12434;&#21463;&#12369;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12420;&#37329;&#12434;&#12418;&#12425;&#12387;&#12390;&#38283;&#30330;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;
  &#12371;&#12428;&#12395;&#27880;&#24847;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#35443;&#32048;&#12399; <a class="xref" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;">5&#31456;<i>&#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</i></a> &#12391;&#25913;&#12417;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12371;&#12428;&#12399;&#12289;&#20225;&#26989;&#12398;&#25903;&#25588;&#12434;&#21463;&#12369;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#20309;&#12418;&#24515;&#37197;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12459;&#12493;&#12398;&#21839;&#38988;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#22833;&#25943;&#12377;&#12427;&#35201;&#22240;&#12398;&#12358;&#12385;&#12398;&#12411;&#12435;&#12398;&#12402;&#12392;&#12388;&#12391;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12393;&#12435;&#12394;&#38283;&#30330;&#35328;&#35486;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12393;&#12435;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;
  &#38283;&#30330;&#25163;&#38918;&#12399;&#12393;&#12358;&#12377;&#12427;&#12363;&#12289;&#12393;&#12435;&#12394;&#12484;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;
  &#12354;&#12427;&#12356;&#12399;&#26032;&#12375;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#23459;&#20253;&#12377;&#12427;&#12363;&#12394;&#12393;&#12289;
  &#12373;&#12414;&#12374;&#12414;&#12394;&#35201;&#22240;&#12364;&#12411;&#12363;&#12395;&#12418;&#32771;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
  &#12391;&#12399;&#12289;&#23455;&#38555;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#38283;&#22987;&#12377;&#12427;&#12395;&#12399;&#12393;&#12358;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#12290;
  &#12381;&#12428;&#12434; <a class="link" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">&#27425;&#12398;&#31456;</a> &#12391;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="introduction.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="introduction.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="getting-started.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;1&#31456; &#23566;&#20837; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</td></tr></table></div></body></html>
