<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24341;&#12365;&#32153;&#12366;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;"><link rel="prev" href="share-management.html" title="&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391;"><link rel="next" href="committers.html" title="&#12467;&#12511;&#12483;&#12479;&#12540;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24341;&#12365;&#32153;&#12366;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="share-management.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</th><td width="20%" align="right"> <a accesskey="n" href="committers.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#24341;&#12365;&#32153;&#12366;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transitions"></a>&#24341;&#12365;&#32153;&#12366;</h2></div></div></div><p>
  &#26178;&#12395;&#12399;&#12289;&#20309;&#12425;&#12363;&#12398;&#24441;&#21106; (&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12420;&#32763;&#35379;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12394;&#12393;)
  &#12434;&#21463;&#12369;&#25345;&#12387;&#12390;&#12356;&#12427;&#20154;&#12364;&#12381;&#12398;&#20316;&#26989;&#12434;&#20840;&#12358;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#29702;&#30001;&#12392;&#12375;&#12390;&#12399;&#12300;&#20316;&#26989;&#37327;&#12364;&#33258;&#20998;&#12398;&#35211;&#36796;&#12415;&#12424;&#12426;&#12378;&#12387;&#12392;&#22810;&#12363;&#12387;&#12383;&#12301;
  &#12300;&#23376;&#20379;&#12364;&#29983;&#12414;&#12428;&#12383;&#12301;&#12300;&#36578;&#32887;&#12375;&#12383;&#12301;&#12394;&#12393;&#12289;&#12356;&#12429;&#12356;&#12429;&#12394;&#12418;&#12398;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
 </p><p>
  &#25285;&#24403;&#32773;&#12364;&#12371;&#12398;&#12424;&#12358;&#12394;&#29366;&#24907;&#12395;&#38501;&#12387;&#12383;&#22580;&#21512;&#12289;
  &#12381;&#12428;&#12434;&#12377;&#12368;&#12395;&#33258;&#35226;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12399;&#24464;&#12293;&#12395;&#36215;&#12371;&#12427;&#12371;&#12392;&#12391;&#12354;&#12426;&#12289;&#12300;&#12418;&#12399;&#12420;&#33258;&#20998;&#12398;&#20219;&#21209;&#12434;&#26524;&#12383;&#12379;&#12394;&#12356;&#12301;
  &#12392;&#12399;&#12387;&#12365;&#12426;&#12431;&#12363;&#12427;&#30636;&#38291;&#12364;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;
  &#12300;&#12381;&#12358;&#12356;&#12360;&#12400;&#26368;&#36817;&#12354;&#12398;&#20154;&#12434;&#12354;&#12414;&#12426;&#35211;&#12363;&#12369;&#12394;&#12356;&#12397;&#12301;
  &#12392;&#24863;&#12376;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12354;&#12427;&#26085;&#31361;&#28982;&#24444;&#12364;&#12418;&#12398;&#12377;&#12372;&#12356;&#21218;&#12356;&#12391;&#27963;&#21205;&#12434;&#20877;&#38283;&#12375;&#12414;&#12377;&#12290;
  &#12375;&#12400;&#12425;&#12367;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12395;&#36000;&#12356;&#30446;&#12434;&#24863;&#12376;&#12390;
  &#12300;&#24505;&#22812;&#12375;&#12390;&#12391;&#12418;&#12394;&#12435;&#12392;&#12363;&#36861;&#12356;&#12388;&#12371;&#12358;&#12301;&#12392;&#24863;&#12376;&#12390;&#12356;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#24460;&#12289;&#24444;&#12399;&#12414;&#12383; (&#12418;&#12387;&#12392;&#38263;&#12356;) &#27784;&#40665;&#26399;&#38291;&#12395;&#20837;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12400;&#12425;&#12367;&#12375;&#12390;&#12414;&#12383;&#31361;&#28982;&#24489;&#27963;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12375;&#12289;&#12375;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#27491;&#24335;&#12395;&#12300;&#12371;&#12398;&#24441;&#21106;&#12363;&#12425;&#36864;&#12365;&#12414;&#12377;&#12301;&#12392;&#12356;&#12358;&#34920;&#26126;&#12364;&#12354;&#12427;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12425;&#12399;&#33258;&#20998;&#12398;&#31354;&#12365;&#26178;&#38291;&#12434;&#20351;&#12387;&#12390;&#20316;&#26989;&#12434;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#24341;&#36864;&#12434;&#34920;&#26126;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#33258;&#20998;&#12398;&#31354;&#12365;&#26178;&#38291;&#12364;&#20170;&#24460;&#12378;&#12387;&#12392;&#23569;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#33258;&#35226;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20154;&#12399;&#12381;&#12428;&#12399;&#12394;&#12363;&#12394;&#12363;&#35469;&#12417;&#12383;&#12364;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12354;&#12394;&#12383; (&#12392;&#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;)
  &#12398;&#12377;&#12409;&#12365;&#12371;&#12392;&#12399;&#12289;&#29694;&#29366;&#12364;&#12393;&#12358;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363; (&#12354;&#12427;&#12356;&#12399;&#12394;&#12395;&#12418;&#36215;&#12371;&#12387;&#12390;&#12356;&#12394;&#12356;&#12398;&#12363;)
  &#12434;&#25226;&#25569;&#12375;&#12390;&#12289;&#24444;&#12395;&#29366;&#27841;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#30456;&#25163;&#12434;&#36012;&#12417;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#21451;&#22909;&#30340;&#12395;&#21839;&#12356;&#21512;&#12431;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#29366;&#27841;&#12434;&#30693;&#12427;&#12371;&#12392;&#12364;&#22823;&#20999;&#12391;&#12289;
  &#20154;&#12434;&#19981;&#24555;&#12395;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#30446;&#30340;&#12394;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#19968;&#33324;&#12395;&#12289;&#12371;&#12398;&#21839;&#12356;&#21512;&#12431;&#12379;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#12418;&#35211;&#12360;&#12427;&#12363;&#12383;&#12385;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#20491;&#20154;&#30340;&#12395;&#21839;&#12356;&#21512;&#12431;&#12379;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12392;&#21028;&#26029;&#12375;&#12383;&#22580;&#21512;&#12399;
  &#12381;&#12428;&#12391;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#20844;&#38283;&#12398;&#22580;&#12391;&#21839;&#12356;&#21512;&#12431;&#12379;&#12427;&#20027;&#12394;&#29702;&#30001;&#12399;&#12289;
  &#24444;&#12364;&#12300;&#12418;&#12358;&#20316;&#26989;&#12434;&#32154;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#36820;&#20107;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12395;
  &#12381;&#12398; <span class="emphasis"><em>&#27425;&#12398;</em></span> &#25237;&#31295;&#12289;
  &#12388;&#12414;&#12426;&#26032;&#12375;&#12356;&#25285;&#24403;&#32773;&#12398;&#21215;&#38598;&#12395;&#12388;&#12394;&#12370;&#12420;&#12377;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
</p><p>
  &#26178;&#12395;&#12399;&#12289;&#33258;&#20998;&#12391;&#24341;&#12365;&#21463;&#12369;&#12383;&#20316;&#26989;&#12434;&#12371;&#12394;&#12377;&#33021;&#21147;&#12364;&#12394;&#12356;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
  &#12381;&#12428;&#12434;&#33258;&#35226;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12363;&#12354;&#12427;&#12356;&#12399;&#35469;&#12417;&#12424;&#12358;&#12392;&#12375;&#12394;&#12356;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12289;&#20316;&#26989;&#12434;&#22987;&#12417;&#12383;&#12400;&#12363;&#12426;&#12398;&#12371;&#12429;&#12399;&#35504;&#12391;&#12418;&#12358;&#12414;&#12367;&#12356;&#12363;&#12394;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#35079;&#38609;&#12394;&#20316;&#26989;&#12434;&#19982;&#12360;&#12425;&#12428;&#12383;&#22580;&#21512;&#12394;&#12393;&#12399;&#29305;&#12395;&#12381;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12391;&#12365;&#12427;&#38480;&#12426;&#12398;&#25903;&#25588;&#12434;&#12375;&#12390;&#12420;&#12387;&#12390;&#12418;
  &#12394;&#12362;&#24444;&#12364;&#20316;&#26989;&#12434;&#12371;&#12394;&#12379;&#12394;&#12356;&#12392;&#12375;&#12383;&#12425;&#12289;
  &#24444;&#12395;&#12399;&#12362;&#24341;&#12365;&#21462;&#12426;&#39000;&#12387;&#12390;&#12384;&#12428;&#12363;&#20182;&#12398;&#20154;&#12395;&#20316;&#26989;&#12434;&#20219;&#12379;&#12427;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#24444;&#12364;&#12381;&#12428;&#12395;&#27671;&#12389;&#12356;&#12390;&#12356;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;&#12384;&#12428;&#12363;&#12364;&#25945;&#12360;&#12390;&#12420;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#31169;&#12364;&#24605;&#12358;&#12395;&#12289;&#12371;&#12435;&#12394;&#22580;&#21512;&#12398;&#23550;&#24540;&#26041;&#27861;&#12399;&#12402;&#12392;&#12388;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12383;&#12384;&#12289;&#12381;&#12398;&#26041;&#27861;&#12399;&#20309;&#27573;&#38542;&#12363;&#12395;&#20998;&#12363;&#12428;&#12427;&#12418;&#12398;&#12391;&#12289;
  &#21508;&#27573;&#38542;&#12364;&#12381;&#12428;&#12382;&#12428;&#37325;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12414;&#12378;&#12399;&#12289;&#33258;&#20998;&#12384;&#12369;&#12398;&#24605;&#12356;&#12371;&#12415;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#12399;&#12387;&#12365;&#12426;&#12373;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#20491;&#20154;&#30340;&#12395;&#35441;&#12375;&#12289;
  &#33258;&#20998;&#12364;&#25345;&#12387;&#12390;&#12356;&#12427;&#21361;&#27231;&#24847;&#35672;&#12364;&#12415;&#12435;&#12394;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#12398;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;
  &#30906;&#35469;&#12377;&#12427;&#12414;&#12391;&#12418;&#12394;&#12367;&#33258;&#26126;&#12394;&#29366;&#27841;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#35441;&#12377;&#12371;&#12392;&#12391;
  &#12300;&#12371;&#12428;&#12363;&#12425;&#12371;&#12358;&#12356;&#12358;&#12371;&#12392;&#12434;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#27671;&#25345;&#12385;&#12434;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#20253;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#36890;&#24120;&#12399;&#12289;&#12371;&#12398;&#30456;&#35527;&#12391;&#30456;&#25163;&#12395;&#21453;&#23550;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12420;&#12387;&#12363;&#12356;&#12394;&#20181;&#20107;&#12434;&#12354;&#12394;&#12383;&#12364;&#24341;&#12365;&#21463;&#12369;&#12390;&#12367;&#12428;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12289;
  &#12416;&#12375;&#12429;&#24863;&#35613;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;!
</p><p>
  &#27425;&#12395;&#12289;&#21839;&#38988;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#20154;&#12395; <span class="emphasis"><em>&#20491;&#20154;&#30340;&#12395;</em></span>
  &#36899;&#32097;&#12434;&#21462;&#12426;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#12420;&#12373;&#12375;&#12367; (&#12375;&#12363;&#12375;&#35201;&#28857;&#12434;&#12399;&#12368;&#12425;&#12363;&#12377;&#12371;&#12392;&#12394;&#12367;)
  &#12354;&#12394;&#12383;&#12364;&#24863;&#12376;&#12390;&#12356;&#12427;&#21839;&#38988;&#28857;&#12434;&#20253;&#12360;&#12414;&#12377;&#12290;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#12289;&#20855;&#20307;&#20363;&#12434;&#25369;&#12370;&#12390;&#20253;&#12360;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#21487;&#33021;&#12394;&#38480;&#12426;&#12398;&#25903;&#25588;&#12434;&#12375;&#12383;&#12371;&#12392;&#12289;
  &#12381;&#12428;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#21839;&#38988;&#12399;&#25913;&#21892;&#12375;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12434;&#12399;&#12387;&#12365;&#12426;&#12373;&#12379;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#12513;&#12540;&#12523;&#12434;&#26360;&#12367;&#12398;&#12395;&#12399;&#12363;&#12394;&#12426;&#12398;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12371;&#12392;&#12434;&#35226;&#24735;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#25163;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#22580;&#21512;&#12289;
  &#12418;&#12375;&#33258;&#20998;&#12364;&#26360;&#12356;&#12390;&#12356;&#12427;&#20869;&#23481;&#12395;&#12385;&#12423;&#12387;&#12392;&#12391;&#12418;&#30906;&#20449;&#12398;&#25345;&#12390;&#12394;&#12356;&#31623;&#25152;&#12364;&#12354;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#26368;&#21021;&#12363;&#12425;&#12381;&#12435;&#12394;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#26360;&#12356;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#24444;&#12364;&#24341;&#12365;&#21463;&#12369;&#12383;&#20316;&#26989;&#12434;&#12384;&#12428;&#12363;&#21029;&#12398;&#20154;&#12395;&#20219;&#12379;&#12383;&#12356;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#36002;&#29486;&#12377;&#12427;&#12395;&#12399;&#20182;&#12395;&#12418;&#12356;&#12429;&#12356;&#12429;&#12394;&#20316;&#26989;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#35500;&#26126;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#26178;&#28857;&#12391;&#12399;&#12289;&#12354;&#12394;&#12383;&#12364;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#30456;&#35527;&#12375;&#12383;&#12371;&#12392;&#12399;
  &#12414;&#12384;&#24444;&#12395;&#35328;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#35023;&#12391;&#12371;&#12381;&#12371;&#12381;&#35441;&#12364;&#36914;&#12417;&#12425;&#12428;&#12390;&#12356;&#12383;&#12394;&#12435;&#12390;&#12371;&#12392;&#12434;&#30693;&#12387;&#12383;&#12425;
  &#35504;&#12384;&#12387;&#12390;&#27671;&#12434;&#24746;&#12367;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12381;&#12398;&#24460;&#12399;&#12289;&#25104;&#12426;&#34892;&#12365;&#12395;&#24540;&#12376;&#12390;&#12356;&#12367;&#12388;&#12363;&#12398;&#26041;&#27861;&#12395;&#20998;&#12363;&#12428;&#12414;&#12377;&#12290;
  &#12383;&#12356;&#12390;&#12356;&#12399;&#12289;&#24444;&#12399;&#12354;&#12394;&#12383;&#12398;&#25552;&#26696;&#12395;&#21516;&#24847;&#12375;&#12390;&#12367;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#21542;&#23450;&#12399;&#12379;&#12378;&#12289;&#36914;&#12435;&#12391;&#24341;&#12365;&#19979;&#12364;&#12387;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#24341;&#12365;&#19979;&#12364;&#12427;&#12371;&#12392;&#12434;&#24444;&#33258;&#36523;&#12391;&#30330;&#34920;&#12375;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12362;&#39000;&#12356;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12354;&#12394;&#12383;&#12399;&#12381;&#12398;&#30330;&#34920;&#12408;&#12398;&#36820;&#20449;&#12391;&#26032;&#12383;&#12394;&#20505;&#35036;&#32773;&#12434;&#21215;&#38598;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12354;&#12427;&#12356;&#12399;&#12289;&#21839;&#38988;&#12364;&#12354;&#12387;&#12383;&#12371;&#12392;&#12399;&#35469;&#12417;&#12427;&#12418;&#12398;&#12398;&#12300;&#12418;&#12358;&#12385;&#12423;&#12387;&#12392;&#12384;&#12369;&#12481;&#12515;&#12531;&#12473;&#12364;&#12411;&#12375;&#12356;
  (&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#12424;&#12358;&#12394;&#24441;&#21106;&#12394;&#12425;&#12302;&#12354;&#12392; 1 &#22238;&#12384;&#12369;&#12303;&#12394;&#12393;)&#12301;
  &#12392;&#12362;&#39000;&#12356;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12394;&#12383;&#12399;&#12371;&#12371;&#12391;&#23529;&#21028;&#12392;&#12375;&#12390;&#12398;&#20685;&#12365;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12431;&#12369;&#12391;&#12377;&#12364;&#12289;
  &#12393;&#12358;&#21028;&#26029;&#12377;&#12427;&#12395;&#12375;&#12390;&#12418;&#12381;&#12371;&#12395;&#31169;&#24773;&#12434;&#25375;&#12414;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12371;&#12391;&#29494;&#20104;&#12434;&#19982;&#12360;&#12390;&#12375;&#12414;&#12387;&#12390;&#12418;&#12289;
  &#21336;&#12395;&#33510;&#30171;&#12434;&#12402;&#12365;&#12398;&#12400;&#12377;&#12384;&#12369;&#12398;&#12371;&#12392;&#12395;&#12375;&#12363;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#12362;&#39000;&#12356;&#12434;&#25298;&#21542;&#12377;&#12427;&#29702;&#30001;&#12392;&#12375;&#12390;&#12399;&#12387;&#12365;&#12426;&#35328;&#12360;&#12427;&#12398;&#12399;&#12289;
  &#12371;&#12428;&#12414;&#12391;&#12395;&#20309;&#24230;&#12418;&#12481;&#12515;&#12531;&#12473;&#12364;&#12354;&#12387;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
  &#12381;&#12375;&#12390;&#12381;&#12398;&#12481;&#12515;&#12531;&#12473;&#12434;&#29983;&#12363;&#12373;&#12394;&#12363;&#12387;&#12383;&#12363;&#12425;&#12371;&#12381;&#20170;&#12398;&#29366;&#24907;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20197;&#19979;&#12395;&#31034;&#12377;&#12398;&#12399;&#31169;&#12364;&#36865;&#12387;&#12383;&#12513;&#12540;&#12523;&#12398;&#20363;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#24441;&#21106;&#12434;&#24341;&#12365;&#21463;&#12369;&#12394;&#12364;&#12425;
  &#12381;&#12398;&#24441;&#21106;&#12434;&#26524;&#12383;&#12379;&#12394;&#12363;&#12387;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;&#36865;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
</p><div class="blockquote"><blockquote class="blockquote"><pre class="screen">
&gt; &#12418;&#12375;&#31169;&#12376;&#12419;&#12480;&#12513;&#12384;&#12392;&#12356;&#12358;&#12398;&#12394;&#12425;&#12289;&#21916;&#12435;&#12391;&#21029;&#12398;&#20154;&#12395;&#12371;&#12398;&#24441;&#21106;&#12434;
&gt; &#35698;&#12426;&#12414;&#12377;&#12290;&#12383;&#12384;&#12289;&#12402;&#12392;&#12388;&#12384;&#12369;&#12362;&#39000;&#12356;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#27770;&#12375;&#12390;&#28961;&#33590;
&gt; &#12394;&#12362;&#39000;&#12356;&#12391;&#12399;&#12394;&#12356;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;&#12354;&#12392;&#19968;&#22238;&#12384;&#12369;&#12481;&#12515;&#12531;&#12473;&#12364;&#12411;&#12375;
&gt; &#12356;&#12435;&#12391;&#12377;&#12290;&#27425;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#31169;&#12398;&#33021;&#21147;&#12434;&#35388;&#26126;&#12373;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;

&#35328;&#12356;&#12383;&#12356;&#12371;&#12392;&#12399;&#12424;&#12367;&#12431;&#12363;&#12426;&#12414;&#12377; (&#12391;&#12365;&#12428;&#12400;&#12381;&#12358;&#12375;&#12390;&#12354;&#12370;&#12383;&#12356;) &#12364;&#12289;
&#20170;&#22238;&#12395;&#12388;&#12356;&#12390;&#12399;&#12300;&#12354;&#12392;&#19968;&#22238;&#12384;&#12369;&#12301;&#12392;&#12356;&#12358;&#12398;&#12399;&#12420;&#12427;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12392;
&#24605;&#12356;&#12414;&#12377;&#12290;

&#20170;&#22238;&#12364;&#21021;&#12417;&#12390;&#12398;&#12522;&#12522;&#12540;&#12473;&#12384;&#12387;&#12383;&#12392;&#12363;&#12394;&#12425;&#12392;&#12418;&#12363;&#12367;&#12289;&#12418;&#12358;&#26082;&#12395;&#65302;&#22238;
&#30446;&#12363;&#65303;&#22238;&#30446;&#12367;&#12425;&#12356;&#12395;&#12394;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;&#12381;&#12375;&#12390;&#12381;&#12398;&#38291;&#12378;&#12387;&#12392;&#12289;&#12354;&#12394;&#12383;
&#12399;&#26399;&#24453;&#36890;&#12426;&#12398;&#32080;&#26524;&#12434;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383; (&#12387;&#12390;&#12356;&#12358;&#12371;&#12392;
&#12399;&#20197;&#21069;&#12362;&#35441;&#12375;&#12414;&#12375;&#12383;&#12424;&#12397;)&#12290;&#12388;&#12414;&#12426;&#12289;&#12399;&#12387;&#12365;&#12426;&#35328;&#12360;&#12400;&#12300;&#12354;&#12392;&#19968;&#22238;&#12301;
&#12398;&#27573;&#38542;&#12399;&#20107;&#23455;&#19978;&#32066;&#12431;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;&#32080;&#23616;&#12398;&#12392;&#12371;&#12429;&#12289;&#12371;&#12398;&#21069;&#12398;
[&#36942;&#21435;&#12398;&#12522;&#12522;&#12540;&#12473;] &#12364;&#12381;&#12398;&#12300;&#12354;&#12392;&#19968;&#22238;&#12301;&#12384;&#12387;&#12383;&#12435;&#12391;&#12377;&#12290;
</pre></blockquote></div><p>
  &#26368;&#24746;&#12398;&#22580;&#21512;&#12399;&#12289;&#30456;&#25163;&#12364;&#25552;&#26696;&#12434;&#25298;&#21542;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#12385;&#12423;&#12387;&#12392;&#35441;&#12364;&#12420;&#12387;&#12363;&#12356;&#12395;&#12394;&#12427;&#12371;&#12392;&#12434;&#35226;&#24735;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12371;&#12395;&#12365;&#12390;&#21021;&#12417;&#12390;&#12289;&#20107;&#21069;&#12395;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#12418;&#35441;&#12375;&#21512;&#12387;&#12390;&#12356;&#12383;&#12371;&#12392;&#12434;&#26126;&#12425;&#12363;&#12395;&#12375;&#12414;&#12377;
  (&#12383;&#12384;&#12289;&#30456;&#25163;&#12398;&#35377;&#21487;&#12434;&#24471;&#12427;&#12414;&#12391;&#12399;&#12300;&#35504;&#12392;&#12301;&#35441;&#12375;&#12383;&#12398;&#12363;&#12399;&#35328;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12367;&#12414;&#12391;&#12418;&#31169;&#30340;&#12394;&#30456;&#35527;&#12384;&#12387;&#12383;&#12398;&#12391;&#12377;&#12363;&#12425;)&#12290;
  &#12381;&#12375;&#12390;&#12371;&#12398;&#12414;&#12414;&#12391;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12392;&#12387;&#12390;&#12354;&#12414;&#12426;&#12424;&#12367;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12418;&#35500;&#26126;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#12289;&#12375;&#12363;&#12375;&#27770;&#12375;&#12390;&#23041;&#22311;&#30340;&#12395;&#12394;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12375;&#12390;&#12290;
  &#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12411;&#12375;&#12356;&#12398;&#12399;&#12289;&#22823;&#21322;&#12398;&#24441;&#21106;&#12395;&#12388;&#12356;&#12390;&#12399;
  &#26032;&#12375;&#12356;&#25285;&#24403;&#32773;&#12364;&#20316;&#26989;&#12434;&#22987;&#12417;&#12383;&#26178;&#28857;&#12391;&#31227;&#34892;&#12364;&#23436;&#20102;&#12377;&#12427;
  (&#21069;&#20219;&#32773;&#12364;&#20316;&#26989;&#12434;&#12420;&#12417;&#12383;&#26178;&#28857;&#12391;&#12399; <span class="emphasis"><em>&#12394;&#12356;</em></span>)
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#36039;&#36074;&#12364;&#21839;&#38988;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  &#12354;&#12394;&#12383; (&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#20027;&#35201;&#12513;&#12531;&#12496;&#12540;) &#12399;
  &#12356;&#12388;&#12391;&#12418;&#26032;&#12383;&#12394;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#20181;&#31435;&#12390;&#19978;&#12370;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#21069;&#20219;&#32773;&#12364;&#26032;&#12383;&#12394;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#20316;&#26989;&#12434;&#37034;&#39764;&#12375;&#12383;&#12426;&#12375;&#12394;&#12356;&#38480;&#12426;&#12289;
  &#21069;&#20219;&#32773;&#12364;&#20316;&#26989;&#12434;&#12420;&#12417;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#22823;&#12365;&#12394;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12405;&#12392;&#12371;&#12435;&#12394;&#32771;&#12360;&#12364;&#38957;&#12395;&#28014;&#12363;&#12406;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12300;&#12431;&#12374;&#12431;&#12374;&#12362;&#24341;&#12365;&#21462;&#12426;&#39000;&#12431;&#12394;&#12367;&#12383;&#12387;&#12390;&#12289;&#12384;&#12428;&#12363;&#35036;&#20304;&#24441;&#12434;&#12388;&#12369;&#12390;&#12420;&#12427;&#12384;&#12369;&#12391;&#12356;&#12356;&#12435;&#12376;&#12419;&#12394;&#12356;&#12398;?&#12301;
  &#12300;&#12496;&#12464;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#12375;&#12383;&#12387;&#12390;&#12497;&#12483;&#12481;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12395;&#12375;&#12383;&#12387;&#12390;&#12289;
  &#21029;&#12395; 2 &#20154;&#12356;&#12390;&#12418;&#20309;&#12418;&#21839;&#38988;&#12399;&#12394;&#12356;&#12435;&#12376;&#12419;&#12394;&#12356;&#12398;?&#12301;
</p><p>
  &#19968;&#35211;&#12424;&#12373;&#12370;&#12395;&#32862;&#12371;&#12360;&#12414;&#12377;&#12364;&#12289;&#19968;&#33324;&#30340;&#12395;&#12371;&#12428;&#12399;&#12424;&#12356;&#32771;&#12360;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12398;&#24441;&#21106;&#12364;&#12394;&#12380;&#12358;&#12414;&#12367;&#27231;&#33021;&#12375;&#12390;&#12356;&#12427;
  (&#24441;&#31435;&#12387;&#12390;&#12356;&#12427;) &#12398;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;&#12381;&#12428;&#12399;&#20013;&#22830;&#38598;&#27177;&#22411;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#20998;&#25955;&#31649;&#29702;&#12375;&#12390;&#12418;&#12358;&#12414;&#12367;&#12356;&#12367;&#12424;&#12358;&#12394;&#20316;&#26989;&#12394;&#12425;&#12289;
  &#12365;&#12387;&#12392;&#12399;&#12376;&#12417;&#12363;&#12425;&#12381;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12402;&#12392;&#12388;&#12398;&#31649;&#29702;&#20316;&#26989;&#12434; 2 &#20154;&#12395;&#20219;&#12379;&#12427;&#12392;&#12289;
  &#12381;&#12398; 2 &#20154;&#12398;&#38291;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#12356;&#12358;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12362;&#20114;&#12356;&#36012;&#20219;&#12434;&#12394;&#12377;&#12426;&#12388;&#12369;&#12354;&#12358;
  (&#12300;&#12365;&#12415;&#12364;&#25937;&#24613;&#31665;&#12434;&#25345;&#12387;&#12390;&#12367;&#12427;&#12435;&#12376;&#12419;&#12394;&#12363;&#12387;&#12383;&#12398;?&#12301;
  &#12300;&#12414;&#12373;&#12363;&#12290;&#12412;&#12367;&#12399;&#21531;&#12364;&#25345;&#12387;&#12390;&#12367;&#12427;&#12418;&#12398;&#12384;&#12392;&#12400;&#12363;&#12426;&#24605;&#12387;&#12390;&#12383;&#12424;!&#12301;)
  &#12392;&#12356;&#12358;&#21361;&#38522;&#24615;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#20363;&#22806;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#20154;&#38291;&#12364;&#12358;&#12414;&#12367;&#12363;&#12415;&#21512;&#12387;&#12390;&#20316;&#26989;&#12364;&#36914;&#12416;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12375;&#12289;
  &#35079;&#25968;&#12398;&#20154;&#38291;&#12391;&#34892;&#12358;&#12398;&#12395;&#36969;&#12375;&#12383;&#20316;&#26989;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12392;&#12418;&#12392;&#12381;&#12398;&#20316;&#26989;&#12395;&#36969;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#24605;&#12431;&#12428;&#12427;&#20154;&#12395;&#12392;&#12387;&#12390;&#12399;
  &#12354;&#12414;&#12426;&#24847;&#21619;&#12398;&#12394;&#12356;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24444;&#12364;&#26368;&#21021;&#12398;&#26178;&#28857;&#12391;&#21839;&#38988;&#12434;&#12365;&#12385;&#12435;&#12392;&#25226;&#25569;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
  &#12418;&#12387;&#12392;&#26089;&#12356;&#27573;&#38542;&#12391;&#21161;&#12369;&#12434;&#27714;&#12417;&#12390;&#12365;&#12383;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;&#20316;&#26989;&#12364;&#12358;&#12414;&#12367;&#36914;&#12414;&#12394;&#12356;&#12391;
  &#21336;&#12394;&#12427;&#26178;&#38291;&#12398;&#28010;&#36027;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12398;&#12434;&#35211;&#36942;&#12372;&#12377;&#12398;&#12399;&#12414;&#12378;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#12384;&#12428;&#12363;&#12395;&#25163;&#12434;&#24341;&#12356;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12362;&#39000;&#12356;&#12377;&#12427;&#12392;&#12365;&#12395;&#26368;&#12418;&#22823;&#20999;&#12394;&#12398;&#12399;&#12289;
  &#12503;&#12521;&#12452;&#12496;&#12471;&#12540;&#12391;&#12377;&#12290;&#12415;&#12435;&#12394;&#12395;&#27880;&#30446;&#12373;&#12428;&#12427;&#20013;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#33258;&#20998;&#19968;&#20154;&#12391;&#12393;&#12358;&#12377;&#12427;&#12363;&#12434;&#32771;&#12360;&#12427;&#20313;&#22320;&#12434;&#27531;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#31169;&#12399;&#12289;&#12363;&#12388;&#12390;&#38291;&#36949;&#12356;&#12434;&#29359;&#12375;&#12414;&#12375;&#12383;&#12290;&#26126;&#30333;&#12394;&#38291;&#36949;&#12356;&#12434;&#12391;&#12377;&#12290;
  &#12354;&#12427;&#20154;&#12395; Subversion &#12398;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#36864;&#12356;&#12390;&#12418;&#12425;&#12356;&#12289;
  &#12363;&#12431;&#12426;&#12395;&#21029;&#12398; 2 &#20154;&#12395;&#20219;&#12379;&#12424;&#12358;&#12392;&#32771;&#12360;&#12383;&#12392;&#12365;&#12395;&#12289;
  &#24403;&#20107;&#32773; 3 &#20154;&#12395;&#23550;&#12375;&#12390;&#21516;&#26178;&#12395;&#12513;&#12540;&#12523;&#12434;&#36865;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#26032;&#12383;&#12395;&#20219;&#12379;&#12427;&#20104;&#23450;&#12398; 2 &#20154;&#12395;&#12399;&#20107;&#21069;&#12395;&#20491;&#21029;&#12395;&#35441;&#12434;&#25345;&#12385;&#12363;&#12369;&#12390;&#12362;&#12426;&#12289;
  &#12393;&#12385;&#12425;&#12418;&#12381;&#12398;&#27671;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
  &#19990;&#38291;&#30693;&#12425;&#12378;&#12391;&#28961;&#31070;&#32076;&#12394;&#31169;&#12399;
  &#12300;&#19968;&#36890;&#12398;&#12513;&#12540;&#12523;&#12434;&#20840;&#21729;&#12395;&#36865;&#12387;&#12390;&#12375;&#12414;&#12360;&#12400;&#35441;&#12399;&#26089;&#12356;&#12376;&#12419;&#12394;&#12356;&#12363;&#12290;
  &#12371;&#12435;&#12394;&#38754;&#20498;&#12394;&#12371;&#12392;&#12399;&#12373;&#12387;&#12373;&#12392;&#32066;&#12431;&#12425;&#12379;&#12390;&#12375;&#12414;&#12362;&#12358;&#12301;
  &#12392;&#32771;&#12360;&#12383;&#12398;&#12391;&#12377;&#12290;&#24403;&#26178;&#12398;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12418;&#12377;&#12391;&#12395;&#20107;&#24907;&#12434;&#33258;&#35226;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#12365;&#12387;&#12392;&#12377;&#12435;&#12394;&#12426;&#36864;&#12356;&#12390;&#12367;&#12428;&#12427;&#12384;&#12429;&#12358;&#12392;&#24819;&#23450;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
</p><p>
  &#31169;&#12399;&#38291;&#36949;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#24403;&#26178;&#12398;&#12522;&#12522;&#12540;&#12473;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12399;&#28608;&#39640;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#24403;&#28982;&#12391;&#12377;&#12290;&#21336;&#12395;&#20181;&#20107;&#12434;&#21462;&#12426;&#19978;&#12370;&#12425;&#12428;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  &#26032;&#12375;&#12356;&#25285;&#24403;&#32773;&#12364; <span class="emphasis"><em>&#30446;&#12398;&#21069;&#12395;</em></span>
  &#12356;&#12427;&#12392;&#12371;&#12429;&#12391;&#12381;&#12428;&#12434;&#35328;&#12431;&#12428;&#12383;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#24444;&#12364;&#24594;&#12387;&#12390;&#12356;&#12427;&#29702;&#30001;&#12434;&#30693;&#12387;&#12390;&#12289;&#31169;&#12399;&#35613;&#12426;&#12414;&#12375;&#12383;&#12290;
  &#24444;&#12399;&#32080;&#23616;&#31169;&#12383;&#12385;&#12398;&#25552;&#26696;&#12395;&#21516;&#24847;&#12375;&#12390;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#36864;&#12356;&#12390;&#12367;&#12428;&#12414;&#12375;&#12383;&#12290;
  &#12381;&#12398;&#24460;&#12418;&#21029;&#12398;&#24418;&#12391;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#32154;&#12369;&#12390;&#12367;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#24444;&#12399;&#20663;&#12388;&#12356;&#12383;&#12391;&#12375;&#12423;&#12358;&#12290;&#35328;&#12358;&#12414;&#12391;&#12418;&#12394;&#12367;&#12289;
  &#26032;&#12383;&#12395;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#24341;&#12365;&#21463;&#12369;&#12427;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#20596;&#12395;&#12392;&#12387;&#12390;&#12418;&#12420;&#12426;&#12395;&#12367;&#12363;&#12387;&#12383;&#12399;&#12378;&#12391;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="share-management.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="committers.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#25216;&#34899;&#30340;&#12394;&#20316;&#26989;&#12384;&#12369;&#12391;&#12394;&#12367;&#31649;&#29702;&#20316;&#26989;&#12418;&#12415;&#12435;&#12394;&#12391; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12467;&#12511;&#12483;&#12479;&#12540;</td></tr></table></div></body></html>
