<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="prev" href="money.html" title="&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;"><link rel="next" href="long-term-developers.html" title="&#38283;&#30330;&#32773;&#12434;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#38599;&#29992;&#12377;&#12427;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="money.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="long-term-developers.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="types-of-involvement"></a>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#12431;&#12426;&#26041;</h2></div></div></div><p>
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12362;&#37329;&#12434;&#20986;&#12375;&#12390;&#12418;&#12425;&#12358;&#29702;&#30001;&#12399;&#27096;&#12293;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#20197;&#19979;&#12395;&#31034;&#12377;&#29702;&#30001;&#12399;&#12289;&#30456;&#20114;&#12395;&#25490;&#20182;&#30340;&#12394;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#25903;&#25588;&#12434;&#21463;&#12369;&#12427;&#29702;&#30001;&#12399;&#20197;&#19979;&#12398;&#35079;&#25968;&#12289;&#12414;&#12383;&#12399;&#20840;&#12390;&#12364;&#24403;&#12390;&#12399;&#12414;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><div class="variablelist"><dl><dt><span class="term">&#12467;&#12473;&#12488;&#36000;&#25285;&#12434;&#20849;&#26377;&#12377;&#12427;</span></dt><dd><p>&#38306;&#36899;&#12364;&#12354;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#32068;&#32340;&#12399;&#12289;
     &#20284;&#12383;&#12424;&#12358;&#12394;&#12467;&#12540;&#12489;&#12434;&#31038;&#20869;&#12391;&#26360;&#12356;&#12383;&#12426;&#12289;
     &#21830;&#29992;&#12505;&#12531;&#12480;&#12363;&#12425;&#20284;&#12383;&#12424;&#12358;&#12394;&#21830;&#21697;&#12434;&#36092;&#20837;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
     &#21516;&#12376;&#30446;&#27161;&#12395;&#21521;&#12363;&#12387;&#12390;&#37325;&#35079;&#12375;&#12383;&#21162;&#21147;&#12434;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
     &#24444;&#12425;&#12399;&#12381;&#12428;&#12434;&#30693;&#12427;&#12392;&#12289;
     &#33258;&#20998;&#12383;&#12385;&#12398;&#38656;&#35201;&#12434;&#35519;&#25972;&#12377;&#12427;&#12383;&#12417;&#12289;
     &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#12427;(&#12414;&#12383;&#12399;&#26082;&#23384;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;)&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
     &#12381;&#12398;&#21033;&#28857;&#12399;&#26126;&#12425;&#12363;&#12391;&#12377;&#12290;
     &#38283;&#30330;&#12467;&#12473;&#12488;&#12434;&#20998;&#25955;&#12375;&#12388;&#12388;&#12289;&#21033;&#30410;&#12399;&#21442;&#21152;&#12375;&#12383;&#12377;&#12409;&#12390;&#12398;&#32068;&#32340;&#12364;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
     &#12371;&#12398;&#12471;&#12490;&#12522;&#12458;&#12399;&#12289;&#38750;&#21942;&#21033;&#12394;&#32068;&#32340;&#12398;&#22580;&#21512;&#12418;&#12387;&#12392;&#12418;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;
     &#31478;&#21512;&#38306;&#20418;&#12395;&#12354;&#12427;&#21942;&#21033;&#32068;&#32340;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#25126;&#30053;&#30340;&#12395;&#12399;&#26377;&#24847;&#32681;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;</p><p>&#20363;: <a class="ulink" href="http://www.openadapter.org/" target="_top">http://www.openadapter.org/</a>,
     <a class="ulink" href="http://www.koha.org/" target="_top">http://www.koha.org/</a></p></dd><dt><span class="term">&#12469;&#12540;&#12499;&#12473;&#12434;&#25313;&#22823;&#12377;&#12427;</span></dt><dd><p>
     &#20225;&#26989;&#12364;&#36009;&#22770;&#12375;&#12390;&#12356;&#12427;&#35079;&#25968;&#12398;&#12469;&#12540;&#12499;&#12473;&#12364;&#29305;&#23450;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12383;&#12426;&#12289;
     &#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#12469;&#12540;&#12499;&#12473;&#12398;&#39749;&#21147;&#12434;&#39640;&#12417;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;
     &#12381;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#27963;&#30330;&#12395;&#32173;&#25345;&#12375;&#12390;&#12356;&#12367;&#12371;&#12392;&#12364;&#12381;&#12398;&#20225;&#26989;&#12398;&#38306;&#24515;&#20107;&#12395;&#12394;&#12427;&#12398;&#12399;&#33258;&#28982;&#12398;&#27969;&#12428;&#12391;&#12377;&#12290;
     </p><p>&#20363;: <a class="ulink" href="http://www.collab.net/" target="_top">CollabNet</a> &#12364; 
     <a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a> &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;(&#12362;&#26029;&#12426;: &#12371;&#12428;&#12399;&#31558;&#32773;&#12398;&#12523;&#12540;&#12481;&#12531;&#12527;&#12540;&#12463;&#12391;&#12377;&#12364;&#12289;&#12371;&#12428;&#12364;&#12371;&#12398;&#12514;&#12487;&#12523;&#12398;&#26368;&#33391;&#12398;&#20363;&#12391;&#12377;)
     </p></dd><dt><span class="term">&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12398;&#21942;&#26989;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;</span></dt><dd><p>
     &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12540;&#12392;&#12381;&#12398;&#37096;&#21697;&#12398;&#20385;&#20516;&#12399;&#12289;
     &#12381;&#12428;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#37327;&#12395;&#30452;&#25509;&#24038;&#21491;&#12373;&#12428;&#12414;&#12377;&#12290;
     &#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12505;&#12531;&#12480;&#12540; &#8212; &#23436;&#25104;&#12375;&#12383;&#12510;&#12471;&#12531;&#12398;&#12505;&#12531;&#12480;&#12540;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
     &#21608;&#36794;&#27231;&#22120;&#12487;&#12496;&#12452;&#12473;&#12420;&#12510;&#12452;&#12463;&#12525;&#12481;&#12483;&#12503;&#12398;&#12505;&#12531;&#12480;&#12540;&#12418;&#21547;&#12415;&#12414;&#12377; &#8212;
     &#12399;&#12289;&#33258;&#20998;&#12383;&#12385;&#12398;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12434;&#21205;&#12363;&#12379;&#12427;&#39640;&#21697;&#36074;&#12394;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12289;
     &#39015;&#23458;&#12395;&#12392;&#12387;&#12390;&#37325;&#35201;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27671;&#20184;&#12356;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
     </p></dd><dt><span class="term">&#31478;&#20105;&#30456;&#25163;&#12434;&#24369;&#20307;&#21270;&#12373;&#12379;&#12427;</span></dt><dd><p>
     &#20225;&#26989;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
     &#31478;&#21512;&#12375;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#21147;&#12434;&#24369;&#12417;&#12427;&#12371;&#12392;&#12434;&#29401;&#12387;&#12390;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
     &#31478;&#21512;&#12377;&#12427;&#12477;&#12501;&#12488;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12354;&#12387;&#12390;&#12418;&#12381;&#12358;&#12391;&#12394;&#12367;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
     &#31478;&#20105;&#30456;&#25163;&#12398;&#24066;&#22580;&#12471;&#12455;&#12450;&#12434;&#28187;&#12425;&#12377;&#12371;&#12392;&#12364;&#12289;
     &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#21807;&#19968;&#12398;&#29702;&#30001;&#12391;&#12399;&#12394;&#12356;&#12418;&#12398;&#12398;&#12289;
     &#12381;&#12398;&#12402;&#12392;&#12388;&#12384;&#12387;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#24471;&#12414;&#12377;&#12290;
     </p><p>&#20363;: <a class="ulink" href="http://www.openoffice.org/" target="_top">http://www.openoffice.org/</a>
     (&#31478;&#20105;&#30456;&#25163;&#12434;&#24369;&#20307;&#21270;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364; OpenOffice &#12398;&#21807;&#19968;&#12398;&#23384;&#22312;&#29702;&#30001;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
      &#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418; Microsoft Office &#12395;&#23550;&#12377;&#12427;&#31572;&#12360;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;)
     </p></dd><dt><span class="term">&#12510;&#12540;&#12465;&#12486;&#12451;&#12531;&#12464;</span></dt><dd><p>
     &#20154;&#27671;&#12398;&#12354;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#38306;&#12431;&#12387;&#12390;&#12356;&#12427;&#20225;&#26989;&#12399;&#12289;
     &#12381;&#12428;&#12384;&#12369;&#12391;&#12502;&#12521;&#12531;&#12489;&#31649;&#29702;&#12434;&#12358;&#12414;&#12367;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></dd><dt><span class="term">&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;</span></dt><dd><p>
         <em class="firstterm">&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;</em> &#12392;&#12399;&#12289;
           &#33258;&#20998;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#21830;&#29992;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#32068;&#12415;&#36796;&#12435;&#12391;&#22770;&#12426;&#12383;&#12356;&#39015;&#23458;&#21521;&#12369;&#12398;&#20253;&#32113;&#30340;&#12394;&#21830;&#29992;&#12521;&#12452;&#12475;&#12531;&#12473;&#12392;&#12289;
           &#12477;&#12540;&#12473;&#12434;&#20844;&#38283;&#12375;&#12390;&#20351;&#12356;&#12383;&#12356;&#20154;&#21521;&#12369;&#12398;&#12501;&#12522;&#12540;&#12394;&#12521;&#12452;&#12475;&#12531;&#12473;&#12434;&#21516;&#26178;&#12395;&#20849;&#23384;&#12373;&#12379;&#12390;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25552;&#20379;&#12377;&#12427;&#12383;&#12417;&#12398;&#25163;&#27861;&#12391;&#12377;&#12290;
           (<span><a class="xref" href="legal.html" title="&#31532;10&#31456; &#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;">10&#31456;<i>&#12521;&#12452;&#12475;&#12531;&#12473;&#12289;&#33879;&#20316;&#27177;&#12289;&#29305;&#35377;</i></a> &#12398; </span>
           <a class="xref" href="dual-licensing.html" title="&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;">&#12300;&#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#20181;&#32068;&#12415;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)
           &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38283;&#30330;&#32773;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12364;&#27963;&#30330;&#12394;&#12425;&#12289;
           &#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12373;&#12428;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;
           &#24195;&#12367;&#22810;&#12367;&#12398;&#20154;&#12363;&#12425;&#38283;&#30330;&#20316;&#26989;&#12420;&#12487;&#12496;&#12483;&#12464;&#12434;&#12375;&#12390;&#12418;&#12425;&#12360;&#12427;&#12392;&#12356;&#12358;&#21033;&#30410;&#12434;&#24471;&#12425;&#12428;&#12427;&#19978;&#12289;
           &#20225;&#26989;&#12399;&#12501;&#12523;&#12479;&#12452;&#12512;&#12391;&#20685;&#12367;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;&#12434;&#25903;&#25588;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
           &#12525;&#12452;&#12516;&#12522;&#12486;&#12451;&#12398;&#21454;&#20837;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;</p><p>&#12371;&#12398;&#12514;&#12487;&#12523;&#12398;&#20363;&#12392;&#12375;&#12390;&#12289;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12364;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
           
           &#21516;&#12376;&#21517;&#21069;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20316;&#12387;&#12390;&#12356;&#12427; <a class="ulink" href="http://www.mysql.com/" target="_top">MySQL</a>&#12289;
           &#12381;&#12375;&#12390; Barkley DB &#12434;&#37197;&#24067;&#12375;&#12289;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427; <a class="ulink" href="http://www.sleepycat.com/" target="_top">Sleepycat</a> &#12391;&#12377;&#12290;
           &#12371;&#12428;&#12425;&#12398;&#20363;&#12364;&#20001;&#26041;&#12392;&#12418;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#25201;&#12358;&#20250;&#31038;&#12391;&#12354;&#12427;&#12371;&#12392;&#12399;&#12289;
           &#20598;&#28982;&#12398;&#19968;&#33268;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
           &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#24066;&#22580;&#12391;&#12518;&#12540;&#12470;&#12540;&#12395;&#30452;&#25509;&#22770;&#12427;&#12392;&#12356;&#12358;&#12424;&#12426;&#12399;&#12289;
           &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#32113;&#21512;&#12373;&#12428;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;
           &#12487;&#12517;&#12450;&#12523;&#12521;&#12452;&#12475;&#12531;&#12473;&#12398;&#12514;&#12487;&#12523;&#12395;&#12424;&#12367;&#21512;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290; 
           </p></dd><dt><span class="term">&#23492;&#20184;&#12434;&#21463;&#12369;&#12427;</span></dt><dd><p>
         &#24195;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;
         &#12458;&#12531;&#12521;&#12452;&#12531;&#19978;&#12391;&#12300;&#23492;&#20184;&#12434;&#34892;&#12358;&#12301;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12390;&#12418;&#12425;&#12387;&#12383;&#12426;&#12289;
         &#12467;&#12540;&#12498;&#12540;&#12398;&#12510;&#12464;&#12459;&#12483;&#12503;&#12420;T&#12471;&#12515;&#12484;&#12289;&#12510;&#12454;&#12473;&#12497;&#12483;&#12489;&#12394;&#12393;&#12398;&#12424;&#12358;&#12394;&#12289;
         &#12502;&#12521;&#12531;&#12489;&#21270;&#12375;&#12383;&#21830;&#21697;&#12434;&#22770;&#12427;&#12371;&#12392;&#12391;&#12289;
         &#20491;&#20154;&#12420;&#32068;&#32340;&#12363;&#12425;&#37325;&#35201;&#12394;&#36002;&#29486;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
         &#12371;&#12371;&#12391;&#19968;&#35328;&#27880;&#24847;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;&#12418;&#12375;&#12354;&#12394;&#12383;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#23492;&#20184;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12395;&#12375;&#12383;&#22580;&#21512;&#12289;
         &#12362;&#37329;&#12364;&#20837;&#12387;&#12390;&#12367;&#12427; <span class="emphasis"><em>&#21069;</em></span> &#12395;&#23492;&#20184;&#12373;&#12428;&#12383;&#12362;&#37329;&#12434;&#12393;&#12358;&#20351;&#12358;&#12363;&#12434;&#35336;&#30011;&#12375;&#12289;         
         &#12381;&#12428;&#12434;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#25522;&#31034;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
         &#12393;&#12358;&#12362;&#37329;&#12434;&#20351;&#12358;&#12363;&#12398;&#35696;&#35542;&#12399;&#12289;&#23455;&#38555;&#12395;&#12362;&#37329;&#12364;&#20837;&#12387;&#12390;&#12367;&#12427;&#21069;&#12398;&#26041;&#12364;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12377;&#12290;
         &#12393;&#12385;&#12425;&#12395;&#12379;&#12424;&#12289;&#12362;&#37329;&#12398;&#20351;&#12356;&#26041;&#12395;&#21516;&#24847;&#12364;&#24471;&#12425;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;
         &#23492;&#20184;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12364;&#38750;&#29694;&#23455;&#30340;&#12391;&#12354;&#12427;&#12392;&#21028;&#26029;&#12375;&#12383;&#26041;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
         </p></dd></dl></div><p>
    &#12362;&#37329;&#12434;&#20986;&#12377;&#20596;&#12398;&#12499;&#12472;&#12493;&#12473;&#12514;&#12487;&#12523;&#12364;&#12289;
    &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#23550;&#12377;&#12427;&#38306;&#12431;&#12426;&#26041;&#12434;&#27770;&#12417;&#12427;&#21807;&#19968;&#12398;&#35201;&#22240;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12362;&#37329;&#12434;&#20986;&#12377;&#20596;&#12392;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12392;&#12398;&#27508;&#21490;&#30340;&#12394;&#38306;&#20418;&#12418;&#24433;&#38911;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12388;&#12414;&#12426;&#12289;&#20225;&#26989;&#12398;&#26041;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22987;&#12417;&#12383;&#12398;&#12363;&#12289;
    &#12381;&#12428;&#12392;&#12418;&#12354;&#12392;&#12363;&#12425;&#26082;&#23384;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#12398;&#12363;&#12289;&#12392;&#12356;&#12358;&#28857;&#12391;&#12377;&#12290;
    &#12393;&#12385;&#12425;&#12398;&#22580;&#21512;&#12418;&#12289;&#12362;&#37329;&#12434;&#20986;&#12377;&#20225;&#26989;&#12399;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12363;&#12425;&#20449;&#38972;&#12434;&#21213;&#12385;&#21462;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12354;&#12392;&#12363;&#12425;&#26082;&#23384;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12375;&#12383;&#26041;&#12364;&#23569;&#12375;&#20449;&#38972;&#12373;&#12428;&#12420;&#12377;&#12356;&#12289;
    &#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#39514;&#12367;&#12409;&#12365;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#24517;&#12378;&#12375;&#12418;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#26041;&#21521;&#24615;&#12434;&#25903;&#37197;&#12377;&#12427;&#12383;&#12417;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#23566;&#12367;&#12383;&#12417;&#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#20225;&#26989;&#12399;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12391;&#12522;&#12540;&#12480;&#12540;&#30340;&#12394;&#23384;&#22312;&#12434;&#32173;&#25345;&#12375;&#12383;&#12426;&#12289;
    &#21807;&#19968;&#12398;&#30330;&#35328;&#27177;&#12434;&#25345;&#12392;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;
    &#12414;&#12383;&#12399;&#12289;&#12354;&#12427;&#31243;&#24230;&#12398;&#20154;&#25968;&#12467;&#12511;&#12483;&#12479;&#12540;&#12434;&#36865;&#12426;&#36796;&#12415;&#12289;
    &#39015;&#23458;&#12363;&#12425;&#22577;&#21578;&#12373;&#12428;&#12383;&#12496;&#12464;&#12434;&#20462;&#27491;&#12375;&#12289;
    &#21172;&#12379;&#12378;&#12375;&#12390;&#35069;&#21697;&#12395;&#12381;&#12428;&#12434;&#21462;&#12426;&#36796;&#12415;&#12383;&#12356;&#12384;&#12369;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
</p><p>
    &#12371;&#12398;&#12405;&#12383;&#12388;&#12398;&#36074;&#21839;&#12434;&#12289;
    &#20197;&#38477;&#12391;&#35500;&#26126;&#12377;&#12427;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#35501;&#12416;&#12392;&#12365;&#12395;&#12424;&#12367;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12371;&#12428;&#12425;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#32068;&#32340;&#12364;&#21442;&#21152;&#12377;&#12427;&#12354;&#12425;&#12422;&#12427;&#22580;&#21512;&#12395;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#20154;&#38291;&#12364;&#20316;&#12427;&#12418;&#12398;&#12391;&#12377;&#12398;&#12391;&#12289;&#12402;&#12392;&#12388;&#12392;&#12375;&#12390;&#21516;&#12376;&#12418;&#12398;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12354;&#12427;&#31243;&#24230;&#12289;&#12394;&#12426;&#12422;&#12365;&#12395;&#20219;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    &#12371;&#12428;&#12363;&#12425;&#35500;&#26126;&#12377;&#12427;&#21407;&#21063;&#12434;&#29702;&#35299;&#12375;&#12390;&#12356;&#12369;&#12400;&#12289;
    &#12354;&#12394;&#12383;&#12364;&#26395;&#12416;&#12420;&#12426;&#26041;&#12392;&#20284;&#12383;&#12418;&#12398;&#12364;&#20986;&#12390;&#12367;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="money.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="long-term-developers.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;5&#31456; &#12459;&#12493;&#12395;&#38306;&#12377;&#12427;&#21839;&#38988; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#38283;&#30330;&#32773;&#12434;&#38263;&#26399;&#12395;&#28193;&#12387;&#12390;&#38599;&#29992;&#12377;&#12427;</td></tr></table></div></body></html>
