<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="prev" href="canned-hosting-sites.html" title="&#20184;&#37682;A Canned Hosting Sites"><link rel="next" href="bug-trackers.html" title="&#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="canned-hosting-sites.html">&#25147;&#12427;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bug-trackers.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="appendix" title="&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;"><div class="titlepage"><div><div><h2 class="title"><a name="vc-systems"></a>&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>
  2007 &#24180;&#21322;&#12400;&#12398;&#26178;&#28857;&#12391;&#31169;&#12364;&#25226;&#25569;&#12375;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;
  &#12371;&#12428;&#12425;&#12364;&#12377;&#12409;&#12390;&#12391;&#12377; (&#12381;&#12398;&#24460;&#12289;2011 &#24180;&#24460;&#21322;&#12395;&#12356;&#12367;&#12388;&#12363;&#36861;&#21152;&#12375;&#12414;&#12375;&#12383;)&#12290;
  &#12371;&#12398;&#12358;&#12385;&#12289;&#31169;&#12364;&#24120;&#29992;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399; Subversion &#12392; Git &#12391;&#12289;
  &#12381;&#12428;&#20197;&#22806;&#12395; Bazaar &#12392; CVS &#12418;&#12424;&#12367;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#20182;&#12398;&#22823;&#21322;&#12398;&#12471;&#12473;&#12486;&#12512;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#20351;&#29992;&#32076;&#39443;&#12364;&#12394;&#12356;&#12395;&#31561;&#12375;&#12356;&#12418;&#12398;&#12400;&#12363;&#12426;&#12391;&#12377;&#12290;
  &#12371;&#12371;&#12395;&#12354;&#12370;&#12383;&#24773;&#22577;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#12471;&#12473;&#12486;&#12512;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#21442;&#32771;&#12395;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  <a class="ulink" href="http://en.wikipedia.org/wiki/List_of_revision_control_software" target="_top">http://en.wikipedia.org/wiki/List_of_revision_control_software</a>
  &#12418;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><div class="sect2" title="Subversion &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-subversion"></a><span class="bold"><strong>Subversion</strong></span> &#8212; <a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a></h3></div></div></div><p>
  Subversion &#12364;&#26360;&#12363;&#12428;&#12383;&#26368;&#22823;&#12398;&#30446;&#30340;&#12399;&#12289;CVS &#12395;&#12392;&#12387;&#12390;&#12363;&#12431;&#12427;&#12471;&#12473;&#12486;&#12512;&#12434;&#20316;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  CVS &#12392;&#12411;&#12412;&#21516;&#12376;&#12424;&#12358;&#12394;&#26041;&#27861;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12434;&#34892;&#12356;&#12414;&#12377;&#12364;&#12289;
  CVS &#12518;&#12540;&#12470;&#12540;&#12364;&#12375;&#12400;&#12375;&#12400;&#24745;&#12414;&#12373;&#12428;&#12390;&#12356;&#12383;&#21839;&#38988;&#28857;&#12420;&#27231;&#33021;&#19981;&#20633;&#12394;&#12393;&#12434;&#35299;&#28040;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  Subversion &#12398;&#30446;&#27161;&#12398;&#12402;&#12392;&#12388;&#12399;&#12289;CVS &#12395;&#12394;&#12376;&#12415;&#12398;&#12354;&#12427;&#20154;&#12383;&#12385;&#12364;
  &#27604;&#36611;&#30340;&#12473;&#12512;&#12540;&#12474;&#12395; Subversion &#12395;&#31227;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  Subverion &#12398;&#27231;&#33021;&#12395;&#12388;&#12356;&#12390;&#12371;&#12371;&#12391;&#20107;&#32048;&#12363;&#12395;&#35486;&#12427;&#12371;&#12392;&#12399;&#25511;&#12360;&#12414;&#12377;&#12290;
  &#35443;&#32048;&#12399;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
  <span class="emphasis"><em>
    [&#27880;: &#31169;&#12399; Subversion &#12398;&#38283;&#30330;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12371;&#12398;&#19968;&#35239;&#12398;&#20013;&#12391;&#31169;&#12364;&#24120;&#29992;&#12375;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;&#12399; Subversion &#12384;&#12369;&#12391;&#12377;&#12290;]
  </em></span>
</p></div><div class="sect2" title="GIT &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-git"></a><span class="bold"><strong>GIT</strong></span> &#8212; <a class="ulink" href="http://git.or.cz/" target="_top">http://git.or.cz/</a></h3></div></div></div><p>
  GIT &#12399;&#12289;Linus Torvalds &#12364; Linux
  &#12459;&#12540;&#12493;&#12523;&#12398;&#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12434;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12376;&#12417;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;
  &#26368;&#21021;&#12398;&#12358;&#12385;&#12399;&#12459;&#12540;&#12493;&#12523;&#12398;&#38283;&#30330;&#12391;&#24517;&#35201;&#12392;&#12394;&#12427;&#27231;&#33021;&#12395;&#29305;&#21270;&#12375;&#12383;&#12418;&#12398;&#12391;&#12375;&#12383;&#12364;&#12289;
  &#20170;&#12391;&#12399;&#27231;&#33021;&#12418;&#22679;&#12360;&#12289;Linux &#12459;&#12540;&#12493;&#12523;&#20197;&#22806;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#29992;&#12356;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12391;&#12398;&#35500;&#26126;&#12395;&#12424;&#12427;&#12392;&#12289;GIT &#12399;
  &#12300;&#8230;&#8230;&#24040;&#22823;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#39640;&#36895;&#12363;&#12388;&#21177;&#29575;&#30340;&#12395;&#31649;&#29702;&#12377;&#12427;&#12424;&#12358;&#12395;&#35373;&#35336;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#20027;&#12395;&#21508;&#31278;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#20013;&#12391;&#12418;&#26377;&#21517;&#12394;&#12398;&#12399; Linux &#12459;&#12540;&#12493;&#12523;&#12391;&#12377;&#12290;
  Git &#12399;&#20998;&#25955;&#22411;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#31649;&#29702;&#12484;&#12540;&#12523;&#12398;&#19968;&#31278;&#12391;&#12289;GNU Arch &#12420; Monotone
  (&#12354;&#12427;&#12356;&#12399;&#29420;&#21344;&#30340;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#30028;&#12391;&#12398; BitKeeper) &#12392;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;
  Git &#12398;&#12377;&#12409;&#12390;&#12398;&#20316;&#26989;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#12289;
  &#12381;&#12428;&#21336;&#20307;&#12391;&#23436;&#20840;&#12394;&#12522;&#12499;&#12472;&#12519;&#12531;&#36861;&#36321;&#27231;&#33021;&#12434;&#25345;&#12388;&#12522;&#12509;&#12472;&#12488;&#12522;&#12391;&#12354;&#12426;&#12289;
  &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12450;&#12463;&#12475;&#12473;&#12420;&#20013;&#22830;&#12469;&#12540;&#12496;&#12364;&#12394;&#12367;&#12390;&#12418;&#27231;&#33021;&#12375;&#12414;&#12377;&#12301;&#12290;
</p></div><div class="sect2" title="Mercurial &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-mercurial"></a><span class="bold"><strong>Mercurial</strong></span> &#8212; <a class="ulink" href="http://www.selenic.com/mercurial/" target="_top">http://www.selenic.com/mercurial/</a></h3></div></div></div><p>
  Mercurial &#12399;&#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;
  "&#12501;&#12449;&#12452;&#12523;&#12420;&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12398;&#23436;&#20840;&#12394;&#12463;&#12525;&#12473;&#12452;&#12531;&#12487;&#12463;&#12471;&#12531;&#12464;&#12289;
  &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#24111;&#22495;&#12420; CPU &#12395;&#20778;&#12375;&#12356;&#21516;&#26399;&#12503;&#12525;&#12488;&#12467;&#12523; (HTTP &#12362;&#12424;&#12403; SSH)&#12289;
  &#20219;&#24847;&#12398;&#38283;&#30330;&#12502;&#12521;&#12531;&#12481;&#38291;&#12391;&#12398;&#12510;&#12540;&#12472;&#12289;&#21336;&#20307;&#12391;&#21205;&#20316;&#12377;&#12427;&#12454;&#12455;&#12502;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#21516;&#26801;&#12289;
  UNIX &#12391;&#12418; MacOS X &#12391;&#12418; Windows &#12391;&#12418;&#21516;&#12376;&#12424;&#12358;&#12395;&#21205;&#20316;&#12377;&#12427;"
  &#12392;&#12356;&#12387;&#12383;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;
  (&#12371;&#12398;&#27231;&#33021;&#19968;&#35239;&#12399;&#12289;Mercurial &#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#20869;&#23481;&#12434;&#12414;&#12392;&#12417;&#12383;&#12418;&#12398;&#12391;&#12377;)&#12290;
</p></div><div class="sect2" title="Bazaar &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-bazaar"></a><span class="bold"><strong>Bazaar</strong></span> &#8212; <a class="ulink" href="http://bazaar-vcs.org/" target="_top">http://bazaar-vcs.org/</a></h3></div></div></div><p>
  Bazaar (bzr) &#12399; &#20351;&#12356;&#12420;&#12377;&#12373;&#12392;&#26580;&#36575;&#12394;&#12487;&#12540;&#12479;&#12514;&#12487;&#12523;&#12434;&#36861;&#21450;&#12375;&#12383;&#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399; GNU &#12398;&#20844;&#24335;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12426;&#12289;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12375;&#12390;&#12356;&#12427;
  Launchpad.net &#12391;&#25505;&#29992;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;Bazaar &#12399;&#23436;&#20840;&#12395;&#20998;&#25955;&#12375;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12434;&#23455;&#29694;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
  &#12377;&#12409;&#12390;&#12398;&#20181;&#20107;&#12434;&#12502;&#12521;&#12531;&#12481;&#12391;&#12371;&#12394;&#12375;&#12414;&#12377;&#12290;&#38283;&#30330;&#32773;&#12399;&#36890;&#24120;&#12502;&#12521;&#12531;&#12481;&#12398;&#22793;&#26356;&#23653;&#27508;&#12398;&#12467;&#12500;&#12540;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12382;&#12428;&#12398;&#12502;&#12521;&#12531;&#12481;&#12399;&#12289;&#20998;&#25955;&#22411;&#12398;&#12420;&#12426;&#26041;&#12391;&#20114;&#12356;&#12434;&#12510;&#12540;&#12472;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;Bazaar
  &#12399;&#20013;&#22830;&#31649;&#29702;&#22411;&#12398;&#12420;&#12426;&#26041;&#12418;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
  Bazaar &#12399; GNU Arch &#12398;&#27966;&#29983;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#20986;&#30330;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#12398;&#12385;&#12395;1&#12363;&#12425;&#26360;&#12365;&#30452;&#12373;&#12428;&#12289;GNU Arch &#12392;&#12399;&#30452;&#25509;&#12398;&#38306;&#36899;&#12364;&#12394;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="SVK &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-svk"></a><span class="bold"><strong>SVK</strong></span> &#8212; <a class="ulink" href="http://svk.elixus.org/" target="_top">http://svk.elixus.org/</a></h3></div></div></div><p>
  Subversion &#19978;&#12391;&#27083;&#31689;&#12373;&#12428;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12354;&#12427;&#12418;&#12398;&#12398;&#12289;SVK
  &#12399;&#12362;&#12381;&#12425;&#12367; Subversion &#12424;&#12426;&#12418;&#20197;&#19979;&#12395;&#12354;&#12370;&#12427;&#20998;&#25955;&#31649;&#29702;&#22411;&#12398;&#12471;&#12473;&#12486;&#12512;&#12395;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;
  SVK &#12399;&#12289;&#20998;&#25955;&#22411;&#12398;&#38283;&#30330;&#12420;&#12525;&#12540;&#12459;&#12523;&#12391;&#12398;&#12467;&#12511;&#12483;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#22793;&#26356;&#28857;&#12398;&#12510;&#12540;&#12472;&#27231;&#33021;&#12418;&#27927;&#32244;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  SVK &#20197;&#22806;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12484;&#12522;&#12540;&#12434;&#35079;&#35069;&#12377;&#12427;&#27231;&#33021;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#35443;&#32048;&#12399;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="Veracity &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-veracity"></a><span class="bold"><strong>Veracity</strong></span> &#8212; <a class="ulink" href="http://veracity-scm.com/" target="_top">http://veracity-scm.com/</a></h3></div></div></div><p>
    Veracity &#12399;&#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
    Git &#12420; Mercurial&#12289;Bazaar &#12394;&#12393;&#12392;&#21516;&#27096;&#12395;&#12377;&#12409;&#12390;&#12398;&#38283;&#30330;&#32773;&#12364;&#23436;&#20840;&#12394;&#12525;&#12540;&#12459;&#12523;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#25345;&#12385;&#12289;
    &#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12522;&#12509;&#12472;&#12488;&#12522;&#38291;&#12391;&#22793;&#26356;&#12398;&#12503;&#12483;&#12471;&#12517;&#12420;&#12503;&#12523;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
    &#12467;&#12510;&#12531;&#12489;&#12395;&#12388;&#12356;&#12390;&#12399;&#12371;&#12428;&#12425;&#12398;&#12471;&#12473;&#12486;&#12512;&#12392;&#12411;&#12412;&#21516;&#12376;&#12391;&#12377;&#12364;&#12289;Veracity &#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#20197;&#22806;&#12395;
    &#20998;&#25955;&#22411;&#12398;&#12496;&#12464;&#36861;&#36321;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12418;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12418;&#12289;&#12501;&#12449;&#12452;&#12523;&#12392;&#12392;&#12418;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;
    &#35328;&#12356;&#25563;&#12360;&#12427;&#12392;&#12289;Veracity &#12364;&#12420;&#12429;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#12289;&#38283;&#30330;&#12395;&#24517;&#35201;&#12392;&#12394;&#12427;&#12377;&#12409;&#12390;&#12398;&#25104;&#26524;&#29289;&#12434;
    (&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12484;&#12522;&#12540;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12418;&#21547;&#12417;&#12390;)
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#37197;&#19979;&#12395;&#32622;&#12367;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12363;&#12394;&#12426;&#37326;&#24515;&#30340;&#12394;&#32771;&#12360;&#12391;&#12377;&#12290;&#27531;&#24565;&#12394;&#12364;&#12425;&#31169;&#12399;&#12414;&#12384;&#20351;&#12358;&#27231;&#20250;&#12364;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#20351;&#12387;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#20154;&#12398;&#24863;&#24819;&#12434;&#12380;&#12402;&#32862;&#12356;&#12390;&#12415;&#12383;&#12356;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;Veracity &#12399;&#20027;&#12395;
    SourceGear, Inc &#12364;&#38283;&#30330;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#21516;&#31038;&#12399;&#38263;&#12356;&#27508;&#21490;&#12434;&#25345;&#12385;&#12289;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12420;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#27083;&#25104;&#31649;&#29702;&#12394;&#12393;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    &#12424;&#12367;&#20284;&#12383;&#12471;&#12473;&#12486;&#12512;&#12391;&#12354;&#12427; <a class="xref" href="vc-systems.html#vc-fossil" title="Fossil &#8212; ">Fossil</a> &#12418;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="Fossil &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-fossil"></a><span class="bold"><strong>Fossil</strong></span> &#8212; <a class="ulink" href="http://www.fossil-scm.org/" target="_top">http://www.fossil-scm.org/</a></h3></div></div></div><p>
    Fossil &#12364; <a class="xref" href="vc-systems.html#vc-veracity" title="Veracity &#8212; ">Veracity</a> &#12392;&#20284;&#12390;&#12356;&#12427;&#28857;&#12399;&#12289;
    &#12393;&#12385;&#12425;&#12418;&#20998;&#25955;&#22411;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12354;&#12426;&#12289;
    &#12373;&#12425;&#12395;&#12393;&#12385;&#12425;&#12418;&#21336;&#12395;&#12467;&#12540;&#12489;&#12384;&#12369;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
    Fossil &#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12420;&#20998;&#25955;&#22411;&#12398; Wiki&#12289;&#12381;&#12375;&#12390;
    &#20998;&#25955;&#22411;&#12398;&#12502;&#12525;&#12464;&#12394;&#12393;&#12418;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#20182;&#12398;&#27231;&#33021;&#12392;&#12375;&#12390;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;
    "autosync" &#12514;&#12540;&#12489;&#12364;&#12354;&#12426;&#12289;&#12371;&#12398;&#12514;&#12540;&#12489;&#12399;&#12289;&#34909;&#31361;&#12375;&#12394;&#12356;&#22793;&#26356;&#12399;&#12377;&#12409;&#12390;&#33258;&#21205;&#30340;&#12395;&#12510;&#12540;&#12472;&#12375;&#12414;&#12377;
    (&#12388;&#12414;&#12426;&#12289;Fossil &#12399;&#20013;&#22830;&#31649;&#29702;&#22411;&#12398;&#29872;&#22659;&#12391;&#12418;&#12381;&#12358;&#12391;&#12394;&#12356;&#29872;&#22659;&#12391;&#12418;&#21205;&#12363;&#12379;&#12414;&#12377;&#12290;
    &#20182;&#12398;&#20998;&#25955;&#22411;&#12471;&#12473;&#12486;&#12512;&#12418;&#29702;&#23624;&#12398;&#19978;&#12391;&#12399;&#12381;&#12398;&#12392;&#12362;&#12426;&#12394;&#12398;&#12391;&#12377;&#12364;&#12289;
    Fossil &#12399;&#12373;&#12425;&#12395;&#12418;&#12358;&#19968;&#27497;&#36914;&#12435;&#12391;&#12289;&#23455;&#38555;&#12395;&#20013;&#22830;&#31649;&#29702;&#22411;&#12398;&#12527;&#12540;&#12463;&#12501;&#12525;&#12540;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;)&#12290;
    &#12454;&#12455;&#12502;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12418;&#21516;&#26801;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12467;&#12540;&#12489;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#12502;&#12521;&#12454;&#12470;&#12391;&#38322;&#35239;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    Fossil &#12434;&#20027;&#12395;&#38283;&#30330;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399; Dr. Richard Hipp &#12391;&#12377;&#12290;
    &#12362;&#12381;&#12425;&#12367; SQLite &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12456;&#12531;&#12472;&#12531;&#12398;&#20316;&#32773;&#12392;&#12375;&#12390;&#12398;&#12411;&#12358;&#12364;&#12424;&#12367;&#30693;&#12425;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
    Veracity &#12392;&#21516;&#27096;&#12289;&#31169;&#12399; Fossil &#12418;&#20351;&#12387;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20351;&#12387;&#12383;&#12371;&#12392;&#12364;&#12354;&#12427;&#20154;&#12399;&#12289;&#12380;&#12402;&#24863;&#24819;&#12434;&#32862;&#12363;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="CVS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-cvs"></a><span class="bold"><strong>CVS</strong></span> &#8212; <a class="ulink" href="http://www.nongnu.org/cvs/" target="_top">http://www.nongnu.org/cvs/</a></h3></div></div></div><p>
  CVS &#12399;&#38263;&#12356;&#27508;&#21490;&#12434;&#25345;&#12387;&#12390;&#12362;&#12426;&#12289;&#22810;&#12367;&#12398;&#38283;&#30330;&#32773;&#12395;&#12392;&#12387;&#12390;&#12362;&#12394;&#12376;&#12415;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#20844;&#38283;&#12373;&#12428;&#12383;&#24403;&#26178;&#12399;&#38761;&#21629;&#30340;&#12394;&#23384;&#22312;&#12391;&#12375;&#12383;&#12290;
  &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12392;&#12375;&#12390;&#12399;&#21021;&#12417;&#12390;
  (&#23569;&#12394;&#12367;&#12392;&#12418;&#31169;&#12398;&#30693;&#12427;&#38480;&#12426;) &#38626;&#12428;&#12383;&#22580;&#25152;&#12395;&#12356;&#12427;&#38283;&#30330;&#32773;&#36948;&#12395;&#12424;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#32076;&#30001;&#12398;&#12450;&#12463;&#12475;&#12473;&#12395;&#23550;&#24540;&#12375;&#12289;
  &#12414;&#12383;&#21021;&#12417;&#12390;&#21311;&#21517;&#12391;&#12398;&#35501;&#12415;&#36796;&#12415;&#23554;&#29992;&#12481;&#12455;&#12483;&#12463;&#12450;&#12454;&#12488;&#12395;&#23550;&#24540;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#26032;&#12375;&#12356;&#38283;&#30330;&#32773;&#12364;&#23481;&#26131;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12377;&#12290;
  CVS &#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12398;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#12415;&#12391;&#12354;&#12426;&#12289;
  &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#31649;&#29702;&#12375;&#12414;&#12379;&#12435;&#12290;
  &#12502;&#12521;&#12531;&#12481;&#12420;&#12479;&#12464;&#12398;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12362;&#12426;&#12289;
  &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12391;&#12418;&#39640;&#36895;&#12395;&#21205;&#20316;&#12375;&#12414;&#12377;&#12364;&#12289;
  &#24040;&#22823;&#12394;&#12501;&#12449;&#12452;&#12523;&#12420;&#12496;&#12452;&#12490;&#12522;&#12501;&#12449;&#12452;&#12523;&#12399;&#12358;&#12414;&#12367;&#25201;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12450;&#12488;&#12511;&#12483;&#12463;&#12394;&#12467;&#12511;&#12483;&#12488;&#12395;&#12418;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
  <span class="emphasis"><em>
    [&#27880;: &#31169;&#12399;&#12363;&#12388;&#12390;&#12289;&#32004; 5 &#24180;&#12395;&#12431;&#12383;&#12387;&#12390;&#31934;&#21147;&#30340;&#12395; CVS &#12398;&#38283;&#30330;&#12395;&#25658;&#12431;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
    &#12381;&#12398;&#24460;&#12289;CVS &#12395;&#12363;&#12431;&#12427;&#12471;&#12473;&#12486;&#12512;&#12392;&#12375;&#12390;&#12398; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#12385;&#19978;&#12370;&#12395;&#12363;&#12363;&#12431;&#12426;&#12414;&#12375;&#12383;&#12290;]
  </em></span>
</p></div><div class="sect2" title="Darcs &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-darcs"></a><span class="bold"><strong>Darcs</strong></span> &#8212; <a class="ulink" href="http://darcs.net/" target="_top">http://darcs.net/</a></h3></div></div></div><p>
  &#12300;David's Advanced Revision Control System &#12399;&#12289;
  CVS &#12398;&#12363;&#12431;&#12426;&#12392;&#12394;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;Haskell &#12391;&#26360;&#12363;&#12428;&#12390;&#12362;&#12426;&#12289;
  Linux &#12420; MacOS X&#12289;FreeBSD&#12289;OpenBSD &#12381;&#12375;&#12390; Microsoft Windows
  &#12391;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;Darcs &#12395;&#12399; cgi &#12473;&#12463;&#12522;&#12503;&#12488;&#12418;&#21547;&#12414;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#12371;&#12428;&#12434;&#29992;&#12356;&#12390;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#20013;&#36523;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="Arch &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-arch"></a><span class="bold"><strong>Arch</strong></span> &#8212; <a class="ulink" href="http://www.gnu.org/software/gnu-arch/" target="_top">http://www.gnu.org/software/gnu-arch/</a></h3></div></div></div><p>
  GNU Arch &#12399;&#12289;&#20998;&#25955;&#22411;&#12398;&#38283;&#30330;&#12392;&#20013;&#22830;&#31649;&#29702;&#22411;&#12398;&#38283;&#30330;&#12398;&#20001;&#26041;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#12399;&#12289;&#22793;&#26356;&#20869;&#23481;&#12434;&#12300;&#12450;&#12540;&#12459;&#12452;&#12502;&#12301;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12414;&#12377;&#12290;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12525;&#12540;&#12459;&#12523;&#12395;&#25345;&#12388;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#22793;&#26356;&#20869;&#23481;&#12434;&#20182;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#12398;&#38291;&#12391;&#12420;&#12426;&#12392;&#12426;&#12375;&#12289;
  &#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#31649;&#29702;&#32773;&#12364;&#12381;&#12428;&#12434;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#26041;&#24335;&#12363;&#12425;&#12418;&#24819;&#20687;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;Arch &#12398;&#12510;&#12540;&#12472;&#27231;&#33021;&#12399;
  CVS &#12398;&#12418;&#12398;&#12424;&#12426;&#27927;&#32244;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;Arch &#12399;&#12414;&#12383;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12383;&#12394;&#12356;&#20154;&#12391;&#12418;&#31777;&#21336;&#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#32057;&#20171;&#12375;&#12383;&#12398;&#12399;&#27010;&#35201;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;&#35443;&#32048;&#12399; Arch &#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect2" title="monotone &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-monotone"></a><span class="bold"><strong>monotone</strong></span> &#8212; <a class="ulink" href="http://www.venge.net/monotone/" target="_top">http://www.venge.net/monotone/</a></h3></div></div></div><p>
  &#12300;monotone &#12399;&#12289;&#12501;&#12522;&#12540;&#12394;&#20998;&#25955;&#22411;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
   &#21336;&#19968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12394;&#12427;&#12471;&#12531;&#12503;&#12523;&#12363;&#12388;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12490;&#12523;&#12394;&#24418;&#24335;&#12391;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12375;&#12289;
   &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12363;&#12425;&#20999;&#26029;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#23436;&#20840;&#12395;&#27231;&#33021;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;
   &#21177;&#29575;&#30340;&#12394;&#12500;&#12450;&#12484;&#12540;&#12500;&#12450;&#21516;&#26399;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
   &#23653;&#27508;&#12434;&#32771;&#24942;&#12375;&#12383;&#12510;&#12540;&#12472;&#12289;&#36605;&#37327;&#12394;&#12502;&#12521;&#12531;&#12481;&#20316;&#25104;&#12289;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12289;
   &#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12395;&#12424;&#12427;&#12486;&#12473;&#12488;&#12394;&#12393;&#12398;&#27231;&#33021;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
   &#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#21629;&#21517;&#12399;&#26263;&#21495;&#21270;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12391; RSA &#35388;&#26126;&#26360;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
  &#22269;&#38555;&#21270;&#23550;&#24540;&#12418;&#21313;&#20998;&#12395;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#21029;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#20381;&#23384;&#12377;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  linux &#12420; solaris&#12289;OSX&#12289;windows &#12391;&#21205;&#20316;&#12375;&#12289;GNU GPL &#12398;&#12418;&#12392;&#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="Codeville &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-codeville"></a><span class="bold"><strong>Codeville</strong></span> &#8212; <a class="ulink" href="http://codeville.org/" target="_top">http://codeville.org/</a></h3></div></div></div><p>
  &#12300;&#12394;&#12380;&#12356;&#12414;&#12384;&#12395;&#12381;&#12435;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12387;&#12390;&#12427;&#12435;&#12391;&#12377;&#12363;?
  &#12411;&#12363;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12387;&#12390;&#12415;&#12435;&#12394;&#12289;
  &#12502;&#12521;&#12531;&#12481;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#12392;&#12365;&#12398;&#34909;&#31361;&#12434;&#36215;&#12371;&#12373;&#12394;&#12356;&#12424;&#12358;&#12395;
  &#32048;&#24515;&#12398;&#27880;&#24847;&#12434;&#25173;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12376;&#12419;&#12394;&#12356;&#12391;&#12377;&#12363;&#12290;
  Codeville &#12394;&#12425;&#12381;&#12435;&#12394;&#24515;&#37197;&#12399;&#28961;&#29992;&#12290;
  &#12356;&#12388;&#12391;&#12418;&#12393;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12363;&#12425;&#12391;&#12418;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#21487;&#33021;&#12391;&#12289;
  &#28961;&#39364;&#12394;&#12510;&#12540;&#12472;&#12399;&#30330;&#29983;&#12375;&#12414;&#12379;&#12435;&#12301;
</p><p>
  &#12300;Codeville &#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#22793;&#26356;&#12395;&#23550;&#12375;&#12390; ID &#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#21508;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#22793;&#26356;&#12398;&#19968;&#35239;&#12392;
  &#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#21508;&#34892;&#12364;&#12393;&#12398;&#22793;&#26356;&#12391;&#26356;&#26032;&#12373;&#12428;&#12383;&#12398;&#12363;&#12434;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#34909;&#31361;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12362;&#20114;&#12356;&#12364;&#30456;&#25163;&#20596;&#12398;&#22793;&#26356;&#12434;&#36969;&#29992;&#28168;&#12415;&#12363;&#12393;&#12358;&#12363;&#12434;&#35519;&#12409;&#12289;
  &#22793;&#26356;&#28168;&#12415;&#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#12399;&#33258;&#21205;&#30340;&#12395;&#12381;&#12385;&#12425;&#12364;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;
  &#33258;&#21205;&#30340;&#12395;&#12510;&#12540;&#12472;&#12391;&#12365;&#12394;&#12356;&#34909;&#31361;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;Codeville
  &#12398;&#25369;&#21205;&#12399; CVS &#12392;&#12411;&#12412;&#21516;&#12376;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="Vesta &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-vesta"></a><span class="bold"><strong>Vesta</strong></span> &#8212; <a class="ulink" href="http://www.vestasys.org/" target="_top">http://www.vestasys.org/</a></h3></div></div></div><p>
  &#12300;Vesta &#12399;&#12509;&#12540;&#12479;&#12502;&#12523;&#12394; SCM [&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#35373;&#23450;&#31649;&#29702;]
  &#12471;&#12473;&#12486;&#12512;&#12391;&#12289;&#23567;&#35215;&#27169; (&#12477;&#12540;&#12473;&#12467;&#12540;&#12489; 10,000 &#34892;&#26410;&#28288;) &#12363;&#12425;&#22823;&#35215;&#27169;
  (&#12477;&#12540;&#12473;&#12467;&#12540;&#12489; 10,000,000 &#34892;&#20197;&#19978;)
  &#12414;&#12391;&#12354;&#12425;&#12422;&#12427;&#35215;&#27169;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12471;&#12473;&#12486;&#12512;&#12398;&#38283;&#30330;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12301;
</p><p>
  &#12300;Vesta &#12399;&#20870;&#29087;&#12375;&#12383;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;Compaq/Digital Systems Research Center
  &#12395;&#12362;&#12369;&#12427; 10 &#24180;&#20197;&#19978;&#12398;&#30740;&#31350;&#38283;&#30330;&#12398;&#32080;&#26524;&#12392;&#12375;&#12390;&#29983;&#12414;&#12428;&#12383;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
  2 &#24180;&#21322;&#20197;&#19978;&#12395;&#12431;&#12383;&#12387;&#12390; Compaq &#12398; Alpha &#12510;&#12452;&#12463;&#12525;&#12503;&#12525;&#12475;&#12483;&#12469;&#12464;&#12523;&#12540;&#12503;&#12364;&#23455;&#38555;&#12395;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  Alpha &#12464;&#12523;&#12540;&#12503;&#12395;&#12399; 150 &#20154;&#20197;&#19978;&#12398;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#38283;&#30330;&#32773;&#12364;&#12362;&#12426;&#12289;
  &#24444;&#12425;&#12399;&#20309;&#21315;&#12510;&#12452;&#12523;&#12418;&#38626;&#12428;&#12383; 2 &#25312;&#28857; (&#12450;&#12513;&#12522;&#12459;&#12398;&#26481;&#28023;&#23736;&#12392;&#35199;&#28023;&#23736;)
  &#12391;&#20685;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;&#24444;&#12425;&#12364; Vesta &#12434;&#20351;&#12387;&#12390;&#31649;&#29702;&#12375;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;
  130 MB &#12395;&#12362;&#12424;&#12406;&#12477;&#12540;&#12473;&#12487;&#12540;&#12479;&#12392;&#12499;&#12523;&#12489;&#12391;&#12289;
  &#12381;&#12371;&#12363;&#12425;&#29983;&#25104;&#12373;&#12428;&#12427;&#27966;&#29983;&#12487;&#12540;&#12479;&#12399; 1.5 GB &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12499;&#12523;&#12489;&#20316;&#26989;&#12399;&#26481;&#28023;&#23736;&#12398;&#25312;&#28857;&#12391;&#34892;&#12431;&#12428;&#12289;&#24179;&#22343;&#12375;&#12390; 10-15 GB
  &#12398;&#27966;&#29983;&#12487;&#12540;&#12479;&#12434;&#29983;&#25104;&#12375;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12425;&#12418;&#12377;&#12409;&#12390; Vesta &#12391;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  Vesta &#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#38283;&#30330;&#12398;&#12383;&#12417;&#12395;&#35373;&#35336;&#12373;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;
  Alpha &#12464;&#12523;&#12540;&#12503;&#12399;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12364;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#38283;&#30330;&#12395;&#12418;&#20351;&#12360;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#35352;&#36848;&#35328;&#35486;&#12501;&#12449;&#12452;&#12523;&#12434; Vesta &#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#31649;&#29702;&#27231;&#27083;&#12395;&#12481;&#12455;&#12483;&#12463;&#12452;&#12531;&#12375;&#12289;
  Vesta &#12398;&#12499;&#12523;&#12480;&#12540;&#12434;&#20351;&#12387;&#12390;&#12471;&#12511;&#12517;&#12524;&#12540;&#12479;&#12420;&#12381;&#12398;&#20182;&#12398;&#27966;&#29983;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12499;&#12523;&#12489;&#12375;&#12383;&#12398;&#12391;&#12377;&#12290;
  &#12363;&#12388;&#12390;&#12398; Alpha &#12464;&#12523;&#12540;&#12503;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#20170;&#12399; Intel &#12395;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#20170;&#12418;&#12394;&#12362;&#26032;&#12375;&#12356;&#12510;&#12452;&#12463;&#12525;&#12503;&#12525;&#12475;&#12483;&#12469;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391; Vesta &#12434;&#20351;&#12356;&#32154;&#12369;&#12390;&#12356;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="Aegis &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-aegis"></a><span class="bold"><strong>Aegis</strong></span> &#8212; <a class="ulink" href="http://aegis.sourceforge.net/" target="_top">http://aegis.sourceforge.net/</a></h3></div></div></div><p>
  &#12300;Aegis &#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12505;&#12540;&#12473;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#27083;&#25104;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
   Aegis &#12364;&#25552;&#20379;&#12377;&#12427;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;
   &#38283;&#30330;&#32773;&#12481;&#12540;&#12512;&#12398;&#21508;&#12513;&#12531;&#12496;&#12540;&#12364;&#12381;&#12428;&#12382;&#12428;&#29420;&#33258;&#12395;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
   Aegis &#12364;&#21508;&#22793;&#26356;&#28857;&#12434;&#32113;&#21512;&#12375;&#12390;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12510;&#12473;&#12479;&#12540;&#12477;&#12540;&#12473;&#12395;&#26360;&#12365;&#25147;&#12375;&#12414;&#12377;&#12364;&#12289;
   &#12381;&#12398;&#38555;&#12395;&#38754;&#20498;&#12394;&#20316;&#26989;&#12364;&#26997;&#21147;&#36215;&#12371;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="CVSNT &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-cvsnt"></a><span class="bold"><strong>CVSNT</strong></span> &#8212; <a class="ulink" href="http://cvsnt.org/" target="_top">http://cvsnt.org/</a></h3></div></div></div><p>
  &#12300;CVSNT &#12399;&#12289;&#39640;&#27231;&#33021;&#12394;&#12510;&#12523;&#12481;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#23550;&#24540;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#26989;&#30028;&#27161;&#28310;&#12398; CVS &#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#27231;&#33021;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  CVSNT &#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#12289;GNU Geleral Public License &#12391;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12377;&#12301;
  &#27231;&#33021;&#19968;&#35239;&#12395;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#20869;&#23481;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#27161;&#28310; CVS &#12503;&#12525;&#12488;&#12467;&#12523;&#12395;&#12424;&#12427;&#35469;&#35388;&#12384;&#12369;&#12391;&#12394;&#12367;
  Windows &#22266;&#26377;&#12398; SSPI &#12420; Active Directory &#12395;&#12424;&#12427;&#35469;&#35388;&#12289;
  sserver &#12354;&#12427;&#12356;&#12399;&#26263;&#21495;&#21270; SSPI &#12395;&#12424;&#12427;&#23433;&#20840;&#12394;&#36578;&#36865;&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;
  &#12463;&#12525;&#12473;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512; (Windows &#12391;&#12418; Unix &#29872;&#22659;&#12391;&#12418;&#21205;&#20316;&#12377;&#12427;)&#12289;
  Win32 &#12471;&#12473;&#12486;&#12512;&#12392;&#23436;&#20840;&#12395;&#32113;&#21512;&#12375;&#12383; NT &#12496;&#12540;&#12472;&#12519;&#12531;&#12289;
  &#12510;&#12540;&#12472;&#12509;&#12452;&#12531;&#12488;&#20966;&#29702; (&#12479;&#12464;&#12434;&#25171;&#12383;&#12394;&#12367;&#12390;&#12418;&#12510;&#12540;&#12472;&#12364;&#12391;&#12365;&#12427;)&#12289;
  &#27963;&#30330;&#12395;&#38283;&#30330;&#12364;&#36914;&#34892;&#20013;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="META-CVS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-meta-cvs"></a><span class="bold"><strong>META-CVS</strong></span> &#8212; <a class="ulink" href="http://common-lisp.net/project/meta-cvs/" target="_top">http://common-lisp.net/project/meta-cvs/</a></h3></div></div></div><p>
  &#12300;Meta-CVS &#12399; CVS &#12434;&#22522;&#12395;&#12375;&#12390;&#12388;&#12367;&#12425;&#12428;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#23550;&#24540;&#12434;&#21547;&#12416; CVS &#12398;&#12411;&#12392;&#12435;&#12393;&#12398;&#27231;&#33021;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
  CVS &#12424;&#12426;&#12418;&#27231;&#33021;&#30340;&#12391;&#31777;&#21336;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12301;
  META-CVS &#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#27231;&#33021;&#19968;&#35239;&#12395;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12364;&#35352;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#27083;&#36896;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12289;&#12424;&#12426;&#25913;&#21892;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12479;&#12452;&#12503;&#20966;&#29702;&#12289;
  &#12471;&#12531;&#12503;&#12523;&#12391;&#12518;&#12540;&#12470;&#12540;&#12395;&#20778;&#12375;&#12356;&#12502;&#12521;&#12531;&#12481;/&#12510;&#12540;&#12472;&#20966;&#29702;&#12289;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463;&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12487;&#12540;&#12479;&#12408;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12522;&#12473;&#12488;&#12398;&#20184;&#21152;&#12289;
  &#12424;&#12426;&#25913;&#21892;&#12373;&#12428;&#12383;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12487;&#12540;&#12479;&#12398;&#21462;&#12426;&#36796;&#12415;&#20966;&#29702;&#12289;
  &#12381;&#12375;&#12390; CVS &#12363;&#12425;&#12398;&#31227;&#34892;&#12364;&#23481;&#26131;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p></div><div class="sect2" title="OpenCM &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-opencm"></a><span class="bold"><strong>OpenCM</strong></span> &#8212; <a class="ulink" href="http://www.opencm.org/" target="_top">http://www.opencm.org/</a></h3></div></div></div><p>
  &#12300;OpenCM &#12399;&#12289;&#23433;&#20840;&#12391;&#39640;&#21697;&#36074;&#12394; CVS &#20195;&#26367;&#12471;&#12473;&#12486;&#12512;&#12392;&#12375;&#12390;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#20027;&#35201;&#12394;&#27231;&#33021;&#12395;&#12388;&#12356;&#12390;&#12399;&#27231;&#33021;&#19968;&#35239;&#12506;&#12540;&#12472;&#12395;&#25522;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;CVS &#12411;&#12393;
  &#12302;&#27231;&#33021;&#28288;&#36617;&#12303;&#12394;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;CVS &#12395;&#12399;&#12394;&#12356;&#20415;&#21033;&#12394;&#27231;&#33021;&#12434;&#12356;&#12367;&#12388;&#12363;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#31777;&#21336;&#12395;&#12414;&#12392;&#12417;&#12427;&#12392;&#12289;OpenCM &#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#12522;&#12493;&#12540;&#12512;&#12395;&#23550;&#24540;&#12375;&#12390;&#12362;&#12426;&#12289;
  &#12414;&#12383;&#26263;&#21495;&#21270;&#12375;&#12383;&#35469;&#35388;&#20966;&#29702;&#12420;&#12450;&#12463;&#12475;&#12473;&#21046;&#24481;&#12289;&#12381;&#12375;&#12390;&#39640;&#27231;&#33021;&#12394;&#12502;&#12521;&#12531;&#12481;&#20966;&#29702;&#12395;&#12418;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="PRCS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-prcs"></a><span class="bold"><strong>PRCS</strong></span> &#8212; <a class="ulink" href="http://prcs.sourceforge.net/" target="_top">http://prcs.sourceforge.net/</a></h3></div></div></div><p>
  &#12300;PRCS &#12399; Project Revision Control System &#12398;&#30053;&#12391;&#12289;(CVS &#12398;&#12424;&#12358;&#12395;)
  &#12501;&#12449;&#12452;&#12523;&#12420;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;&#12484;&#12540;&#12523;&#32676;&#12398;&#12501;&#12525;&#12531;&#12488;&#12456;&#12531;&#12489;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#30446;&#30340;&#12399; SCCS &#12420; RCS&#12289;CVS &#12392;&#21516;&#12376;&#12391;&#12377;&#12364;&#12289;(&#23569;&#12394;&#12367;&#12392;&#12418;&#20316;&#32773;&#12395;&#12424;&#12427;&#12392;)
  &#12381;&#12428;&#12425;&#12398;&#12471;&#12473;&#12486;&#12512;&#12424;&#12426;&#12418;&#12378;&#12387;&#12392;&#12471;&#12531;&#12503;&#12523;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12301;
</p></div><div class="sect2" title="ArX &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-arx"></a><span class="bold"><strong>ArX</strong></span> &#8212; <a class="ulink" href="http://www.nongnu.org/arx/" target="_top">http://www.nongnu.org/arx/</a></h3></div></div></div><p>
  ArX &#12399;&#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;&#12502;&#12521;&#12531;&#12481;&#12420;&#12510;&#12540;&#12472;&#27231;&#33021;&#12289;
  &#26263;&#21495;&#21270;&#12375;&#12383;&#12487;&#12540;&#12479;&#12398;&#25972;&#21512;&#24615;&#12398;&#26908;&#35388;&#27231;&#33021;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;
  &#20219;&#24847;&#12398; HTTP &#12469;&#12540;&#12496;&#19978;&#12391;&#23481;&#26131;&#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#20844;&#38283;&#12391;&#12365;&#12427;&#27231;&#33021;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p></div><div class="sect2" title="SourceJammer &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-sourcejammer"></a><span class="bold"><strong>SourceJammer</strong></span> &#8212; <a class="ulink" href="http://www.sourcejammer.org/" target="_top">http://www.sourcejammer.org/</a></h3></div></div></div><p>
  &#12300;SourceJammer &#12399;&#12289;Java &#12391;&#26360;&#12363;&#12428;&#12383;&#12477;&#12540;&#12473;&#31649;&#29702;/&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#12469;&#12540;&#12496;&#12469;&#12452;&#12489;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12469;&#12452;&#12489;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#27083;&#25104;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;
  &#12469;&#12540;&#12496;&#12469;&#12452;&#12489;&#12391;&#12399;&#12501;&#12449;&#12452;&#12523;&#12420;&#12496;&#12540;&#12472;&#12519;&#12531;&#23653;&#27508;&#12398;&#31649;&#29702;&#12289;&#12481;&#12455;&#12483;&#12463;&#12452;&#12531;&#12420;&#12481;&#12455;&#12483;&#12463;&#12450;&#12454;&#12488;&#12394;&#12393;&#12398;&#20966;&#29702;&#12289;
  &#12381;&#12375;&#12390;&#12381;&#12398;&#20182;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#25201;&#12356;&#12414;&#12377;&#12290;
  &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12469;&#12452;&#12489;&#12391;&#12399;&#12289;&#12469;&#12540;&#12496;&#12363;&#12425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21463;&#12369;&#12390;&#12501;&#12449;&#12452;&#12523;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#31649;&#29702;&#12375;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="FastCST &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-fastcst"></a><span class="bold"><strong>FastCST</strong></span> &#8212; <a class="ulink" href="http://www.zedshaw.com/projects/fastcst/index.html" target="_top">http://www.zedshaw.com/projects/fastcst/index.html</a></h3></div></div></div><p>
  &#12300;&#12501;&#12449;&#12452;&#12523;&#21336;&#20301;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12391;&#12399;&#12394;&#12367;&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12434;&#25201;&#12356;&#12289;
  &#20013;&#22830;&#31649;&#29702;&#12391;&#12399;&#12394;&#12367;&#20998;&#25955;&#22411;&#12391;&#20966;&#29702;&#12434;&#34892;&#12358;&#12302;&#12514;&#12480;&#12531;&#12394;&#12303;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
  &#12513;&#12540;&#12523;&#12450;&#12459;&#12454;&#12531;&#12488;&#12373;&#12360;&#12354;&#12428;&#12400; FastCST &#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#22823;&#35215;&#27169;&#12394;&#20998;&#25955;&#38283;&#30330;&#12395;&#24517;&#35201;&#12394;&#12398;&#12399;&#12289;FTP &#12469;&#12540;&#12496;&#12354;&#12427;&#12356;&#12399; HTTP &#12469;&#12540;&#12496;&#12398;&#12415;&#12391;&#12377;&#12290;
  &#12354;&#12427;&#12356;&#12399;&#12289;&#32068;&#12415;&#36796;&#12415;&#12398; 'serve' &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12387;&#12390;&#30452;&#25509;&#31649;&#29702;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12399;&#23436;&#20840;&#12395;&#19968;&#24847;&#12391;&#12354;&#12426;&#12289;&#22823;&#37327;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12383;&#12417;&#12289;&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12434;&#12431;&#12374;&#12431;&#12374;&#36969;&#29992;&#12375;&#12390;&#12415;&#12394;&#12367;&#12390;&#12418;&#12289;&#19981;&#35201;&#12394;&#12418;&#12398;&#12434;&#21028;&#26029;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12510;&#12540;&#12472;&#20966;&#29702;&#12399;&#12289;&#21029;&#12398;&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12395;&#12510;&#12540;&#12472;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#12510;&#12540;&#12472;&#12373;&#12428;&#12383;&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12434;&#29694;&#22312;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#20869;&#23481;&#12392;&#27604;&#36611;&#12377;&#12427;&#12371;&#12392;&#12391;&#34892;&#12356;&#12414;&#12377;&#12301;
</p></div><div class="sect2" title="Superversion &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-superversion"></a><span class="bold"><strong>Superversion</strong></span> &#8212; <a class="ulink" href="http://www.superversion.org/" target="_top">http://www.superversion.org/</a></h3></div></div></div><p>
  &#12300;Superversion &#12399;&#12289;&#12510;&#12523;&#12481;&#12518;&#12540;&#12470;&#12540;&#23550;&#24540;&#12398;&#20998;&#25955;&#22411;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;
  &#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12395;&#12418;&#12392;&#12389;&#12356;&#12383;&#20966;&#29702;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#21830;&#29992;&#35069;&#21697;&#12395;&#21462;&#12387;&#12390;&#20195;&#12431;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#36984;&#25246;&#32930;&#12392;&#12375;&#12390;&#12289;
  &#21830;&#29992;&#35069;&#21697;&#12394;&#12415; (&#12354;&#12427;&#12356;&#12399;&#12381;&#12428;&#20197;&#19978;) &#12398;&#20351;&#12356;&#12420;&#12377;&#12373;&#12392;&#21516;&#31561;&#12398;&#27231;&#33021;&#12434;&#25345;&#12388;&#12371;&#12392;&#12434;&#30446;&#25351;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#30452;&#24863;&#30340;&#12391;&#20351;&#12356;&#12420;&#12377;&#12356;&#25805;&#20316;&#24615;&#12392;&#12356;&#12358;&#12398;&#12399; Superversion
  &#12398;&#38283;&#30330;&#12364;&#22987;&#12414;&#12387;&#12383;&#24403;&#21021;&#12363;&#12425;&#26368;&#12418;&#37325;&#35222;&#12375;&#12390;&#12365;&#12383;&#12418;&#12398;&#12391;&#12377;&#12301;
</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="canned-hosting-sites.html">&#25147;&#12427;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bug-trackers.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20184;&#37682;A Canned Hosting Sites </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#20184;&#37682;C &#12501;&#12522;&#12540;&#12394;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</td></tr></table></div></body></html>
