<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="mailing-lists.html" title="&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;"><link rel="next" href="bug-tracker.html" title="&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="mailing-lists.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="bug-tracker.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="vc"></a>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;</h2></div></div></div><p>
  <em class="firstterm">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</em>&#65288;&#12354;&#12427;&#12356;&#12399;
  <em class="firstterm">&#12522;&#12499;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</em>&#65289;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12373;&#12414;&#12374;&#12414;&#12394;&#12501;&#12449;&#12452;&#12523;&#12398;&#22793;&#26356;&#23653;&#27508;&#12434;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12398;
  &#12486;&#12463;&#12494;&#12525;&#12472;&#12540;&#12420;&#32722;&#24931;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12289;
  &#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12394;&#12393;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12398;&#23550;&#35937;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12371;&#12428;&#12414;&#12391;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12387;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#12398;&#12394;&#12425;&#12289;
  &#12414;&#12378;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12387;&#12383;&#12371;&#12392;&#12398;&#12354;&#12427;&#20154;&#12434;&#25506;&#12375;&#12390;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#24341;&#12365;&#12378;&#12426;&#36796;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12356;&#12414;&#12393;&#12365;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12394;&#12425;&#12289;
  &#23569;&#12394;&#12367;&#12392;&#12418;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12367;&#12425;&#12356;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12390;&#24403;&#28982;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12383;&#12363;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#31243;&#24230;&#12398;&#12371;&#12392;&#12377;&#12425;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12394;&#12393;&#12289;
  &#35504;&#12418;&#12414;&#12392;&#12418;&#12395;&#21462;&#12426;&#21512;&#12387;&#12390;&#12367;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12364;&#12371;&#12428;&#12411;&#12393;&#12414;&#12391;&#19968;&#33324;&#30340;&#12395;&#12394;&#12387;&#12383;&#29702;&#30001;&#12399;&#12289;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12375;&#12390;&#12356;&#12367;&#19978;&#12391;&#12356;&#12429;&#12356;&#12429;&#12394;&#22580;&#38754;&#12391;&#24441;&#31435;&#12388;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#12393;&#12358;&#12375;&#12398;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12522;&#12522;&#12540;&#12473;&#31649;&#29702;&#12289;&#12496;&#12464;&#31649;&#29702;&#12289;
  &#12467;&#12540;&#12489;&#12398;&#23433;&#23450;&#24615;&#12398;&#30906;&#20445;&#12289;&#23433;&#24515;&#12375;&#12390;&#26032;&#27231;&#33021;&#12434;&#23455;&#39443;&#12391;&#12365;&#12427;&#29872;&#22659;&#12289;
  &#21508;&#38283;&#30330;&#32773;&#12398;&#27177;&#38480;&#12398;&#31649;&#29702;&#12394;&#12393;&#12289;
  &#12354;&#12425;&#12422;&#12427;&#22580;&#38754;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12364;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#20869;&#23481;&#12434;&#19968;&#12414;&#12392;&#12417;&#12395;&#12375;&#12390;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#20013;&#24515;&#12392;&#12394;&#12427;&#27231;&#33021;&#12364;&#12289;<em class="firstterm">&#22793;&#26356;&#31649;&#29702;</em>&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;
  &#12381;&#12398;&#22793;&#26356;&#12395;&#12388;&#12356;&#12390;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#65288;&#26356;&#26032;&#26085;&#12420;&#26356;&#26032;&#32773;&#12394;&#12393;&#65289;
  &#12434;&#21454;&#38598;&#12377;&#12427;&#20181;&#32068;&#12415;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12354;&#12392;&#12363;&#12425;&#12381;&#12398;&#22793;&#26356;&#12398;&#20869;&#23481;&#12434;&#20877;&#29694;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#22793;&#26356;&#12364;&#30330;&#29983;&#12375;&#12383;&#21336;&#20301;&#12391;&#24773;&#22577;&#12434;&#31649;&#29702;&#12377;&#12427;&#20181;&#32068;&#12415;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12354;&#12425;&#12422;&#12427;&#27231;&#33021;&#12434;&#35500;&#26126;&#12377;&#12427;&#12431;&#12369;&#12395;&#12399;&#12356;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12354;&#12414;&#12426;&#12395;&#12418;&#12373;&#12414;&#12374;&#12414;&#12394;&#27231;&#33021;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#26412;&#26360;&#12391;&#12399;&#12377;&#12409;&#12390;&#12434;&#32057;&#20171;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#12399;&#12289;&#20351;&#29992;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#36984;&#25246;&#12375;&#12390;
  &#23455;&#38555;&#12395;&#31292;&#21205;&#12373;&#12379;&#12427;&#12392;&#12371;&#12429;&#12414;&#12391;&#12395;&#32094;&#12387;&#12390;&#35500;&#26126;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#29992;&#35486;&#38598;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-vocabulary"></a>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#29992;&#35486;&#38598;</h3></div></div></div><p>
  &#26412;&#26360;&#12391;&#12399;&#12289;&#12414;&#12384;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12387;&#12383;&#12371;&#12392;&#12364;&#12394;&#12356;&#20154;&#12395;&#23550;&#12375;&#12390;
  &#12381;&#12398;&#22522;&#26412;&#30340;&#12394;&#20351;&#12356;&#26041;&#12434;&#35299;&#35500;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#30693;&#12387;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#12371;&#12428;&#20197;&#38477;&#12398;&#35696;&#35542;&#12395;&#12388;&#12356;&#12390;&#12356;&#12369;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12371;&#12391;&#35500;&#26126;&#12377;&#12427;&#12461;&#12540;&#12527;&#12540;&#12489;&#12399;&#12289;&#12393;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12418;&#20849;&#36890;&#12395;&#20351;&#12431;&#12428;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#35328;&#33865;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12371;&#12428;&#20197;&#38477;&#12391;&#12418;&#12392;&#12367;&#12395;&#35500;&#26126;&#12379;&#12378;&#12395;&#20351;&#29992;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12371;&#12398;&#19990;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#22793;&#26356;&#12398;&#31649;&#29702;&#12434;&#12393;&#12358;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#21839;&#38988;&#12364;&#28040;&#12360;&#12390;&#12394;&#12367;&#12394;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#35486;&#12427;&#38555;&#12395;&#12399;&#12289;&#12371;&#12371;&#12391;&#21462;&#12426;&#19978;&#12370;&#12383;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12392;&#20415;&#21033;&#12391;&#12377;&#12290;

</p><div class="variablelist"><div class="sidebar" title='"&#12496;&#12540;&#12472;&#12519;&#12531;"&#65311;&#12381;&#12428;&#12392;&#12418;"&#12522;&#12499;&#12472;&#12519;&#12531;"&#65311;'><a name="version-vs-revision"></a><div class="titlepage"><div><div><p class="title"><b>"&#12496;&#12540;&#12472;&#12519;&#12531;"&#65311;&#12381;&#12428;&#12392;&#12418;"&#12522;&#12499;&#12472;&#12519;&#12531;"&#65311;</b></p></div></div></div><p>
    "&#12522;&#12499;&#12472;&#12519;&#12531;" &#12392;&#21516;&#12376;&#12424;&#12358;&#12394;&#24847;&#21619;&#12391; <em class="firstterm">&#12496;&#12540;&#12472;&#12519;&#12531;</em>
    &#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#20351;&#12358;&#20154;&#12418;&#12356;&#12414;&#12377;&#12364;&#12289;&#26412;&#26360;&#12398;&#20013;&#12391;&#12399;&#12371;&#12398;&#20351;&#12356;&#26041;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
    "&#12496;&#12540;&#12472;&#12519;&#12531;" &#12392;&#12356;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12522;&#12522;&#12540;&#12473;&#26178;&#12398;&#29256;&#30058;&#21495;
    (&#12383;&#12392;&#12360;&#12400; "&#12496;&#12540;&#12472;&#12519;&#12531; 1.0 &#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12414;&#12375;&#12383;" &#12394;&#12393;&#12392;&#20351;&#29992;)
    &#12392;&#28151;&#21516;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;"&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;" &#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#26082;&#12395;&#24066;&#27665;&#27177;&#12434;&#24471;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#12371;&#12398;&#35328;&#33865;&#12399;&#20351;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377; (&#26412;&#26469;&#12394;&#12425; "&#12522;&#12499;&#12472;&#12519;&#12531;&#31649;&#29702;"
    &#12420; "&#22793;&#26356;&#31649;&#29702;" &#12392;&#35328;&#12356;&#12383;&#12356;&#12392;&#12371;&#12429;&#12391;&#12377;)&#12290;
  </p></div><dl><dt><a name="vc-vocabulary-commit"></a><span class="term"><em class="firstterm">&#12467;&#12511;&#12483;&#12488;</em></span></dt><dd><p>
      &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#12371;&#12392;&#12290;&#12418;&#12358;&#23569;&#12375;&#12363;&#12375;&#12371;&#12414;&#12387;&#12390;&#35328;&#12358;&#12392;&#12289;
      &#22793;&#26356;&#12375;&#12383;&#20869;&#23481;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#26684;&#32013;&#12375;&#12289;
      &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#27425;&#12395;&#20844;&#38283;&#12377;&#12427;&#12522;&#12522;&#12540;&#12473;&#12395;&#21453;&#26144;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12290;
      "&#12467;&#12511;&#12483;&#12488;" &#12399;&#12289;&#21205;&#35422;&#12392;&#12375;&#12390;&#12418;&#21517;&#35422;&#12392;&#12375;&#12390;&#12418;&#29992;&#12356;&#12425;&#12428;&#12414;&#12377;&#12290;
      &#21517;&#35422;&#12392;&#12375;&#12390;&#20351;&#12387;&#12383;&#22580;&#21512;&#12398;&#24847;&#21619;&#12399;&#12289;"&#22793;&#26356;" &#12392;&#12411;&#12412;&#21516;&#12376;&#12391;&#12377;&#12290;
      &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;"Mac OS X
      &#19978;&#12391;&#12469;&#12540;&#12496;&#12364;&#12463;&#12521;&#12483;&#12471;&#12517;&#12377;&#12427;&#12496;&#12464;&#12434;&#20462;&#27491;&#12375;&#12390;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12290;
      &#12472;&#12455;&#12452;&#12289;&#24746;&#12356;&#12369;&#12393;&#12371;&#12398;&#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12367;&#12428;&#12394;&#12356;&#12363;&#12394;&#65311;
      &#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#12513;&#12514;&#12522;&#12434;&#30906;&#20445;&#12377;&#12427;&#26041;&#27861;&#12434;&#38291;&#36949;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12375;"
    </p></dd><dt><a name="vc-vocabulary-log-message"></a><span class="term"><em class="firstterm">&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;</em></span></dt><dd><p>
      &#21508;&#12467;&#12511;&#12483;&#12488;&#12395;&#28155;&#20184;&#12373;&#12428;&#12383;&#12467;&#12513;&#12531;&#12488;&#12391;&#12289;
      &#12381;&#12398;&#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12420;&#30446;&#30340;&#12434;&#35500;&#26126;&#12377;&#12427;&#12418;&#12398;&#12290;
      &#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20013;&#12391;
      &#26368;&#12418;&#37325;&#35201;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#23455;&#38555;&#12395;&#22793;&#26356;&#12375;&#12383;&#12467;&#12540;&#12489;&#12398;&#20869;&#23481;&#12434;
      &#20154;&#38291;&#12364;&#35501;&#12435;&#12391;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#35328;&#33865; ("&#27231;&#33021;&#36861;&#21152;"&#12289;"&#12496;&#12464;&#23550;&#24540;"&#12289;
      &#12354;&#12427;&#12356;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36914;&#25431;&#29366;&#27841;&#12394;&#12393;)
      &#12395;&#22793;&#25563;&#12377;&#12427;&#24847;&#21619;&#21512;&#12356;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12371;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12398;&#24460;&#21322;&#12391;&#12399;&#12289;
      &#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36969;&#20999;&#12394;&#12513;&#12531;&#12496;&#12540;&#12395;&#37197;&#20449;&#12377;&#12427;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;
      <span><a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a></span>
      &#12398; <a class="xref" href="growth.html#codifying-tradition" title="&#12375;&#12365;&#12383;&#12426;&#12398;&#25104;&#25991;&#21270;">&#12300;&#12375;&#12365;&#12383;&#12426;&#12398;&#25104;&#25991;&#21270;&#12301;</a> &#12391;&#12399;
      &#21508;&#12513;&#12531;&#12496;&#12540;&#12395;&#12356;&#12363;&#12395;&#12375;&#12390;&#26377;&#29992;&#12394;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26360;&#12356;&#12390;&#12418;&#12425;&#12358;&#12363;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
    </p></dd><dt><a name="vc-vocabulary-update"></a><span class="term"><em class="firstterm">&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;</em></span></dt><dd><p>
      &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#22793;&#26356; (&#12467;&#12511;&#12483;&#12488;) &#12434;&#12525;&#12540;&#12459;&#12523;&#29872;&#22659;&#12395;&#21462;&#12426;&#36796;&#12416;&#12371;&#12392;&#12290;
      &#12388;&#12414;&#12426;&#12289;&#12525;&#12540;&#12459;&#12523;&#29872;&#22659;&#12434; "&#26368;&#26032;&#29256;" &#12395;&#12377;&#12427;&#12371;&#12392;&#12290;
      &#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#38971;&#32321;&#12395;&#34892;&#12431;&#12428;&#12427;&#25805;&#20316;&#12391;&#12377;&#12290;
      &#12411;&#12392;&#12435;&#12393;&#12398;&#38283;&#30330;&#32773;&#12399;&#12289;&#33258;&#20998;&#12398;&#12467;&#12540;&#12489;&#12434;&#19968;&#26085;&#12395;&#20309;&#24230;&#12418;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;
      &#12381;&#12428;&#12395;&#12424;&#12426;&#12289;&#33258;&#20998;&#12398;&#38283;&#30330;&#29872;&#22659;&#12434;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12392;&#12411;&#12412;&#21516;&#12376;&#29366;&#24907;&#12395;&#20445;&#12388;&#12424;&#12358;&#12395;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
      &#12414;&#12383;&#12289;&#12418;&#12375;&#20309;&#12363;&#12496;&#12464;&#12434;&#35211;&#12388;&#12369;&#12383;&#12392;&#12365;&#12395;&#12289;
      &#12362;&#12381;&#12425;&#12367;&#12414;&#12384;&#12381;&#12428;&#12399;&#20462;&#27491;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12391;&#12354;&#12429;&#12358;&#12371;&#12392;&#12434;&#20104;&#24819;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
      &#12383;&#12392;&#12360;&#12400;&#27425;&#12398;&#12424;&#12358;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;"&#12397;&#12359;&#12289;&#12371;&#12398;&#12467;&#12540;&#12489;&#12387;&#12390;&#12289;
      &#12356;&#12385;&#12400;&#12435;&#26368;&#24460;&#12398;&#12496;&#12452;&#12488;&#12434;&#35501;&#12435;&#12391;&#12356;&#12394;&#12356;&#12424;&#12358;&#12395;&#35211;&#12360;&#12427;&#12435;&#12384;&#12369;&#12393;&#8230;&#8230;&#12290;
      &#12496;&#12464;&#12376;&#12419;&#12394;&#12356;&#65311;"
      "&#12358;&#12435;&#12290;&#12391;&#12418;&#12381;&#12428;&#12399;&#20808;&#36913;&#20462;&#27491;&#12375;&#12383;&#12424;&#12290;
      &#26368;&#26032;&#29256;&#12395;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12375;&#12383;&#12425;&#12496;&#12464;&#12399;&#12394;&#12367;&#12394;&#12427;&#12399;&#12378;&#12384;&#12290;"
    </p></dd><dt><a name="vc-vocabulary-repository"></a><span class="term"><em class="firstterm">&#12522;&#12509;&#12472;&#12488;&#12522;</em></span></dt><dd><p>
      &#22793;&#26356;&#20869;&#23481;&#12434;&#26684;&#32013;&#12377;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12290;
      &#12383;&#12392;&#12360;&#12400;&#20013;&#22830;&#31649;&#29702;&#26041;&#24335;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;
      &#12510;&#12473;&#12479;&#12522;&#12509;&#12472;&#12488;&#12522;&#12364;&#12402;&#12392;&#12388;&#12384;&#12369;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
      &#12377;&#12409;&#12390;&#12398;&#22793;&#26356;&#20869;&#23481;&#12364;&#12371;&#12371;&#12395;&#26684;&#32013;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#20998;&#25955;&#31649;&#29702;&#26041;&#24335;&#12398;&#22580;&#21512;&#12399;&#12289;&#21508;&#38283;&#30330;&#32773;&#12364;&#20491;&#21029;&#12395;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#25152;&#26377;&#12375;&#12414;&#12377;&#12290;
      &#20182;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12392;&#12398;&#38291;&#12398;&#12487;&#12540;&#12479;&#20132;&#25563;&#12364;&#12289;&#20219;&#24847;&#12398;&#12479;&#12452;&#12511;&#12531;&#12464;&#12391;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
      &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#21508;&#22793;&#26356;&#12398;&#20869;&#23481;&#12434;&#35352;&#37682;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12522;&#12522;&#12540;&#12473;&#26178;&#26399;&#12395;&#12399;&#12289;&#29305;&#23450;&#12398;&#26178;&#28857;&#12398;&#20869;&#23481;&#12434;&#12522;&#12522;&#12540;&#12473;&#29992;&#12392;&#12375;&#12390;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
      &#20013;&#22830;&#31649;&#29702;&#26041;&#24335;&#12392;&#20998;&#25955;&#31649;&#29702;&#26041;&#24335;&#12398;&#12393;&#12385;&#12425;&#12364;&#12424;&#12356;&#12363;&#12395;&#12388;&#12356;&#12390;&#35486;&#12426;&#12384;&#12377;&#12392;&#12289;
      &#32066;&#12431;&#12426;&#12398;&#12394;&#12356;&#23447;&#25945;&#25126;&#20105;&#12395;&#24059;&#12365;&#36796;&#12414;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
      &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12399;&#12289;
      &#12391;&#12365;&#12427;&#12384;&#12369;&#12371;&#12398;&#21839;&#38988;&#12395;&#12399;&#35302;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    </p></dd><dt><a name="vc-vocabulary-checkout"></a><span class="term"><em class="firstterm">&#12481;&#12455;&#12483;&#12463;&#12450;&#12454;&#12488;</em></span></dt><dd><p>
      &#12522;&#12509;&#12472;&#12488;&#12522;&#12363;&#12425;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20869;&#23481;&#12434;&#21462;&#24471;&#12377;&#12427;&#20966;&#29702;&#12290;
      &#12481;&#12455;&#12483;&#12463;&#12450;&#12454;&#12488;&#12434;&#34892;&#12358;&#12392;&#12289;&#12356;&#12431;&#12422;&#12427;&#12300;&#20316;&#26989;&#12467;&#12500;&#12540;&#12301;
      &#65288;&#27425;&#12398;&#38917;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#65289;&#12392;&#21628;&#12400;&#12428;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
      &#12371;&#12398;&#12484;&#12522;&#12540;&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12383;&#32080;&#26524;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12289;&#20803;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#21453;&#26144;&#12373;&#12379;&#12414;&#12377;&#12290;
      &#20998;&#25955;&#22411;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#12395;&#12399;&#12289;
      &#20316;&#26989;&#12467;&#12500;&#12540;&#12381;&#12398;&#12418;&#12398;&#12364;&#12522;&#12509;&#12472;&#12488;&#12522;&#12391;&#12418;&#12354;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12381;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#12289;&#20182;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12392;&#12398;&#38291;&#12391;&#12420;&#12426;&#12392;&#12426;&#12375;&#12383;&#12426;&#12377;&#12427;&#27083;&#36896;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    </p></dd><dt><a name="vc-vocabulary-working-copy"></a><span class="term"><em class="firstterm">&#20316;&#26989;&#12467;&#12500;&#12540;</em></span></dt><dd><p>
      &#38283;&#30330;&#32773;&#12364;&#12525;&#12540;&#12459;&#12523;&#29872;&#22659;&#12395;&#20445;&#25345;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12484;&#12522;&#12540;&#12391;&#12289;
      &#12371;&#12398;&#20013;&#12395;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12420;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12289;
      &#12381;&#12398;&#20182;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#20316;&#26989;&#12467;&#12500;&#12540;&#12395;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#20351;&#29992;&#12377;&#12427;&#12513;&#12479;&#12487;&#12540;&#12479;&#12418;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#12371;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12398;&#20013;&#12395;&#12399;&#12289;&#21462;&#24471;&#20803;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#22580;&#25152;&#12420;&#29694;&#22312;&#12398;
      "&#12522;&#12499;&#12472;&#12519;&#12531;"&#65288;&#27425;&#12398;&#38917;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#65289;&#12394;&#12393;&#12395;&#12388;&#12356;&#12390;&#12398;&#24773;&#22577;&#12364;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#19968;&#33324;&#12395;&#12289;&#20491;&#12293;&#12398;&#38283;&#30330;&#32773;&#12399;&#33258;&#20998;&#12398;&#20316;&#26989;&#12467;&#12500;&#12540;&#12434;&#21462;&#24471;&#12375;&#12390;&#12381;&#12371;&#12391;&#38283;&#30330;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
      &#12381;&#12375;&#12390;&#12289;&#22793;&#26356;&#12375;&#12383;&#20869;&#23481;&#12398;&#12486;&#12473;&#12488;&#12434;&#28168;&#12414;&#12379;&#12383;&#12358;&#12360;&#12391;
      &#12381;&#12428;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12414;&#12377;&#12290;
    </p></dd><dt><a name="vc-vocabulary-revision"></a><span class="term"><em class="firstterm">&#12522;&#12499;&#12472;&#12519;&#12531;</em>&#12289;
        <em class="firstterm">&#12481;&#12455;&#12531;&#12472;</em>&#12289;
        <em class="firstterm">&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;</em></span></dt><dd><p>
      "&#12522;&#12499;&#12472;&#12519;&#12531;" &#12392;&#12399;&#12289;&#25351;&#23450;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12420;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;
      &#29305;&#23450;&#12398;&#26178;&#28857;&#12398;&#29366;&#24907;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
      &#12383;&#12392;&#12360;&#12400;&#12289;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12501;&#12449;&#12452;&#12523; F &#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12364; 6
      &#12391;&#12354;&#12387;&#12383;&#22580;&#21512;&#12395;&#12289;&#35504;&#12363;&#12364;&#12501;&#12449;&#12452;&#12523; F &#12434;&#22793;&#26356;&#12375;&#12390;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12392;&#12289;
      F &#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12399; 7 &#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#19968;&#24230;&#12395;&#34892;&#12431;&#12428;&#12383;&#12354;&#12427;&#29305;&#23450;&#12398;&#22793;&#26356;&#32676;&#12434;&#31216;&#12375;&#12390;
      "&#12522;&#12499;&#12472;&#12519;&#12531;"&#12289;"&#12481;&#12455;&#12531;&#12472;" &#12354;&#12427;&#12356;&#12399; "&#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;"
      &#12392;&#12377;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    </p><p>
      &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
      &#12371;&#12428;&#12425;&#12398;&#29992;&#35486;&#12434;&#26126;&#30906;&#12395;&#23450;&#32681;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12375;&#12363;&#12375;&#12289;&#19968;&#33324;&#30340;&#12394;&#32771;&#12360;&#26041;&#12399;&#12393;&#12428;&#12418;&#21516;&#12376;&#12391;&#12377;&#12290;
      &#19968;&#36899;&#12398;&#27969;&#12428;&#12398;&#20013;&#12398;&#29305;&#23450;&#12398;&#26178;&#28857;
      (&#12496;&#12464;&#20462;&#27491;&#12364;&#34892;&#12431;&#12428;&#12383;&#31623;&#25152;&#12394;&#12393;)
      &#12434;&#25351;&#23450;&#12377;&#12427;&#26041;&#27861;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
      &#12383;&#12392;&#12360;&#12400;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
      "&#12354;&#12354;&#12289;&#12381;&#12428;&#12394;&#12425;&#24444;&#22899;&#12364;&#12522;&#12499;&#12472;&#12519;&#12531; 10 &#12391;&#20462;&#27491;&#12375;&#12383;&#12424;&#12290;"
      &#12354;&#12427;&#12356;&#12399;
      "&#24444;&#22899;&#12399; foo.c &#12398;&#12522;&#12499;&#12472;&#12519;&#12531;10&#12391;&#12381;&#12428;&#12434;&#20462;&#27491;&#12375;&#12383;&#12424;&#12290;"
    </p><p>
      &#29305;&#23450;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#25351;&#23450;&#12379;&#12378;&#12395;&#35441;&#12434;&#36914;&#12417;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
      &#19968;&#33324;&#12395;&#26368;&#26032;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#35486;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#32771;&#12360;&#12390;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    </p></dd><dt><a name="vc-vocabulary-diff"></a><span class="term"><em class="firstterm">&#24046;&#20998;</em></span></dt><dd><p>
      &#22793;&#26356;&#20869;&#23481;&#12434;&#34920;&#12377;&#12486;&#12461;&#12473;&#12488;&#12290;
      &#22793;&#26356;&#12364;&#12354;&#12387;&#12383;&#31623;&#25152;&#12392;&#12381;&#12398;&#21069;&#24460;&#25968;&#34892;&#12395;&#12388;&#12356;&#12390;&#12289;
      &#22793;&#26356;&#21069;&#12392;&#22793;&#26356;&#24460;&#12398;&#29366;&#24907;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
      &#20803;&#12398;&#12467;&#12540;&#12489;&#12395;&#12394;&#12376;&#12415;&#12364;&#12354;&#12427;&#20154;&#12394;&#12425;&#12289;
      &#24046;&#20998;&#12434;&#35211;&#12428;&#12400;&#12393;&#12371;&#12434;&#12393;&#12358;&#22793;&#26356;&#12375;&#12383;&#12398;&#12363;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
      &#26178;&#12395;&#12399;&#12496;&#12464;&#12434;&#35211;&#12388;&#12369;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    </p></dd><dt><a name="vc-vocabulary-tag"></a><span class="term"><em class="firstterm">&#12479;&#12464;</em></span></dt><dd><p>
      &#25351;&#23450;&#12375;&#12383;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#27083;&#25104;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12395;&#12388;&#12369;&#12427;&#12521;&#12505;&#12523;&#12290;&#12479;&#12464;&#12399;&#12289;
      &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#29305;&#31558;&#12377;&#12409;&#12365;&#26178;&#28857;&#12398;&#29366;&#24907;&#12434;&#20445;&#35703;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#29305;&#31558;&#12377;&#12409;&#12365;&#28857;&#12392;&#12399;&#12289;&#12383;&#12392;&#12360;&#12400;&#19968;&#33324;&#21521;&#12369;&#12398;&#12522;&#12522;&#12540;&#12473;&#12394;&#12393;&#12364;&#12354;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290;
      &#12522;&#12522;&#12540;&#12473;&#12372;&#12392;&#12395;&#12479;&#12464;&#12434;&#12388;&#12369;&#12390;&#12362;&#12369;&#12400;&#12289;
      &#12381;&#12398;&#12522;&#12522;&#12540;&#12473;&#12392;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#20869;&#23481;&#12398;&#12501;&#12449;&#12452;&#12523;&#32676;&#12434;
      &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12363;&#12425;&#31777;&#21336;&#12395;&#21462;&#24471;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
      &#12479;&#12464;&#12398;&#21517;&#21069;&#12392;&#12375;&#12390;&#12424;&#12367;&#29992;&#12356;&#12425;&#12428;&#12427;&#12398;&#12399;&#12289;
      <code class="literal">Release_1_0</code> &#12420;
      <code class="literal">Delivery_00456</code> &#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
    </p></dd><dt><a name="vc-vocabulary-branch"></a><span class="term"><em class="firstterm">&#12502;&#12521;&#12531;&#12481;</em></span></dt><dd><p>
      &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#19968;&#37096;&#12391;&#12354;&#12426;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#19979;&#12395;&#23384;&#22312;&#12377;&#12427;&#12364;&#12289;
      &#20182;&#12392;&#12399;&#38548;&#38626;&#12373;&#12428;&#12390;&#12356;&#12427;&#37096;&#20998;&#12290;&#12502;&#12521;&#12531;&#12481;&#12395;&#23550;&#12375;&#12390;&#36969;&#29992;&#12375;&#12383;&#22793;&#26356;&#12399;
      &#12381;&#12398;&#20182;&#12398;&#37096;&#20998;&#12395;&#23550;&#12375;&#12390;&#12399;&#24433;&#38911;&#12434;&#12362;&#12424;&#12412;&#12375;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#36870;&#12418;&#21516;&#27096;&#12391;&#12377;&#12290;
      &#12383;&#12384;&#12375;&#12289;&#26126;&#31034;&#30340;&#12395; "&#12510;&#12540;&#12472;" &#12375;&#12383;&#22580;&#21512;&#12399;&#21029;&#12391;&#12377; (&#20197;&#19979;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;)&#12290;
      &#12502;&#12521;&#12531;&#12481;&#12399;&#12289;"&#38283;&#30330;&#12521;&#12452;&#12531;" &#12392;&#21628;&#12400;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#26126;&#31034;&#30340;&#12395;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12391;&#12418;&#12289;
      "&#12513;&#12452;&#12531;&#12502;&#12521;&#12531;&#12481;" &#12391;&#38283;&#30330;&#12434;&#36914;&#12417;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#32771;&#12360;&#12414;&#12377;&#12290;&#12371;&#12398;&#12502;&#12521;&#12531;&#12481;&#12398;&#12371;&#12392;&#12399;
      "&#12513;&#12452;&#12531;&#12521;&#12452;&#12531;" &#12354;&#12427;&#12356;&#12399; "<em class="firstterm">&#12488;&#12521;&#12531;&#12463; (trunk)</em>"
      &#12392;&#21628;&#12400;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;
    </p><p>
    &#12502;&#12521;&#12531;&#12481;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#35079;&#25968;&#12398;&#38283;&#30330;&#12521;&#12452;&#12531;&#12434;&#21029;&#12293;&#12395;&#31649;&#29702;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;&#26412;&#27969;&#12398;&#38283;&#30330;&#12521;&#12452;&#12531;&#12392;&#12399;&#21029;&#12395;&#23455;&#39443;&#30340;&#12394;&#38283;&#30330;&#29992;&#12398;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12375;&#12289;
    &#26412;&#27969;&#12434;&#19981;&#23433;&#23450;&#12395;&#12373;&#12379;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12424;&#12358;&#12394;&#38283;&#30330;&#12399;&#12381;&#12385;&#12425;&#12391;&#34892;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12354;&#12427;&#12356;&#12399;&#36870;&#12395;&#12289;&#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#29992;&#12398;&#23433;&#23450;&#29256;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#20351;&#29992;&#27861;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#26041;&#24335;&#12398;&#22580;&#21512;&#12289;&#12522;&#12522;&#12540;&#12473;&#12364;&#38291;&#36817;&#12395;&#36843;&#12387;&#12390;&#12418;&#12289;
    &#36890;&#24120;&#12398;&#38283;&#30330;&#12399;&#26412;&#27969;&#12502;&#12521;&#12531;&#12481;&#19978;&#12391;&#36884;&#20999;&#12428;&#12394;&#12367;&#32154;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;
    &#19968;&#26041;&#12289;&#12522;&#12522;&#12540;&#12473;&#29992;&#12502;&#12521;&#12531;&#12481;&#12391;&#12399;&#12522;&#12522;&#12540;&#12473;&#20316;&#26989;&#12395;&#20837;&#12387;&#12383;&#27573;&#38542;&#12391;&#12467;&#12511;&#12483;&#12488;&#12434;&#20572;&#27490;&#12375;&#12289;
    &#12522;&#12522;&#12540;&#12473;&#31649;&#29702;&#32773;&#12364;&#35377;&#21487;&#12375;&#12394;&#12356;&#38480;&#12426;&#12399;&#12467;&#12511;&#12483;&#12488;&#12434;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#12371;&#12398;&#26041;&#24335;&#12434;&#25505;&#29992;&#12377;&#12427;&#12392;&#12289;&#12522;&#12522;&#12540;&#12473;&#21069;&#12395;&#12356;&#12387;&#12383;&#12435;&#38283;&#30330;&#12434;&#20013;&#26029;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12502;&#12521;&#12531;&#12481;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399;&#12289;<span>&#26412;&#31456;&#12398;&#24460;&#21322;</span>
    &#12395;&#12354;&#12427; <a class="xref" href="vc.html#branches" title="&#12502;&#12521;&#12531;&#12481;&#12398;&#27963;&#29992;">&#12300;&#12502;&#12521;&#12531;&#12481;&#12398;&#27963;&#29992;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
  </p></dd><dt><a name="vc-vocabulary-merge"></a><span class="term"><em class="firstterm">&#12510;&#12540;&#12472; (&#12354;&#12427;&#12356;&#12399;&#12509;&#12540;&#12488;)</em></span></dt><dd><p>
      &#22793;&#26356;&#20869;&#23481;&#12434;&#12289;&#12354;&#12427;&#12502;&#12521;&#12531;&#12481;&#12363;&#12425;&#21029;&#12398;&#12502;&#12521;&#12531;&#12481;&#12395;&#31227;&#21205;&#12377;&#12427;&#12371;&#12392;&#12290;
      &#26412;&#27969;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#20182;&#12398;&#12502;&#12521;&#12531;&#12481;&#12395;&#36969;&#29992;&#12375;&#12383;&#12426;&#12289;&#12381;&#12398;&#36870;&#12434;&#34892;&#12387;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12418;&#21547;&#12415;&#12414;&#12377;&#12290;
      &#23455;&#38555;&#12398;&#12392;&#12371;&#12429;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12510;&#12540;&#12472;&#20316;&#26989;&#12399;&#12371;&#12398;&#12497;&#12479;&#12540;&#12531;&#12391;&#12377;&#12290;
      &#26412;&#27969;&#20197;&#22806;&#12398;&#65298;&#12388;&#12398;&#12502;&#12521;&#12531;&#12481;&#38291;&#12391;&#12398;&#12510;&#12540;&#12472;&#12399;&#12411;&#12392;&#12435;&#12393;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
      &#12371;&#12398;&#25163;&#12398;&#12510;&#12540;&#12472;&#12395;&#12388;&#12356;&#12390;&#12399;
      <a class="xref" href="vc.html#vc-singularity" title="&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;">&#12300;&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
    </p><p>
      "&#12510;&#12540;&#12472;" &#12395;&#12399;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#24847;&#21619;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12402;&#12392;&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#23550;&#12375;&#12390;&#35079;&#25968;&#20154;&#12364;&#21029;&#12293;&#12398;&#31623;&#25152;&#12434;&#22793;&#26356;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;
      &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#34892;&#12358;&#20966;&#29702;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
      &#12362;&#20114;&#12356;&#12398;&#22793;&#26356;&#12364;&#30456;&#25163;&#12398;&#22793;&#26356;&#12434;&#37034;&#39764;&#12377;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12398;&#12391;&#12289;
      &#25163;&#20803;&#12391;&#20462;&#27491;&#28168;&#12415;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12377;&#12427;&#12392;&#12289;
      &#30456;&#25163;&#12398;&#22793;&#26356;&#20869;&#23481;&#12364;&#33258;&#21205;&#30340;&#12395;&#12510;&#12540;&#12472;&#12373;&#12428;&#65288;&#21462;&#12426;&#36796;&#12414;&#12428;&#65289;&#12414;&#12377;&#12290;
      &#12371;&#12428;&#12399;&#12289;&#35079;&#25968;&#12398;&#20154;&#12364;&#21516;&#12376;&#12501;&#12449;&#12452;&#12523;&#12434;&#12495;&#12483;&#12463;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12424;&#12367;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
      &#19975;&#19968;&#12362;&#20114;&#12356;&#12364;&#22793;&#26356;&#12375;&#12383;&#31623;&#25152;&#12364;&#37325;&#12394;&#12387;&#12390;&#12356;&#12383;&#22580;&#21512;&#12399;&#12289;&#27425;&#12395;&#35500;&#26126;&#12377;&#12427;
      "&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;" &#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    </p></dd><dt><a name="vc-vocabulary-conflict"></a><span class="term"><em class="firstterm">&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;</em></span></dt><dd><p>
      &#12402;&#12392;&#12388;&#12398;&#12467;&#12540;&#12489;&#12398;&#21516;&#12376;&#31623;&#25152;&#12434;&#30064;&#12394;&#12427;&#20154;&#12364;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#38555;&#12395;&#36215;&#12371;&#12427;&#29694;&#35937;&#12290;
      &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;&#12398;&#30330;&#29983;&#12434;&#33258;&#21205;&#30340;&#12395;&#26908;&#20986;&#12375;&#12414;&#12377;&#12290;
      &#12381;&#12375;&#12390;&#12289;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12381;&#12428;&#12434;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;
      &#30330;&#29983;&#12375;&#12383;&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;&#12434; <em class="firstterm">&#35299;&#27770;</em>
      &#12377;&#12427;&#12398;&#12399;&#12289;&#22793;&#26356;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#20154;&#12383;&#12385;&#33258;&#36523;&#12398;&#36012;&#20219;&#12391;&#12377;&#12290;
      &#35299;&#27770;&#12375;&#12383;&#12354;&#12392;&#12391;&#12289;&#12381;&#12428;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;
    </p></dd><dt><a name="vc-vocabulary-lock"></a><span class="term"><em class="firstterm">&#12525;&#12483;&#12463;</em></span></dt><dd><p>
      &#29305;&#23450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12420;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#12289;&#20182;&#20154;&#12395;&#22793;&#26356;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#23459;&#35328;&#12377;&#12427;&#26041;&#27861;&#12290;
      &#12383;&#12392;&#12360;&#12400; "&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12369;&#12393;&#12391;&#12365;&#12394;&#12356;&#12290;
      &#12383;&#12406;&#12435;&#12289;Alfred &#12364;&#32972;&#26223;&#30011;&#20687;&#12434;&#20462;&#27491;&#12377;&#12427;&#38291;&#12289;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12483;&#12463;&#12375;&#12390;&#12356;&#12427;&#12435;&#12384;&#12429;&#12358;"
      &#12392;&#12356;&#12358;&#12424;&#12358;&#12395;&#20351;&#12356;&#12414;&#12377;&#12290;
      &#20013;&#12395;&#12399;&#12525;&#12483;&#12463;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
      &#12414;&#12383;&#12289;&#12381;&#12398;&#27231;&#33021;&#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#23455;&#38555;&#12395;&#12381;&#12428;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12371;&#12392;&#12399;&#12354;&#12414;&#12426;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
      &#12356;&#12429;&#12435;&#12394;&#20154;&#12364;&#21516;&#26178;&#12395;&#24179;&#34892;&#12375;&#12390;&#38283;&#30330;&#12434;&#36914;&#12417;&#12427;&#12392;&#12356;&#12358;&#12398;&#12364;&#26222;&#36890;&#12398;&#29366;&#27841;&#12394;&#12398;&#12391;&#12354;&#12426;&#12289;
      &#12525;&#12483;&#12463;&#12375;&#12390;&#20182;&#20154;&#12434;&#32224;&#12417;&#20986;&#12377;&#12392;&#12356;&#12358;&#12398;&#12399;&#12371;&#12398;&#29702;&#24819;&#12395;&#30456;&#21453;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    </p><p>
      &#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12395;&#12399;&#12525;&#12483;&#12463;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12371;&#12392;&#12434;&#12289;
      &#12300;<em class="firstterm">&#12525;&#12483;&#12463; - &#20462;&#27491; - &#12525;&#12483;&#12463;&#35299;&#38500; (lock-modify-unlock)</em> &#12514;&#12487;&#12523;&#12301;
      &#12392;&#12356;&#12356;&#12414;&#12377;&#12290;&#19968;&#26041;&#12289;&#12525;&#12483;&#12463;&#12364;&#24517;&#35201;&#12391;&#12394;&#12356;&#26041;&#24335;&#12398;&#12371;&#12392;&#12399;
      &#12300;<em class="firstterm">&#12467;&#12500;&#12540; - &#20462;&#27491; - &#12510;&#12540;&#12472; (copy-modify-merge)</em> &#12514;&#12487;&#12523;&#12301;
      &#12392;&#12356;&#12356;&#12414;&#12377;&#12290;&#65298;&#12388;&#12398;&#26041;&#24335;&#12395;&#12388;&#12356;&#12390;&#28145;&#12367;&#25496;&#12426;&#19979;&#12370;&#12390;&#27604;&#36611;&#12375;&#12383;&#12377;&#12400;&#12425;&#12375;&#12356;&#25991;&#26360;&#12364;
      <a class="ulink" href="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html" target="_top">http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html</a>
      &#65288;<a class="ulink" href="http://subversion.bluegate.org/doc/ch02s02.html" target="_top">&#26085;&#26412;&#35486;&#35379;</a>&#65289;
      &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#19968;&#33324;&#12395;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#38283;&#30330;&#12395;&#12362;&#12356;&#12390;&#12399;
      &#12467;&#12500;&#12540; - &#20462;&#27491; - &#12510;&#12540;&#12472; &#12514;&#12487;&#12523;&#12398;&#26041;&#12364;&#36969;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      &#26412;&#26360;&#12391;&#25201;&#12358;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12371;&#12398;&#26041;&#24335;&#12434;&#25505;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    </p></dd></dl></div><p>

</p></div><div class="sect2" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#36984;&#25246;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-choosing"></a>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#36984;&#25246;</h3></div></div></div><p>
  &#26412;&#26360;&#12398;&#22519;&#31558;&#26178;&#28857;&#12391;&#12399;&#12289;
  &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#19990;&#30028;&#12391;&#26368;&#12418;&#12424;&#12367;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;
  <em class="firstterm">Concurrent Versions System</em>
  (<em class="firstterm">CVS</em>, <a class="ulink" href="http://www.cvshome.org/" target="_top">http://www.cvshome.org/</a>)
  &#12392; <em class="firstterm">Subversion</em> (<em class="firstterm">SVN</em>,
  <a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>) &#12398;&#65298;&#12388;&#12391;&#12377;&#12290;
</p><p>
  CVS &#12395;&#12399;&#38263;&#12356;&#27508;&#21490;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12505;&#12486;&#12521;&#12531;&#12398;&#38283;&#30330;&#32773;&#12399;&#12377;&#12391;&#12395; CVS &#12395;&#12388;&#12356;&#12390;&#12399;&#12424;&#12367;&#12372;&#23384;&#30693;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12414;&#12391;&#12395;&#12418; CVS &#12364;&#12356;&#12429;&#12356;&#12429;&#12394;&#22580;&#38754;&#12391;&#24441;&#12395;&#31435;&#12387;&#12390;&#12365;&#12383;&#12399;&#12378;&#12391;&#12377;&#12290;
  CVS &#12398;&#26178;&#20195;&#12364;&#12354;&#12414;&#12426;&#12395;&#12418;&#38263;&#12367;&#32154;&#12356;&#12390;&#12365;&#12383;&#12398;&#12391;&#12289;
  &#26412;&#24403;&#12395;&#12381;&#12428;&#12364;&#26368;&#36969;&#12394;&#36984;&#25246;&#32930;&#12384;&#12387;&#12383;&#12398;&#12363;&#12393;&#12358;&#12363;&#12394;&#12435;&#12390;&#32862;&#12367;&#12384;&#12369;&#37326;&#26286;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;CVS &#12395;&#12399;&#27424;&#28857;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#35079;&#25968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#19968;&#25324;&#12375;&#12390;&#22793;&#26356;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#12381;&#12428;&#12434;&#36861;&#12356;&#12363;&#12369;&#12427;&#31777;&#21336;&#12394;&#25163;&#27573;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#19979;&#12395;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#22793;&#12360;&#12383;&#12426;&#12467;&#12500;&#12540;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;
  &#65288;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#12356;&#12387;&#12383;&#12435;&#38283;&#22987;&#12375;&#12383;&#24460;&#12391;&#12467;&#12540;&#12489;&#12484;&#12522;&#12540;&#12398;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;
  &#27875;&#12365;&#12394;&#12364;&#12425;&#22823;&#22793;&#12394;&#20316;&#26989;&#12434;&#12371;&#12394;&#12377;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;)&#12290;
  &#12381;&#12375;&#12390;&#12289;&#12510;&#12540;&#12472;&#27231;&#33021;&#12399;&#12363;&#12394;&#12426;&#12362;&#31895;&#26411;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#24040;&#22823;&#12394;&#12501;&#12449;&#12452;&#12523;&#12420;&#12496;&#12452;&#12490;&#12522;&#12501;&#12449;&#12452;&#12523;&#12398;&#25201;&#12356;&#12418;&#19981;&#24471;&#24847;&#12391;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#22823;&#37327;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#19968;&#25324;&#12375;&#12390;&#25805;&#20316;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#38750;&#24120;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  CVS &#12398;&#12371;&#12428;&#12425;&#12398;&#27424;&#28857;&#12399;&#27770;&#12375;&#12390;&#33268;&#21629;&#30340;&#12394;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
  &#28961;&#35222;&#12391;&#12365;&#12427;&#12418;&#12398;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12371;&#25968;&#24180;&#12289;&#26032;&#12383;&#12395;&#31435;&#12385;&#19978;&#12370;&#12425;&#12428;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;
  Subversion &#12434;&#25505;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#22810;&#12367;&#12394;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;
  <sup>[<a name="idp916384" href="#ftn.idp916384" class="footnote">18</a>]</sup>&#12290;
  &#12371;&#12428;&#12363;&#12425;&#26032;&#12383;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#12398;&#12394;&#12425;&#12289;Subversion &#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#19968;&#26041;&#12289;&#31169;&#12364; Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12289;
  &#31169;&#12398;&#24847;&#35211;&#12398;&#23458;&#35251;&#24615;&#12395;&#30097;&#21839;&#12434;&#25345;&#12383;&#12428;&#12427;&#26041;&#12418;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12371;&#25968;&#24180;&#12289;&#26032;&#12383;&#12394;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#12356;&#12367;&#12388;&#12363;&#30331;&#22580;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  <a class="xref" href="vc-systems.html" title="&#20184;&#37682;B &#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;">&#20184;&#37682;B <i>&#12501;&#12522;&#12540;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</i></a> &#12395;&#12289;
  &#31169;&#12364;&#30693;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12434;&#25369;&#12370;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12522;&#12473;&#12488;&#12434;&#35211;&#12390;&#12418;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12393;&#12428;&#12434;&#25505;&#29992;&#12377;&#12427;&#12363;&#12434;&#27770;&#12417;&#12427;&#12395;&#12399;&#12289;
  &#19979;&#25163;&#12375;&#12383;&#12425;&#19968;&#29983;&#12363;&#12363;&#12387;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12418;&#12375;&#12363;&#12375;&#12383;&#12425;&#12289;&#12354;&#12394;&#12383;&#12395;&#12399;&#36984;&#25246;&#12398;&#20313;&#22320;&#12364;&#12394;&#12356;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12392;&#12356;&#12358;&#12398;&#12399;&#12289;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;
  &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#20596;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#12354;&#12394;&#12383;&#12364;&#33258;&#20998;&#12391;&#36984;&#25246;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#31435;&#22580;&#12395;&#12394;&#12387;&#12383;&#12398;&#12394;&#12425;&#12289;
  &#12414;&#12378;&#21608;&#12426;&#12398;&#24847;&#35211;&#12434;&#12424;&#12367;&#32862;&#12356;&#12390;&#12363;&#12425;&#12393;&#12428;&#12363;&#12402;&#12392;&#12388;&#12434;&#36984;&#25246;&#12375;&#12289;
  &#12381;&#12375;&#12390;&#21205;&#12363;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#26368;&#36817;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399;&#12289;&#12393;&#12428;&#12418;&#12381;&#12428;&#12394;&#12426;&#12395;&#27231;&#33021;&#12375;&#12414;&#12377;&#12290;
  &#12393;&#12428;&#12434;&#36984;&#12435;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;&#33268;&#21629;&#30340;&#12394;&#34987;&#23475;&#12434;&#21463;&#12369;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#12414;&#12384;&#36855;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;Subversion &#12434;&#20351;&#12387;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#31777;&#21336;&#12395;&#32722;&#24471;&#12391;&#12365;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#20170;&#24460;&#25968;&#24180;&#12399;&#27161;&#28310;&#30340;&#12395;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect2" title="&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#20351;&#29992;&#27861;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-using"></a>&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#20351;&#29992;&#27861;</h3></div></div></div><p>
  &#12371;&#12398;&#31456;&#12391;&#35500;&#26126;&#12377;&#12427;&#20869;&#23481;&#12399;&#12289;&#29305;&#23450;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#22266;&#26377;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12393;&#12398;&#12471;&#12473;&#12486;&#12512;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12395;&#12418;&#36969;&#29992;&#12391;&#12365;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#35443;&#32048;&#12399;&#12289;&#21508;&#12471;&#12473;&#12486;&#12512;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#35519;&#12409;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect3" title="&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="version-everything"></a>&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;</h4></div></div></div><p>
  &#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12289;FAQ&#12289;&#35373;&#35336;&#12513;&#12514;&#12394;&#12393;&#12394;&#12393;&#12289;
  &#32232;&#38598;&#12377;&#12427;&#21487;&#33021;&#24615;&#12398;&#12354;&#12427;&#12418;&#12398;&#12399;&#12377;&#12409;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#19979;&#12395;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12425;&#12399;&#12289;&#21516;&#19968;&#12522;&#12509;&#12472;&#12488;&#12522;&#12484;&#12522;&#12540;&#20869;&#12391;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#38563;&#12395;&#32622;&#12356;&#12390;&#12362;&#12365;&#12414;&#12377;&#12290;
  &#26360;&#12365;&#27531;&#12375;&#12383;&#24773;&#22577;&#12399;&#12289;&#12377;&#12409;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#20385;&#20516;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12354;&#12425;&#12422;&#12427;&#24773;&#22577;&#12399;&#22793;&#21270;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#20170;&#24460;&#22793;&#12431;&#12426;&#12424;&#12358;&#12398;&#12394;&#12356;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12391;&#12399;&#12394;&#12367;&#12450;&#12540;&#12459;&#12452;&#12502;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#25237;&#31295;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12399;&#12289;&#22793;&#12431;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12375;&#12390;&#12418;&#28961;&#24847;&#21619;&#12391;&#12377;
  (&#12418;&#12385;&#12429;&#12435;&#12289;&#12381;&#12428;&#12364;&#24040;&#22823;&#12394;&#25991;&#26360;&#12398;&#19968;&#37096;&#12392;&#12394;&#12427;&#22580;&#21512;&#12394;&#12393;&#12399;&#21029;&#12391;&#12377;&#12364;)&#12290;
</p><p>
  &#12377;&#12409;&#12390;&#12434;&#21516;&#12376;&#22580;&#25152;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#29702;&#30001;&#12399;&#12289;
  &#12381;&#12358;&#12375;&#12390;&#12362;&#12369;&#12400;&#20316;&#26989;&#12395;&#21442;&#21152;&#12377;&#12427;&#20154;&#12364;&#12402;&#12392;&#12388;&#12398;&#12371;&#12392;&#12434;&#35226;&#12360;&#12427;&#12384;&#12369;&#12391;&#12377;&#12416;&#12424;&#12358;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#26368;&#21021;&#12399;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12420;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20462;&#27491;&#12363;&#12425;&#21442;&#21152;&#12375;&#12399;&#12376;&#12417;&#12383;&#12513;&#12531;&#12496;&#12540;&#12364;&#12289;
  &#24460;&#12395;&#12467;&#12540;&#12489;&#12381;&#12398;&#12418;&#12398;&#12398;&#20462;&#27491;&#12395;&#12418;&#21442;&#21152;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12434;&#21516;&#12376;&#20181;&#32068;&#12415;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12375;&#12390;&#12362;&#12369;&#12400;&#12289;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#26032;&#12383;&#12395;&#12381;&#12398;&#20351;&#29992;&#27861;&#12434;&#23398;&#12406;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#26032;&#27231;&#33021;&#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12418;&#26356;&#26032;&#12375;&#12383;&#12426;&#12289;
  &#12467;&#12540;&#12489;&#12398;&#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12502;&#12521;&#12531;&#12481;&#12418;&#20316;&#25104;&#12375;&#12383;&#12426;
  &#12392;&#12356;&#12387;&#12383;&#38555;&#12395;&#12418;&#20415;&#21033;&#12391;&#12377;&#12290;
</p><p>
  <em class="firstterm">&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;</em> &#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#32020;&#31883;&#12395;&#32232;&#38598;&#21487;&#33021;&#12394;&#12487;&#12540;&#12479;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#21029;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12427;&#12418;&#12398;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12289;&#12499;&#12523;&#12489;&#12471;&#12473;&#12486;&#12512;&#12391;&#12424;&#12367;&#29992;&#12356;&#12425;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523; <code class="filename">configure</code>
  &#12399;&#12289;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488; <code class="filename">configure.in</code>
  &#12398;&#20869;&#23481;&#12434;&#12418;&#12392;&#12395;&#12375;&#12390;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#12418;&#12375; <code class="filename">configure</code>
  &#12434;&#22793;&#26356;&#12375;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;<code class="filename">configure.in</code>
  &#12434;&#32232;&#38598;&#12375;&#12390;&#12363;&#12425;&#20877;&#29983;&#25104;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12371;&#12398;&#22580;&#21512;&#12391;&#35328;&#12358;
  &#12300;&#30495;&#12395;&#32232;&#38598;&#21487;&#33021;&#12394;&#12501;&#12449;&#12452;&#12523;&#12301;&#12399;&#12289;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12391;&#12354;&#12427; <code class="filename">configure.in</code>
  &#12384;&#12369;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12398;&#12399;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12384;&#12369;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#29983;&#25104;&#12375;&#12383;&#32080;&#26524;&#12414;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
  &#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12434;&#20462;&#27491;&#12375;&#12383;&#38555;&#12395;&#12501;&#12449;&#12452;&#12523;&#12434;&#20877;&#29983;&#25104;&#12377;&#12427;&#12371;&#12392;&#12434;&#24536;&#12428;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12377;&#12427;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#25972;&#21512;&#24615;&#12364;&#21462;&#12428;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#28151;&#20081;&#12398;&#20803;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  <sup>[<a name="idp1005552" href="#ftn.idp1005552" class="footnote">19</a>]</sup>
</p><p>
  &#12300;&#32232;&#38598;&#21487;&#33021;&#12394;&#12487;&#12540;&#12479;&#12399;&#12377;&#12409;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#19979;&#12395;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12301;
  &#12392;&#12356;&#12358;&#35215;&#21063;&#12395;&#12399;&#12289;&#27531;&#24565;&#12394;&#12364;&#12425;&#12402;&#12392;&#12388;&#12384;&#12369;&#20363;&#22806;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12428;&#12364; &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512; &#12391;&#12377;&#12290;
  &#12496;&#12464;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12399;&#32232;&#38598;&#21487;&#33021;&#12394;&#12487;&#12540;&#12479;&#12434;&#22823;&#37327;&#12395;&#20445;&#25345;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
  &#25216;&#34899;&#30340;&#12394;&#29702;&#30001;&#12395;&#12424;&#12426;&#12289;&#12371;&#12398;&#12487;&#12540;&#12479;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;
  (&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#12395;&#12399;&#12289;&#12385;&#12423;&#12387;&#12392;&#12375;&#12383;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#27231;&#33021;&#12434;&#29420;&#33258;&#12395;&#23455;&#35013;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12452;&#12531;&#12522;&#12509;&#12472;&#12488;&#12522;&#12392;&#12399;&#29420;&#31435;&#12375;&#12383;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;)&#12290;
</p></div><div class="sect3" title="&#12454;&#12455;&#12502;&#12391;&#38322;&#35239;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;"><div class="titlepage"><div><div><h4 class="title"><a name="vc-browsing"></a>&#12454;&#12455;&#12502;&#12391;&#38322;&#35239;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;</h4></div></div></div><p>
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12399;&#12289;&#12454;&#12455;&#12502;&#19978;&#12363;&#12425;&#12418;&#38322;&#35239;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12383;&#12384;&#21336;&#12395;&#26368;&#26032;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12364;&#35211;&#12425;&#12428;&#12428;&#12400;&#12356;&#12356;&#12392;&#12356;&#12358;&#12524;&#12505;&#12523;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#21069;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12395;&#12373;&#12363;&#12398;&#12412;&#12387;&#12383;&#12426;&#12522;&#12499;&#12472;&#12519;&#12531;&#38291;&#12398;&#24046;&#20998;&#12434;&#35211;&#12383;&#12426;&#12289;
  &#22793;&#26356;&#26178;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35211;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#27231;&#33021;&#12418;&#21547;&#12415;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12428;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12487;&#12540;&#12479;&#12395;&#38306;&#12377;&#12427;&#20415;&#21033;&#12394;&#20837;&#12426;&#21475;&#12392;&#12394;&#12427;&#12398;&#12391;&#12289;
  &#12502;&#12521;&#12454;&#12470;&#12499;&#12522;&#12486;&#12451;&#65288;&#38322;&#35239;&#12398;&#12375;&#12420;&#12377;&#12373;&#65289;&#12364;&#37325;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12454;&#12455;&#12502;&#12502;&#12521;&#12454;&#12470;&#32076;&#30001;&#12391;&#12398;&#38322;&#35239;&#12364;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12289;
  &#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#29305;&#23450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#35519;&#12409;&#12383;&#12356;&#20154;
  &#65288;&#12354;&#12398;&#12496;&#12464;&#20462;&#27491;&#12399;&#12393;&#12435;&#12394;&#39080;&#12395;&#34892;&#12431;&#12428;&#12383;&#12398;&#12363;&#12394;&#65311;&#12394;&#12393;&#65289;&#12399;&#12414;&#12378;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;
  &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12392;&#12371;&#12429;&#12363;&#12425;&#22987;&#12417;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12454;&#12455;&#12502;&#12391;&#35211;&#12425;&#12428;&#12428;&#12400;&#65298;&#20998;&#12391;&#12377;&#12416;&#12371;&#12392;&#12394;&#12398;&#12395;&#12289;
  &#12381;&#12428;&#12364;&#12394;&#12356;&#12383;&#12417;&#12395;30&#20998;&#12364;&#12363;&#12426;&#12398;&#20316;&#26989;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12502;&#12521;&#12454;&#12470;&#12499;&#12522;&#12486;&#12451;&#12398;&#20013;&#12395;&#12399;&#12289;&#29305;&#23450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#29305;&#23450;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12364;&#29305;&#23450;&#12398;
  URL &#12391;&#35211;&#12425;&#12428;&#12427;&#12371;&#12392;&#12289;&#12381;&#12375;&#12390;&#29305;&#23450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#65288;&#12381;&#12398;&#26178;&#28857;&#12391;&#12398;&#65289;
  &#26368;&#26032;&#12522;&#12499;&#12472;&#12519;&#12531;&#12418;&#29305;&#23450;&#12398; URL &#12391;&#35211;&#12425;&#12428;&#12427;&#12371;&#12392;&#12392;&#12356;&#12387;&#12383;&#20869;&#23481;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;
  &#12371;&#12358;&#12375;&#12390;&#12362;&#12367;&#12392;&#12289;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12398;&#38555;&#12395;&#12381;&#12398;&#22580;&#25152;&#12434;&#31034;&#12375;&#12420;&#12377;&#12367;&#12394;&#12427;&#12398;&#12391;&#20415;&#21033;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12400;&#12300;&#12496;&#12464;&#31649;&#29702;&#12395;&#12388;&#12356;&#12390;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#12289;&#20316;&#26989;&#12467;&#12500;&#12540;&#12395;&#12354;&#12427;
  www/hacking.html &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12301;&#12392;&#12356;&#12358;&#20195;&#12431;&#12426;&#12395;
  &#12300;&#12496;&#12464;&#31649;&#29702;&#12395;&#12388;&#12356;&#12390;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;
  <span class="emphasis"><em>http://subversion.apache.org/docs/community-guide/</em></span>
  &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12301;&#12392;&#35328;&#12360;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#24120;&#12395; <code class="filename">community-guides/index.html</code>
  &#12398;&#26368;&#26032;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#25351;&#12377; URL &#12391;&#12377;&#12290;URL &#12434;&#25351;&#23450;&#12377;&#12427;&#12411;&#12358;&#12364;&#12289;
  &#12354;&#12356;&#12414;&#12356;&#24615;&#12434;&#25490;&#38500;&#12377;&#12427;&#12392;&#12356;&#12358;&#28857;&#12391;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#12395;&#12399;&#12289;
  &#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#12454;&#12455;&#12502;&#12391;&#38322;&#35239;&#12377;&#12427;&#12383;&#12417;&#12398;&#20181;&#32068;&#12415;&#12364;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12484;&#12540;&#12523;&#12434;&#20351;&#12387;&#12390;&#12371;&#12398;&#27231;&#33021;&#12434;&#23455;&#29694;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12484;&#12540;&#12523;&#12392;&#12375;&#12390;&#26377;&#21517;&#12394;&#12398;&#12399;
  <em class="firstterm">ViewVC</em> (<a class="ulink" href="http://viewvc.org/" target="_top">http://viewvc.org/</a>)&#12289;
  <em class="firstterm">CVSWeb</em> (<a class="ulink" href="http://www.freebsd.org/projects/cvsweb.html" target="_top">http://www.freebsd.org/projects/cvsweb.html</a>)&#12289;
  &#12381;&#12375;&#12390;
  <em class="firstterm">WebSVN</em> (<a class="ulink" href="http://websvn.tigris.org/" target="_top">http://websvn.tigris.org/</a>)
  &#12391;&#12377;&#12290;ViewVC &#12399; CVS &#12392; Subversion &#12398;&#20001;&#26041;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#19968;&#26041;&#12289;CVSWeb &#12399; CVS &#23554;&#29992;&#12289;WebSVN &#12399; Subversion &#23554;&#29992;&#12391;&#12377;&#12290;
</p></div><div class="sect3" title="&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;"><div class="titlepage"><div><div><h4 class="title"><a name="commit-emails"></a>&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;</h4></div></div></div><p>
  &#12467;&#12511;&#12483;&#12488;&#12364;&#34892;&#12431;&#12428;&#12427;&#12383;&#12403;&#12395;&#12289;&#12381;&#12398;&#20869;&#23481;&#12434;&#12513;&#12540;&#12523;&#12391;&#36865;&#20449;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#12513;&#12540;&#12523;&#12395;&#12399;&#12300;&#12384;&#12428;&#12364;&#12301;&#12300;&#12356;&#12388;&#12301;&#12300;&#12393;&#12398;&#12501;&#12449;&#12452;&#12523;&#12420;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#12301;&#12300;&#12393;&#12398;&#12424;&#12358;&#12395;&#12301;
  &#22793;&#26356;&#12375;&#12383;&#12398;&#12363;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12513;&#12540;&#12523;&#12398;&#36865;&#20449;&#20808;&#12399;&#29420;&#31435;&#12375;&#12383;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12392;&#12375;&#12289;
  &#20154;&#38291;&#12364;&#25237;&#31295;&#12377;&#12427;&#26222;&#36890;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12392;&#12399;&#29420;&#31435;&#12373;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12434;&#21463;&#12369;&#21462;&#12426;&#12383;&#12356;&#12402;&#12392;&#12384;&#12369;&#12364;&#12381;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#38283;&#30330;&#32773;&#12420;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#33288;&#21619;&#12364;&#12354;&#12427;&#12381;&#12398;&#20182;&#12398;&#20154;&#12383;&#12385;&#12395;&#12399;&#12289;
  &#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12408;&#12398;&#21152;&#20837;&#12434;&#21223;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#20170;&#12381;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20309;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#12434;&#12467;&#12540;&#12489;&#12524;&#12505;&#12523;&#12391;&#30693;&#12427;&#12383;&#12417;&#12395;&#12289;
  &#12371;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#26368;&#36969;&#12394;&#25163;&#27573;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12500;&#12450;&#12524;&#12499;&#12517;&#12540;&#12398;&#25216;&#34899;&#30340;&#12394;&#26377;&#29992;&#24615;&#12395;&#12388;&#12356;&#12390;&#12399;&#25913;&#12417;&#12390;&#35486;&#12427;&#12414;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;
  (<a class="xref" href="setting-tone.html#code-review" title="&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;">&#12300;&#12365;&#12385;&#12435;&#12392;&#12375;&#12383;&#12467;&#12540;&#12489;&#12524;&#12499;&#12517;&#12540;&#12398;&#32722;&#24931;&#12301;</a> &#12434;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;)
  &#12364;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12418;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12362;&#12356;&#12390;&#12399;&#26377;&#29992;&#12394;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12398;&#12452;&#12505;&#12531;&#12488;&#65288;&#12467;&#12511;&#12483;&#12488;&#65289;&#12398;&#20869;&#23481;&#12364;&#20849;&#26377;&#12373;&#12428;&#12427;&#12371;&#12392;&#12391;&#12289;
  &#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12381;&#12428;&#12395;&#21453;&#24540;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12364;&#12375;&#12420;&#12377;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#35373;&#23450;&#26041;&#27861;&#12399;&#12289;&#20351;&#29992;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#36890;&#24120;&#12399;&#12381;&#12428;&#29992;&#12398;&#12473;&#12463;&#12522;&#12503;&#12488;&#12420;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
  &#12418;&#12375;&#35211;&#12388;&#12363;&#12425;&#12394;&#12369;&#12428;&#12400;&#12289;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;
  <em class="firstterm">&#12501;&#12483;&#12463;&#65288;hooks&#65289;</em>&#12289;&#12354;&#12427;&#12356;&#12399;
  <em class="firstterm">&#12467;&#12511;&#12483;&#12488;&#24460;&#12501;&#12483;&#12463;&#65288;post-commit hook&#65289;</em>
  &#12392;&#12356;&#12387;&#12383;&#12461;&#12540;&#12527;&#12540;&#12489;&#12391;&#25506;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12385;&#12394;&#12415;&#12395; CVS &#12391;&#12399;
  <em class="firstterm">loginfo &#12501;&#12483;&#12463;&#65288;loginfo hook&#65289;</em>
  &#12392;&#35328;&#12358;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#12467;&#12511;&#12483;&#12488;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#33258;&#21205;&#12391;&#29305;&#23450;&#12398;&#20316;&#26989;&#12434;&#12373;&#12379;&#12427;&#38555;&#12395;&#20351;&#29992;&#12377;&#12427;&#12398;&#12364;
  &#12467;&#12511;&#12483;&#12488;&#24460;&#12501;&#12483;&#12463;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#21508;&#12467;&#12511;&#12483;&#12488;&#12398;&#30452;&#24460;&#12395;&#21628;&#12403;&#20986;&#12373;&#12428;&#12289;
  &#12381;&#12398;&#12467;&#12511;&#12483;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#21463;&#12369;&#21462;&#12387;&#12390;&#20219;&#24847;&#12398;&#20316;&#26989;&#12434;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12290;&#12383;&#12392;&#12360;&#12400;&#12513;&#12540;&#12523;&#12434;&#36865;&#20449;&#12375;&#12383;&#12426;&#12394;&#12393;&#12290;
</p><p>
  &#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12513;&#12540;&#12523;&#36865;&#20449;&#12398;&#20181;&#32068;&#12415;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;
  &#12381;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12434;&#12385;&#12423;&#12387;&#12392;&#22793;&#26356;&#12375;&#12383;&#12367;&#12394;&#12387;&#12390;&#12367;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
    &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12471;&#12473;&#12486;&#12512;&#12398;&#20013;&#12395;&#12399;&#12289;&#23455;&#38555;&#12398;&#24046;&#20998;&#12381;&#12398;&#12418;&#12398;&#12399;&#26412;&#25991;&#12395;&#21547;&#12417;&#12378;&#12289;
    &#12381;&#12428;&#12434;&#12454;&#12455;&#12502;&#12391;&#35211;&#12427;&#12383;&#12417;&#12398; URL &#12384;&#12369;&#12434;&#35352;&#36617;&#12377;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435; URL &#12399;&#22823;&#20107;&#12391;&#12377;&#12290;&#24460;&#12363;&#12425;&#22793;&#26356;&#20869;&#23481;&#12434;&#30906;&#35469;&#12377;&#12427;&#12398;&#12395;&#12418;&#20415;&#21033;&#12391;&#12377;&#12375;&#12397;&#12290;
    &#12391;&#12418;&#12289;&#24046;&#20998;&#12398;&#20869;&#23481;&#12381;&#12398;&#12418;&#12398;&#12434;&#12513;&#12540;&#12523;&#12398;&#26412;&#25991;&#12395;&#21547;&#12417;&#12390;&#12362;&#12367;&#12371;&#12392;&#12418;
    <span class="emphasis"><em>&#38750;&#24120;&#12395;</em></span> &#37325;&#35201;&#12391;&#12377;&#12290;&#22810;&#12367;&#12398;&#20154;&#12395;&#12392;&#12387;&#12390;&#12289;
    &#12513;&#12540;&#12523;&#12434;&#35501;&#12416;&#12392;&#12356;&#12358;&#20316;&#26989;&#12399;&#26085;&#24120;&#12398;&#12523;&#12540;&#12481;&#12531;&#12527;&#12540;&#12463;&#12392;&#12375;&#12390;&#32068;&#12415;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#22793;&#26356;&#12398;&#20869;&#23481;&#12364;&#30452;&#25509;&#12513;&#12540;&#12523;&#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;
    &#19968;&#36899;&#12398;&#27969;&#12428;&#12398;&#20013;&#12391;&#33258;&#28982;&#12395;&#12467;&#12511;&#12483;&#12488;&#12434;&#12524;&#12499;&#12517;&#12540;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12356;&#12385;&#12356;&#12385;&#12513;&#12540;&#12523;&#12477;&#12501;&#12488;&#12434;&#32066;&#20102;&#12375;&#12390;&#12502;&#12521;&#12454;&#12470;&#12395;&#20999;&#12426;&#26367;&#12360;&#12427;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#22793;&#26356;&#12434;&#30906;&#35469;&#12377;&#12427;&#12395;&#12399; URL &#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12394;&#12428;&#12400;&#12289;
    &#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399;&#12463;&#12522;&#12483;&#12463;&#12394;&#12393;&#12375;&#12390;&#12367;&#12428;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12384;&#12387;&#12390;&#12289;&#12371;&#12428;&#12414;&#12391;&#12378;&#12387;&#12392;&#12513;&#12540;&#12523;&#12434;&#35501;&#12435;&#12391;&#12356;&#12383;&#12398;&#12395;&#12289;
    &#12356;&#12365;&#12394;&#12426;&#21029;&#12398;&#25805;&#20316;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12398;&#12391;&#12377;&#12363;&#12425;&#12290;
    &#12373;&#12425;&#12395;&#12289;&#22793;&#26356;&#28857;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12383;&#20154;&#12364;&#12381;&#12398;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#36074;&#21839;&#12434;&#12375;&#12383;&#12356;&#12392;&#12365;&#12395;&#12289;
    &#12381;&#12398;&#12513;&#12540;&#12523;&#12395;&#12300;&#36820;&#20449;&#12301;&#12377;&#12428;&#12400;&#33258;&#21205;&#30340;&#12395;&#22793;&#26356;&#20869;&#23481;&#12364;&#24471;&#12425;&#12428;&#12427;&#12398;&#12391;&#20415;&#21033;&#12391;&#12377;&#12290;
    &#12373;&#12418;&#12394;&#12356;&#12392;&#12289;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#38283;&#12356;&#12390;&#22793;&#26356;&#28857;&#12434;
    &#12459;&#12483;&#12488;&#65286;&#12506;&#12540;&#12473;&#12488;&#12377;&#12427;&#12392;&#12356;&#12358;&#22823;&#22793;&#12394;&#25163;&#38291;&#12364;&#12363;&#12363;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  </p><p>
    (&#12418;&#12385;&#12429;&#12435;&#12289;&#26032;&#12383;&#12395;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12467;&#12540;&#12489;&#12434;&#36861;&#21152;&#12375;&#12383;&#12394;&#12393;&#12391;&#22793;&#26356;&#28857;&#12364;&#22823;&#37327;&#12395;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#24046;&#20998;&#12434;&#30465;&#30053;&#12375;&#12390; URL &#12384;&#12369;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12398;&#12418;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290;
    &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#12471;&#12473;&#12486;&#12512;&#12398;&#22810;&#12367;&#12399;&#12289;
    &#20309;&#12425;&#12363;&#12398;&#21046;&#38480;&#20516;&#12434;&#35373;&#23450;&#12375;&#12390;&#12371;&#12398;&#20966;&#29702;&#12434;&#33258;&#21205;&#21270;&#12375;&#12390;&#12367;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12418;&#12375;&#12381;&#12435;&#12394;&#27231;&#33021;&#12364;&#12388;&#12356;&#12390;&#12356;&#12394;&#12363;&#12387;&#12383;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#12381;&#12435;&#12394;&#22580;&#21512;&#12391;&#12418;&#12289;
    &#24046;&#20998;&#12434;&#12414;&#12387;&#12383;&#12367;&#35352;&#36617;&#12375;&#12394;&#12356;&#12424;&#12426;&#12399;&#24120;&#12395;&#24046;&#20998;&#12434;&#21547;&#12417;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12411;&#12358;&#12364;&#12378;&#12387;&#12392;&#12510;&#12471;&#12391;&#12377;&#12290;
    &#12383;&#12414;&#12395;&#24040;&#22823;&#12394;&#12513;&#12540;&#12523;&#12364;&#36865;&#20449;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#35377;&#23481;&#31684;&#22258;&#12391;&#12377;&#12290;
    &#20849;&#21516;&#38283;&#30330;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#12415;&#12435;&#12394;&#12364;&#20182;&#20154;&#12398;&#22793;&#26356;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12383;&#12426;&#12467;&#12513;&#12531;&#12488;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;
    &#12381;&#12398;&#12383;&#12417;&#12398;&#21162;&#21147;&#12399;&#12289;&#12356;&#12367;&#12425;&#12375;&#12390;&#12418;&#12375;&#12377;&#12366;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)
  </p></li><li class="listitem"><p>
    &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398; Reply-to &#12504;&#12483;&#12480;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12399;&#12394;&#12367;
    &#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12358;&#12377;&#12427;&#12392;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#20309;&#12425;&#12363;&#12398;&#12467;&#12513;&#12531;&#12488;&#12434;&#12375;&#12383;&#12367;&#12394;&#12387;&#12383;&#20154;&#12364;
    &#12300;&#36820;&#20449;&#12301;&#12377;&#12427;&#12392;&#12289;&#12381;&#12428;&#12364;&#33258;&#21205;&#30340;&#12395;&#38283;&#30330;&#32773;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#27969;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12390;&#12362;&#12367;&#12409;&#12365;&#29702;&#30001;&#12399;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12414;&#12378;&#12289;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12399;&#12402;&#12392;&#12388;&#12398;&#22580;&#25152;&#12395;&#38598;&#32004;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
    &#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12434;&#34892;&#12358;&#22580;&#12392;&#12375;&#12390;&#26368;&#36969;&#12394;&#12398;&#12399;&#12289;&#38283;&#30330;&#32773;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;
    &#27425;&#12395;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12394;&#12356;&#12513;&#12531;&#12496;&#12540;&#12395;&#12418;
    &#35696;&#35542;&#12398;&#20869;&#23481;&#12434;&#20253;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
    &#65299;&#12388;&#30446;&#12395;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#12354;&#12367;&#12414;&#12391;&#12418;
    &#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12384;&#12369;&#12398;&#12418;&#12398;&#12391;&#12354;&#12426;&#12289;
    &#27770;&#12375;&#12390;&#12300;&#12467;&#12511;&#12483;&#12488;&#12398;&#20869;&#23481;&#12398;&#12481;&#12455;&#12483;&#12463;&#12364;&#12513;&#12452;&#12531;&#12384;&#12369;&#12393;&#12289;
    &#12383;&#12414;&#12395;&#25216;&#34899;&#30340;&#12394;&#35696;&#35542;&#12418;&#12354;&#12427;&#12301;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12354;&#12387;&#12390;&#12399;&#12356;&#12369;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#29992;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#30331;&#37682;&#12377;&#12427;&#20154;&#12383;&#12385;&#12399;&#12289;
    &#12467;&#12511;&#12483;&#12488;&#20869;&#23481;&#12398;&#12513;&#12540;&#12523;&#12384;&#12369;&#12364;&#36865;&#12425;&#12428;&#12390;&#12367;&#12427;&#12371;&#12392;&#12434;&#26399;&#24453;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#20197;&#22806;&#12398;&#20869;&#23481;&#12364;&#36865;&#12425;&#12428;&#12427;&#12392;&#12289;&#26263;&#40665;&#12398;&#20102;&#35299;&#12434;&#35023;&#20999;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#26368;&#24460;&#12395;&#12289;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#20869;&#23481;&#12434;&#20966;&#29702;&#12375;&#12390;&#65288;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12394;&#12393;&#12395;&#65289;
    &#32080;&#26524;&#12434;&#20986;&#21147;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#20316;&#25104;&#12377;&#12427;&#12424;&#12358;&#12394;&#20154;&#12398;&#12371;&#12392;&#12434;&#32771;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12290;
    &#12371;&#12398;&#31278;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;
    &#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12398;&#12424;&#12358;&#12394;&#12362;&#27770;&#12414;&#12426;&#12398;&#12497;&#12479;&#12540;&#12531;&#12398;&#12513;&#12540;&#12523;&#12395;&#38306;&#12375;&#12390;&#12399;&#12358;&#12414;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;&#20154;&#38291;&#12364;&#26360;&#12356;&#12383;&#12513;&#12540;&#12523;&#12434;&#20966;&#29702;&#12373;&#12379;&#12427;&#12392;&#22793;&#12394;&#32080;&#26524;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12391;&#12375;&#12423;&#12358;&#12290;
  </p><p>
    &#12371;&#12371;&#12391;&#12362;&#21223;&#12417;&#12375;&#12383; Reply-to &#12398;&#35373;&#23450;&#12399;&#12289;&#27770;&#12375;&#12390;
    <span>&#26412;&#31456;&#12398;&#21069;&#21322;&#12391;&#36848;&#12409;&#12383;</span>
    <a class="xref" href="mailing-lists.html#reply-to" title="Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;">&#12300;Reply-to &#12399;&#12393;&#12358;&#12377;&#12409;&#12365;&#12363;&#12301;</a> &#12398;&#20869;&#23481;&#12392;&#30683;&#30462;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#20808;&#12411;&#12393;&#12418;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398; <span class="emphasis"><em>&#36865;&#20449;&#32773;</em></span> &#33258;&#36523;&#12364;
    Reply-to &#12434;&#35373;&#23450;&#12377;&#12427;&#12406;&#12435;&#12395;&#12399;&#29305;&#12395;&#21839;&#38988;&#12399;&#12394;&#12356;&#12392;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#20170;&#22238;&#12398;&#22580;&#21512;&#12289;
    &#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36865;&#20449;&#32773;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
    &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#33258;&#36523;&#12391; Reply-to
    &#12434;&#25351;&#23450;&#12375;&#12390;&#38283;&#30330;&#32773;&#21521;&#12369;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#21521;&#12369;&#12395;&#36820;&#20449;&#12373;&#12379;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12363;&#12425;&#12289;
    &#12373;&#12365;&#12411;&#12393;&#12398;&#35500;&#26126;&#12392;&#12399;&#30683;&#30462;&#12375;&#12414;&#12379;&#12435;&#12290;
  </p></li></ol></div><div class="sidebar" title="CIA: &#22793;&#26356;&#28857;&#12434;&#20844;&#38283;&#12377;&#12427;&#12383;&#12417;&#12398;&#27161;&#28310;&#21270;&#12373;&#12428;&#12383;&#26041;&#27861;"><a name="cia"></a><div class="titlepage"><div><div><p class="title"><b>CIA: &#22793;&#26356;&#28857;&#12434;&#20844;&#38283;&#12377;&#12427;&#12383;&#12417;&#12398;&#27161;&#28310;&#21270;&#12373;&#12428;&#12383;&#26041;&#27861;</b></p></div></div></div><p>
  &#22793;&#26356;&#28857;&#12434;&#20844;&#38283;&#12377;&#12427;&#26041;&#27861;&#12399;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;
  CIA (<a class="ulink" href="http://cia.vc/" target="_top">http://cia.vc/</a>) &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#12398;&#29366;&#27841;&#12434;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12391;&#21454;&#38598;&#12375;&#12289;&#37197;&#20449;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
  CIA &#12398;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#20351;&#29992;&#27861;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#12398;&#36890;&#30693;&#12434;
  IRC &#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#36865;&#20449;&#12377;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#21363;&#26178;&#12395;&#12381;&#12428;&#12434;&#30693;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12513;&#12540;&#12523;&#12395;&#27604;&#12409;&#12383;&#12425;&#12289;&#25216;&#34899;&#30340;&#12395;&#21155;&#12387;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12384;&#12387;&#12390;&#12289;IRC &#12395;&#12467;&#12511;&#12483;&#12488;&#36890;&#30693;&#12434;&#36865;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;
  &#12381;&#12428;&#12434;&#35211;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12364;&#12431;&#12363;&#12425;&#12394;&#12356;&#12431;&#12369;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12381;&#12428;&#12391;&#12418;&#12289;&#12371;&#12398;&#20181;&#32068;&#12415;&#12399; <span class="emphasis"><em>&#31038;&#20250;&#30340;&#12394;&#38754;&#12391;</em></span>
  &#38754;&#30333;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12399;
  &#12381;&#12371;&#12391;&#20309;&#12363;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#24863;&#12376;&#12425;&#12428;&#12289;
  &#38283;&#30330;&#12398;&#36914;&#34892;&#29366;&#27841;&#12434;&#12414;&#12373;&#12395;&#30446;&#12398;&#21069;&#12391;&#35211;&#12425;&#12428;&#12427;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#20849;&#26377;&#31354;&#38291;&#12395;&#36890;&#30693;&#12373;&#12428;&#12427;&#12398;&#12391;&#12289;
  &#12481;&#12515;&#12483;&#12488;&#12523;&#12540;&#12512;&#12395;&#12356;&#12427;&#20154;&#12383;&#12385;&#12364;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12391;&#21453;&#24540;&#12375;&#12289;
  &#21363;&#24231;&#12395;&#12467;&#12511;&#12483;&#12488;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#12467;&#12513;&#12531;&#12488;&#12434;&#12375;&#12390;&#12367;&#12428;&#12427;&#12371;&#12392;&#12364;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  CIA &#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#24460;&#12398;&#12501;&#12483;&#12463;&#12391;&#36890;&#30693;&#29992;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12467;&#12511;&#12483;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434; XML
  &#24418;&#24335;&#12395;&#22793;&#25563;&#12375;&#12390;&#20013;&#22830;&#12469;&#12540;&#12496; (&#36890;&#24120;&#12399; <code class="literal">cia.vi</code>)
  &#12395;&#36865;&#12426;&#12414;&#12377;&#12290;&#12377;&#12427;&#12392;&#12469;&#12540;&#12496;&#12364;&#12381;&#12398;&#24773;&#22577;&#12434;&#21029;&#12398;&#12501;&#12457;&#12540;&#12521;&#12512;&#12395;&#37197;&#20449;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  CIA &#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
  <a class="ulink" href="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html" target="_top">RSS</a>
  &#12501;&#12451;&#12540;&#12489;&#12434;&#36865;&#20449;&#12373;&#12379;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;
  <a class="ulink" href="http://cia.vc/" target="_top">http://cia.vc/</a> &#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#12372;&#30906;&#35469;&#12367;&#12384;&#12373;&#12356;&#12290;
</p><p>
  CIA &#12364;&#23455;&#38555;&#12395;&#21205;&#20316;&#12375;&#12390;&#12356;&#12427;&#20363;&#12434;&#35211;&#12427;&#12395;&#12399;&#12289;IRC &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;
  <code class="literal">irc.freenode.net</code> &#12398;&#12481;&#12515;&#12531;&#12493;&#12523; <code class="literal">#commits</code>
  &#12395;&#34892;&#12387;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;&#12371;&#12371;&#12391;&#12399;&#12289;
  CIA &#12364;&#30435;&#35222;&#12375;&#12390;&#12356;&#12427;&#20840;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27963;&#21205;&#29366;&#27841;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p></div></div><div class="sect3" title="&#12502;&#12521;&#12531;&#12481;&#12398;&#27963;&#29992;"><div class="titlepage"><div><div><h4 class="title"><a name="branches"></a>&#12502;&#12521;&#12531;&#12481;&#12398;&#27963;&#29992;</h4></div></div></div><p>
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12354;&#12414;&#12426;&#24931;&#12428;&#12390;&#12356;&#12394;&#12356;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;
  &#12502;&#12521;&#12531;&#12481;&#12398;&#20316;&#25104;&#12420;&#12510;&#12540;&#12472;&#20316;&#26989;&#12434;&#24598;&#12364;&#12427;&#20670;&#21521;&#12364;&#12354;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
  &#12362;&#12381;&#12425;&#12367;&#12289;&#12371;&#12428;&#12399; CVS &#12398;&#24746;&#35413;&#12398;&#21103;&#20316;&#29992;&#12391;&#12375;&#12423;&#12358;&#12290;
  CVS &#12398;&#12502;&#12521;&#12531;&#12481;&#20316;&#25104;&#20966;&#29702;&#12420;&#12510;&#12540;&#12472;&#20966;&#29702;&#12399;&#30452;&#24863;&#30340;&#12392;&#12399;&#35328;&#12360;&#12378;&#12289;
  &#22810;&#12367;&#12398;&#20154;&#12364;&#12381;&#12428;&#12434;&#36991;&#12369;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
  &#12418;&#12375;&#12354;&#12394;&#12383;&#12418;&#12381;&#12398;&#20013;&#12398;&#12402;&#12392;&#12426;&#12384;&#12392;&#12356;&#12358;&#12398;&#12394;&#12425;&#12289;
  &#24598;&#12364;&#12427;&#27671;&#25345;&#12385;&#12434;&#20055;&#12426;&#36234;&#12360;&#12390;&#12502;&#12521;&#12531;&#12481;&#20316;&#25104;&#12420;&#12510;&#12540;&#12472;&#12395;&#12388;&#12356;&#12390;&#21193;&#24375;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12356;&#12387;&#12383;&#12435;&#20316;&#26989;&#12395;&#24931;&#12428;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;&#12381;&#12435;&#12394;&#12395;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12513;&#12531;&#12496;&#12540;&#12364;&#22679;&#12360;&#12428;&#12400;&#22679;&#12360;&#12427;&#12411;&#12393;&#12371;&#12398;&#20316;&#26989;&#12398;&#37325;&#35201;&#24615;&#12418;&#22679;&#12375;&#12414;&#12377;&#12290;
</p><p>
  &#12502;&#12521;&#12531;&#12481;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#38480;&#12425;&#12428;&#12383;&#36039;&#28304;&#65288;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#20013;&#12398;&#20316;&#26989;&#22580;&#25152;&#65289;
  &#12434;&#26377;&#21177;&#27963;&#29992;&#12391;&#12365;&#12427;&#12398;&#12391;&#20415;&#21033;&#12391;&#12377;&#12290;
  &#36890;&#24120;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#38283;&#30330;&#32773;&#12364;&#12402;&#12392;&#12388;&#12398;&#30722;&#22580;&#12398;&#19978;&#12391;&#20316;&#26989;&#12434;&#12375;&#12414;&#12377;&#12290;
  &#12415;&#12435;&#12394;&#12391;&#12402;&#12392;&#12388;&#12398;&#12362;&#22478;&#12434;&#20316;&#12387;&#12390;&#12356;&#12371;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
  &#12354;&#12427;&#12392;&#12365;&#12289;&#12402;&#12392;&#12426;&#12398;&#12513;&#12531;&#12496;&#12540;&#12364;&#12300;&#12371;&#12371;&#12395;&#36339;&#12397;&#27211;&#12434;&#12388;&#12369;&#12414;&#12375;&#12423;&#12358;&#12424;&#12301;&#12392;&#35328;&#12356;&#20986;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#12391;&#12418;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12399;&#12289;&#12381;&#12428;&#12364;&#12381;&#12398;&#12362;&#22478;&#12395;&#12392;&#12387;&#12390;&#26412;&#24403;&#12395;&#26377;&#29992;&#12394;&#12398;&#12363;&#12393;&#12358;&#12363;&#12364;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12398;&#12513;&#12531;&#12496;&#12540;&#29992;&#12395;&#30722;&#22580;&#12398;&#19968;&#35282;&#12434;&#38548;&#38626;&#12375;&#12289;&#24444;&#22899;&#12395;&#12399;&#12381;&#12371;&#12391;&#20316;&#26989;&#12434;&#12375;&#12390;&#12418;&#12425;&#12358;&#12290;
  &#12502;&#12521;&#12531;&#12481;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12399;&#12289;&#12381;&#12358;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12418;&#12375;&#12358;&#12414;&#12356;&#20855;&#21512;&#12395;&#36339;&#12397;&#27211;&#12364;&#20986;&#26469;&#19978;&#12364;&#12387;&#12383;&#12425;&#12289;
  &#24444;&#22899;&#12399;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12434;&#21628;&#12403;&#23492;&#12379;&#12390;&#12381;&#12428;&#12434;&#35211;&#12390;&#12418;&#12425;&#12356;&#12414;&#12377;&#12290;
  &#12415;&#12435;&#12394;&#12364;&#32013;&#24471;&#12377;&#12427;&#12424;&#12358;&#12394;&#12391;&#12365;&#12400;&#12360;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12428;&#12400;&#12289;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#12387;&#12390;&#12381;&#12398;&#36339;&#12397;&#27211;&#12434;&#12415;&#12435;&#12394;&#12398;&#12362;&#22478;&#12395;&#31227;&#26893;
  &#65288;"&#12510;&#12540;&#12472;"&#65289;&#12377;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
  &#20849;&#21516;&#20316;&#26989;&#12434;&#36914;&#12417;&#12427;&#12358;&#12360;&#12391;&#12371;&#12398;&#27231;&#33021;&#12364;&#12356;&#12363;&#12395;&#26377;&#29992;&#12363;&#12399;&#12289;
  &#35328;&#12358;&#12414;&#12391;&#12418;&#12394;&#12356;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12398;&#27231;&#33021;&#12434;&#20351;&#12360;&#12400;&#12289;
  &#12300;&#20182;&#12398;&#20154;&#12395;&#36855;&#24785;&#12364;&#12363;&#12363;&#12425;&#12394;&#12356;&#12363;&#12394;&#65311;&#12301;
  &#12394;&#12435;&#12390;&#27671;&#12395;&#12379;&#12378;&#12395;&#24605;&#12358;&#23384;&#20998;&#26032;&#12375;&#12356;&#12371;&#12392;&#12434;&#35430;&#12379;&#12427;&#12398;&#12391;&#12377;&#12290;
  &#21516;&#12376;&#12367;&#12425;&#12356;&#37325;&#35201;&#12394;&#12371;&#12392;&#12392;&#12375;&#12390;&#12289;
  &#12496;&#12464;&#20462;&#27491;&#12420;&#23433;&#23450;&#29256;&#12522;&#12522;&#12540;&#12473;&#12398;&#12383;&#12417;&#12398;&#12502;&#12521;&#12531;&#12481;&#12434;&#26412;&#27969;&#12363;&#12425;&#38548;&#38626;&#12377;&#12427;
  (<span><a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a> &#12398;</span>
  <a class="xref" href="stabilizing-a-release.html" title="&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12434;&#23433;&#23450;&#12373;&#12379;&#12427;&#12503;&#12525;&#12475;&#12473;&#12301;</a> &#12392;
  <a class="xref" href="release-lines.html" title="&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;">&#12300;&#35079;&#25968;&#12398;&#12522;&#12522;&#12540;&#12473;&#12521;&#12452;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;&#12301;</a> &#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;) &#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#27969;&#12428;&#12434;&#36861;&#12356;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#20559;&#35211;&#12434;&#25448;&#12390;&#12289;&#12502;&#12521;&#12531;&#12481;&#12434;&#31309;&#26997;&#30340;&#12395;&#20351;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12375;&#12390;&#12289;&#20182;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#12418;&#12502;&#12521;&#12531;&#12481;&#12398;&#20351;&#29992;&#12434;&#25512;&#22888;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#19981;&#35201;&#12395;&#12394;&#12387;&#12383;&#12502;&#12521;&#12531;&#12481;&#12399;&#12356;&#12388;&#12414;&#12391;&#12418;&#27531;&#12375;&#12390;&#12362;&#12363;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12502;&#12521;&#12531;&#12481;&#12364;&#22679;&#12360;&#12428;&#12400;&#22679;&#12360;&#12427;&#12411;&#12393;&#12289;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#20869;&#12391;&#12398;&#27880;&#30446;&#12364;&#25955;&#12425;&#12400;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12381;&#12398;&#12502;&#12521;&#12531;&#12481;&#12392;&#12399;&#30452;&#25509;&#38306;&#20418;&#12398;&#12394;&#12356;&#38283;&#30330;&#32773;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#21608;&#12426;&#12391;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#27671;&#12395;&#12379;&#12378;&#12395;&#12399;&#12356;&#12425;&#12428;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#28961;&#29702;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12418;&#12385;&#12429;&#12435;&#12289;
  &#12502;&#12521;&#12531;&#12481;&#12395;&#23550;&#12377;&#12427;&#12467;&#12511;&#12483;&#12488;&#12391;&#12354;&#12387;&#12390;&#12418;&#12467;&#12511;&#12483;&#12488;&#12513;&#12540;&#12523;&#12399;&#21516;&#12376;&#12424;&#12358;&#12395;&#36865;&#12426;&#12414;&#12377;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12502;&#12521;&#12531;&#12481;&#12399;&#38283;&#30330;&#32773;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12434;&#20998;&#26029;&#12377;&#12427;&#20181;&#32068;&#12415;&#12392;&#12394;&#12427;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12431;&#12378;&#12363;&#12394;&#20363;&#22806;&#12434;&#38500;&#12356;&#12390;&#12399;&#12289;
  &#21021;&#26399;&#12398;&#30446;&#30340;&#12434;&#36948;&#25104;&#12375;&#12390;&#26412;&#27969;&#12395;&#12510;&#12540;&#12472;&#12375;&#12383;&#26178;&#28857;&#12391;&#12502;&#12521;&#12531;&#12481;&#12434;&#21066;&#38500;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div><div class="sect3" title="&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;"><div class="titlepage"><div><div><h4 class="title"><a name="vc-singularity"></a>&#24773;&#22577;&#12398;&#19968;&#20803;&#31649;&#29702;</h4></div></div></div><p>
  &#12502;&#12521;&#12531;&#12481;&#12364;&#37325;&#35201;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;&#24403;&#28982;&#12510;&#12540;&#12472;&#20966;&#29702;&#12418;&#37325;&#35201;&#12395;&#12394;&#12387;&#12390;&#12367;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#21516;&#12376;&#12467;&#12511;&#12483;&#12488;&#12434;&#65298;&#22238;&#32368;&#12426;&#36820;&#12377;&#12394;&#12435;&#12390;&#12356;&#12358;&#12371;&#12392;&#12364;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12388;&#12414;&#12426;&#12289;&#12354;&#12427;&#22793;&#26356;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#25237;&#20837;&#12373;&#12428;&#12427;&#12398;&#12399;&#65297;&#22238;&#12384;&#12369;&#12395;&#12375;&#12390;&#12362;&#12367;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12358;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12289;&#12354;&#12427;&#22793;&#26356;&#12395;&#23550;&#24540;&#12377;&#12427;&#12522;&#12499;&#12472;&#12519;&#12531;&#65288;&#12354;&#12427;&#12356;&#12399;&#12522;&#12499;&#12472;&#12519;&#12531;&#32676;&#65289;
  &#12364;&#19968;&#24847;&#12395;&#27770;&#12414;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#22793;&#26356;&#12392;&#21516;&#12376;&#20869;&#23481;&#12434;&#21029;&#12398;&#12502;&#12521;&#12531;&#12481;&#12395;&#12418;&#36969;&#29992;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;
  &#12381;&#12398;&#12502;&#12521;&#12531;&#12481;&#19978;&#12391;&#12418;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#12424;&#12358;&#12395;&#25163;&#12434;&#21152;&#12360;&#12390;&#12381;&#12428;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12392;&#12356;&#12358;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
  &#26368;&#21021;&#12398;&#22793;&#26356;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#25163;&#20316;&#26989;&#12391;&#21516;&#12376;&#12424;&#12358;&#12395;&#20462;&#27491;&#12375;&#12383;&#12418;&#12398;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12418;&#32080;&#26524;&#12399;&#21516;&#12376;&#12391;&#12377;&#12364;&#12289;
  &#12381;&#12358;&#12377;&#12427;&#12392;&#27491;&#30906;&#12394;&#12522;&#12522;&#12540;&#12473;&#31649;&#29702;&#12364;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12371;&#12398;&#20214;&#12395;&#38306;&#12377;&#12427;&#23455;&#38555;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12289;
  &#20351;&#29992;&#12377;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12300;&#12510;&#12540;&#12472;&#12301;&#12399;&#29305;&#21029;&#12394;&#20966;&#29702;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12289;
  &#36890;&#24120;&#12398;&#12467;&#12511;&#12483;&#12488;&#12392;&#12399;&#21029;&#12398;&#12418;&#12398;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12381;&#12375;&#12390;&#29420;&#33258;&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;
  &#12510;&#12540;&#12472;&#12375;&#12383;&#32080;&#26524;&#12434;&#36890;&#24120;&#12398;&#12467;&#12511;&#12483;&#12488;&#12392;&#21516;&#27096;&#12395;&#36969;&#29992;&#12377;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#12424;&#12358;&#12394;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12300;&#12510;&#12540;&#12472;&#12375;&#12383;&#32080;&#26524;&#12398;&#12467;&#12511;&#12483;&#12488;&#12301;&#12392;
  &#12300;&#26032;&#12375;&#12356;&#22793;&#26356;&#12398;&#12467;&#12511;&#12483;&#12488;&#12301;&#12398;&#21306;&#21029;&#12399;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;
  &#12510;&#12540;&#12472;&#12375;&#12383;&#38555;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12399;&#12289;
  &#20803;&#12398;&#22793;&#26356;&#12398;&#38555;&#12398;&#12525;&#12464;&#12434;&#12381;&#12398;&#12414;&#12414;&#32368;&#12426;&#36820;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12289;&#12300;&#12371;&#12398;&#22793;&#26356;&#12399;&#12510;&#12540;&#12472;&#12391;&#12354;&#12427;&#12301;&#12371;&#12392;&#12392;&#12289;
  &#12393;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#12510;&#12540;&#12472;&#12375;&#12383;&#12398;&#12363;&#12434;&#31777;&#21336;&#12395;&#35352;&#36848;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12398;&#22793;&#26356;&#20869;&#23481;&#12434;&#30693;&#12426;&#12383;&#12369;&#12428;&#12400;&#12289;
  &#12510;&#12540;&#12472;&#20803;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35211;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12431;&#12369;&#12391;&#12377;&#12290;
</p><p>
  &#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#37325;&#35079;&#12434;&#36991;&#12369;&#12427;&#12398;&#12364;&#12394;&#12380;&#12381;&#12435;&#12394;&#12395;&#22823;&#20107;&#12394;&#12398;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;
  &#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#24460;&#12363;&#12425;&#20462;&#27491;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#21516;&#12376;&#20869;&#23481;&#12398;&#12525;&#12464;&#12434;&#32368;&#12426;&#36820;&#12375;&#35352;&#36848;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;
  &#12384;&#12428;&#12363;&#12364;&#20803;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20462;&#27491;&#12375;&#12383;&#12392;&#12365;&#12395;
  &#12467;&#12500;&#12540;&#20808;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12381;&#12398;&#12414;&#12414;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#24460;&#12363;&#12425;&#35211;&#12383;&#12425;&#12289;&#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#12420;&#12420;&#12371;&#12375;&#12356;&#29366;&#27841;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#21516;&#12376;&#21407;&#21063;&#12399;&#12289;&#22793;&#26356;&#12434;&#21462;&#12426;&#28040;&#12377; (revert) &#38555;&#12395;&#12418;&#12354;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12427;&#20462;&#27491;&#12364;&#24259;&#26696;&#12395;&#12394;&#12387;&#12383;&#12392;&#12365;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;
  &#21336;&#12395;&#12381;&#12428;&#12364; revert &#12373;&#12428;&#12383;&#12392;&#12356;&#12358;&#12371;&#12392;&#12384;&#12369;&#12434;&#35352;&#36848;&#12375;&#12414;&#12377;&#12290;
  &#23455;&#38555;&#12395;&#20309;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#25147;&#12375;&#12383;&#12398;&#12363;&#12414;&#12391;&#12434;&#26360;&#12356;&#12390;&#12399;
  <span class="emphasis"><em>&#12356;&#12369;&#12414;&#12379;&#12435;</em></span>&#12290;&#12384;&#12387;&#12390;&#12381;&#12428;&#12399;&#12289;
  &#12418;&#12392;&#12418;&#12392;&#12381;&#12398;&#22793;&#26356;&#12434;&#34892;&#12387;&#12383;&#38555;&#12398;&#12525;&#12464;&#12434;&#35211;&#12428;&#12400;&#12431;&#12363;&#12427;&#12371;&#12392;&#12394;&#12435;&#12391;&#12377;&#12363;&#12425;&#12290;
  &#12418;&#12385;&#12429;&#12435;&#12300;&#12394;&#12380;&#12301;&#21462;&#12426;&#28040;&#12375;&#12383;&#12398;&#12363;&#12392;&#12356;&#12358;&#29702;&#30001;&#12398;&#35500;&#26126;&#12399;&#24517;&#35201;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#20803;&#12398;&#22793;&#26356;&#12398;&#38555;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#19968;&#35328;&#19968;&#21477;&#26360;&#12365;&#20889;&#12377;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12391;&#12365;&#12428;&#12400;&#12289;&#20803;&#12398;&#22793;&#26356;&#12398;&#38555;&#12398;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12418;&#20462;&#27491;&#12375;&#12289;
  &#12381;&#12428;&#12364;&#32080;&#23616;&#21462;&#12426;&#28040;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#35352;&#36848;&#12375;&#12390;&#12362;&#12367;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12371;&#12428;&#12414;&#12391;&#35500;&#26126;&#12375;&#12390;&#12365;&#12383;&#12371;&#12392;&#12363;&#12425;&#12418;&#20309;&#12392;&#12394;&#12367;&#12362;&#20998;&#12363;&#12426;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
  &#29305;&#23450;&#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#21442;&#29031;&#12377;&#12427;&#38555;&#12398;&#34920;&#35352;&#26041;&#27861;&#12399;&#32113;&#19968;&#12375;&#12390;&#12362;&#12356;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12384;&#12369;&#12391;&#12394;&#12367;&#12513;&#12540;&#12523;&#12420;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12394;&#12393;&#12391;&#12418;&#21516;&#12376;&#12391;&#12377;&#12290;
  CVS &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;
  "<code class="literal">path/to/file/in/project/tree:REV</code>"
  &#12392;&#12356;&#12358;&#24418;&#24335;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12289;REV &#12399; CVS &#12398;&#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;
  (&#12383;&#12392;&#12360;&#12400; "1.76" &#12394;&#12393;) &#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
  Subversion &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;(&#12383;&#12392;&#12360;&#12400;&#12522;&#12499;&#12472;&#12519;&#12531; 1729 &#12398;&#22580;&#21512;&#12398;)
  &#27161;&#28310;&#12398;&#34920;&#35352;&#27861;&#12399; "r1729" &#12392;&#12394;&#12426;&#12414;&#12377; (&#12501;&#12449;&#12452;&#12523;&#12398;&#12497;&#12473;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
  Subversion &#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#20840;&#20307;&#12391;&#12522;&#12499;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434;&#31649;&#29702;&#12377;&#12427;&#12363;&#12425;&#12391;&#12377;)&#12290;
  &#12381;&#12428;&#20197;&#22806;&#12398;&#12471;&#12473;&#12486;&#12512;&#12391;&#12418;&#12365;&#12387;&#12392;&#12289;
  &#12481;&#12455;&#12531;&#12472;&#12475;&#12483;&#12488;&#12434;&#34920;&#12377;&#12383;&#12417;&#12398;&#27161;&#28310;&#24418;&#24335;&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12392;&#12418;&#12363;&#12367;&#12289;&#12513;&#12531;&#12496;&#12540;&#12395;&#12399;&#27161;&#28310;&#12398;&#24418;&#24335;&#12434;&#20351;&#12387;&#12390;&#12418;&#12425;&#12358;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12371;&#12398;&#34920;&#35352;&#27861;&#12434;&#32113;&#19968;&#12375;&#12390;&#12362;&#12367;&#12392;&#12289;&#24460;&#12363;&#12425;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27969;&#12428;&#12434;&#36861;&#12358;&#12398;&#12364;&#31777;&#21336;&#12395;&#12394;&#12426;
  (<a class="xref" href="communications.html" title="&#31532;6&#31456; &#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;">6&#31456;<i>&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;</i></a> &#12420;
  <a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a> &#12391;&#35500;&#26126;&#12375;&#12414;&#12377;) &#12414;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#31649;&#29702;&#12434;&#34892;&#12358;&#12398;&#12399;&#12383;&#12356;&#12390;&#12356;&#12399;&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12394;&#12398;&#12391;&#12289;
  &#12391;&#12365;&#12427;&#12384;&#12369;&#31777;&#21336;&#12395;&#36914;&#12417;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290;
</p><p>
  <span><a class="xref" href="development-cycle.html" title="&#31532;7&#31456; &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;">7&#31456;<i>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20316;&#25104;&#12289;&#12522;&#12522;&#12540;&#12473;&#12289;&#26085;&#12293;&#12398;&#38283;&#30330;</i></a></span>
  &#12398; <a class="xref" href="releases-and-daily-development.html" title="&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;">&#12300;&#12522;&#12522;&#12540;&#12473;&#12392;&#26085;&#12293;&#12398;&#38283;&#30330;&#12301;</a>
  &#12418;&#12372;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="sect3" title="&#25215;&#35469;"><div class="titlepage"><div><div><h4 class="title"><a name="vc-authz"></a>&#25215;&#35469;</h4></div></div></div><p>
  &#12383;&#12356;&#12390;&#12356;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12399;&#12289;
  &#29305;&#23450;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#23550;&#12375;&#12390;&#12522;&#12509;&#12472;&#12488;&#12522;&#20869;&#12398;&#29305;&#23450;&#12398;&#22580;&#25152;&#12384;&#12369;&#12398;&#12467;&#12511;&#12483;&#12488;&#12434;&#35377;&#21487;&#12375;&#12383;&#12426;
  &#36870;&#12395;&#25298;&#21542;&#12375;&#12383;&#12426;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#12377;&#12427;&#27231;&#33021;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12300;&#12495;&#12531;&#12510;&#12540;&#12434;&#19982;&#12360;&#12425;&#12428;&#12383;&#12425;&#12289;&#20154;&#12399;&#12415;&#12435;&#12394;&#21608;&#22258;&#12398;&#37336;&#12434;&#25506;&#12377;&#12424;&#12358;&#12395;&#12394;&#12427;&#12301;
  &#12392;&#12356;&#12358;&#21407;&#21063;&#12393;&#12362;&#12426;&#12289;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12371;&#12398;&#27231;&#33021;&#12364;&#20351;&#12431;&#12428;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
  &#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#27880;&#24847;&#28145;&#12367;&#31649;&#29702;&#12375;&#12289;&#29305;&#23450;&#12398;&#22580;&#25152;&#12395;&#12384;&#12369;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12390;
  &#20182;&#12398;&#22580;&#25152;&#12399;&#35302;&#12425;&#12379;&#12394;&#12356;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#20855;&#21512;&#12391;&#12377;
  (<span><a class="xref" href="managing-volunteers.html" title="&#31532;8&#31456; &#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;">8&#31456;<i>&#12508;&#12521;&#12531;&#12486;&#12451;&#12450;&#12398;&#31649;&#29702;</i></a></span>
  &#12398; <a class="xref" href="committers.html" title="&#12467;&#12511;&#12483;&#12479;&#12540;">&#12300;&#12467;&#12511;&#12483;&#12479;&#12540;&#12301;</a> &#12391;&#12289;
  &#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#31649;&#29702;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;)&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12395;&#21427;&#26684;&#12395;&#31649;&#29702;&#12375;&#12390;&#12375;&#12414;&#12360;&#12400;&#12289;&#24746;&#24433;&#38911;&#12364;&#20986;&#12427;&#21487;&#33021;&#24615;&#12434;&#28187;&#12425;&#12379;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12375;&#12363;&#12375;&#12289;&#12418;&#12358;&#12377;&#12371;&#12375;&#32233;&#12420;&#12363;&#12394;&#26041;&#37341;&#12391;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
  &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#32233;&#12420;&#12363;&#12394;&#26041;&#37341;&#12434;&#25505;&#29992;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#19968;&#37096;&#20998;&#12398;&#12415;&#12408;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#19982;&#12360;&#12425;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;
  &#35373;&#23450;&#19978;&#12399;&#12522;&#12509;&#12472;&#12488;&#12522;&#20840;&#20307;&#12434;&#22793;&#26356;&#12391;&#12365;&#12427;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;
  &#12383;&#12384;&#12300;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12398;&#12399;&#12371;&#12398;&#31684;&#22258;&#12384;&#12369;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#12397;&#12301;&#12392;&#12362;&#39000;&#12356;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
  &#12371;&#12358;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#12289;&#23455;&#23475;&#12399;&#12394;&#12356;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
  &#12405;&#12388;&#12358;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12394;&#12425;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12488;&#12399;&#20309;&#12425;&#12363;&#12398;&#24418;&#12391;&#12524;&#12499;&#12517;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;
  &#35504;&#12363;&#12364;&#20104;&#26399;&#12379;&#12396;&#12467;&#12511;&#12483;&#12488;&#12434;&#12375;&#12383;&#12425;&#12289;
  &#12381;&#12428;&#12434;&#35211;&#12388;&#12369;&#12383;&#20154;&#12364;&#20309;&#12363;&#12467;&#12513;&#12531;&#12488;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12381;&#12398;&#22793;&#26356;&#12434;&#21462;&#12426;&#28040;&#12377;&#12409;&#12365;&#12384;&#12392;&#21028;&#26029;&#12375;&#12383;&#12398;&#12394;&#12425;&#12289;&#12420;&#12427;&#12371;&#12392;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
  &#12377;&#12409;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12384;&#12363;&#12425;&#12289;
  &#21336;&#12395;&#12381;&#12398;&#22793;&#26356;&#12434;&#21462;&#12426;&#28040;&#12379;&#12400;&#12356;&#12356;&#12384;&#12369;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  &#32233;&#12420;&#12363;&#12394;&#26041;&#37341;&#12395;&#12375;&#12390;&#12362;&#12367;&#21033;&#28857;&#12399;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12378;&#12289;&#12354;&#12427;&#38283;&#30330;&#32773;&#12398;&#27177;&#38480;&#12434;&#25313;&#24373;&#12377;&#12427;
  &#65288;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#38263;&#24180;&#12363;&#12363;&#12431;&#12387;&#12390;&#12356;&#12427;&#12392;&#12289;&#12424;&#12367;&#12354;&#12427;&#12371;&#12392;&#12391;&#12377;&#65289;
  &#22580;&#21512;&#12395;&#19968;&#20999;&#25163;&#38291;&#12364;&#12363;&#12363;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#21336;&#12395;&#12300;&#20170;&#26085;&#12363;&#12425;&#12399;&#12289;&#12371;&#12371;&#12418;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12356;&#12356;&#12424;&#12301;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12289;
  &#24460;&#12399;&#12377;&#12368;&#12395;&#12467;&#12511;&#12483;&#12488;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#27425;&#12395;&#12289;&#12424;&#12426;&#32251;&#23494;&#12394;&#26041;&#27861;&#12391;&#27177;&#38480;&#12398;&#25313;&#24373;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#19968;&#33324;&#12395;&#12289;&#12456;&#12522;&#12450; X &#12398;&#12467;&#12511;&#12483;&#12479;&#12540;&#12364;&#12456;&#12522;&#12450; Y &#12395;&#12418;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12383;&#22580;&#21512;&#12399;&#12289;
  &#12414;&#12378; Y &#12395;&#23550;&#12377;&#12427;&#12497;&#12483;&#12481;&#12434;&#25237;&#31295;&#12375;&#12390;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#12418;&#12425;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12377;&#12391;&#12395; Y &#12408;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#12434;&#25345;&#12388;&#12513;&#12531;&#12496;&#12540;&#12364;&#12381;&#12398;&#12497;&#12483;&#12481;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#25215;&#35469;&#12375;&#12383;&#12425;&#12289;
  &#12497;&#12483;&#12481;&#12434;&#25237;&#31295;&#12375;&#12383;&#20154;&#12395;&#23550;&#12375;&#12390;&#12300;&#30452;&#25509;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12418;&#12356;&#12356;&#12424;&#12301;&#12392;&#20253;&#12360;&#12414;&#12377;
  (&#12418;&#12385;&#12429;&#12435;&#12289;&#35504;&#12364;&#12524;&#12499;&#12517;&#12540;&#12375;&#12390;&#25215;&#35469;&#12375;&#12383;&#12398;&#12363;&#12392;&#12356;&#12358;&#24773;&#22577;&#12399;
  &#12525;&#12464;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#27531;&#12375;&#12390;&#12362;&#12365;&#12414;&#12377;)&#12290;
  &#12371;&#12398;&#26041;&#27861;&#12384;&#12392;&#12289;&#23455;&#38555;&#12395;&#12497;&#12483;&#12481;&#12434;&#26360;&#12356;&#12383;&#20154;&#12364;&#12467;&#12511;&#12483;&#12488;&#12434;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12399;&#12289;&#24773;&#22577;&#31649;&#29702;&#12398;&#38754;&#12391;&#12418;&#21151;&#32318;&#12434;&#12383;&#12383;&#12360;&#12427;&#24847;&#21619;&#12391;&#12418;&#37325;&#35201;&#12391;&#12377;&#12290;
</p><p>
  &#26368;&#24460;&#12395;&#12289;&#26368;&#12418;&#37325;&#35201;&#12394;&#12398;&#12364;&#12289;&#12371;&#12398;&#32233;&#12420;&#12363;&#12394;&#26041;&#24335;&#12434;&#25505;&#29992;&#12377;&#12427;&#12392;
  &#12362;&#20114;&#12356;&#12395;&#20449;&#38972;&#12375;&#12289;&#23562;&#37325;&#12375;&#12354;&#12358;&#31354;&#27671;&#12364;&#29983;&#12414;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12371;&#12398;&#26041;&#24335;&#12398;&#22580;&#21512;&#12289;&#12300;&#21531;&#12399;&#12371;&#12398;&#37096;&#20998;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#33021;&#21147;&#12364;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12387;&#12383;&#12290;
  &#12380;&#12402;&#12467;&#12511;&#12483;&#12488;&#12375;&#12390;&#12367;&#12428;&#12301;&#12392;&#12356;&#12358;&#12424;&#12358;&#12395;&#12392;&#12425;&#12428;&#12414;&#12377;&#12290;
  &#21427;&#26684;&#12395;&#31649;&#29702;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12300;&#21531;&#12398;&#12391;&#12365;&#12427;&#12371;&#12392;&#12395;&#12399;&#21046;&#38480;&#12364;&#12354;&#12427;&#12435;&#12384;&#12301;
  &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24375;&#35519;&#12377;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;
  &#12300;&#38291;&#36949;&#12387;&#12390;&#22793;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12363;&#12393;&#12358;&#12363;&#12364;&#24515;&#37197;&#12394;&#12435;&#12384;&#12301;
  &#12392;&#30097;&#12387;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24863;&#12376;&#12425;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  &#12391;&#12365;&#12428;&#12400;&#12371;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#36991;&#12369;&#12383;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12384;&#12428;&#12363;&#12434;&#26032;&#12383;&#12395;&#12467;&#12511;&#12483;&#12479;&#12540;&#12392;&#12375;&#12390;&#36814;&#12360;&#20837;&#12428;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;
  &#12415;&#12435;&#12394;&#12398;&#20449;&#38972;&#12398;&#36650;&#12398;&#20013;&#12395;&#26032;&#12375;&#12356;&#12513;&#12531;&#12496;&#12540;&#12434;&#21152;&#12360;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#38555;&#12395;&#12399;&#12289;&#26412;&#26469;&#24517;&#35201;&#12394;&#12418;&#12398;&#20197;&#19978;&#12398;&#21147;&#12434;&#19982;&#12360;&#12289;
  &#12300;&#12381;&#12428;&#12434;&#12393;&#12358;&#20351;&#12358;&#12363;&#12399;&#12354;&#12394;&#12383;&#12375;&#12384;&#12356;&#12290;&#12391;&#12418;&#12371;&#12428;&#20197;&#19978;&#12398;&#12371;&#12392;&#12399;&#12375;&#12394;&#12356;&#12391;&#12397;&#12301;
  &#12392;&#12375;&#12383;&#12411;&#12358;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  Subversion &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12289;&#12363;&#12428;&#12371;&#12428; 4 &#24180;&#20197;&#19978;&#12371;&#12398;&#12300;&#32233;&#12420;&#12363;&#12394;&#31649;&#29702;&#12301;
  &#26041;&#24335;&#12434;&#25505;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#26412;&#26360;&#12398;&#22519;&#31558;&#26178;&#28857;&#12391;&#12289;&#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540;&#12399; 33 &#20154;&#12289;
  &#19968;&#37096;&#12395;&#12384;&#12369;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12398;&#12354;&#12427;&#12513;&#12531;&#12496;&#12540;&#12364; 43 &#20154;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#31649;&#29702;&#26041;&#24335;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12364;&#31649;&#29702;&#12377;&#12427;&#12398;&#12399;&#12300;&#12467;&#12511;&#12483;&#12479;&#12540;&#12363;&#12381;&#12358;&#12391;&#12394;&#12356;&#12363;&#12301;
  &#12384;&#12369;&#12391;&#12377;&#12290;&#12381;&#12398;&#35443;&#32048; (&#12393;&#12398;&#37096;&#20998;&#12395;&#12467;&#12511;&#12483;&#12488;&#27177;&#12364;&#12354;&#12427;&#12363;&#12394;&#12393;) &#12399;&#20154;&#38291;&#12364;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;
  &#20170;&#12398;&#12392;&#12371;&#12429;&#12289;&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#12394;&#12356;&#37096;&#20998;&#12395;&#12388;&#12356;&#12390;&#25925;&#24847;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12394;&#12393;&#12392;&#12356;&#12387;&#12383;
  &#21839;&#38988;&#12399;&#30330;&#29983;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12467;&#12511;&#12483;&#12488;&#27177;&#12395;&#38306;&#12377;&#12427;&#35492;&#35299;&#12364;&#29983;&#12376;&#12383;&#12371;&#12392;&#12418;&#20309;&#24230;&#12363;&#12354;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;
  &#12356;&#12388;&#12418;&#36895;&#12420;&#12363;&#12395;&#20870;&#28288;&#35299;&#27770;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
</p><p>
  &#12371;&#12398;&#12424;&#12358;&#12394;&#33258;&#24049;&#31649;&#29702;&#26041;&#24335;&#12364;&#26126;&#12425;&#12363;&#12395;&#29694;&#23455;&#30340;&#12391;&#12394;&#12356;&#22580;&#38754;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#24403;&#28982;&#12289;&#12381;&#12435;&#12394;&#22580;&#21512;&#12399;&#21427;&#26684;&#12394;&#31649;&#29702;&#12364;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12392;&#12399;&#12356;&#12360;&#12289;&#12381;&#12435;&#12394;&#29366;&#27841;&#12399;&#12414;&#12428;&#12391;&#12377;&#12290;
  &#12383;&#12392;&#12360;&#20309;&#21315;&#20154;&#12398;&#38283;&#30330;&#32773;&#12364;&#20309;&#30334;&#19975;&#34892;&#12398;&#12467;&#12540;&#12489;&#12434;&#25201;&#12387;&#12390;&#12356;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
  &#12381;&#12398;&#12467;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12467;&#12511;&#12483;&#12488;&#12399;&#12384;&#12428;&#12363;&#20182;&#12398;&#20154;&#12395;&#12424;&#12427;&#12524;&#12499;&#12517;&#12540;&#12434;&#21463;&#12369;&#12414;&#12377;&#12290;
  &#12362;&#12363;&#12375;&#12394;&#12467;&#12511;&#12483;&#12488;&#12364;&#12354;&#12428;&#12400;&#12377;&#12368;&#12395;&#25351;&#25688;&#12373;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12418;&#12375;&#12467;&#12511;&#12483;&#12488;&#12434;&#12524;&#12499;&#12517;&#12540;&#12375;&#12354;&#12358;&#32722;&#24931;&#12364;<span class="emphasis"><em>&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;</em></span>&#12398;&#12394;&#12425;&#12289;
  &#12381;&#12428;&#12399;&#35469;&#35388;&#12471;&#12473;&#12486;&#12512;&#12364;&#12393;&#12358;&#12398;&#12371;&#12358;&#12398;&#12356;&#12358;&#20197;&#21069;&#12398;&#21839;&#38988;&#12391;&#12377;&#12290;
</p><p>
  &#12414;&#12392;&#12417;&#12427;&#12392;&#12289;&#12424;&#12387;&#12413;&#12393;&#12398;&#29702;&#30001;&#12364;&#12394;&#12356;&#38480;&#12426;&#12399;
  &#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#38480;&#12395;&#12354;&#12414;&#12426;&#27671;&#12434;&#20351;&#12358;&#24517;&#35201;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#21427;&#23494;&#12395;&#31649;&#29702;&#12375;&#12383;&#12392;&#12371;&#12429;&#12391;&#24471;&#12425;&#12428;&#12427;&#20855;&#20307;&#30340;&#12394;&#12513;&#12522;&#12483;&#12488;&#12399;&#12354;&#12414;&#12426;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12381;&#12428;&#12424;&#12426;&#20154;&#38291;&#12395;&#12424;&#12427;&#31649;&#29702;&#12395;&#38972;&#12387;&#12383;&#12411;&#12358;&#12364;&#24471;&#12425;&#12428;&#12427;&#12418;&#12398;&#12399;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
  &#12418;&#12385;&#12429;&#12435;&#12289;&#21046;&#38480;&#12434;&#12377;&#12427;&#12371;&#12392;&#33258;&#20307;&#12364;&#28961;&#24847;&#21619;&#12384;&#12392;&#12356;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#27177;&#38480;&#12398;&#12394;&#12356;&#12392;&#12371;&#12429;&#12408;&#12467;&#12511;&#12483;&#12488;&#12373;&#12379;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#12289;&#12354;&#12414;&#12426;&#12375;&#12383;&#12367;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12373;&#12425;&#12395;&#12289;&#22810;&#12367;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12300;&#12501;&#12523;&#12467;&#12511;&#12483;&#12479;&#12540; (&#21046;&#38480;&#12398;&#12394;&#12356;&#12467;&#12511;&#12483;&#12479;&#12540;)&#12301;
  &#12395;&#12399;&#20309;&#12425;&#12363;&#12398;&#29305;&#27177; (&#12383;&#12392;&#12360;&#12400;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#36939;&#21942;&#12395;&#38306;&#12377;&#12427;&#25237;&#31080;&#12395;&#21442;&#21152;&#12391;&#12365;&#12427;&#12394;&#12393;)
  &#12364;&#19982;&#12360;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12467;&#12511;&#12483;&#12488;&#27177;&#12398;&#25201;&#12356;&#12395;&#38306;&#12377;&#12427;&#25919;&#27835;&#30340;&#12394;&#24847;&#21619;&#21512;&#12356;&#12395;&#12388;&#12356;&#12390;&#12399;
  <span><a class="xref" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;">4&#31456;<i>&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</i></a></span>
  &#12398; <a class="xref" href="consensus-democracy.html#electorate" title="&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?">&#12300;&#35504;&#12364;&#25237;&#31080;&#12377;&#12427;&#12398;&#12363;?&#12301;</a> &#12391;&#35443;&#12375;&#12367;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp916384" href="#idp916384" class="para">18</a>] </sup>
      &#12381;&#12398;&#35388;&#25312;&#12392;&#12375;&#12390;&#12399;
      <a class="ulink" href="http://cia.vc/stats/vcs" target="_top">http://cia.vc/stats/vcs</a> &#12420;
      <a class="ulink" href="http://subversion.tigris.org/svn-dav-securityspace-survey.html" target="_top">http://subversion.tigris.org/svn-dav-securityspace-survey.html</a>
      &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    </p></div><div class="footnote"><p><sup>[<a id="ftn.idp1005552" href="#idp1005552" class="para">19</a>] </sup>
      <code class="filename">configure</code> &#12501;&#12449;&#12452;&#12523;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12363;&#21542;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
      &#21029;&#12398;&#35211;&#26041;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;Alexey Makhotkin &#12398;&#35352;&#20107; "<em class="citetitle">configure.in and version
      control</em>" &#12364;&#12289;&#27425;&#12398; URL &#12391;&#35211;&#12425;&#12428;&#12414;&#12377;&#12290;
      <a class="ulink" href="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/" target="_top">http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/</a>
    </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="mailing-lists.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="bug-tracker.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;</td></tr></table></div></body></html>
