<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="wikis.html" title="Wiki"><link rel="next" href="social-networking.html" title="Social Networking Services"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="wikis.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="social-networking.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="web-site"></a>&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</h2></div></div></div><p>
    &#25216;&#34899;&#30340;&#12394;&#35251;&#28857;&#12363;&#12425;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12427;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
    &#12381;&#12428;&#12411;&#12393;&#35486;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12454;&#12455;&#12502;&#12469;&#12540;&#12496;&#12434;&#36215;&#21205;&#12375;&#12289;
    &#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#26360;&#12367;&#12371;&#12392;&#12399;&#12363;&#12394;&#12426;&#21336;&#32020;&#12394;&#20181;&#20107;&#12391;&#12377;&#12375;&#12289;
    &#12506;&#12540;&#12472;&#12398;&#37197;&#32622;&#12420;&#35373;&#35336;&#12395;&#38306;&#12375;&#12390;&#37325;&#35201;&#12394;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#20197;&#21069;&#12398;&#31456;&#12391;&#36848;&#12409;&#12414;&#12375;&#12383;&#12290;
    &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#20027;&#12394;&#27231;&#33021;&#12399;&#12289;&#26126;&#24555;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27010;&#35201;&#12434;&#25552;&#20379;&#12375;&#12289;
    (&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;, &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12394;&#12393;&#12398;)&#20182;&#12398;&#12484;&#12540;&#12523;&#12434;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12392;&#32080;&#12403;&#12388;&#12369;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12354;&#12394;&#12383;&#12395;&#12454;&#12455;&#12502;&#12469;&#12540;&#12496;&#12434;&#35373;&#23450;&#12375;&#12390;&#36215;&#21205;&#12377;&#12427;&#25216;&#37327;&#12364;&#12394;&#12367;&#12390;&#12418;&#12289;
    &#12381;&#12398;&#20316;&#26989;&#12434;&#21916;&#12435;&#12391;&#12420;&#12387;&#12390;&#12367;&#12428;&#12427;&#20154;&#12434;&#25506;&#12377;&#12371;&#12392;&#12399;&#26222;&#36890;&#38627;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12392;&#12399;&#12356;&#12360;&#12289;&#26178;&#38291;&#12392;&#21172;&#21147;&#12434;&#31680;&#32004;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#36939;&#21942;&#12377;&#12427;&#12383;&#12417;&#12398;&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12390;&#12356;&#12427;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12364;&#12424;&#12367;&#22909;&#12435;&#12391;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;
</p><div class="sect2" title="&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;"><div class="titlepage"><div><div><h3 class="title"><a name="canned-hosting"></a>&#12484;&#12540;&#12523;&#12364;&#19968;&#36890;&#12426;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;</h3></div></div></div><p>
    &#19968;&#36890;&#12426;&#12398;&#12418;&#12398;&#12364;&#25539;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12395;&#12399;&#12289;&#20027;&#12395;&#20108;&#12388;&#12398;&#21033;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12417;&#12399;&#12289;&#12469;&#12540;&#12496;&#12398;&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12392;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#24111;&#22495;&#12398;&#22826;&#12373;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;
    &#36229;&#39640;&#36895;&#12394;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#19978;&#12395;&#12289;&#35079;&#25968;&#12398;&#12469;&#12540;&#12496;&#12510;&#12471;&#12531;&#12364;&#24040;&#22823;&#12394;&#12521;&#12483;&#12463;&#12395;&#21454;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#12393;&#12428;&#12384;&#12369;&#25104;&#21151;&#12375;&#12390;&#12418;&#12289;&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12434;&#20351;&#12356;&#20999;&#12387;&#12383;&#12426;&#12289;
    &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#25509;&#32154;&#12364;&#20351;&#12356;&#29289;&#12395;&#12394;&#12425;&#12394;&#12367;&#12394;&#12427;&#12371;&#12392;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12405;&#12383;&#12388;&#12417;&#12399;&#12289;&#12469;&#12452;&#12488;&#12398;&#32173;&#25345;&#12364;&#31777;&#21336;&#12394;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12289;&#12450;&#12540;&#12459;&#12452;&#12496;&#12420;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#36939;&#21942;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12418;&#12398;&#12434;&#20840;&#12390;&#36984;&#12435;&#12391;&#12367;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12414;&#12383;&#12289;&#12381;&#12428;&#12425;&#12399;&#26082;&#12395;&#35373;&#23450;&#28168;&#12415;&#12391;&#12354;&#12426;&#12289;&#33988;&#31309;&#12373;&#12428;&#12427;&#20840;&#12390;&#12398;&#12487;&#12540;&#12479;&#12398;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12395;&#12418;&#27880;&#24847;&#12434;&#25173;&#12387;&#12390;&#12367;&#12428;&#12414;&#12377;&#12290;
    &#22810;&#12367;&#12398;&#27770;&#26029;&#12434;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12501;&#12457;&#12540;&#12512;&#12395;&#20837;&#21147;&#12375;&#12289;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12373;&#12360;&#12377;&#12428;&#12400;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12381;&#12358;&#12377;&#12428;&#12400;&#24040;&#22823;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#29992;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12364;&#31361;&#28982;&#25163;&#12395;&#20837;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12428;&#12425;&#12399;&#12392;&#12390;&#12418;&#37325;&#35201;&#12394;&#21033;&#28857;&#12391;&#12377;&#12290;&#21247;&#35542;&#12289;&#20182;&#12398;&#12484;&#12540;&#12523;&#12391;&#12424;&#12356;&#12418;&#12398;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    <span class="emphasis"><em>&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12364;</em></span> &#36984;&#25246;&#12375;&#12383;&#12484;&#12540;&#12523;&#12420;&#35373;&#23450;&#12434;&#21463;&#12369;&#20837;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#27424;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12399;&#12289;&#35373;&#23450;&#12391;&#12365;&#12427;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#31684;&#22258;&#12434;&#26222;&#36890;&#29421;&#12367;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#26580;&#36575;&#24615;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#33258;&#21069;&#12391;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#31435;&#12385;&#19978;&#12370;&#12390;&#12469;&#12540;&#12496;&#12408;&#12398;&#23436;&#20840;&#12394;&#31649;&#29702;&#27177;&#38480;&#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#22580;&#21512;&#12395;&#12391;&#12365;&#12427;&#12289;
    &#12365;&#12417;&#12398;&#32048;&#12363;&#12356;&#21046;&#24481;&#12399;&#27770;&#12375;&#12390;&#12391;&#12365;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    &#12371;&#12398;&#12371;&#12392;&#12398;&#12424;&#12356;&#20363;&#12364;&#12289;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#25201;&#12356;&#12391;&#12377;&#12290;
    &#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12399;&#12289;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435; &#8212;
    &#12383;&#12392;&#12360;&#12400;&#12289;FAQ&#12398;&#12487;&#12540;&#12479;&#12434;&#32232;&#38598;&#12375;&#12420;&#12377;&#12356;&#12510;&#12473;&#12479;&#12540;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#20445;&#23384;&#12375;&#12289;&#12381;&#12428;&#12363;&#12425;HTML&#12420;PDF&#12289;
    &#12381;&#12398;&#20182;&#34920;&#31034;&#29992;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#29983;&#25104;&#12377;&#12427;&#12471;&#12473;&#12486;&#12512;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;
    <span>&#12371;&#12398;&#31456;&#12398;</span> <a class="xref" href="vc.html#version-everything" title="&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;">&#12300;&#12377;&#12409;&#12390;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12383;&#12392;&#12362;&#12426;&#12289;
    &#12354;&#12394;&#12383;&#12399;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#12510;&#12473;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12384;&#12369;&#12434;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12375;&#12383;&#12356;&#12392;&#32771;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12364;&#20182;&#20154;&#12398;&#12469;&#12540;&#12496;&#12395;&#32622;&#12356;&#12390;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12510;&#12473;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;FAQ&#12398;HTML&#29256;&#12434;&#20877;&#29983;&#25104;&#12377;&#12427;&#12459;&#12473;&#12479;&#12512;&#12501;&#12483;&#12463;&#12434;&#35373;&#23450;&#12391;&#12365;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#21807;&#19968;&#12398;&#22238;&#36991;&#31574;&#12399;&#12289;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12391;&#34920;&#31034;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#33258;&#21205;&#29983;&#25104;&#12373;&#12428;&#12383;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12418;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
    &#12418;&#12387;&#12392;&#22823;&#12365;&#12394;&#24433;&#38911;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12354;&#12394;&#12383;&#12364;&#26395;&#12416;&#12411;&#12393;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#35211;&#12383;&#30446;&#12434;&#22793;&#12360;&#12427;&#27177;&#38480;&#12364;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#20013;&#12395;&#12399;&#12289;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#12371;&#12392;&#12434;&#35377;&#21487;&#12375;&#12390;&#12399;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#32080;&#23616;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#37197;&#32622;&#12364;&#12358;&#12435;&#12374;&#12426;&#12377;&#12427;&#12424;&#12358;&#12394;&#12420;&#12426;&#26041;&#12391;&#34920;&#31034;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;SourceForge &#12364;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12375;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20013;&#12395;&#12399;&#12289;
    &#23436;&#20840;&#12395;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12383;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12364;&#12354;&#12427;&#12369;&#12428;&#12393;&#12418;&#12289;
    &#35443;&#12375;&#12356;&#24773;&#22577;&#12434;&#21442;&#29031;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395; "Sourceforge&#19978;&#12398;&#12506;&#12540;&#12472;" &#12395;&#38283;&#30330;&#32773;&#12434;&#35480;&#23566;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    SourceForge &#12398;&#12506;&#12540;&#12472;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12395;&#12394;&#12427;&#12399;&#12378;&#12398;&#12418;&#12398;&#12391;&#12375;&#12383;&#12364;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12395;&#33258;&#21069;&#12398;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12434;&#20351;&#12431;&#12379;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    SourceForge &#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12420;CVS&#12522;&#12509;&#12472;&#12488;&#12522;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12469;&#12452;&#12488;&#12408;&#12398;&#12522;&#12531;&#12463;&#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#19981;&#24184;&#12394;&#12371;&#12392;&#12395;&#12289;SourceForge &#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12392;&#12399;&#28961;&#38306;&#20418;&#12394;&#12522;&#12531;&#12463;&#12418;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12506;&#12540;&#12472;&#12398;&#19968;&#30058;&#19978;&#37096;&#12395;&#12399;&#12496;&#12490;&#12540;&#24195;&#21578;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#30011;&#20687;&#12391;&#12354;&#12427;&#12371;&#12392;&#12418;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#24038;&#20596;&#12395;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#33288;&#21619;&#12364;&#12354;&#12427;&#20154;&#12395;&#12399;&#27526;&#12393;&#38306;&#20418;&#12364;&#12394;&#12356;&#12522;&#12531;&#12463;&#12364;&#22402;&#30452;&#12395;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#21491;&#20596;&#12395;&#12399;&#21029;&#12398;&#24195;&#21578;&#12364;&#12424;&#12367;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12506;&#12540;&#12472;&#12398;&#20013;&#22830;&#37096;&#20998;&#12384;&#12369;&#12364;&#26412;&#24403;&#12395;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#29305;&#26377;&#12398;&#20107;&#38917;&#12395;&#23554;&#29992;&#12398;&#22580;&#25152;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12371;&#12428;&#12425;&#12418;&#12431;&#12363;&#12426;&#12395;&#12367;&#12356;&#26041;&#27861;&#12391;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
    &#35370;&#21839;&#32773;&#12364;&#27425;&#12395;&#12393;&#12371;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#12425;&#12356;&#12356;&#12398;&#12363;&#12431;&#12363;&#12425;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    SourceForge &#12398;&#12506;&#12540;&#12472;&#35373;&#35336;&#12398;&#35023;&#12395;&#12399;&#12289;&#12365;&#12387;&#12392; &#8212; &#24195;&#21578;&#12398;&#12424;&#12358;&#12395;&#12289;
    SourceForge &#12398;&#31435;&#22580;&#12363;&#12425;&#12377;&#12428;&#12400;&#23588;&#12418;&#12394;&#29702;&#30001;&#12364;&#12354;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12290;&#12375;&#12363;&#12375;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31435;&#22580;&#12363;&#12425;&#35211;&#12428;&#12400;&#12289;&#12381;&#12398;&#32080;&#26524;&#12364;&#29702;&#24819;&#12398;&#12454;&#12455;&#12502;&#12506;&#12540;&#12472;&#12392;&#12399;&#12363;&#12369;&#38626;&#12428;&#12383;&#12418;&#12398;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
    &#31169;&#12399; SourceForge &#12434;&#38750;&#38627;&#12377;&#12427;&#12388;&#12418;&#12426;&#12391;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20284;&#12383;&#12424;&#12358;&#12394;&#25080;&#24565;&#12399;&#22810;&#12367;&#12398;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12395;&#12418;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
    &#37325;&#35201;&#12394;&#12398;&#12399;&#12289;&#12488;&#12524;&#12540;&#12489;&#12458;&#12501;&#12364;&#23384;&#22312;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#32173;&#25345;&#12377;&#12427;&#12383;&#12417;&#12398;&#25216;&#34899;&#30340;&#12394;&#37325;&#33655;&#12363;&#12425;&#35299;&#25918;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;
    &#20182;&#20154;&#12398;&#12420;&#12426;&#26041;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12392;&#12402;&#12365;&#12363;&#12360;&#12395;&#12399;&#12376;&#12417;&#12390;&#24681;&#24693;&#12434;&#21463;&#12369;&#12425;&#12428;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#26368;&#36969;&#12363;&#12393;&#12358;&#12363;&#12434;&#27770;&#12417;&#12425;&#12428;&#12427;&#12398;&#12399;&#12354;&#12394;&#12383;&#12384;&#12369;&#12391;&#12377;&#12290;
    &#20206;&#12395;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#36984;&#12435;&#12384;&#22580;&#21512;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;"&#12507;&#12540;&#12512;&#12392;&#12394;&#12427;URL"&#12395;&#33258;&#21069;&#12398;&#12489;&#12513;&#12452;&#12531;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;
    &#33258;&#21069;&#12398;&#12469;&#12540;&#12496;&#12395;&#31227;&#34892;&#12377;&#12427;&#20313;&#22320;&#12434;&#27531;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#33258;&#21069;&#12398;URL&#12434;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12395;&#36578;&#36865;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12375;&#12289;
    &#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12427;URL&#12395;&#23436;&#20840;&#12395;&#25163;&#12434;&#21152;&#12360;&#12383;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12434;&#32622;&#12367;&#12371;&#12392;&#12391;&#12289;
    &#12518;&#12540;&#12470;&#12540;&#12434;&#27927;&#32244;&#12373;&#12428;&#12383;&#27231;&#33021;&#12434;&#25345;&#12387;&#12383;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12395;&#35480;&#23566;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12395;&#12388;&#12356;&#12390;&#24460;&#12395;&#21029;&#12398;&#35299;&#12434;&#36984;&#12435;&#12384;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;URL&#12399;&#22793;&#12360;&#12394;&#12356;&#12424;&#12358;&#12395;&#30906;&#23455;&#12395;&#28310;&#20633;&#12434;&#12375;&#12390;&#12362;&#12367;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p><div class="sect3" title="&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#36984;&#12406;"><div class="titlepage"><div><div><h4 class="title"><a name="canned-hosting-choosing"></a>&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#36984;&#12406;</h4></div></div></div><p>
  2011&#24180;&#12364;&#22987;&#12414;&#12387;&#12383;&#29694;&#26178;&#28857;&#12391;&#12289;&#33258;&#30001;&#12395;&#12388;&#12363;&#12360;&#12427;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12392;&#12375;&#12390;&#23450;&#35413;&#12398;&#12354;&#12427;&#12398;&#12399;&#27425;&#12398;&#19977;&#12388;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12399;&#12377;&#12409;&#12390;&#12289;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#20844;&#38283;&#12377;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#29992;&#12395;&#28961;&#26009;&#12391;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12420;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12289;&#12381;&#12375;&#12390; Wiki &#12418;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;
  (&#12496;&#12452;&#12490;&#12522;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#27231;&#33021;&#12394;&#12393;&#12289;&#12381;&#12398;&#20182;&#12398;&#27231;&#33021;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
       <a class="ulink" href="http://github.com/" target="_top">GitHub</a>
       &#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399; Git &#12384;&#12369;&#12391;&#12377;&#12364;&#12289;&#12418;&#12375;&#33258;&#20998;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;
       Git &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12371;&#12371;&#12434;&#36984;&#12406;&#12398;&#12364;&#36969;&#20999;&#12391;&#12375;&#12423;&#12358;&#12290;GitHub
       &#12399; Git &#12434;&#20351;&#12387;&#12383;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#19990;&#30028;&#12398;&#20013;&#24515;&#12392;&#12394;&#12387;&#12390;&#12362;&#12426;&#12289;
       &#21508;&#31278;&#12469;&#12540;&#12499;&#12473;&#12418; Git &#12392;&#32113;&#21512;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#12414;&#12383; GitHub &#12395;&#12399;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12363;&#12425;&#12381;&#12398;&#12469;&#12540;&#12499;&#12473;&#12434;&#21033;&#29992;&#12377;&#12427;&#12383;&#12417;&#12398;
       <a class="ulink" href="http://develop.github.com/" target="_top">API</a> &#12418;&#23436;&#20633;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12469;&#12540;&#12499;&#12473;&#12399;&#20182;&#12395;&#12418;&#12356;&#12429;&#12356;&#12429;&#12354;&#12427;&#12398;&#12391;
       &#12383;&#12356;&#12375;&#12383;&#21839;&#38988;&#12395;&#12399;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
     </p></li><li class="listitem"><p>
       <a class="ulink" href="http://code.google.com/hosting/" target="_top">Google Code Hosting</a>
       &#23550;&#24540;&#12375;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12399; Subversion &#12392; Mercurial (&#23569;&#12394;&#12367;&#12392;&#12418;&#29694;&#26178;&#28857;&#12391;&#12399; Git &#12399;&#26410;&#23550;&#24540;) &#12391;&#12289;
       Wiki &#12420;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12456;&#12522;&#12450;&#12289;&#12381;&#12375;&#12390;&#12424;&#12367;&#12391;&#12365;&#12383;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12418;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#12414;&#12383;&#12289;API &#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395;&#12399;&#24403;&#28982;&#12394;&#12364;&#12425;&#12381;&#12428;&#33258;&#36523;&#12398; API &#12364;&#12354;&#12426;&#12289;&#21839;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12418;
       <a class="ulink" href="http://code.google.com/p/support/wiki/IssueTrackerAPI" target="_top">&#23554;&#29992;&#12398; API</a> &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Wiki &#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12399; <a class="ulink" href="http://code.google.com/p/support/wiki/WikiFAQ#How_do_I_edit_a_wiki_page_directly_through_subversion?" target="_top">&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12392;&#36899;&#21205;</a> &#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12473;&#12463;&#12522;&#12503;&#12488;&#12363;&#12425;&#32232;&#38598;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
       &#12414;&#12383;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12456;&#12522;&#12450;&#12395;&#12418; <a class="ulink" href="http://code.google.com/p/support/wiki/ScriptedUploads" target="_top">&#12473;&#12463;&#12522;&#12503;&#12488;&#12395;&#12424;&#12427;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;</a> &#12392;&#12356;&#12358;&#21517;&#12398; API &#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
       &#12414;&#12383;&#12289;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12392;&#12375;&#12390; <a class="ulink" href="http://groups.google.com/" target="_top">Google Groups</a> &#12364;&#20351;&#12360;&#12414;&#12377;&#12290;
     </p></li><li class="listitem"><p>
       <a class="ulink" href="http://sourceforge.net/" target="_top">SourceForge</a>
       &#12371;&#12428;&#12399;&#26368;&#12418;&#21476;&#12367;&#12363;&#12425;&#12354;&#12427;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12391;&#12289;&#21476;&#12367;&#12363;&#12425;&#12354;&#12427;&#12384;&#12369;&#12354;&#12387;&#12390;&#20170;&#12391;&#12418;&#35215;&#27169;&#12364;&#26368;&#22823;&#12391;&#12377;&#12290;
       &#20182;&#12398;&#20108;&#12388;&#12398;&#12469;&#12452;&#12488;&#12364;&#29992;&#24847;&#12377;&#12427;&#27231;&#33021;&#12434;&#12377;&#12409;&#12390;&#20633;&#12360;&#12390;&#12362;&#12426;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12418;&#38750;&#24120;&#12395;&#20351;&#12356;&#12420;&#12377;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;
       &#12375;&#12363;&#12375;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12506;&#12540;&#12472;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#24195;&#21578;&#12502;&#12525;&#12483;&#12463;&#12364;&#27671;&#12395;&#12394;&#12427;&#12392;&#12356;&#12358;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
       &#29694;&#26178;&#28857;&#12391;&#12399;&#12289;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#19977;&#24040;&#38957;&#12398;&#20013;&#12391;&#21807;&#19968;&#12289;&#20027;&#35201;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;
       (Git&#12289;Subversion&#12289;Mercurial &#12381;&#12375;&#12390; CVS) &#12398;&#12377;&#12409;&#12390;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
       SourceForge &#12395;&#12399;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12469;&#12540;&#12499;&#12473;&#12418;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
       &#12418;&#12385;&#12429;&#12435;&#20182;&#12398;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
     </p></li></ul></div><p>
  <a class="ulink" href="http://www.apache.org/" target="_top">Apache Software Foundation</a>
  &#12398;&#12424;&#12358;&#12395;&#12289;&#33258;&#20998;&#36948;&#12398;&#20219;&#21209;&#12392;&#26082;&#12395;&#12354;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12540;&#12395;&#12358;&#12414;&#12367;&#21512;&#12387;&#12390;&#12356;&#12427;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#28961;&#26009;&#12391;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12375;&#12390;&#12356;&#12427;&#32068;&#32340;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12393;&#12428;&#12395;&#12377;&#12428;&#12400;&#12356;&#12356;&#12363;&#12431;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12428;&#12425;&#19977;&#24040;&#38957;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#12406;&#12371;&#12392;&#12434;&#24375;&#12367;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
  &#12418;&#12358;&#23569;&#12375;&#35443;&#12375;&#12367;&#35328;&#12358;&#12392;&#12289;&#12418;&#12375;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12395; Git &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425; GitHub &#12434;&#12289;
  &#12381;&#12428;&#20197;&#22806;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425; Google Code Hosting &#12434;&#20351;&#12358;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  SourceForge &#12418;&#24746;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#29694;&#26178;&#28857;&#12391;&#25954;&#12360;&#12390; SourceForge &#12434;&#36984;&#12406;&#29305;&#31558;&#12377;&#12409;&#12365;&#29702;&#30001;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
  &#12414;&#12383;&#24195;&#21578;&#12418;&#27671;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p><p>
  &#12362;&#27671;&#12389;&#12365;&#12398;&#20154;&#12418;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;&#12501;&#12522;&#12540;&#12394;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#22810;&#12367;&#12399;&#12289;
  &#12381;&#12398;&#12469;&#12452;&#12488;&#33258;&#36523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#12391;&#20844;&#38283;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;
  (&#20844;&#38283;&#12375;&#12390;&#12356;&#12427;&#12469;&#12452;&#12488;&#12392;&#12375;&#12390;&#12399; <a class="ulink" href="http://launchpad.net" target="_top">Launchpad</a>
  &#12420; <a class="ulink" href="http://gitorious.org/" target="_top">Gitorious</a> &#12381;&#12375;&#12390;
  <a class="ulink" href="http://savannah.gnu.org/" target="_top">GNU Savannah</a> &#12364;&#12354;&#12426;&#12414;&#12377;)&#12290;
  &#20491;&#20154;&#30340;&#12395;&#12399;&#12289;&#12469;&#12452;&#12488;&#33258;&#36523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12377;&#12409;&#12390;&#12398;&#12467;&#12540;&#12489;&#12395;&#12418;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12398;&#12364;&#29702;&#24819;&#12384;&#12392;&#32771;&#12360;&#12414;&#12377;&#12290;
  &#33258;&#20998;&#12398;&#12487;&#12540;&#12479;&#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12383;&#12426;&#12289;&#33258;&#20998;&#12398;&#12487;&#12540;&#12479;&#12398;&#25805;&#20316;&#12434;&#33258;&#21205;&#21270;&#12373;&#12379;&#12383;&#12426;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#37325;&#35201;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
  &#12381;&#12398;&#12424;&#12358;&#12394;&#12469;&#12452;&#12488;&#12391;&#12354;&#12428;&#12400;&#27770;&#12375;&#12390;&#12381;&#12371;&#12395;&#12525;&#12483;&#12463;&#12452;&#12531;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12394;&#12367;&#12394;&#12426;&#12289;
  &#12373;&#12425;&#12395;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#36890;&#12376;&#12390;&#25313;&#24373;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
  &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#21205;&#12363;&#12377;&#12383;&#12417;&#12398;&#12377;&#12409;&#12390;&#12398;&#12467;&#12540;&#12489;&#12434;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#20837;&#25163;&#12377;&#12427;&#12371;&#12392;&#12395;&#12399;&#12381;&#12428;&#12394;&#12426;&#12398;&#20385;&#20516;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12392;&#12399;&#12356;&#12360;&#12289;&#23455;&#38555;&#12395;&#12381;&#12398;&#12467;&#12540;&#12489;&#12434;&#36939;&#29992;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12411;&#12392;&#12435;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12392;&#12387;&#12390;&#28961;&#29702;&#12394;&#35441;&#12391;&#12377;&#12290;
  &#12371;&#12428;&#12425;&#12398;&#12469;&#12452;&#12488;&#12395;&#12399;&#20309;&#21488;&#12418;&#12398;&#12469;&#12540;&#12496;&#12540;&#12420;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12383;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12289;
  &#12381;&#12375;&#12390;&#23554;&#20219;&#12473;&#12479;&#12483;&#12501;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;&#21336;&#12395;&#12467;&#12540;&#12489;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12399;&#12289;
  &#12469;&#12540;&#12499;&#12473;&#12434;&#35079;&#35069;&#12375;&#12383;&#12426;&#12300;&#12501;&#12457;&#12540;&#12463;&#12301;&#12375;&#12383;&#12426;&#12377;&#12427;&#12398;&#12399;&#28961;&#29702;&#12394;&#12398;&#12391;&#12377;&#12290;
  &#22823;&#20107;&#12394;&#12398;&#12399;&#12289;&#33258;&#20998;&#12398;&#12487;&#12540;&#12479;&#12364;&#12375;&#12400;&#12425;&#12428;&#12390;&#12375;&#12414;&#12431;&#12394;&#12356;&#12398;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
</p><p>
  Wikipedia &#12395; <a class="ulink" href="http://en.wikipedia.org/wiki/Comparison_of_open_source_software_hosting_facilities" target="_top">&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12540;&#12499;&#12473;&#12398;&#27604;&#36611;</a>
  (<a class="ulink" href="http://ja.wikipedia.org/wiki/OSS%E3%83%9B%E3%82%B9%E3%83%86%E3%82%A3%E3%83%B3%E3%82%B0%E3%82%B5%E3%83%BC%E3%83%93%E3%82%B9%E3%81%AE%E6%AF%94%E8%BC%83" target="_top">&#26085;&#26412;&#35486;</a>)
  &#12398;&#35352;&#20107;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#29872;&#22659;&#12398;&#26368;&#26032;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12414;&#12378;&#12371;&#12371;&#12434;&#35211;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
  &#12414;&#12383;&#12289;Haggen So &#12399;&#12289;&#21338;&#22763;&#35542;&#25991;
  <em class="citetitle">Construction of an Evaluation Model for Free/Open Source Project Hosting (FOSPHost) sites</em>
  &#12398;&#30740;&#31350;&#12398;&#19968;&#29872;&#12392;&#12375;&#12390;&#12373;&#12414;&#12374;&#12414;&#12394;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12434;&#35413;&#20385;&#12375;&#12414;&#12375;&#12383;&#12290;
  &#30330;&#34920;&#12373;&#12428;&#12383;&#12398;&#12399; 2005 &#24180;&#12391;&#12377;&#12364;&#12289;2007 &#24180;&#12395;&#26356;&#26032;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12398;&#35413;&#20385;&#22522;&#28310;&#12399;&#20170;&#24460;&#12418;&#38263;&#12367;&#20351;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#24444;&#12398;&#35519;&#26619;&#32080;&#26524;&#12399;
  <a class="ulink" href="http://www.ibiblio.org/fosphost/" target="_top">http://www.ibiblio.org/fosphost/</a> &#12395;&#12354;&#12426;&#12289;
  &#27604;&#36611;&#32080;&#26524;&#12398;&#34920;&#12399; <a class="ulink" href="http://www.ibiblio.org/fosphost/exhost.htm" target="_top">http://www.ibiblio.org/fosphost/exhost.htm</a> &#12391;&#12377;&#12290;
</p><p><span class="emphasis"><em>possv2 24 March 2013: If you're reading this note, then
you've encountered this chapter while it's undergoing substantial
revision; see <a class="ulink" href="http://producingoss.com/v2.html" target="_top">producingoss.com/v2.html</a> for details.</em></span></p><p>poss2 todo: Note the possibility of mixing services from
different canned hosting sites.  Also, talk about the importance of
APIs for an exit export.  Mention the Google Groups conundrum.  Maybe
replace some of the above commentary with a reference to <a class="xref" href="canned-hosting-sites.html" title="&#20184;&#37682;A Canned Hosting Sites">&#20184;&#37682;A <i>Canned Hosting Sites</i></a>.</p></div><div class="sect3" title="&#21311;&#21517;&#24615;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21442;&#21152;"><div class="titlepage"><div><div><h4 class="title"><a name="anonymity"></a>&#21311;&#21517;&#24615;&#12392;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#21442;&#21152;</h4></div></div></div><p>
    &#21427;&#23494;&#12395;&#12399;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12395;&#38480;&#12387;&#12383;&#21839;&#38988;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;
    &#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12391;&#26368;&#12418;&#12424;&#12367;&#35211;&#12425;&#12428;&#12427;&#12398;&#12364;&#12289;&#12518;&#12540;&#12470;&#12540;&#12525;&#12464;&#12452;&#12531;&#12398;&#27231;&#33021;&#12395;&#38306;&#12377;&#12427;&#33510;&#24773;&#12391;&#12377;&#12290;
    &#12525;&#12464;&#12452;&#12531;&#27231;&#33021;&#33258;&#20307;&#12399;&#21313;&#20998;&#21336;&#32020;&#12391;&#12377;&#12290;
    &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12391;&#12399;&#12289;&#35370;&#21839;&#32773;&#12364;&#33258;&#20998;&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12392;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#30331;&#37682;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#30331;&#37682;&#12377;&#12427;&#12392;&#12518;&#12540;&#12470;&#12540;&#12398;&#12503;&#12525;&#12501;&#12451;&#12540;&#12523;&#12364;&#20445;&#23384;&#12373;&#12428;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#31649;&#29702;&#32773;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12395;&#12522;&#12509;&#12472;&#12488;&#12522;&#12408;&#12398;&#12467;&#12511;&#12483;&#12488;&#27177;&#38480;&#12398;&#12424;&#12358;&#12394;&#29305;&#23450;&#12398;&#27177;&#38480;&#12434;&#19982;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12398;&#27231;&#33021;&#12399;&#38750;&#24120;&#12395;&#26377;&#29992;&#12391;&#12289;&#12507;&#12473;&#12486;&#12451;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#20027;&#12394;&#21033;&#28857;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
    &#21839;&#38988;&#12399;&#12289;&#26410;&#30331;&#37682;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12418;&#35377;&#21487;&#12373;&#12428;&#12427;&#12409;&#12365;&#12479;&#12473;&#12463;&#12289;
    &#29305;&#12395;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#20869;&#12398;&#12501;&#12449;&#12452;&#12523;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12420;&#12289;&#26082;&#23384;&#12398;&#21839;&#38988;&#12395;&#12467;&#12513;&#12531;&#12488;&#12434;&#12388;&#12369;&#12427;&#12392;&#12365;&#12395;&#12289;
    &#24448;&#12293;&#12395;&#12375;&#12390;&#12525;&#12464;&#12452;&#12531;&#12364;&#24517;&#35201;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#28857;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12371;&#12358;&#12375;&#12383;&#12479;&#12473;&#12463;&#12395;&#12525;&#12464;&#12452;&#12531;&#12434;&#24517;&#35201;&#12392;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
    &#26412;&#26469;&#36805;&#36895;&#12391;&#20415;&#21033;&#12391;&#12354;&#12427;&#12409;&#12365;&#12479;&#12473;&#12463;&#12395;&#21442;&#21152;&#12377;&#12427;&#25975;&#23621;&#12364;&#39640;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
    &#21247;&#35542;&#12289;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#12487;&#12540;&#12479;&#12434;&#30331;&#37682;&#12375;&#12383;&#20154;&#12395;&#36899;&#32097;&#12434;&#21462;&#12426;&#12383;&#12356;&#20154;&#12418;&#12356;&#12414;&#12377;&#12364;&#12289;
    &#12381;&#12398;&#22580;&#21512;&#12399;(&#26412;&#20154;&#12364;&#26395;&#12435;&#12384;&#22580;&#21512;&#12395;)&#38651;&#23376;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12391;&#12365;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#35373;&#12369;&#12390;&#12362;&#12369;&#12400;&#21313;&#20998;&#12391;&#12377;&#12290;
    &#26032;&#12375;&#12356;&#12518;&#12540;&#12470;&#12540;&#12364;&#12496;&#12464;&#12434;&#30330;&#35211;&#12375;&#12390;&#22577;&#21578;&#12375;&#12383;&#12356;&#12392;&#24605;&#12387;&#12383;&#12392;&#12375;&#12390;&#12289;
    &#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12395;&#20837;&#21147;&#12377;&#12427;&#21069;&#12395;&#12450;&#12459;&#12454;&#12531;&#12488;&#20316;&#25104;&#12501;&#12457;&#12540;&#12512;&#12434;&#20837;&#21147;&#12375;&#12394;&#12356;&#12392;&#12356;&#12369;&#12394;&#12356;&#12392;&#12431;&#12363;&#12428;&#12400;&#12358;&#12435;&#12374;&#12426;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#32080;&#23616;&#12496;&#12464;&#12434;&#30331;&#37682;&#12375;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12518;&#12540;&#12470;&#12540;&#12434;&#31649;&#29702;&#12377;&#12427;&#21033;&#28857;&#12399;&#12289;&#36890;&#24120;&#12399;&#27424;&#28857;&#12395;&#21213;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12518;&#12540;&#12470;&#12540;&#12434;&#21311;&#21517;&#12391;&#34892;&#21205;&#12373;&#12379;&#12427;&#36984;&#25246;&#32930;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;
    <span class="emphasis"><em>&#20840;&#12390;&#12398;</em></span> &#35501;&#12415;&#21462;&#12426;&#23554;&#29992;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;
    &#29305;&#12395;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12420;&#12289;&#25345;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;wiki&#12506;&#12540;&#12472;&#12398;&#12487;&#12540;&#12479;&#20837;&#21147;&#12395;&#12388;&#12356;&#12390;&#12418;&#12289;
    &#12525;&#12464;&#12452;&#12531;&#12375;&#12390;&#12356;&#12394;&#12356;&#12518;&#12540;&#12470;&#12540;&#12395;&#35377;&#21487;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="wikis.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="social-networking.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">Wiki </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> Social Networking Services</td></tr></table></div></body></html>
