<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Wiki</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="technical-infrastructure.html" title="&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;"><link rel="prev" href="rss.html" title="RSS &#12501;&#12451;&#12540;&#12489;"><link rel="next" href="web-site.html" title="&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Wiki</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="rss.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;3&#31456; &#25216;&#34899;&#30340;&#12394;&#21839;&#38988;</th><td width="20%" align="right"> <a accesskey="n" href="web-site.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="Wiki"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="wikis"></a>Wiki</h2></div></div></div><p>
    <em class="firstterm">wiki</em> &#12392;&#12399;&#12289;
    &#35370;&#12428;&#12383;&#20154;&#12364;&#35504;&#12391;&#12418;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#32232;&#38598;&#12375;&#12289;
    &#25313;&#24373;&#12391;&#12365;&#12427;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
    "wiki" (&#12495;&#12527;&#12452;&#35486;&#12391; "&#32032;&#26089;&#12356;" &#12392;&#12363; "&#36229;&#39640;&#36895;&#12398;"&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#65289;&#12392;&#12356;&#12358;&#29992;&#35486;&#12399;&#12289;
    &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#32232;&#38598;&#12364;&#12391;&#12365;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#25351;&#12377;&#12418;&#12398;&#12392;&#12375;&#12390;&#12418;&#20351;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    wiki &#12399;1995&#24180;&#12395;&#30330;&#26126;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;
    2000&#24180;&#12363;2001&#24180;&#12395;&#20154;&#27671;&#12364;&#20986;&#12390;&#12289;
    wiki &#12505;&#12540;&#12473;&#12394;&#28961;&#26009;&#12398;&#30334;&#31185;&#20107;&#20856;&#12391;&#12354;&#12427; Wikipedia(<a class="ulink" href="http://www.wikipedia.org/" target="_top">http://www.wikipedia.org/</a>) &#12398;&#25104;&#21151;&#12364;&#12381;&#12428;&#12434;&#24460;&#25276;&#12375;&#12375;&#12414;&#12375;&#12383;&#12290;
    wiki &#12399;&#12289;IRC&#12392;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#20013;&#38291;&#30340;&#12394;&#12418;&#12398;&#12392;&#32771;&#12360;&#12428;&#12400;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    wiki &#12399;&#21363;&#26178;&#24615;&#12364;&#12394;&#12356;&#12398;&#12391;&#12289;
    &#33258;&#20998;&#12364;&#26356;&#26032;&#12377;&#12427;&#20869;&#23481;&#12395;&#12388;&#12356;&#12390;&#25512;&#25970;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#12381;&#12428;&#12391;&#12356;&#12390;&#26356;&#26032;&#12418;&#38750;&#24120;&#12395;&#31777;&#21336;&#12394;&#12398;&#12391;&#12289;&#36890;&#24120;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12398;&#12395;&#27604;&#12409;&#12390;&#12289;
    HTML&#12395;&#24745;&#12416;&#36000;&#25285;&#12364;&#23567;&#12373;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p><p>
    wiki &#12399;&#12414;&#12384;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#27161;&#28310;&#30340;&#12394;&#12484;&#12540;&#12523;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#22810;&#20998;&#12377;&#12368;&#12395;&#12381;&#12358;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    wiki&#12399;&#27604;&#36611;&#30340;&#26032;&#12375;&#12356;&#25216;&#34899;&#12391;&#12377;&#12375;&#12289;
    &#20154;&#12293;&#12399; wiki &#12434;&#12356;&#12429;&#12356;&#12429;&#12394;&#12420;&#12426;&#26041;&#12391;&#12414;&#12384;&#35430;&#12375;&#12390;&#12356;&#12427;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#8212;&#20170;&#12398;&#27573;&#38542;&#12391;&#12399;&#12289;
    2,3&#35686;&#21578;&#12434;&#12377;&#12427;&#12384;&#12369;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#12289;
    wiki &#12398;&#25104;&#21151;&#12434;&#20998;&#26512;&#12377;&#12427;&#12424;&#12426;&#12399;&#12289;
    wiki &#12398;&#38291;&#36949;&#12387;&#12383;&#20351;&#12356;&#26041;&#12434;&#20998;&#26512;&#12377;&#12427;&#26041;&#12364;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p><p>
    wiki &#12434;&#20351;&#12362;&#12358;&#12392;&#27770;&#12417;&#12383;&#12425;&#12289;
    &#35211;&#36890;&#12375;&#12398;&#33391;&#12356;&#12469;&#12452;&#12488;&#27083;&#25104;&#12395;&#12377;&#12427;&#12371;&#12392;&#12392;&#12289;
    &#39749;&#21147;&#30340;&#12394;&#35211;&#12383;&#30446;&#12395;&#12394;&#12427;&#12424;&#12358;&#12395;&#29305;&#12395;&#21147;&#12434;&#27880;&#12366;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12428;&#12399;&#35370;&#21839;&#32773;&#65288;i.e. &#32232;&#38598;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#20154;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#65289;&#12364;&#28961;&#24847;&#35672;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#32232;&#38598;&#12375;&#12383;&#12425;&#12424;&#12356;&#12363;&#12364;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
    &#21516;&#12376;&#12367;&#37325;&#35201;&#12394;&#12398;&#12399;&#12289;
    &#20154;&#12293;&#12434;&#35480;&#23566;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#35211;&#12383;&#30446;&#12420;&#12469;&#12452;&#12488;&#27083;&#25104;&#12395;&#38306;&#12377;&#12427;&#22522;&#28310;&#12434; wiki &#12395;&#25237;&#31295;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12289;
    wiki &#12398;&#31649;&#29702;&#32773;&#12364;&#12289;
    &#12300;&#22810;&#12367;&#12398;&#35370;&#21839;&#32773;&#12364;&#39640;&#12356;&#21697;&#36074;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#20491;&#21029;&#12395;&#36861;&#21152;&#12375;&#12390;&#12367;&#12428;&#12390;&#12356;&#12427;&#12435;&#12384;&#12363;&#12425;&#12289;
    &#12371;&#12358;&#12375;&#12383;&#26356;&#26032;&#12364;&#38598;&#12414;&#12387;&#12383;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#20840;&#20307;&#12418;&#39640;&#12356;&#21697;&#36074;&#12391;&#12354;&#12427;&#12395;&#36949;&#12356;&#12394;&#12356;&#12301;&#12392;&#12356;&#12358;&#24187;&#24819;&#12395;&#22549;&#12385;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#22810;&#12367;&#26356;&#26032;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
    &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12364;&#12358;&#12414;&#12367;&#27231;&#33021;&#12377;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#20491;&#12293;&#12398;&#12506;&#12540;&#12472;&#12420;&#27573;&#33853;&#12399;&#12289;
    &#12381;&#12428;&#33258;&#20307;&#32032;&#26228;&#12425;&#12375;&#12356;&#12418;&#12398;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#20840;&#20307;&#12364;&#28151;&#20081;&#12375;&#12383;&#12426;&#12289;
    &#12414;&#12392;&#12414;&#12387;&#12390;&#12356;&#12394;&#12356;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#32027;&#12428;&#36796;&#12435;&#12391;&#12375;&#12414;&#12358;&#12392;&#12289;&#12381;&#12358;&#12391;&#12399;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    wiki &#12434;&#20351;&#12358;&#12392;&#12289;
    &#27425;&#12398;&#12424;&#12358;&#12394;&#20107;&#24907;&#12395;&#12424;&#12367;&#24745;&#12414;&#12373;&#12428;&#12414;&#12377;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
     <span class="bold"><strong>&#35501;&#32773;&#12434;&#35480;&#23566;&#12377;&#12427;&#12523;&#12540;&#12523;&#12364;&#27424;&#12369;&#12390;&#12356;&#12427;</strong></span>
     &#12358;&#12414;&#12367;&#27083;&#25104;&#12373;&#12428;&#12383;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12399;&#12289;
     &#35370;&#21839;&#32773;&#12364;&#12356;&#12388;&#12391;&#12418;&#12469;&#12452;&#12488;&#20869;&#12398;&#12393;&#12371;&#12395;&#12356;&#12427;&#12363;&#12434;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
     &#20363;&#12360;&#12400;&#12289;&#12506;&#12540;&#12472;&#12364;&#12358;&#12414;&#12367;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;
     &#35370;&#21839;&#32773;&#12399;"&#30446;&#27425;"&#12398;&#37096;&#20998;&#12392;&#12289;"&#20869;&#23481;"&#12398;&#37096;&#20998;&#12434;&#30452;&#24863;&#30340;&#12395;&#21306;&#21029;&#12391;&#12365;&#12414;&#12377;&#12290;
     wiki&#12398;&#12506;&#12540;&#12472;&#12434;&#26356;&#26032;&#12377;&#12427;&#20154;&#12418;&#12289;
     &#12399;&#12376;&#12417;&#12363;&#12425;&#12381;&#12358;&#12356;&#12387;&#12383;&#21306;&#21029;&#12364;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#12381;&#12428;&#12434;&#23562;&#37325;&#12377;&#12427;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290;
     </p></li><li class="listitem"><p>
     <span class="bold"><strong>&#24773;&#22577;&#12364;&#37325;&#35079;&#12375;&#12390;&#12356;&#12427;</strong></span>
     wiki&#12391;&#12399;&#12289;&#26356;&#26032;&#12434;&#34892;&#12394;&#12358;&#20491;&#12293;&#12398;&#20154;&#36948;&#12364;&#12289;
     &#24773;&#22577;&#12364;&#37325;&#35079;&#12375;&#12390;&#12356;&#12427;&#12363;&#12434;&#27671;&#12395;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;
     &#20284;&#12383;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#36848;&#12409;&#12390;&#12356;&#12427;&#30064;&#12394;&#12387;&#12383;&#12506;&#12540;&#12472;&#12364;&#35079;&#25968;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12364;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
     &#12371;&#12428;&#12399;&#12289;&#19978;&#12391;&#36848;&#12409;&#12383;&#35501;&#32773;&#12434;&#35480;&#23566;&#12377;&#12427;&#12523;&#12540;&#12523;&#12364;&#27424;&#12369;&#12390;&#12356;&#12427;&#12371;&#12392;&#12392;&#12418;&#37325;&#12394;&#12427;&#37096;&#20998;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
     &#24773;&#22577;&#12364;&#37325;&#35079;&#12375;&#12390;&#12356;&#12427;&#12392;&#12289;
     &#35370;&#21839;&#32773;&#12399;&#33258;&#20998;&#12364;&#26399;&#24453;&#12377;&#12427;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#12354;&#12426;&#12363;&#12434;&#35211;&#12388;&#12369;&#12425;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;</p></li><li class="listitem"><p>
     <span class="bold"><strong>&#23550;&#35937;&#35501;&#32773;&#12364;&#27770;&#12414;&#12387;&#12390;&#12356;&#12394;&#12356;</strong></span>
     &#12371;&#12428;&#12399;&#12289;&#26356;&#26032;&#12434;&#34892;&#12394;&#12358;&#20154;&#12364;&#22810;&#12367;&#12356;&#12427;&#22580;&#21512;&#12395;&#12399;&#12354;&#12427;&#31243;&#24230;&#36991;&#12369;&#12425;&#12428;&#12394;&#12356;&#21839;&#38988;&#12391;&#12377;&#12290;
     &#12375;&#12363;&#12375;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#36861;&#21152;&#12377;&#12427;&#26041;&#27861;&#12398;&#25351;&#37341;&#12364;&#12354;&#12428;&#12400;&#12289;
     &#12371;&#12398;&#21839;&#38988;&#12391;&#33510;&#12375;&#12416;&#21487;&#33021;&#24615;&#12399;&#23569;&#12394;&#12367;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
     &#12414;&#12383;&#12289;&#26356;&#26032;&#12395;&#38306;&#12377;&#12427;&#25351;&#37341;&#12364;&#26681;&#20184;&#12367;&#12424;&#12358;&#12395;&#12289;
     &#12399;&#12376;&#12417;&#12363;&#12425;&#20363;&#12392;&#12375;&#12390;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#12383;&#12367;&#12373;&#12435;&#36861;&#21152;&#12375;&#12390;&#12362;&#12367;&#12398;&#12418;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
     </p></li></ul></div><p>
    &#12371;&#12358;&#12375;&#12383;&#21839;&#38988;&#12395;&#23550;&#12377;&#12427;&#20849;&#36890;&#12398;&#35299;&#12399;&#21516;&#12376;&#12391;&#12377;&#12290;: &#32232;&#38598;&#12395;&#38306;&#12377;&#12427;&#25351;&#37341;&#12434;&#20316;&#12426;&#12289;
    &#12381;&#12398;&#25351;&#37341;&#12434; wiki &#12395;&#25237;&#31295;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#12381;&#12428;&#12395;&#24467;&#12387;&#12390;&#12506;&#12540;&#12472;&#12434;&#32232;&#38598;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#19968;&#33324;&#12395; wiki &#12399;&#12289;&#26356;&#26032;&#12377;&#12427;&#20154;&#12364;&#33258;&#20998;&#12364;&#35211;&#12427;&#12506;&#12540;&#12472;&#12398;&#12354;&#12425;&#12422;&#12427;&#20670;&#21521;&#12434;&#30495;&#20284;&#12390;&#12375;&#12414;&#12358;&#12383;&#12417;&#12289;
    &#12418;&#12392;&#12418;&#12392;&#23384;&#22312;&#12377;&#12427;&#12506;&#12540;&#12472;&#12398;&#12354;&#12425;&#12422;&#12427;&#19981;&#20633;&#12364;&#20840;&#20307;&#12395;&#20253;&#26579;&#12375;&#12390;&#12375;&#12414;&#12356;&#12364;&#12385;&#12391;&#12377;&#12290;
    wiki &#12434;&#12383;&#12384;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#12384;&#12369;&#12391;&#12289;&#20840;&#12390;&#12358;&#12414;&#12367;&#12356;&#12367;&#12392;&#26399;&#24453;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12414;&#12378;&#12399;&#12289;&#20154;&#12293;&#12434;&#35480;&#23566;&#12377;&#12427;&#12486;&#12531;&#12503;&#12524;&#12540;&#12488;&#12392;&#12394;&#12427;&#12424;&#12358;&#12395;&#12289;
    &#12424;&#12367;&#32244;&#12425;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#32622;&#12356;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12427; wiki &#12398;&#33391;&#12356;&#20363;&#12399; Wikipedia &#12391;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;&#12289;
    &#65288;&#30334;&#31185;&#20107;&#20856;&#12398;&#38917;&#30446;&#12392;&#12356;&#12358;&#65289;&#20869;&#23481;&#12364;&#26412;&#26469; wiki &#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12392;&#12424;&#12367;&#21512;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12392;&#12356;&#12358;&#12398;&#12364;&#29702;&#30001;&#12398;&#12402;&#12392;&#12388;&#12391;&#12377;&#12290;
    &#12375;&#12363;&#12375;&#12289;Wikipedia &#12434;&#12424;&#12367;&#35519;&#12409;&#12390;&#12415;&#12427;&#12392;&#12289;
    &#31649;&#29702;&#32773;&#36948;&#12364;  &#12362;&#20114;&#12356;&#12364;&#21332;&#21147;&#12377;&#12427;&#12383;&#12417;&#12395;<span class="emphasis"><em>&#12392;&#12390;&#12418;</em></span>&#21608;&#21040;&#12395;&#28310;&#20633;&#12434;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#26032;&#12375;&#12356;&#38917;&#30446;&#12434;&#36861;&#21152;&#12377;&#12427;&#26041;&#27861;&#12289;&#36969;&#20999;&#12394;&#35251;&#28857;&#12391;&#32232;&#38598;&#12377;&#12427;&#26041;&#27861;&#12289;&#12393;&#12398;&#12424;&#12358;&#12394;&#32232;&#38598;&#12434;&#34892;&#12394;&#12358;&#12409;&#12365;&#12363;&#12289;&#36991;&#12369;&#12427;&#12409;&#12365;&#12363;&#12289;
    &#32232;&#38598;&#21512;&#25126;&#12395;&#12414;&#12388;&#12431;&#12427;&#35542;&#20105;&#12434;&#35299;&#27770;&#12377;&#12427;&#12503;&#12525;&#12475;&#12473;&#65288;&#12354;&#12427;&#27573;&#38542;&#12391;&#12399;&#12289;&#26368;&#32066;&#30340;&#12394;&#35519;&#20572;&#12418;&#21547;&#12415;&#12414;&#12377;&#65289;&#12289;
    &#12394;&#12393;&#12395;&#12414;&#12388;&#12431;&#12427;&#22806;&#37096;&#25991;&#26360;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
    &#31649;&#29702;&#32773;&#36948;&#12399;&#12289;&#32368;&#12426;&#36820;&#12375;&#19981;&#36969;&#20999;&#12395;&#32232;&#38598;&#12373;&#12428;&#12383;&#12506;&#12540;&#12472;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12395;&#12289;
    &#21839;&#38988;&#12364;&#35299;&#27770;&#12373;&#12428;&#12427;&#12414;&#12391;&#12381;&#12428;&#12434;&#12525;&#12483;&#12463;&#12391;&#12365;&#12427;&#12424;&#12358;&#12450;&#12463;&#12475;&#12473;&#21046;&#24481;&#12418;&#34892;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#35328;&#12356;&#25563;&#12360;&#12428;&#12400;&#12289;&#24444;&#12425;&#12399;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#12506;&#12540;&#12472;&#12398;&#38619;&#24418;&#12434;&#26360;&#12365;&#36796;&#12416;&#12384;&#12369;&#12391;&#12289;
    &#12358;&#12414;&#12367;&#12356;&#12367;&#12392;&#24605;&#12387;&#12390;&#12356;&#12383;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
    Wikipedia &#12399;&#12289;&#21109;&#22987;&#32773;&#36948;&#12364;&#12289;&#12393;&#12358;&#12375;&#12383;&#12425;&#20309;&#21315;&#12418;&#12398;&#12393;&#12371;&#12398;&#39340;&#12398;&#39592;&#12392;&#12418;&#12431;&#12363;&#12425;&#12394;&#12356;&#20154;&#12383;&#12385;&#12395;&#12289;
    &#20013;&#31435;&#30340;&#12394;&#35251;&#28857;&#12391;&#35352;&#20107;&#12434;&#26360;&#12363;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12363;&#12434;&#27880;&#24847;&#28145;&#12367;&#32771;&#12360;&#12383;&#12363;&#12425;&#12371;&#12381;&#12358;&#12414;&#12367;&#12356;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
    &#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391; wiki &#12434;&#20351;&#12358;&#12398;&#12395;&#12289;&#12371;&#12428;&#12392;&#21516;&#12376;&#12367;&#12425;&#12356;&#21608;&#21040;&#12395;&#12394;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12381;&#12398;&#31934;&#31070;&#12399;&#30495;&#20284;&#12427;&#20385;&#20516;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    wiki&#12395;&#38306;&#12377;&#12427;&#12373;&#12425;&#12395;&#35443;&#12375;&#12356;&#24773;&#22577;&#12399;&#12289;<a class="ulink" href="http://en.wikipedia.org/wiki/Wiki" target="_top">http://en.wikipedia.org/wiki/Wiki</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
    &#12414;&#12383;&#12289;&#19990;&#30028;&#12391;&#26368;&#21021;&#12398;wiki&#12399;&#12414;&#12384;&#20581;&#22312;&#12391;&#12289;wiki&#12398;&#36939;&#29992;&#12395;&#38306;&#12377;&#12427;&#22810;&#12367;&#12398;&#35696;&#35542;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    : &#27096;&#12293;&#12394;&#35251;&#28857;&#12363;&#12425;&#12289;<a class="ulink" href="http://www.c2.com/cgi/wiki?WelcomeVisitors" target="_top">http://www.c2.com/cgi/wiki?WelcomeVisitors</a>,
    <a class="ulink" href="http://www.c2.com/cgi/wiki?WhyWikiWorks" target="_top">http://www.c2.com/cgi/wiki?WhyWikiWorks</a>, &#12381;&#12375;&#12390;
    <a class="ulink" href="http://www.c2.com/cgi/wiki?WhyWikiWorksNot" target="_top">http://www.c2.com/cgi/wiki?WhyWikiWorksNot</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="rss.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="web-site.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">RSS &#12501;&#12451;&#12540;&#12489; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</td></tr></table></div></body></html>
