<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#32946;&#12390;&#26041;"><link rel="up" href="social-infrastructure.html" title="&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;"><link rel="prev" href="consensus-democracy.html" title="&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681;"><link rel="next" href="non-profit.html" title="Joining or Creating a Non-Profit Organization"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="consensus-democracy.html">&#25147;&#12427;</a> </td><th width="60%" align="center">&#31532;4&#31456; &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#25919;&#27835;&#27083;&#36896;&#12392;&#31038;&#20250;&#27083;&#36896;</th><td width="20%" align="right"> <a accesskey="n" href="non-profit.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="sect1" title="&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="written-rules"></a>&#20840;&#12390;&#12434;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;</h2></div></div></div><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#35215;&#32004;&#12420;&#21512;&#24847;&#12398;&#25968;&#12364;&#22810;&#12367;&#12394;&#12426;&#36942;&#12366;&#12427;&#12383;&#12417;&#12395;&#12289;
    &#12354;&#12427;&#26178;&#28857;&#12391;&#12393;&#12371;&#12363;&#12395;&#35352;&#37682;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#29983;&#12376;&#12414;&#12377;&#12290;
    &#35352;&#37682;&#12434;&#27491;&#32113;&#12394;&#12418;&#12398;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12398;&#35696;&#35542;&#12420;&#26082;&#12395;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21512;&#24847;&#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#26126;&#31034;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#23455;&#38555;&#12395;&#35352;&#37682;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12354;&#12427;&#38306;&#36899;&#12375;&#12383;&#12473;&#12524;&#12483;&#12489;&#12434;&#21442;&#29031;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12289;
    &#19981;&#26126;&#12394;&#28857;&#12364;&#12354;&#12427;&#12392;&#12365;&#12395;&#12399;&#12418;&#12358;&#19968;&#24230;&#23563;&#12397;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#35352;&#37682;&#12375;&#12383;&#25991;&#26360;&#12395;&#12399;&#20154;&#12293;&#12434;&#39514;&#12363;&#12379;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#26360;&#12367;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12398;&#25991;&#26360;&#12399;&#21512;&#24847;&#12398;&#26681;&#25312;&#12391;&#12399;&#12394;&#12367;&#12289;&#21512;&#24847;&#12398;&#20013;&#36523;&#12434;&#35500;&#26126;&#12375;&#12383;&#12418;&#12398;&#12395;&#36942;&#12366;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#25104;&#21151;&#12377;&#12428;&#12400;&#12381;&#12428;&#12434;&#27177;&#23041;&#12354;&#12427;&#12418;&#12398;&#12392;&#12375;&#12390;&#20154;&#12293;&#12364;&#24341;&#29992;&#12375;&#12399;&#12376;&#12417;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;
    &#12381;&#12428;&#12399;&#12381;&#12398;&#25991;&#26360;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#32207;&#24847;&#12434;&#27491;&#30906;&#12395;&#21453;&#26144;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;
</p><p>
    &#12371;&#12428;&#12364; <span><a class="xref" href="getting-started.html" title="&#31532;2&#31456; &#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;">2&#31456;<i>&#12373;&#12354;&#22987;&#12417;&#12414;&#12375;&#12423;&#12358;</i></a></span> &#12398; <a class="xref" href="getting-started.html#developer-guidelines" title="&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;">&#12300;&#38283;&#30330;&#32773;&#21521;&#12369;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12301;</a> &#12391;&#36848;&#12409;&#12383;&#25991;&#26360;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#24403;&#28982;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#33509;&#12356;&#12358;&#12385;&#12399;&#12289;
    &#38263;&#12367;&#32154;&#12356;&#12390;&#12356;&#12427;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27508;&#21490;&#12398;&#12424;&#12358;&#12394;&#12289;
    &#12383;&#12417;&#12395;&#12394;&#12427;&#35441;&#25244;&#12365;&#12391;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12434;&#26360;&#12363;&#12397;&#12400;&#12394;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12375;&#12363;&#12375;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12364;&#25104;&#38263;&#12377;&#12427;&#12395;&#12388;&#12428;&#12289;
    &#26126;&#12425;&#12363;&#12395;&#12394;&#12387;&#12390;&#12365;&#12383;&#20107;&#26564;&#12434;&#21453;&#26144;&#12373;&#12379;&#12383;&#24418;&#12391;&#12289;&#25991;&#26360;&#12434;&#25913;&#35330;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p><p>
    &#25991;&#26360;&#12434;&#21253;&#25324;&#30340;&#12394;&#12418;&#12398;&#12395;&#12377;&#12427;&#12398;&#12399;&#12420;&#12417;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12393;&#12435;&#12394;&#25991;&#26360;&#12391;&#12418;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#21152;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;&#12394;&#12371;&#12392;&#12434;&#20840;&#12390;&#32178;&#32645;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#29983;&#12414;&#12428;&#12427;&#22810;&#12367;&#12398;&#35215;&#32004;&#12399;&#12289;&#12378;&#12387;&#12392;&#26263;&#40665;&#12398;&#12418;&#12398;&#12391;&#12289;
    &#27770;&#12375;&#12390;&#26126;&#31034;&#30340;&#12395;&#35328;&#21450;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12394;&#12356;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;
    &#12513;&#12531;&#12496;&#12540;&#20840;&#21729;&#12364;&#12363;&#12383;&#12367;&#12394;&#12395;&#23432;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#21336;&#12395;&#24403;&#12426;&#21069;&#36942;&#12366;&#12427;&#12398;&#12391;&#35328;&#21450;&#12373;&#12428;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;
    &#37325;&#35201;&#12384;&#12369;&#12393;&#26326;&#26151;&#12394;&#12398;&#12391;&#12383;&#12384;&#36991;&#12369;&#12390;&#12356;&#12427;&#12384;&#12369;&#12398;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#12400;&#12289;"&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#12399;&#31036;&#20736;&#27491;&#12375;&#12367;&#12375;&#12289;&#20182;&#20154;&#12434;&#23562;&#37325;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#12414;&#12383;&#12289;&#12501;&#12524;&#12540;&#12512;&#12454;&#12457;&#12540;&#12434;&#22987;&#12417;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;" &#12392;&#12363;&#12289;
    "&#32186;&#40599;&#12391;&#12289;&#35501;&#12415;&#12420;&#12377;&#12367;&#12496;&#12464;&#12398;&#12394;&#12356;&#12467;&#12540;&#12489;&#12434;&#26360;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;" &#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12434;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#26360;&#12356;&#12390;&#12418;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
    &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12428;&#12425;&#12399;&#26395;&#12414;&#12375;&#12356;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;
    &#12371;&#12428;&#12425;&#12364;&#26395;&#12414;&#12375;&#12367;&#12394;&#12356;&#12392;&#24605;&#12431;&#12428;&#12427;&#19990;&#30028;&#12399;&#23384;&#22312;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#35328;&#21450;&#12377;&#12427;&#20385;&#20516;&#12364;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290;
    &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#22833;&#31036;&#12394;&#30330;&#35328;&#12434;&#12375;&#12383;&#12426;&#12289;&#12496;&#12464;&#12384;&#12425;&#12369;&#12398;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12390;&#12356;&#12427;&#20154;&#12364;&#12356;&#12383;&#12392;&#12375;&#12390;&#12289;
    &#24444;&#12425;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#12420;&#12417;&#12429;&#12392;&#26360;&#12356;&#12390;&#12354;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12420;&#12417;&#12399;&#12375;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12371;&#12358;&#12356;&#12358;&#29366;&#27841;&#12399;&#21253;&#25324;&#30340;&#12394;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12391;&#12354;&#12425;&#12363;&#12376;&#12417;&#23550;&#20966;&#12377;&#12427;&#12418;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
    &#21839;&#38988;&#12364;&#36215;&#12365;&#12383;&#12392;&#12365;&#12395;&#23550;&#20966;&#12377;&#12409;&#12365;&#12418;&#12398;&#12394;&#12398;&#12391;&#12377;&#12290;
    &#19968;&#26041;&#12391;&#12289;&#12354;&#12427;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12391;&#12377;&#12409;&#12390;&#12398;API&#12434;&#25991;&#26360;&#21270;&#12377;&#12427;&#12523;&#12540;&#12523;&#12398;&#12424;&#12358;&#12394;
    &#12424;&#12356;&#12467;&#12540;&#12489;&#12398;&#26360;&#12365;&#26041;&#12395;&#38306;&#12377;&#12427;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12391;&#12365;&#12427;&#38480;&#12426;&#23436;&#20840;&#12394;&#12418;&#12398;&#12434;&#26360;&#12356;&#12390;&#12362;&#12367;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
    &#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#30427;&#12426;&#12371;&#12416;&#20869;&#23481;&#12434;&#27770;&#12417;&#12427;&#12424;&#12356;&#26041;&#27861;&#12399;&#12289;&#21021;&#24515;&#32773;&#12364;&#12424;&#12367;&#23563;&#12397;&#12427;&#36074;&#21839;&#12420;&#12289;
    &#32076;&#39443;&#35914;&#23500;&#12394;&#38283;&#30330;&#32773;&#12364;&#12424;&#12367;&#12371;&#12412;&#12377;&#19981;&#28288;&#12395;&#38306;&#12377;&#12427;&#25991;&#26360;&#12434;&#22522;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
    &#12371;&#12428;&#12399;&#24517;&#12378;&#12375;&#12418; FAQ &#12434;&#22522;&#12395;&#12377;&#12409;&#12365;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435; &#8212;
    &#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12399;&#12289;FAQ &#12424;&#12426;&#12431;&#12363;&#12426;&#12420;&#12377;&#12356;&#29289;&#35486;&#39080;&#12398;&#27083;&#36896;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;&#12289;
    FAQ &#12392;&#21516;&#27096;&#12289;&#23558;&#26469;&#36215;&#12371;&#12426;&#12358;&#12427;&#21839;&#38988;&#12424;&#12426;&#12418;&#12289;
    &#23455;&#38555;&#12395;&#36215;&#12371;&#12387;&#12383;&#21839;&#38988;&#12395;&#21462;&#12426;&#32068;&#12416;&#12392;&#12356;&#12358;&#29694;&#23455;&#30340;&#12394;&#21407;&#21063;&#12395;&#24467;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
</p><p>
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12420;&#12289;&#29305;&#21029;&#12394;&#25165;&#33021;&#12395;&#24693;&#12414;&#12428;&#12383;&#24185;&#37096;&#65288;&#31038;&#38263;&#12392;&#12363;&#35696;&#38263;&#12392;&#12363;&#12289;&#12381;&#12358;&#12356;&#12387;&#12383;&#12418;&#12398;&#12391;&#12377;&#65289;&#12364;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#24341;&#32153;&#12366;&#12398;&#25163;&#32154;&#12365;&#12434;&#26126;&#25991;&#21270;&#12377;&#12427;&#33391;&#12356;&#27231;&#20250;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
    &#20309;&#12425;&#12363;&#12398;&#29702;&#30001;&#12391;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#31361;&#28982;&#21435;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#29305;&#23450;&#12398;&#20154;&#12434;&#24460;&#32153;&#32773;&#12392;&#12375;&#12390;&#21336;&#12395;&#25351;&#21517;&#12377;&#12428;&#12400;&#12356;&#12356;&#12384;&#12369;&#12398;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#19968;&#33324;&#30340;&#12395;&#12399;&#12289;&#20778;&#12375;&#12356;&#29420;&#35009;&#32773;&#12364;&#12356;&#12427;&#22580;&#21512;&#12289;&#24444;&#12384;&#12369;&#12364;&#24460;&#32153;&#32773;&#12434;&#25351;&#21517;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    &#25237;&#31080;&#12391;&#36984;&#12400;&#12428;&#12383;&#24185;&#37096;&#12364;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#24444;&#12425;&#12434;&#36984;&#12406;&#12398;&#12395;&#20505;&#35036;&#32773;&#12434;&#36984;&#12403;&#12289;
    &#25237;&#31080;&#12377;&#12427;&#25163;&#32154;&#12365;&#12434;&#36367;&#12416;&#25163;&#32154;&#12365;&#12364;&#12399;&#12376;&#12417;&#12395;&#34892;&#12431;&#12428;&#12383;&#12371;&#12392;&#12434;&#25991;&#26360;&#12395;&#35352;&#37682;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
    &#12381;&#12358;&#12375;&#12383;&#25163;&#32154;&#12365;&#12364;&#12418;&#12392;&#12418;&#12392;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12399;&#12289;&#25991;&#26360;&#12395;&#25163;&#32154;&#12365;&#12434;&#26126;&#25991;&#21270;&#12377;&#12427; <span class="emphasis"><em>&#21069;&#12395;</em></span> &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#19978;&#12391;&#25163;&#32154;&#12365;&#12395;&#38306;&#12377;&#12427;&#21512;&#24847;&#12434;&#24471;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;
    &#38542;&#23652;&#30340;&#12394;&#25903;&#37197;&#27083;&#36896;&#12395;&#31070;&#32076;&#36074;&#12394;&#24907;&#24230;&#12434;&#12392;&#12427;&#20154;&#12418;&#12356;&#12427;&#12398;&#12391;&#12289;&#12371;&#12358;&#12375;&#12383;&#35441;&#38988;&#12434;&#25201;&#12358;&#12392;&#12365;&#12399;&#27671;&#12434;&#20351;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p><p>
    &#12371;&#12358;&#12375;&#12383;&#12523;&#12540;&#12523;&#12399;&#35211;&#30452;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12289;&#12392;&#12356;&#12358;&#12398;&#12434;&#26126;&#31034;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#22810;&#20998;&#19968;&#30058;&#37325;&#35201;&#12391;&#12377;&#12290;
    &#12383;&#12392;&#12360;&#25991;&#26360;&#12395;&#35352;&#37682;&#12373;&#12428;&#12383;&#35215;&#32004;&#12364;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#22952;&#23475;&#12375;&#12399;&#12376;&#12417;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
    &#12381;&#12398;&#25991;&#26360;&#12364;&#38283;&#30330;&#32773;&#12464;&#12523;&#12540;&#12503;&#12398;&#24847;&#22259;&#12434;&#24375;&#12367;&#21453;&#26144;&#12375;&#12383;&#12418;&#12398;&#12391;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#19981;&#28288;&#12420;&#38556;&#23475;&#12398;&#28304;&#12391;&#12399;&#12394;&#12356;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#21608;&#30693;&#12375;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;
    &#35215;&#32004;&#12364;&#33258;&#20998;&#12398;&#37034;&#39764;&#12434;&#12377;&#12427;&#12383;&#12403;&#12395;&#35211;&#30452;&#12375;&#12434;&#27714;&#12417;&#12427;&#20154;&#12364;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
    &#12381;&#12398;&#20154;&#12392;&#35696;&#35542;&#12377;&#12427;&#24517;&#35201;&#12399;&#24517;&#12378;&#12375;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#8212;
    &#28961;&#35222;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12364;&#26368;&#33391;&#12398;&#36984;&#25246;&#12392;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#35215;&#32004;&#12395;&#19981;&#28288;&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#19968;&#33268;&#12375;&#12390;&#12356;&#12427;&#20154;&#12364;&#20182;&#12395;&#12356;&#12427;&#12394;&#12425;&#12289;&#24444;&#12425;&#12364;&#21516;&#35519;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12428;&#12399;&#20309;&#12363;&#12434;&#35211;&#30452;&#12377;&#12409;&#12365;&#12371;&#12392;&#12434;&#12354;&#12425;&#12431;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#35504;&#12418;&#21516;&#35519;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;&#35211;&#30452;&#12375;&#12434;&#27714;&#12417;&#12427;&#20154;&#12395;&#36820;&#31572;&#12377;&#12427;&#20154;&#12399;&#12356;&#12394;&#12367;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
    &#12381;&#12375;&#12390;&#35215;&#32004;&#12399;&#20197;&#21069;&#12398;&#29366;&#24907;&#12398;&#12414;&#12414;&#27531;&#12427;&#12398;&#12391;&#12377;&#12290;
</p><p>
    &#38283;&#30330;&#32773;&#21521;&#12369;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12398;&#33391;&#12356;&#20363;&#12364;&#12405;&#12383;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12402;&#12392;&#12388;&#12399; <a class="ulink" href="http://subversion.apache.org/docs/community-guide/" target="_top">http://subversion.apache.org/docs/community-guide/</a> &#12395;&#12354;&#12427;&#12289;Subversion Cummunity Guide &#12391;&#12377;&#12290;
    &#12418;&#12358;&#12402;&#12392;&#12388;&#12399;&#12289;<a class="ulink" href="http://www.apache.org/foundation/how-it-works.html" target="_top">http://www.apache.org/foundation/how-it-works.html</a> &#12392; <a class="ulink" href="http://www.apache.org/foundation/voting.html" target="_top">http://www.apache.org/foundation/voting.html</a> &#12395;&#12354;&#12427;&#12289;Apache Software Foundation &#12398;&#32113;&#27835;&#12395;&#38306;&#12377;&#12427;&#25991;&#26360;&#12391;&#12377;&#12290;
    Apache Software Foundation &#12399;&#23455;&#38555;&#12399;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38598;&#21512;&#20307;&#12391;&#12377;&#12364;&#12289;
    &#38750;&#21942;&#21033;&#32068;&#32340;&#12392;&#12375;&#12390;&#21512;&#27861;&#30340;&#12395;&#32068;&#32340;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12424;&#12387;&#12390;&#24444;&#12425;&#12398;&#25991;&#26360;&#12395;&#12399;&#12289;&#38283;&#30330;&#12377;&#12427;&#38555;&#12398;&#35215;&#32004;&#12424;&#12426;&#12418;&#12289;
    &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#32113;&#27835;&#12377;&#12427;&#38555;&#12398;&#25163;&#32154;&#12365;&#12395;&#12388;&#12356;&#12390;&#22810;&#12367;&#35352;&#36848;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    &#12391;&#12377;&#12364;&#12289;&#12414;&#12384;&#35501;&#12416;&#20385;&#20516;&#12399;&#22823;&#12356;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
    &#12394;&#12380;&#12394;&#12425;&#12289;&#12381;&#12428;&#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#32076;&#39443;&#12434;&#38598;&#31309;&#12375;&#12383;&#25991;&#26360;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;
</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="consensus-democracy.html">&#25147;&#12427;</a> </td><td width="20%" align="center"><a accesskey="u" href="social-infrastructure.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right"> <a accesskey="n" href="non-profit.html">&#27425;&#12408;</a></td></tr><tr><td width="40%" align="left" valign="top">&#21512;&#24847;&#12395;&#22522;&#12389;&#12367;&#27665;&#20027;&#20027;&#32681; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top"> Joining or Creating a Non-Profit Organization</td></tr></table></div></body></html>
