<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#3610;&#3607;&#3607;&#3637;&#3656; 9. &#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;, &#3621;&#3636;&#3586;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &#3649;&#3621;&#3632;&#3626;&#3636;&#3607;&#3608;&#3636;&#3610;&#3633;&#3605;&#3619;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#3626;&#3619;&#3657;&#3634;&#3591;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3650;&#3629;&#3648;&#3614;&#3609;&#3595;&#3629;&#3619;&#3660;&#3626;"><link rel="up" href="index.html" title="&#3626;&#3619;&#3657;&#3634;&#3591;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3650;&#3629;&#3648;&#3614;&#3609;&#3595;&#3629;&#3619;&#3660;&#3626;"><link rel="prev" href="forks.html" title="Forks"><link rel="next" href="license-aspects.html" title="Aspects of Licenses"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#3610;&#3607;&#3607;&#3637;&#3656; 9. &#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;, &#3621;&#3636;&#3586;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &#3649;&#3621;&#3632;&#3626;&#3636;&#3607;&#3608;&#3636;&#3610;&#3633;&#3605;&#3619;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="forks.html">&#3585;&#3656;&#3629;&#3609;&#3627;&#3609;&#3657;&#3634;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="license-aspects.html">&#3605;&#3656;&#3629;&#3652;&#3611;</a></td></tr></table><hr></div><div class="chapter" title="&#3610;&#3607;&#3607;&#3637;&#3656; 9. &#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;, &#3621;&#3636;&#3586;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &#3649;&#3621;&#3632;&#3626;&#3636;&#3607;&#3608;&#3636;&#3610;&#3633;&#3605;&#3619;"><div class="titlepage"><div><div><h2 class="title"><a name="legal"></a>&#3610;&#3607;&#3607;&#3637;&#3656; 9. &#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;, &#3621;&#3636;&#3586;&#3626;&#3636;&#3607;&#3608;&#3636;&#3660; &#3649;&#3621;&#3632;&#3626;&#3636;&#3607;&#3608;&#3636;&#3610;&#3633;&#3605;&#3619;</h2></div></div></div><div class="toc"><p><b>&#3626;&#3634;&#3619;&#3610;&#3633;&#3597;</b></p><dl><dt><span class="sect1"><a href="legal.html#licenses-terminology">&#3588;&#3635;&#3624;&#3633;&#3614;&#3607;&#3660;&#3648;&#3593;&#3614;&#3634;&#3632;&#3607;&#3634;&#3591;</a></span></dt><dt><span class="sect1"><a href="license-aspects.html">Aspects of Licenses</a></span></dt><dt><span class="sect1"><a href="license-compatibility.html">The GPL and License Compatibility</a></span></dt><dt><span class="sect1"><a href="license-choosing.html">Choosing a License</a></span></dt><dd><dl><dt><span class="sect2"><a href="license-choosing.html#license-choosing-mit-x">The MIT / X Window System License</a></span></dt><dt><span class="sect2"><a href="license-choosing.html#license-choosing-gpl">The GNU General Public License</a></span></dt><dd><dl><dt><span class="sect3"><a href="license-choosing.html#is-the-gpl-free">Is the GPL free or not free?</a></span></dt></dl></dd><dt><span class="sect2"><a href="license-choosing.html#license-bsd">What About The BSD License?</a></span></dt></dl></dd><dt><span class="sect1"><a href="copyright-assignment.html">Copyright Assignment and Ownership</a></span></dt><dd><dl><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-none">Doing Nothing</a></span></dt><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-cla">Contributor License Agreements</a></span></dt><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-transfer">Transfer of Copyright</a></span></dt></dl></dd><dt><span class="sect1"><a href="dual-licensing.html">Dual Licensing Schemes</a></span></dt><dt><span class="sect1"><a href="patents.html">Patents</a></span></dt><dt><span class="sect1"><a href="licensing-further-resources.html">Further Resources</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3648;&#3621;&#3639;&#3629;&#3585;&#3626;&#3656;&#3623;&#3609;&#3651;&#3627;&#3597;&#3656;&#3649;&#3621;&#3657;&#3623;&#3592;&#3632;&#3617;&#3637;&#3612;&#3621;&#3605;&#3656;&#3629;&#3585;&#3634;&#3619;&#3648;&#3621;&#3639;&#3629;&#3585;&#3651;&#3594;&#3657;&#3650;&#3588;&#3619;&#3591;&#3585;&#3634;&#3619;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603;&#3609;&#3657;&#3629;&#3618;&#3617;&#3634;&#3585; &#3605;&#3619;&#3634;&#3610;&#3648;&#3607;&#3656;&#3634;&#3607;&#3637;&#3656;&#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3651;&#3594;&#3657;&#3618;&#3633;&#3591;&#3648;&#3611;&#3655;&#3609;&#3650;&#3629;&#3648;&#3614;&#3609;&#3595;&#3629;&#3619;&#3660;&#3626; &#3612;&#3641;&#3657;&#3651;&#3594;&#3657;&#3611;&#3585;&#3605;&#3636;&#3592;&#3632;&#3648;&#3621;&#3639;&#3629;&#3585;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3605;&#3634;&#3617;&#3588;&#3640;&#3603;&#3616;&#3634;&#3614;&#3649;&#3621;&#3632;&#3588;&#3623;&#3634;&#3617;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606; &#3652;&#3617;&#3656;&#3651;&#3594;&#3656;&#3605;&#3634;&#3617;&#3619;&#3634;&#3618;&#3621;&#3632;&#3648;&#3629;&#3637;&#3618;&#3604;&#3586;&#3629;&#3591;&#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605; &#3629;&#3618;&#3656;&#3634;&#3591;&#3652;&#3619;&#3585;&#3655;&#3605;&#3634;&#3617;&#3588;&#3640;&#3603;&#3592;&#3635;&#3648;&#3611;&#3655;&#3609;&#3607;&#3637;&#3656;&#3592;&#3632;&#3605;&#3657;&#3629;&#3591;&#3648;&#3586;&#3657;&#3634;&#3651;&#3592;&#3651;&#3609;&#3621;&#3633;&#3585;&#3625;&#3603;&#3632;&#3649;&#3621;&#3632;&#3611;&#3633;&#3597;&#3627;&#3634;&#3586;&#3629;&#3591;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3648;&#3626;&#3619;&#3637;&#3648;&#3614;&#3639;&#3656;&#3629;&#3607;&#3637;&#3656;&#3592;&#3632;&#3649;&#3609;&#3656;&#3651;&#3592;&#3623;&#3656;&#3634;&#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3609;&#3633;&#3657;&#3609;&#3648;&#3586;&#3657;&#3634;&#3585;&#3633;&#3609;&#3652;&#3604;&#3657;&#3585;&#3633;&#3610;&#3592;&#3640;&#3604;&#3617;&#3640;&#3656;&#3591;&#3627;&#3617;&#3634;&#3618;&#3586;&#3629;&#3591;&#3650;&#3588;&#3619;&#3591;&#3585;&#3634;&#3619; &#3649;&#3621;&#3632;&#3648;&#3614;&#3639;&#3656;&#3629;&#3611;&#3619;&#3638;&#3585;&#3625;&#3634;&#3585;&#3633;&#3610;&#3588;&#3609;&#3629;&#3639;&#3656;&#3609;&#3651;&#3609;&#3585;&#3634;&#3619;&#3605;&#3633;&#3604;&#3626;&#3636;&#3609;&#3651;&#3592;&#3651;&#3594;&#3657;&#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3609;&#3633;&#3657;&#3609; &#3614;&#3638;&#3591;&#3619;&#3632;&#3623;&#3633;&#3591;&#3623;&#3656;&#3634;&#3612;&#3617;&#3652;&#3617;&#3656;&#3651;&#3594;&#3656;&#3609;&#3633;&#3585;&#3585;&#3598;&#3627;&#3617;&#3634;&#3618;&#3649;&#3621;&#3632;&#3652;&#3617;&#3656;&#3617;&#3637;&#3629;&#3632;&#3652;&#3619;&#3651;&#3609;&#3610;&#3607;&#3609;&#3637;&#3657;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3594;&#3657;&#3648;&#3611;&#3655;&#3609;&#3588;&#3635;&#3611;&#3619;&#3638;&#3585;&#3625;&#3634;&#3607;&#3634;&#3591;&#3585;&#3598;&#3627;&#3617;&#3634;&#3618;&#3629;&#3618;&#3656;&#3634;&#3591;&#3648;&#3611;&#3655;&#3609;&#3607;&#3634;&#3591;&#3585;&#3634;&#3619; &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3588;&#3635;&#3611;&#3619;&#3638;&#3585;&#3625;&#3634;&#3607;&#3634;&#3591;&#3585;&#3598;&#3627;&#3617;&#3634;&#3618;&#3629;&#3618;&#3656;&#3634;&#3591;&#3648;&#3611;&#3655;&#3609;&#3607;&#3634;&#3591;&#3585;&#3634;&#3619;&#3609;&#3633;&#3657;&#3609;&#3588;&#3640;&#3603;&#3588;&#3623;&#3619;&#3611;&#3619;&#3638;&#3585;&#3625;&#3634;&#3607;&#3609;&#3634;&#3618; &#3627;&#3619;&#3639;&#3629;&#3588;&#3640;&#3603;&#3629;&#3634;&#3592;&#3648;&#3611;&#3655;&#3609;&#3607;&#3609;&#3634;&#3618;&#3648;&#3626;&#3637;&#3618;&#3648;&#3629;&#3591;</p></div><div class="sect1" title="&#3588;&#3635;&#3624;&#3633;&#3614;&#3607;&#3660;&#3648;&#3593;&#3614;&#3634;&#3632;&#3607;&#3634;&#3591;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="licenses-terminology"></a>&#3588;&#3635;&#3624;&#3633;&#3614;&#3607;&#3660;&#3648;&#3593;&#3614;&#3634;&#3632;&#3607;&#3634;&#3591;</h2></div></div></div><p>&#3651;&#3609;&#3585;&#3634;&#3619;&#3626;&#3609;&#3607;&#3609;&#3634;&#3648;&#3585;&#3637;&#3656;&#3618;&#3623;&#3585;&#3633;&#3610;&#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3650;&#3629;&#3648;&#3614;&#3609;&#3595;&#3629;&#3619;&#3660;&#3626; &#3626;&#3636;&#3656;&#3591;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3605;&#3657;&#3629;&#3591;&#3648;&#3586;&#3657;&#3634;&#3651;&#3592;&#3585;&#3656;&#3629;&#3609;&#3588;&#3639;&#3629;&#3617;&#3637;&#3588;&#3635;&#3624;&#3633;&#3614;&#3607;&#3660;&#3617;&#3634;&#3585;&#3617;&#3634;&#3618;&#3607;&#3637;&#3656;&#3614;&#3641;&#3604;&#3606;&#3638;&#3591;&#3626;&#3636;&#3656;&#3591;&#3648;&#3604;&#3637;&#3618;&#3623;&#3585;&#3633;&#3609;&#3648;&#3594;&#3656;&#3609; <em class="firstterm">&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3648;&#3626;&#3619;&#3637; (Free Software)</em>,
<em class="firstterm">&#3650;&#3629;&#3648;&#3614;&#3609;&#3595;&#3629;&#3619;&#3660;&#3626; (Open Source)</em>,
<em class="firstterm">FOSS</em>, <em class="firstterm">F/OSS</em>, &#3649;&#3621;&#3632;
<em class="firstterm">FLOSS</em> &#3586;&#3629;&#3648;&#3619;&#3636;&#3656;&#3617;&#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3649;&#3610;&#3656;&#3591;&#3611;&#3619;&#3632;&#3648;&#3616;&#3607;&#3588;&#3635;&#3648;&#3627;&#3621;&#3656;&#3634;&#3609;&#3637;&#3657;&#3652;&#3611;&#3614;&#3619;&#3657;&#3629;&#3617;&#3585;&#3633;&#3610;&#3588;&#3635;&#3629;&#3639;&#3656;&#3609;&#3654; &#3604;&#3633;&#3591;&#3609;&#3637;&#3657;</p><div class="variablelist"><dl><dt><span class="term"><em class="firstterm">&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3648;&#3626;&#3619;&#3637; (Free Software)</em></span></dt><dd><p>&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3607;&#3637;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3649;&#3592;&#3585;&#3592;&#3656;&#3634;&#3618;&#3649;&#3621;&#3632;&#3649;&#3585;&#3657;&#3652;&#3586;&#3650;&#3604;&#3618;&#3629;&#3618;&#3641;&#3656;&#3651;&#3609;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3586;&#3629;&#3591;&#3595;&#3629;&#3619;&#3660;&#3626;&#3650;&#3588;&#3657;&#3604; &#3588;&#3635;&#3609;&#3637;&#3657;&#3606;&#3641;&#3585;&#3651;&#3594;&#3657;&#3588;&#3619;&#3633;&#3657;&#3591;&#3649;&#3619;&#3585;&#3650;&#3604;&#3618; Richard Stallman &#3612;&#3641;&#3657;&#3619;&#3636;&#3648;&#3619;&#3636;&#3656;&#3617;&#3649;&#3609;&#3623;&#3588;&#3636;&#3604;&#3649;&#3621;&#3632;&#3619;&#3656;&#3634;&#3591; &#3626;&#3633;&#3597;&#3597;&#3634;&#3629;&#3609;&#3640;&#3597;&#3634;&#3605;&#3651;&#3594;&#3657;&#3591;&#3634;&#3609;&#3626;&#3634;&#3608;&#3634;&#3619;&#3603;&#3632;&#3607;&#3633;&#3656;&#3623;&#3652;&#3611; (GNU General Public License &#3627;&#3619;&#3639;&#3629;&#3607;&#3637;&#3656;&#3648;&#3619;&#3637;&#3618;&#3585;&#3618;&#3656;&#3629;&#3654;&#3623;&#3656;&#3634; GPL) &#3649;&#3621;&#3632;&#3648;&#3611;&#3655;&#3609;&#3612;&#3641;&#3657;&#3585;&#3656;&#3629;&#3605;&#3633;&#3657;&#3591;&#3617;&#3641;&#3621;&#3609;&#3636;&#3608;&#3636;&#3595;&#3629;&#3615;&#3605;&#3660;&#3649;&#3623;&#3619;&#3660;&#3648;&#3626;&#3619;&#3637; (Free Software Foundation <a class="ulink" href="http://www.fsf.org/" target="_top">http://www.fsf.org/</a>) &#3648;&#3614;&#3639;&#3656;&#3629;&#3626;&#3609;&#3633;&#3610;&#3626;&#3609;&#3640;&#3609;&#3588;&#3623;&#3634;&#3617;&#3588;&#3636;&#3604;&#3586;&#3629;&#3591;&#3648;&#3586;&#3634;</p><p>Although "free software" covers almost exactly the
              same range of software as "open source", the FSF, among
              others, prefers the former term because it emphasizes
              the idea of freedom, and the concept of
              freely redistributable software as primarily a social
              movement rather than a technical one.  The FSF
              acknowledges that the term is ambiguous&#8212;it could
              mean "free" as in "zero-cost", instead of "free" as in
              "freedom"&#8212;but feels that it's still the best term,
              all things considered, and that the other possibilities
              in English have their own ambiguities.  (Throughout this
              book, "free" is used in the "freedom" sense, not the
              "zero-cost" sense.)</p></dd><dt><span class="term"><em class="firstterm">open source software</em></span></dt><dd><p>Free software under another name.  But the
              different name reflects an important philosophical
              difference: "open source" was coined by the Open Source
              Initiative (<a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>)
              as a deliberate alternative to "free software," in order
              to make such software a more palatable choice for
              corporations, by presenting it as a development
              methodology rather than a political movement.  They may
              also have wanted to overcome another stigma: that
              anything "free" must be low quality.</p><p>While any license that is free is also open
              source, and vice versa (with a few minor exceptions),
              people tend to pick one term and stick with it.  In
              general, those who prefer "free software" are more
              likely to have a philosophical or moral stance on the
              issue, while those who prefer "open source" either don't
              view it as a matter of freedom, or are not interested in
              advertising the fact that they do.  See
              <a class="xref" href="introduction.html#free-vs-open-source" title='"Free" Versus "Open Source"'>&#3627;&#3633;&#3623;&#3586;&#3657;&#3629; &#8220;"Free" Versus "Open Source"&#8221;</a><span> in
              <a class="xref" href="introduction.html" title="&#3610;&#3607;&#3607;&#3637;&#3656; 1. Introduction">&#3610;&#3607;&#3607;&#3637;&#3656; 1, <i>Introduction</i></a></span> for a more
              detailed history of this schism.</p><p>The Free Software Foundation has an
              excellent&#8212;utterly unobjective, but nuanced and
              quite fair&#8212;exegesis of the two terms, at <a class="ulink" href="http://www.fsf.org/licensing/essays/free-software-for-freedom.html" target="_top">http://www.fsf.org/licensing/essays/free-software-for-freedom.html</a>.
              The Open Source Initiative's take on it is spread across
              two pages: <a class="ulink" href="http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a>
              and <a class="ulink" href="http://www.opensource.org/advocacy/free-notfree.php" target="_top">http://www.opensource.org/advocacy/free-notfree.php</a>.</p></dd><dt><span class="term"><em class="firstterm">FOSS</em>,
                      <em class="firstterm">F/OSS</em>,
                      <em class="firstterm">FLOSS</em></span></dt><dd><p>Where there are two of anything, there will soon
              be three, and that is exactly what is happening with
              terms for free software.  The academic world, perhaps
              wanting precision and inclusiveness over elegance, seems
              to have settled on FOSS, or sometimes F/OSS, standing
              for "Free / Open Source Software".  Another variant
              gaining momentum is FLOSS, which
              stands for "Free / Libre Open Source Software"
              (<span class="foreignphrase"><em class="foreignphrase">libre</em></span> is familiar in
              many languages and does not suffer from the ambiguities
              of "free"; see
              <a class="ulink" href="http://en.wikipedia.org/wiki/FLOSS" target="_top">http://en.wikipedia.org/wiki/FLOSS</a> for
              more).</p><p>All these terms mean essentially the same thing:
              software that can be modified and redistributed by
              everyone, sometimes&#8212;but not always&#8212;with the
              requirement that derivative works be freely
              redistributable under the same terms.</p></dd><dt><span class="term"><em class="firstterm">DFSG-compliant</em></span></dt><dd><p>Compliant with the Debian Free Software Guidelines
              (<a class="ulink" href="http://www.debian.org/social_contract#guidelines" target="_top">http://www.debian.org/social_contract#guidelines</a>).
              This is a widely-used test for whether a given license
              is truly open source
              (free, <span class="foreignphrase"><em class="foreignphrase">libre</em></span>, etc.).  The
              Debian Project's mission is to maintain an entirely free
              operating system, such that someone installing it need
              never doubt that she has the right to modify and
              redistribute any or all of the system.  The Debian Free
              Software Guidelines are the requirements that a software
              package's license must meet in order to be included in
              Debian.  Because the Debian Project spent a good deal of
              time thinking about how to construct such a test, the
              guidelines they came up with have proven very robust
              (see <a class="ulink" href="http://en.wikipedia.org/wiki/DFSG" target="_top">http://en.wikipedia.org/wiki/DFSG</a>),
              and as far as I'm aware, no serious objection to them has
              been raised either by the Free Software Foundation or
              the Open Source Initiative.  If you know that a given
              license is DFSG-compliant, you know that it guarantees
              all the important freedoms (such as forkability even
              against the original author's wishes) required to
              sustain the dynamics of an open source project.  All of
              the licenses discussed in this chapter are
              DFSG-compliant.</p></dd><dt><span class="term"><em class="firstterm">OSI-approved</em></span></dt><dd><p>Approved by the Open Source Initiative.  This is
              another widely-used test of whether a license permits
              all the necessary freedoms.  The OSI's definition of
              open source software is based on the Debian Free
              Software Guidelines, and any license that meets one
              definition almost always meets the other.  There have
              been a few exceptions over the years, but only involving
              niche licenses and none of any relevance here.  Unlike
              the Debian Project, the OSI maintains a list of all
              licenses it has ever approved, at
              <a class="ulink" href="http://www.opensource.org/licenses/" target="_top">http://www.opensource.org/licenses/</a>, so
              that being "OSI-approved" is an unambiguous state: a
              license either is or isn't on the list.</p><p>The Free Software Foundation also maintains a list
              of licenses at <a class="ulink" href="http://www.fsf.org/licensing/licenses/license-list.html" target="_top">http://www.fsf.org/licensing/licenses/license-list.html</a>.
              The FSF categorizes licenses not only by whether they
              are free, but whether they are compatible with the GNU
              General Public License.  GPL compatibility is an
              important topic, covered in
              <a class="xref" href="license-compatibility.html" title="The GPL and License Compatibility">&#3627;&#3633;&#3623;&#3586;&#3657;&#3629; &#8220;The GPL and License Compatibility&#8221;</a><span> later in this chapter</span>.</p></dd><dt><span class="term"><em class="firstterm">proprietary</em>,
                      <em class="firstterm">closed-source</em></span></dt><dd><p>The opposite of "free" or "open source."  It means
              software distributed under traditional, royalty-based
              licensing terms, where users pay per copy, or under any
              other terms sufficiently restrictive to prevent open
              source dynamics from operating.  Even software
              distributed at no charge can still be proprietary, if
              its license does not permit free redistribution and
              modification.</p><p>Generally "proprietary" and "closed-source" are
              synonyms.  However, "closed-source" additionally implies
              that the source code cannot even be seen.  Since the
              source code cannot be seen with most proprietary
              software, this is normally a distinction without a
              difference.  However, occasionally someone releases
              proprietary software under a license that allows others
              to view the source code.  Confusingly, they sometimes
              call this "open source" or "nearly open source," etc.,
              but that's misleading. The
              <span class="emphasis"><em>visibility</em></span> of the source code is
              not the issue; the important question is what you're
              allowed to do with it.  Thus, the difference between
              proprietary and closed-source is mostly irrelevant, and
              the two can be treated as synonyms.</p><p>Sometimes <em class="firstterm">commercial</em> is
              used as a synonym for "proprietary," but properly
              speaking, the two are not the same thing.  Free software
              can be commercial software.  After all, free software
              can be sold, as long as the buyers are not restricted
              from giving away copies themselves.  It can be
              commercialized in other ways as well, for example by
              selling support, services, and certification.  There are
              multimillion dollar companies built on free software
              today, so it is clearly neither inherently
              anti-commercial nor anti-corporate.  On the other hand,
              it <span class="emphasis"><em>is</em></span> anti-proprietary by its
              nature, and this is the key way in which it differs from
              traditional per-copy license models.</p></dd><dt><span class="term"><em class="firstterm">public domain</em></span></dt><dd><p>Having no copyright holder, meaning that there is
              no one who has the right to restrict copying of the
              work.  Being in the public domain is not the same as
              having no author.  Everything has an author, and even if a
              work's author or authors choose to put it in the public
              domain, that doesn't change the fact that they wrote
              it.</p><p>When a work is in the public domain, material from
              it can be incorporated into a copyrighted work, and
              thereafter <span class="emphasis"><em>that copy</em></span> of the
              material is covered under the same copyright as the
              whole work.  But this does not affect the availability
              of the original work, which remains in the public
              domain.  Thus, releasing something into the public
              domain is technically one way to make it "free,"
              according to the guidelines of most free software
              certifying organizations.  However, there are usually
              good reasons to use a license instead of just releasing
              into the public domain: even with free software, certain
              restrictions can be useful, not only to the copyright
              holder but even to recipients as well, as the next
              section makes clear.</p></dd><dt><span class="term"><em class="firstterm">copyleft</em></span></dt><dd><p>A license that uses copyright law to achieve a
              result opposite to traditional copyright.  Depending on
              whom you ask, this means either licenses that permit
              the freedoms under discussion here, or, more narrowly,
              licenses that not only permit those freedoms but
              <span class="emphasis"><em>enforce</em></span> them, by stipulating that
              the freedoms must travel with the work.  The Free
              Software Foundation uses the second definition
              exclusively; elsewhere, it's a toss-up: a lot of people
              use the term the same way the FSF does, but
              others&#8212;including some who write for mainstream
              media&#8212;tend to use the first definition.  It's not
              clear that everyone using the term is aware that there's
              a distinction to be made.</p><p>The canonical example of the narrower, stricter
              definition is the GNU General Public License, which
              stipulates that any derivative works must also be
              licensed under the GPL; see
              <a class="xref" href="license-compatibility.html" title="The GPL and License Compatibility">&#3627;&#3633;&#3623;&#3586;&#3657;&#3629; &#8220;The GPL and License Compatibility&#8221;</a><span> later in this chapter</span> for
              more.</p></dd></dl></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="forks.html">&#3585;&#3656;&#3629;&#3609;&#3627;&#3609;&#3657;&#3634;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="license-aspects.html">&#3605;&#3656;&#3629;&#3652;&#3611;</a></td></tr><tr><td width="40%" align="left" valign="top">Forks </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#3627;&#3609;&#3657;&#3634;&#3649;&#3619;&#3585;</a></td><td width="40%" align="right" valign="top"> Aspects of Licenses</td></tr></table></div></body></html>
