<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Podzi&#281;kowania</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="up" href="preface.html" title="Przedmowa"><link rel="prev" href="sources.html" title="&#377;ród&#322;a"><link rel="next" href="disclaimer.html" title="Zastrze&#380;enie"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Podzi&#281;kowania</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="sources.html">Poprzedni</a> </td><th width="60%" align="center">Przedmowa</th><td width="20%" align="right"> <a accesskey="n" href="disclaimer.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="sect1" title="Podzi&#281;kowania"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="acknowledgments"></a>Podzi&#281;kowania</h2></div></div></div><p>Napisanie tej ksi&#261;&#380;ki zaj&#281;&#322;o mi czterokrotnie wi&#281;cej czasu ni&#380; si&#281;
spodziewa&#322;em i przez wi&#281;kszo&#347;&#263; tego czasu, cokolwiek robi&#322;em, czu&#322;em
jakby nad moj&#261; g&#322;ow&#261; wisia&#322; fortepian. Bez pomocy wielu ludzi nie da&#322;bym
rady uko&#324;czy&#263; jej pozostaj&#261;c przy zdrowych zmys&#322;ach.</p><p>Andy Oram, mój wydawca w wydawnictwie O'Reilly, by&#322; marzeniem
pisarza. Poza gruntown&#261; wiedz&#261; na tym polu (zasugerowa&#322; mi wiele
tematów) ma rzadki dar zgadywania, co chce si&#281; powiedzie&#263;, i pomagania w
znalezieniu w&#322;a&#347;ciwego sposobu wyra&#380;enia tego. Praca z nim by&#322;a dla mnie
zaszczytem. Dzi&#281;ki równie&#380; dla Chucka Toporka za natychmiastowe
skierowanie tej propozycji do Andy'ego.</p><p>Brian Fitzpatrick sczytywa&#322; niemal ca&#322;y materia&#322; w trakcie jego
powstawania, co nie tylko uczyni&#322;o ksi&#261;&#380;k&#281; lepsz&#261;, ale te&#380; zmusza&#322;o mnie
do pisania w chwilach, gdy wola&#322;em by&#263; gdziekolwiek indziej, byle nie
przed komputerem. Ben Collins-Sussman i Mike Pilato tak&#380;e &#347;ledzili moje
post&#281;py i zawsze byli gotowi rozmawia&#263; - czasem szczegó&#322;owo - na dowolny
temat, na który stara&#322;em si&#281; pisa&#263; w danym tygodniu. Zwracali te&#380; uwag&#281;
kiedy traci&#322;em tempo i delikatnie pop&#281;dzali mnie, gdy by&#322;o to konieczne.
Dzi&#281;ki, ch&#322;opaki.</p><p>Biella Coleman pisa&#322;a swoj&#261; dysertacj&#281; w tym samym czasie, gdy ja
pisa&#322;em t&#281; ksi&#261;&#380;k&#281;. Ona wie, co to znaczy siada&#263; i pisa&#263; przez ca&#322;y
dzie&#324;, i by&#322;a dla mnie inspiruj&#261;cym przyk&#322;adem oraz &#380;yczliwym
s&#322;uchaczem. Ma tak&#380;e fascynuj&#261;cy wgl&#261;d w ruch wolnego oprogramowania
okiem antropologa, co dostarcza&#322;o mi zarówno pomys&#322;y jak i odniesienia,
które zdo&#322;a&#322;em wykorzysta&#263; w tej ksi&#261;&#380;ce. Alex Golub - inny antropolog
jedn&#261; nog&#261; tkwi&#261;cy w &#347;wiecie wolnego oprogramowania i tak&#380;e ko&#324;cz&#261;cy
swoj&#261; dysertacj&#281; w tym samym czasie - by&#322; niezwykle pomocny od samego
pocz&#261;tku, co ogromnie mi pomog&#322;o.</p><p>Micah Anderson w jaki&#347; sposób nigdy nie sprawia&#322; wra&#380;enia zbyt
przyt&#322;oczonego w&#322;asnym maratonem pisania, co by&#322;o inspiruj&#261;ce w chory,
wywo&#322;uj&#261;cy zazdro&#347;&#263; sposób, ale zawsze gotów by&#322; s&#322;u&#380;y&#263; swoj&#261;
przyja&#378;ni&#261;, rozmow&#261; i (przynajmniej w jednym wypadku) pomoc&#261; techniczn&#261;.
Dzi&#281;ki, Micah!</p><p>Jon Trowbridge i Sander Striker udzielali mi zarówno zach&#281;ty jak i
konkretnej pomocy - ich bogate do&#347;wiadczenie w kwestiach wolnego
oprogramowania dostarczy&#322;o mi materia&#322;u, którego nie móg&#322;bym zdoby&#263; w
&#380;aden inny sposób.</p><p>Dzi&#281;ki dla Grega Steina nie tylko za jego przyja&#378;&#324; i zach&#281;t&#281; w
najbardziej odpowiednich chwilach, ale te&#380; za pokazanie w projekcie
Subversion jak wa&#380;ne s&#261; regularne przegl&#261;dy kodu w budowaniu
spo&#322;eczno&#347;ci programistów. Dzi&#281;ki tak&#380;e Brianowi Behlendorfowi, który
taktownie wbija&#322; nam do g&#322;ów znaczenie prowadzenia dyskusji publicznie;
mam nadziej&#281;, &#380;e ta zasada znalaz&#322;a swoje odzwierciedlenie w tej
ksi&#261;&#380;ce.</p><p>Dzi&#281;ki Benjaminowi "Mako" Hillowi i Sethowi Schoenowi za ró&#380;ne
rozmowy o wolnym oprogramowaniu i jego zagadnieniach politycznych;
Zackowi Urlockerowi i Louisowi Suarez-Potts za po&#347;wi&#281;cenie czasu z ich
wype&#322;nionych planów na udzielenie wywiadów; Shanowi z listy Slashcode za
zgod&#281; na zacytowanie jego wiadomo&#347;ci oraz Haggenowi So za jego
nadzwyczaj pomocne porównanie canned-hostingu.</p><p>Dzi&#281;ki dla Alli Dekhtyar, Poliny i Soni za ich nie afiszuj&#261;c&#261; si&#281;
i cierpliw&#261; zach&#281;t&#281;. Bardzo si&#281; ciesz&#281;, &#380;e ju&#380; nie b&#281;d&#281; musia&#322; ko&#324;czy&#263;
(lub raczej bez powodzenia próbowa&#263; ko&#324;czy&#263;) naszych wieczorów wcze&#347;nie,
aby wróci&#263; do domu i pracowa&#263; nad "t&#261; ksi&#261;&#380;k&#261;".</p><p>Dzi&#281;ki dla Jacka Repenninga za przyja&#378;&#324;, rozmowy i upart&#261; odmow&#281;
zaakceptowania &#322;atwej, ale nies&#322;usznej analizy, kiedy dost&#281;pna jest
trudniejsza, ale w&#322;a&#347;ciwa. Mam nadziej&#281;, &#380;e cz&#281;&#347;&#263; z jego d&#322;ugiego
do&#347;wiadczenia zarówno z rozwijaniem oprogramowania jak i bran&#380;&#261;
programistyczn&#261; odcisn&#281;&#322;a w tej ksi&#261;&#380;ce swój &#347;lad.</p><p>CollabNet by&#322; niezwykle hojny pozwalaj&#261;c mi w elastyczny sposób
planowa&#263; czas na pisanie i nie mia&#322; pretensji gdy trwa&#322;o to d&#322;u&#380;ej ni&#380;
pocz&#261;tkowo zamierza&#322;em. Nie znam wszystkich zawi&#322;o&#347;ci na drodze do
podejmowania przez szefostwo takich decyzji, ale podejrzewam, &#380;e Sandhya
Klute, a nast&#281;pnie Mahesh Murthy, mieli z tym co&#347; wspólnego - moje
podzi&#281;kowania dla nich obu.</p><p>Ca&#322;y zespó&#322; rozwijaj&#261;cy Subversion by&#322; dla mnie inspiracj&#261; przez
ostatnie pi&#281;&#263; lat, i wi&#281;kszo&#347;&#263; tego, co znalaz&#322;o si&#281; w tej ksi&#261;&#380;ce,
nauczy&#322;em si&#281; dzi&#281;ki pracy z nimi. Nie b&#281;d&#281; im tu dzi&#281;kowa&#322; po nazwisku,
poniewa&#380; jest ich zbyt wielu, ale nalegam aby ka&#380;dy czytelnik, który
spotka cz&#322;onka tego zespo&#322;u, aby postawi&#322; mu ulubionego drinka - ja na
pewno zamierzam tak zrobi&#263;.</p><p>Wielokrotnie uskar&#380;a&#322;em si&#281; Rachel Scollon na temat stanu tej
ksi&#261;&#380;ki; zawsze by&#322;a gotowa mnie wys&#322;ucha&#263; i jakim&#347; sposobem potrafi&#322;a
czyni&#263; problemy mniejszymi ni&#380; to by&#322;o zanim z ni&#261; rozmawia&#322;em. Bardzo
mi to pomog&#322;o - dzi&#281;ki.</p><p>Dzi&#281;ki (znowu) dla Noela Taylora, który na pewno by&#322; ciekaw
dlaczego chcia&#322;em napisa&#263; kolejn&#261; ksi&#261;&#380;k&#281;, pami&#281;taj&#261;c jak bardzo
narzeka&#322;em ostatnim razem, ale którego przyja&#378;&#324; i dowodzenie "Golosem"
pozwala&#322;o muzyce gra&#263; dalej, oraz za braterstwo nawet w najbardziej
wype&#322;nionych prac&#261; momentach. Dzi&#281;ki równie&#380; dla Matthew Deana i
Dorothei Samtleben, przyjació&#322; i starych partnerów muzycznych, którzy
byli bardzo wyrozumiali, gdy moje wymówki w kwestii braku prób zaczyna&#322;y
si&#281; spi&#281;trza&#263;. Megan Jennings by&#322;a mi przez ca&#322;y czas wsparciem i
szczerze interesowa&#322;a si&#281; tematem, mimo &#380;e by&#322; jej obcy - wspania&#322;e
wzmocnienie dla niepewnego pisarza. Dzi&#281;ki, kumpelko!</p><p>Mia&#322;em czwórk&#281; znaj&#261;cych si&#281; na rzeczy i skrupulatnych recenzentów
tej ksi&#261;&#380;ki, byli to: Yoav Shapira, Andrew Stellman, Davanum Srinivas i
Ben Hyde. Gdybym by&#322; w stanie uwzgl&#281;dni&#263; wszystkie ich wspania&#322;e
sugestie, to ta ksi&#261;&#380;ka by&#322;aby lepsza. W praktyce ograniczenia czasowe
zmusi&#322;y mnie do wybierania, ale ich poprawki i tak by&#322;y znacz&#261;ce. B&#322;&#281;dy,
które w niej pozosta&#322;y, s&#261; wy&#322;&#261;cznie moje.</p><p>Moi rodzice, Frances i Henry, jak zwykle dawali mi cudowne
wsparcie, a poniewa&#380; ta ksi&#261;&#380;ka jest mniej techniczna ni&#380; poprzednie, to
&#380;ywi&#281; nadziej&#281;, &#380;e uznaj&#261; j&#261; za bardziej nadaj&#261;c&#261; si&#281; do
czytania.</p><p>Chcia&#322;bym wreszcie podzi&#281;kowa&#263; dwojgu osobom, którym dedykuj&#281; t&#281;
ksi&#261;&#380;k&#281;, Karen Underhill i Jimowi Blandy'emu. Przyja&#378;&#324; Karen i jej
zrozumienie znaczy&#322;y dla mnie wszystko, nie tylko w trakcie pisania tej
ksi&#261;&#380;ki, ale przez ostatnie siedem lat. Po prostu nie dobrn&#261;&#322;bym do
ko&#324;ca bez jej pomocy. Podobnie Jimowi, prawdziwemu przyjacielowi i
hakerowi nad hakerami, który jako pierwszy uczy&#322; mnie wolnego
oprogramowania, tak jak ptak móg&#322;by uczy&#263; samolot latania.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="sources.html">Poprzedni</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Pocz&#261;tek rozdzia&#322;u</a></td><td width="40%" align="right"> <a accesskey="n" href="disclaimer.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">&#377;ród&#322;a </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Zastrze&#380;enie</td></tr></table></div></body></html>
