<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Listy dyskusyjne</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="up" href="technical-infrastructure.html" title="Rozdzia&#322; 3. Infrastruktura techniczna"><link rel="prev" href="technical-infrastructure.html" title="Rozdzia&#322; 3. Infrastruktura techniczna"><link rel="next" href="vc.html" title="Kontrola wersji"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Listy dyskusyjne</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="technical-infrastructure.html">Poprzedni</a> </td><th width="60%" align="center">Rozdzia&#322; 3. Infrastruktura techniczna</th><td width="20%" align="right"> <a accesskey="n" href="vc.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="sect1" title="Listy dyskusyjne"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mailing-lists"></a>Listy dyskusyjne</h2></div></div></div><p>Listy dyskusyjne to chleb powszedni je&#347;li chodzi o komunikacj&#281; w
projekcie. Je&#347;li u&#380;ytkownik ma dost&#281;p do jakiego&#347; innego medium ni&#380; tylko
strona WWW, na ogó&#322; jest to jedna z list dyskusyjnych projektu. Jednak zanim
b&#281;d&#261; oni mieli kontakt z sam&#261; list&#261;, musz&#261; pozna&#263; interfejs dla list
dyskusyjnych&#8212;czyli mechanizm, za pomoc&#261; którego do&#322;&#261;czaj&#261; do listy
(subskrybuj&#261; j&#261;). To prowadzi nas do zasady numer 1 prowadzenia list
dyskusyjnych:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Nie próbuj prowadzi&#263; list dyskusyjnych
   r&#281;cznie&#8212;skorzystaj z oprogramowania do zarz&#261;dzania
   listami.</em></span></p></blockquote></div><p>Istnieje pokusa, &#380;eby od&#322;o&#380;y&#263; to na pó&#378;niej. Instalacja oprogramowania
do zarz&#261;dzania listami dyskusyjnymi mo&#380;e wydawa&#263; si&#281; przesad&#261; na samym
pocz&#261;tku. Zarz&#261;dzanie niewielkimi i ma&#322;o ruchliwymi listami r&#281;cznie mo&#380;e
wydawa&#263; si&#281; kusz&#261;co proste: wystarczy skonfigurowa&#263; alias, który
przekierowuje do ciebie, a nast&#281;pnie gdy kto&#347; na niego napisze, dodajesz
jego email do (lub usuwasz z) pliku tekstowego gromadz&#261;cego adrsy ludzi
zapisanych na list&#281;. Czy mo&#380;e by&#263; co&#347; prostszego?</p><p>Problem w tym, &#380;e porz&#261;dne zarz&#261;dzanie list&#261; dyskusyjn&#261;&#8212;do
którego ludzie ju&#380; przywykli&#8212;wcale nie jest proste. To nie tylko
zapisywanie i wypisywanie uczestników na ich &#380;yczenie. To tak&#380;e moderacja
pozwalaj&#261;ca unikn&#261;&#263; spamu, serwowanie listy w formie dziennego streszczenia
zamiast osobnych wiadomo&#347;ci, automatyczne przesy&#322;anie standardowych
informacji o li&#347;cie i projekcie, i wiele innych. Cz&#322;owiek r&#281;cznie obs&#322;uguj&#261;c
maile mo&#380;e zapewni&#263; jedynie podstawow&#261; funkcjonalno&#347;&#263;, i to nie tak
niezawodnie i szybko jak oprogramowanie.</p><p>Nowoczesne oprogramowanie do zarz&#261;dzania listami dyskusyjnymi na ogó&#322;
oferuje przynajmniej nast&#281;puj&#261;ce mo&#380;liwo&#347;ci:</p><div class="variablelist"><dl><dt><span class="term">Subskrypcja przez email i interfejs WWW</span></dt><dd><p>Gdy u&#380;ytkownik zapisze si&#281; na list&#281;, powinien
      <span class="emphasis"><em>natychmiast</em></span> otrzyma&#263; powitaln&#261; wiadomo&#347;&#263; zwrotn&#261;
      informuj&#261;c&#261; o tym, na jak&#347; grup&#281; zosta&#322; zapisany, jak korzysta&#263; z
      oprogramowania obs&#322;uguj&#261;cego list&#281; i (co najwa&#380;niejsze) jak si&#281; z niej
      wypisa&#263;. Ta automatyczna odpowied&#378; oczywi&#347;cie mo&#380;e by&#263; dostosowana do
      potrzeb danego projektu, zawieraj&#261;c informacje takie jak adres strony
      WWW, lokalizacja odpowiedzi na najcz&#281;stsze pytania (FAQ) itd.</p></dd><dt><span class="term">Subskrypcja streszczenia lub pojedynczych
  wiadomo&#347;ci</span></dt><dd><p>W trybie streszczenia u&#380;ytkownik otrzymuje jeden email dziennie,
      zawieraj&#261;cy ca&#322;y ruch na li&#347;cie danego dnia. Jest to wygodne dla
      ludzi, którzy pobie&#380;nie &#347;ledz&#261; list&#281;, nie uczestnicz&#261;c w niej,
      poniewa&#380; pozwala im przegl&#261;da&#263; wszystkie tematy w tym samym czasie i
      unikn&#261;&#263; odci&#261;gania uwagi przez pojedyncze maile.</p></dd><dt><span class="term">Mo&#380;liwo&#347;ci moderacji</span></dt><dd><p>"Moderacja" oznacza weryfikacj&#281; wiadomo&#347;ci aby upewni&#263; si&#281;, &#380;e
      a) nie s&#261; spamem, i b) s&#261; na temat,
      zanim pojawi&#261; si&#281; na li&#347;cie. Moderacja wymaga uczestnictwa cz&#322;owieka,
      cho&#263; oprogramowanie mo&#380;e bardzo u&#322;atwi&#263; ten proces. Wi&#281;cej o moderacji
      powiemy pó&#378;niej.</p></dd><dt><span class="term">Interfejs administratora</span></dt><dd><p>Mi&#281;dzy innymi pozwala on administratorowi na &#322;atwe usuwanie
      nieaktualnych adresów email. To mo&#380;e by&#263; konieczne gdy serwer odbiorcy
      zacznie odpowiada&#263; automatycznymi wiadomo&#347;ciami "Nie ma mnie pod tym
      adresem" w odpowiedzi na ka&#380;d&#261; wiadomo&#347;ci z listy. (Niektóre systemy
      list dyskusyjnych potrafi&#261; nawet samodzielnie wykry&#263; takie zachowanie,
      i wypisa&#263; dan&#261; osob&#281; z listy).</p></dd><dt><span class="term">Modyfikacja nag&#322;ówków</span></dt><dd><p>Wiele osób korzysta ze skomplikowanych filtrów w swoich
      czytnikach poczty. Oprogramowanie zarz&#261;dzaj&#261;ce list&#261; dyskusyjn&#261;
      potrafi modyfikowa&#263; pewne standardowe nag&#322;ówki wiadomo&#347;ci tak, aby
      &#322;atwiej by&#322;o z nich skorzysta&#263; (wi&#281;cej o tym dalej).</p></dd><dt><span class="term">Archiwizacja</span></dt><dd><p>Wszystkie wiadomo&#347;ci na li&#347;cie s&#261; przechowywane i publikowane w
      Internecie. Ewentualnie niektóre programy zarz&#261;dzaj&#261;ce listami
      umo&#380;liwiaj&#261; wspó&#322;prac&#281; z zewn&#281;trznymi narz&#281;dziami archiwizuj&#261;cymi, jak
      MHonArc (<a class="ulink" href="http://www.mhonarc.org/" target="_top">http://www.mhonarc.org/</a>). Jak mówi <a class="xref" href="growth.html#using-archives" title="Conspicuous Use of Archives">&#8222;Conspicuous Use of Archives&#8221;</a><span> w <a class="xref" href="communications.html" title="Rozdzia&#322; 6. Communications">Rozdzia&#322; 6, <i>Communications</i></a></span> archiwizacja jest
      konieczna.</p></dd></dl></div><p>Chodzi przede wszystkim o to, aby pokaza&#263;, &#380;e zarz&#261;dzanie listami
dyskusyjnymi to skomplikowany problem, nad którym wiele my&#347;lano, i który
zosta&#322; praktycznie rozwi&#261;zany. Zdecydowanie nie musisz by&#263; w tym ekspertem.
Powiniene&#347; jednak by&#263; &#347;wiadom, &#380;e zawsze pozostaje pole do nauki, a
zarz&#261;dzanie listami od czasu do czasu zajmie twoj&#261; uwag&#281; podczas prowadzenia
projektu wolnego oprogramowania. Dalej omówimy kilka najpowszechniejszych
problemów podczas konfiguracji listy dyskusyjnej.</p><div class="sect2" title="Unikanie spamu"><div class="titlepage"><div><div><h3 class="title"><a name="spam-prevention"></a>Unikanie spamu</h3></div></div></div><p>Do czasu, gdy te s&#322;owa zostan&#261; opublikowane, problem spamu w
Internecie zapewne uro&#347;nie dwukrotnie&#8212;lub przynajmniej mo&#380;na b&#281;dzie
odnie&#347;&#263; takie wra&#380;enie. Jeszcze nie tak dawno temu mo&#380;na by&#322;o prowadzi&#263;
list&#281; dyskusyjn&#261; bez &#380;adnych filtrów antyspamowych. Od czasu do czasu
zagubiona wiadomo&#347;&#263; pojawi&#322;a si&#281; na li&#347;cie, ale dzia&#322;o si&#281; to na tyle
rzadko, &#380;e nie sprawia&#322;o wi&#281;kszego k&#322;opotu. Te czasy ju&#380; min&#281;&#322;y. Dzi&#347; lista
dyskusyjna, która nie stosuje zabezpiecze&#324; antyspamowych, zostanie szybko
zalana &#347;mieciowymi mailami tak, &#380;e stanie si&#281; nieu&#380;ywalna. Ochrona
antyspamowa jest konieczno&#347;ci&#261;.</p><p>Ochron&#281; antyspamow&#261; mo&#380;na podzieli&#263; na dwa rodzaje: zapobieganie
pojawianiu si&#281; spamu na li&#347;cie i uniemo&#380;liwianie spamerom uzyskiwania nowych
adresów email z listy. Pierwsza z nich jest bardziej istotna, wi&#281;c zajmiemy
si&#281; ni&#261; najpierw.</p><div class="sect3" title="Filtrowanie wiadomo&#347;ci"><div class="titlepage"><div><div><h4 class="title"><a name="spam-filtering"></a>Filtrowanie wiadomo&#347;ci</h4></div></div></div><p>Istniej&#261; trzy podstawowe techniki unikania spamu, wi&#281;kszo&#347;&#263;
oprogramowania do zarz&#261;dzania list&#261; oferuje wszystkie z nich. Najlepiej
dzia&#322;aj&#261; razem:</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p><span class="bold"><strong>Umo&#380;liwianie wysy&#322;ania wiadomo&#347;ci
  jedynie subskrybentom.</strong></span></p><p>To bardzo efektywna metoda, w dodatku niezbyt prach&#322;onna,
            gdy&#380; g&#322;ównie sprowadza si&#281; do zmiany jednej opcji
            konfiguracyjnej. Pami&#281;taj jednak, &#380;e wiadomo&#347;ci które nie
            zosta&#322;y zaakceptowane, nie powinny by&#263; po prostu odrzucane.
            Zamiast tego powinny zosta&#263; przekazane do moderacji, z dwóch
            powodów. Po pierwsze, u&#380;ytkownicy nie zapisani na list&#281; powinni
            mie&#263; prawo g&#322;osu. Osoba maj&#261;ca pytanie lub sugesti&#281; nie powinna
            by&#263; zmuszana do zapisania si&#281; na list&#281; tylko po to, &#380;eby pos&#322;a&#263;
            pojedyncz&#261; wiadomo&#347;&#263;. Po drugie, nawet zapisani u&#380;ytkownicy mog&#261;
            czasem korzysta&#263; z innego adresu ni&#380; ten, pod którym s&#261; zapisani
            na list&#281;. Adres email nie jest dobrym sposobem identyfikacji
            cz&#322;owieka, i nie powinien by&#263; za taki uznawany.</p></li><li class="listitem"><p><span class="bold"><strong>Filtrowanie wiadomo&#347;ci za pomoc&#261;
  oprogramowania antyspamowego.</strong></span></p><p>Je&#347;li oprogramowanie zarz&#261;dzaj&#261;ce list&#261; daje tak&#261;
            mo&#380;liwo&#347;&#263; (wi&#281;kszo&#347;&#263; daje), mo&#380;na filtrowa&#263; wiadomo&#347;ci za pomoc&#261;
            filtrów antyspamowych. Automatyczne kategoryzownie nie jest
            doskona&#322;e, i nigdy nie b&#281;dzie, gdy&#380; trwa nieustaj&#261;cy wy&#347;cig
            zbroje&#324; pomi&#281;dzy spamerami i twórcami filtrów. Jednak mo&#380;e ono
            znacznie zredukowa&#263; ilo&#347;&#263; spamu docieraj&#261;c&#261; do kolejki
            moderacyjnej. Im wi&#281;ksza d&#322;ugo&#347;&#263; kolejki, tym wi&#281;cej ludzkiego
            czasu trzeba po&#347;wi&#281;ci&#263; na jej przejrzenie, wi&#281;c ka&#380;de
            automatyczne filtrowanie jest bardzo przydatne.</p><p>To nie miejsce na szczegó&#322;owe omówienie konfiguracji
            filtrów antyspamowych. W tym celu warto spojrze&#263; do dokumetacji
            wybranego systemu zarz&#261;dzania listami dyskusyjnymi (patrz <a class="xref" href="mailing-lists.html#mailing-list-software" title="Oprogramowanie">&#8222;Oprogramowanie&#8221;</a><span> dalej
            w tym rozdziale</span>). Oprogramowanie na ogó&#322; dostarczane
            jest z jakimi&#347; wbudowanymi mo&#380;liwo&#347;ciami antyspamowymi, ale
            czasem warto dodatkowo zainstalowa&#263; zewn&#281;trzne filtry. Mam dobre
            do&#347;wiadczenie z nast&#281;puj&#261;cymi: SpamAssassin (<a class="ulink" href="http://spamassassin.apache.org/" target="_top">http://spamassassin.apache.org/</a>) i SpamProbe (<a class="ulink" href="http://spamprobe.sourceforge.net/" target="_top">http://spamprobe.sourceforge.net/</a>). Nie chc&#281; si&#281;
            wypowiada&#263; na temat innych dost&#281;pnych filtrów antyspamowych, z
            których z pewno&#347;ci&#261; wiele jest bardzo dobrych. Po prostu sam
            korzysta&#322;em akurat z tych dwóch, i jestem z nich
            zadowolony.</p></li><li class="listitem"><p><span class="bold"><strong>Moderacja.</strong></span></p><p>Dla maili, które nie zosta&#322;y dopuszone automatycznie, jako
            pochodz&#261;ce od subskrybentów, i przesz&#322;y przez filtry
            antyspamowe, ostatnim krokiem jest
            <em class="firstterm">moderacja</em>: email zostaje przekierowany na
            specjalny adres, pod którym cz&#322;owiek jest w stanie przejrze&#263;
            jego tre&#347;&#263; i zaakceptowa&#263; lub odrzuci&#263; wiadomo&#347;&#263;.</p><p>Akceptacja wiadomo&#347;ci mo&#380;e odbywa&#263; si&#281; na dwa sposoby:
            mo&#380;na zaakceptowa&#263; dan&#261; wiadomo&#347;&#263; jednorazowo, lub zezwoli&#263; na
            publikowanie wszystkich dalszych wiadomo&#347;ci od danego nadawcy.
            Na ogó&#322; stosowana jest ta druga metoda, poniwa&#380; pozwala
            zmniejszy&#263; obci&#261;&#380;enie moderatora. Szczegó&#322;y tego, jak
            zatwierdza&#263; wiadomo&#347;ci, ró&#380;ni&#261; si&#281; pomi&#281;dzy systemami, ale na
            ogó&#322; sprowadza si&#281; to do odpowiedzi na pewien adres z komend&#261;
            "accept" (aby zaakceptowa&#263; t&#281; jedn&#261; wiadomo&#347;&#263;) lub "allow" (aby
            zaakceptowa&#263; dan&#261; wiadomo&#347;&#263; i wszystkie nast&#281;pne od tego
            nadawcy).</p><p>Odrzucenie wiadomo&#347;ci na ogó&#322; sprowadza si&#281; do
            zignorowania maila moderacyjnego. Je&#347;li oprogramowanie
            zarz&#261;dzaj&#261;ce list&#261; nie otrzyma potwierdzenia, nie opublikuje
            wiadomo&#347;ci na li&#347;cie, a wi&#281;c aby odrzuci&#263; wiadomo&#347;&#263; wystarczy
            usun&#261;&#263; mail z pro&#347;b&#261; o moderacj&#281;. Czasem mo&#380;na odpowiedzie&#263;
            komend&#261; "reject" lub "deny", aby automatycznie odrzuca&#263;
            wszystkie przysz&#322;e maile od danego nadawcy, nie dopuszczaj&#261;c ich
            nawet do moderacji. Jednak rzadko kiedy ma to sens, gdy&#380;
            moderacja przede wszystkim dotyczy spamu, a spamerzy rzadko
            kiedy korzystaj&#261; z tego samego adresu wi&#281;cej ni&#380; raz.</p></li></ol></div><p>Upewnij si&#281;, &#380;e korzystasz z moderacji <span class="emphasis"><em>jedynie</em></span> do
filtrowania spamu i wiadomo&#347;ci ewidentnie nie na temat, chocia&#380;by
przes&#322;anych przypadkowo na z&#322;&#261; list&#281; dyskusyjn&#261;. System moderacji na ogó&#322;
daje mo&#380;liwo&#347;&#263; nawi&#261;zania bezpo&#347;redniego kontaktu z nadawc&#261;, ale nie
korzystaj z niej aby odpowiada&#263; na kwestie, które powinny zosta&#263; poruszone
na li&#347;cie, nawet je&#347;li doskonale znasz odpowied&#378;. Je&#347;li b&#281;dziesz to robi&#263;,
spo&#322;eczno&#347;&#263; skupiona wokó&#322; projektu nie b&#281;dzie mia&#322;a jasnego obrazu tego,
jakiego rodzaju pytania s&#261; zadawane przez u&#380;ytkowników, a inni nie b&#281;d&#261;
mieli szansy odpowiedzie&#263; na nie, ani zobaczy&#263; odpowiedzi innych. W
moderacji listy dyskusyjnej chodzi tylko i wy&#322;&#261;cznie o ochron&#281; przed spamem
i wiadomo&#347;ciami nie na temat.</p></div><div class="sect3" title="Ukrywanie adresów w archiwach"><div class="titlepage"><div><div><h4 class="title"><a name="address-hiding"></a>Ukrywanie adresów w archiwach</h4></div></div></div><p>Aby twoja lista dyskusyjna nie sta&#322;a si&#281; &#378;ród&#322;em adresów dla spamerów,
powszechn&#261; metod&#261; jest zaciemnianie adresów email w archiwach listy, na
przyk&#322;ad zamieniaj&#261;c</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jlosowy@jakasdomena.com</code></p></blockquote></div><p>na</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jlosowy_AT_jakasdomena.com</code></p></blockquote></div><p>lub</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jlosowyNOSPAM@jakasdomena.com</code></p></blockquote></div><p>lub w jaki&#347; inny zrozumia&#322;y (dla cz&#322;owieka) sposób. Roboty zbieraj&#261;ce
adresy dla spamerów cz&#281;sto po prostu przeszukuj&#261; strony WWW&#8212;w&#322;&#261;czaj&#261;c
w to archiwum twojej listy&#8212;w poszukiwaniu ci&#261;gów zawieraj&#261;cych znak
"@".  Zaciemnienie adresów to sposób na ukrycie adresów przed spamerami.
Oczywi&#347;cie nie zapobiega to w &#380;aden sposób przed wysy&#322;aniem spamu na sam&#261;
list&#281;, ale pomaga ograniczy&#263; ilo&#347;&#263; spamu trafiaj&#261;cego na prywatne adresy
uczestników listy.</p><p>Ukrywanie adresów bywa kontrowersyjne. Niektórzy bardzo lubi&#261; t&#281;
technik&#281; i bywaj&#261; zaskoczeni, je&#347;li nie jest ona stosowana w archiwum. Inni
uwa&#380;aj&#261; to za niepotrzebne utrudnienie (gdy&#380; ludzie musz&#261; odkodowa&#263; adres,
zanim mog&#261; z niego skorzysta&#263;). Niektórzy zak&#322;adaj&#261;, &#380;e nie daje ona
spodziewanych efektów, poniewa&#380; robot zbieraj&#261;cy adresy mo&#380;e w teorii
odkodowa&#263; ka&#380;dy adres zaciemniony prostym algorytmem. Warto jednak zauwa&#380;y&#263;,
&#380;e istniej&#261; empiryczne dowody tego, &#380;e ukrywanie adresów
<span class="emphasis"><em>jest</em></span> efektywne, patrz <a class="ulink" href="http://www.cdt.org/speech/spam/030319spamreport.shtml" target="_top">http://www.cdt.org/speech/spam/030319spamreport.shtml</a>.</p><p>Najlepiej gdyby oprogramowanie zarz&#261;dzaj&#261;ce list&#261; dawa&#322;o wybór ka&#380;demu
u&#380;ytkownikowi, albo poprzez specjalny nag&#322;ówek, albo konfigurowaln&#261; opcj&#281;
zwi&#261;zan&#261; z kontem u&#380;ytkownika. Nie znam jednak &#380;adnego oprogramowania, które
oferowa&#322;o by tak&#261; mo&#380;liwo&#347;&#263;, wi&#281;c na chwil&#281; obecn&#261; administrator listy musi
podj&#261;&#263; t&#281; decyzj&#281; za wszystkich (zak&#322;adaj&#261;c, &#380;e lista jest w ogóle
archiwizowana, co nie jest zasad&#261;). Sk&#322;aniam si&#281; nie&#347;mia&#322;o w stron&#281;
ukrywania adresów. Niektórzy s&#261; bardzo ostro&#380;ni je&#347;li chodzi o ujawnianie
ich adresu email na stronach WWW lub gdziekolwiek, gdzie przechwyci&#263; je mog&#261;
automaty zbieraj&#261;ce adresy, i byliby bardzo zawiedzeni, gdyby ca&#322;y ten
wysi&#322;ek poszed&#322; na marne z momencie publikacji ich adresu w archiwum. Z
kolei niedogodno&#347;ci dla pozosta&#322;ych u&#380;ytkowników nie s&#261; wielkie, poniewa&#380;
przekszta&#322;cenie zaciemnionego adresu na posta&#263; oryginaln&#261; jest trywialne.
Pami&#281;taj jednak, &#380;e wci&#261;&#380; trwa wy&#347;cig zbroje&#324;. W momencie gdy czytasz te
s&#322;owa automaty zbieraj&#261;ce adresy mog&#322;y ju&#380; mauczy&#263; si&#281; wi&#281;kszo&#347;ci
popularnych wzorców zaciemniania, i b&#281;dzie trzeba zastanowi&#263; si&#281; nad innym
rozwi&#261;zaniem.</p></div></div><div class="sect2" title="Identyfikacja i nag&#322;ówki"><div class="titlepage"><div><div><h3 class="title"><a name="header-management"></a>Identyfikacja i nag&#322;ówki</h3></div></div></div><p>Uczestnicy listy na ogó&#322; chc&#261; przechowywa&#263; wiadomo&#347;ci z listy w
osobnym folderze, oddzielnie od reszty poczty. Ich programy pocztowe mog&#261;
automatycznie filtrowa&#263; wiadomo&#347;ci opieraj&#261;c si&#281; na
<em class="firstterm">nag&#322;ówkach</em>. Nag&#322;ówki to pola na samym pocz&#261;tku
wiadomo&#347;ci okre&#347;laj&#261;ce nadawc&#281;, odbiorc&#281;, temat, dat&#281; i ró&#380;ne inne
informacje opisuj&#261;ce wiadomo&#347;&#263;. Niektóre nag&#322;ówki s&#261; dobrze znane i
praktycznie obowi&#261;zkowe:</p><pre class="screen">
From: ...
To: ...
Subject: ...
Date: ...
</pre><p>Inne s&#261; opcjonalne, cho&#263; wci&#261;&#380; do&#347;&#263; powszechne. Na przyk&#322;ad maile nie
musz&#261; koniecznie zawiera&#263; nag&#322;ówka</p><pre class="screen">
Reply-to: nadawca@tutaj.adres.email
</pre><p>, ale wi&#281;kszo&#347;&#263; zawiera, poniewa&#380; u&#322;atwia to kontakt z autorem (jest
to szczególnie przydatne gdy autor wysy&#322;a wiadomo&#347;&#263; z innego adresu ni&#380; ten,
na który oczekuje odpowiedzi).</p><p>Niektóre programy pocztowe oferuj&#261; &#322;atwy w obs&#322;udze interfejs do
filtrowania wiadomo&#347;ci w oparciu o wzorzec w nag&#322;ówku Subject (temat). Z
tego powodu wielu u&#380;ytkowników proponuje, aby lista automatycznie dodawa&#322;a
odpowiedni przedrostek do ka&#380;dego tematu, dzi&#281;ki czemu b&#281;d&#261; mogli filtrowa&#263;
wiadomo&#347;ci do folderów na podstawie tego przedrostka. Chodzi o to, &#380;e gdy
autor napisze:</p><pre class="screen">
Subject: Przygotowanie wydania 2.5.
</pre><p>na li&#347;cie dyskusyjnej pojawi si&#281; wiadomo&#347;&#263; o nast&#281;puj&#261;cym
temacie:</p><pre class="screen">
Subject: [discuss@lists.example.org] Przygotowanie wydania 2.5.
</pre><p>Wprawdzie wi&#281;kszo&#347;&#263; oprogramowania do zarz&#261;dzania listami oferuje tak&#261;
opcj&#281;, nie zalecam jednak jej stosowania. Problem, w którym ta metoda pomaga
mo&#380;e zosta&#263; rozwi&#261;zany innymi, znacznie lepszymi sposobami, a przestrze&#324; w
temacie jest zbyt cenna, aby j&#261; marnowa&#263;. Do&#347;wiadczeni u&#380;ytkownicy list
dyskusyjnych na ogó&#322; przegl&#261;daj&#261; tematy nowych wiadomo&#347;ci na li&#347;cie, aby
zdecydowa&#263; które z nich przeczyta&#263; lub i na które odpisa&#263;. Do&#322;&#261;czanie nazwy
listy w temacie mo&#380;e spowodowa&#263;, &#380;e prawdziwy temat nie zmie&#347;ci si&#281; na
ekranie. Wtedy informacja na której ludzie polegaj&#261;, aby zdecydowa&#263; któr&#261;
wiadomo&#347;&#263; otworzy&#263;, staje si&#281; trudno dost&#281;pna, a u&#380;yteczno&#347;&#263; listy
spada.</p><p>Zamiast modyfikowa&#263; nag&#322;ówek Subject, naucz u&#380;ytkowników korzystania z
innych standardowych nag&#322;ówków, zaczynaj&#261;c od nag&#322;ówka To, który powinien
zawiera&#263; adres listy dyskusyjnej:</p><pre class="screen">
To: &lt;discuss@lists.example.org&gt;
</pre><p>Ka&#380;dy program pocztowy potrafi&#261;cy filtrowa&#263; po temacie powinien te&#380;
równie &#322;atwo filtrowa&#263; poczt&#281; po nag&#322;ówku To.</p><p>Istnieje te&#380; kilka innych opcjonalnych, ale cz&#281;sto spotykanych
nag&#322;ówków, których mo&#380;na si&#281; spodziewa&#263; po listach dyskusyjnych.
Filtrowanie po nich jest nawet pewniejsze, ni&#380; opieranie si&#281; na nag&#322;ówkach
To i Cc. Te nag&#322;owki s&#261; cz&#281;sto dodawane do ka&#380;dej wiadomo&#347;ci przez
oprogramowanie zarz&#261;dzaj&#261;ce list&#261;, wi&#281;c niektórzy u&#380;ytkownicy b&#281;d&#261; si&#281; ich
spodziewa&#263;:</p><pre class="screen">
list-help: &lt;mailto:discuss-help@lists.example.org&gt;
list-unsubscribe: &lt;mailto:discuss-unsubscribe@lists.example.org&gt;
list-post: &lt;mailto:discuss@lists.example.org&gt;
Delivered-To: mailing list discuss@lists.example.org
Mailing-List: contact discuss-help@lists.example.org; run by ezmlm
</pre><p>Wi&#281;kszo&#347;&#263; z nich jest do&#347;&#263; oczywista. Patrz <a class="ulink" href="http://www.nisto.com/listspec/list-manager-intro.html" target="_top">http://www.nisto.com/listspec/list-manager-intro.html</a> aby dowiedzie&#263;
si&#281; wi&#281;cej. Bardziej szczegó&#322;ow&#261;, formaln&#261; specyfikacj&#281; mo&#380;na znale&#378;&#263; tutaj
<a class="ulink" href="http://www.faqs.org/rfcs/rfc2369.html" target="_top">http://www.faqs.org/rfcs/rfc2369.html</a>.</p><p>Powy&#380;sze nag&#322;ówki mówi&#261;, &#380;e je&#347;li istnieje lista dyskusyjna o nazwie
"list", dost&#281;pne s&#261; tak&#380;e adresy administracyjne "list-help" i
"list-unsubscribe". Oprócz nich powszechne s&#261; tak&#380;e adresy "list-subscribe"
do zapisania si&#281; na list&#281;, "list-owner" do kontaktu z administratorem listy.
W zale&#380;no&#347;ci od zastosowanego oprogramowania do zarz&#261;dzania listami
dyskusyjnymi adresy administracyjne mog&#261; si&#281; ró&#380;ni&#263;, wi&#281;cej informacji mo&#380;na
znale&#378;&#263; w informacji. Na ogó&#322; infromacje o takich specjalnych adresach s&#261;
wysy&#322;ane do ka&#380;dego nowego uczestnika listy w automatycznym mailu
powitalnym. Administrator na ogó&#322; otrzymuje kopi&#281; takiego maila. Je&#347;li tak
si&#281; nie dzieje, popro&#347; o ni&#261; jednego z u&#380;ytkowników&#8212;aby wiedzie&#263;, jakie
informacje otrzymuj&#261; nowi subskrybenci. Zachowaj tak&#261; kopi&#281;, aby móc
odpowiada&#263; na pytania o mo&#380;liwo&#347;ci listy, albo lepiej umie&#347;&#263; odpowiednie
informacje na stronie WWW. Wtedy gdy kto&#347; zapyta "jak si&#281; wypisa&#263; z tej
listy?" wystarczy poda&#263; URL.</p><p>Niektóre listy dyskusyjne daj&#261; mo&#380;liwo&#347;&#263; do&#322;&#261;czania informacji o tym,
jak si&#281; wypisa&#263;, na ko&#324;cu ka&#380;dej wiadomo&#347;ci. Je&#347;li taka opcja jest dost&#281;pna,
w&#322;&#261;cz j&#261;. Zwi&#281;ksza ona rozmiar ka&#380;dej wiadomo&#347;ci jedynie o kilka linii
dodanych w ma&#322;o rzucaj&#261;cym si&#281; w oczy miejscu, a pozwoli oszcz&#281;dzi&#263; wiele
czasu, znacznie zmniejszaj&#261;c liczb&#281; osób pisz&#261;cych do ciebie&#8212;lub co
gorsza na list&#281;&#8212;z pytaniem o to, jak si&#281; wypisa&#263;.</p></div><div class="sect2" title="Wielka debata o nag&#322;ówek Reply-to"><div class="titlepage"><div><div><h3 class="title"><a name="reply-to"></a>Wielka debata o nag&#322;ówek Reply-to</h3></div></div></div><p>Wcze&#347;niej, w <a class="xref" href="setting-tone.html#avoid-private-discussions" title="Avoid Private Discussions">&#8222;Avoid Private Discussions&#8221;</a>, podkre&#347;la&#322;em
wag&#281; tego, aby dyskusje pozostawa&#322;y na forum publicznym, i omówi&#322;em sposoby
na to, aby unika&#263; przenoszenia dyskusji do prywatnych w&#261;tków. Ten rozdzia&#322;
po&#347;wi&#281;cony jest konfiguracji oprogramowania maj&#261;cego zaoszcz&#281;dzi&#263; nam pracy.
Tak wi&#281;c je&#347;li oprogramowanie zarz&#261;dzaj&#261;ce list&#261; dyskusyjn&#261; ma opcj&#281;
u&#322;atwiaj&#261;c&#261; utrzymanie rozmowy na li&#347;cie, mog&#322;oby si&#281; wydawa&#263;, &#380;e
wl&#261;czenie jest b&#281;dzie oczywyst&#261; deyzj&#261;.</p><p>Jednak nie do ko&#324;ca. Istnieje taka opcja, ma ona jednak do&#347;&#263; istotne
wady. Pytanie czy z niej korzysta&#263;, czy nie, to jedna z najgor&#281;tszych debat
w temacie zarz&#261;dzania listami dyskusyjnymi&#8212;mo&#380;e nie ma tyle, aby mo&#380;na
by&#322;o o tym us&#322;ysze&#263; w wieczornych wiadomo&#347;ciach, ale jest to problem, który
pojawia si&#281; od czasu do czasu w projektach wolnego oprogramowania. Dalej
opisz&#281;, w czym rzecz, podam argumenty obu stron i postaram si&#281;
pomóc w podj&#281;ciu decyzji.</p><p>Opcja, o której mowa, jest bardzo prosta: oprogramowanie listy
dyskusyjnej mo&#380;e, je&#347;li chcesz, automatycznie ustawia&#263; nag&#322;ówek Reply-to
ka&#380;dej wiadomo&#347;ci tak, aby wskazywa&#322; na list&#281; dyskusyjn&#261;. Innymi s&#322;owy, nie
wa&#380;ne jak&#261; warto&#347;&#263; autor wstawi w nag&#322;ówek Reply-to (mo&#380;e nawet nie podawa&#263;
&#380;adnej), w momencie gdy wiadomo&#347;&#263; dotrze do subskrybentów, wspomniany
nag&#322;ówek b&#281;dzie zawiera&#322; adres listy:</p><pre class="screen">
Reply-to: discuss@lists.example.org
</pre><p>Z pozoru wygl&#261;da to na dobre rozwi&#261;zanie. W zasadzie ka&#380;dy program
pocztowy rozpoznaje nag&#322;ówek Reply-to, wi&#281;c ka&#380;dy, kto odpisze na wiadomo&#347;&#263;
z listy, automatycznie zaadresuje j&#261; do ca&#322;ej listy, a nie tylko nadawcy
danej wiadomo&#347;ci. Oczywi&#347;cie wci&#261;&#380; mo&#380;na r&#281;cznie zmieni&#263; adresata, jednak
najwa&#380;niejsze, &#380;e <span class="emphasis"><em>domy&#347;lnie</em></span> odpowiedzi s&#261; kierowane na
list&#281;. To doskona&#322;y przyk&#322;ad zastosowania technologii aby zach&#281;ci&#263; do
wspó&#322;pracy.</p><p>Niestety istnieje kilka wad tego rozwi&#261;zania. Pierwsza z nich nazywana
bywa problemem <em class="firstterm">"nie mog&#281; znale&#378;&#263; drogi do domu"</em>:
czasem nadawca podaje swój "prawdziwy" adres email w polu Reply-to, gdy&#380; z
jakiego&#347; powodu wysy&#322;a wiadomo&#347;ci z innego adresu email ni&#380; ten, na który
chcia&#322;by otrzyma&#263; odpowied&#378;. Osoby, które zawsze wysy&#322;aj&#261; i odbieraj&#261; poczt&#281;
z tego samego adresu nie maj&#261; tego problemu, i bywaj&#261; zaskoczeni, gdy o tym
s&#322;ysz&#261;. Jednak dla tych, którzy posiadaj&#261; niestandardow&#261; konfiguracj&#281;
poczty, lub nie maj&#261; wp&#322;ywu na to, jak&#261; warto&#347;&#263; ma nag&#322;ówek From wysy&#322;anych
przez nich wiadomo&#347;ci (na przyk&#322;ad dlatego, &#380;e wysy&#322;aj&#261; poczt&#281; z pracy, i
nie maj&#261; dobrych uk&#322;adów z administratorami), korzystanie z pola Reply-to
mo&#380;e by&#263; jedynym sposobem na podanie poprawnego adresu zwrotnego. Gdy taka
osoba wysy&#322;a wiadomo&#347;&#263; na list&#281;, na któr&#261; nie jest zapisana, warto&#347;&#263; pola
Reply-to staje si&#281; wa&#380;n&#261; informacj&#261;. Je&#347;li oprogramowanie listy nadpisze to
pole, odpowiedzi mog&#261; do niej w ogóle nie dotrze&#263;.</p><p>Drugi problem dotyczy oczekiwa&#324;, i moim zdaniem to najpowa&#380;niejszy
argument przeciwko modyfikowaniu pola Reply-to. Wi&#281;kszo&#347;&#263; do&#347;wiadczonych
u&#380;ytkowników poczty elektronicznej jest przyzwyczajona do dwóch podstawowych
rodzajów odpowiedzi: <em class="firstterm">"odpowiedz wszystkim"</em> i
<em class="firstterm">"odpowiedz autorowi"</em>. Wspó&#322;czesne oprogramowanie
pocztowe posiada osobne polecenia dla ka&#380;dej z tych akcji. U&#380;ytkownicy
spodziewaj&#261; si&#281;, &#380;e aby odpowiedzie&#263; wszystkim (a wi&#281;c tak&#380;e na list&#281;),
powinni wybra&#263; opcj&#281; "odpowiedz wszystkim", a &#380;eby odpowiedzie&#263; prywatnie
autorowi, powinni wybra&#263; "odpowiedz autorowi". Wprawdzie chcemy zach&#281;ca&#263;
ludzi do odpowiadania na list&#281;, zdarzaj&#261; si&#281; jednak sytuacje, w których
prywatna odpowied&#378; jest konieczna&#8212;na przyk&#322;ad, gdy chcemy wys&#322;a&#263;
autorowi wiadomo&#347;ci jakie&#347; niepubliczne informacje, które nie powinny
pojawi&#263; si&#281; na li&#347;cie.</p><p>Zastanówmy si&#281; teraz, co si&#281; stanie, gdy lista nadpisze pole Reply-to.
U&#380;ytkownik wybiera polecenie "odpowiedz autorowi", chc&#261;c odpowiedzie&#263;
prywatnie autorowi wiadomo&#347;ci. Spodziewa si&#281; takiego efektu, wi&#281;c by&#263; mo&#380;e
nie spojrzy uwa&#380;nie na pole odbiorcy nowej wiadomo&#347;ci. Nast&#281;pnie wprowadzi
prywatn&#261; i poufn&#261; tre&#347;&#263;, na przyk&#322;ad jak&#261;&#347; obra&#378;liw&#261; opini&#281; na temat jednej
z osób na li&#347;cie, i wy&#347;le wiadomo&#347;&#263;. Niespodziewanie chwil&#281; pó&#378;niej jego
wiadomo&#347;&#263; pojawia si&#281; <span class="emphasis"><em>na li&#347;cie dyskusyjnej!</em></span>
Faktycznie, w teorii powinien spojrze&#263; na pole odbiorcy i nie zak&#322;ada&#263; nic
na temat zawarto&#347;ci pola Reply-to. Jednak pole Reply-to prawie zawsze
ustawiane jest (najcz&#281;&#347;ciej automatycznie przez sam program pocztowy) na
adres prywatny nadawcy, i wielu u&#380;ytkowników poczty jest do tego
przyzwyczajonych. Gdy kto&#347; celowo ustawia pole Reply-to na jaki&#347; inny adres,
jak lista dyskusyjna, na ogó&#322; wspomina o tym w tre&#347;ci wiadomo&#347;ci, aby nikt
nie by&#322; tym zaskoczony.</p><p>Ze wzgl&#281;du na mo&#380;liwo&#347;&#263; takich nieprzewidzianych komplikacji, na ogó&#322;
konfiguruj&#281; oprogramowanie zarz&#261;dzaj&#261;ce list&#261; tak, aby nie rusza&#322;o nag&#322;ówka
Reply-to. To przyk&#322;ad sytuacji, w której u&#380;ycie technologii w celu
u&#322;atwienia komunikacji ma, a przynajmniej tak mi si&#281; zdaje, potencjanie
niebezpieczne efekty uboczne. Jednak druga strona debaty na tak&#380;e silne
argumenty. Którekolwiek rozwi&#261;zanie wybierzesz, na pewno od czasu do czasu
ludzie b&#281;d&#261; wysy&#322;ali wiadomo&#347;ci na list&#281; z pytaniem, dlaczego nie podj&#281;&#322;e&#347;
innej decyzji. To nie jest temat, który powinien by&#263; g&#322;ównym w&#261;tkiem na
li&#347;cie, wi&#281;c warto przygotowa&#263; sobie gotow&#261; odpowied&#378;, najlepiej tak&#261;, która
zako&#324;czy dyskusj&#281;, zamiast j&#261; zaogni&#263;. Przede wszystkim
<span class="emphasis"><em>nie</em></span> upieraj si&#281;, &#380;e twoja decyzja, jakakolwiek by nie
by&#322;a, jest jedyn&#261; logiczn&#261; i w&#322;a&#347;ciw&#261; (nawet je&#347;li s&#261;dzisz, &#380;e tak
rzeczywi&#347;cie jest). Zamiast tego zwró&#263; uwag&#281;, &#380;e to stara dyskusja, ka&#380;da ze
stron ma dobre argumenty, a ty dokona&#322;e&#347; najlepszej mo&#380;liwej decyzji.
Uprzejmie popro&#347; o to, &#380;eby nie wraca&#263; wi&#281;cej do tego tematu, chyba &#380;e kto&#347;
rzeczywi&#347;cie ma co&#347; nowego do powiedzenia, a nast&#281;pnie nie anga&#380;uj si&#281;
wi&#281;cej w w&#261;tek i poczekaj, a&#380; umrze &#347;mierci&#261; naturaln&#261;.</p><p>Kto&#347; mo&#380;e zaproponowa&#263; g&#322;osowanie, aby wybra&#263; jedn&#261; z alternatyw.
Je&#347;li chcesz, mo&#380;esz si&#281; na to zgodzi&#263;, cho&#263; ja osobi&#347;cie nie uwa&#380;am, &#380;eby w
tym przypadku liczenie g&#322;osów by&#322;o dobrym rozwi&#261;zaniem. Konsekwencje dla
kogo&#347;, kto nie zdaje sobie sprawy z dzia&#322;ania listy s&#261; powa&#380;ne (przypadkowe
wys&#322;anie prywatnej wiadomo&#347;ci na publiczn&#261; list&#281;), a k&#322;opot dla pozosta&#322;ych
niewielki (konieczno&#347;&#263; przypomnienia komu&#347; od czasu do czasu, &#380;eby odpisa&#322;
na list&#281; a nie na prywatny adres), &#380;e nie jestem przekonany, czy wi&#281;kszo&#347;&#263;
powinna mie&#263; mo&#380;liwo&#347;&#263; wystawienia mniejszo&#347;ci na takie ryzyko.</p><p>Nie przedstawi&#322;em tutaj wszystkich aspektów problemu, a jedynie te,
które wydawa&#322;y si&#281; najwa&#380;niejsze. Aby dowiedzie&#263; si&#281; wi&#281;cej, warto
przeczyta&#263; nast&#281;puj&#261;ce dwa klasyczne artyku&#322;y, cytowane na ogó&#322; w trakcie
takich dyskusji:

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Leave Reply-to alone</strong></span>,
     <span class="emphasis"><em>Chip Rosenthal</em></span></p><p><a class="ulink" href="http://www.unicom.com/pw/reply-to-harmful.html" target="_top">http://www.unicom.com/pw/reply-to-harmful.html</a></p></li><li class="listitem"><p><span class="bold"><strong>Set Reply-to to list</strong></span>,
     <span class="emphasis"><em>Simon Hill</em></span></p><p><a class="ulink" href="http://www.metasystema.net/essays/reply-to.mhtml" target="_top">http://www.metasystema.net/essays/reply-to.mhtml</a></p></li></ul></div><p>

</p><p>Mimo sugestii, które poda&#322;em powy&#380;ej, nie uwa&#380;am, &#380;e istnieje jedyne
w&#322;a&#347;ciwe rozwi&#261;zanie tego problemu, i sam uczestnicz&#281; w wielu listach, które
<span class="emphasis"><em>nadpisuj&#261;</em></span> pole Reply-to. Najwa&#380;niejsze, &#380;eby jak
najszybciej zdecydowa&#263; si&#281; na któr&#261;&#347; z alternatyw, a nast&#281;pnie stara&#263; si&#281;
nie wpl&#261;tywa&#263; w dyskusje na ten temat.</p><div class="sect3" title="Dwie fantazje"><div class="titlepage"><div><div><h4 class="title"><a name="reply-fantasies"></a>Dwie fantazje</h4></div></div></div><p>Pewnego dnia kto&#347; wpadnie na genialny pomys&#322;, i zaimplementuje w
programie pocztowym polecenie <em class="firstterm">"odpowiedz na list&#281;"</em>.
Mog&#322;aby ona opiera&#263; si&#281; na nag&#322;ówkach do&#322;&#261;czanych przez list&#281;, opisywanych
wcze&#347;niej, aby skierowa&#263; odpowied&#378; bezpo&#347;rednio na list&#281;, z wy&#322;&#261;czeniem
wszystkich pozosta&#322;ych adresatów (gdy&#380; najprawdopodobniej i tak s&#261; zapisani
na list&#281;). By&#263; mo&#380;e inne programy pocztowe podchwyc&#261; ten pomys&#322;, i ca&#322;a
dyskusja zwi&#261;zana z polem Reply-to b&#281;dzie niepotrzebna. (W zasadzie program
pocztowy <a class="ulink" href="http://www.mutt.org/" target="_top">Mutt</a> posiada tak&#261;
opcj&#281;.<sup>[<a name="idp6202864" href="#ftn.idp6202864" class="footnote">13</a>]</sup>)</p><p>Nawet lepszym rozwi&#261;zaniem by&#322;oby wprowadzenie opcji konfiguracyjnej
dla ka&#380;dego u&#380;ytkownika. Wtedy ci, którzy chc&#261;, aby lista dyskusyjna
modyfikowa&#322;a pole Reply-to wiadomo&#347;ci docieraj&#261;cych do nich (zarówno ich
w&#322;asnych, jak i pochodz&#261;cych od innych u&#380;ytkowników), mog&#261; wybra&#263; tak&#261;
opcj&#281;, a pozostali mog&#261; z niej nie korzysta&#263;. Jednak nie znam &#380;adnego
oprogramowania do obs&#322;ugi listy, które oferowa&#322;oby tak&#261; opcj&#281; dla
poszczególnych u&#380;ytkowników. Na razie musimy wi&#281;c pozosta&#263; przy ustawieniu
globalnym.</p></div></div><div class="sect2" title="Archiwizacja"><div class="titlepage"><div><div><h3 class="title"><a name="archiving"></a>Archiwizacja</h3></div></div></div><p>Techniczne szczegó&#322;y archiwizacji listy dyskusyjnej s&#261; mocno zale&#380;ne
od oprogramowania, zarz&#261;dzaj&#261;cego list&#261;, tym samym wykraczaj&#261; poza zakres
tej ksi&#261;&#380;ki. Wybieraj&#261;c lub konfiguruj&#261;c rozwi&#261;zanie archiwizacyjne, we&#378; pod
uwag&#281; nast&#281;puj&#261;ce czynniki:</p><div class="variablelist"><dl><dt><span class="term">Szybko&#347;&#263; aktualizacji</span></dt><dd><p>U&#380;ytkownicy cz&#281;sto b&#281;d&#261; chcieli odwo&#322;a&#263; si&#281; do zarchiwizowanej
      wersji wiadomo&#347;ci wys&#322;anej w ci&#261;gu ostatniej godziny czy dwóch. Je&#347;li
      to tylko mo&#380;liwe, wiadomo&#347;ci powinny pojawia&#263; si&#281; w archiwum
      natychmiast&#8212;tak, aby w chwili gdy wiadomo&#347;&#263; pojawi si&#281; na
      li&#347;cie, by&#322;a tak&#380;e dost&#281;pna w archiwum. Je&#347;li to niemo&#380;liwe,
      powiniene&#347; skonfigurowa&#263; archiwum tak, aby by&#322;o uaktualniane
      najrzadziej co godzin&#281;. Domy&#347;lnie niektóre archiwizatory wykonuj&#261;
      proces aktualizacji co noc, ale w praktyce to zdecydowanie za rzadko
      dla potrzeb aktywnej listy dyskusyjnej.</p></dd><dt><span class="term">Stabilno&#347;&#263; odno&#347;ników</span></dt><dd><p>Gdy wiadomo&#347;&#263; zosta&#322;a zarchiwizowana pod danym adresem URL,
      powina by&#263; pod nim dost&#281;pna na zawsze, czy raczej na tyle d&#322;ugo, na
      ile to mo&#380;liwe. Nawet gdy archiwa zostan&#261; przebudowane, odtworzone z
      kopii zapasowej czy w inny sposób zmodyfikowane, wszystkie adresy URL,
      które zosta&#322;y opublikowane powinny pozosta&#263; bez zmian. Stabilne
      odno&#347;niki umo&#380;liwiaj&#261; wyszukiwarkom internetowym indeksowanie
      archiwów, co bardzo pomaga osobom szukaj&#261;cym odpowiedzi. Stabilne
      odno&#347;niki s&#261; wa&#380;ne tak&#380;e dlatego, &#380;e linki do wiadomo&#347;ci w archiwum s&#261;
      cz&#281;sto umieszczane w systemie &#347;ledzenia b&#322;&#281;dów (patrz <a class="xref" href="bug-tracker.html" title="Bug Tracker">&#8222;Bug Tracker&#8221;</a>)<span> dalej w tym
      rozdziale</span> czy innych dokumentach projektu.</p><p>Najlepiej gdyby oprogramowanie zarz&#261;dzaj&#261;ce list&#261; do&#322;&#261;cza&#322;o w
      nag&#322;ówkach rozsy&#322;anych wiadomo&#347;ci jej adres URL w archiwum (albo
      chocia&#380; unikaln&#261; dla niej cz&#281;&#347;&#263; tego adresu). Dzi&#281;ki temu osoby, które
      posiadaj&#261; kopi&#281; wiadomo&#347;ci mog&#322;yby &#322;atwo sprawdzi&#263; jej adres w
      archiwum bez konieczno&#347;ci odwiedzania samego archiwum. To by&#322;oby
      pomocne, gdy&#380; czynno&#347;ci wymagaj&#261;ce u&#380;ycia przegl&#261;darki mog&#261; zaj&#261;&#263;
      sporo czasu. Nie wiem czy jakiekolwiek oprogramowanie zarz&#261;dzaj&#261;ce
      list&#261; oferuje tak&#261; mo&#380;liwo&#347;&#263;&#8212;niestety te, z których korzysta&#322;em
      nie posiadaj&#261; jej. Jednak to co&#347;, o czym warto pomy&#347;le&#263; (lub, je&#347;li
      piszesz oprogramowanie do obs&#322;ugi list dyskusyjnych, co warto
      zaimplementowa&#263;).</p></dd><dt><span class="term">Kopie zapasowe</span></dt><dd><p>Tworzenie kopii zapasowych archiwów nie powinno by&#263; zbyt
            trudne, a proces odtwarzania z kopii zbyt skomplikowany. Nie
            powiniene&#347; traktowa&#263; oprogramowania archiwum na zasadzie czarnej
            skrzynki. Sam powiniene&#347; wiedzie&#263; (lub powinien to wiedzie&#263; inny
            uczestnik projektu) gdzie przechowywane s&#261; wiadomo&#347;ci, i w jaki
            sposób wygenerowa&#263; ponownie strony archiwum na podstawie bazy
            wiadomo&#347;ci, je&#347;li zajdzie taka konieczno&#347;&#263;. Archiwum to cenne
            dane&#8212;projekt, który je straci, traci zarazem cz&#281;&#347;&#263; swojej
            zbiorowej pami&#281;ci.</p></dd><dt><span class="term">Wsparcie dla w&#261;tków</span></dt><dd><p>Powinna istnie&#263; mo&#380;liwo&#347;&#263; przej&#347;cia od ka&#380;dej wiadomo&#347;ci do
            <em class="firstterm">w&#261;tku</em> (grupy powi&#261;zanych wiadomo&#347;ci), do
            którego nale&#380;y. Ka&#380;dy w&#261;tek powinien tak&#380;e posiada&#263; swój adres
            URL, niezale&#380;ny od adresów poszczególnych wiadomo&#347;ci w
            w&#261;tku.</p></dd><dt><span class="term">Wyszukiwanie</span></dt><dd><p>Archiwum, które nie pozwala na wyszukiwanie (zarówno po tre&#347;ci
            wiadomo&#347;c, jak i ich autorach i tematach) jest prawie
            bezu&#380;yteczne. Niektóre programy archiwizuj&#261;ce umo&#380;liwiaj&#261;
            wyszukiwanie tylko poprzez zewn&#281;trzn&#261; wyszukiwark&#281;, jak na
            przyk&#322;ad <a class="ulink" href="http://www.google.com/" target="_top">Google</a>. To
            zawsze co&#347;, jednak wbudowana wyszukiwarka na ogó&#322; jest lepiej
            dostosowana do potrzeb archiwum, na przyk&#322;ad pozwala na
            wyszukiwanie s&#322;ów w kluczowych tylko w temacie, albo tylko w
            tre&#347;ci.</p></dd></dl></div><p>To jedynie lista technicznych kwestii wa&#380;nych w trakcie wyboru i
    konfiguracji archiwum. Do tego. jak sk&#322;oni&#263; ludzi do
    <span class="emphasis"><em>korzystania</em></span> z archiwum, aby poprawi&#263; komunikacj&#281; w
    projekcie, wrócimy w dalszych rozdzia&#322;ach, w szczególno&#347;ci w <a class="xref" href="growth.html#using-archives" title="Conspicuous Use of Archives">&#8222;Conspicuous Use of Archives&#8221;</a>.</p></div><div class="sect2" title="Oprogramowanie"><div class="titlepage"><div><div><h3 class="title"><a name="mailing-list-software"></a>Oprogramowanie</h3></div></div></div><p>Poni&#380;ej znajduje si&#281; lista wolnego oprogramowania do zarz&#261;dzania list&#261;
    i archiwizacji. Je&#347;li serwer, na którym ulokowany jest twój projekt, ma
    ju&#380; dzia&#322;aj&#261;ce oprogramowanie do obs&#322;ugi list dyskusyjnych, by&#263; mo&#380;e
    nawet nie b&#281;dziesz musia&#322; podejmowa&#263; decyzji. Je&#347;li jednak musisz
    zainstalowa&#263; je sam, masz sporo mo&#380;liwo&#347;ci. Ja sam korzysta&#322;em z
    Mailman, Ezmlm, MHonArc i Hypermail, ale nie znaczy to, &#380;e inne nie s&#261;
    dobre (oczywi&#347;cie s&#261; jeszcze inne narz&#281;dzia, na które nie trafi&#322;em, wi&#281;c
    nie uznawaj tej listy za kompletn&#261;).</p><p>Oprogramowanie do zarz&#261;dzania listami dyskusyjnymi:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Mailman</strong></span> &#8212; <a class="ulink" href="http://www.list.org/" target="_top">http://www.list.org/</a></p><p>(Posiada wbudowany archiwizator, i mo&#380;liwo&#347;&#263; podpi&#281;cia zewn&#281;trznych
         archiwizatorów.)</p></li><li class="listitem"><p><span class="bold"><strong>SmartList</strong></span> &#8212; <a class="ulink" href="http://www.procmail.org/" target="_top">http://www.procmail.org/</a></p><p>(Przeznaczony do u&#380;ycia z systemem przetwarzania poczty Procmail.)</p></li><li class="listitem"><p><span class="bold"><strong>Ecartis</strong></span> &#8212; <a class="ulink" href="http://www.ecartis.org/" target="_top">http://www.ecartis.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>ListProc</strong></span> &#8212; <a class="ulink" href="http://listproc.sourceforge.net/" target="_top">http://listproc.sourceforge.net/</a></p></li><li class="listitem"><p><span class="bold"><strong>Ezmlm</strong></span> &#8212; <a class="ulink" href="http://cr.yp.to/ezmlm.html" target="_top">http://cr.yp.to/ezmlm.html</a></p><p>(Zaprojektowany do wspó&#322;pracy z serwerem pocztowym <a class="ulink" href="http://cr.yp.to/qmail.html" target="_top">Qmail</a>).</p></li><li class="listitem"><p><span class="bold"><strong>Dada</strong></span> &#8212; <a class="ulink" href="http://mojo.skazat.com/" target="_top">http://mojo.skazat.com/</a></p><p>(Mimo prób ukrycia tego faktu przez autorów strony, to wolne
         oprogramowanie, wydane na licencji GNU General Public License. Posiada
         te&#380; wbudowany archiwizator.)</p></li></ul></div><p>Oprogramowanie do archiwizacji list:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>MHonArc</strong></span> &#8212; <a class="ulink" href="http://www.mhonarc.org/" target="_top">http://www.mhonarc.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>Hypermail</strong></span> &#8212; <a class="ulink" href="http://www.hypermail.org/" target="_top">http://www.hypermail.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>Lurker</strong></span> &#8212; <a class="ulink" href="http://sourceforge.net/projects/lurker/" target="_top">http://sourceforge.net/projects/lurker/</a></p></li><li class="listitem"><p><span class="bold"><strong>Procmail</strong></span> &#8212; <a class="ulink" href="http://www.procmail.org/" target="_top">http://www.procmail.org/</a></p><p>(Oprogramowanie towarzysz&#261;ce SmartList, system przetwarzania poczty
         ogólnego przeznaczenia, który mo&#380;na skonfigurowa&#263; jako
         archiwizator.)</p></li></ul></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp6202864" href="#idp6202864" class="para">13</a>] </sup>Wkrótce po publikacji tej ksi&#261;&#380;ki <a class="ulink" href="http://www.michaelbernstein.com/" target="_top">Michael Bernstein</a> napisa&#322; do mnie: "Tak&#380;e inne programy
pocztowe oprócz Mutta posiadaj&#261; opcj&#281; odpowiedzi na list&#281;. Na przyk&#322;ad
Evolution posiada odpowiedni skrót klawiszowy (Ctrl-L), cho&#263; nie ma takiego
przycisku."</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="technical-infrastructure.html">Poprzedni</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Pocz&#261;tek rozdzia&#322;u</a></td><td width="40%" align="right"> <a accesskey="n" href="vc.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">Rozdzia&#322; 3. Infrastruktura techniczna </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Kontrola wersji</td></tr></table></div></body></html>
