<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Przedmowa</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="up" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="prev" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="next" href="audience.html" title="Kto powinien przeczyta&#263; t&#281; ksi&#261;&#380;k&#281;?"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Przedmowa</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Poprzedni</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="audience.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="preface" title="Przedmowa"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>Przedmowa</h2></div></div></div><div class="toc"><p><b>Spis tre&#347;ci</b></p><dl><dt><span class="sect1"><a href="preface.html#why">Dlaczego powsta&#322;a ta ksi&#261;&#380;ka?</a></span></dt><dt><span class="sect1"><a href="audience.html">Kto powinien przeczyta&#263; t&#281; ksi&#261;&#380;k&#281;?</a></span></dt><dt><span class="sect1"><a href="sources.html">&#377;ród&#322;a</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">Podzi&#281;kowania</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">Zastrze&#380;enie</a></span></dt></dl></div><div class="sect1" title="Dlaczego powsta&#322;a ta ksi&#261;&#380;ka?"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>Dlaczego powsta&#322;a ta ksi&#261;&#380;ka?</h2></div></div></div><p>Na ró&#380;nych spotkaniach ludzie ju&#380; nie gapi&#261; si&#281; na mnie pustym
wzrokiem, gdy mówi&#281; im, &#380;e pisz&#281; wolne oprogramowanie. "Ach tak, otwarte
oprogramowanie - co&#347; jak Linux?" - mówi&#261;. Skwapliwie potwierdzam: "Tak,
dok&#322;adnie! Tym si&#281; w&#322;a&#347;nie zajmuje." Mi&#322;o nie by&#263; ju&#380; uznawanym za
kompletnego wariata. Dawniej nast&#281;pne pytanie by&#322;o zazwyczaj &#322;atwe do
przewidzenia: "Jak ty na tym zarabiasz?" &#379;eby odpowiedzie&#263; musia&#322;bym
przybli&#380;y&#263; im ekonomi&#281; otwartego oprogramowania: &#380;e istniej&#261; organizacje,
w których interesie jest, aby pewne oprogramowanie istnia&#322;o, ale nie musz&#261;
sprzedawa&#263; jego kopii. Chc&#261; tylko by oprogramowanie by&#322;o dost&#281;pne i
utrzymywane, jako narz&#281;dzie a nie jako towar.</p><p>Jednak ostatnio kolejne pytanie ju&#380; nie zawsze dotyczy pieni&#281;dzy.
Biznesowe wykorzystanie otwartego oprogramowania<sup>[<a name="idp134560" href="#ftn.idp134560" class="footnote">1</a>]</sup> nie jest ju&#380; tak
tajemnicze, a ludzie nie zajmuj&#261;cy si&#281; programowaniem rozumiej&#261;&#8212;lub
przynajmniej nie s&#261; zaskoczeni&#8212; &#380;e do rozwoju takiego oprogramowania
zatrudnia si&#281; ludzi na pe&#322;ny etat. Zamiast tego nast&#281;pne pytanie, które
s&#322;ysz&#281; coraz cz&#281;&#347;ciej, brzmi "<span class="emphasis"><em>Och, a jak to dzia&#322;a?</em></span>"</p><p>Nie mia&#322;em pod r&#281;k&#261; dobrej odpowiedzi na to pytanie, a im bardziej
próbowa&#322;em do niej doj&#347;&#263;, tym wyra&#378;niej zdawa&#322;em sobie spraw&#281; jak bardzo
ta kwestia jest skomplikowana. Prowadzenie projektu zwi&#261;zanego z wolnym
oprogramowanie nie polega dok&#322;adnie na tym samym, co dzia&#322;alno&#347;&#263;
biznesowa (wyobra&#378; sobie ci&#261;g&#322;&#261; konieczno&#347;&#263; negocjowania natury produktu
z grup&#261; ochotników, których w wi&#281;kszo&#347;ci nie mia&#322;e&#347; okazji spotka&#263;!). Z
ró&#380;nych powodów nie jest równie&#380; to&#380;same z prowadzeniem tradycyjnej
organizacji niedochodowej czy rz&#261;dowej. Prowadzenie projektów tego typu
ma wiele podobie&#324;stw do wszystkich tych rzeczy, ale stopniowo doszed&#322;em
do wniosku &#380;e wolne oprogramowanie jest <span class="foreignphrase"><em class="foreignphrase">sui
generis</em></span>. Jest wiele rzeczy, do których mo&#380;na je
sensownie porównywa&#263;, ale &#380;adna z nich nie jest z nim identyczna. W
rzeczy samej, nawet za&#322;o&#380;enie &#380;e projekt takiego typu mo&#380;na "prowadzi&#263;"
jest uproszczeniem. Wolny projekt mo&#380;na <span class="emphasis"><em>rozpocz&#261;&#263;</em></span> i
mog&#261; na niego wp&#322;ywa&#263; zainteresowane strony, zazwyczaj dosy&#263; mocno.
Jednak sam w sobie nie mo&#380;e sta&#263; si&#281; w&#322;asno&#347;ci&#261; &#380;adnego pojedynczego
posiadacza, i dopóki gdzie&#347;&#8212;gdziekolwiek&#8212;istniej&#261; osoby
zainteresowane jego kontynuowaniem, to nie da si&#281; go zamkn&#261;&#263;
jednostronn&#261; decyzj&#261;.  Ka&#380;dy ma nieograniczon&#261; w&#322;adz&#281;; nikt nie ma
w&#322;adzy. Tworzy to interesuj&#261;c&#261; dynamik&#281;.</p><p>To w&#322;a&#347;nie sprawi&#322;o, &#380;e chcia&#322;em napisa&#263; t&#281; ksi&#261;&#380;k&#281;. Projekty
wolnego oprogramowania wytworzy&#322;y w&#322;asn&#261; kultur&#281;, etos, w którym wolno&#347;&#263;
tworzenia oprogramowania, które robi czego tylko si&#281; zapragnie, sta&#322;a
si&#281; kwesti&#261; nadrz&#281;dn&#261;, a jednak efektem tej wolno&#347;ci nie jest
rozpraszanie si&#281; jednostek, z których ka&#380;da idzie w&#322;asn&#261; drog&#261;, ale
entuzjastyczna wspó&#322;praca. W rzeczy samej&#8212;umiej&#281;tno&#347;&#263; kooperacji jest
jedn&#261; z najwy&#380;ej cenionych zdolno&#347;ci w ruchu wolnego oprogramowania.
Zarz&#261;dzanie takimi projektami polega na zaanga&#380;owaniu si&#281; w przero&#347;ni&#281;ty
system wspó&#322;pracy, w którym umiej&#281;tno&#347;&#263; nie tylko pracy z innymi, ale
tak&#380;e dochodzenia do nowych sposobów wspólnej pracy, mo&#380;e owocowa&#263;
namacalnymi korzy&#347;ciami dla oprogramowania. Ksi&#261;&#380;ka ta stara si&#281; opisa&#263;
techniki, jakie s&#261; u&#380;ywane w tym celu. W &#380;adnym wypadku nie jest
kompletnym ich podr&#281;cznikiem, ale przynajmniej punktem wyj&#347;cia.</p><p>Dobre wolne oprogramowanie jest warto&#347;ciowym celem samym w sobie i
mam nadziej&#281;, &#380;e czytelnicy, którzy szukaj&#261; wskazówek jak to osi&#261;gn&#261;&#263;,
b&#281;d&#261; usatysfakcjonowani tym co tutaj znajd&#261;. Mam jednak tak&#380;e nadziej&#281;,
&#380;e uda&#322;o mi si&#281; przekaza&#263; co&#347; z czystej przyjemno&#347;ci, któr&#261; daje praca
z umotywowanym zespo&#322;em twórców open source oraz kontakty z
u&#380;ytkownikami w ten cudownie bezpo&#347;redni sposób, do jakiego zach&#281;ca otwarte
oprogramowanie. W ko&#324;cu uczestniczenie w udanych projektach wolnego
oprogramowania jest <span class="emphasis"><em>zabaw&#261;</em></span>, i dlatego ca&#322;y ten
system dzia&#322;a.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp134560" href="#idp134560" class="para">1</a>] </sup>Terminy
"otwarte oprogramowanie" oraz "wolne oprogramowanie" w
tym kontek&#347;cie s&#261; w&#322;a&#347;ciwie synonimami; zosta&#322;y one dok&#322;adniej omówione
w <a class="xref" href="introduction.html#free-vs-open-source" title='"Free" Versus "Open Source"'>&#8222;"Free" Versus "Open Source"&#8221;</a><span> w <a class="xref" href="introduction.html" title="Rozdzia&#322; 1. Wst&#281;p">Rozdzia&#322; 1, <i>Wst&#281;p</i></a></span>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Poprzedni</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="audience.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">Produkcja oprogramowania Open Source </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Kto powinien przeczyta&#263; t&#281; ksi&#261;&#380;k&#281;?</td></tr></table></div></body></html>
