<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#377;ród&#322;a</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="up" href="preface.html" title="Przedmowa"><link rel="prev" href="audience.html" title="Kto powinien przeczyta&#263; t&#281; ksi&#261;&#380;k&#281;?"><link rel="next" href="acknowledgments.html" title="Podzi&#281;kowania"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#377;ród&#322;a</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="audience.html">Poprzedni</a> </td><th width="60%" align="center">Przedmowa</th><td width="20%" align="right"> <a accesskey="n" href="acknowledgments.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="sect1" title="&#377;ród&#322;a"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sources"></a>&#377;ród&#322;a</h2></div></div></div><p>Wiele materia&#322;ów &#378;ród&#322;owych w tej ksi&#261;&#380;ce zebra&#322;em w trakcie
pi&#281;ciu lat pracy w projekcie Subversion (<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>). Subversion to system kontroli
wersji oparty na zasadach open source, napisany od pocz&#261;tku i
zaprojektowany jako nast&#281;pca CVS w roli <span class="foreignphrase"><em class="foreignphrase">de
facto</em></span> standardowego systemu kontroli wersji w
spo&#322;eczno&#347;ci open source. Projekt zosta&#322; za&#322;o&#380;ony przez mojego
pracodawc&#281;, CollabNet (<a class="ulink" href="http://www.collab.net/" target="_top">http://www.collab.net/</a>), na
pocz&#261;tku roku 2000, i na szcz&#281;&#347;cie CollabNet od samego pocz&#261;tku rozumia&#322;
jak poprowadzi&#263; go jako naprawd&#281; rozproszony system wspó&#322;pracy. Wielu
ochotników wcze&#347;nie w to wesz&#322;o; obecnie w projekcie jest oko&#322;o 50
wspó&#322;twórców, z których tylko kilku jest pracownikami CollabNet.</p><p>Subversion jest pod wieloma wzgl&#281;dami klasycznym przyk&#322;adem
projektu open source i wspominam o nim o wiele cz&#281;&#347;ciej ni&#380; zak&#322;ada&#322;em
na pocz&#261;tku. Po cz&#281;&#347;ci jest to kwestia wygody: gdy tylko szuka&#322;em
przyk&#322;adu danego zjawiska, to zwykle mog&#322;em si&#281; natychmiast odwo&#322;a&#263; do
Subversion. Ponadto by&#322;a to równie&#380; kwestia sprawdzalno&#347;ci. Mimo, &#380;e
by&#322;em w ró&#380;nym stopniu zaanga&#380;owany w inne projekty wolnego
programowania i rozmawia&#322;em ze znajomymi oraz uczestnikami wielu innych
projektów, to zauwa&#380;y&#322;em, &#380;e gdy pisze si&#281; pod k&#261;tem druku, to wszelkie
za&#322;o&#380;enia musz&#261; by&#263; sprawdzone. Nie chcia&#322;em wypowiada&#263; si&#281; na temat
wydarze&#324; w innych projektach w oparciu tylko o to, co mog&#322;em przeczyta&#263;
w archiwach publicznych grup dyskusyjnych. Gdyby kto&#347; zastosowa&#322; tak&#261;
metod&#261; w przypadku Subversion, to zapewne w po&#322;owie mia&#322;by racj&#281;, a w
po&#322;owie nie. Zatem gdy inspirowa&#322;o mnie co&#347; lub bra&#322;em przyk&#322;ady z
projektów, z którymi nie mia&#322;em bezpo&#347;rednich do&#347;wiadcze&#324;, to próbowa&#322;em
najpierw zweryfikowa&#263; te dane przez informatora w tym projekcie, kogo&#347;,
do kogo mam zaufanie, &#380;e powie mi o co rzeczywi&#347;cie chodzi&#322;o.</p><p>Praca nad Subversion by&#322;a moim zaj&#281;ciem przez ostatnie 5 lat, ale
z wolnym oprogramowaniem jestem zwi&#261;zany od 12. Inne projekty, które
mia&#322;y wp&#322;yw na t&#281; ksi&#261;&#380;k&#281; to mi&#281;dzy innymi:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>Projekt edytora GNU Emacs przy Free
Software Foundation, w którym zajmuj&#281; si&#281; kilkoma ma&#322;ymi
pakietami.</p></li><li class="listitem"><p>Concurrent Versions System
(CVS), nad którym pracowa&#322;em intensywnie w latach 1994-1995 z Jimem
Blandym, ale od tego czasu anga&#380;owa&#322;em si&#281; tylko sporadycznie.</p></li><li class="listitem"><p>Zbiór projektów open source znanych jako
Apache Software Foundation, g&#322;ównie Apache Portable Runtime (APR) i
serwer HTTP Apache.</p></li><li class="listitem"><p>OpenOffice.org,
baza danych Berkeley od Sleepycat i baza danych MySQL; nie by&#322;em w tych
projektach zaanga&#380;owany osobi&#347;cie, obserwowa&#322;em je jednak i - w
niektórych - przypadkach, rozmawia&#322;em z zaanga&#380;owanymi osobami.</p></li><li class="listitem"><p>GNU Debugger (GDB) (jak wy&#380;ej).</p></li><li class="listitem"><p>Projekt Debian (jak wy&#380;ej).</p></li></ul></div><p>Oczywi&#347;cie powy&#380;sza lista nie jest kompletna. Jak wi&#281;kszo&#347;&#263;
programistów open source trzymam r&#281;k&#281; na pulsie ró&#380;nych projektów, by
wiedzie&#263; co w trawie piszczy. Nie wymieni&#281; ich wszystkich tutaj z nazwy,
ale wspominam o nich w odpowiednich miejscach w tek&#347;cie.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="audience.html">Poprzedni</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Pocz&#261;tek rozdzia&#322;u</a></td><td width="40%" align="right"> <a accesskey="n" href="acknowledgments.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">Kto powinien przeczyta&#263; t&#281; ksi&#261;&#380;k&#281;? </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Podzi&#281;kowania</td></tr></table></div></body></html>
