<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Dodatek A. Wolne Systemy Kontroli Wersji (VCS)</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="up" href="index.html" title="Produkcja oprogramowania Open Source"><link rel="prev" href="licensing-further-resources.html" title="Further Resources"><link rel="next" href="bug-trackers.html" title="Dodatek B. Free Bug Trackers"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Dodatek A. Wolne Systemy Kontroli Wersji (VCS)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="licensing-further-resources.html">Poprzedni</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bug-trackers.html">Nast&#281;pny</a></td></tr></table><hr></div><div class="appendix" title="Dodatek A. Wolne Systemy Kontroli Wersji (VCS)"><div class="titlepage"><div><div><h2 class="title"><a name="vc-systems"></a>Dodatek A. Wolne Systemy Kontroli Wersji (VCS)</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>To s&#261; wszystkie systemy kontroli wersji typu open source z którymi
mia&#322;em styczno&#347;&#263; do po&#322;owy 2007 roku. Jedynym z którego korzystam regularnie
jest Subversion. Mam ma&#322;e lub &#380;adne do&#347;wiadcznie z wi&#281;kszo&#347;ci&#261; z nich, poza
Subversion czy CVS; informacje na ich temat s&#261; wzi&#281;te ze stron prezentowanych
programów. Zobacz równie&#380;
<a class="ulink" href="http://en.wikipedia.org/wiki/List_of_revision_control_software" target="_top">http://en.wikipedia.org/wiki/List_of_revision_control_software</a>.
</p><div class="sect2" title="CVS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-cvs"></a><span class="bold"><strong>CVS</strong></span> &#8212; <a class="ulink" href="http://www.nongnu.org/cvs/" target="_top">http://www.nongnu.org/cvs/</a></h3></div></div></div><p>CVS istnieje ju&#380; od d&#322;ugiego czasu i wielu twórców oprogramowania
zd&#261;&#380;y&#322;o si&#281; do niego przyzwyczai&#263;. Za jego czasów by&#322; systemem rewolucyjnym:
by&#322; pierwszym systemem kontroli o otwartym &#378;ródle z sieciowym dost&#281;pem dla
programistów (z tego co wiem), a tak&#380;e pierwszym, który oferowa&#322; anonimowy
dost&#281;p tylko do odczytu do &#378;róde&#322;, co u&#322;atwi&#322;o progamistom uczestnictwo
w projektach. Pod kontrol&#261; CVS s&#261; tylko pliki, nie katalogi; oferuje
rozga&#322;&#281;zienia, tagowanie i do&#347;&#263; dobr&#261; wydajno&#347;&#263; po stronie klienta, ale nie
obs&#322;uguje zbyt dobrze du&#380;ych czy binarnych plików. Nie wspiera równie&#380;
atomowych zatwierdze&#324; (atomic commits). <span class="emphasis"><em>[Zastrze&#380;enie: By&#322;em
aktywny w rozwoju CVS przez pi&#281;&#263; lat, nim zacz&#261;&#322;em pomaga&#263; w zast&#261;pieniu
CVS przez Subversion.]</em></span></p></div><div class="sect2" title="Subversion &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-subversion"></a><span class="bold"><strong>Subversion</strong></span> &#8212; <a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a></h3></div></div></div><p>Subversion po pierwsze i g&#322;ównie powsta&#322;o po to, by zast&#261;pi&#263;
CVS&#8212;dok&#322;adnie by osi&#261;gn&#261;&#263; kontrol&#281; wersji jak&#261; daje CVS, ale bez
problemów czy braków, które irytowa&#322;y u&#380;ytkowników CVS. Jednym z celów
Subversion by&#322;o to, aby u&#380;ytkownicy CVSa mogli w miar&#281; p&#322;ynnie przesi&#261;&#347;&#263;
si&#281; do nowego systemu. To nie jest miejsce na to, aby zag&#322;&#281;bia&#263; si&#281; w
detale mo&#380;liwo&#347;ci Subversion&#8212;jego strona g&#322;ówna ma informacje na ten
temat. <span class="emphasis"><em>[Zatrze&#380;enie: Jestem zaanga&#380;owany w rozwój Subversion i
jest to jedyny, którego u&#380;ywam regularnie.]</em></span></p></div><div class="sect2" title="SVK &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-svk"></a><span class="bold"><strong>SVK</strong></span> &#8212; <a class="ulink" href="http://svk.elixus.org/" target="_top">http://svk.elixus.org/</a></h3></div></div></div><p>Mimo, &#380;e jest zbudowany na podstawie Subversion, SVK przypomina bardziej
rozproszone systemy kontroli wersji ni&#380; Subversion. Wspiera rozproszony
rozwój oprogramowania, lokalne zatwierdzenia (local commits) zaawansowane
&#322;&#261;czenie zmian i mo&#380;liwo&#347;&#263; do odtwarzania drzew z innych systemów kontroli wersji.
Wi&#281;cej informacji jest dost&#281;pnych na jego stronie WWW.</p></div><div class="sect2" title="Mercurial &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-mercurial"></a><span class="bold"><strong>Mercurial</strong></span> &#8212; <a class="ulink" href="http://www.selenic.com/mercurial/" target="_top">http://www.selenic.com/mercurial/</a></h3></div></div></div><p>Mercurial jest rozproszonym systemem kontroli wersji, który oferuje
mi&#281;dzy innymi: "(XXX: complete cross-indexing of files and changesets,)
efektywn&#261; z punktu widzenia przepustowo&#347;ci jak i obci&#261;&#380;enia procesora
synchronizacj&#281; w oparciu o protoko&#322;y HTTP i SSH, dowolne &#322;&#261;czenie ga&#322;&#281;zi
programistów, zintegrowany autonomiczny interfejs webowy, [przeno&#347;no&#347;&#263; do]
Uniksa, MacOS X, i Windows" oraz wi&#281;cej (powy&#380;sza lista zosta&#322;a zacytowana
za stron&#261; internetow&#261; Mercurial).</p></div><div class="sect2" title="GIT &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-git"></a><span class="bold"><strong>GIT</strong></span> &#8212; <a class="ulink" href="http://git.or.cz/" target="_top">http://git.or.cz/</a></h3></div></div></div><p>GIT jest projektem, któremu bieg nada&#322; Linus Torvalds, aby
zarz&#261;dza&#263; kodem &#378;ród&#322;owym j&#261;dra. Na pocz&#261;tku GIT by&#322; zorientowany
g&#322;ównie na wspomaganie rozwijania j&#261;dra systemu operacyjnego, ale
rozwin&#261;&#322; si&#281; i obecnie jest u&#380;ywany przez inne projekty. Na stronie
domowej mo&#380;na przeczyta&#263;, &#380;e jest "...zaprojektowany, aby podo&#322;a&#263; bardzo
du&#380;ym projektom z odpowiedni&#261; pr&#281;dko&#347;ci&#261; i efektywno&#347;ci&#261;; jest u&#380;ywany
g&#322;ównie przez ró&#380;norodne projekty open-source, z których najwi&#281;kszym
jest j&#261;dro systemu Linux. Git jest w kategori rozproszonych systemów
zarz&#261;dzania kodem, podobnym do np. GNU Archa czy Monotone (albo
BitKeepera ze &#347;wiata oprogramowania w&#322;asno&#347;ciowego). Ka&#380;da kopia robocza
Gita jest pe&#322;nym repozytorim, z pe&#322;nymi mo&#380;liwo&#347;ciami &#347;ledzenia rewizji,
niezale&#380;n&#261; od dost&#281;pu do siebi, czy te&#380; centralnego serwera."</p></div><div class="sect2" title="Bazaar &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-bazaar"></a><span class="bold"><strong>Bazaar</strong></span> &#8212; <a class="ulink" href="http://bazaar.canonical.com/" target="_top">http://bazaar.canonical.com/</a></h3></div></div></div><p>Bazaar jest nadal w miar&#281; wczesnej fazie rozwoju. B&#281;dzie
implementacj&#261; protoko&#322;u GNU Arch, zostanie kompatybilny wraz z rozwojem
protoko&#322;u i b&#281;dzie k&#322;adziony nacisk na wspó&#322;prac&#281; ze spo&#322;eczno&#347;ci&#261;,
która wytworzy&#322;a si&#281; dooko&#322;a GNU Archa w sprawie wszelkich zmian
protoko&#322;u, które mia&#322;yby wp&#322;yn&#261;&#263; na jego przyjazno&#347;&#263; u&#380;ytkownikowi.</p></div><div class="sect2" title="Bazaar-NG &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-bazaar-ng"></a><span class="bold"><strong>Bazaar-NG</strong></span> &#8212; <a class="ulink" href="http://bazaar-ng.org/" target="_top">http://bazaar-ng.org/</a></h3></div></div></div><p>Bazaar-NG (lub bzr) jest obecnie rozijany przez Canonical 
(<a class="ulink" href="http://canonical.com/" target="_top">http://canonical.com/</a>). Oferuje wybór pomi&#281;dzy
scentralizowanym jak i niescentralizowanym prowadzeniem jednego
projektu. Na przyk&#322;ad, pracuj&#261;c w biurze, mo&#380;e u&#380;ywa&#263; wspólnej ga&#322;&#281;zie;
nic jednak nie stoi na przeszkodzie, aby&#347; eksperymentowa&#322; na kodzie, na
w&#322;asnej ga&#322;&#281;zi, któr&#261; potem do&#322;&#261;czysz do g&#322;ównego drzewa.</p></div><div class="sect2" title="Darcs &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-darcs"></a><span class="bold"><strong>Darcs</strong></span> &#8212; <a class="ulink" href="http://abridgegame.org/darcs/" target="_top">http://abridgegame.org/darcs/</a></h3></div></div></div><p>"David's Advanced Revision Control System jest kolejnym
zast&#281;pnikiem CVSa. Jest napisany w Haskellu i by&#322; u&#380;uwany na Linuksie,
MacOS X, FreeBSD, OpenBSD jak i Microsoft Windows. Darcs zawiera skrypt
cgi, który mo&#380;e by&#263; u&#380;yty do przegl&#261;dania zawarto&#347;ci repozytorium."</p></div><div class="sect2" title="Arch &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-arch"></a><span class="bold"><strong>Arch</strong></span> &#8212; <a class="ulink" href="http://www.gnu.org/software/gnu-arch/" target="_top">http://www.gnu.org/software/gnu-arch/</a></h3></div></div></div><p>GNU Arch wspiera obydwa modele rozjowu oprogramowania -
scentralizowany jak i rozproszony. Programi&#347;ci zatwierdzaj&#261; swoje zmiany
do "archiwum", które mo&#380;e by&#263; lokalne, a zmiany mog&#261; by&#263; wypychane i
&#347;ci&#261;gane pomi&#281;dzy archiwami, w taki sposób, jak sobie zarz&#261;dcy archiwów
tego za&#380;ycz&#261;. Takie podej&#347;cie powoduje, &#380;e Arch ma o wiele lepsze
wsparcie dla &#322;&#261;czenia zmian ni&#380; cVS. Arch pozwala równie&#380; na proste
tworzenie odga&#322;&#281;zie&#324; archiwów, do których nie ma si&#281; prawa
zatwierdzania. To tylko krótka prezentacja, warto odwiedzi&#263; stron&#281;
projektu, by dowiedzie&#263; si&#281; wi&#281;cej.</p></div><div class="sect2" title="monotone &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-monotone"></a><span class="bold"><strong>monotone</strong></span> &#8212; <a class="ulink" href="http://www.venge.net/monotone/" target="_top">http://www.venge.net/monotone/</a></h3></div></div></div><p>"monotone is a free distributed version control system.  it
provides a simple, single-file transactional version store, with fully
disconnected operation and an efficient peer-to-peer synchronization
protocol.  it understands history-sensitive merging, lightweight
branches, integrated code review and 3rd party testing.  it uses
cryptographic version naming and client-side RSA certificates.  it has
good internationalization support, has no external dependencies, runs
on linux, solaris, OSX, and windows, and is licensed under the GNU
GPL."</p></div><div class="sect2" title="Codeville &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-codeville"></a><span class="bold"><strong>Codeville</strong></span> &#8212; <a class="ulink" href="http://codeville.org/" target="_top">http://codeville.org/</a></h3></div></div></div><p>"Why yet another version control system? All other version
control systems require that you keep careful track of the
relationships between branches so as not have to repeatedly merge the
same conflicts.  Codeville is much more anarchic.  It allows you to
update from or commit to any repository at any time with no
unnecessary re-merges."</p><p>"Codeville works by creating an identifier for each change which
is done, and remembering the list of all changes which have been
applied to each file and the last change which modified each line in
each file.  When there's a conflict, it checks to see if one of the
two sides has already been applied to the other one, and if so makes
the other side win automatically.  When there's an actual not
automatically mergeable version conflict, Codeville behaves in almost
exactly the same way as CVS."</p></div><div class="sect2" title="Vesta &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-vesta"></a><span class="bold"><strong>Vesta</strong></span> &#8212; <a class="ulink" href="http://www.vestasys.org/" target="_top">http://www.vestasys.org/</a></h3></div></div></div><p>"Vesta is a portable SCM [Software Configuration Management]
system targeted at supporting development of software systems of
almost any size, from fairly small (under 10,000 source lines) to very
large (10,000,000 source lines)."</p><p>"Vesta is a mature system.  It is the result of over 10 years of
research and development at the Compaq/Digital Systems Research
Center, and it was in production use by Compaq's Alpha microprocessor
group for over two and a half years.  The Alpha group had over 150
active developers at two sites thousands of miles apart, on the east
and west coasts of the United States.  The group used Vesta to manage
builds with as much as 130 MB of source data, each producing 1.5 GB of
derived data.  The builds done at the eastern site in an average day
produced about 10-15 GB of derived data, all managed by Vesta.
Although Vesta was designed with software development in mind, the
Alpha group demonstrated the system's flexibility by using it for
hardware development, checking their hardware description language
files into Vesta's source code control facility and building
simulators and other derived objects with Vesta's builder.  The
members of the former Alpha group, now a part of Intel, are continuing
to use Vesta today in a new microprocessor project."</p></div><div class="sect2" title="Aegis &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-aegis"></a><span class="bold"><strong>Aegis</strong></span> &#8212; <a class="ulink" href="http://aegis.sourceforge.net/" target="_top">http://aegis.sourceforge.net/</a></h3></div></div></div><p>"Aegis is a transaction-based software configuration management
system.  It provides a framework within which a team of developers may
work on many changes to a program independently, and Aegis coordinates
integrating these changes back into the master source of the program,
with as little disruption as possible."</p></div><div class="sect2" title="CVSNT &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-cvsnt"></a><span class="bold"><strong>CVSNT</strong></span> &#8212; <a class="ulink" href="http://cvsnt.org/" target="_top">http://cvsnt.org/</a></h3></div></div></div><p>"CVSNT is an advanced multiplatform version control system.
Compatible with the industry standard CVS protocol it now supports
many more features. ... CVSNT is Open Source, Free software licensed
under the GNU General Public License."  Its feature list includes
authentication via all standard CVS protocols, plus Windows specific
SSPI and Active Directory; secure transport support, via sserver or
encrypted SSPI; cross platform (runs in Windows or Unix environments);
NT version is fully integrated with Win32 system; MergePoint
processing means no more tagging to merge; under active
development.</p></div><div class="sect2" title="META-CVS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-meta-cvs"></a><span class="bold"><strong>META-CVS</strong></span> &#8212; <a class="ulink" href="http://users.footprints.net/~kaz/mcvs.html" target="_top">http://users.footprints.net/~kaz/mcvs.html</a></h3></div></div></div><p>"Meta-CVS is a version control system built around CVS.
Although it retains most of the features of CVS, including all of the
networking support, it is more capable than CVS, and easier to use."
The features listed on META-CVS's web site include: directory
structure versioning, improved file type handling, simpler and more
user-friendly branching and merging, support for symbolic links,
property lists attached to versioned data, improved third-party data
importing, and easy upgrading from stock CVS.</p></div><div class="sect2" title="OpenCM &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-opencm"></a><span class="bold"><strong>OpenCM</strong></span> &#8212; <a class="ulink" href="http://www.opencm.org/" target="_top">http://www.opencm.org/</a></h3></div></div></div><p>"OpenCM is designed as a secure, high-integrity replacement for
CVS.  A list of the key features can be found on the features page.
While not as 'feature rich' as CVS, it supports some useful things
that CVS lacks.  Briefly, OpenCM provides first-class support for
renames and configuration, cryptographic authentication and access
control, and first-class branches."</p></div><div class="sect2" title="Stellation &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-stellation"></a><span class="bold"><strong>Stellation</strong></span> &#8212; <a class="ulink" href="http://www.eclipse.org/stellation/" target="_top">http://www.eclipse.org/stellation/</a></h3></div></div></div><p>"Stellation is an advanced, extensible software configuration
management system, originally developed at IBM Research.  While
Stellation provides all of the standard functions available in any SCM
system, it is distinguished by a number of advanced features, such as
task-oriented change management, consistent project versioning and
lightweight branching, intended to ease the development of software
systems by large groups of loosely coordinated developers."</p></div><div class="sect2" title="PRCS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-prcs"></a><span class="bold"><strong>PRCS</strong></span> &#8212; <a class="ulink" href="http://prcs.sourceforge.net/" target="_top">http://prcs.sourceforge.net/</a></h3></div></div></div><p>"PRCS, the Project Revision Control System, is the front end to
a set of tools that (like CVS) provide a way to deal with sets of
files and directories as an entity, preserving coherent versions of
the entire set. ... Its purpose is similar to that of SCCS, RCS, and
CVS, but (according to its authors, at least), it is much simpler than
any of those systems."</p></div><div class="sect2" title="ArX &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-arx"></a><span class="bold"><strong>ArX</strong></span> &#8212; <a class="ulink" href="http://www.nongnu.org/arx/" target="_top">http://www.nongnu.org/arx/</a></h3></div></div></div><p>ArX is a distributed version control system offering branching
and merging features, cryptographic data integrity verification, and
the ability to publish archives easily on any HTTP server.</p></div><div class="sect2" title="SourceJammer &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-sourcejammer"></a><span class="bold"><strong>SourceJammer</strong></span> &#8212; <a class="ulink" href="http://sourcejammer.org/" target="_top">http://sourcejammer.org/</a></h3></div></div></div><p>"SourceJammer is a source control and versioning system written
in Java.  It consists of a server-side component that maintains the
files and version history, and handles check-in, check-out, etc. and
other commands; and a client-side component that makes requests of the
server and manages the files on the client-side file system."</p></div><div class="sect2" title="FastCST &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-fastcst"></a><span class="bold"><strong>FastCST</strong></span> &#8212; <a class="ulink" href="http://www.zedshaw.com/projects/fastcst/index.html" target="_top">http://www.zedshaw.com/projects/fastcst/index.html</a></h3></div></div></div><p>"A 'modern' system that uses changesets over file revisions and
distributed operation rather than centralized control.  As long as you
have an e-mail account you can use FastCST.  For larger distribution
you only need an FTP server and/or an HTTP server or use the built in
'serve' command to serve your stuff up directly.  All changesets are
universally unique and have tons of meta-data so you can reject
anything you don't [want] before you try it.  Merging is done by comparing a
merged changeset against the current directory contents, rather than
trying to merge it with another changeset."</p></div><div class="sect2" title="Superversion &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-superversion"></a><span class="bold"><strong>Superversion</strong></span> &#8212; <a class="ulink" href="http://www.superversion.org/" target="_top">http://www.superversion.org/</a></h3></div></div></div><p>"Superversion is a multi-user distributed version control system
based on change sets. It aims to be an industrial-strength, open
source alternative to commercial solutions that is equally easy to use
(or even easier) and similarly powerful. In fact, intuitive and
efficient usability has been one of the top priorities in
Superversion's development from the very beginning."</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="licensing-further-resources.html">Poprzedni</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bug-trackers.html">Nast&#281;pny</a></td></tr><tr><td width="40%" align="left" valign="top">Further Resources </td><td width="20%" align="center"><a accesskey="h" href="index.html">Spis tre&#347;ci</a></td><td width="40%" align="right" valign="top"> Dodatek B. Free Bug Trackers</td></tr></table></div></body></html>
