<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Preface</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="index.html" title="Producing Open Source Software"><link rel="next" href="audience.html" title="&#45572;&#44032; &#51060; &#52293;&#51012; &#51069;&#50612;&#50556; &#54616;&#45716;&#44032;?"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Preface</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#51060;&#51204;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="audience.html">&#45796;&#51020;</a></td></tr></table><hr></div><div class="preface" title="Preface"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>Preface</h2></div></div></div><div class="toc"><p><b>&#52264;&#47168;</b></p><dl><dt><span class="sect1"><a href="preface.html#%EC%99%9C">&#51060; &#52293;&#51012; &#50416;&#45716; &#51060;&#50976;</a></span></dt><dt><span class="sect1"><a href="audience.html">&#45572;&#44032; &#51060; &#52293;&#51012; &#51069;&#50612;&#50556; &#54616;&#45716;&#44032;?</a></span></dt><dt><span class="sect1"><a href="sources.html">Sources</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">Acknowledgments</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">Disclaimer</a></span></dt></dl></div><div class="sect1" title="&#51060; &#52293;&#51012; &#50416;&#45716; &#51060;&#50976;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="%EC%99%9C"></a>&#51060; &#52293;&#51012; &#50416;&#45716; &#51060;&#50976;</h2></div></div></div><p>&#47784;&#51076;&#51109;&#49548;&#46308;&#50640;&#49436; &#45236;&#44032; &#54532;&#47532; &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#47564;&#46304;&#45796;&#44256; &#54624;&#46412;, &#45908; &#51060;&#49345; &#49324;&#46988;&#46308;&#51008; &#45208;&#47484; &#47693;&#54616;&#45768; &#48148;&#46972;&#48372;&#51648; &#50506;&#45716;&#45796;. 
&#44536;&#46308;&#51008; "&#50500;, &#44536;&#47000;, &#47532;&#45573;&#49828; &#44057;&#51008; &#50724;&#54536;&#49548;&#49828;?" &#46972;&#44256; &#47568;&#54620;&#45796;. &#45208;&#45716; &#50676;&#49900;&#55176; &#44256;&#44060;&#47484; &#45124;&#45909;&#51060;&#47728; &#46041;&#51032;&#54620;&#45796;. "&#44536;&#47000;, &#47582;&#50500;! &#44536;&#44172; &#45236;&#44032; &#54616;&#45716; &#51068;&#51060;&#50556;."
 It's nice not to be completely fringe anymore. 

&#50696;&#51204; &#44057;&#50520;&#51004;&#47732; &#45796;&#51020;&#50640; &#50732; &#51656;&#47928;&#51008; &#54637;&#49345; &#50696;&#52769; &#44032;&#45733;&#54664;&#45796;: "&#44536;&#44152;&#47196; &#50620;&#47560;&#45208; &#46024;&#51012; &#48268;&#50612;?"
&#51060;&#50640; &#45824;&#45813;&#54616;&#44592; &#50948;&#54644;&#49436;, &#45208;&#45716; &#50724;&#54536;&#49548;&#49828;&#51032; &#44221;&#51228;&#49457;&#50640; &#45824;&#54644;&#49436; &#51221;&#47532;&#54664;&#45796;: 

&#54869;&#49892;&#54620; &#49548;&#54532;&#53944;&#50920;&#50612;&#44032; &#51316;&#51116;&#54616;&#45716; &#44163;&#51012; &#50896;&#54616;&#45716; &#49324;&#46988;&#46308;&#51032; &#51312;&#51649;&#46308;&#51060; &#51080;&#45716;&#45936;, &#44536;&#46308;&#51008; &#49548;&#54532;&#53944;&#50920;&#50612;&#44032; &#54032;&#47588;&#46104;&#44592;&#47484; &#50896;&#54616;&#45716; &#44163;&#51060; &#50500;&#45768;&#46972;, &#45800;&#51648; &#47932;&#54408;&#51060; &#50500;&#45772; &#46020;&#44396;&#47196;&#49436; &#49324;&#50857; &#44032;&#45733;&#54616;&#44256; &#50976;&#51648;&#46104;&#44592;&#47484; &#50896;&#54620;&#45796;.  
that there are organizations in whose interest it is to have certain
software exist, but that they don't need to sell copies, they just
want to make sure the software is available and maintained, as a tool
instead of as a commodity.</p><p>
&#49324;&#49892; &#45796;&#51020; &#51656;&#47928;&#51060; &#54637;&#49345; &#46024;&#50640; &#45824;&#54620; &#44163;&#47564;&#51008; &#50500;&#45768;&#45796;.  
&#50724;&#54536;&#49548;&#49828; &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#48708;&#51648;&#45768;&#49828; &#49324;&#47168;<sup>[<a name="idp5171472" href="#ftn.idp5171472" class="footnote">1</a>]</sup> is no longer so
mysterious, and even non-programmers already understand&#8212;or at
least are not surprised&#8212;that there are people employed at it
full time.  Instead, the next question is often "<span class="emphasis"><em>Oh, how
does that work?</em></span>"</p><p>&#45208;&#45716; &#50500;&#51649; &#47564;&#51313;&#51004;&#47196;&#50868; &#45824;&#45813;&#51012; &#52286;&#51648;&#45716; &#47803;&#54664;&#45796;, &#50724;&#55176;&#47140; &#45908; &#45432;&#47141;&#54624; &#49688;&#47197; &#51060; &#51452;&#51228;&#44032; &#50620;&#47560;&#45208; &#48373;&#51105;&#54620; &#44163;&#51064;&#51648; &#45712;&#44788;&#51276;&#45796;. 
&#54532;&#47532; &#49548;&#54532;&#53944;&#50920;&#50612; &#54532;&#47196;&#51229;&#53944;&#47484; &#50868;&#50689;&#54616;&#45716; &#44163;&#51008; &#49324;&#50629;&#51012; &#54616;&#45716; &#44163;&#44284;&#45716; &#45796;&#47476;&#45796;. (imagine having to constantly negotiate the nature
of your product with a group of volunteers, most of whom you've never
met!). &#50500;&#45768;&#45796;, &#50668;&#47084;&#44032;&#51648; &#51060;&#50976;&#47196;, &#51204;&#53685;&#51201;&#51064; &#48708;&#50689;&#47532; &#45800;&#52404;&#47484; &#50868;&#50689;&#54616;&#45716; &#44163;&#44284; &#44057;&#45796;. &#47784;&#46304; &#47732;&#50640;&#49436; &#50976;&#49324;&#51216;&#51060; &#51080;&#51648;&#47564;, &#45208;&#45716; &#54532;&#47532; &#49548;&#54532;&#53944;&#50920;&#50612;&#44032; 
<span class="foreignphrase"><em class="foreignphrase">&#46021;&#53945;&#54616;&#45796;</em></span>&#45716; &#44208;&#47200;&#51004;&#47196; &#52380;&#52380;&#55176; &#45796;&#44032;&#44032;&#44256; &#51080;&#45796;. There are many things with which it can be
usefully compared, but none with which it can be equated.  Indeed,
even the assumption that free software projects can be "run" is a
stretch.  A free software project can be <span class="emphasis"><em>started</em></span>,
and it can be influenced by interested parties, often quite strongly.
But its assets cannot be made the property of any single owner, and as
long as there are people somewhere&#8212;anywhere&#8212;interested in
continuing it, it cannot be unilaterally shut down.  Everyone has
infinite power; everyone has no power.  It's an interesting
dynamic.</p><p>That is why I wanted to write this book in the first place, and
seven years later, wanted to update it.  Free software projects have
evolved a distinct culture, an ethos in which the liberty to make the
software do anything one wants is a central tenet.  Yet the result of
this liberty is not a scattering of individuals each going their own
separate way with the code, but enthusiastic collaboration.  Indeed,
competence at cooperation itself is one of the most highly valued
skills in free software.  To manage these projects is to engage in a
kind of hypertrophied cooperation, where one's ability not only to
work with others but to come up with new ways of working together can
result in tangible benefits to the software.  This book attempts to
describe the techniques by which this may be done.  It is by no means
complete, but it is at least a beginning.</p><p>Good free software is a worthy goal in itself, and I hope that
readers who come looking for ways to achieve it will be satisfied with
what they find here.  But beyond that I also hope to convey something
of the sheer pleasure to be had from working with a motivated team of
open source developers, and from interacting with users in the
wonderfully direct way that open source encourages.  Participating in
a successful free software project is a deep pleasure, and ultimately
that's what keeps the whole system going.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp5171472" href="#idp5171472" class="para">1</a>] </sup>&#51060; &#47928;&#47589;&#50640;&#49436; "&#50724;&#54536; &#49548;&#49828; &#49548;&#54532;&#53944;&#50920;&#50612;" &#50752; "&#54532;&#47532; &#49548;&#54532;&#53944;&#50920;&#50612;"&#45716; &#48376;&#51656;&#51201;&#51004;&#47196; &#46041;&#51068;&#54616;&#45796;.;
they are discussed more in <a class="xref" href="introduction.html#free-vs-open-source" title='"Free" Versus "Open Source"'>&#8220;"Free" Versus "Open Source"&#8221;</a><span> in <a class="xref" href="introduction.html" title="1&#51109;. Introduction">1&#51109;. <i>Introduction</i></a></span>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#51060;&#51204;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="audience.html">&#45796;&#51020;</a></td></tr><tr><td width="40%" align="left" valign="top">Producing Open Source Software </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td><td width="40%" align="right" valign="top"> &#45572;&#44032; &#51060; &#52293;&#51012; &#51069;&#50612;&#50556; &#54616;&#45716;&#44032;?</td></tr></table></div></body></html>
