<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#33268;&#35874;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="preface.html" title="&#21069;&#35328;"><link rel="prev" href="sources.html" title="&#36164;&#26009;&#26469;&#28304;"><link rel="next" href="disclaimer.html" title="&#20813;&#36131;&#22768;&#26126;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#33268;&#35874;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="sources.html">Prev</a> </td><th width="60%" align="center">&#21069;&#35328;</th><td width="20%" align="right"> <a accesskey="n" href="disclaimer.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#33268;&#35874;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="acknowledgments"></a>&#33268;&#35874;</h2></div></div></div><div class="sect2" title="&#20889;&#32473;&#31532;&#19968;&#29256;(2005)"><div class="titlepage"><div><div><h3 class="title"><a name="acknowledgements-1st-ed"></a>&#20889;&#32473;&#31532;&#19968;&#29256;(2005)</h3></div></div></div><p>&#20889;&#20316;&#26412;&#20070;&#25152;&#32791;&#29992;&#30340;&#26102;&#38388;&#26159;&#25105;&#21407;&#26469;&#35774;&#24819;&#30340;&#22235;&#20493;&#65292;&#32780;&#22312;&#20889;&#20316;&#26399;&#38388;&#65292;&#26080;&#35770;&#25105;&#36523;&#22312;&#20309;&#22788;&#65292;&#24635;&#24863;&#35273;&#21040;&#33041;&#34955;&#19978;&#20223;&#20315;&#24748;&#25346;&#30528;&#19968;&#21488;&#22823;&#19977;&#35282;&#38050;&#29748;&#12290;&#27809;&#26377;&#20197;&#19979;&#20247;&#20154;&#30340;&#24110;&#21161;&#65292;&#25105;&#20415;&#19981;&#21487;&#33021;&#23436;&#25104;&#26412;&#20070;&#30340;&#20889;&#20316;&#32780;&#20173;&#28982;&#20445;&#25345;&#31934;&#31070;&#27491;&#24120;&#30340;&#29366;&#24577;&#12290;</p><p>&#26412;&#20070;&#30340;&#32534;&#36753;&#65292;O'Reilly&#20986;&#29256;&#31038;&#30340;Andy Oram&#26159;&#19968;&#20010;&#20316;&#23478;&#26790;&#23504;&#20197;&#27714;&#30340;&#32534;&#36753;&#12290;&#20182;&#19981;&#20294;&#35865;&#29087;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#65288;&#20070;&#20013;&#30340;&#35768;&#22810;&#39064;&#30446;&#26159;&#20182;&#24314;&#35758;&#30340;&#65289;&#65292;&#32780;&#19988;&#20855;&#26377;&#19968;&#31181;&#38750;&#20961;&#30340;&#25165;&#33021;&#65292;&#37027;&#23601;&#26159;&#30693;&#36947;&#23545;&#26041;&#24819;&#35828;&#20160;&#20040;&#65292;&#32780;&#19988;&#24110;&#21161;&#23545;&#26041;&#25214;&#21040;&#26368;&#20339;&#30340;&#34920;&#36798;&#26041;&#24335;&#12290;&#33021;&#19982;Andy&#21512;&#20316;&#26159;&#25105;&#30340;&#33635;&#24184;&#12290;&#22312;&#27492;&#65292;&#25105;&#20063;&#35201;&#24863;&#35874;Chuck Toporek&#65292;&#26159;&#20182;&#23558;&#26412;&#20070;&#30340;&#20889;&#20316;&#25552;&#35758;&#21450;&#26102;&#20256;&#32473;&#20102;Andy&#12290;</p><p>Brian Fitzpatrick&#22312;&#25105;&#20889;&#20316;&#26412;&#20070;&#30340;&#26102;&#20505;&#23457;&#38405;&#20102;&#20840;&#37096;&#30340;&#20869;&#23481;&#65292;&#36825;&#19981;&#20294;&#20351;&#26412;&#20070;&#26356;&#23436;&#21892;&#65292;&#32780;&#19988;&#22312;&#25105;&#21482;&#24819;&#20174;&#30005;&#33041;&#23631;&#24149;&#21069;&#38754;&#36867;&#36208;&#65292;&#36530;&#21040;&#19990;&#30028;&#19978;&#20219;&#20309;&#19968;&#20010;&#20854;&#23427;&#35282;&#33853;&#26102;&#65292;&#26159;Brian&#38829;&#31574;&#25105;&#32487;&#32493;&#20889;&#20316;&#12290;Ben Collins-Sussman&#21644;Mike
Pilato&#20063;&#32463;&#24120;&#35810;&#38382;&#20889;&#20316;&#30340;&#36827;&#31243;&#65292;&#32780;&#19988;&#24635;&#26159;&#20048;&#20110;&#35752;&#35770;&#37027;&#19968;&#21608;&#25105;&#27491;&#22312;&#20889;&#20316;&#30340;&#20219;&#20309;&#39064;&#30446;&#65292;&#26377;&#26102;&#20505;&#37027;&#26679;&#30340;&#35752;&#35770;&#38656;&#35201;&#36827;&#34892;&#24456;&#38271;&#26102;&#38388;&#12290;&#22312;&#25105;&#20889;&#20316;&#31245;&#26377;&#25032;&#24608;&#30340;&#26102;&#20505;&#65292;&#20182;&#20204;&#20063;&#20250;&#27880;&#24847;&#21040;&#65292;&#24182;&#21892;&#24847;&#22320;&#21152;&#20197;&#25552;&#37266;&#12290;&#35874;&#35874;&#20320;&#20204;&#65292;&#20249;&#35745;&#20204;&#12290;</p><p>&#22312;&#25105;&#25776;&#20889;&#26412;&#20070;&#30340;&#21516;&#26102;&#65292;Biella Coleman&#27491;&#22312;&#23436;&#25104;&#22905;&#30340;&#21338;&#22763;&#35770;&#25991;&#12290;&#22905;&#20102;&#35299;&#27599;&#22825;&#22352;&#19979;&#26469;&#20889;&#20316;&#24847;&#21619;&#30528;&#20160;&#20040;&#65292;&#22905;&#26082;&#26159;&#40723;&#33310;&#25105;&#20889;&#20316;&#30340;&#27036;&#26679;&#65292;&#21448;&#33021;&#20542;&#21548;&#25105;&#20889;&#20316;&#30340;&#33510;&#34935;&#12290;&#26356;&#33021;&#20197;&#19968;&#21452;&#20154;&#31867;&#23398;&#23478;&#30340;&#24935;&#30524;&#35266;&#23519;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#65292;&#32473;&#25105;&#25552;&#20379;&#20102;&#19968;&#20123;&#24819;&#27861;&#21644;&#21442;&#32771;&#36164;&#26009;&#65292;&#29992;&#20110;&#26412;&#20070;&#30340;&#20889;&#20316;&#24403;&#20013;&#12290;&#21478;&#19968;&#20301;&#20154;&#31867;&#23398;&#23478;Alex Golub&#37027;&#26102;&#20505;&#20063;&#22312;&#23436;&#25104;&#20182;&#30340;&#21338;&#22763;&#35770;&#25991;&#65292;&#32780;&#19988;&#20182;&#26412;&#20154;&#28041;&#36275;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#65292;&#20182;&#22312;&#26412;&#20070;&#21018;&#24320;&#22987;&#20889;&#20316;&#26102;&#32473;&#25105;&#25552;&#20379;&#20102;&#22823;&#37327;&#30340;&#25903;&#25345;&#65292;&#23545;&#25105;&#26377;&#26497;&#22823;&#30340;&#24110;&#21161;&#12290;</p><p>Micah Anderson&#20284;&#20046;&#20174;&#26410;&#22240;&#33258;&#24049;&#20889;&#20316;&#22823;&#37096;&#22836;&#32780;&#26377;&#21387;&#36843;&#24863;&#65292;&#36825;&#30495;&#26159;&#20196;&#20154;&#24974;&#24680;&#32780;&#21448;&#22930;&#24524;&#30340;&#40723;&#33310;&#65292;&#19982;&#20182;&#30340;&#21451;&#35850;&#21644;&#20132;&#35848;&#32473;&#20102;&#25105;&#24456;&#22823;&#30340;&#24110;&#21161;&#65292;&#32780;&#19988;&#65288;&#33267;&#23569;&#26377;&#19968;&#27425;&#65289;&#20182;&#20026;&#25105;&#25552;&#20379;&#20102;&#25216;&#26415;&#19978;&#30340;&#25903;&#25345;&#12290;&#22810;&#35874;&#20320;&#65292;Micah&#65281;</p><p>Jon Trowbridge&#21644;Sander Striker&#26082;&#32473;&#20104;&#20102;&#25105;&#40723;&#21169;&#20063;&#25552;&#20379;&#20102;&#20855;&#20307;&#30340;&#24110;&#21161;&#8212;&#20182;&#20204;&#22312;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#20013;&#20016;&#23500;&#30340;&#32463;&#39564;&#20026;&#26412;&#20070;&#25552;&#20379;&#20102;&#25105;&#19981;&#21487;&#33021;&#22312;&#21035;&#22788;&#25214;&#21040;&#30340;&#32032;&#26448;&#12290;</p><p>&#25105;&#35201;&#24863;&#35874;Greg Stein&#65292;&#19981;&#20165;&#22240;&#20026;&#25105;&#20204;&#20043;&#38388;&#30340;&#21451;&#35850;&#21644;&#20182;&#36866;&#26102;&#30340;&#40723;&#21169;&#65292;&#26356;&#22240;&#20026;&#20182;&#21521;Subversion&#39033;&#30446;&#34920;&#26126;&#23450;&#26399;&#22320;&#20195;&#30721;&#35780;&#23457;&#23545;&#24314;&#35774;&#19968;&#20010;&#32534;&#31243;&#31038;&#21306;&#26159;&#19968;&#39033;&#22810;&#20040;&#37325;&#35201;&#30340;&#24037;&#20316;&#12290;&#25105;&#20063;&#35201;&#24863;&#35874;Brian Behlendorf&#65292;&#20182;&#24039;&#22937;&#22320;&#21578;&#35819;&#25105;&#20204;&#36827;&#34892;&#20844;&#24320;&#35752;&#35770;&#30340;&#37325;&#35201;&#24615;&#65307;&#25105;&#24076;&#26395;&#36825;&#19968;&#21407;&#21017;&#36143;&#31359;&#20102;&#26412;&#20070;&#30340;&#22987;&#32456;&#12290;</p><p>&#24863;&#35874;Benjamin &#8220;Mako&#8221; Hill&#21644;Seth Schoen&#19982;&#25105;&#36827;&#34892;&#30340;&#26377;&#20851;&#33258;&#30001;&#36719;&#20214;&#21450;&#20854;&#25919;&#27835;&#26041;&#38754;&#30340;&#33509;&#24178;&#35848;&#35805;&#65307;&#24863;&#35874;Zack
Urlocker&#21644;Louis Suarez-Potts&#22312;&#30334;&#24537;&#20043;&#20013;&#25277;&#31354;&#25509;&#21463;&#25105;&#30340;&#37319;&#35775;&#65307;&#24863;&#35874;Slashcode&#21517;&#21333;&#19978;&#30340;Shane&#20801;&#35768;&#25105;&#24341;&#29992;&#20182;&#30340;&#24086;&#23376;&#65307;&#24863;&#35874;Haggen
So&#25552;&#20379;&#30340;&#26377;&#20851;&#21046;&#20316;&#23436;&#25104;&#30340;&#20027;&#39029;&#20043;&#27604;&#36739;&#65292;&#37027;&#26497;&#20854;&#26377;&#24110;&#21161; &#12290;</p><p>&#24863;&#35874;Alla
Dekhtyar&#12289;Polina&#20197;&#21450;Sonya&#32473;&#20104;&#25105;&#27704;&#19981;&#20518;&#24608;&#21450;&#32784;&#24515;&#30340;&#40723;&#21169;&#12290;&#25105;&#30495;&#39640;&#20852;&#25105;&#19981;&#24517;&#22312;&#25105;&#20204;&#30340;&#26202;&#38388;&#32858;&#20250;&#19978;&#25552;&#26089;&#21578;&#36766;&#65288;&#25110;&#26356;&#30830;&#20999;&#22320;&#35828;&#65292;&#24651;&#24651;&#19981;&#33293;&#22320;&#21578;&#36766;&#65289;&#32780;&#22238;&#23478;&#21435;&#20889;&#8220;&#37027;&#26412;&#20070;&#8221;&#12290;</p><p>&#24863;&#35874;Jack
Repenning&#32473;&#20104;&#25105;&#30340;&#21451;&#35850;&#12289;&#20132;&#35848;&#12289;&#20197;&#21450;&#20182;&#22266;&#25191;&#22320;&#25298;&#32477;&#25509;&#21463;&#19981;&#36153;&#21147;&#27668;&#30340;&#38169;&#35823;&#20998;&#26512;&#65292;&#32780;&#19981;&#36951;&#20313;&#21147;&#25214;&#23547;&#27491;&#30830;&#31572;&#26696;&#30340;&#20915;&#24515;&#12290;&#25105;&#24076;&#26395;&#20182;&#22312;&#33258;&#30001;&#36719;&#20214;&#24320;&#21457;&#20197;&#21450;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#20013;&#38271;&#26399;&#32780;&#20016;&#23500;&#30340;&#32463;&#39564;&#22312;&#26412;&#20070;&#20013;&#24471;&#20197;&#20307;&#29616;&#12290;</p><p>&#22312;&#26412;&#20070;&#20889;&#20316;&#26399;&#38388;&#65292;CollabNet&#26497;&#20854;&#24951;&#24936;&#22320;&#20801;&#35768;&#25105;&#37319;&#29992;&#19968;&#20010;&#28789;&#27963;&#30340;&#24037;&#20316;&#26085;&#31243;&#65292;&#32780;&#24403;&#25105;&#38656;&#35201;&#30340;&#26102;&#38388;&#36828;&#36828;&#36229;&#20986;&#21407;&#20808;&#39044;&#35745;&#30340;&#26102;&#20505;&#65292;&#20182;&#20204;&#27809;&#26377;&#25265;&#24616;&#12290;&#25105;&#24182;&#19981;&#23436;&#20840;&#20102;&#35299;&#31649;&#29702;&#23618;&#22312;&#20570;&#36825;&#26679;&#30340;&#20915;&#23450;&#26102;&#32771;&#34385;&#30340;&#20010;&#20013;&#32454;&#33410;&#65292;&#20294;&#25105;&#29468;&#24819;Sandhya Klute&#65292;&#32780;&#21518;&#26159;Mahesh Murthy&#65292;&#22343;&#21442;&#19982;&#20102;&#36825;&#39033;&#20915;&#23450;&#8212;&#25105;&#22312;&#27492;&#24863;&#35874;&#20182;&#20204;&#20004;&#20301;&#12290;</p><p>&#25972;&#20010;Subversion&#24320;&#21457;&#22242;&#38431;&#22312;&#36807;&#21435;&#30340;&#20116;&#24180;&#26159;&#25105;&#28789;&#24863;&#30340;&#28304;&#27849;&#65292;&#26412;&#20070;&#20013;&#25551;&#36848;&#30340;&#32477;&#22823;&#37096;&#20998;&#20869;&#23481;&#37117;&#26159;&#25105;&#19982;&#20043;&#20849;&#20107;&#25152;&#24471;&#12290;&#30001;&#20110;&#20154;&#25968;&#20247;&#22810;&#65292;&#25105;&#22312;&#27492;&#19981;&#33021;&#19968;&#19968;&#21015;&#20030;&#20182;&#20204;&#30340;&#22995;&#21517;&#65292;&#20294;&#26159;&#25105;&#24691;&#35831;&#21508;&#20301;&#35835;&#32773;&#65292; &#20551;&#22914;&#20320;&#26377;&#19968;&#22825;&#20598;&#36935;&#19968;&#20301;Subversion&#30340;&#24320;&#21457;&#20154;&#21592;&#65292;&#35831;&#20026;&#20182;&#20080;&#19968;&#26479;&#20182;&#26368;&#29233;&#21917;&#30340;&#37202;&#8212;&#25105;&#26412;&#20154;&#32943;&#23450;&#35201;&#37027;&#26679;&#20570;&#12290;</p><p>&#25105;&#26366;&#22810;&#27425;&#19982;Rachel Scollon&#32993;&#35328;&#20081;&#35821;&#65292;&#21465;&#35828;&#20889;&#20070;&#30340;&#36827;&#31243;&#65292;&#32780;&#22905;&#24635;&#26159;&#20048;&#20110;&#20542;&#21548;&#65292;&#24182;&#19988;&#33021;&#22815;&#35774;&#27861;&#20351;&#38382;&#39064;&#22823;&#32780;&#21270;&#23567;&#12290;&#37027;&#23545;&#25105;&#26377;&#24456;&#22823;&#30340;&#24110;&#21161;&#8212;&#22810;&#35874;&#12290;</p><p>&#65288;&#20877;&#27425;&#65289;&#24863;&#35874;Noel
Taylor&#65292;&#20182;&#19968;&#23450;&#21313;&#20998;&#19981;&#35299;&#65292;&#20026;&#20309;&#25105;&#22312;&#19978;&#27425;&#39057;&#39057;&#25265;&#24616;&#20043;&#21518;&#21448;&#20915;&#23450;&#20889;&#31532;&#20108;&#26412;&#20070;&#65292;&#28982;&#32780;&#65292;Noel&#32473;&#20104;&#25105;&#30340;&#21451;&#35850;&#65292;&#20197;&#21450;&#20182;&#39046;&#23548;&#20043;&#19979;&#30340;Golosá&#21512;&#21809;&#22242;&#20351;&#25105;&#30340;&#29983;&#27963;&#21363;&#20351;&#22312;&#26368;&#24537;&#30860;&#30340;&#26102;&#33410;&#20381;&#28982;&#26377;&#38899;&#20048;&#21644;&#22909;&#21451;&#30456;&#20276;&#12290;&#25105;&#36824;&#35201;&#24863;&#35874;Matthew Dean&#21644;Dorothea
Samtleben&#65292;&#25105;&#30340;&#22909;&#21451;&#20197;&#21450;&#22240;&#25105;&#32780;&#39281;&#21463;&#25240;&#30952;&#30340;&#38899;&#20048;&#21512;&#20316;&#20249;&#20276;&#65292;&#22312;&#25105;&#22810;&#27425;&#26080;&#27861;&#19982;&#20043;&#25490;&#32451;&#30340;&#26102;&#20505;&#65292;&#20182;&#20204;&#24635;&#26159;&#32473;&#20104;&#25105;&#26497;&#22823;&#30340;&#29702;&#35299;&#12290;Megan
Jennings&#24635;&#26159;&#32473;&#20104;&#26368;&#22823;&#30340;&#25903;&#25345;&#65292;&#24182;&#23545;&#19968;&#20010;&#22905;&#24182;&#19981;&#21313;&#20998;&#29087;&#24713;&#30340;&#39064;&#30446;&#34920;&#29616;&#20986;&#30495;&#35802;&#30340;&#20852;&#36259;&#8212;&#36825;&#23545;&#19968;&#20010;&#32570;&#20047;&#20449;&#24515;&#30340;&#20316;&#23478;&#26469;&#35828;&#26080;&#24322;&#20110;&#19968;&#21058;&#23450;&#24515;&#20024;&#12290;&#22810;&#35874;&#20102;&#65292;&#25105;&#30340;&#32769;&#21451;&#20204;&#65281;</p><p>&#26412;&#20070;&#26377;&#22235;&#20301;&#23398;&#35782;&#28170;&#21338;&#32780;&#21448;&#20834;&#20834;&#19994;&#19994;&#30340;&#35780;&#23457;&#32773;&#65306;Yoav Shapira&#12289;Andrew Stellman&#12289;Dayanum Srinivas&#21644;Ben
Hyde&#12290;&#20551;&#22914;&#25105;&#33021;&#20840;&#37096;&#37319;&#32435;&#20182;&#20204;&#25552;&#20986;&#30340;&#26497;&#22909;&#30340;&#24314;&#35758;&#65292;&#26412;&#20070;&#26080;&#30097;&#23558;&#26356;&#21152;&#23436;&#21892;&#12290;&#20294;&#30001;&#20110;&#26102;&#38388;&#30340;&#38480;&#21046;&#65292;&#25105;&#19981;&#24471;&#19981;&#26377;&#36873;&#25321;&#24615;&#22320;&#21152;&#20197;&#37319;&#32435;&#12290;&#21363;&#20415;&#22914;&#27492;&#65292;&#26412;&#20070;&#30340;&#25913;&#36827;&#20173;&#28982;&#21313;&#20998;&#26174;&#33879;&#65292;&#20219;&#20309;&#36951;&#30041;&#19979;&#26469;&#30340;&#38169;&#35823;&#37117;&#24212;&#30001;&#25105;&#26412;&#20154;&#25215;&#25285;&#12290;</p><p>&#25105;&#30340;&#29238;&#27597;Frances&#21644;Henry&#19968;&#22914;&#26082;&#24448;&#22320;&#32473;&#20104;&#25105;&#22823;&#21147;&#30340;&#25903;&#25345;&#65292;&#19982;&#19978;&#19968;&#26412;&#20070;&#30456;&#27604;&#65292;&#36825;&#26412;&#20070;&#27809;&#26377;&#37027;&#20040;&#22810;&#25216;&#26415;&#19987;&#19994;&#21517;&#35789;&#65292;&#22240;&#32780;&#25105;&#24076;&#26395;&#20182;&#20204;&#35273;&#24471;&#36825;&#26412;&#20070;&#35835;&#36215;&#26469;&#23481;&#26131;&#19968;&#20123;&#12290;</p><p>&#26368;&#21518;&#65292;&#25105;&#35201;&#24863;&#35874;&#25105;&#30340;&#20004;&#20301;&#25370;&#29233;&#22909;&#21451;&#65292;Karen Underhill&#21644;Jim Blandy&#12290;&#22312;&#20889;&#20316;&#26412;&#20070;&#26399;&#38388;&#20197;&#21450;&#22312;&#36807;&#21435;&#30340;&#19971;&#24180;&#37324;&#65292;Karen&#32473;&#20104;&#25105;&#30340;&#21451;&#35850;&#21644;&#29702;&#35299;&#23545;&#25105;&#26469;&#35828;&#24847;&#21619;&#30528;&#19968;&#20999;&#12290;&#27809;&#26377;&#22905;&#30340;&#24110;&#21161;&#65292;&#25105;&#26159;&#19981;&#21487;&#33021;&#23436;&#25104;&#26412;&#20070;&#30340;&#20889;&#20316;&#30340;&#12290;Jim&#23545;&#25105;&#26469;&#35828;&#20063;&#26159;&#19968;&#26679;&#65292;&#19968;&#20010;&#30495;&#27491;&#30340;&#26379;&#21451;&#65292;&#19968;&#20010;&#35745;&#31639;&#26426;&#34892;&#19994;&#20013;&#30340;&#29579;&#32773;&#20043;&#29579;&#65292;&#26159;Jim&#23558;&#25105;&#24102;&#20837;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#65292;&#27491;&#22914;&#19968;&#21482;&#40479;&#32473;&#20104;&#39134;&#26426;&#39134;&#34892;&#30340;&#28789;&#24863;&#12290;</p></div><div class="sect2" title="&#20889;&#32473;&#31532;&#20108;&#29256;(2017)"><div class="titlepage"><div><div><h3 class="title"><a name="acknowledgements-2nd-ed"></a>&#20889;&#32473;&#31532;&#20108;&#29256;(2017)</h3></div></div></div><p>&#36825;&#26412;&#20070;&#30340;&#31532;&#20108;&#29256;&#24471;&#21040;&#20102;&#27604;&#31532;&#19968;&#29256;&#26356;&#22810;&#30340;&#20154;&#30340;&#24110;&#21161;&#65292;&#24403;&#28982;&#65292;&#22312;&#33268;&#35874;&#20013;&#20063;&#21487;&#33021;&#23384;&#22312;&#26356;&#22810;&#26080;&#24515;&#30340;&#36951;&#28431;&#12290;&#22914;&#26524;&#36825;&#37324;&#36951;&#28431;&#20102;&#24744;&#30340;&#21517;&#23383;&#65292;&#35831;&#25509;&#21463;&#25105;&#30340;&#27465;&#24847;&#65288;&#20063;&#35831;&#24744;&#36890;&#30693;&#25105;&#65292;&#33267;&#23569;&#25105;&#20204;&#33021;&#25226;&#22312;&#32447;&#29256;&#26412;&#25913;&#19968;&#25913;&#65289;</p><p>&#26469;&#33258;O'Reilly Media&#20844;&#21496;&#30340;Andy Oram&#65292;&#20182;&#25552;&#20379;&#30340;&#24110;&#21161;&#20877;&#19968;&#27425;&#36828;&#36828;&#36229;&#36807;&#20182;&#20316;&#20026;&#32534;&#36753;&#24212;&#23613;&#30340;&#32844;&#36131;&#12290;&#20182;&#35835;&#24471;&#24456;&#35748;&#30495;&#24182;&#25552;&#20379;&#20102;&#24456;&#22810;&#26497;&#22909;&#30340;&#24314;&#35758;&#65292;&#26080;&#35770;&#26159;&#24635;&#20307;&#26469;&#35828;&#20182;&#30340;&#20889;&#20316;&#33021;&#21147;&#65292;&#25110;&#32773;&#26159;&#20182;&#24320;&#28304;&#26041;&#38754;&#30340;&#36896;&#35811;&#65292;&#22312;&#20182;&#25152;&#26377;&#30340;&#35780;&#35770;&#20013;&#37117;&#26174;&#24471;&#28107;&#28435;&#23613;&#33268;&#12290;&#36825;&#26412;&#20070;&#22240;&#20026;&#20182;&#30340;&#37325;&#35270;&#32780;&#24471;&#21040;&#24456;&#22823;&#25552;&#39640;&#65292;&#24863;&#28608;&#20043;&#24773;&#26080;&#20197;&#35328;&#34920;&#12290;</p><p>&#25105;&#21644;James Vasile&#24050;&#32463;&#26159;&#22810;&#24180;&#30340;&#22909;&#21451;&#21644;&#21516;&#20107;&#20102;&#65292;&#27599;&#21608;&#25105;&#37117;&#33021;&#22312;&#20182;&#36523;&#19978;&#23398;&#21040;&#26032;&#30340;&#19996;&#35199;&#12290;&#23613;&#31649;&#20182;&#26377;&#19968;&#20221;&#24537;&#30860;&#30340;&#24037;&#20316;&#8212;&#25105;&#20204;&#26159;&#21830;&#19994;&#20249;&#20276;&#65292;&#25152;&#20197;&#25105;&#30693;&#36947;&#30340;&#24456;&#28165;&#26970;&#8212;&#21644;&#20182;&#23478;&#37324;&#30340;&#23567;&#23401;&#20799;&#65292;&#20182;&#20173;&#28982;&#27627;&#19981;&#29369;&#35947;&#30340;&#24110;&#24537;&#30475;&#25163;&#31295;&#24182;&#25552;&#20379;&#24847;&#35265;&#12290;&#36825;&#20123;&#37117;&#26159;&#38065;&#20080;&#19981;&#26469;&#30340;&#65292;&#23601;&#31639;&#35201;&#20080;&#65292;&#25105;&#20063;&#20184;&#19981;&#36215;James&#21568;&#12290;&#35874;&#20102;&#65292;&#20804;&#24351;&#12290;</p><p>Cecilia Donnelly&#65292;&#22905;&#26082;&#26159;&#19968;&#20010;&#24456;&#26834;&#30340;&#26379;&#21451;&#65292;&#21516;&#26102;&#20063;&#26159;&#24320;&#28304;&#26041;&#38754;&#24456;&#21385;&#23475;&#30340;&#19987;&#23478;&#65292;&#20219;&#32844;&#20110;&#33437;&#21152;&#21733;&#30340;Open Tech Strategies&#21150;&#20844;&#23460;&#12290;&#25105;&#21644;&#22905;&#20849;&#20107;&#24456;&#24841;&#24555;&#65292;&#36830;&#25105;&#20204;&#30340;&#22996;&#25176;&#20154;&#37117;&#30693;&#36947;&#12290;&#22905;&#28165;&#26224;&#30340;&#24605;&#32500;&#21644;&#25935;&#38160;&#30340;&#27934;&#23519;&#21147;&#23545;&#26412;&#20070;&#30340;&#22810;&#20010;&#37096;&#20998;&#37117;&#26377;&#24433;&#21709;&#12290;</p><p>Karen Sandler&#19968;&#30452;&#19981;&#20518;&#30340;&#24110;&#21161;&#25105;&#12290;&#25105;&#20204;&#28145;&#20837;&#32454;&#33268;&#22320;&#23601;&#36825;&#26412;&#20070;&#20013;&#30340;&#24456;&#22810;&#35805;&#39064;&#35752;&#35770;&#36807;&#65288;&#29978;&#33267;&#26159;&#19968;&#20123;&#29305;&#27530;&#30340;&#26696;&#20363;&#65289;&#12290;&#21644;&#19982;James&#32842;&#22825;&#19968;&#26679;&#65292;&#24403;&#25105;&#20204;&#32842;&#33258;&#30001;&#36719;&#20214;&#21644;&#20854;&#20182;&#19968;&#20123;&#20107;&#30340;&#26102;&#20505;&#65292;&#25105;&#36890;&#24120;&#20063;&#37117;&#33021;&#22312;Karen&#36523;&#19978;&#23398;&#21040;&#19996;&#35199;&#12290;</p><p>&#22240;&#20026;Bradley Kuhn&#22810;&#27425;&#25552;&#20986;&#21313;&#20998;&#19987;&#19994;&#30340;&#21453;&#39304;&#24847;&#35265;&#65292;&#26377;&#19968;&#27425;&#20182;&#36824;&#33258;&#24049;&#20889;&#34917;&#19969;&#65292;&#25152;&#20197;&#20182;&#30340;&#21517;&#23383;&#22312;&#36825;&#26412;&#20070;&#30340;commit&#26085;&#24535;&#37324;&#38754;&#20986;&#29616;&#36807;&#24456;&#22810;&#27425;&#12290;&#27491;&#22914;&#25105;&#22312;&#20854;&#20013;&#19968;&#20010;commit&#30340;&#26085;&#24535;&#28040;&#24687;&#37324;&#20889;&#30340;&#19968;&#26679;&#65292;&#8221;&#20182;&#23545;&#33258;&#30001;&#36719;&#20214;&#30340;&#36129;&#29486;&#26080;&#21487;&#20272;&#37327;&#65292;&#20182;&#30340;&#21442;&#19982;&#20026;&#25105;&#20204;&#20849;&#21516;&#30340;&#20107;&#19994;&#25552;&#20379;&#20102;&#26080;&#38480;&#30340;&#28789;&#24863;&#8221;</p><p>Karen&#21644;Bradley&#37117;&#20026;Software Freedom Conservancy(<a class="ulink" href="https://sfconservancy.org/" target="_top">https://sfconservancy.org/</a>)&#24037;&#20316;&#12290;&#22914;&#26524;&#20320;&#21916;&#27426;&#36825;&#26412;&#20070;&#24182;&#19988;&#24819;&#24110;&#21161;&#33258;&#30001;&#36719;&#20214;&#65292;&#25424;&#21161;&#36825;&#20010;&#32452;&#32455;&#21487;&#20197;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#24320;&#22987;&#65292;&#24403;&#28982;&#20043;&#21518;&#20063;&#21487;&#20197;&#25424;&#21161;&#21734;&#12290;</p><p>Ben Reser&#32473;&#31532;&#20845;&#31456;&#12289;&#31532;&#19971;&#31456;&#25552;&#20379;&#20102;&#24456;&#32454;&#33268;&#12289;&#19987;&#19994;&#30340;&#35780;&#35770;&#65292;&#36825;&#20123;&#35780;&#35770;&#35753;&#20070;&#22686;&#33394;&#19981;&#23569;&#12290;Ben&#65292;&#35874;&#35874;&#20320;&#20102;&#12290;</p><p>Michael Bernstein&#19981;&#20165;&#22312;&#31532;&#19968;&#29256;&#21644;&#31532;&#20108;&#29256;&#30340;&#38388;&#38548;&#26399;&#25552;&#20379;&#20102;&#35768;&#22810;&#32454;&#33268;&#30340;&#21453;&#39304;&#65292;&#20182;&#36824;&#24110;&#21161;&#32452;&#32455;&#20102;KickStarter&#27963;&#21160;&#65292;&#24182;&#20351;&#20043;&#25104;&#20026;&#21487;&#33021;&#12290;&#35874;&#35874;&#20320;&#65292;Michael&#12290;</p><p>Danese Cooper&#24635;&#26159;&#35753;&#25105;&#23545;&#39033;&#30446;&#20445;&#25345;&#19987;&#27880;&#65292;&#29305;&#21035;&#22320;&#65292;&#22905;&#20026;&#25105;&#24102;&#26469;&#28040;&#24687;&#65288;&#36215;&#21021;&#25105;&#19981;&#24819;&#21548;&#65289;&#65292;&#28040;&#24687;&#35828;innersourcing&#65288;&#22312;&#32452;&#32455;&#20869;&#37096;&#37319;&#29992;&#24320;&#28304;&#24320;&#21457;&#27169;&#24335;&#65289;&#21487;&#20197;&#35753;&#32452;&#32455;&#20102;&#35299;&#23398;&#20064;&#24320;&#28304;&#30340;&#24212;&#29992;&#65292;&#26368;&#32456;&#33258;&#24049;&#20063;&#20316;&#20986;&#24320;&#28304;&#36719;&#20214;&#12290;&#25105;&#35201;&#20026;&#27492;&#21644;&#20854;&#20182;&#24456;&#22810;&#20107;&#24773;&#24863;&#35874;&#20320;&#65292;Danese&#12290;</p><p>&#22312;&#36825;&#20004;&#20010;&#29256;&#26412;&#20043;&#38388;&#65292;&#25105;&#24230;&#36807;&#20102;&#24456;&#26377;&#25910;&#33719;&#30340;&#19968;&#27573;&#26102;&#26399;&#12290;&#25105;&#20316;&#20026;&#24320;&#25918;&#20114;&#32852;&#32593;&#24037;&#20855;&#39033;&#30446;&#30740;&#31350;&#21592;&#65292;&#22312;O'Reilly Media&#21644;Code for America / Civic Commons&#65288;&#25105;&#21313;&#20998;&#24863;&#35874;&#20182;&#20204;&#28909;&#24515;&#25552;&#20379;&#30340;&#22312;&#32445;&#32422;&#22478;&#30340;Open Plans&#21150;&#20844;&#23460;&#30340;&#21150;&#20844;&#21306;&#22495;&#65289;&#21644;New America Foundation&#24037;&#20316;&#12290;&#25105;&#22312;&#36825;&#39033;&#24037;&#20316;&#20013;&#23398;&#21040;&#30340;&#22823;&#37096;&#20998;&#19996;&#35199;&#37117;&#20889;&#22312;&#20102;&#20070;&#37324;&#65292;&#38500;&#20102;&#35201;&#24863;&#35874;&#36825;&#20123;&#32452;&#32455;&#26412;&#36523;&#65292;&#25105;&#36824;&#35201;&#21478;&#22806;&#29305;&#21035;&#24863;&#35874;Tim O'Reilly, Jen Pahlka, Andrew McLaughlin, Philip Ashlock, Abhi Nemani, Nick Grossman, Chris Holmes, Frank Hebbert, and Andrew Hoppin&#65292;&#25105;&#24863;&#35874;&#20182;&#20204;&#21644;&#25105;&#20998;&#20139;&#30340;&#24819;&#27861;&#21644;&#35266;&#28857;&#12290;</p><p>&#22810;&#24180;&#26469;&#65292;Sumana Harihareswara&#21644;Leonard Richardson&#23545;&#24320;&#28304;&#36719;&#20214;&#30340;&#20107;&#24773;&#25552;&#20379;&#20102;&#22374;&#29575;&#19988;&#26377;&#30410;&#30340;&#35780;&#35770;&#65292;&#20182;&#20204;&#30340;&#36129;&#29486;&#35753;&#36825;&#26412;&#20070;&#26085;&#30410;&#23436;&#21892;&#65292;&#21644;&#20182;&#20204;&#20570;&#26379;&#21451;&#20063;&#35753;&#25105;&#21463;&#30410;&#21290;&#27973;&#12290; </p><p>Software Freedom Law Center (<a class="ulink" href="https://softwarefreedom.org/" target="_top">https://softwarefreedom.org/</a>)&#30340;Eben Moglen&#25945;&#20250;&#25105;&#22914;&#20309;&#23558;&#33258;&#30001;&#36719;&#20214;&#35270;&#20026;&#22823;&#35268;&#27169;&#30340;&#31038;&#20250;&#21644;&#32463;&#27982;&#29616;&#35937;&#12290;&#20182;&#36824;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#20026;&#25105;&#25552;&#20379;&#20010;&#20154;&#30340;&#21150;&#20844;&#22320;&#28857;&#65292;&#36825;&#38750;&#24120;&#26377;&#24110;&#21161;&#12290;&#35874;&#35874;&#20320;&#65292;Eben&#12290;</p><p>David A. Wheeler&#21338;&#22763;&#27599;&#22825;&#35201;&#22238;&#31572;&#37027;&#20040;&#22810;&#20154;&#30340;&#25552;&#38382;&#65292;&#25105;&#20063;&#19981;&#30693;&#36947;&#20182;&#26159;&#22914;&#20309;&#25277;&#20986;&#26102;&#38388;&#26469;&#22238;&#31572;&#25105;&#20598;&#23572;&#35831;&#25945;&#30340;&#38382;&#39064;&#30340;&#12290;&#20294;&#20182;&#20570;&#21040;&#20102;&#65292;&#27599;&#27425;&#30340;&#22238;&#31572;&#37117;&#22914;&#27492;&#27491;&#30830;&#21644;&#21487;&#38752;&#12290;&#19968;&#30452;&#20197;&#26469;&#37117;&#22810;&#35874;&#20320;&#20102;&#65292;David&#12290;</p><p>Breena Xie&#23545;&#24320;&#28304;&#30340;&#20852;&#36259;&#24456;&#24555;&#25351;&#24341;&#22905;&#21457;&#29616;&#20102;&#20851;&#20110;&#24320;&#28304;&#30340;&#28145;&#21051;&#38382;&#39064;&#12290;&#22312;&#25105;&#25512;&#25970;&#26412;&#20070;&#20013;&#19968;&#20123;&#29305;&#23450;&#20027;&#39064;&#30340;&#26102;&#20505;&#65292;&#36825;&#20123;&#38382;&#39064;&#23545;&#25105;&#24456;&#26377;&#24110;&#21161;&#12290;&#21516;&#26102;&#25105;&#20063;&#35201;&#24863;&#35874;&#22905;&#30340;&#32784;&#24515;&#65292;&#29305;&#21035;&#26159;&#26377;&#26102;&#20505;&#21344;&#29992;&#22905;&#36807;&#22810;&#30340;&#26102;&#38388;&#65288;&#36229;&#36807;&#20102;&#25105;&#21644;&#22905;&#19968;&#24320;&#22987;&#35828;&#30340;&#26102;&#38388;&#65289;&#12290;&#35874;&#35874;&#20320;&#65292;Breena&#12290;</p><p>&#38750;&#24120;&#24863;&#35874;Radhir Kothuri&#21644;&#20854;&#20182;HackIllinois 2017&#30340;&#25104;&#21592;&#65292;2017&#24180;2&#26376;,&#20182;&#20204;&#22312;&#20234;&#21033;&#35834;&#20234;&#24030;&#30340;&#20234;&#21033;&#35834;&#20234;&#22823;&#23398;&#39321;&#27103;&#20998;&#26657;&#20030;&#21150;&#30340;&#27963;&#21160;&#28041;&#21450;&#21040;&#21360;&#21047;&#26032;&#29256;&#20070;&#30340;&#26102;&#20505;&#65292;&#20182;&#20204;&#21450;&#26102;&#30340;&#40723;&#21169;&#20102;&#22823;&#23478;&#12290;&#25105;&#24456;&#24863;&#35874;&#20182;&#20204;&#23545;&#36825;&#26412;&#20070;&#20449;&#20219;&#24230;&#36827;&#34892;&#30340;&#25237;&#31080;&#65292;&#21516;&#26102;&#24076;&#26395;HackIllinois&#30340;&#21442;&#19982;&#32773;&#20204;&#23545;&#25237;&#31080;&#32467;&#26524;&#28385;&#24847;&#12290;</p><p>&#25105;&#21644;<a class="ulink" href="http://neodoc.biz/" target="_top">http://neodoc.biz/</a>&#30340;Camille Bégnis&#23454;&#26102;&#20132;&#27969;&#20102;&#19968;&#25972;&#22825;&#30340;&#26102;&#38388;&#12290;&#32463;&#36807;&#20182;&#25552;&#20379;&#19987;&#19994;&#30340;DocBook&#24110;&#21161;&#65292;&#25105;&#20204;&#35299;&#20915;&#20102;&#19968;&#20010;&#38271;&#26399;&#20197;&#26469;&#25105;&#26080;&#27861;&#35299;&#20915;&#30340;&#20070;&#22312;&#32447;&#29256;&#26412;&#30340;&#25216;&#26415;&#38382;&#39064;&#12290;Merci beaucoup, Camille&#12290;</p><p>&#33268;&#35874;&#20013;&#26368;&#38590;&#30340;&#19968;&#37096;&#20998;&#23601;&#26159;&#25105;&#35748;&#35782;&#21040;&#65292;&#20154;&#20204;&#22312;&#36825;&#26412;&#20070;&#31532;&#19968;&#29256;&#36807;&#21518;&#30340;&#21313;&#24180;&#26469;&#65292;&#22823;&#23478;&#20998;&#20139;&#30340;&#30693;&#35782;&#22826;&#22810;&#20102;&#65292;&#25105;&#24590;&#20040;&#26679;&#22312;&#36825;&#37324;&#37117;&#20889;&#19981;&#23436;&#12290;&#33258;&#20174;&#31532;&#19968;&#29256;&#20070;&#20197;&#21518;&#65292;&#25105;&#19968;&#30452;&#22312;&#20570;&#24320;&#28304;&#30340;&#24037;&#20316;&#65292;&#22312;&#19982;&#35768;&#22810;&#23458;&#25143;&#12289;&#21512;&#20316;&#20249;&#20276;&#12289;&#21463;&#35775;&#32773;&#12289;&#19987;&#23478;&#39038;&#38382;&#21644;&#20854;&#20182;&#26053;&#34892;&#32773;&#30340;&#35752;&#35770;&#20013;&#65292;&#25105;&#37117;&#24456;&#26377;&#21551;&#21457;&#12290;&#20182;&#20204;&#20013;&#26377;&#20123;&#20154;&#20598;&#23572;&#20063;&#20250;&#20026;&#20070;&#20013;&#30340;&#20855;&#20307;&#25913;&#36827;&#25552;&#20379;&#24314;&#35758;&#12290;&#22914;&#26524;&#27809;&#26377;&#36825;&#20123;&#38598;&#20307;&#26234;&#24935;&#30340;&#35805;&#65292;&#25105;&#26080;&#27861;&#24819;&#35937;&#36825;&#26412;&#20070;&#30340;&#36136;&#37327;&#20250;&#24590;&#26679;&#65292;&#25152;&#20197;&#25105;&#20250;&#35797;&#30528;&#25226;&#20182;&#20204;&#21015;&#20986;&#26469;&#65292;&#20294;&#26159;&#25105;&#24456;&#25265;&#27465;&#65292;&#22240;&#20026;&#25105;&#30693;&#36947;&#36825;&#21517;&#21333;&#32943;&#23450;&#19981;&#23436;&#25972;&#12290;&#20026;&#20102;&#34920;&#31034;&#25490;&#21517;&#19981;&#20998;&#20808;&#21518;&#65292;&#22312;&#21015;&#20986;&#21517;&#21333;&#21069;&#65292;&#25105;&#29992;&#31243;&#24207;&#25171;&#20081;&#20102;&#39034;&#24207;&#65292;&#24182;&#21462;&#31532;&#19968;&#27425;&#36755;&#20986;&#30340;&#32467;&#26524;&#12290;&#21517;&#21333;&#22914;&#19979;&#65306;</p><p>
  Nithya Ruff, Jenn Brandel, Joseph Lorenzo Hall, Ben Wyss, Kit Plummer, Mark Atwood, Vivien Deparday, Sebastian Benthall, Martin Michlmayr, Derek Eder, Hyrum Wright, Stefano Zacchiroli, Dan Risacher, Stephen Walli, Simon Phipps, Francis Ghesquiere, Sanjay Patil, Tony Sebro, Matt Doar, Deb Nicholson, Jon Phillips, David Robinson, Nathan Toone, Alolita Sharma, Jim McGowan, Florian Effenberger, Brian Warner, Cathy Deng, Allison Randal, Ariel Núñez, Jeremy Allison, Thorsten Behrens, Deb Bryant, Holly St. Clair, Jeff Ubois, Dustin Mitchell, Dan Schultz, Luis Villa, Jon Scott, Dave Neary, Mike Milinkovich, Wolf Peuker, Paul Holland, Keith Casey, Christian Spanring, Bishwa Pandey, Scott Goodwin, Vivek Vaidya, David Eaves, Ed Sokolowski, Chris Aniszczyk, David Hemphill, Emma Jane Hogbin Westby, Ben Sheldon, Guy Martin, Michael Downey, Charles-H. Schulz, Vitorio Miliano, Paul Biondich, Richard Fontana, Philip Olson, Leslie Hawthorn, Harlan Yu, Gerard Braad, Daniel Shahaf, Matthew Turk, Mike Hostetler, Waldo Jaquith, Jeffrey Johnson, Eitan Adler, Mike Linksvayer, Smiljana Antonijevic, Brian Aker, Ben Balter, Conan Reis, Dave Crossland, Nicole Boone, Brandon Keepers, Leigh Honeywell, Tom "spot" Callaway, Andy Dearing, Scott Clark, Tina Coleman, William A Rowe Jr., Matthew McCullough, Stuart Gill, Robert Soden, Chris Tucker, Noel Hidalgo, Mark Galassi, Chris DiBona, Gerhard Poul, Christopher Whitaker, James Tauber, Justin Kestelyn, Nadia Eghbal, Mel Chua, Tony Wasserman, Robert Douglass, Simone Dalmasso, John O'Nolan, Tom Marble, Patrick Masson, Arfon Smith, Forest Gregg, and Molly de Blanc.
</p><p>&#31532;&#20108;&#29256;&#20070;&#25913;&#20889;&#21463;&#21040;&#19968;&#20010;Kickstarter&#39033;&#30446;&#30340;&#36164;&#37329;&#25903;&#25345;&#65292;&#35813;&#39033;&#30446;&#22238;&#24212;&#22320;&#36805;&#36895;&#19988;&#24951;&#24936;&#65292;&#25105;&#38750;&#24120;&#24863;&#35874;&#20182;&#20204;&#25152;&#26377;&#21442;&#19982;&#30340;&#20154;&#12290;&#25105;&#24076;&#26395;&#20182;&#20204;&#20250;&#21407;&#35845;&#25105;&#33457;&#20102;&#22235;&#20493;&#20110;&#39044;&#35745;&#30340;&#26102;&#38388;&#25165;&#23436;&#25104;&#12290;&#20197;&#19979;&#25105;&#35201;&#21521;&#35813;&#39033;&#30446;&#25152;&#26377;&#30340;&#25903;&#25345;&#32773;&#33268;&#35874;&#65292;&#29992;&#30340;&#26159;&#20182;&#20204;&#25552;&#20379;&#32473;Kickstarter&#30340;&#21517;&#23383;&#12290;&#20197;&#19979;&#30340;&#25490;&#24207;&#26159;&#25353;&#29031;&#36190;&#21161;&#25968;&#39069;&#65288;&#20174;&#39640;&#21040;&#20302;&#25110;&#32773;&#20174;&#20302;&#21040;&#39640;&#65289;&#36827;&#34892;&#30340;&#65292;&#20294;&#25105;&#35748;&#20026;&#36825;&#31181;&#20107;&#27604;&#36739;&#36866;&#21512;&#20445;&#25345;&#31070;&#31192;&#21543;&#65292;&#25152;&#20197;&#25105;&#19981;&#25171;&#31639;&#35828;&#26159;&#21738;&#31181;&#25490;&#24207;&#20102;&#12290;&#21517;&#21333;&#22914;&#19979;&#65306;</p><p>
  Pablo, Cameron Colby Thomson, Bethany Sumner, Michael Lefevre, Maxim Novak, Adrian Smith, Jonathan Corwin, Laurie Voss, James Williams, Chris Knadler, Zael, Kieran Mathieson, Teresa Gonczy, Poramate Minsiri, j. faceless user, Michael, Isaac Davis aka Hedron A. Davis, James Dearing, Kyle Simpson, Laura Dragan, Hilary Mason, Tom Smith, Michael Massie, Erin Marchak, Micke Nordin, Xavier Antoviaque, Michael Dudley, Raisa, Paul Booker, Jack Moffitt, Aaron Shaw, maurine stenwick, Ivan Habunek, G. Carter Stokum, Barry Solow, mooware, Harish Pillay, Jim Randall, Holger S., Alan Joseph Williams, Erik Michaels-Ober, David Parker, Nick, Niko Felger, Fred Trotter, Dorai Thodla, William Theaker, Hans Bakker, Brad, Bastien Guerry, Miles Fidelman, Grant Landram, Michael Rogers, mostsignificantbit, Olivier Berger, Fernando Masanori Ashikaga, Naomi Goldenson, Brian Fitzpatrick, Eric Burns, Mark V. Albert, micah altman, Richard Valencia, Cody Bartlett Heisinger, Nick Grossman, cgoldberg, Mike Linksvayer, Simon Phipps, Yoshinari Takaoka, Christian Spanring, Ross M Karchner, Martin Karlsson, Kaia Dekker, Nóirín Plunkett, Emma Jane, Helior Colorado, Fred Benenson, George V. Reilly, Lydia Pintscher, Noel Hidalgo, Albert White, Keng Susumpow, Mattias Wingstedt, Chris Cornutt, Zak Greant, Jessy Kate Schingler, James Duncan Davidson, Chris DiBona, Daniel Latorre, Jeremiah Lee Cohick, Jannis Leidel, Chris Streeter, Leonard Richardson, Terry Suitor, Trevor Bramble, Bertrand Delacretaz, John Sykora, Bill Kendrick, Emmanuel Seyman, Paolo Mottadelli, Gabriel Burt, Adrian Warman, Steve Lee, Andrew Nacin, Chris Ballance, Ben Karel, Lance Pollard, richardj, Brian Land, Jonathan Markow, Kat Walsh, Jason Orendorff, Jim Garrison, Jared Smith, Sander van der Waal, Karen Sandler, Matt Lee, John Morton, Frank Warmerdam, Michael R. Bernstein, John Yuda, Jack Repenning, Jonathan Sick, Naser Sharifi, Cornelius Schumacher, Yao-Ting Wu, Camille Acey, Greg Grossmeier, Zooko Wilcox-O'Hearn, Joe, Anne Gentle, Mark Jaquith, Ted Gould, James Schumann, Falkvinge, Schuyler Erle, Gordon Fyodor Lyon, Tony Meyer, Salvador Torres, Dustin J. Mitchell, Lindy Klein, Dave Stanton, Floyd DCosta, Agog Labs, Adrià Mercader, KIMURA Wataru, Paul Cooper, alexML, Stefan Heinz, maiki, BjornW, Matt Soar, Mick Thompson, mfks, Sebastian Bergmann, Michael Haggerty, Stefan Eggers, Veronica Vergara, Bradley Kuhn, Justin Tallant, dietrich ayala, Nat Torkington, David Jeanmonod, Randy Metcalfe, Daniel Kahn Gillmor, George Chamales, Erik Möller, Tim Schumacher, Koichi Kimura, Vanessa Hurst, Daniel Shahaf, Stefan Sperling, Gunnar Hellekson, Denver Gingerich, Iliana Weller, adam820, Garance Drosehn, Philip Olson, Matt Doar, Brian Jepson, J Aaron Farr, Mike Nosal, Kevin Hall, Eric Sinclair, Alex Rudnick, Jim Brucker, PEI-HAN LEE, Michael Novak, Anthony Ferrara, Dan Scott, Russell Nelson, Frank Wiles, Alex Gaynor, Julian Krause, termie, Joel McGrady, Christian Fletcher Smith, Mel Chua, William Goff, Tom Liesenfeld, Roland Tanglao, Ross Gardler, Gervase Markham, Ingo Renner, Rochelle Lodder, Charles Adler, Dave Hylands, Daryn Nakhuda, Francois Marier, Kendric Evans, Greg Price, Carlos Martín Nieto, Greg Stein, Glen Ivey, Jason Ray, Ben Ubois, Landon Jones, Jason Sperber, Brian Ford, Todd Nienkerk, Keith Casey, Leigh Honeywell, Aaron Jorbin, Christoph Hochstrasser, Miguel Ponce de Leon, Dave Neary, Eric Lawrence, Dirk Haun, Brian Burg, Brandon Kraft, Praveen Sinha, ML Cohen, Christie Koehler, Ethan Jucovy, Lawrence S Kemp, Justin Sheehy, Jonathan Polirer, Ronan Barzic, Greg Dunlap, Darcy Casselman, Jeremy G Kahn, Sam Moffatt, James Vasile, Simon Fondrie-Teitler, Mario Peshev, Alison Foxall, Jim Blandy, Brandon Satrom, Viktor Ekmark, Tor Helmer, Jeff Ubois, Gabriela Rodriguez, James Tait, Michael Parker, Stacy Uden, Peter Martin, Amy Stephen, James Tauber, Cameron Goodale, Jessica, Ben Sheldon, Forest Gregg, Ken McAuliffe, Marta Rybczynska, Sean Taylor, John Genego, Meeuw, Mark MacLennan, Kennis Koldewyn, Igor Gali&#263;, Henrik Dahlström, Jorren Schauwaert, Masahiro Takagi, Ben Collins-Sussman, Decklin Foster, Étienne Savard, Fabio Kon, Ole-Morten Duesund, Michael Downey, Jacob Kaplan-Moss, Nicola Jordan, Ian Sullivan, Roger W Turner, Justin Erenkrantz, Isaac Christoffersen, Deborah Bryant, Christopher Manning, Luis Villa, Judicaël Courant, Leslie Hawthorn, Mark R. Hinkle, Danese Cooper, Michael Tiemann, Robert M. Lefkowitz, Todd Larsen, T Foote, Ben Reser, Dave Camp, Scott Berkun, Garrett Rooney, Dinyar Rabady, Damien Wyart, Seth Schoen, Rob Brackett, Aisha, Winnie Fung, Donald A. Lobo, Dan Robles, Django Software Foundation, Mark Atwood, Krux Digital, Stephen Walli, Dave Crossland, Tina, and Thorsten Behrens.
</p><p>&#20877;&#27425;&#23545;&#20320;&#20204;&#25152;&#26377;&#20154;&#34920;&#31034;&#24863;&#35874;&#65281;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="sources.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="disclaimer.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36164;&#26009;&#26469;&#28304; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20813;&#36131;&#22768;&#26126;</td></tr></table></div></body></html>
