<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#36890;&#21578;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="getting-started.html" title="Chapter 2. &#36215;&#27493;"><link rel="prev" href="setting-tone.html" title="&#35774;&#32622;&#39118;&#26684;"><link rel="next" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#36890;&#21578;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="setting-tone.html">Prev</a> </td><th width="60%" align="center">Chapter 2. &#36215;&#27493;</th><td width="20%" align="right"> <a accesskey="n" href="technical-infrastructure.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#36890;&#21578;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="announcing"></a>&#36890;&#21578;</h2></div></div></div><p>&#19968;&#26086;&#39033;&#30446;&#21487;&#20197;&#23637;&#31034;&#20102;&#8212;&#19981;&#24517;&#23436;&#32654;&#65292;&#21482;&#35201;&#33021;&#30475;&#8212;&#23601;&#21487;&#20197;&#23558;&#20854;&#36890;&#30693;&#32473;&#19990;&#30028;&#20102;&#12290;&#36825;&#26159;&#19968;&#20010;&#38750;&#24120;&#31616;&#21333;&#30340;&#36807;&#31243;&#65306;&#26469;&#21040;<a class="ulink" href="http://freshmeat.net/" target="_top">http://freshmeat.net/</a>&#65292;&#22312;&#39030;&#31471;&#30340;&#23548;&#33322;&#26639;&#28857;<span class="guimenuitem">Submit</span>&#65292;&#28982;&#21518;&#36755;&#20837;&#20320;&#30340;&#26032;&#39033;&#30446;&#30340;&#36890;&#21578;&#12290;Freshmeat&#26159;&#19968;&#20010;&#22823;&#23478;&#20851;&#27880;&#26032;&#39033;&#30446;&#36890;&#21578;&#30340;&#22320;&#26041;&#12290;&#20320;&#21482;&#38656;&#35201;&#22312;&#37027;&#37324;&#29992;&#39033;&#30446;&#26032;&#38395;&#25235;&#20303;&#19968;&#20123;&#30524;&#29699;&#65292;&#23601;&#20250;&#20247;&#21475;&#30456;&#20256;&#12290;</p><p>&#22914;&#26524;&#20320;&#30693;&#36947;&#26576;&#20010;&#37038;&#20214;&#21015;&#34920;&#25110;&#26032;&#38395;&#32452;&#20250;&#23545;&#20320;&#30340;&#39033;&#30446;&#21512;&#39064;&#25110;&#24863;&#20852;&#36259;&#65292;&#37027;&#20040;&#35831;&#22312;&#37027;&#37324;&#36890;&#21578;&#65292;&#20294;&#35831;&#27880;&#24847;&#65292;&#19968;&#20010;&#35770;&#22363;&#21482;&#26377;<span class="emphasis"><em>&#19968;&#20010;</em></span>&#36890;&#21578;&#65292;&#23558;&#20154;&#20204;&#24341;&#21521;&#39033;&#30446;&#26412;&#36523;&#30340;&#35770;&#22363;&#65292;&#36827;&#34892;&#21518;&#32493;&#30340;&#35752;&#35770;&#65288;&#36890;&#36807;&#35774;&#23450;<code class="systemitem">Reply-to</code>&#22836;&#65289;&#12290;&#36825;&#31181;&#21457;&#24067;&#19968;&#23450;&#35201;&#31616;&#30701;&#25212;&#35201;&#65306;</p><pre class="screen">
To: discuss@lists.example.org
Subject: [ANN] Scanley&#20840;&#25991;&#32034;&#24341;&#39033;&#30446;
Reply-to: dev@scanley.org

&#36825;&#26159;&#20851;&#20110;Scanley&#39033;&#30446;&#30340;&#19968;&#27425;&#24615;&#20844;&#21578;&#65292;Scanley&#26159;&#19968;&#20010;&#21253;&#21547;&#20016;&#23500;API&#30340;&#24320;&#28304;&#20840;
&#25991;&#32034;&#24341;&#21644;&#25628;&#32034;&#24341;&#25806;&#65292;&#20027;&#35201;&#20026;&#31243;&#24207;&#21592;&#25552;&#20379;&#23545;&#20110;&#22823;&#32452;&#25991;&#20214;&#30340;&#25628;&#32034;&#26381;&#21153;&#12290;Scanley
&#29616;&#22312;&#26159;&#21487;&#36816;&#34892;&#30340;&#20195;&#30721;&#65292;&#27491;&#22312;&#36827;&#34892;&#27963;&#36291;&#30340;&#24320;&#21457;&#65292;&#24449;&#38598;&#24320;&#21457;&#32773;&#21644;&#27979;&#35797;&#32773;&#12290; 

&#20027;&#39029;: http://www.scanley.org/

&#29305;&#24615;:
   - &#26597;&#25214;&#32431;&#25991;&#26412;&#12289;HTML&#21644;XML
   - &#21333;&#35789;&#21644;&#30701;&#35821;&#26597;&#35810;
   - (&#35745;&#21010;) &#27169;&#31946;&#21305;&#37197;
   - (&#35745;&#21010;) &#22686;&#37327;&#26356;&#26032;&#32034;&#24341;
   - (&#35745;&#21010;) &#32034;&#24341;&#36828;&#31243;&#32593;&#31449;

&#21069;&#25552;&#26465;&#20214;:
   - Python 2.2&#25110;&#26356;&#39640;
   - &#21253;&#21547;&#32034;&#24341;&#30340;&#36275;&#22815;&#31354;&#38388; (&#22823;&#32422;&#21407;&#22987;&#25968;&#25454;&#30340;2&#20493;&#22823;&#23567;)

&#26356;&#22810;&#20449;&#24687;&#65292;&#35831;&#35775;&#38382;scanley.org&#12290;

&#35874;&#35874;&#65292;
-J. Random
</pre><p>&#65288;&#26377;&#20851;&#21518;&#32493;&#21457;&#24067;&#29256;&#26412;&#65292;&#20197;&#21450;&#39033;&#30446;&#20854;&#20182;&#20107;&#20214;&#30340;&#36890;&#21578;&#24314;&#35758;&#65292;&#35831;&#30475;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="publicity.html" title="&#20844;&#24320;&#24615;">the section called &#8220;&#20844;&#24320;&#24615;&#8221;</a>&#12290;&#65289;</p><p>&#23545;&#33258;&#30001;&#36719;&#20214;&#19990;&#30028;&#26159;&#21542;&#24212;&#35813;&#20197;&#19968;&#20010;&#21487;&#25191;&#34892;&#30340;&#20195;&#30721;&#20316;&#20026;&#24320;&#22987;&#65292;&#20197;&#21450;&#22312;&#35774;&#35745;/&#35752;&#35770;&#38454;&#27573;&#23601;&#36827;&#34892;&#20844;&#24320;&#26159;&#21542;&#26377;&#30410;&#36824;&#23384;&#22312;&#30528;&#20105;&#35758;&#12290;&#25105;&#36807;&#21435;&#35748;&#20026;&#20174;&#19968;&#20010;&#21487;&#25191;&#34892;&#30340;&#20195;&#30721;&#24320;&#22987;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#22240;&#32032;&#65292;&#36825;&#26159;&#25104;&#21151;&#39033;&#30446;&#21644;&#29609;&#20855;&#30340;&#37325;&#35201;&#21306;&#21035;&#65292;&#24910;&#37325;&#30340;&#24320;&#21457;&#32773;&#21482;&#20250;&#21152;&#20837;&#26377;&#19968;&#23450;&#20107;&#23454;&#30340;&#36719;&#20214;&#12290;</p><p>&#20294;&#20063;&#26377;&#20363;&#22806;&#12290;&#22312;Subversion&#39033;&#30446;&#65292;&#25105;&#20204;&#20174;&#35774;&#35745;&#25991;&#26723;&#12289;&#19968;&#32452;&#26680;&#24515;&#30340;&#24863;&#20852;&#36259;&#21644;&#32039;&#23494;&#32852;&#31995;&#30340;&#24320;&#21457;&#32773;&#12289;&#35768;&#22810;&#28909;&#38393;&#30340;&#20171;&#32461;&#21644;<span class="emphasis"><em>&#19981;</em></span>&#33021;&#36816;&#34892;&#30340;&#20195;&#30721;&#24320;&#22987;&#12290;&#23436;&#20840;&#20986;&#20046;&#25105;&#30340;&#24847;&#26009;&#65292;&#39033;&#30446;&#20174;&#19968;&#24320;&#22987;&#23601;&#33719;&#24471;&#20102;&#27963;&#36291;&#30340;&#21442;&#19982;&#32773;&#65292;&#24403;&#25105;&#20204;&#21487;&#20197;&#36816;&#34892;&#20160;&#20040;&#26102;&#65292;&#24050;&#32463;&#26377;&#19981;&#23569;&#24535;&#24895;&#24320;&#21457;&#32773;&#24050;&#32463;&#28145;&#20837;&#21442;&#19982;&#36827;&#26469;&#12290;Subversion&#19981;&#26159;&#21807;&#19968;&#30340;&#20363;&#23376;&#65307;Mozilla&#39033;&#30446;&#20063;&#26159;&#20174;&#19981;&#33021;&#36816;&#34892;&#30340;&#20195;&#30721;&#24320;&#22987;&#65292;&#29616;&#22312;&#25104;&#20026;&#20102;&#25104;&#21151;&#21644;&#27969;&#34892;&#30340;web&#27983;&#35272;&#22120;&#12290;</p><p>&#38754;&#23545;&#36825;&#31181;&#35777;&#25454;&#65292;&#25105;&#24517;&#39035;&#22238;&#36807;&#22836;&#26469;&#30475;&#21487;&#36816;&#34892;&#20195;&#30721;&#26159;&#21551;&#21160;&#39033;&#30446;&#24517;&#35201;&#26465;&#20214;&#30340;&#26029;&#35328;&#12290;&#21487;&#36816;&#34892;&#31243;&#24207;&#20173;&#28982;&#26159;&#25104;&#21151;&#30340;&#26368;&#37325;&#35201;&#22522;&#30784;&#65292;&#19968;&#20010;&#22909;&#30340;&#32463;&#39564;&#27861;&#21017;&#26159;&#30452;&#21040;&#21487;&#20197;&#36816;&#34892;&#20877;&#24320;&#22987;&#20844;&#21578;&#39033;&#30446;&#12290;&#28982;&#32780;&#65292;&#26377;&#19968;&#20123;&#29615;&#22659;&#19979;&#65292;&#23613;&#26089;&#36890;&#21578;&#26159;&#26377;&#24847;&#20041;&#30340;&#12290;&#25105;&#24819;&#36825;&#26102;&#36215;&#30721;&#35201;&#26377;&#23436;&#25104;&#33391;&#22909;&#30340;&#35774;&#35745;&#25991;&#26723;&#65292;&#25110;&#20854;&#20182;&#20195;&#30721;&#26694;&#26550;&#8212;&#24403;&#28982;&#65292;&#36825;&#20063;&#35768;&#38656;&#35201;&#26681;&#25454;&#20844;&#20849;&#21453;&#39304;&#35843;&#25972;&#65292;&#20294;&#26159;&#35201;&#26377;&#19968;&#20123;&#23454;&#38469;&#30340;&#19996;&#35199;&#65292;&#27604;&#22909;&#30340;&#24847;&#22270;&#26356;&#30830;&#20999;&#22320;&#19996;&#35199;&#65292;&#35753;&#20154;&#20204;&#21487;&#20197;&#21160;&#21160;&#29273;&#40831;&#12290;</p><p>&#26080;&#35770;&#20320;&#20309;&#26102;&#36890;&#21578;&#65292;&#19981;&#35201;&#25351;&#26395;&#31435;&#21051;&#26377;&#19968;&#22823;&#22534;&#24535;&#24895;&#32773;&#20250;&#21040;&#26469;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36890;&#21578;&#30340;&#32467;&#26524;&#26159;&#24471;&#21040;&#24456;&#23569;&#38543;&#24847;&#30340;&#35810;&#38382;&#65292;&#20197;&#21450;&#19968;&#20123;&#20154;&#21152;&#20837;&#20320;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#38500;&#27492;&#20043;&#22806;&#65292;&#19968;&#20999;&#22914;&#24120;&#12290;&#20294;&#38543;&#30528;&#26102;&#38388;&#30340;&#27969;&#36893;&#65292;&#20320;&#20250;&#36880;&#28176;&#21457;&#29616;&#20195;&#30721;&#36129;&#29486;&#32773;&#21644;&#29992;&#25143;&#21442;&#19982;&#30340;&#22686;&#21152;&#12290;&#36890;&#21578;&#20165;&#20165;&#26159;&#25773;&#19979;&#31181;&#23376;&#12290;&#28040;&#24687;&#30340;&#20256;&#36882;&#38656;&#35201;&#24456;&#38271;&#26102;&#38388;&#12290;&#22914;&#26524;&#39033;&#30446;&#25345;&#32493;&#22238;&#25253;&#21442;&#19982;&#32773;&#65292;&#36825;&#20010;&#26032;&#38395;<span class="emphasis"><em>&#23601;&#20250;</em></span>&#20256;&#25773;&#65292;&#22240;&#20026;&#20154;&#20204;&#21916;&#27426;&#20998;&#20139;&#20182;&#20204;&#25152;&#21457;&#29616;&#30340;&#22909;&#19996;&#35199;&#12290;&#22914;&#26524;&#19968;&#20999;&#37117;&#22909;&#65292;&#25351;&#25968;&#32423;&#20132;&#27969;&#32593;&#32476;&#30340;&#21160;&#21147;&#20250;&#24930;&#24930;&#23558;&#39033;&#30446;&#25913;&#21464;&#20026;&#22797;&#26434;&#30340;&#31038;&#21306;&#65292;&#20320;&#19981;&#24517;&#20877;&#30693;&#36947;&#27599;&#20010;&#20154;&#30340;&#21517;&#23383;&#65292;&#20063;&#19981;&#24517;&#36319;&#36394;&#27599;&#19968;&#27425;&#23545;&#35805;&#12290;&#19979;&#19968;&#31456;&#25105;&#20204;&#23558;&#35752;&#35770;&#22312;&#36825;&#20010;&#29615;&#22659;&#19979;&#22914;&#20309;&#24037;&#20316;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="setting-tone.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="technical-infrastructure.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#35774;&#32622;&#39118;&#26684; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</td></tr></table></div></body></html>
