<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="long-term-developers.html" title="&#38271;&#26399;&#38599;&#20323;"><link rel="next" href="open-motives.html" title="&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="long-term-developers.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="open-motives.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="appear-as-many"></a>&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;</h2></div></div></div><p>&#20320;&#30340;&#24320;&#21457;&#32773;&#24517;&#39035;&#21147;&#27714;&#22312;&#39033;&#30446;&#30340;&#20844;&#20849;&#35770;&#22363;&#20013;&#20197;&#19968;&#20010;&#21333;&#29420;&#30340;&#21442;&#19982;&#32773;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#21333;&#29420;&#30340;&#20844;&#21496;&#12290;&#36825;&#19981;&#26159;&#22240;&#20026;&#20316;&#20026;&#19968;&#20010;&#20844;&#21496;&#20986;&#29616;&#26412;&#36523;&#22266;&#26377;&#30340;&#19968;&#20123;&#36127;&#38754;&#21547;&#20041;&#65288;&#22909;&#30340;&#65292;&#25110;&#35768;&#26377;&#19968;&#20123;&#65292;&#20294;&#37027;&#19981;&#26159;&#26412;&#20070;&#25152;&#35752;&#35770;&#30340;&#65289;&#12290;&#32780;&#26159;&#22240;&#20026;&#24320;&#28304;&#39033;&#30446;&#30340;&#32467;&#26500;&#37197;&#22791;&#21482;&#33021;&#22788;&#29702;&#20010;&#20154;&#23454;&#20307;&#12290;&#19968;&#20010;&#21333;&#29420;&#30340;&#36129;&#29486;&#32773;&#21487;&#20197;&#35752;&#35770;&#12289;&#25552;&#20132;&#34917;&#19969;&#12289;&#33719;&#21462;&#20449;&#35465;&#12289;&#34920;&#20915;&#31561;&#31561;&#12290;&#32780;&#19968;&#20010;&#20844;&#21496;&#19981;&#33021;&#12290;</p><p>&#27492;&#22806;&#65292;&#22240;&#20026;&#20998;&#24067;&#24335;&#30340;&#34892;&#20026;&#26041;&#24335;&#65292;&#20320;&#36991;&#20813;&#20102;&#23545;&#20110;&#21050;&#28608;&#24615;&#20013;&#22830;&#38598;&#26435;&#30340;&#25932;&#23545;&#12290;&#35753;&#20320;&#30340;&#24320;&#21457;&#32773;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#24847;&#35265;&#24182;&#19981;&#19968;&#33268;&#12290;&#40723;&#21169;&#20182;&#20204;&#32463;&#24120;&#35780;&#23457;&#20182;&#20154;&#30340;&#20195;&#30721;&#65292;&#23613;&#21487;&#33021;&#30340;&#20844;&#24320;&#65292;&#23601;&#35937;&#20182;&#20204;&#26159;&#20219;&#20309;&#20854;&#20182;&#30340;&#20154;&#12290;&#38459;&#27490;&#20182;&#20204;&#35937;&#19968;&#20010;&#38598;&#22242;&#19968;&#26679;&#34920;&#20915;&#65292;&#22240;&#20026;&#22914;&#26524;&#20320;&#36825;&#26679;&#20570;&#65292;&#20854;&#20182;&#20154;&#23601;&#20250;&#24863;&#35273;&#21040;&#65292;&#26681;&#25454;&#19968;&#33324;&#30340;&#21407;&#29702;&#65292;&#19968;&#23450;&#26377;&#19968;&#20010;&#26377;&#32452;&#32455;&#30340;&#21147;&#37327;&#22312;&#25511;&#21046;&#20182;&#20204;&#12290;</p><p>&#23454;&#38469;&#30340;&#38750;&#20013;&#22830;&#38598;&#26435;&#21644;&#20551;&#35013;&#30340;&#26159;&#26377;&#21306;&#21035;&#30340;&#12290;&#22312;&#29305;&#23450;&#29615;&#22659;&#19979;&#65292;&#35753;&#20320;&#30340;&#24320;&#21457;&#32773;&#21327;&#21516;&#19968;&#33268;&#20250;&#38750;&#24120;&#26377;&#29992;&#65292;&#32780;&#19988;&#22914;&#26524;&#24517;&#35201;&#36824;&#24517;&#39035;&#22312;&#24149;&#21518;&#36827;&#34892;&#21327;&#35843;&#12290;&#20363;&#22914;&#65292;&#24403;&#21457;&#20986;&#25552;&#35758;&#26102;&#65292;&#35753;&#35768;&#22810;&#20154;&#23613;&#26089;&#36339;&#20986;&#26469;&#34920;&#31034;&#35748;&#21487;&#65292;&#24471;&#20986;&#27491;&#22312;&#36798;&#25104;&#20849;&#35782;&#30340;&#21360;&#35937;&#20250;&#26377;&#21161;&#20110;&#25552;&#35758;&#30340;&#36827;&#23637;&#12290;&#20854;&#20182;&#20154;&#20250;&#24863;&#21040;&#25552;&#35758;&#30340;&#21160;&#37327;&#65292;&#22914;&#26524;&#20182;&#20204;&#21453;&#23545;&#65292;&#20182;&#20204;&#38656;&#35201;&#38459;&#27490;&#36825;&#20010;&#21160;&#37327;&#12290;&#22240;&#27492;&#65292;&#20154;&#20204;&#21482;&#20250;&#22312;&#26377;&#22909;&#30340;&#21407;&#22240;&#26102;&#25165;&#20250;&#25552;&#20986;&#21453;&#23545;&#12290;&#22914;&#26524;&#33021;&#22815;&#24910;&#37325;&#23545;&#24453;&#21453;&#23545;&#24847;&#35265;&#65292;&#36825;&#26679;&#30340;&#31934;&#24515;&#23433;&#25490;&#20063;&#27809;&#26377;&#38169;&#12290;&#31169;&#19979;&#21327;&#35758;&#30340;&#20844;&#20247;&#34920;&#29616;&#19981;&#20250;&#22240;&#20026;&#32463;&#36807;&#39044;&#20808;&#30340;&#21327;&#35843;&#32780;&#21464;&#24471;&#19981;&#22815;&#35802;&#23454;&#65292;&#21482;&#35201;&#20182;&#20204;&#27809;&#26377;&#29992;&#36825;&#20010;&#26041;&#27861;&#26469;&#25212;&#26432;&#21453;&#23545;&#24847;&#35265;&#23601;&#19981;&#20250;&#26377;&#22826;&#22810;&#23475;&#22788;&#12290;&#20182;&#20204;&#30340;&#30446;&#30340;&#20165;&#20165;&#26159;&#38459;&#27490;&#37027;&#20123;&#21916;&#27426;&#20445;&#25345;&#20010;&#24615;&#30340;&#20154;&#25552;&#20986;&#21453;&#23545;&#24847;&#35265;&#65307;&#26356;&#22810;&#30456;&#20851;&#20869;&#23481;&#21487;&#20197;&#30475;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="common-pitfalls.html#bikeshed" title="&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;">the section called &#8220;&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;&#8221;</a>&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="long-term-developers.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="open-motives.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#38271;&#26399;&#38599;&#20323; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20844;&#24320;&#20320;&#30340;&#21160;&#26426;</td></tr></table></div></body></html>
