<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="bug-trackers.html" title="Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;"><link rel="next" href="bug-reporting.html" title="Appendix D. &#25253;&#21578;bug&#30340;&#26679;&#20363;&#25351;&#23548;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-trackers.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bug-reporting.html">Next</a></td></tr></table><hr></div><div class="appendix" title="Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;"><div class="titlepage"><div><div><h2 class="title"><a name="bikeshed-full"></a>Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>&#20320;&#19981;&#24212;&#24403;&#65307;&#36825;&#24182;&#27809;&#26377;&#20160;&#20040;&#24847;&#20041;&#65292;&#20320;&#26377;&#26356;&#22810;&#20540;&#24471;&#33457;&#26102;&#38388;&#30340;&#20107;&#24773;&#12290;</p><p>Poul-Henning Kamp&#33879;&#21517;&#30340;&#8220;&#36710;&#26842;&#8221;&#35770;&#36848;&#65288;&#36825;&#20010;<a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;&#33410;&#36873;&#65289;&#26159;&#19968;&#20221;&#20851;&#20110;&#39033;&#30446;&#35752;&#35770;&#23481;&#26131;&#38519;&#20837;&#35823;&#21306;&#30340;&#38596;&#36777;&#35770;&#25991;&#12290;&#32463;&#36807;&#20801;&#35768;&#22312;&#36825;&#37324;&#37325;&#26032;&#25171;&#21360;&#65292;&#21407;&#22987;&#30340;&#22320;&#22336;&#26159;<a class="ulink" href="http://www.freebsd.org/cgi/getmsg.cgi?fetch=506636+517178+/usr/local/www/db/text/1999/freebsd-hackers/19991003.freebsd-hackers" target="_top">http://www.freebsd.org/cgi/getmsg.cgi?fetch=506636+517178+/usr/local/www/db/text/1999/freebsd-hackers/19991003.freebsd-hackers</a>&#12290;</p><pre class="screen">
Subject: &#26356;&#32511;&#30340;&#33609;&#22378;&#19978;&#30340;&#36710;&#26842;&#65288;&#20219;&#20309;&#39068;&#33394;&#37117;&#21487;&#20197;&#65289;...
&#21457;&#33258;: Poul-Henning Kamp &lt;phk@freebsd.org&gt;
&#26085;&#26399;: 1999&#24180;10&#26376;2&#26085; &#26143;&#26399;&#20845; 16:14:10 +0200
Message-ID: &lt;18238.938873650@critter.freebsd.dk&gt;
&#21457;&#36865;&#20154;: phk@critter.freebsd.dk
&#25220;&#36865;: Blind Distribution List: ;
MIME-Version: 1.0


[&#26263;&#36865;&#21040;committers, hackers]

&#25105;&#30340;&#19978;&#19968;&#20221;&#23567;&#20876;&#23376;&#24050;&#32463;&#25509;&#25910;&#30340;&#24046;&#19981;&#22810;&#20102;&#65292;&#25105;&#19981;&#22826;&#38656;&#35201;&#20877;&#21457;&#36865;&#19968;&#20221;&#65292;&#20170;&#22825;&#25105;
&#26377;&#26102;&#38388;&#24895;&#24847;&#36825;&#26679;&#20570;&#12290;

&#25105;&#23545;&#27492;&#31867;&#20107;&#21153;&#30340;&#27491;&#30830;&#20915;&#23450;&#26377;&#19968;&#20123;&#22256;&#38590;&#65292;&#36825;&#19968;&#27425;&#26159;&#23494;&#36865;committers&#21644;hackers&#65292;
&#36825;&#26159;&#25105;&#33021;&#20570;&#30340;&#26368;&#22909;&#30340;&#20107;&#24773;&#20102;&#65292;&#25105;&#19981;&#22826;&#20250;&#35746;&#38405;hackers&#65292;&#20294;&#26159;&#20043;&#21518;&#25105;&#35746;&#38405;&#30340;&#26356;
&#22810;&#20102;&#12290;

&#36825;&#27425;&#35302;&#21457;&#25105;&#30340;&#20107;&#24773;&#26159;&#8220;sleep(1)&#24212;&#24403;&#26377;&#23567;&#25968;&#37096;&#20998;&#8221;&#30340;&#35752;&#35770;&#65292;&#36825;&#24050;&#32463;&#22256;&#25200;&#25105;&#20204;&#24456;&#38271;
&#26102;&#38388;&#20102;&#65292;&#24050;&#32463;&#36807;&#20102;&#22909;&#20960;&#21608;&#20102;&#65292;&#25105;&#29978;&#33267;&#25042;&#24471;&#21435;&#26816;&#26597;&#12290;

&#22914;&#26524;&#20320;&#38169;&#36807;&#20102;&#36825;&#20010;&#35752;&#35770;&#65306;&#37027;&#23601;&#22826;&#24685;&#21916;&#20102;&#12290;

&#26377;&#20154;&#35748;&#20026;&#22914;&#26524;&#32473;sleep(1)&#19968;&#20010;&#38750;&#25972;&#24418;&#30340;&#21442;&#25968;&#20250;&#35753;&#36825;&#20010;&#20989;&#25968;&#24456;&#33039;&#65292;&#36825;&#28857;&#29123;&#20102;
&#19995;&#26519;&#23665;&#28779;&#12290;&#38500;&#27492;&#20197;&#22806;&#25105;&#19981;&#20250;&#20877;&#22810;&#35828;&#65292;&#22240;&#20026;&#19982;&#20182;&#30340;&#35752;&#35770;&#38271;&#24230;&#30456;&#27604;&#65292;&#36825;&#30830;&#23454;
&#26159;&#19968;&#20214;&#22826;&#23567;&#30340;&#20107;&#24773;&#65292;&#20110;&#27492;&#21516;&#26102;&#25105;&#20204;&#36824;&#26377;&#35768;&#22810;&#30495;&#27491;&#30340;&#38382;&#39064;&#12290;

sleep(1)&#30340;&#20256;&#22855;&#26159;&#25105;&#20204;&#22312;FreddBSD&#20013;&#33258;&#34892;&#36710;&#26842;&#35752;&#35770;&#30340;&#26368;&#21557;&#38393;&#26696;&#20363;&#12290;&#36825;&#20123;
&#24314;&#35758;&#24050;&#32463;&#32463;&#36807;&#20805;&#20998;&#24605;&#32771;&#65292;&#25105;&#20204;&#33021;&#22815;&#33719;&#24471;&#19982;OpenBSD&#21644;NetBSD&#65292;&#20197;&#21450;&#25152;&#26377;&#24050;&#32463;
&#32534;&#20889;&#20195;&#30721;&#30340;&#20860;&#23481;&#24615;&#12290;

&#28982;&#32780;&#20986;&#29616;&#21644;&#21551;&#21160;&#20102;&#36825;&#26679;&#22810;&#30340;&#21453;&#23545;&#12289;&#24314;&#35758;&#21644;&#21464;&#26356;&#65292;&#25105;&#20204;&#21482;&#22909;&#20197;&#20026;&#36825;&#20123;&#21464;&#26356;
&#20250;&#25226;&#29790;&#22763;&#22902;&#37226;&#30340;&#31354;&#37117;&#25554;&#28385;&#65292;&#25110;&#32773;&#26159;&#25913;&#21464;&#21487;&#21475;&#21487;&#20048;&#30340;&#21475;&#21619;&#31561;&#31561;&#31561;&#31561;&#12290;

&#8220;&#20851;&#20110;&#33258;&#34892;&#36710;&#26842;&#26159;&#20160;&#20040;&#65311;&#8221;&#20320;&#20204;&#20013;&#30340;&#26576;&#20123;&#20154;&#38382;&#36807;&#25105;&#12290;

&#36825;&#26159;&#19968;&#20010;&#24456;&#38271;&#24456;&#38271;&#30340;&#25925;&#20107;&#65292;&#25110;&#32773;&#35828;&#19968;&#20010;&#24456;&#32769;&#30340;&#25925;&#20107;&#65292;&#20294;&#23454;&#38469;&#19978;&#20063;&#24456;&#30701;&#65292;&#21483;&#20570;
&#8220;&#24085;&#37329;&#26862;&#23450;&#24459;&#8221;&#65292;&#21253;&#21547;&#20102;&#31649;&#29702;&#21160;&#24577;&#24615;&#30340;&#28145;&#20837;&#35265;&#22320;&#12290;

&#20320;&#21487;&#20197;&#22312;&#20122;&#39532;&#36874;&#25214;&#21040;&#65292;&#20063;&#21487;&#33021;&#22312;&#29240;&#29240;&#30340;&#20070;&#26550;&#19978;&#25214;&#21040;&#65292;&#23427;&#29289;&#36229;&#25152;&#20540;&#65292;&#20063;&#20540;&#24471;&#33457;
&#26102;&#38388;&#21435;&#35835;&#65292;&#22914;&#26524;&#20320;&#21916;&#27426;&#21574;&#20271;&#29305;&#65292;&#37027;&#19968;&#23450;&#20250;&#21916;&#27426;&#24085;&#37329;&#26862;&#12290;

&#26377;&#20123;&#20154;&#26368;&#36817;&#21578;&#35785;&#25105;&#38405;&#35835;&#20043;&#21518;&#21457;&#29616;&#21482;&#26377;50%&#21487;&#20197;&#24212;&#29992;&#21040;&#29616;&#22914;&#20170;&#65292;&#25105;&#21482;&#33021;&#35828;&#30495;&#30340;
&#22815;&#22909;&#20102;&#65292;&#22823;&#22810;&#25968;&#29616;&#20195;&#31649;&#29702;&#20070;&#31821;&#30340;&#21629;&#20013;&#29575;&#36828;&#20302;&#20110;&#27492;&#65292;&#35201;&#30693;&#36947;&#36825;&#26412;&#20070;&#24050;&#32463;&#36229;&#36807;35
&#24180;&#20102;&#12290;

&#19982;&#33258;&#34892;&#36710;&#26842;&#30456;&#20851;&#30340;&#29305;&#23450;&#20363;&#23376;&#20013;&#65292;&#21478;&#19968;&#20010;&#33267;&#20851;&#37325;&#35201;&#30340;&#37096;&#20998;&#26159;&#26680;&#30005;&#31449;&#65292;&#25105;&#29468;&#36825;&#36879;
&#28431;&#20102;&#20070;&#30340;&#24180;&#40836;&#12290;

&#24085;&#37329;&#26862;&#23637;&#31034;&#20102;&#22914;&#20309;&#36827;&#20837;&#20027;&#31649;&#22996;&#21592;&#20250;&#24182;&#33719;&#24471;&#24314;&#36896;&#20215;&#20540;&#20960;&#30334;&#19975;&#29978;&#33267;&#20960;&#21313;&#20159;&#32654;&#20803;&#30340;
&#26680;&#30005;&#31449;&#65292;&#20294;&#26159;&#24403;&#20320;&#24076;&#26395;&#24314;&#36896;&#33258;&#34892;&#36710;&#26842;&#26102;&#65292;&#21364;&#20250;&#38519;&#20837;&#26080;&#23613;&#30340;&#35752;&#35770;&#20013;&#12290;

&#24085;&#37329;&#26862;&#35299;&#37322;&#20102;&#36825;&#26159;&#22240;&#20026;&#26680;&#30005;&#31449;&#26159;&#36825;&#26679;&#24040;&#22823;&#65292;&#36825;&#26679;&#26114;&#36149;&#65292;&#36825;&#26679;&#22797;&#26434;&#65292;&#27809;&#26377;&#20154;&#33021;
&#22815;&#25484;&#25569;&#65292;&#29978;&#33267;&#21482;&#26159;&#23581;&#35797;&#65292;&#20182;&#20204;&#21482;&#26159;&#20551;&#35774;&#26576;&#20010;&#20854;&#20182;&#20154;&#24050;&#32463;&#26816;&#26597;&#20102;&#25152;&#26377;&#32454;&#33410;&#12290;
Richard P. Feynmann&#22312;&#20182;&#30340;&#20070;&#20013;&#32473;&#20102;&#35768;&#22810;&#20851;&#20110;&#27931;&#26031;&#38463;&#25289;&#33707;&#26031;&#65288;&#32654;&#22269;&#21407;&#23376;&#24377;&#29983;
&#20135;&#20013;&#24515;&#65289;&#30340;&#26377;&#36259;&#32780;&#19988;&#21040;&#20301;&#30340;&#26696;&#20363;&#12290;

&#21478;&#19968;&#26041;&#38754;&#26159;&#33258;&#34892;&#36710;&#26842;&#12290;&#20219;&#20309;&#20154;&#21487;&#20197;&#22312;&#21608;&#26411;&#24314;&#19968;&#20010;&#65292;&#36824;&#33021;&#21097;&#19979;&#26102;&#38388;&#30475;&#30005;&#35270;&#27604;&#36187;&#12290;
&#25152;&#20197;&#26080;&#35770;&#22914;&#20309;&#20934;&#22791;&#65292;&#26080;&#35770;&#20320;&#30340;&#24314;&#35758;&#22914;&#20309;&#30340;&#21512;&#29702;&#65292;&#24635;&#20250;&#26377;&#20154;&#23637;&#31034;&#33258;&#24049;&#30340;&#23384;&#22312;&#65292;
&#20182;&#23601;&#22312;&#36825;&#37324;&#12290;

&#22312;&#20025;&#40614;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;&#30041;&#19979;&#25351;&#32441;&#8221;&#12290;&#23427;&#26159;&#20851;&#20110;&#20010;&#20154;&#39556;&#20658;&#21644;&#22768;&#26395;&#65292;&#20851;&#20110;&#33021;&#22815;&#25351;&#21521;
&#26576;&#20010;&#26041;&#21521;&#65292;&#28982;&#21518;&#35828;&#8220;&#22312;&#36825;&#37324;&#65292;&#25105;&#20570;&#30340;&#12290;&#8221;&#36825;&#26159;&#25919;&#27835;&#23478;&#30340;&#19968;&#20010;&#24378;&#28872;&#29305;&#33394;&#65292;&#20294;&#26159;&#22914;
&#26524;&#26377;&#26426;&#20250;&#65292;&#22823;&#22810;&#25968;&#20154;&#20250;&#35797;&#35797;&#12290;&#24819;&#24819;&#25105;&#20204;&#22312;&#28287;&#27700;&#27877;&#19978;&#30041;&#19979;&#30340;&#36275;&#36857;&#21543;&#12290;

&#25105;&#21482;&#33021;&#20302;&#22836;&#21521;&#26368;&#21021;&#30340;&#24314;&#35758;&#32773;&#34920;&#31034;&#25964;&#24847;&#65292;&#22240;&#20026;&#20182;&#23558;&#26538;&#21475;&#20174;&#22320;&#27631;&#22788;&#36716;&#21521;&#20102;&#21095;&#22330;&#30340;
&#26368;&#39640;&#21518;&#24231;&#65292;&#32780;&#19988;&#36825;&#20010;&#25913;&#21464;&#23601;&#22312;&#25105;&#20204;&#29616;&#22312;&#30340;&#35752;&#35770;&#26641;&#20013;&#12290;&#25105;&#20250;&#25240;&#36820;&#22238;&#21435;&#65292;&#26469;&#21040;&#35813;
&#32447;&#32034;&#20013;&#19981;&#22826;&#39034;&#25163;&#30340;&#28040;&#24687;&#20013;&#12290;


&#32780;&#36825;&#20123;&#21578;&#35785;&#25105;&#65292;&#23601;&#20687;&#25105;&#20043;&#21069;&#35768;&#35834;&#30340;&#65292;&#25105;&#20026;&#20160;&#20040;&#19981;&#35746;&#38405;hackers&#65306;


&#20960;&#24180;&#20043;&#21069;&#25105;&#23601;&#21462;&#28040;&#35746;&#38405;&#20102;hackers&#65292;&#22240;&#20026;&#25105;&#26080;&#27861;&#25215;&#21463;&#32039;&#36319;&#37038;&#20214;&#30340;&#21387;&#21147;&#12290;&#21516;&#26679;&#30340;&#21407;
&#22240;&#65292;&#25105;&#20063;&#21462;&#28040;&#20102;&#20854;&#20182;&#19968;&#20123;&#21015;&#34920;&#12290;


&#20294;&#25105;&#36824;&#26159;&#25910;&#21040;&#24456;&#22810;&#37038;&#20214;&#12290;&#35768;&#22810;&#30452;&#25509;&#30001;&#36807;&#28388;&#22120;&#36716;&#21521;&#21040;/dev/null&#65306;&#20154;&#20204;&#21916;&#27426;[&#36951;&#28431;&#30340;]
&#27704;&#36828;&#19981;&#20250;&#26469;&#21040;&#25105;&#30340;&#23631;&#24149;&#65292;&#20363;&#22914;&#29992;&#25105;&#19981;&#29702;&#35299;&#30340;&#35821;&#35328;&#25552;&#20132;&#21040;&#25991;&#26723;&#65292;&#20197;&#21450;&#25552;&#20132;&#21040;ports&#12290;
&#25152;&#26377;&#30340;&#20107;&#24773;&#37117;&#22312;&#27809;&#26377;&#25105;&#30340;&#26102;&#20505;&#21457;&#29983;&#65292;&#29978;&#33267;&#25105;&#37117;&#19981;&#30693;&#36947;&#12290;


&#34429;&#28982;&#25105;&#30340;&#37038;&#31665;&#26377;&#36825;&#20123;&#23574;&#21033;&#30340;&#29273;&#40831;&#65292;&#25105;&#36824;&#26159;&#24471;&#21040;&#22826;&#22810;&#37038;&#20214;&#12290;

&#36825;&#26159;&#26356;&#32511;&#30340;&#33609;&#19995;&#36827;&#20837;&#35270;&#37326;&#30340;&#22320;&#26041;&#65306;

&#25105;&#24076;&#26395;&#33021;&#22815;&#20943;&#23569;&#25105;&#20204;&#21015;&#34920;&#20013;&#22122;&#38899;&#30340;&#37327;&#65292;&#25105;&#24076;&#26395;&#21487;&#20197;&#35753;&#27599;&#20154;&#32463;&#24120;&#24314;&#36896;&#19968;&#20010;&#36710;&#26842;&#65292;
&#25105;&#30495;&#30340;&#23545;&#20182;&#20204;&#21943;&#20160;&#20040;&#39068;&#33394;&#24182;&#19981;&#20851;&#24515;&#12290;


&#31532;&#19968;&#20010;&#24895;&#26395;&#26159;&#20851;&#20110;&#20844;&#27665;&#30340;&#65292;&#25935;&#24863;&#21644;&#26234;&#33021;&#30340;&#20351;&#29992;&#25105;&#20204;&#30340;&#37038;&#20214;&#12290;

&#22914;&#26524;&#25105;&#21487;&#20197;&#31616;&#26126;&#31934;&#30830;&#30340;&#23450;&#20041;&#19968;&#32452;&#26631;&#20934;&#65292;&#35268;&#23450;&#20309;&#26102;&#26576;&#20154;&#21487;&#20197;&#22238;&#22797;&#65292;&#20309;&#26102;&#19981;&#21487;&#20197;
&#22238;&#22797;&#37038;&#20214;&#65292;&#36825;&#26679;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#35748;&#21487;&#21644;&#36981;&#23432;&#23427;&#65292;&#25105;&#20250;&#25104;&#20026;&#19968;&#20010;&#24555;&#20048;&#30340;&#20154;&#65292;&#20294;&#25105;
&#26159;&#22826;&#26126;&#26234;&#20102;&#65292;&#29978;&#33267;&#19981;&#20250;&#21435;&#23581;&#35797;&#12290;

&#20294;&#26159;&#20808;&#35753;&#25105;&#24314;&#35758;&#19968;&#20123;&#25105;&#24076;&#26395;&#37038;&#20214;&#31243;&#24207;&#21487;&#20197;&#22312;&#20154;&#20204;&#21457;&#36865;&#25110;&#22238;&#22797;&#37038;&#20214;&#21015;&#34920;&#26102;&#33021;&#22815;
&#25552;&#20379;&#30340;&#24377;&#20986;&#31383;&#21475;&#65306;

      +------------------------------------------------------------+
      | &#24744;&#30340;&#37038;&#20214;&#20250;&#21457;&#36865;&#32473;&#25104;&#30334;&#19978;&#21315;&#30340;&#20154;&#65292;&#20182;&#20204;&#38656;&#35201;&#33457;&#36153;10&#31186;&#38047;&#26469;&#38405;&#35835;&#25165;&#33021; |
      | &#20915;&#23450;&#26159;&#21542;&#26377;&#20852;&#36259;&#65292;&#38405;&#35835;&#24744;&#30340;&#37038;&#20214;&#33267;&#23569;&#20250;&#33457;&#36153;&#20004;&#20010;&#20154;&#21608;&#20250;&#12290;&#35768;&#22810;&#25509;&#25910; |
      | &#32773;&#20250;&#38656;&#35201;&#20026;&#19979;&#36733;&#37038;&#20214;&#32780;&#20135;&#29983;&#33457;&#36153;&#12290;                                 |
      |                                                            |
      | &#24744;&#26159;&#21542;&#32477;&#23545;&#30830;&#23450;&#35813;&#37038;&#20214;&#30340;&#37325;&#35201;&#31243;&#24230;&#20540;&#24471;&#25171;&#25200;&#25152;&#26377;&#20854;&#20182;&#20154;&#65311;         |
      |                                                            |
      |                                                            |
      |                  [&#26159;]  [&#20462;&#35746;]  [&#21462;&#28040;]                      |
      +------------------------------------------------------------+

     
      +------------------------------------------------------------+
      | &#35686;&#21578;&#65306;&#24744;&#36824;&#27809;&#26377;&#38405;&#35835;&#35752;&#35770;&#20013;&#30340;&#25152;&#26377;&#37038;&#20214;&#65292;&#20854;&#20182;&#20154;&#24050;&#32463;&#35828;&#20102;&#24744;&#22312;&#22238;&#22797; |
      | &#20013;&#25152;&#35828;&#30340;&#20869;&#23481;&#12290;&#22312;&#22238;&#22797;&#20219;&#20309;&#37038;&#20214;&#26102;&#65292;&#35831;&#38405;&#35835;&#25972;&#20010;&#35752;&#35770;&#12290;           |
      |                                                            |
      |                                                            |
      |                      [&#21462;&#28040;]                              |
      +------------------------------------------------------------+
      
    
      +------------------------------------------------------------+
      | &#35686;&#21578;&#65306;&#24744;&#30340;&#37038;&#20214;&#31243;&#24207;&#26410;&#33021;&#20026;&#24744;&#23637;&#31034;&#25152;&#26377;&#30340;&#20449;&#24687;&#12290;&#36923;&#36753;&#19978;&#35762;&#24744;&#19981;&#21487;&#33021; |
      | &#38405;&#35835;&#20102;&#25972;&#20010;&#37038;&#20214;&#65292;&#24182;&#19988;&#29702;&#35299;&#20102;&#20854;&#20869;&#23481;&#12290;                         |
      |                                                            |
      | &#22312;&#27809;&#26377;&#20840;&#37096;&#38405;&#35835;&#21644;&#35748;&#30495;&#24605;&#32771;&#21069;&#23601;&#21457;&#36865;&#37038;&#20214;&#26159;&#19981;&#31036;&#35980;&#30340;&#12290;           |
      |                                                            |
      | &#19968;&#20010;&#38477;&#28201;&#23450;&#26102;&#22120;&#20250;&#22312;&#19968;&#20010;&#23567;&#26102;&#20869;&#38450;&#27490;&#24744;&#22238;&#22797;&#35813;&#32447;&#32034;               |
      |                                                            |
      |                       [&#21462;&#28040;]                               |
      +------------------------------------------------------------+

      
      +------------------------------------------------------------+
      | &#24744;&#32534;&#20889;&#36825;&#20010;&#37038;&#20214;&#36229;&#36807;&#20102;N.NN&#23383;&#31526;/&#31186;&#65292;&#19981;&#22826;&#21487;&#33021;&#20197;&#36229;&#36807;A.AA&#23383;&#31526;/&#31186; |
      | &#30340;&#36895;&#24230;&#24605;&#32771;&#21644;&#36755;&#20837;&#65292;&#22240;&#32780;&#24744;&#30340;&#22238;&#22797;&#21487;&#33021;&#19981;&#22815;&#36830;&#36143;&#65292;&#24605;&#32771;&#19981;&#20805;&#20998;&#19988;&#36807; |
      | &#20110;&#24863;&#24773;&#21270;&#12290;                                                 |
      |                                                            |
      | &#19968;&#20010;&#38477;&#28201;&#23450;&#26102;&#22120;&#20250;&#22312;&#19968;&#20010;&#23567;&#26102;&#20869;&#38450;&#27490;&#24744;&#21457;&#36865;&#20219;&#20309;&#37038;&#20214;&#12290;           |
      |                                                            |
      |                       [&#21462;&#28040;]                               |
      +------------------------------------------------------------+
      

&#25105;&#30340;&#24895;&#26395;&#30340;&#31532;&#20108;&#37096;&#20998;&#26356;&#21152;&#24863;&#24773;&#21270;&#12290;&#24456;&#26126;&#26174;&#65292;&#22312;sleep(1)&#32447;&#32034;&#20013;&#25105;&#20204;&#21487;&#20197;&#25805;&#32437;&#30340;
&#19981;&#21451;&#22909;&#28779;&#28976;&#65292;&#23613;&#31649;&#24050;&#32463;&#22312;&#39033;&#30446;&#20013;&#23384;&#22312;&#22810;&#24180;&#65292;&#20174;&#26469;&#27809;&#26377;&#23545;&#20854;&#26377;&#36275;&#22815;&#30340;&#20851;&#24515;&#65292;&#25152;&#20197;
&#20026;&#20160;&#20040;&#26377;&#36825;&#20040;&#22810;&#20154;&#34987;&#35768;&#22810;&#24180;&#36731;&#20154;&#28608;&#24594;&#65311;

&#25105;&#24076;&#26395;&#25105;&#30693;&#36947;&#12290;

&#25105;&#30693;&#36947;&#25512;&#29702;&#23545;&#20572;&#27490;&#36825;&#31181;&#8220;&#20445;&#23432;&#20027;&#20041;&#8221;&#26080;&#33021;&#20026;&#21147;&#12290;&#21487;&#33021;&#26159;&#22240;&#20026;&#36825;&#20123;&#20154;&#23545;&#20110;&#20043;&#21518;&#25552;&#20379;
&#26377;&#24418;&#36129;&#29486;&#30340;&#32570;&#20047;&#65292;&#20134;&#25110;&#26159;&#36825;&#20123;&#20154;&#35748;&#20026;&#8220;&#25105;&#20204;&#24180;&#32769;&#36824;&#21476;&#24618;&#65292;&#25105;&#20204;&#30693;&#36947;&#24180;&#36731;&#20154;&#30340;&#25152;&#20316;
&#25152;&#20026;&#8221;&#12290;


&#20219;&#20309;&#19968;&#31181;&#26041;&#24335;&#23545;&#20110;&#39033;&#30446;&#37117;&#26159;&#20302;&#29983;&#20135;&#29575;&#30340;&#65292;&#20294;&#25105;&#23545;&#22914;&#20309;&#20572;&#27490;&#23427;&#27809;&#26377;&#20219;&#20309;&#21150;&#27861;&#12290;
&#25105;&#21482;&#33021;&#24314;&#35758;&#24525;&#20303;&#19981;&#35201;&#32473;&#28508;&#20239;&#22312;&#37038;&#20214;&#21015;&#34920;&#30340;&#24618;&#20861;&#28155;&#27833;&#21152;&#37259;&#65306;&#30452;&#25509;&#24573;&#30053;&#20182;&#20204;&#65292;&#19981;&#35201;
&#22238;&#31572;&#65292;&#24536;&#35760;&#20182;&#20204;&#30340;&#23384;&#22312;&#12290;

&#25105;&#24076;&#26395;&#25105;&#20204;&#21487;&#20197;&#22312;FreeBSD&#24471;&#21040;&#19968;&#20010;&#24378;&#22823;&#19988;&#24191;&#27867;&#30340;&#24535;&#24895;&#32773;&#22522;&#30784;&#65292;&#32780;&#19988;&#24076;&#26395;&#25105;&#20204;
&#33021;&#22815;&#22242;&#32467;&#36215;&#26469;&#36890;&#36807;&#21534;&#22124;&#12289;&#20998;&#21270;&#21644;&#39537;&#25955;&#21476;&#24618;&#30340;&#32769;&#23478;&#20249;&#21644;[&#28431;&#25481;&#30340;]&#65292;&#38450;&#33539;&#20182;&#20204;&#26377;
&#20219;&#20309;&#31435;&#36275;&#20043;&#22320;&#12290;

&#23545;&#20110;&#24050;&#32463;&#28508;&#34255;&#19979;&#26469;&#65292;&#30001;&#20110;&#21442;&#19982;&#36825;&#20123;&#24618;&#20154;&#32780;&#39537;&#25955;&#30340;&#20154;&#65306;&#25105;&#21482;&#33021;&#35828;&#19981;&#22909;&#24847;&#24605;&#65292;&#24182;
&#40723;&#21169;&#24744;&#26080;&#35770;&#22914;&#20309;&#32487;&#32493;&#23581;&#35797;&#65292;&#25105;&#19981;&#24076;&#26395;&#29615;&#22659;&#25104;&#20026;&#36825;&#26679;&#12290;

Poul-Henning

</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-trackers.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bug-reporting.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Appendix D. &#25253;&#21578;bug&#30340;&#26679;&#20363;&#25351;&#23548;</td></tr></table></div></body></html>
