<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Bug&#36319;&#36394;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="prev" href="vc.html" title="&#29256;&#26412;&#25511;&#21046;"><link rel="next" href="irc.html" title="IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Bug&#36319;&#36394;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="vc.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th><td width="20%" align="right"> <a accesskey="n" href="irc.html">Next</a></td></tr></table><hr></div><div class="sect1" title="Bug&#36319;&#36394;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="bug-tracker"></a>Bug&#36319;&#36394;</h2></div></div></div><p>Bug&#36319;&#36394;&#26159;&#19968;&#20010;&#23485;&#27867;&#30340;&#35805;&#39064;&#65307;&#36143;&#31359;&#26412;&#20070;&#20250;&#35752;&#35770;&#27492;&#38382;&#39064;&#30340;&#21508;&#20010;&#26041;&#38754;&#12290;&#23613;&#31649;&#36825;&#37324;&#25105;&#20204;&#35201;&#30528;&#37325;&#20110;&#37197;&#32622;&#21644;&#25216;&#26415;&#22240;&#32032;&#65292;&#20294;&#26159;&#39318;&#20808;&#35201;&#20174;&#19968;&#20010;&#31574;&#30053;&#38382;&#39064;&#24320;&#22987;&#65306;Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#24212;&#35813;&#21253;&#21547;&#21738;&#20123;&#20449;&#24687;&#65311;</p><p>&#26415;&#35821;<em class="firstterm">Bug&#36319;&#36394;</em>&#24456;&#26377;&#35823;&#23548;&#24615;&#12290;Bug&#36319;&#36394;&#31995;&#32479;&#20063;&#36890;&#24120;&#20250;&#29992;&#26469;&#36319;&#36394;&#21738;&#20123;&#21021;&#22987;&#19982;&#32467;&#26463;&#29366;&#24577;&#19981;&#21516;&#65292;&#21253;&#21547;&#21487;&#36873;&#30340;&#20013;&#38388;&#29366;&#24577;&#65292;&#24182;&#22312;&#29983;&#21629;&#21608;&#26399;&#20013;&#31215;&#32047;&#20449;&#24687;&#30340;&#38382;&#39064;&#65292;&#20363;&#22914;&#26032;&#29305;&#24615;&#35831;&#27714;&#12289;&#19968;&#27425;&#24615;&#20219;&#21153;&#20197;&#21450;&#34987;&#21160;&#24615;&#30340;&#34917;&#19969;&#12290;&#30001;&#20110;&#36825;&#20123;&#21407;&#22240;&#65292;Bug&#36319;&#36394;&#20063;&#34987;&#31216;&#20026;<em class="firstterm">&#38382;&#39064;&#36319;&#36394;&#65288;issue
trackers&#65289;</em>&#12289;<em class="firstterm">&#32570;&#38519;&#36319;&#36394;&#65288;defect 
trackers&#65289;</em>&#12289;<em class="firstterm">&#21046;&#21697;&#36319;&#36394;&#65288;artifact trackers&#65289;</em>&#12289;<em class="firstterm">&#35831;&#27714;&#36319;&#36394;&#65288;request
trackers&#65289;</em>&#20197;&#21450;<em class="firstterm">&#38382;&#39064;&#31080;&#36319;&#36394;&#65288;trouble ticket systems&#65289;</em>&#12290;<a class="xref" href="bug-trackers.html" title="Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;">Appendix B, <i>&#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;</i></a>&#21253;&#21547;&#20102;&#19968;&#20010;&#27492;&#31867;&#36719;&#20214;&#30340;&#21015;&#34920;&#12290;
</p><p>&#22312;&#26412;&#20070;&#20013;&#65292;&#25105;&#20250;&#32487;&#32493;&#20351;&#29992;&#8220;Bug&#36319;&#36394;&#65288;bug tracker&#65289;&#8221;&#36825;&#20010;&#21517;&#31216;&#65292;&#22240;&#20026;&#22823;&#22810;&#25968;&#20154;&#36825;&#26679;&#31216;&#21628;&#65292;&#20294;&#25105;&#20250;&#20351;&#29992;<em class="firstterm">&#38382;&#39064;&#65288;issue&#65289;</em>&#26469;&#31216;&#21628;Bug&#36319;&#36394;&#25968;&#25454;&#24211;&#20013;&#30340;&#21333;&#20010;&#26465;&#30446;&#12290;&#36825;&#35753;&#25105;&#20204;&#21487;&#20197;&#25226;&#29992;&#25143;&#36935;&#21040;&#30340;&#65288;Bug&#26412;&#36523;&#65289;&#27491;&#24120;&#25110;&#19981;&#33391;&#34892;&#20026;&#19982;&#36319;&#36394;&#31995;&#32479;&#20013;Bug&#30340;&#21457;&#29616;&#12289;&#35786;&#26029;&#21644;&#26368;&#32456;&#35299;&#20915;&#30340;<span class="emphasis"><em>&#35760;&#24405;</em></span>&#21306;&#20998;&#24320;&#26469;&#12290;&#35831;&#29282;&#35760;&#65292;&#23613;&#31649;&#22823;&#22810;&#25968;&#38382;&#39064;&#19982;&#23454;&#38469;&#30340;Bug&#30456;&#20851;&#65292;&#25105;&#20204;&#20063;&#21487;&#20197;&#29992;&#20854;&#26469;&#36319;&#36394;&#20854;&#23427;&#31867;&#22411;&#30340;&#20219;&#21153;&#12290;</p><p>&#20856;&#22411;&#30340;&#38382;&#39064;&#29983;&#21629;&#21608;&#26399;&#22914;&#19979;&#65306;

</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#26576;&#20154;&#21457;&#36215;&#20102;&#19968;&#20010;&#38382;&#39064;&#12290;&#20182;&#25552;&#20379;&#20102;&#25688;&#35201;&#65292;&#21021;&#22987;&#25551;&#36848;&#65288;&#22914;&#26524;&#21512;&#36866;&#21017;&#21253;&#21547;&#37325;&#29616;&#26041;&#27861;&#65307;&#22914;&#20309;&#28608;&#21169;&#22909;&#30340;Bug&#25253;&#21578;&#35831;&#30475;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="managing-volunteers.html#users-to-volunteers" title="&#23558;&#27599;&#20010;&#29992;&#25143;&#24403;&#20316;&#28508;&#22312;&#30340;&#24535;&#24895;&#32773;">the section called &#8220;&#23558;&#27599;&#20010;&#29992;&#25143;&#24403;&#20316;&#28508;&#22312;&#30340;&#24535;&#24895;&#32773;&#8221;</a>&#65289;&#65292;&#20197;&#21450;&#20854;&#23427;&#36319;&#36394;&#31995;&#32479;&#35201;&#27714;&#30340;&#20449;&#24687;&#12290;&#39033;&#30446;&#21487;&#33021;&#23545;&#21457;&#36215;&#20154;&#19968;&#26080;&#25152;&#30693;&#8212;Bug&#25253;&#21578;&#21644;&#29305;&#24615;&#35831;&#27714;&#26082;&#21487;&#33021;&#26469;&#33258;&#29992;&#25143;&#31038;&#21306;&#65292;&#20063;&#21487;&#33021;&#26469;&#33258;&#24320;&#21457;&#32773;&#12290;</p><p>&#19968;&#26086;&#21457;&#36215;&#65292;&#36825;&#20010;&#38382;&#39064;&#23601;&#36827;&#20837;&#20102;<em class="firstterm">&#25171;&#24320;&#65288;open&#65289;</em>&#29366;&#24577;&#12290;&#22240;&#20026;&#36824;&#27809;&#26377;&#20316;&#20986;&#20219;&#20309;&#34892;&#21160;&#65292;&#19968;&#20123;&#36319;&#36394;&#31995;&#32479;&#20063;&#23558;&#20854;&#26631;&#31034;&#20026;<em class="firstterm">&#26410;&#39564;&#35777;&#65288;unverified&#65289;</em>&#25110;<em class="firstterm">&#26410;&#24320;&#22987;&#65288;unstarted&#65289;</em>&#12290;&#23427;&#36824;&#27809;&#26377;&#20998;&#37197;&#32473;&#20219;&#20309;&#20154;&#65307;&#25110;&#32773;&#22312;&#26576;&#20123;&#31995;&#32479;&#20013;&#23558;&#36215;&#20998;&#37197;&#32473;&#19968;&#20010;&#20882;&#29260;&#29992;&#25143;&#26469;&#34920;&#31034;&#20854;&#36824;&#27809;&#26377;&#30495;&#27491;&#30340;&#20998;&#37197;&#12290;&#27492;&#21051;&#65292;&#23427;&#23384;&#22312;&#20110;&#19968;&#20010;&#20445;&#30041;&#21306;&#65306;&#36825;&#20010;&#38382;&#39064;&#24050;&#32463;&#35760;&#24405;&#65292;&#20294;&#26159;&#36824;&#27809;&#26377;&#25104;&#20026;&#39033;&#30446;&#20851;&#27880;&#30340;&#19968;&#37096;&#20998;&#12290;</p></li><li class="listitem"><p>&#20854;&#20182;&#20154;&#35835;&#21040;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#20570;&#20986;&#22238;&#22797;&#65292;&#25110;&#35768;&#20250;&#20877;&#21521;&#21457;&#36215;&#32773;&#35810;&#38382;&#26469;&#28548;&#28165;&#19968;&#20123;&#38382;&#39064;&#12290;</p></li><li class="listitem"><p>Bug&#24471;&#21040;<em class="firstterm">&#37325;&#29616;&#65288;reproduced&#65289;</em>&#12290;&#36825;&#21487;&#33021;&#26159;&#20854;&#29983;&#21629;&#21608;&#26399;&#20013;&#26368;&#37325;&#35201;&#30340;&#19968;&#20010;&#26102;&#21051;&#12290;&#23613;&#31649;bug&#36824;&#27809;&#26377;&#20462;&#27491;&#65292;&#20294;&#21457;&#36215;&#32773;&#20043;&#22806;&#30340;&#20154;&#37325;&#29616;&#36825;&#20010;&#20107;&#23454;&#21487;&#20197;&#35777;&#26126;&#36825;&#20010;bug&#30340;&#30495;&#23454;&#24615;&#65292;&#27492;&#22806;&#65292;&#21487;&#20197;&#30830;&#35748;&#21407;&#21457;&#36215;&#32773;&#36890;&#36807;&#25253;&#21578;&#30495;&#23454;&#30340;bug&#20026;&#39033;&#30446;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;</p></li><li class="listitem"><p>Bug&#24471;&#21040;<em class="firstterm">&#35786;&#26029;&#65288;diagnosed&#65289;</em>&#65306;&#23427;&#30340;&#21407;&#22240;&#24471;&#21040;&#30830;&#35748;&#65292;&#22914;&#26524;&#21487;&#33021;&#65292;&#20250;&#23545;&#20462;&#27491;&#36825;&#20010;bug&#25152;&#38656;&#30340;&#24037;&#20316;&#37327;&#20570;&#20986;&#35780;&#20272;&#12290;&#35831;&#30830;&#35748;&#36825;&#20123;&#20869;&#23481;&#20250;&#22312;&#38382;&#39064;&#20013;&#24471;&#21040;&#35760;&#24405;&#65307;&#22914;&#26524;&#35786;&#26029;&#20154;&#35201;&#31163;&#24320;&#39033;&#30446;&#19968;&#20250;&#20799;&#65288;&#23545;&#20110;&#24535;&#24895;&#24320;&#21457;&#32773;&#36825;&#24456;&#26222;&#36941;&#65289;&#65292;&#20854;&#20182;&#20154;&#24212;&#35813;&#33021;&#22815;&#25509;&#25163;&#12290;</p><p>&#22312;&#26412;&#38454;&#27573;&#65292;&#25110;&#32773;&#21069;&#19968;&#20010;&#38454;&#27573;&#65292;&#24320;&#21457;&#32773;&#21487;&#20197;&#8220;&#33719;&#21462;&#8221;&#38382;&#39064;&#25152;&#26377;&#26435;&#24182;&#23558;&#20854;<em class="firstterm">&#20998;&#37197;&#65288;assign&#65289;</em>&#32473;&#33258;&#24049;&#65288;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="managing-volunteers.html#delegation-assignment" title="&#26126;&#30830;&#21306;&#20998;&#35843;&#26597;&#21644;&#25351;&#27966;">the section called &#8220;&#26126;&#30830;&#21306;&#20998;&#35843;&#26597;&#21644;&#25351;&#27966;&#8221;</a>&#35814;&#32454;&#25551;&#36848;&#20102;&#20998;&#37197;&#36807;&#31243;&#30340;&#32454;&#33410;&#65289;&#12290;&#38382;&#39064;<em class="firstterm">&#20248;&#20808;&#32423;&#65288;priority&#65289;</em>&#20063;&#21487;&#20197;&#22312;&#26412;&#38454;&#27573;&#35774;&#32622;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#26576;&#20010;&#38382;&#39064;&#20005;&#37325;&#21040;&#36275;&#20197;&#24433;&#21709;&#19979;&#19968;&#20010;&#29256;&#26412;&#30340;&#21450;&#26102;&#21457;&#24067;&#65292;&#21017;&#38656;&#35201;&#23613;&#26089;&#26631;&#31034;&#20986;&#26469;&#65292;&#36319;&#36394;&#31995;&#32479;&#24517;&#39035;&#33021;&#22815;&#20351;&#20854;&#31361;&#20986;&#26174;&#31034;&#12290;</p></li><li class="listitem"><p>&#38382;&#39064;&#32435;&#20837;&#35299;&#20915;&#30340;&#26085;&#31243;&#65288;schedule&#65289;&#12290;&#32435;&#20837;&#26085;&#31243;&#24182;&#19981;&#26159;&#24847;&#21619;&#30528;&#35268;&#23450;&#19968;&#20010;&#35299;&#20915;&#30340;&#26085;&#26399;&#12290;&#26377;&#26102;&#20505;&#21482;&#26159;&#20915;&#23450;&#26410;&#26469;&#30340;&#37027;&#20010;&#29256;&#26412;&#65288;&#19979;&#19968;&#20010;&#29256;&#26412;&#19981;&#26159;&#24517;&#39035;&#30340;&#65289;&#24517;&#39035;&#35299;&#20915;&#36825;&#20010;bug&#65292;&#25110;&#32773;&#36825;&#20010;bug&#23558;&#20250;&#38459;&#30861;&#21738;&#20123;&#29305;&#23450;&#29256;&#26412;&#12290;&#22914;&#26524;&#24456;&#23481;&#26131;&#20462;&#27491;&#65292;&#20063;&#21487;&#20197;&#21462;&#28040;&#32435;&#20837;&#26085;&#31243;&#36825;&#19968;&#27493;&#12290;</p></li><li class="listitem"><p>Bug&#24471;&#21040;&#20462;&#27491;&#65288;&#20219;&#21153;&#23436;&#25104;&#12289;&#25110;&#24212;&#29992;&#20102;&#34917;&#19969;&#12289;&#25110;&#32773;&#20854;&#20182;&#31867;&#20284;&#30340;&#20107;&#24773;&#65289;&#12290;&#21464;&#26356;&#25110;&#32773;&#21464;&#26356;&#38598;&#24517;&#39035;&#35760;&#24405;&#22312;&#38382;&#39064;&#30340;&#22238;&#22797;&#20013;&#65292;&#20854;&#21518;&#26159;&#38382;&#39064;&#34987;&#26631;&#27880;&#20026;<em class="firstterm">&#35299;&#20915;&#65288;resolved&#65289;</em>&#32780;&#24471;&#21040;<em class="firstterm">&#20851;&#38381;&#65288;closed&#65289;</em>&#12290;</p></li></ol></div><p>

</p><p>&#36825;&#20010;&#29983;&#21629;&#21608;&#26399;&#26377;&#35768;&#22810;&#21464;&#31181;&#12290;&#26377;&#26102;&#20505;&#19968;&#20010;&#38382;&#39064;&#20877;&#21457;&#36215;&#20043;&#21518;&#24456;&#24555;&#23601;&#20250;&#20851;&#38381;&#65292;&#20363;&#22914;&#21457;&#29616;&#23427;&#19981;&#26159;&#19968;&#20010;bug&#65292;&#32780;&#21482;&#26159;&#37096;&#20998;&#29992;&#25143;&#30340;&#35823;&#35299;&#12290;&#38543;&#30528;&#39033;&#30446;&#33719;&#24471;&#20102;&#36234;&#26469;&#36234;&#22810;&#30340;&#29992;&#25143;&#65292;&#23601;&#20250;&#24102;&#26469;&#26356;&#22810;&#26080;&#25928;&#30340;&#38382;&#39064;&#65292;&#24320;&#21457;&#32773;&#20250;&#29992;&#26085;&#30410;&#32570;&#20047;&#32784;&#24515;&#30340;&#22238;&#24212;&#26469;&#20851;&#38381;&#36825;&#20123;&#38382;&#39064;&#12290;&#35201;&#23581;&#35797;&#39044;&#38450;&#36825;&#21518;&#19968;&#31181;&#36235;&#21183;&#12290;&#36825;&#23545;&#35841;&#37117;&#27809;&#26377;&#22909;&#22788;&#65292;&#27599;&#20010;&#26696;&#20363;&#20013;&#30340;&#27599;&#20010;&#21333;&#29420;&#29992;&#25143;&#23545;&#20110;&#27492;&#21069;&#30340;&#26080;&#25928;&#38382;&#39064;&#27809;&#26377;&#20219;&#20309;&#36131;&#20219;&#65307;&#32479;&#35745;&#23398;&#30340;&#36235;&#21183;&#21482;&#26159;&#20174;&#24320;&#21457;&#32773;&#32780;&#19981;&#26159;&#29992;&#25143;&#30340;&#35270;&#28857;&#26377;&#25928;&#12290; &#65288;<span>&#22312;&#26412;&#31456;&#21518;&#30340;</span><a class="xref" href="bug-tracker.html#bug-filtering" title="Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;">the section called &#8220;Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;&#8221;</a>&#23558;&#20250;&#30475;&#21040;&#20943;&#23569;&#36825;&#31181;&#26080;&#25928;&#38382;&#39064;&#30340;&#25216;&#24039;&#12290;&#65289;&#21478;&#22806;&#65292;&#22914;&#26524;&#19981;&#21516;&#30340;&#29992;&#25143;&#21453;&#22797;&#32463;&#21382;&#21516;&#26679;&#30340;&#35823;&#35299;&#65292;&#36825;&#25110;&#35768;&#24847;&#21619;&#30528;&#36719;&#20214;&#30340;&#26576;&#26041;&#38754;&#38656;&#35201;&#37325;&#26032;&#35774;&#35745;&#12290;&#22914;&#26524;&#26377;&#19968;&#20010;&#38382;&#39064;&#32463;&#29702;&#30417;&#35270;&#30528;bug&#25968;&#25454;&#24211;&#65292;&#23601;&#20250;&#24456;&#23481;&#26131;&#21457;&#29616;&#36825;&#31181;&#27169;&#24335;&#65307;&#35265;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="share-management.html#issue-manager" title="&#38382;&#39064;&#31649;&#29702;&#21592;">the section called &#8220;&#38382;&#39064;&#31649;&#29702;&#21592;&#8221;</a>&#12290;</p><p>&#29983;&#21629;&#21608;&#26399;&#30340;&#21478;&#19968;&#31181;&#24120;&#35265;&#21464;&#31181;&#26159;&#38382;&#39064;&#22312;&#27493;&#39588;1&#20043;&#21518;&#30452;&#25509;&#20197;<em class="firstterm">&#37325;&#22797;&#65288;duplicate&#65289;</em>&#29366;&#24577;&#20851;&#38381;&#65292;&#37325;&#22797;&#26159;&#26576;&#20154;&#21457;&#36215;&#20102;&#19968;&#20010;&#39033;&#30446;&#24050;&#30693;&#30340;&#38382;&#39064;&#12290;&#37325;&#22797;&#19981;&#20165;&#38480;&#20110;&#24320;&#25918;&#30340;&#38382;&#39064;&#65306;&#23427;&#20063;&#21487;&#33021;&#26469;&#33258;&#24050;&#32463;&#20462;&#27491;&#30340;bug&#37325;&#29616;&#65288;&#36825;&#20010;&#31216;&#20026;<em class="firstterm">&#34928;&#36864;&#65288;regression&#65289;</em>&#65289;&#65292;&#26080;&#35770;&#20309;&#31181;&#24773;&#20917;&#26368;&#20339;&#30340;&#35299;&#20915;&#26041;&#24335;&#26159;&#37325;&#26032;&#25171;&#24320;&#26368;&#21021;&#30340;&#38382;&#39064;&#65292;&#24182;&#23558;&#26032;&#30340;&#25253;&#21578;&#22797;&#21046;&#21040;&#26368;&#21021;&#30340;&#38382;&#39064;&#20013;&#12290;Bug&#36319;&#36394;&#31995;&#32479;&#24212;&#24403;&#33021;&#22815;&#21452;&#21521;&#20445;&#25345;&#32852;&#31995;&#65292;&#36825;&#26679;&#37325;&#22797;&#30340;&#37325;&#29616;&#20449;&#24687;&#20013;&#23601;&#21487;&#20197;&#22312;&#21407;&#38382;&#39064;&#20013;&#30475;&#21040;&#65292;&#21453;&#20043;&#20134;&#28982;&#12290;</p><p>&#24320;&#21457;&#32773;&#20851;&#38381;&#36825;&#20010;&#38382;&#39064;&#30340;&#31532;&#19977;&#31181;&#24773;&#20917;&#26159;&#20182;&#20204;&#35748;&#20026;&#24050;&#32463;&#20462;&#27491;&#20102;&#38382;&#39064;&#65292;&#21482;&#26159;&#35753;&#21407;&#25253;&#21578;&#32773;&#25298;&#32477;&#36825;&#20010;&#20462;&#27491;&#24182;&#37325;&#26032;&#25171;&#24320;&#23427;&#12290;&#36825;&#36890;&#24120;&#20165;&#20165;&#26159;&#22240;&#20026;&#24320;&#21457;&#32773;&#19981;&#33021;&#35775;&#38382;&#37325;&#29616;bug&#30340;&#29615;&#22659;&#65292;&#25110;&#32773;&#22240;&#20026;&#20182;&#20204;&#19981;&#33021;&#36890;&#36807;&#25253;&#21578;&#32773;&#30340;&#20877;&#29616;&#25551;&#36848;&#27979;&#35797;&#36825;&#20010;&#20462;&#27491;&#12290;</p><p>&#38500;&#20102;&#36825;&#20123;&#24773;&#20917;&#65292;&#19981;&#21516;&#30340;&#36319;&#36394;&#36719;&#20214;&#20063;&#26377;&#19968;&#20123;&#20854;&#23427;&#23567;&#30340;&#29983;&#21629;&#21608;&#26399;&#32454;&#33410;&#12290;&#20294;&#22522;&#26412;&#30340;&#29983;&#21629;&#21608;&#26399;&#26159;&#30456;&#21516;&#30340;&#65292;&#29983;&#21629;&#21608;&#26399;&#26412;&#36523;&#24182;&#19981;&#29305;&#23450;&#20110;&#24320;&#28304;&#36719;&#20214;&#65292;&#21482;&#26159;&#26263;&#31034;&#20102;&#24320;&#28304;&#39033;&#30446;&#22914;&#20309;&#20351;&#29992;&#20182;&#20204;&#30340;bug&#36319;&#36394;&#31995;&#32479;&#12290;</p><p>&#23601;&#20687;&#27493;&#39588;1&#26263;&#31034;&#30340;&#65292;&#36319;&#36394;&#31995;&#32479;&#21644;&#37038;&#20214;&#21015;&#34920;&#25110;&#32593;&#39029;&#19968;&#26679;&#65292;&#26159;&#39033;&#30446;&#30340;&#38376;&#38754;&#12290;&#20219;&#20309;&#20154;&#21487;&#20197;&#21457;&#36215;&#19968;&#20010;&#38382;&#39064;&#65292;&#20219;&#20309;&#20154;&#21487;&#20197;&#27983;&#35272;&#24403;&#21069;&#25171;&#24320;&#30340;&#38382;&#39064;&#21015;&#34920;&#12290;&#30001;&#27492;&#25105;&#20204;&#20063;&#33021;&#25512;&#26029;&#25105;&#20204;&#26080;&#27861;&#30693;&#36947;&#26377;&#22810;&#23569;&#20154;&#22312;&#31561;&#24453;&#32473;&#23450;&#38382;&#39064;&#30340;&#36827;&#23637;&#12290;&#32780;&#24320;&#21457;&#31038;&#21306;&#30340;&#35268;&#27169;&#21644;&#25216;&#24039;&#38480;&#21046;&#20102;&#38382;&#39064;&#35299;&#20915;&#30340;&#36895;&#29575;&#65292;&#39033;&#30446;&#33267;&#23569;&#24212;&#35813;&#30693;&#36947;&#27599;&#20010;&#20986;&#29616;&#30340;&#38382;&#39064;&#12290;&#21363;&#20351;&#38382;&#39064;&#20250;&#32531;&#24930;&#23567;&#26102;&#65292;&#19968;&#20010;&#22238;&#22797;&#20063;&#20250;&#40723;&#21169;&#25253;&#21578;&#32773;&#20445;&#25345;&#21442;&#19982;&#65292;&#22240;&#20026;&#22905;&#33021;&#24863;&#35273;&#21040;&#26377;&#20154;&#24050;&#32463;&#20026;&#20854;&#25152;&#20316;&#30340;&#20107;&#24773;&#30331;&#35760;&#65288;&#35831;&#29282;&#35760;&#22635;&#20889;&#19968;&#20221;&#38382;&#39064;&#36828;&#27604;&#21457;&#19968;&#23553;&#37038;&#20214;&#26356;&#40635;&#28902;&#65289;&#12290;&#27492;&#22806;&#65292;&#19968;&#26086;&#24320;&#21457;&#32773;&#30475;&#21040;&#19968;&#20010;&#38382;&#39064;&#65292;&#23427;&#23601;&#36827;&#20837;&#20102;&#39033;&#30446;&#30340;&#24847;&#35782;&#20013;&#65292;&#20063;&#23601;&#26159;&#24320;&#21457;&#32773;&#20250;&#26597;&#30475;&#27492;&#38382;&#39064;&#30340;&#31867;&#20284;&#24773;&#20917;&#65292;&#25110;&#32773;&#20250;&#19982;&#20854;&#20182;&#24320;&#21457;&#32773;&#35752;&#35770;&#65292;&#31561;&#31561;&#12290;</p><p>&#21450;&#26102;&#21453;&#24212;&#30340;&#38656;&#27714;&#24847;&#21619;&#30528;&#20004;&#20214;&#20107;&#65306;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#36319;&#36394;&#31995;&#32479;&#24517;&#39035;&#33021;&#22815;&#36830;&#25509;&#21040;&#37038;&#20214;&#21015;&#34920;&#65292;&#36825;&#26679;&#38382;&#39064;&#30340;&#27599;&#20010;&#21464;&#26356;&#65292;&#21253;&#25324;&#21021;&#22987;&#30340;&#22635;&#20889;&#65292;&#37117;&#20250;&#23548;&#33268;&#25551;&#36848;&#21457;&#29983;&#24773;&#20917;&#30340;&#37038;&#20214;&#12290;&#36825;&#20123;&#37038;&#20214;&#21015;&#34920;&#36890;&#24120;&#19982;&#27491;&#35268;&#30340;&#24320;&#21457;&#21015;&#34920;&#19981;&#21516;&#65292;&#22240;&#20026;&#19981;&#26159;&#25152;&#26377;&#30340;&#24320;&#21457;&#32773;&#20250;&#24076;&#26395;&#25509;&#25910;&#33258;&#21160;bug&#37038;&#20214;&#65292;&#20294;&#26159;&#65288;&#23601;&#20687;&#25552;&#20132;&#37038;&#20214;&#65289;Reply-to&#22836;&#24212;&#35813;&#35774;&#32622;&#20026;&#24320;&#21457;&#37038;&#20214;&#21015;&#34920;&#12290;</p></li><li class="listitem"><p>&#22635;&#20889;&#38382;&#39064;&#30340;&#34920;&#21333;&#19968;&#23450;&#33021;&#22815;&#25429;&#25417;&#24320;&#21457;&#32773;&#30340;&#37038;&#20214;&#22320;&#22336;&#65292;&#36825;&#26679;&#22905;&#21487;&#20197;&#32852;&#31995;&#21040;&#26356;&#22810;&#20449;&#24687;&#12290; &#65288;&#28982;&#32780;&#65292;&#23427;&#19981;&#24212;&#24403;<span class="emphasis"><em>&#35201;&#27714;</em></span>&#36755;&#20837;&#25253;&#21578;&#32773;&#30340;&#37038;&#20214;&#22320;&#22336;&#65292;&#22240;&#20026;&#19968;&#20123;&#20154;&#21916;&#27426;&#21311;&#21517;&#25253;&#21578;&#38382;&#39064;&#12290;&#21311;&#21517;&#35775;&#38382;&#30340;&#37325;&#35201;&#24615;&#21487;&#20197;&#30475;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="web-site.html#anonymity" title="&#21311;&#21517;&#21644;&#21442;&#19982;">the section called &#8220;&#21311;&#21517;&#21644;&#21442;&#19982;&#8221;</a>&#12290;&#65289;</p></li></ul></div><p>

</p><div class="sect2" title="&#19982;&#37038;&#20214;&#21015;&#34920;&#20132;&#20114;"><div class="titlepage"><div><div><h3 class="title"><a name="bug-tracker-mailing-list-interaction"></a>&#19982;&#37038;&#20214;&#21015;&#34920;&#20132;&#20114;</h3></div></div></div><p>&#35831;&#30830;&#20445;bug&#36319;&#36394;&#31995;&#32479;&#19981;&#20250;&#25104;&#20026;&#35752;&#35770;&#35770;&#22363;&#12290;&#23613;&#31649;&#35753;&#20154;&#21442;&#19982;bug&#36319;&#36394;&#24456;&#37325;&#35201;&#65292;&#20294;&#20174;&#26681;&#26412;&#19978;&#23427;&#19981;&#36866;&#21512;&#23454;&#26102;&#35752;&#35770;&#12290;&#26356;&#24212;&#35813;&#23558;&#20854;&#24403;&#20316;&#24402;&#26723;&#65292;&#32452;&#32455;&#35777;&#25454;&#21644;&#20854;&#20182;&#35752;&#35770;&#65288;&#36890;&#24120;&#21457;&#29983;&#22312;&#37038;&#20214;&#21015;&#34920;&#65289;&#30340;&#24341;&#29992;&#12290;</p><p>&#20570;&#20986;&#36825;&#31181;&#21306;&#21035;&#26377;&#20004;&#20010;&#21407;&#22240;&#12290;&#39318;&#20808;&#65292;Bug&#36319;&#36394;&#31995;&#32479;&#30340;&#20351;&#29992;&#27604;&#37038;&#20214;&#21015;&#34920;&#65288;&#25110;&#32773;&#23454;&#26102;&#35752;&#35770;&#35770;&#22363;&#65289;&#26356;&#21152;&#31528;&#25305;&#12290;&#36825;&#19981;&#26159;&#22240;&#20026;bug&#36319;&#36394;&#31995;&#32479;&#37117;&#27809;&#26377;&#22909;&#30340;&#29992;&#25143;&#30028;&#38754;&#35774;&#35745;&#65292;&#32780;&#26159;&#22240;&#20026;&#23427;&#20204;&#30340;&#30028;&#38754;&#35774;&#35745;&#29992;&#26469;&#25429;&#25417;&#21644;&#23637;&#31034;&#20998;&#31163;&#30340;&#29366;&#24577;&#65292;&#32780;&#19981;&#26159;&#33258;&#30001;&#27969;&#21160;&#30340;&#35752;&#35770;&#12290;&#31532;&#20108;&#65292;&#19981;&#26159;&#27599;&#20010;&#21442;&#19982;&#21040;&#29305;&#23450;&#38382;&#39064;&#35752;&#35770;&#30340;&#20154;&#37117;&#24517;&#39035;&#27880;&#24847;bug&#36319;&#36394;&#31995;&#32479;&#12290;&#20248;&#33391;&#30340;&#38382;&#39064;&#31649;&#29702;&#65288;&#35265;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="share-management.html" title="&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;">the section called &#8220;&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;&#8221;</a>&#65289;&#26159;&#35753;&#27599;&#20010;&#38382;&#39064;&#34987;&#24688;&#24403;&#30340;&#20154;&#27880;&#24847;&#21040;&#65292;&#32780;&#19981;&#26159;&#35753;&#25152;&#26377;&#30340;&#24320;&#21457;&#32773;&#30417;&#35270;&#25152;&#26377;&#30340;&#38382;&#39064;&#12290;&#22312;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="bug-tracker-usage.html" title="Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;">the section called &#8220;Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;&#8221;</a>&#65292;&#25105;&#20204;&#20250;&#20851;&#27880;&#30830;&#20445;&#20154;&#20204;&#19981;&#20250;&#33073;&#31163;&#21512;&#36866;&#30340;&#35770;&#22363;&#32780;&#38519;&#20837;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#20869;&#35752;&#35770;&#30340;&#38382;&#39064;&#12290;</p><p>&#26377;&#19968;&#20123;bug&#36319;&#36394;&#31995;&#32479;&#21487;&#20197;&#30417;&#25511;&#37038;&#20214;&#21015;&#34920;&#24182;&#33258;&#21160;&#35760;&#24405;&#20851;&#20110;&#24050;&#30693;&#38382;&#39064;&#30340;&#37038;&#20214;&#12290;&#20182;&#20204;&#36890;&#24120;&#26159;&#36890;&#36807;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#65292;&#23558;&#37038;&#20214;&#26631;&#39064;&#20986;&#29616;&#30340;&#38382;&#39064;&#26631;&#31034;&#21495;&#30721;&#20316;&#20026;&#29305;&#27530;&#23383;&#31526;&#20018;&#26469;&#35782;&#21035;&#38382;&#39064;&#65307;&#24320;&#21457;&#32773;&#23398;&#30528;&#22312;&#20182;&#20204;&#30340;&#37038;&#20214;&#20013;&#21253;&#21547;&#36825;&#31867;&#23383;&#31526;&#20018;&#26469;&#35302;&#21160;&#36319;&#36394;&#31995;&#32479;&#30340;&#27880;&#24847;&#12290;Bug&#36319;&#36394;&#31995;&#32479;&#21487;&#20197;&#20445;&#23384;&#25972;&#20010;&#37038;&#20214;&#65292;&#25110;&#65288;&#26356;&#22909;&#19968;&#28857;&#65289;&#21482;&#26159;&#35760;&#24405;&#37038;&#20214;&#22312;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#20013;&#30340;&#38142;&#25509;&#12290;&#26080;&#35770;&#20309;&#31181;&#26041;&#24335;&#65292;&#36825;&#26159;&#19968;&#20010;&#38750;&#24120;&#26377;&#29992;&#30340;&#29305;&#24615;&#65307;&#22914;&#26524;&#20320;&#30340;&#36319;&#36394;&#31995;&#32479;&#26377;&#36825;&#20010;&#21151;&#33021;&#65292;&#35201;&#30830;&#20445;&#22312;&#24320;&#21551;&#23427;&#30340;&#21516;&#26102;&#25552;&#37266;&#20154;&#20204;&#21033;&#29992;&#36825;&#20010;&#29305;&#24615;&#12290;</p></div><div class="sect2" title="Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;"><div class="titlepage"><div><div><h3 class="title"><a name="bug-filtering"></a>Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;</h3></div></div></div><p>&#22823;&#22810;&#25968;&#38382;&#39064;&#25968;&#25454;&#24211;&#26368;&#32456;&#20250;&#36973;&#36935;&#30456;&#21516;&#30340;&#22256;&#22659;&#65306;&#30001;&#22909;&#24515;&#20294;&#27809;&#32463;&#39564;&#25110;&#28040;&#24687;&#19981;&#28789;&#36890;&#29992;&#25143;&#25152;&#21457;&#36215;&#30340;&#37325;&#22797;&#21644;&#26080;&#25928;&#38382;&#39064;&#30340;&#27946;&#27969;&#12290;&#19982;&#36825;&#31181;&#36235;&#21183;&#26007;&#20105;&#30340;&#31532;&#19968;&#27493;&#36890;&#24120;&#26159;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#30340;&#21069;&#39029;&#25918;&#32622;&#19968;&#20010;&#26174;&#33879;&#30340;&#25552;&#37266;&#65292;&#35299;&#37322;&#22914;&#20309;&#30693;&#36947;&#19968;&#20010;bug&#26159;&#21542;&#30830;&#23454;&#26159;bug&#12289;&#22914;&#20309;&#26597;&#25214;bug&#26159;&#21542;&#24050;&#32463;&#34987;&#21457;&#36215;&#12289;&#20197;&#21450;&#22914;&#26524;&#20381;&#28982;&#35748;&#20026;&#26159;&#26032;bug&#26102;&#22914;&#20309;&#26377;&#25928;&#30340;&#25253;&#21578;&#12290;</p><p>&#36825;&#20250;&#26242;&#26102;&#20943;&#23569;&#22122;&#38899;&#65292;&#20294;&#26159;&#24403;&#29992;&#25143;&#25968;&#22686;&#21152;&#21518;&#65292;&#38382;&#39064;&#36824;&#26159;&#20250;&#20986;&#29616;&#12290;&#27599;&#20010;&#21333;&#29420;&#30340;&#29992;&#25143;&#37117;&#19981;&#24212;&#35813;&#22240;&#27492;&#34987;&#35892;&#36131;&#12290;&#21363;&#20351;&#20182;&#20204;&#30340;&#31532;&#19968;&#20010;bug&#25253;&#21578;&#27809;&#26377;&#29992;&#22788;&#65292;&#20320;&#36824;&#26159;&#35201;&#40723;&#21169;&#20182;&#20204;&#20445;&#25345;&#21442;&#19982;&#24182;&#22312;&#20197;&#21518;&#25552;&#20986;&#26356;&#22909;&#30340;&#38382;&#39064;&#12290;&#21516;&#26102;&#65292;&#39033;&#30446;&#38656;&#35201;&#20445;&#25345;&#38382;&#39064;&#25968;&#25454;&#24211;&#30340;&#22403;&#22334;&#36234;&#23569;&#36234;&#22909;&#12290;</p><p>&#36825;&#20004;&#20214;&#20107;&#21487;&#20197;&#26368;&#22823;&#31243;&#24230;&#30340;&#38450;&#27490;&#36825;&#20123;&#38382;&#39064;&#65306;&#35831;&#30830;&#35748;&#30417;&#35270;bug&#36319;&#36394;&#31995;&#32479;&#30340;&#20154;&#26377;&#36275;&#22815;&#30340;&#30693;&#35782;&#65292;&#33021;&#22312;&#38382;&#39064;&#26080;&#25928;&#25110;&#37325;&#22797;&#26102;&#20851;&#38381;&#23427;&#65292;&#32780;&#19988;&#33021;&#22815;&#35201;&#27714;&#65288;&#25110;&#24378;&#28872;&#30340;&#40723;&#21169;&#65289;&#29992;&#25143;&#22312;&#22635;&#20837;&#36319;&#36394;&#31995;&#32479;&#21069;&#30830;&#35748;&#20182;&#20204;&#30340;bug&#12290;</p><p>&#31532;&#19968;&#31181;&#25216;&#26415;&#30475;&#36215;&#26469;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#21363;&#20351;&#39033;&#30446;&#26377;&#24040;&#22823;&#30340;&#38382;&#39064;&#25968;&#25454;&#24211;&#65288;&#20363;&#22914;&#65292;Debian&#22312;<a class="ulink" href="http://bugs.debian.org/" target="_top">http://bugs.debian.org/</a>&#30340;bug&#36319;&#36394;&#31995;&#32479;&#65292;&#30446;&#21069;&#26377;315,929&#20010;&#38382;&#39064;&#65289;&#20063;&#26159;&#36825;&#26679;&#23433;&#25490;&#30340;&#65292;&#36825;&#26679;<span class="emphasis"><em>&#26576;&#20154;</em></span>&#36827;&#20837;&#26102;&#23601;&#33021;&#30475;&#21040;&#25152;&#26377;&#30340;&#38382;&#39064;&#12290;&#19981;&#21516;&#30340;&#38382;&#39064;&#31867;&#21035;&#21487;&#33021;&#26159;&#19981;&#21516;&#30340;&#20154;&#12290;&#20363;&#22914;&#65292;Debian&#39033;&#30446;&#21253;&#21547;&#20102;&#19968;&#32452;&#36719;&#20214;&#21253;&#65292;&#36825;&#26679;Debian&#23601;&#33021;&#22815;&#33258;&#21160;&#36335;&#30001;&#27599;&#20010;&#38382;&#39064;&#21040;&#21512;&#36866;&#30340;&#21253;&#32500;&#25252;&#32773;&#12290;&#24403;&#28982;&#65292;&#29992;&#25143;&#26377;&#26102;&#20250;&#25226;&#38382;&#39064;&#31867;&#21035;&#25630;&#38169;&#65292;&#36825;&#26679;&#19968;&#24320;&#22987;&#38382;&#39064;&#23601;&#20250;&#21457;&#36865;&#21040;&#38169;&#35823;&#30340;&#20154;&#65292;&#32780;&#20182;&#21487;&#20197;&#20877;&#23558;&#20854;&#36716;&#21521;&#21040;&#20854;&#20182;&#20154;&#12290;&#28982;&#32780;&#65292;&#26368;&#37325;&#35201;&#30340;&#20107;&#24773;&#26159;&#36127;&#25285;&#34987;&#20998;&#25285;&#20102;&#8212;&#26080;&#35770;&#29992;&#25143;&#22312;&#22635;&#20889;&#30340;&#26102;&#20505;&#26159;&#23545;&#26159;&#38169;&#65292;&#38382;&#39064;&#30417;&#35270;&#30340;&#20219;&#21153;&#36824;&#26159;&#20250;&#22312;&#24320;&#21457;&#32773;&#20043;&#38388;&#20998;&#37197;&#65292;&#25152;&#20197;&#27599;&#20010;&#38382;&#39064;&#37117;&#33021;&#22815;&#24471;&#21040;&#21450;&#26102;&#30340;&#22238;&#22797;&#12290;</p><p>&#31532;&#20108;&#31181;&#25216;&#26415;&#24212;&#29992;&#30340;&#27809;&#26377;&#37027;&#20040;&#24191;&#27867;&#65292;&#21487;&#33021;&#22240;&#20026;&#23427;&#24456;&#38590;&#34987;&#33258;&#21160;&#21270;&#12290;&#26412;&#36136;&#24605;&#24819;&#26159;&#27599;&#20010;&#26032;&#38382;&#39064;&#37117;&#26159;&#32463;&#36807;&#20249;&#20276;&#22788;&#29702;&#21518;&#36827;&#20837;&#21040;&#30340;&#25968;&#25454;&#24211;&#20013;&#12290;&#24403;&#29992;&#25143;&#35748;&#20026;&#20182;&#21457;&#29616;&#20102;&#19968;&#20010;&#38382;&#39064;&#65292;&#20182;&#23601;&#20250;&#34987;&#35201;&#27714;&#22312;&#37038;&#20214;&#21015;&#34920;&#25110;IRC&#39057;&#36947;&#20013;&#23545;&#20854;&#36827;&#34892;&#25551;&#36848;&#65292;&#28982;&#21518;&#24471;&#21040;&#26576;&#20010;&#20154;&#23545;&#20854;&#26159;bug&#30830;&#35748;&#12290;&#23613;&#26089;&#24341;&#20837;&#31532;&#20108;&#21452;&#30524;&#30555;&#21487;&#20197;&#38450;&#27490;&#35768;&#22810;&#34394;&#20551;&#30340;&#25253;&#21578;&#12290;&#26377;&#26102;&#20505;&#31532;&#20108;&#26041;&#21487;&#20197;&#35782;&#21035;&#20986;&#36825;&#20010;&#34892;&#20026;&#19981;&#26159;&#19968;&#20010;bug&#65292;&#25110;&#32773;&#24050;&#32463;&#22312;&#26368;&#36817;&#30340;&#21457;&#24067;&#20013;&#34987;&#20462;&#27491;&#12290;&#25110;&#32773;&#22905;&#21487;&#33021;&#30001;&#20110;&#31867;&#20284;&#30151;&#29366;bug&#32780;&#24863;&#21040;&#29087;&#24713;&#65292;&#32780;&#19988;&#21487;&#20197;&#36890;&#36807;&#32473;&#29992;&#25143;&#25351;&#26126;&#32769;&#30340;&#38382;&#39064;&#26469;&#38450;&#27490;&#37325;&#22797;&#30340;&#22635;&#20889;&#12290;&#36890;&#24120;&#20165;&#20165;&#26159;&#35810;&#38382;&#29992;&#25143;&#8220;&#20320;&#26597;&#25214;&#36807;bug&#36319;&#36394;&#31995;&#32479;&#20197;&#30830;&#23450;&#36825;&#20010;&#38382;&#39064;&#26159;&#21542;&#24050;&#32463;&#25253;&#21578;&#36807;&#20102;&#21527;&#65311;&#8221;&#35768;&#22810;&#29992;&#25143;&#19981;&#20250;&#24819;&#21040;&#36825;&#20010;&#19968;&#28857;&#65292;&#22914;&#26524;&#26377;&#20154;<span class="emphasis"><em>&#26399;&#26395;</em></span>&#65292;&#20320;&#21487;&#20197;&#24841;&#24555;&#30340;&#20026;&#20182;&#20204;&#26597;&#25214;&#19968;&#19979;&#12290;</p><p>&#36825;&#31181;&#20249;&#20276;&#31995;&#32479;&#30830;&#23454;&#21487;&#20197;&#20445;&#35777;&#38382;&#39064;&#25968;&#25454;&#24211;&#30340;&#28165;&#27905;&#65292;&#20294;&#26159;&#20063;&#26377;&#19968;&#20123;&#19981;&#21033;&#30340;&#22320;&#26041;&#12290;&#35768;&#22810;&#29992;&#25143;&#26080;&#35770;&#22914;&#20309;&#20063;&#35201;&#29420;&#31435;&#21457;&#36215;&#38382;&#39064;&#65292;&#23545;&#20026;&#21457;&#36215;&#26032;&#38382;&#39064;&#32780;&#23547;&#25214;&#20249;&#20276;&#30340;&#25351;&#21335;&#30475;&#19981;&#21040;&#25110;&#32773;&#35270;&#32780;&#19981;&#35265;&#12290;&#22240;&#27492;&#65292;&#36824;&#26159;&#38656;&#35201;&#26377;&#24535;&#24895;&#32773;&#20851;&#27880;&#38382;&#39064;&#25968;&#25454;&#24211;&#12290;&#27492;&#22806;&#65292;&#22240;&#20026;&#35768;&#22810;&#26032;&#25253;&#21578;&#32773;&#19981;&#29702;&#35299;&#32500;&#25252;&#38382;&#39064;&#25968;&#25454;&#24211;&#30340;&#38590;&#24230;&#65292;&#23545;&#20182;&#20204;&#24573;&#30053;&#25351;&#21335;&#30340;&#34892;&#20026;&#36827;&#34892;&#36807;&#20110;&#20005;&#21385;&#30340;&#26021;&#36131;&#26159;&#19981;&#20844;&#24179;&#30340;&#12290;&#25152;&#20197;&#24535;&#24895;&#32773;&#24517;&#39035;&#20445;&#25345;&#35686;&#35273;&#65292;&#32852;&#31995;&#22914;&#20309;&#21453;&#24377;&#26410;&#32463;&#25645;&#26723;&#22788;&#29702;&#30340;&#38382;&#39064;&#32473;&#25253;&#21578;&#32773;&#12290;&#30446;&#26631;&#26159;&#35757;&#32451;&#27599;&#20010;&#25253;&#21578;&#32773;&#22312;&#26410;&#26469;&#20351;&#29992;&#20249;&#20276;&#31995;&#32479;&#65292;&#36825;&#26679;&#23601;&#26377;&#19968;&#20010;&#26085;&#30410;&#22686;&#38271;&#30340;&#33021;&#22815;&#29702;&#35299;&#38382;&#39064;&#36807;&#28388;&#31995;&#32479;&#30340;&#29992;&#25143;&#27744;&#12290;&#24403;&#30475;&#21040;&#19968;&#20010;&#26410;&#32463;&#20249;&#20276;&#31995;&#32479;&#22788;&#29702;&#30340;&#38382;&#39064;&#26102;&#65292;&#29702;&#24819;&#30340;&#27493;&#39588;&#26159;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#31435;&#21051;&#22238;&#22797;&#38382;&#39064;&#65292;&#31036;&#35980;&#30340;&#24863;&#35874;&#29992;&#25143;&#30340;&#22635;&#20889;&#65292;&#20294;&#26159;&#21521;&#20182;&#20204;&#25351;&#20986;&#20249;&#20276;&#31995;&#32479;&#30340;&#25805;&#20316;&#25351;&#21335;&#65288;&#24403;&#28982;&#24212;&#35813;&#22312;&#32593;&#31449;&#30340;&#26174;&#33879;&#20301;&#32622;&#65289;&#12290;</p></li><li class="listitem"><p>&#22914;&#26524;&#38382;&#39064;&#26159;&#26126;&#26174;&#26377;&#25928;&#32780;&#19988;&#27809;&#26377;&#37325;&#22797;&#65292;&#24819;&#21150;&#27861;&#35777;&#26126;&#23427;&#65292;&#20351;&#20043;&#24320;&#22987;&#27491;&#24120;&#30340;&#29983;&#21629;&#21608;&#26399;&#12290;&#27605;&#31455;&#65292;&#25253;&#21578;&#32773;&#27809;&#26377;&#34987;&#21578;&#30693;&#20249;&#20276;&#31995;&#32479;&#65292;&#25152;&#26377;&#28010;&#36153;&#24037;&#20316;&#37327;&#20851;&#38381;&#26377;&#25928;&#30340;&#38382;&#39064;&#26159;&#27809;&#26377;&#24847;&#20041;&#30340;&#12290;</p></li><li class="listitem"><p>&#21542;&#21017;&#65292;&#22914;&#26524;&#38382;&#39064;&#19981;&#26159;&#24456;&#28165;&#26970;&#30340;&#26377;&#25928;&#65292;&#20851;&#38381;&#23427;&#65292;&#20294;&#26159;&#35201;&#27714;&#25253;&#21578;&#32773;&#22312;&#24471;&#21040;&#20249;&#20276;&#30340;&#30830;&#35748;&#21518;&#37325;&#26032;&#25171;&#24320;&#23427;&#12290;&#24403;&#20182;&#20204;&#36825;&#26679;&#20570;&#26102;&#65292;&#20182;&#20204;&#24212;&#24403;&#25918;&#32622;&#19968;&#20010;&#30830;&#35748;&#37038;&#20214;&#21015;&#34920;&#32447;&#32034;&#30340;&#24341;&#29992;&#65288;&#20363;&#22914;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#30340;URL&#65289;&#12290;</p></li></ol></div><p>&#35831;&#35760;&#20303;&#23613;&#31649;&#31995;&#32479;&#20250;&#36880;&#28176;&#25913;&#21892;&#38382;&#39064;&#25968;&#25454;&#24211;&#30340;&#20449;/&#22122;&#27604;&#65292;&#20294;&#26159;&#19981;&#20250;&#38459;&#27490;&#35823;&#22635;&#30340;&#21457;&#29983;&#12290;&#23436;&#20840;&#38450;&#27490;&#35823;&#22635;&#30340;&#21807;&#19968;&#26041;&#27861;&#26159;&#20851;&#38381;bug&#36319;&#36394;&#31995;&#32479;&#65292;&#21482;&#24320;&#25918;&#32473;&#24320;&#21457;&#32773;&#8212;&#27835;&#24840;&#20960;&#20046;&#27704;&#36828;&#27604;&#30142;&#30149;&#26412;&#36523;&#26356;&#22351;&#12290;&#24212;&#24403;&#25509;&#21463;&#26080;&#25928;&#38382;&#39064;&#30340;&#28165;&#29702;&#26159;&#39033;&#30446;&#26085;&#24120;&#32500;&#25252;&#30340;&#19968;&#37096;&#20998;&#65292;&#24182;&#21162;&#21147;&#24471;&#21040;&#26356;&#22810;&#30340;&#20154;&#20204;&#26469;&#24110;&#24537;&#12290;</p><p>&#22312;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="share-management.html#issue-manager" title="&#38382;&#39064;&#31649;&#29702;&#21592;">the section called &#8220;&#38382;&#39064;&#31649;&#29702;&#21592;&#8221;</a>&#20063;&#26377;&#20171;&#32461;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="vc.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="irc.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#29256;&#26412;&#25511;&#21046; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;</td></tr></table></div></body></html>
