<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="communications.html" title="Chapter 6. &#20132;&#27969;"><link rel="prev" href="growth.html" title="&#22788;&#29702;&#25104;&#38271;"><link rel="next" href="publicity.html" title="&#20844;&#24320;&#24615;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="growth.html">Prev</a> </td><th width="60%" align="center">Chapter 6. &#20132;&#27969;</th><td width="20%" align="right"> <a accesskey="n" href="publicity.html">Next</a></td></tr></table><hr></div><div class="sect1" title="Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="bug-tracker-usage"></a>Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;</h2></div></div></div><p>&#23545;&#20110;&#31215;&#26497;&#20351;&#29992;bug&#36319;&#36394;&#31995;&#32479;&#30340;&#39033;&#30446;&#65292;&#35201;&#23567;&#24515;&#23427;&#21464;&#25104;&#35752;&#35770;&#35770;&#22363;&#65292;&#34429;&#28982;&#37038;&#20214;&#21015;&#34920;&#21487;&#33021;&#26356;&#22909;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#23427;&#24635;&#26159;&#24456;&#26080;&#36764;&#30340;&#24320;&#22987;&#30340;&#65306;&#26576;&#20154;&#35780;&#35770;&#20102;&#26576;&#20010;&#38382;&#39064;&#65292;&#20363;&#22914;&#25552;&#20986;&#20102;&#19968;&#20010;&#35299;&#20915;&#26041;&#26696;&#25110;&#37096;&#20998;&#34917;&#19969;&#12290;&#21478;&#19968;&#20010;&#20154;&#27880;&#24847;&#21040;&#36825;&#20010;&#65292;&#35748;&#20026;&#36825;&#20010;&#26041;&#26696;&#26377;&#20123;&#38382;&#39064;&#65292;&#25152;&#20197;&#38468;&#21152;&#20102;&#21478;&#19968;&#20010;&#35780;&#35770;&#25351;&#20986;&#36825;&#20010;&#38382;&#39064;&#12290;&#31532;&#19968;&#20010;&#20154;&#20877;&#27425;&#22238;&#24212;&#65292;&#23545;&#38382;&#39064;&#20316;&#20986;&#34917;&#20805;&#65292;&#23601;&#36825;&#26679;&#19968;&#30452;&#32487;&#32493;&#19979;&#21435;&#12290;</p><p>&#36825;&#26679;&#20570;&#30340;&#38382;&#39064;&#26159;&#65292;&#39318;&#20808;&#65292;bug&#36319;&#36394;&#31995;&#32479;&#29992;&#20110;&#35752;&#35770;&#26102;&#38750;&#24120;&#30340;&#31528;&#25305;&#65292;&#20854;&#27425;&#65292;&#20854;&#20182;&#20154;&#21487;&#33021;&#19981;&#20250;&#25237;&#20837;&#20851;&#27880;&#8212;&#27605;&#31455;&#65292;&#20182;&#20204;&#24076;&#26395;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#36827;&#34892;&#24320;&#21457;&#35752;&#35770;&#65292;&#36825;&#20063;&#26159;&#20182;&#20204;&#26597;&#25214;&#38382;&#39064;&#30340;&#22320;&#26041;&#12290;&#20182;&#20204;&#21487;&#33021;&#27809;&#26377;&#35746;&#38405;&#38382;&#39064;&#21464;&#26356;&#21015;&#34920;&#65292;&#21363;&#20351;&#35746;&#38405;&#20102;&#65292;&#20063;&#19981;&#21487;&#33021;&#32039;&#36319;&#25152;&#26377;&#30340;&#21464;&#21270;&#12290;</p><p>&#20294;&#26159;&#36825;&#20010;&#36807;&#31243;&#20013;&#21040;&#24213;&#20309;&#26102;&#20986;&#20102;&#24046;&#38169;&#65311;&#26159;&#19981;&#26159;&#37027;&#20010;&#20154;&#23558;&#33258;&#24049;&#30340;&#35299;&#20915;&#26041;&#26696;&#38468;&#21152;&#21040;&#38382;&#39064;&#26102;&#8212;&#22905;&#26159;&#19981;&#26159;&#24212;&#35813;&#21457;&#24067;&#21040;&#21015;&#34920;&#20013;&#65311;&#25110;&#32773;&#26159;&#24403;&#31532;&#20108;&#20010;&#20154;&#30452;&#25509;&#22238;&#22797;&#36825;&#20010;&#38382;&#39064;&#65292;&#32780;&#19981;&#26159;&#22312;&#21015;&#34920;&#22238;&#22797;&#26102;&#12290;</p><p>&#36825;&#37324;&#27809;&#26377;&#27491;&#30830;&#30340;&#31572;&#26696;&#65292;&#20294;&#26159;&#26377;&#19968;&#33324;&#30340;&#21407;&#29702;&#65306;&#22914;&#26524;&#20320;&#20165;&#20165;&#26159;&#20026;&#38382;&#39064;&#28155;&#21152;&#25968;&#25454;&#65292;&#37027;&#20040;&#35831;&#22312;&#36319;&#36394;&#31995;&#32479;&#20013;&#25805;&#20316;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#24819;&#21457;&#36215;&#19968;&#27425;<span class="emphasis"><em>&#23545;&#35805;</em></span>&#65292;&#37027;&#20040;&#35831;&#21040;&#37038;&#20214;&#21015;&#34920;&#12290;&#19981;&#26159;&#27599;&#27425;&#37117;&#33021;&#21028;&#26029;&#20986;&#26159;&#21738;&#31181;&#24773;&#20917;&#65292;&#20294;&#26159;&#20320;&#35201;&#20316;&#20986;&#26368;&#20339;&#30340;&#21028;&#26029;&#12290;&#20363;&#22914;&#65292;&#24403;&#20320;&#25552;&#20132;&#30340;&#34917;&#19969;&#20250;&#21253;&#21547;&#21453;&#23545;&#30340;&#35299;&#20915;&#26041;&#26696;&#26102;&#65292;&#20320;&#24212;&#24403;&#20250;&#39044;&#26399;&#26377;&#20154;&#20250;&#23545;&#27492;&#21457;&#20986;&#36136;&#30097;&#12290;&#25152;&#20197;&#65292;&#21363;&#20351;&#20320;&#20250;&#33258;&#28982;&#30340;&#20026;&#35813;&#38382;&#39064;&#38468;&#21152;&#36825;&#20010;&#34917;&#19969;&#65288;&#20551;&#23450;&#20320;&#19981;&#24076;&#26395;&#25110;&#32773;&#19981;&#33021;&#30452;&#25509;&#25552;&#20132;&#20462;&#25913;&#65289;&#65292;&#20063;&#24212;&#24403;&#36873;&#25321;&#23558;&#20854;&#21457;&#24067;&#21040;&#37038;&#20214;&#21015;&#34920;&#12290;&#26377;&#19968;&#23450;&#30340;&#21487;&#33021;&#24615;&#65292;&#25972;&#20010;&#20132;&#27969;&#26368;&#32456;&#20250;&#26377;&#24471;&#20986;&#32467;&#26524;&#65292;&#26576;&#19968;&#26041;&#21487;&#33021;&#20250;&#35828;&#24212;&#35813;&#19981;&#20165;&#20165;&#26159;&#36861;&#21152;&#25968;&#25454;&#65292;&#32780;&#24212;&#35813;&#24320;&#22987;&#19968;&#22330;&#35752;&#35770;&#20102;&#8212;&#22312;&#26412;&#23567;&#33410;&#24320;&#22836;&#30340;&#20363;&#23376;&#20013;&#65292;&#20063;&#23601;&#26159;&#31532;&#20108;&#20010;&#22238;&#22797;&#32773;&#65292;&#20182;&#35748;&#35782;&#21040;&#20102;&#34917;&#19969;&#30340;&#38382;&#39064;&#65292;&#39044;&#27979;&#21040;&#23558;&#20250;&#26377;&#30495;&#23454;&#30340;&#20132;&#27969;&#21457;&#29983;&#65292;&#22240;&#32780;&#24212;&#35813;&#36890;&#36807;&#26356;&#21512;&#36866;&#30340;&#23186;&#20171;&#23436;&#25104;&#12290;</p><p>&#29992;&#25968;&#23398;&#27169;&#25311;&#26469;&#35828;&#65292;&#22914;&#26524;&#26681;&#25454;&#20449;&#24687;&#26174;&#31034;&#38382;&#39064;&#23558;&#20250;&#24456;&#24555;&#25910;&#25947;&#65292;&#37027;&#20040;&#30452;&#25509;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#20013;&#21457;&#24067;&#65307;&#22914;&#26524;&#30475;&#36215;&#26469;&#23558;&#20250;&#21457;&#25955;&#65292;&#37027;&#20040;&#37038;&#20214;&#21015;&#34920;&#25110;IRC&#39057;&#36947;&#23558;&#20250;&#26159;&#26356;&#22909;&#30340;&#22320;&#26041;&#12290;</p><p>&#24182;&#19981;&#26159;&#35828;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#20013;&#19981;&#33021;&#26377;&#20219;&#20309;&#20132;&#27969;&#12290;&#20363;&#22914;&#65292;&#21521;&#21407;&#25253;&#21578;&#32773;&#35810;&#38382;&#37325;&#29616;&#30340;&#27493;&#39588;&#32454;&#33410;&#23601;&#19968;&#33324;&#26159;&#19968;&#20010;&#24456;&#23481;&#26131;&#25910;&#25947;&#30340;&#36807;&#31243;&#12290;&#20154;&#20204;&#30340;&#22238;&#24212;&#24182;&#19981;&#26159;&#25552;&#20986;&#26032;&#30340;&#38382;&#39064;&#65292;&#32780;&#20165;&#20165;&#26159;&#28548;&#28165;&#24050;&#32463;&#35760;&#24405;&#30340;&#38382;&#39064;&#12290;&#27809;&#26377;&#24517;&#35201;&#20998;&#25955;&#37038;&#20214;&#21015;&#34920;&#30340;&#27880;&#24847;&#21147;&#65307;&#24182;&#19981;&#19968;&#23450;&#35201;&#36890;&#36807;&#23567;&#24515;&#36319;&#36394;&#31995;&#32479;&#20013;&#19968;&#31995;&#21015;&#30340;&#35780;&#35770;&#23454;&#29616;&#12290;&#21516;&#26679;&#30340;&#65292;&#22914;&#26524;&#20320;&#35748;&#20026;&#36825;&#20010;bug&#26159;&#35823;&#25253;&#30340;&#65288;&#20363;&#22914;&#65292;&#26681;&#26412;&#23601;&#19981;&#26159;&#19968;&#20010;bug&#65289;&#65292;&#20320;&#21482;&#38656;&#35201;&#22312;&#38382;&#39064;&#20013;&#35828;&#20986;&#26469;&#12290;&#29978;&#33267;&#25351;&#20986;&#35299;&#20915;&#26041;&#26696;&#20013;&#30340;&#20123;&#35768;&#32570;&#38519;&#20063;&#27809;&#26377;&#38382;&#39064;&#65292;&#21482;&#35201;&#35813;&#32570;&#38519;&#19981;&#20250;&#24433;&#21709;&#25972;&#20010;&#35299;&#20915;&#26041;&#26696;&#12290;</p><p>&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20320;&#20250;&#22312;bug&#30340;&#33539;&#22260;&#25110;&#36719;&#20214;&#27491;&#30830;&#34892;&#20026;&#26041;&#24335;&#26041;&#38754;&#65292;&#25351;&#20986;&#21746;&#23398;&#38382;&#39064;&#65292;&#20320;&#32943;&#23450;&#20250;&#35748;&#20026;&#23558;&#26377;&#20854;&#20182;&#24320;&#21457;&#32773;&#21442;&#19982;&#12290;&#35752;&#35770;&#20063;&#35768;&#20250;&#21457;&#25955;&#19968;&#27573;&#26102;&#38388;&#65292;&#37027;&#20040;&#35831;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#23436;&#25104;&#12290;</p><p>&#22914;&#26524;&#36873;&#25321;&#20102;&#37038;&#20214;&#21015;&#34920;&#65292;&#23601;&#19968;&#30452;&#35201;&#22312;&#38382;&#39064;&#20013;&#20445;&#23384;&#21040;&#37038;&#20214;&#21015;&#34920;&#35752;&#35770;&#30340;&#38142;&#25509;&#12290;&#23545;&#20110;&#26597;&#30475;&#38382;&#39064;&#30340;&#20154;&#65292;&#33021;&#30475;&#21040;&#23545;&#24212;&#30340;&#35752;&#35770;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65292;&#21363;&#20351;&#38382;&#39064;&#26412;&#36523;&#19981;&#26159;&#35752;&#35770;&#30340;&#22330;&#25152;&#12290;&#21457;&#36215;&#36825;&#20010;&#32447;&#32034;&#30340;&#20154;&#20250;&#21457;&#29616;&#26377;&#28857;&#29301;&#24378;&#65292;&#20294;&#26159;&#24320;&#28304;&#20174;&#26681;&#26412;&#19978;&#35828;&#23601;&#26159;&#19968;&#31181;&#25776;&#20889;-&#22238;&#24212;&#30340;&#25991;&#21270;&#65306;&#35753;&#25104;&#21315;&#19978;&#19975;&#30340;&#20154;&#35835;&#36215;bug&#26469;&#26356;&#23481;&#26131;&#65292;&#36828;&#27604;&#19977;&#20116;&#20010;&#32534;&#20889;&#32773;&#30340;&#40635;&#28902;&#37325;&#35201;&#30340;&#22810;&#12290;</p><p>&#22914;&#26524;&#21487;&#20197;&#35753;&#35835;&#32773;&#26356;&#20415;&#21033;&#65292;&#21487;&#20197;&#23558;&#37325;&#35201;&#30340;&#32467;&#35770;&#25110;&#24635;&#32467;&#20174;&#37038;&#20214;&#21015;&#34920;&#20013;&#31896;&#36148;&#21040;&#38382;&#39064;&#20013;&#12290;&#19968;&#20010;&#24120;&#35265;&#30340;&#20064;&#20439;&#26159;&#24320;&#22987;&#19968;&#20010;&#21015;&#34920;&#35752;&#35770;&#65292;&#22312;&#38382;&#39064;&#20013;&#38468;&#21152;&#35752;&#35770;&#32447;&#32034;&#30340;&#38142;&#25509;&#65292;&#28982;&#21518;&#26159;&#35752;&#35770;&#32467;&#26463;&#30340;&#26102;&#38388;&#65292;&#31896;&#36148;&#26368;&#32456;&#30340;&#24635;&#32467;&#65288;&#20197;&#21450;&#21253;&#21547;&#24635;&#32467;&#20449;&#24687;&#30340;&#38142;&#25509;&#65289;&#65292;&#36825;&#26679;&#27983;&#35272;&#27492;&#38382;&#39064;&#30340;&#20154;&#23601;&#21487;&#20197;&#36731;&#26494;&#30340;&#30475;&#21040;&#24050;&#32463;&#24471;&#20986;&#30340;&#32467;&#35770;&#65292;&#32780;&#26080;&#38656;&#28857;&#20987;&#21040;&#20854;&#20182;&#22320;&#26041;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#37324;&#19981;&#23384;&#22312;&#37325;&#22797;&#25968;&#25454;&#30340;&#38382;&#39064;&#65292;&#22240;&#20026;&#24402;&#26723;&#21644;&#38382;&#39064;&#22238;&#22797;&#37117;&#26159;&#36890;&#24120;&#26159;&#38745;&#24577;&#30340;&#65292;&#19981;&#20250;&#25913;&#21464;&#30340;&#25968;&#25454;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="growth.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="publicity.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#22788;&#29702;&#25104;&#38271; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20844;&#24320;&#24615;</td></tr></table></div></body></html>
