<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="vc-systems.html" title="Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;"><link rel="next" href="bikeshed-full.html" title="Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="vc-systems.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bikeshed-full.html">Next</a></td></tr></table><hr></div><div class="appendix" title="Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;"><div class="titlepage"><div><div><h2 class="title"><a name="bug-trackers"></a>Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>&#26080;&#35770;&#39033;&#30446;&#20351;&#29992;&#21738;&#20010;bug&#36319;&#36394;&#31995;&#32479;&#65292;&#26576;&#20123;&#24320;&#21457;&#32773;&#24635;&#20250;&#26377;&#20123;&#25265;&#24616;&#12290;&#22312;&#36825;&#19968;&#28857;&#19978;bug&#36319;&#36394;&#31995;&#32479;&#27604;&#20854;&#20182;&#26631;&#20934;&#24320;&#21457;&#24037;&#20855;&#26356;&#20855;&#20195;&#34920;&#24615;&#12290;&#25105;&#24819;&#36825;&#26159;&#22240;&#20026;bug&#36319;&#36394;&#31995;&#32479;&#26159;&#36825;&#26679;&#21487;&#35270;&#21270;&#21644;&#21487;&#20132;&#20114;&#65292;&#21487;&#20197;&#36731;&#26494;&#30340;&#24819;&#35937;&#20986;&#19968;&#20010;&#20154;&#21487;&#20197;&#20570;&#30340;&#25913;&#36827;&#65288;&#22914;&#26524;&#26576;&#20154;&#26377;&#26102;&#38388;&#65289;&#65292;&#24182;&#35828;&#20986;&#36825;&#20123;&#25913;&#36827;&#30340;&#25551;&#36848;&#12290;&#25226;&#36825;&#20123;&#19981;&#21487;&#36991;&#20813;&#30340;&#25265;&#24616;&#24403;&#20316;&#21487;&#20449;&#20063;&#21487;&#30097;&#30340;&#21543;&#8212;&#19979;&#38754;&#35828;&#30340;&#36319;&#36394;&#31995;&#32479;&#37117;&#24050;&#32463;&#36275;&#22815;&#22909;&#20102;&#12290;</p><p>&#22312;&#36825;&#20010;&#21015;&#34920;&#20013;&#65292;&#8221;&#38382;&#39064;&#65288;issue&#65289;&#8220;&#29992;&#20110;&#20195;&#34920;&#36319;&#36394;&#31995;&#32479;&#36319;&#36394;&#30340;&#26465;&#30446;&#12290;&#20294;&#26159;&#35831;&#29282;&#35760;&#27599;&#20010;&#31995;&#32479;&#37117;&#20250;&#26377;&#33258;&#24049;&#30340;&#23646;&#20110;&#65292;&#23545;&#24212;&#30340;&#26415;&#35821;&#21253;&#25324;&#8221;&#21046;&#21697;&#65288;artifact&#65289;&#8220;&#25110;&#8221;bug&#8220;&#25110;&#20854;&#23427;&#12290;</p><div class="sect2" title="Bugzilla &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-bugzilla"></a><span class="bold"><strong>Bugzilla</strong></span> &#8212; <a class="ulink" href="http://www.bugzilla.org/" target="_top">http://www.bugzilla.org/</a></h3></div></div></div><p>Bugzilla&#38750;&#24120;&#27969;&#34892;&#65292;&#27963;&#36291;&#30340;&#32500;&#25252;&#20013;&#65292;&#30475;&#36215;&#26469;&#35753;&#23427;&#30340;&#29992;&#25143;&#37117;&#24456;&#24555;&#20048;&#12290;&#25105;&#26366;&#32463;&#26377;&#22235;&#24180;&#22312;&#24037;&#20316;&#20013;&#20351;&#29992;&#20102;&#19968;&#20010;&#20462;&#25913;&#30340;&#21464;&#31181;&#65292;&#24456;&#21916;&#27426;&#23427;&#12290;&#23427;&#24182;&#19981;&#33021;&#39640;&#24230;&#30340;&#33258;&#23450;&#20041;&#65292;&#32780;&#26159;&#20197;&#19968;&#31181;&#21487;&#20197;&#30475;&#20316;&#20854;&#29305;&#24615;&#30340;&#21476;&#24618;&#26041;&#24335;&#65306;Bugzilla&#30475;&#36215;&#26469;&#21644;&#23427;&#21019;&#24314;&#26102;&#24046;&#19981;&#22810;&#65292;&#24847;&#21619;&#30528;&#35768;&#22810;&#24320;&#21457;&#32773;&#24050;&#32463;&#20064;&#24815;&#20102;&#23427;&#30340;&#30028;&#38754;&#65292;&#32780;&#19988;&#24863;&#35273;&#23427;&#20301;&#20110;&#29087;&#24713;&#30340;&#29256;&#22270;&#12290;</p></div><div class="sect2" title="GNATS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-gnats"></a><span class="bold"><strong>GNATS</strong></span> &#8212; <a class="ulink" href="http://www.gnu.org/software/gnats/" target="_top">http://www.gnu.org/software/gnats/</a></h3></div></div></div><p>GNU GNATS&#26159;&#26368;&#21476;&#32769;&#30340;&#24320;&#28304;bug&#36319;&#36394;&#31995;&#32479;&#20043;&#19968;&#65292;&#34987;&#24191;&#27867;&#20351;&#29992;&#12290;&#23427;&#26368;&#22823;&#30340;&#38271;&#22788;&#26159;&#30028;&#38754;&#30340;&#22810;&#26679;&#24615;&#65288;&#21487;&#20197;&#20165;&#20165;&#36890;&#36807;&#27983;&#35272;&#22120;&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;&#37038;&#20214;&#25110;&#21629;&#20196;&#34892;&#24037;&#20855;&#65289;&#65292;&#20197;&#21450;&#32431;&#25991;&#26412;&#38382;&#39064;&#23384;&#20648;&#12290;&#25152;&#26377;&#38382;&#39064;&#25968;&#25454;&#20197;&#25991;&#26412;&#25991;&#20214;&#23384;&#25918;&#22312;&#30913;&#30424;&#19978;&#36825;&#19968;&#20107;&#23454;&#65292;&#20351;&#25105;&#20204;&#21487;&#20197;&#36731;&#26494;&#30340;&#32534;&#20889;&#33258;&#23450;&#20041;&#24037;&#20855;&#33719;&#21462;&#24182;&#35299;&#26512;&#25968;&#25454;&#65288;&#20363;&#22914;&#65292;&#29983;&#25104;&#32479;&#35745;&#25253;&#21578;&#65289;&#12290;GNATS&#20063;&#21487;&#20197;&#29992;&#22810;&#31181;&#26041;&#27861;&#33258;&#21160;&#21560;&#25910;&#37038;&#20214;&#65292;&#24182;&#26681;&#25454;&#37038;&#20214;&#22836;&#30340;&#27169;&#24335;&#23558;&#20854;&#21152;&#20837;&#21040;&#21512;&#36866;&#30340;&#38382;&#39064;&#20013;&#65292;&#20351;&#24471;&#23545;&#20110;&#29992;&#25143;/&#24320;&#21457;&#32773;&#30340;&#23545;&#35805;&#30340;&#35760;&#24405;&#38750;&#24120;&#31616;&#21333;&#12290;</p></div><div class="sect2" title="RequestTracker (RT) &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-rt"></a><span class="bold"><strong>RequestTracker (RT)</strong></span> &#8212; <a class="ulink" href="http://www.bestpractical.com/rt/" target="_top">http://www.bestpractical.com/rt/</a></h3></div></div></div><p>RT&#30340;&#32593;&#31449;&#35828;&#8221;RT&#26159;&#19968;&#20010;&#20225;&#19994;&#32423;&#38382;&#39064;&#31995;&#32479;&#65292;&#21487;&#20197;&#35753;&#19968;&#32452;&#20154;&#26234;&#33021;&#21644;&#26377;&#25928;&#30340;&#31649;&#29702;&#20219;&#21153;&#12289;&#38382;&#39064;&#21644;&#19968;&#20010;&#22242;&#38431;&#30340;&#29992;&#25143;&#25552;&#20132;&#30340;&#35831;&#27714;&#65292;&#20197;&#21450;&#25152;&#26377;&#30340;&#27719;&#24635;&#12290;&#8220;RT&#26377;&#19968;&#20010;&#30456;&#23545;&#20248;&#32654;&#30340;web&#30028;&#38754;&#65292;&#20063;&#26377;&#30456;&#24403;&#24191;&#27867;&#30340;&#23433;&#35013;&#22522;&#30784;&#12290;&#30028;&#38754;&#22312;&#35270;&#35273;&#19978;&#26377;&#20123;&#22797;&#26434;&#65292;&#20294;&#24403;&#20320;&#29087;&#24713;&#21518;&#23601;&#19981;&#20250;&#35273;&#24471;&#37027;&#20040;&#20081;&#20102;&#12290;RT&#30340;&#35768;&#21487;&#35777;&#26159;GNU GPL&#65288;&#20986;&#20110;&#26576;&#20123;&#21407;&#22240;&#65292;&#20182;&#20204;&#30340;web&#31449;&#28857;&#35828;&#30340;&#24182;&#19981;&#26159;&#37027;&#20040;&#28165;&#26970;&#65289;&#12290;</p></div><div class="sect2" title="Trac &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-trac"></a><span class="bold"><strong>Trac</strong></span> &#8212; <a class="ulink" href="http://trac.edgewall.com/" target="_top">http://trac.edgewall.com/</a></h3></div></div></div><p>Trac&#19981;&#20165;&#20165;&#26159;&#19968;&#20010;bug&#36319;&#36394;&#31995;&#32479;&#20102;&#65292;&#23427;&#20063;&#26159;&#19968;&#20010;&#38598;&#25104;wiki&#30340;bug&#36319;&#36394;&#31995;&#32479;&#12290;&#23427;&#20351;&#29992;wiki&#38142;&#25509;&#26469;&#20851;&#32852;&#38382;&#39064;&#12289;&#25991;&#20214;&#21644;&#29256;&#26412;&#25511;&#21046;&#21464;&#26356;&#38598;&#21644;wiki&#39029;&#38754;&#12290;&#23427;&#20063;&#24456;&#26131;&#20110;&#35774;&#32622;&#65292;&#24182;&#19982;Subversion&#38598;&#25104;&#65288;&#35265;<a class="xref" href="vc-systems.html" title="Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;">Appendix A, <i>&#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</i></a>&#65289;&#12290;</p></div><div class="sect2" title="Roundup &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-roundup"></a><span class="bold"><strong>Roundup</strong></span> &#8212; <a class="ulink" href="http://roundup.sourceforge.net/" target="_top">http://roundup.sourceforge.net/</a></h3></div></div></div><p>Roundup&#30456;&#23545;&#26469;&#35828;&#24456;&#26131;&#20110;&#23433;&#35013;&#65288;&#21482;&#38656;&#35201;Python 2.1&#25110;&#26356;&#39640;&#29256;&#26412;&#65289;&#65292;&#32780;&#19988;&#24456;&#31616;&#21333;&#12290;&#23427;&#21253;&#25324;web&#65292;email&#21644;&#21629;&#20196;&#34892;&#25509;&#21475;&#12290;&#38382;&#39064;&#25968;&#25454;&#27169;&#26495;&#12289;web&#25509;&#21475;&#21644;&#37096;&#20998;&#29366;&#24577;&#36716;&#25442;&#36923;&#36753;&#26159;&#21487;&#20197;&#33258;&#23450;&#20041;&#30340;&#12290;</p></div><div class="sect2" title="Mantis &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-mantis"></a><span class="bold"><strong>Mantis</strong></span> &#8212; <a class="ulink" href="http://www.mantisbt.org/" target="_top">http://www.mantisbt.org/</a></h3></div></div></div><p>Mantis&#26159;&#19968;&#20010;&#22522;&#20110;web&#30340;bug&#36319;&#36394;&#31995;&#32479;&#65292;&#30001;PHP&#32534;&#20889;&#65292;&#24182;&#20351;&#29992;MySQL&#25968;&#25454;&#24211;&#20316;&#20026;&#23384;&#20648;&#12290;&#23427;&#25317;&#26377;&#20320;&#25152;&#26399;&#26395;&#30340;&#29305;&#24615;&#12290;&#20010;&#20154;&#26469;&#35265;&#65292;&#25105;&#35273;&#24471;web&#30028;&#38754;&#38750;&#24120;&#24178;&#20928;&#12289;&#26412;&#33021;&#65292;&#30475;&#36215;&#26469;&#24456;&#31616;&#21333;&#12290;</p></div><div class="sect2" title="Flyspray &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-flyspray"></a><span class="bold"><strong>Flyspray</strong></span> &#8212; <a class="ulink" href="http://www.flyspray.org/" target="_top">http://www.flyspray.org/</a></h3></div></div></div><p>Flyspray&#26159;&#19968;&#20010;&#20351;&#29992;PHP&#32534;&#20889;&#30340;&#22522;&#20110;web&#30340;bug&#36319;&#36394;&#31995;&#32479;&#12290;&#23427;&#30340;&#32593;&#39029;&#23558;&#20854;&#25551;&#36848;&#20026;&#8220;&#38750;&#22797;&#26434;&#30340;&#8221;&#65292;&#29305;&#24615;&#21015;&#34920;&#21253;&#25324;&#65306;&#25903;&#25345;&#22810;&#31181;&#25968;&#25454;&#24211;&#65288;&#30446;&#21069;&#25903;&#25345;MySQL&#21644;PGSQL&#65289;&#65307;&#22810;&#39033;&#30446;&#65307;&#8216;&#20851;&#27880;&#8217;&#20219;&#21153;&#65292;&#21253;&#25324;&#21457;&#29983;&#21464;&#26356;&#26102;&#25552;&#37266;&#65288;&#36890;&#36807;email&#25110;Jabber&#65289;&#65307;&#22797;&#26434;&#30340;&#20219;&#21153;&#21382;&#21490;&#65307;CSS&#20027;&#39064;&#65307;&#25991;&#20214;&#38468;&#20214;&#65307;&#39640;&#32423;&#25628;&#32034;&#29305;&#24615;&#65288;&#31616;&#21333;&#26131;&#29992;&#65289;&#65307;RSS/Atom&#20379;&#31295;&#65307;wiki&#21644;&#32431;&#25991;&#26412;&#36755;&#20837;&#65307;&#34920;&#20915;&#65307;&#20381;&#36182;&#22270;&#34920;&#12290;</p></div><div class="sect2" title="Scarab &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-scarab"></a><span class="bold"><strong>Scarab</strong></span> &#8212; <a class="ulink" href="http://scarab.tigris.org/" target="_top">http://scarab.tigris.org/</a></h3></div></div></div><p>Scarab&#26159;&#19968;&#20010;&#39640;&#24230;&#21487;&#33258;&#23450;&#20041;&#30340;&#65292;&#23436;&#20840;&#29305;&#24615;&#30340;bug&#36319;&#36394;&#31995;&#32479;&#65292;&#25552;&#20379;&#20102;&#20854;&#20182;bug&#36319;&#36394;&#31995;&#32479;&#25152;&#25903;&#25345;&#30340;&#29305;&#24615;&#30340;&#32452;&#21512;&#65306;&#25968;&#25454;&#26465;&#30446;&#12289;&#26597;&#35810;&#12289;&#25253;&#21578;&#12289;&#30456;&#20851;&#26041;&#36890;&#30693;&#12289;&#35780;&#35770;&#30340;&#20132;&#20114;&#24335;&#32047;&#21152;&#21644;&#20381;&#36182;&#36319;&#36394;&#12290;</p><p>&#23427;&#26159;&#36890;&#36807;&#31649;&#29702;web&#32593;&#39029;&#23454;&#29616;&#30340;&#12290;&#22312;&#21333;&#20010;Scarab&#23433;&#35013;&#20013;&#20320;&#21487;&#20197;&#26377;&#22810;&#20010;&#8220;&#27169;&#22359;&#8221;&#65288;&#39033;&#30446;&#65289;&#12290;&#22312;&#32473;&#23450;&#27169;&#22359;&#20013;&#65292;&#20320;&#21487;&#20197;&#21019;&#24314;&#26032;&#30340;&#38382;&#39064;&#31867;&#22411;&#65288;&#32570;&#38519;&#12289;&#25913;&#36827;&#12289;&#20219;&#21153;&#21644;&#25903;&#25345;&#35831;&#27714;&#31561;&#65289;&#12290;&#24182;&#21487;&#20197;&#22686;&#21152;&#20219;&#24847;&#23646;&#24615;&#65292;&#20197;&#28385;&#36275;&#20320;&#30340;&#39033;&#30446;&#29305;&#23450;&#38656;&#27714;&#12290;</p><p>2004&#26411;&#65292;Scarab&#24050;&#32463;&#25509;&#36817;&#20110;1.0&#21457;&#24067;&#29256;&#26412;&#12290;</p></div><div class="sect2" title="Debian Bug&#36319;&#36394;&#31995;&#32479;&#65288;DBTS&#65289; &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-dbts"></a><span class="bold"><strong>Debian Bug&#36319;&#36394;&#31995;&#32479;&#65288;DBTS&#65289;</strong></span> &#8212; <a class="ulink" href="http://www.chiark.greenend.org.uk/~ian/debbugs/" target="_top">http://www.chiark.greenend.org.uk/~ian/debbugs/</a></h3></div></div></div><p>Debian Bug&#36319;&#36394;&#31995;&#32479;&#30340;&#19981;&#23547;&#24120;&#20043;&#22788;&#22312;&#20110;&#25152;&#26377;&#38382;&#39064;&#30340;&#36755;&#20837;&#21644;&#22788;&#29702;&#37117;&#26159;&#36890;&#36807;&#37038;&#20214;&#23436;&#25104;&#65306;&#27599;&#20010;&#38382;&#39064;&#37117;&#26377;&#33258;&#24049;&#30340;&#19987;&#29992;&#37038;&#20214;&#22320;&#22336;&#12290;DBTS&#30340;&#25193;&#23637;&#24615;&#24456;&#22909;&#65306;&#20363;&#22914;<a class="ulink" href="http://bugs.debian.org/" target="_top">http://bugs.debian.org/</a>&#26377;277,741&#20010;&#38382;&#39064;&#12290;</p><p>&#22240;&#20026;&#20132;&#20114;&#26159;&#36890;&#36807;&#26222;&#36890;&#30340;&#37038;&#20214;&#23458;&#25143;&#31471;&#65292;&#36825;&#20010;&#22823;&#22810;&#25968;&#20154;&#37117;&#29087;&#24713;&#24182;&#21487;&#20197;&#36731;&#26494;&#35775;&#38382;&#30340;&#24037;&#20855;&#23436;&#25104;&#30340;&#65292;DBTS&#38750;&#24120;&#36866;&#21512;&#22788;&#29702;&#38656;&#35201;&#24555;&#36895;&#20998;&#31867;&#21644;&#21709;&#24212;&#30340;&#22823;&#35268;&#27169;&#25968;&#25454;&#12290;&#24403;&#28982;&#20063;&#26377;&#32570;&#28857;&#12290;&#24320;&#21457;&#32773;&#38656;&#35201;&#33457;&#36153;&#26102;&#38388;&#23398;&#20064;&#37038;&#20214;&#21629;&#20196;&#31995;&#32479;&#65292;&#29992;&#25143;&#24517;&#39035;&#22312;&#27809;&#26377;&#24341;&#23548;&#20182;&#20204;&#36873;&#25321;&#32534;&#20889;&#20449;&#24687;&#30340;web&#34920;&#21333;&#30340;&#24773;&#20917;&#19979;&#32534;&#20889;bug&#25253;&#21578;&#12290;&#20063;&#26377;&#24037;&#20855;&#21487;&#20197;&#24110;&#21161;&#29992;&#25143;&#21457;&#36865;&#26356;&#22909;&#30340;bug&#25253;&#21578;&#65292;&#20363;&#22914;&#21629;&#20196;&#34892;&#12290;<span class="command"><strong>reportbug</strong></span>&#31243;&#24207;&#25110;Emacs&#30340;&#21253;<code class="systemitem">debbugs-el</code>&#12290;&#20294;&#22823;&#22810;&#25968;&#29992;&#25143;&#19981;&#20250;&#20351;&#29992;&#36825;&#20010;&#24037;&#20855;&#65307;&#20182;&#20204;&#21482;&#20250;&#25163;&#24037;&#32534;&#20889;&#37038;&#20214;&#65292;&#20182;&#20204;&#21487;&#33021;&#26377;&#65292;&#20063;&#21487;&#33021;&#27809;&#26377;&#36981;&#24490;&#20320;&#30340;&#39033;&#30446;&#25152;&#21457;&#24067;&#30340;bug&#25253;&#21578;&#25351;&#21335;&#12290;</p><p>DBTS&#26377;&#19968;&#20010;&#21482;&#35835;&#30340;web&#30028;&#38754;&#65292;&#29992;&#20110;&#26597;&#30475;&#21644;&#26597;&#35810;&#38382;&#39064;&#12290;</p></div><div class="sect2" title="Trouble-Ticket Trackers"><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-trouble-ticket-trackers"></a><span class="bold"><strong>Trouble-Ticket Trackers</strong></span></h3></div></div></div><p>&#36825;&#26356;&#20687;&#26159;&#19968;&#20010;&#38754;&#21521;&#26381;&#21153;&#21488;&#30340;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#65292;&#32780;&#19981;&#26159;&#36719;&#20214;bug&#36319;&#36394;&#12290;&#20320;&#25110;&#35768;&#21487;&#20197;&#22312;&#26222;&#36890;&#30340;bug&#36319;&#36394;&#20013;&#27491;&#24120;&#24037;&#20316;&#65292;&#20294;&#26159;&#22240;&#20026;&#23436;&#25972;&#24615;&#36825;&#37324;&#35201;&#21015;&#20986;&#65292;&#22240;&#20026;&#21487;&#20197;&#29702;&#35299;&#26576;&#20010;&#38750;&#21516;&#19968;&#33324;&#30340;&#39033;&#30446;&#21487;&#33021;&#26356;&#38656;&#35201;&#19968;&#20010;trouble-ticket&#31995;&#32479;&#65292;&#32780;&#19981;&#26159;&#20256;&#32479;&#30340;bug&#36319;&#36394;&#12290;</p><p>
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>WebCall</strong></span> &#8212; <a class="ulink" href="http://myrapid.com/webcall/" target="_top">http://myrapid.com/webcall/</a></p></li><li class="listitem"><p><span class="bold"><strong>Teacup</strong></span> &#8212; <a class="ulink" href="http://www.altara.org/teacup.html" target="_top">http://www.altara.org/teacup.html</a></p><p>&#65288;Teacup&#22909;&#20687;&#24050;&#32463;&#19981;&#20877;&#32487;&#32493;&#24320;&#21457;&#20102;&#65292;&#20294;&#26159;&#36824;&#26377;&#19979;&#36733;&#12290;&#35831;&#27880;&#24847;&#23427;&#21516;&#26102;&#25317;&#26377;web&#21644;&#37038;&#20214;&#30028;&#38754;&#12290;&#65289;</p></li></ul></div><p>
</p></div><div class="sect2" title="Bluetail Ticket Tracker (BTT) &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="bugtrackers-bluetail"></a><span class="bold"><strong>Bluetail Ticket Tracker (BTT)</strong></span> &#8212; <a class="ulink" href="http://btt.sourceforge.net/" target="_top">http://btt.sourceforge.net/</a></h3></div></div></div><p>BTT&#31639;&#26159;&#22788;&#20110;&#26631;&#20934;trouble-ticket tracker&#21644;bug&#36319;&#36394;&#20043;&#38388;&#12290;&#23427;&#25552;&#20379;&#20102;&#38544;&#31169;&#29305;&#24615;&#65292;&#36825;&#22312;&#24320;&#28304;bug&#36319;&#36394;&#20013;&#24182;&#19981;&#24120;&#35265;&#65306;&#31995;&#32479;&#30340;&#29992;&#25143;&#34987;&#20998;&#20026;Staff&#12289;Friend&#12289;Customer&#25110;Anonymous&#65292;&#21462;&#20915;&#20110;&#19981;&#21516;&#30340;&#31867;&#21035;&#65292;&#20250;&#26377;&#25110;&#22810;&#25110;&#23569;&#30340;&#25968;&#25454;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#20123;&#37038;&#20214;&#38598;&#25104;&#65292;&#19968;&#20010;&#21629;&#20196;&#34892;&#30028;&#38754;&#21644;&#23558;&#37038;&#20214;&#36716;&#21270;&#20026;&#38382;&#39064;&#30340;&#26426;&#21046;&#12290;&#23427;&#20063;&#25552;&#20379;&#20102;&#19968;&#31181;&#32500;&#25252;&#19982;&#29305;&#23450;&#38382;&#39064;&#19981;&#30456;&#20851;&#20449;&#24687;&#30340;&#29305;&#24615;&#65292;&#20363;&#22914;&#20869;&#37096;&#25991;&#26723;&#25110;FAQ&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="vc-systems.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bikeshed-full.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;</td></tr></table></div></body></html>
