<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="communications.html" title="Chapter 6. &#20132;&#27969;"><link rel="prev" href="communications.html" title="Chapter 6. &#20132;&#27969;"><link rel="next" href="difficult-people.html" title="&#21050;&#20799;&#22836;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="communications.html">Prev</a> </td><th width="60%" align="center">Chapter 6. &#20132;&#27969;</th><td width="20%" align="right"> <a accesskey="n" href="difficult-people.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="common-pitfalls"></a>&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;</h2></div></div></div><div class="sect2" title="&#19981;&#35201;&#21457;&#34920;&#26080;&#30446;&#30340;&#30340;&#25991;&#31456;"><div class="titlepage"><div><div><h3 class="title"><a name="post-with-purpose"></a>&#19981;&#35201;&#21457;&#34920;&#26080;&#30446;&#30340;&#30340;&#25991;&#31456;</h3></div></div></div><p>&#22312;&#32447;&#39033;&#30446;&#20013;&#19968;&#20010;&#24120;&#35265;&#30340;&#38519;&#38449;&#26159;&#35748;&#20026;&#20320;&#38656;&#35201;&#22238;&#22797;&#25152;&#26377;&#30340;&#19996;&#35199;&#12290;&#20320;&#19981;&#24517;&#22914;&#27492;&#12290;&#39318;&#20808;&#65292;&#19968;&#33324;&#20250;&#26377;&#22826;&#22810;&#20320;&#26080;&#27861;&#21516;&#26102;&#36319;&#36394;&#30340;&#32447;&#32034;&#65292;&#33267;&#23569;&#26159;&#32463;&#36807;&#23427;&#24320;&#22987;&#30340;&#20960;&#20010;&#26376;&#21518;&#12290;&#20854;&#27425;&#65292;&#21363;&#20351;&#20320;&#24050;&#32463;&#20915;&#23450;&#21442;&#19982;&#65292;&#20154;&#20204;&#35828;&#30340;&#22823;&#22810;&#25968;&#35805;&#37117;&#26080;&#38656;&#22238;&#24212;&#12290;&#24320;&#21457;&#35770;&#22363;&#37117;&#20250;&#19981;&#21516;&#31243;&#24230;&#30340;&#30001;&#19979;&#21015;&#19977;&#31867;&#20449;&#24687;&#21344;&#25454;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#25552;&#20986;&#37325;&#35201;&#20107;&#29289;&#30340;&#20449;&#24687;</p></li><li class="listitem"><p>&#25552;&#20986;&#23545;&#20182;&#20154;&#26366;&#32463;&#35828;&#36807;&#30340;&#35805;&#34920;&#31034;&#25903;&#25345;&#25110;&#21453;&#23545;&#30340;&#20449;&#24687;</p></li><li class="listitem"><p>&#24635;&#32467;&#20449;&#24687;</p></li></ol></div><p>&#19978;&#36848;&#20449;&#24687;&#24182;&#19981;&#26159;<span class="emphasis"><em>&#24517;&#23450;</em></span>&#38656;&#35201;&#19968;&#20010;&#22238;&#24212;&#65292;&#29305;&#21035;&#26159;&#24403;&#20320;&#26681;&#25454;&#21040;&#30446;&#21069;&#20026;&#27490;&#30340;&#32447;&#32034;&#65292;&#24456;&#30830;&#23450;&#20854;&#20182;&#20154;&#20250;&#35828;&#20986;&#20197;&#21069;&#20320;&#35828;&#36807;&#30340;&#35805;&#26102;&#12290; &#65288;&#22914;&#26524;&#20320;&#25285;&#24515;&#21035;&#20154;&#20063;&#20351;&#29992;&#36825;&#20010;&#31574;&#30053;&#65292;&#32780;&#33853;&#20837;&#31561;&#24453;-&#31561;&#24453;&#30340;&#24490;&#29615;&#65292;&#19981;&#24517;&#22914;&#27492;&#65307;&#20960;&#20046;&#24635;&#20250;&#26377;<span class="emphasis"><em>&#26576;&#20154;</em></span>&#24895;&#24847;&#36339;&#20986;&#26469;&#35299;&#20915;&#38382;&#39064;&#12290;&#65289; &#22238;&#22797;&#24212;&#35813;&#30001;&#26126;&#30830;&#30340;&#30446;&#30340;&#28608;&#21457;&#12290;&#39318;&#20808;&#35201;&#38382;&#33258;&#24049;&#65292;&#26159;&#21542;&#30693;&#36947;&#25152;&#26399;&#26395;&#30340;&#23436;&#25104;&#30340;&#20219;&#21153;&#65311;&#20854;&#27425;&#65292;&#26159;&#21542;&#22914;&#26524;&#27809;&#26377;&#20320;&#30340;&#35805;&#65292;&#36825;&#20010;&#20107;&#24773;&#23601;&#26080;&#27861;&#23436;&#25104;&#12290;</p><p>&#22312;&#32447;&#32034;&#20013;&#21457;&#20986;&#20320;&#30340;&#22768;&#38899;&#30340;&#26377;&#20004;&#20010;&#29702;&#30001;&#65292;&#21253;&#25324;a) &#24403;&#20320;&#22312;&#25552;&#35758;&#20013;&#21457;&#29616;&#20102;&#19968;&#20010;&#29781;&#30133;&#65292;&#20320;&#24576;&#30097;&#20320;&#26159;&#21807;&#19968;&#30475;&#21040;&#23427;&#30340;&#20154;&#65292;&#21478;&#22806;b) &#20320;&#21457;&#29616;&#20182;&#20154;&#20043;&#38388;&#38169;&#35823;&#20132;&#27969;&#65292;&#24182;&#19988;&#30693;&#36947;&#20320;&#21487;&#20197;&#36890;&#36807;&#28548;&#28165;&#25991;&#31456;&#20462;&#27491;&#23427;&#12290;&#36890;&#24120;&#22312;&#37038;&#20214;&#20013;&#20165;&#20165;&#34920;&#26126;&#23545;&#26576;&#20154;&#24037;&#20316;&#30340;&#24863;&#35874;&#25110;&#32773;&#21482;&#26159;&#35828;&#8220;&#25105;&#20063;&#26159;&#65281;&#8221;&#65292;&#22240;&#20026;&#35835;&#32773;&#21487;&#20197;&#31435;&#21051;&#30830;&#35748;&#27492;&#31867;&#25991;&#31456;&#26080;&#38656;&#20219;&#20309;&#22238;&#24212;&#25110;&#36827;&#19968;&#27493;&#30340;&#21160;&#20316;&#65292;&#25152;&#20197;&#24403;&#35835;&#32773;&#36798;&#21040;&#37038;&#20214;&#30340;&#26368;&#21518;&#19968;&#34892;&#65292;&#19968;&#20010;&#24178;&#20928;&#30340;&#32467;&#26463;&#31526;&#21512;&#20182;&#30340;&#24515;&#29702;&#38656;&#27714;&#12290;&#20294;&#26159;&#21363;&#20351;&#21040;&#20102;&#27492;&#26102;&#65292;&#35828;&#35805;&#20043;&#21069;&#20063;&#35201;&#20877;&#19977;&#32771;&#34385;&#65307;&#19968;&#23450;&#35201;&#35753;&#21035;&#20154;&#35273;&#24471;&#20320;&#35828;&#30340;&#22826;&#22810;&#32780;&#19981;&#26159;&#22826;&#23569;&#12290;&#65288;&#22312;&#24537;&#30860;&#30340;&#37038;&#20214;&#21015;&#34920;&#20013;&#24037;&#20316;&#30340;&#26356;&#22810;&#24819;&#27861;&#30340;&#31532;&#20108;&#37096;&#20998;&#35831;&#30475;<a class="xref" href="bikeshed-full.html" title="Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;">Appendix C, <i>&#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;</i></a>&#65289;</p></div><div class="sect2" title="&#22810;&#20135;VS&#38750;&#22810;&#20135;&#30340;&#32447;&#32034;"><div class="titlepage"><div><div><h3 class="title"><a name="productive-threads"></a>&#22810;&#20135;VS&#38750;&#22810;&#20135;&#30340;&#32447;&#32034;</h3></div></div></div><p>&#22312;&#24537;&#30860;&#30340;&#37038;&#20214;&#21015;&#34920;&#20013;&#65292;&#20320;&#26377;&#20004;&#20010;&#35819;&#21629;&#12290;&#31532;&#19968;&#65292;&#24456;&#26126;&#26174;&#65292;&#35201;&#25351;&#20986;&#21738;&#20123;&#38656;&#35201;&#20851;&#27880;&#65292;&#21738;&#20123;&#38656;&#35201;&#24573;&#30053;&#12290;&#31532;&#20108;&#65292;&#35201;&#36991;&#20813;<span class="emphasis"><em>&#20135;&#29983;</em></span>&#22122;&#38899;&#30340;&#26041;&#24335;&#65306;&#19981;&#20165;&#20165;&#26159;&#20320;&#24076;&#26395;&#33258;&#24049;&#30340;&#25991;&#31456;&#20445;&#25345;&#36739;&#39640;&#30340;&#20449;&#22122;&#27604;&#65292;&#20320;&#20063;&#24076;&#26395;&#36825;&#20123;&#20449;&#24687;&#21487;&#20197;&#21050;&#28608;<span class="emphasis"><em>&#20854;&#20182;</em></span>&#20154;&#20063;&#20445;&#25345;&#21516;&#26679;&#30340;&#20449;&#22122;&#27604;&#65292;&#25110;&#32773;&#24178;&#33030;&#19981;&#21457;&#34920;&#25991;&#31456;&#12290;</p><p>&#20026;&#20102;&#23637;&#31034;&#36825;&#26159;&#22914;&#20309;&#21457;&#29983;&#30340;&#65292;&#32771;&#34385;&#19968;&#19979;&#20107;&#24773;&#21457;&#29983;&#30340;&#19978;&#19979;&#25991;&#12290;&#38750;&#22810;&#20135;&#30340;&#32447;&#32034;&#30340;&#29305;&#24449;&#26159;&#20160;&#20040;&#65311;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#21457;&#29983;&#30340;&#20105;&#35770;&#26159;&#22312;&#37325;&#22797;&#65292;&#20223;&#20315;&#21457;&#24067;&#32773;&#35748;&#20026;&#27809;&#26377;&#20154;&#21548;&#35828;&#36807;&#12290;</p></li><li class="listitem"><p>&#38543;&#30528;&#36172;&#27880;&#30340;&#32553;&#23567;&#65292;&#22840;&#22823;&#21644;&#36830;&#32047;&#30340;&#21319;&#32423;&#12290;</p></li><li class="listitem"><p>&#22823;&#37096;&#20998;&#35780;&#35770;&#26469;&#33258;&#20570;&#36807;&#24456;&#23569;&#20107;&#24773;&#25110;&#27809;&#20570;&#36807;&#20107;&#24773;&#30340;&#20154;&#65292;&#32780;&#33021;&#24110;&#21161;&#23436;&#25104;&#20107;&#24773;&#30340;&#20154;&#21017;&#20445;&#25345;&#27785;&#40664;&#12290;</p></li><li class="listitem"><p>&#22823;&#22810;&#25968;&#24819;&#27861;&#30340;&#35752;&#35770;&#37117;&#27809;&#26377;&#20316;&#20986;&#26126;&#30830;&#30340;&#25552;&#35758;&#12290; &#65288;&#24403;&#28982;&#65292;&#20219;&#20309;&#26377;&#36259;&#30340;&#24819;&#27861;&#37117;&#26159;&#20174;&#19981;&#28165;&#26224;&#30340;&#36828;&#35265;&#24320;&#22987;&#65307;&#37325;&#35201;&#30340;&#38382;&#39064;&#26159;&#20043;&#21518;&#30340;&#26041;&#21521;&#12290;&#35752;&#35770;&#26159;&#21542;&#23558;&#36828;&#35265;&#21464;&#24471;&#26356;&#20855;&#20307;&#65292;&#25110;&#32773;&#20998;&#35010;&#20026;&#26356;&#23567;&#30340;&#36828;&#35265;&#65292;&#21103;&#36828;&#35265;&#21644;&#26412;&#20307;&#35770;&#30340;&#20105;&#35770;&#65311;&#65289;</p></li></ul></div><p>&#19981;&#35201;&#22240;&#20026;&#26576;&#20010;&#32447;&#32034;&#24320;&#22987;&#19981;&#22815;&#22810;&#20135;&#32780;&#35748;&#20026;&#23427;&#26159;&#28010;&#36153;&#26102;&#38388;&#12290;&#23427;&#21487;&#33021;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#20027;&#39064;&#65292;&#27491;&#22240;&#20026;&#20182;&#38750;&#24120;&#26840;&#25163;&#25152;&#20197;&#38590;&#20197;&#20570;&#20986;&#36827;&#23637;&#12290;</p><p>&#23558;&#32447;&#32034;&#24341;&#21521;&#26377;&#29992;&#32780;&#19981;&#26159;&#34542;&#24178;&#26159;&#19968;&#39033;&#33402;&#26415;&#65292;&#20165;&#20165;&#26159;&#21578;&#35785;&#20154;&#20204;&#19981;&#35201;&#28010;&#36153;&#26102;&#38388;&#65292;&#25110;&#32773;&#21578;&#35785;&#20182;&#20204;&#22312;&#27809;&#26377;&#24418;&#25104;&#24314;&#35774;&#24615;&#30340;&#20869;&#23481;&#21069;&#19981;&#35201;&#35828;&#35805;&#24182;&#27809;&#26377;&#29992;&#12290;&#20320;&#25110;&#35768;&#21487;&#20197;&#22312;&#31169;&#19979;&#36825;&#26679;&#24819;&#19968;&#24819;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#22823;&#22768;&#30340;&#35828;&#20986;&#26469;&#23601;&#20250;&#25104;&#20026;&#19968;&#31181;&#20882;&#29359;&#12290;&#30456;&#21453;&#65292;&#20320;&#24517;&#39035;&#20419;&#25104;&#36827;&#19968;&#27493;&#36827;&#23637;&#30340;&#26465;&#20214;&#8212;&#32473;&#20154;&#20204;&#19968;&#26465;&#36335;&#65292;&#19968;&#26465;&#21487;&#20197;&#23558;&#32467;&#26524;&#23548;&#21521;&#26399;&#26395;&#30340;&#36335;&#65292;&#32780;&#26080;&#38656;&#21457;&#20986;&#25351;&#25381;&#21629;&#20196;&#12290;&#36825;&#26679;&#30340;&#22522;&#35843;&#23558;&#20250;&#22823;&#20026;&#19981;&#21516;&#12290;&#20363;&#22914;&#65292;&#36825;&#26679;&#24456;&#19981;&#22909;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#36825;&#20010;&#35752;&#35770;&#24050;&#32463;&#36305;&#30340;&#28459;&#26080;&#36793;&#38469;&#20102;&#12290;&#25105;&#20204;&#21487;&#20197;&#26242;&#20572;&#36825;&#20010;&#20027;&#39064;&#65292;&#30452;&#21040;&#26576;&#20154;&#33021;&#22815;&#25552;&#20132;&#19968;&#20010;&#34917;&#19969;&#23454;&#29616;&#36825;&#20123;&#24314;&#35758;&#21527;&#65311;&#27809;&#26377;&#29702;&#30001;&#32487;&#32493;&#21453;&#22797;&#35828;&#21516;&#19968;&#20214;&#20107;&#24773;&#12290;&#20195;&#30721;&#27604;&#21333;&#35789;&#26356;&#26377;&#21147;&#65292;&#20249;&#35745;&#20204;&#12290;</em></span></p></blockquote></div><p>&#28982;&#32780;&#36825;&#26679;&#24456;&#22909;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#32447;&#32034;&#28014;&#29616;&#20986;&#20102;&#22810;&#20010;&#25552;&#35758;&#65292;&#20294;&#37117;&#27809;&#26377;&#23436;&#25104;&#25152;&#26377;&#30340;&#32454;&#33410;&#65292;&#33267;&#23569;&#36824;&#19981;&#36275;&#20197;&#24418;&#25104;&#34920;&#20915;&#12290;&#28982;&#32780;&#29616;&#22312;&#25105;&#20204;&#20063;&#35828;&#19981;&#20986;&#26032;&#19996;&#35199;&#20102;&#65307;&#21482;&#26159;&#22312;&#21453;&#22797;&#37325;&#22797;&#20197;&#21069;&#35828;&#36807;&#30340;&#19996;&#35199;&#12290;&#27492;&#26102;&#65292;&#20026;&#20102;&#36827;&#19968;&#27493;&#30340;&#35752;&#35770;&#65292;&#26368;&#22909;&#25552;&#20379;&#25552;&#35758;&#30340;&#23436;&#25972;&#35268;&#26684;&#25110;&#34917;&#19969;&#12290;&#28982;&#21518;&#25105;&#20204;&#33267;&#23569;&#26377;&#26126;&#30830;&#30340;&#21160;&#20316;&#21487;&#20197;&#20570;&#65288;&#21363;&#23545;&#35268;&#26684;&#36798;&#25104;&#19968;&#33268;&#65292;&#25110;&#24212;&#29992;&#21644;&#27979;&#35797;&#34917;&#19969;&#65289;&#12290;</em></span></p></blockquote></div><p>&#31532;&#20108;&#31181;&#26041;&#27861;&#19982;&#31532;&#19968;&#31181;&#26041;&#27861;&#23436;&#20840;&#30456;&#21453;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#19981;&#20250;&#35753;&#20320;&#19982;&#20182;&#20154;&#21457;&#29983;&#32852;&#31995;&#65292;&#20063;&#19981;&#35201;&#25351;&#36131;&#20182;&#20204;&#23558;&#35752;&#35770;&#24102;&#20837;&#20102;&#34746;&#26059;&#12290;&#26080;&#35770;&#20320;&#22312;&#20043;&#21069;&#26159;&#21542;&#21442;&#19982;&#21040;&#32447;&#32034;&#30340;&#35752;&#35770;&#65292;&#37117;&#35201;&#35828;&#26159;&#8220;&#25105;&#20204;&#8221;&#65292;&#22240;&#20026;&#21363;&#20351;&#20320;&#19968;&#30452;&#22312;&#32447;&#32034;&#20013;&#20445;&#25345;&#27785;&#40664;&#65292;&#32447;&#32034;&#30340;&#32467;&#26524;&#20063;&#26377;&#20320;&#30340;&#20221;&#12290;&#23427;&#25551;&#36848;&#20102;&#20026;&#20160;&#20040;&#32447;&#32034;&#21040;&#20102;&#20044;&#26377;&#20043;&#22320;&#65292;&#36825;&#26679;&#20570;&#24182;&#27809;&#26377;&#36731;&#34065;&#25110;&#21028;&#20915;&#30340;&#21547;&#20041;&#8212;&#23427;&#21482;&#26159;&#19981;&#24102;&#24863;&#24773;&#30340;&#23545;&#20107;&#23454;&#30340;&#25551;&#36848;&#12290;&#26368;&#37325;&#35201;&#30340;&#65292;&#23427;&#25552;&#20379;&#20102;&#19968;&#20010;&#34892;&#21160;&#30340;&#27491;&#38754;&#35838;&#31243;&#65292;&#36825;&#26679;&#20154;&#20204;&#23601;&#19981;&#20250;&#24863;&#35273;&#21040;&#35752;&#35770;&#34987;&#20851;&#38381;&#20102;&#65288;&#23545;&#20110;&#20182;&#20204;&#21487;&#20197;&#34987;&#35825;&#24785;&#21435;&#36896;&#21453;&#30340;&#38480;&#21046;&#65289;&#65292;&#32780;&#20250;&#24863;&#21040;&#33719;&#24471;&#20102;&#19968;&#20010;&#26041;&#27861;&#21487;&#20197;&#23558;&#23545;&#35805;&#24102;&#20837;&#26356;&#26377;&#24314;&#35774;&#24615;&#30340;&#27700;&#24179;&#12290;&#36825;&#26159;&#20154;&#20204;&#33258;&#28982;&#20250;&#26399;&#26395;&#36935;&#21040;&#30340;&#26631;&#20934;&#12290;</p><p>&#20320;&#19981;&#20250;&#19968;&#30452;&#24076;&#26395;&#35753;&#32447;&#31243;&#36827;&#20837;&#26356;&#26377;&#24314;&#35774;&#24615;&#30340;&#27700;&#24179;&#8212;&#26377;&#26102;&#65292;&#20320;&#21482;&#26159;&#24076;&#26395;&#23427;&#36214;&#24555;&#31163;&#24320;&#12290;&#25991;&#31456;&#30340;&#30446;&#30340;&#21482;&#26159;&#20174;&#20013;&#36873;&#25321;&#19968;&#20010;&#65292;&#25918;&#24323;&#21478;&#19968;&#20010;&#12290;&#22914;&#26524;&#20320;&#33021;&#26029;&#23450;&#32447;&#32034;&#31163;&#39064;&#22826;&#36828;&#65292;&#32780;&#19988;&#27809;&#26377;&#33021;&#23454;&#38469;&#19978;<span class="emphasis"><em>&#21435;</em></span>&#23436;&#25104;&#20320;&#25152;&#24314;&#35758;&#30340;&#27493;&#39588;&#65292;&#37027;&#20040;&#20320;&#30340;&#25991;&#31456;&#20250;&#26377;&#25928;&#30340;&#32456;&#27490;&#32447;&#32034;&#65292;&#32780;&#19988;&#19981;&#38656;&#35201;&#36825;&#26679;&#20570;&#12290;&#24403;&#28982;&#65292;&#27809;&#26377;&#20851;&#38381;&#32447;&#32034;&#30340;&#23433;&#20840;&#26041;&#27861;&#65292;&#21363;&#20351;&#26377;&#65292;&#20320;&#20063;&#19981;&#20250;&#24076;&#26395;&#21435;&#20351;&#29992;&#12290;&#20294;&#26159;&#35810;&#38382;&#21442;&#19982;&#32773;&#22312;&#20316;&#20986;&#21487;&#35265;&#30340;&#36827;&#23637;&#21644;&#20572;&#27490;&#35752;&#35770;&#20043;&#38388;&#20570;&#20986;&#36873;&#25321;&#21017;&#26159;&#23436;&#32654;&#21487;&#38450;&#21355;&#30340;&#65292;&#22914;&#26524;&#21487;&#20197;&#22278;&#28369;&#23436;&#25104;&#30340;&#35805;&#12290;&#28982;&#32780;&#65292;&#36824;&#26159;&#35201;&#23567;&#24515;&#27704;&#20037;&#30340;&#24179;&#24687;&#32447;&#32034;&#12290;&#19968;&#20123;&#32431;&#29702;&#35770;&#30340;&#35752;&#35770;&#21487;&#33021;&#20250;&#21313;&#20998;&#22810;&#20135;&#65292;&#21462;&#20915;&#20110;&#20027;&#39064;&#65292;&#32780;&#19988;&#22914;&#26524;&#36807;&#24555;&#30340;&#35201;&#27714;&#35299;&#20915;&#20063;&#20250;&#25212;&#26432;&#21019;&#36896;&#36807;&#31243;&#65292;&#20063;&#20250;&#35753;&#20320;&#30475;&#36215;&#26469;&#19981;&#22815;&#32784;&#24515;&#12290;</p><p>&#19981;&#35201;&#26399;&#26395;&#32447;&#32034;&#20250;&#31435;&#21051;&#20572;&#27490;&#12290;&#22312;&#20320;&#30340;&#25991;&#31456;&#20043;&#21518;&#65292;&#36824;&#26159;&#20250;&#26377;&#20123;&#25991;&#31456;&#65292;&#19968;&#26041;&#38754;&#22240;&#20026;&#37038;&#20214;&#26159;&#25490;&#38431;&#20256;&#36882;&#30340;&#65292;&#21478;&#19968;&#26041;&#38754;&#26159;&#22240;&#20026;&#20154;&#20204;&#24819;&#35828;&#26368;&#21518;&#19968;&#21477;&#35805;&#12290;&#19981;&#24517;&#20026;&#27492;&#25285;&#24515;&#65292;&#20320;&#19981;&#29992;&#20877;&#35828;&#19968;&#36941;&#12290;&#21482;&#38656;&#35201;&#35753;&#23427;&#36880;&#28176;&#28040;&#22833;&#25110;&#19981;&#28040;&#22833;&#65292;&#36825;&#21462;&#20915;&#20110;&#20855;&#20307;&#30340;&#24773;&#20917;&#12290;&#20320;&#19981;&#21487;&#33021;&#26377;&#23436;&#20840;&#30340;&#25511;&#21046;&#65307;&#21478;&#19968;&#26041;&#38754;&#65292;&#20320;&#21487;&#20197;&#26399;&#26395;&#22312;&#22823;&#37327;&#32447;&#32034;&#30340;&#32479;&#35745;&#19978;&#26377;&#26174;&#33879;&#30340;&#25928;&#26524;&#12290;</p></div><div class="sect2" title="&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;"><div class="titlepage"><div><div><h3 class="title"><a name="bikeshed"></a>&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;</h3></div></div></div><p>&#23613;&#31649;&#35752;&#35770;&#20250;&#22312;&#20219;&#20309;&#20027;&#39064;&#19978;&#32531;&#24930;&#21069;&#36827;&#65292;&#20294;&#26159;&#38543;&#30528;&#20027;&#39064;&#25216;&#26415;&#38590;&#24230;&#30340;&#38477;&#20302;&#65292;&#32531;&#24930;&#21069;&#36827;&#30340;&#21487;&#33021;&#24615;&#23601;&#36234;&#39640;&#12290;&#27605;&#31455;&#65292;&#25216;&#26415;&#38590;&#24230;&#36234;&#22823;&#65292;&#33021;&#22815;&#29702;&#35299;&#30340;&#21442;&#19982;&#32773;&#20063;&#23601;&#36234;&#23569;&#12290;&#36825;&#20123;&#21442;&#19982;&#32773;&#26356;&#26377;&#21487;&#33021;&#26159;&#26368;&#26377;&#32463;&#39564;&#30340;&#24320;&#21457;&#32773;&#65292;&#20182;&#20204;&#24050;&#32463;&#21442;&#21152;&#36807;&#26080;&#25968;&#27425;&#36825;&#26679;&#30340;&#35752;&#35770;&#65292;&#30693;&#36947;&#22914;&#20309;&#25165;&#33021;&#19982;&#27599;&#20010;&#20154;&#36798;&#25104;&#20849;&#35782;&#12290;</p><p>&#22240;&#27492;&#65292;&#22914;&#26524;&#25216;&#26415;&#38382;&#39064;&#26131;&#20110;&#29702;&#35299;&#25110;&#23481;&#26131;&#24471;&#20986;&#33258;&#24049;&#30340;&#24847;&#35265;&#65292;&#25110;&#32773;&#26159;&#35832;&#22914;&#32452;&#32455;&#12289;&#20844;&#24320;&#24615;&#21644;&#36164;&#37329;&#30340;&#36719;&#20027;&#39064;&#65292;&#23601;&#24456;&#38590;&#36798;&#25104;&#20849;&#35782;&#12290;&#20154;&#20204;&#21487;&#20197;&#27704;&#36828;&#21442;&#19982;&#21040;&#36825;&#31181;&#36777;&#35770;&#20013;&#65292;&#22240;&#20026;&#36825;&#20107;&#27809;&#26377;&#38376;&#27099;&#65292;&#27809;&#26377;&#20915;&#23450;&#65288;&#29978;&#33267;&#22312;&#20043;&#21518;&#65289;&#27491;&#30830;&#25110;&#38169;&#35823;&#30340;&#26126;&#30830;&#26041;&#27861;&#65292;&#32780;&#19988;&#22240;&#20026;&#31561;&#24453;&#20854;&#20182;&#35752;&#35770;&#32773;&#32467;&#26463;&#26159;&#19968;&#20010;&#25104;&#21151;&#30340;&#31574;&#30053;&#12290;</p><p>&#23545;&#20110;&#38271;&#26399;&#30340;&#20027;&#39064;&#65292;&#35752;&#35770;&#30340;&#25968;&#37327;&#19982;&#20027;&#39064;&#30340;&#22797;&#26434;&#24230;&#25104;&#21453;&#27604;&#30340;&#21407;&#29702;&#65292;&#34987;&#38750;&#27491;&#24335;&#30340;&#31216;&#20026;<em class="firstterm">Bikeshed&#25928;&#29992;</em>&#12290;&#36825;&#37324;&#26159;Poul-Henning Kamp&#20026;BSD&#24320;&#21457;&#32773;&#20316;&#20986;&#35299;&#37322;&#30340;&#33879;&#21517;&#25991;&#31456;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#36825;&#26159;&#19968;&#20010;&#24456;&#38271;&#30340;&#25925;&#20107;&#65292;&#25110;&#32773;&#35828;&#26159;&#19968;&#20010;&#32769;&#25925;&#20107;&#65292;&#20294;&#23427;&#23454;&#38469;&#19978;&#24456;&#30701;&#12290;C. Northcote Parkinson&#22312;20&#19990;&#32426;60&#24180;&#20195;&#21021;&#32534;&#20889;&#20102;&#19968;&#26412;&#21483;&#20570;&#8220;Parkinson&#23450;&#24459;&#8221;&#30340;&#20070;&#65292;&#21253;&#21547;&#20102;&#35768;&#22810;&#31649;&#29702;&#21160;&#24577;&#24615;&#30340;&#30495;&#30693;&#28796;&#35265;&#12290;</p><p>[...]</p><p>&#36825;&#20123;&#20363;&#23376;&#20013;&#21253;&#25324;&#33258;&#34892;&#36710;&#26842;&#65292;&#21478;&#19968;&#20010;&#26356;&#37325;&#35201;&#30340;&#32452;&#20214;&#26159;&#26680;&#30005;&#31449;&#65292;&#25105;&#29468;&#36825;&#25551;&#36848;&#20102;&#26412;&#20070;&#30340;&#24180;&#40836;&#12290;</p><p>Parkinson&#23637;&#31034;&#20102;&#22914;&#20309;&#36827;&#20837;&#33891;&#20107;&#20250;&#65292;&#24182;&#24471;&#21040;&#24314;&#36896;&#33457;&#36153;&#20960;&#30334;&#19975;&#65292;&#29978;&#33267;&#20960;&#21313;&#20159;&#32654;&#20803;&#26680;&#30005;&#31449;&#30340;&#35768;&#21487;&#65292;&#20294;&#22914;&#26524;&#20320;&#24076;&#26395;&#24314;&#36896;&#33258;&#34892;&#36710;&#26842;&#65292;&#21017;&#20250;&#38519;&#20837;&#26080;&#20241;&#27490;&#30340;&#35752;&#35770;&#12290;</p><p>Parkinson&#35299;&#37322;&#20102;&#36825;&#26159;&#22240;&#20026;&#26680;&#30005;&#31449;&#22826;&#22823;&#12289;&#22826;&#36149;&#21644;&#22826;&#22797;&#26434;&#20102;&#65292;&#20154;&#20204;&#26080;&#27861;&#25484;&#25569;&#65292;&#25152;&#20197;&#19981;&#20250;&#21435;&#23581;&#35797;&#65292;&#36716;&#32780;&#20250;&#20551;&#35774;&#26576;&#20154;&#20250;&#22312;&#38656;&#35201;&#26102;&#26816;&#26597;&#25152;&#26377;&#30340;&#32454;&#33410;&#12290;Richard P.  Feynmann&#22312;&#20182;&#30340;&#20070;&#20013;&#25552;&#20379;&#20102;&#19968;&#20123;&#20851;&#20110;&#27931;&#26031;&#38463;&#25289;&#33707;&#26031;&#65288;&#32654;&#22269;&#26032;&#22696;&#35199;&#21733;&#24030;&#20013;&#21271;&#37096;&#19968;&#20010;&#26080;&#27861;&#20154;&#22320;&#20301;&#30340;&#31038;&#21306;&#65292;&#20301;&#20110;&#22307;&#33778;&#24066;&#35199;&#21271;&#12290;1942&#24180;&#34987;&#36873;&#20316;&#26680;&#30740;&#31350;&#22522;&#22320;&#65292;&#29983;&#20135;&#20102;&#31532;&#19968;&#25209;&#21407;&#23376;&#24377;&#12290;&#20174;1947&#24180;&#33267;1962&#24180;&#21407;&#23376;&#33021;&#22996;&#21592;&#20250;&#32479;&#27835;&#30528;&#36825;&#20010;&#22478;&#38215;&#12290;&#65289;&#30340;&#26377;&#36259;&#32780;&#19988;&#38750;&#24120;&#21040;&#20301;&#30340;&#20363;&#23376;&#12290;</p><p>&#21478;&#19968;&#26041;&#38754;&#26159;&#33258;&#34892;&#36710;&#26842;&#12290;&#25152;&#20154;&#37117;&#21487;&#20197;&#22312;&#21608;&#26411;&#24314;&#19968;&#20010;&#36710;&#26842;&#65292;&#32780;&#19988;&#36824;&#26377;&#26102;&#38388;&#30475;&#30005;&#35270;&#19978;&#30340;&#27604;&#36187;&#12290;&#25152;&#20197;&#26080;&#35770;&#20934;&#22791;&#30340;&#22810;&#22909;&#65292;&#26080;&#35770;&#20320;&#30340;&#25552;&#35758;&#26159;&#22810;&#20040;&#30340;&#26377;&#36947;&#29702;&#65292;&#20154;&#20204;&#20250;&#25235;&#20303;&#26426;&#20250;&#23637;&#31034;&#20182;&#22312;&#20570;&#33258;&#24049;&#30340;&#24037;&#20316;&#65292;&#20182;&#27491;&#22312;&#20851;&#27880;&#65292;&#20182;&#23601;&#22312;<span class="emphasis"><em>&#36825;&#37324;</em></span>&#12290;</p><p>&#22312;&#20025;&#40614;&#65292;&#25105;&#31216;&#20043;&#20026;&#8220;&#37197;&#32622;&#20320;&#30340;&#25351;&#32441;&#8221;&#12290;&#23427;&#20851;&#20110;&#33258;&#23562;&#21644;&#22768;&#26395;&#65292;&#20851;&#20110;&#33021;&#22815;&#25351;&#21521;&#26576;&#20107;&#24182;&#35828;&#8220;&#36825;&#37324;&#65281;&#25105;&#37027;&#26679;<span class="emphasis"><em>&#20570;</em></span>&#30340;&#12290;&#8221;&#36825;&#26159;&#25919;&#23458;&#30340;&#20856;&#22411;&#29305;&#24449;&#65292;&#20294;&#26159;&#29616;&#22312;&#24456;&#22810;&#20154;&#37117;&#20250;&#36825;&#26679;&#12290;&#24819;&#24819;&#28287;&#27700;&#27877;&#20013;&#30340;&#36275;&#36857;&#12290;</p></blockquote></div><p>&#65288;&#20182;&#30340;&#23436;&#25972;&#25991;&#31456;&#20063;&#21313;&#20998;&#20540;&#24471;&#38405;&#35835;&#12290;&#35831;&#30475;<a class="xref" href="bikeshed-full.html" title="Appendix C. &#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;">Appendix C, <i>&#20026;&#20160;&#20040;&#25105;&#35201;&#20851;&#27880;&#36710;&#26842;&#30340;&#39068;&#33394;&#65311;</i></a>&#65292;&#20197;&#21450;<a class="ulink" href="http://bikeshed.com" target="_top">http://bikeshed.com</a>&#12290;&#65289;</p><p>&#20219;&#20309;&#21442;&#21152;&#36807;&#22242;&#38431;&#20915;&#31574;&#30340;&#20154;&#37117;&#20250;&#30693;&#36947;Kamp&#25152;&#35828;&#30340;&#19996;&#35199;&#12290;&#28982;&#32780;&#65292;&#36890;&#24120;&#36824;&#26159;&#19981;&#21487;&#33021;&#35828;&#26381;<span class="emphasis"><em>&#27599;&#20010;&#20154;</em></span>&#36991;&#20813;&#21943;&#21047;&#33258;&#34892;&#36710;&#26842;&#12290;&#26368;&#22909;&#20320;&#33021;&#25351;&#20986;&#36825;&#26159;&#19968;&#20010;&#24517;&#28982;&#23384;&#22312;&#30340;&#29616;&#35937;&#65292;&#24182;&#22312;&#20320;&#21457;&#29616;&#23427;&#26102;&#65292;&#35828;&#26381;&#39640;&#32423;&#24320;&#21457;&#32773;&#8212;&#36825;&#20123;&#25991;&#31456;&#25317;&#26377;&#26368;&#39640;&#26435;&#37325;&#30340;&#20154;&#8212;&#23613;&#26089;&#20002;&#19979;&#20182;&#20204;&#30340;&#21047;&#23376;&#65292;&#25110;&#33267;&#23569;&#19981;&#35201;&#28155;&#21152;&#22122;&#38899;&#12290;&#33258;&#34892;&#36710;&#26842;&#21943;&#28034;&#30340;&#32858;&#20250;&#27704;&#36828;&#19981;&#20250;&#23436;&#20840;&#28040;&#22833;&#65292;&#20294;&#26159;&#20320;&#21487;&#20197;&#36890;&#36807;&#22312;&#39033;&#30446;&#25991;&#21270;&#20013;&#20256;&#25773;&#36825;&#20010;&#29616;&#35937;&#30340;&#30693;&#35782;&#35753;&#36825;&#31181;&#20107;&#21464;&#24471;&#26102;&#38388;&#26356;&#30701;&#65292;&#39057;&#29575;&#26356;&#20302;&#12290;</p></div><div class="sect2" title="&#36991;&#20813;&#22307;&#25112;"><div class="titlepage"><div><div><h3 class="title"><a name="holy-wars"></a>&#36991;&#20813;&#22307;&#25112;</h3></div></div></div><p>&#19968;&#22330;<em class="firstterm">&#22307;&#25112;</em>&#26159;&#19968;&#22330;&#20105;&#35770;&#65292;&#32463;&#24120;&#20294;&#19981;&#20250;&#19968;&#30452;&#26159;&#30456;&#23545;&#30340;&#23567;&#38382;&#39064;&#65292;&#19968;&#33324;&#19981;&#20250;&#36890;&#36807;&#36777;&#35770;&#24471;&#21040;&#35299;&#20915;&#65292;&#20294;&#26159;&#26377;&#20154;&#20250;&#20805;&#28385;&#28909;&#24773;&#30340;&#32487;&#32493;&#36777;&#35770;&#65292;&#26399;&#26395;&#20182;&#20204;&#19968;&#26041;&#20250;&#33719;&#32988;&#12290;&#22307;&#25112;&#24182;&#19981;&#19982;&#33258;&#34892;&#36710;&#26842;&#23436;&#20840;&#19968;&#26679;&#12290;&#20154;&#20204;&#31881;&#21047;&#36710;&#26842;&#36890;&#24120;&#26159;&#31361;&#28982;&#36339;&#20986;&#26469;&#30340;&#24847;&#35265;&#65288;&#22240;&#20026;&#20182;&#20204;&#21487;&#20197;&#65289;&#65292;&#20294;&#26159;&#20182;&#20204;&#19981;&#24517;&#24378;&#28872;&#30340;&#24863;&#35273;&#24517;&#39035;&#22914;&#27492;&#65292;&#24182;&#19988;&#20197;&#21518;&#20250;&#34920;&#36798;&#20854;&#20182;&#30340;&#24847;&#35265;&#65292;&#20114;&#30456;&#30683;&#30462;&#30340;&#24847;&#35265;&#65292;&#20197;&#23637;&#31034;&#20182;&#20204;&#29702;&#35299;&#38382;&#39064;&#30340;&#25152;&#26377;&#26041;&#38754;&#12290;&#32780;&#21478;&#19968;&#26041;&#38754;&#65292;&#22312;&#22307;&#25112;&#20013;&#65292;&#29702;&#35299;&#23545;&#26041;&#21017;&#26159;&#31034;&#24369;&#30340;&#34920;&#29616;&#12290;&#22312;&#22307;&#25112;&#20013;&#65292;&#27599;&#20010;&#20154;&#35748;&#20026;&#26377;&#19968;&#20010;&#21807;&#19968;&#27491;&#30830;&#30340;&#31572;&#26696;&#65307;&#20182;&#20204;&#21482;&#26159;&#19981;&#35748;&#21487;&#26159;&#20160;&#20040;&#12290;</p><p>&#22307;&#25112;&#19968;&#26086;&#24320;&#22987;&#65292;&#36890;&#24120;&#23601;&#19981;&#21487;&#33021;&#35753;&#27599;&#20010;&#20154;&#37117;&#28385;&#24847;&#12290;&#22312;&#27491;&#22312;&#36827;&#34892;&#30340;&#22307;&#25112;&#20013;&#25351;&#20986;&#36825;&#28857;&#24182;&#27809;&#26377;&#22909;&#22788;&#12290;&#27599;&#20010;&#20154;&#37117;&#24050;&#32463;&#30693;&#36947;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#20294;&#26159;&#23545;&#20110;&#36890;&#36807;&#36830;&#32493;&#30340;&#35752;&#35770;<span class="emphasis"><em>&#33021;&#21542;</em></span>&#35299;&#20915;&#20105;&#35770;&#36825;&#19968;&#38382;&#39064;&#65292;&#26159;&#22307;&#25112;&#24182;&#19981;&#35748;&#21487;&#30340;&#19968;&#20010;&#24120;&#35265;&#29305;&#24615;&#12290;&#20174;&#22806;&#37096;&#30475;&#26469;&#65292;&#24456;&#26126;&#26174;&#27809;&#26377;&#19968;&#26041;&#21487;&#20197;&#25913;&#21464;&#21478;&#19968;&#26041;&#30340;&#24847;&#35265;&#12290;&#32780;&#20174;&#20869;&#37096;&#30475;&#65292;&#21017;&#35748;&#20026;&#21478;&#19968;&#26041;&#22826;&#36807;&#34850;&#31528;&#65292;&#20063;&#27809;&#26377;&#24819;&#28165;&#26970;&#65292;&#20294;&#26159;&#32463;&#36807;&#36275;&#22815;&#30340;&#24683;&#21523;&#21017;&#33021;&#22238;&#24515;&#36716;&#24847;&#12290;&#29616;&#22312;&#65292;&#25105;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#35828;&#22312;&#22307;&#25112;&#20013;&#27704;&#36828;&#27809;&#26377;&#27491;&#30830;&#30340;&#19968;&#26041;&#12290;&#26377;&#26102;&#30830;&#23454;&#26377;&#8212;&#22312;&#25105;&#21442;&#21152;&#30340;&#22307;&#25112;&#20013;&#65292;&#30495;&#29702;&#24403;&#28982;&#27704;&#36828;&#23646;&#20110;&#25105;&#36825;&#19968;&#36793;&#12290;&#20294;&#26159;&#27809;&#26377;&#20851;&#31995;&#65292;&#22240;&#20026;&#27809;&#26377;&#31639;&#27861;&#21487;&#20197;&#20196;&#20154;&#20449;&#26381;&#30340;&#25551;&#36848;&#26576;&#19968;&#26041;&#26159;&#27491;&#30830;&#30340;&#12290;</p><p>&#20154;&#20204;&#35797;&#22270;&#35299;&#20915;&#22307;&#25112;&#30340;&#19968;&#20010;&#24120;&#35265;&#30340;&#65292;&#20294;&#26159;&#19981;&#33021;&#20196;&#20154;&#28385;&#24847;&#30340;&#26041;&#27861;&#26159;&#35828;&#8220;&#25105;&#20204;&#30340;&#35752;&#35770;&#24050;&#32463;&#28010;&#36153;&#20102;&#36807;&#22810;&#30340;&#26102;&#38388;&#21644;&#31934;&#21147;&#65281;&#25105;&#20204;&#33021;&#19981;&#33021;&#25226;&#23427;&#24536;&#25481;&#65311;&#8221;&#36825;&#26679;&#26377;&#20004;&#20010;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#26102;&#38388;&#21644;&#31934;&#21147;&#24050;&#32463;&#25237;&#20837;&#65292;&#19981;&#21487;&#33021;&#25910;&#22238;&#20102;&#8212;&#29616;&#22312;&#21807;&#19968;&#30340;&#38382;&#39064;&#26159;&#36824;&#26377;<span class="emphasis"><em>&#26356;&#22810;&#30340;</em></span>&#21147;&#37327;&#21527;&#65311;&#22914;&#26524;&#26576;&#20154;&#24863;&#35273;&#26356;&#22810;&#30340;&#35752;&#35770;&#20250;&#32467;&#26463;&#36825;&#20010;&#38382;&#39064;&#65292;&#37027;&#20040;&#32487;&#32493;&#23601;&#36824;&#26377;&#24847;&#20041;&#65288;&#20174;&#20182;&#20204;&#30340;&#35282;&#24230;&#30475;&#65289;&#12290;</p><p>&#21478;&#19968;&#20010;&#35201;&#27714;&#36825;&#20214;&#20107;&#24517;&#39035;&#20002;&#24323;&#30340;&#38382;&#39064;&#26159;&#36825;&#36890;&#24120;&#31561;&#21516;&#20110;&#20801;&#35768;&#26576;&#19968;&#26041;&#25171;&#30772;&#29616;&#29366;&#65292;&#36890;&#36807;&#26080;&#20026;&#23459;&#24067;&#32988;&#21033;&#12290;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#29616;&#29366;&#26080;&#35770;&#22914;&#20309;&#26159;&#19981;&#33021;&#25509;&#21463;&#30340;&#65292;&#27599;&#20010;&#20154;&#37117;&#35748;&#20026;&#38656;&#35201;&#20316;&#20986;&#20915;&#23450;&#65292;&#24517;&#39035;&#26377;&#25152;&#34892;&#21160;&#12290;&#20026;&#27599;&#20010;&#20154;&#20002;&#24323;&#36825;&#20010;&#20027;&#39064;&#36890;&#24120;&#27604;&#20219;&#20309;&#20154;&#25918;&#24323;&#35770;&#28857;&#26356;&#22351;&#12290;&#20294;&#26159;&#22240;&#20026;&#36825;&#31181;&#20004;&#38590;&#21487;&#20197;&#24179;&#31561;&#30340;&#24212;&#29992;&#21040;&#25152;&#26377;&#20154;&#65292;&#25152;&#20197;&#20173;&#26377;&#21487;&#33021;&#27704;&#20037;&#32467;&#26463;&#36777;&#35770;&#12290;</p><p>&#37027;&#20040;&#20320;&#24212;&#24403;&#22914;&#20309;&#22788;&#29702;&#22307;&#25112;&#65311;</p><p>&#31532;&#19968;&#20010;&#22238;&#31572;&#26159;&#65292;&#20570;&#22909;&#20934;&#22791;&#36991;&#20813;&#20854;&#21457;&#29983;&#12290;&#30475;&#36215;&#26469;&#24182;&#19981;&#26159;&#23436;&#20840;&#27809;&#26377;&#24076;&#26395;&#65306;</p><p>&#20320;&#21487;&#20197;&#39044;&#26399;&#21040;&#19968;&#20123;&#26631;&#20934;&#30340;&#22307;&#25112;&#65306;&#21487;&#33021;&#20851;&#20110;&#32534;&#31243;&#35821;&#35328;&#12289;&#35768;&#21487;&#35777;&#65288;&#35265;<span><a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#30340;</span><a class="xref" href="license-compatibility.html" title="GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;">the section called &#8220;GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;&#8221;</a>&#65289;&#12289;&#22238;&#22797;&#22788;&#29702;&#65288;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="mailing-lists.html#reply-to" title="&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;">the section called &#8220;&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;&#8221;</a>&#65289;&#21644;&#19968;&#20123;&#20854;&#20182;&#20027;&#39064;&#12290;&#27599;&#20010;&#39033;&#30446;&#21487;&#33021;&#37117;&#26377;&#33258;&#24049;&#30340;&#22307;&#25112;&#65292;&#38271;&#26399;&#24320;&#21457;&#32773;&#20250;&#24456;&#24555;&#29087;&#24713;&#12290;&#20572;&#27490;&#22307;&#25112;&#65292;&#25110;&#32773;&#20943;&#23569;&#20854;&#21361;&#23475;&#30340;&#25216;&#24039;&#22312;&#22823;&#22810;&#25968;&#22320;&#26041;&#37117;&#26159;&#30456;&#21516;&#30340;&#12290;&#21363;&#20351;&#20320;&#32943;&#23450;&#20320;&#23646;&#20110;&#27491;&#30830;&#30340;&#19968;&#26041;&#65292;&#21487;&#20197;&#35797;&#30528;&#23547;&#25214;<span class="emphasis"><em>&#19968;&#20123;</em></span>&#26041;&#27861;&#23637;&#31034;&#33258;&#24049;&#23545;&#23545;&#26041;&#30340;&#21516;&#24863;&#65292;&#24182;&#29702;&#35299;&#21478;&#19968;&#26041;&#30340;&#35770;&#28857;&#12290;&#36890;&#24120;&#38382;&#39064;&#26159;&#22312;&#22307;&#25112;&#20013;&#30340;&#27599;&#19968;&#26041;&#37117;&#23613;&#21487;&#33021;&#39640;&#30340;&#24314;&#31569;&#33258;&#24049;&#30340;&#22681;&#65292;&#32780;&#20351;&#20854;&#20182;&#35265;&#35299;&#30475;&#36215;&#26469;&#26159;&#23436;&#20840;&#30340;&#24858;&#34850;&#65292;&#25918;&#24323;&#25110;&#25913;&#21464;&#24605;&#24819;&#30340;&#34892;&#21160;&#22312;&#24515;&#29702;&#23398;&#19978;&#21464;&#24471;&#19981;&#21487;&#24525;&#21463;&#65306;&#36825;&#26679;&#20570;&#19981;&#20165;&#20165;&#26159;&#25215;&#35748;&#38169;&#35823;&#65292;&#32780;&#26159;<span class="emphasis"><em>&#24517;&#28982;</em></span>&#24182;&#19988;&#20250;&#19968;&#30452;&#38169;&#19979;&#21435;&#12290;&#23558;&#36825;&#31181;&#25215;&#35748;&#21464;&#24471;&#21487;&#21475;&#30340;&#26041;&#27861;&#26159;&#23637;&#31034;&#20320;&#30340;&#19981;&#30830;&#23450;&#24615;&#8212;&#31934;&#30830;&#30340;&#23637;&#31034;&#20320;&#29702;&#35299;&#20182;&#20204;&#30340;&#36777;&#35770;&#65292;&#21457;&#29616;&#20182;&#20204;&#33267;&#23569;&#24456;&#25935;&#24863;&#65292;&#21363;&#20351;&#26368;&#32456;&#24182;&#19981;&#26159;&#20196;&#20154;&#20449;&#26381;&#12290;&#20316;&#20986;&#20026;&#22238;&#24212;&#23039;&#24577;&#30041;&#20986;&#31354;&#38388;&#30340;&#23039;&#24577;&#65292;&#36890;&#24120;&#24773;&#20917;&#20250;&#24471;&#21040;&#25913;&#21892;&#12290;&#20063;&#35768;&#20320;&#19981;&#20250;&#24471;&#21040;&#26399;&#26395;&#30340;&#25216;&#26415;&#32467;&#26524;&#65292;&#20294;&#26159;&#20320;&#21487;&#20197;&#36991;&#20813;&#23545;&#20110;&#39033;&#30446;&#22763;&#27668;&#30340;&#38750;&#24517;&#35201;&#30456;&#20851;&#25439;&#23475;&#12290;</p><p>&#24403;&#22307;&#25112;&#19981;&#21487;&#36991;&#20813;&#26102;&#65292;&#23613;&#26089;&#20915;&#23450;&#20320;&#35201;&#20851;&#27880;&#22810;&#23569;&#65292;&#24182;&#20048;&#24847;&#20844;&#24320;&#25918;&#24323;&#12290;&#24403;&#20320;&#36825;&#26679;&#20570;&#65292;&#20320;&#21487;&#20197;&#35828;&#20320;&#27491;&#22312;&#36864;&#20986;&#65292;&#36825;&#22330;&#22307;&#25112;&#27627;&#26080;&#20215;&#20540;&#65292;&#32780;&#19981;&#35201;&#23637;&#31034;&#20986;&#25366;&#33510;&#65292;&#24182;&#19988;<span class="emphasis"><em>&#19981;&#35201;</em></span>&#21033;&#29992;&#36825;&#20010;&#26426;&#20250;&#23545;&#23545;&#26041;&#30340;&#36777;&#35770;&#20570;&#26368;&#21518;&#19968;&#27425;&#25915;&#20987;&#12290;&#21482;&#26377;&#20248;&#38597;&#30340;&#21435;&#20570;&#25165;&#33021;&#26377;&#25928;&#30340;&#25918;&#24323;&#12290;</p><p>&#32534;&#31243;&#35821;&#35328;&#30340;&#22307;&#25112;&#26377;&#20123;&#29305;&#27530;&#65292;&#22240;&#20026;&#34429;&#28982;&#20854;&#26412;&#36523;&#30340;&#39640;&#25216;&#26415;&#24615;&#65292;&#28982;&#32780;&#24456;&#22810;&#20154;&#24863;&#35273;&#33258;&#24049;&#26377;&#36164;&#26684;&#21442;&#19982;&#20854;&#20013;&#65292;&#22240;&#27492;&#32467;&#26524;&#21487;&#33021;&#21462;&#20915;&#20110;&#39033;&#30446;&#32534;&#30721;&#32534;&#20889;&#36739;&#22909;&#30340;&#37096;&#20998;&#30340;&#35821;&#35328;&#12290;&#26368;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#23613;&#26089;&#36873;&#23450;&#35821;&#35328;&#65292;&#30001;&#21021;&#22987;&#30340;&#26377;&#24433;&#21709;&#30340;&#24320;&#21457;&#32773;&#24341;&#20837;&#65292;&#26681;&#25454;&#20320;&#26368;&#33298;&#26381;&#30340;&#35821;&#35328;&#65292;&#32780;&#19981;&#26159;&#22240;&#20026;&#20854;&#20248;&#20110;&#20854;&#20182;&#35821;&#35328;&#32780;&#20351;&#29992;&#12290;<span class="emphasis"><em>&#19981;&#35201;</em></span>&#23558;&#23545;&#35805;&#36864;&#21270;&#20026;&#32463;&#20856;&#30340;&#32534;&#31243;&#35821;&#35328;&#27604;&#36739;&#65288;&#36890;&#24120;&#26159;&#24403;&#26576;&#20154;&#22240;&#20026;&#26576;&#20123;&#21407;&#22240;&#25552;&#20986;Perl&#12290;&#65289;&#65307;&#37027;&#26159;&#27515;&#35805;&#39064;&#65292;&#20320;&#24212;&#35813;&#26126;&#30830;&#30340;&#25298;&#32477;&#28041;&#21450;&#12290;</p><p>&#20851;&#20110;&#22307;&#25112;&#30340;&#26356;&#22810;&#21382;&#21490;&#32972;&#26223;&#65292;&#21487;&#20197;&#30475;<a class="ulink" href="http://catb.org/~esr/jargon/html/H/holy-wars.html" target="_top">http://catb.org/~esr/jargon/html/H/holy-wars.html</a>&#65292;Danny Cohen&#30340;&#35770;&#25991;&#26222;&#21450;&#20102;&#36825;&#20010;&#26415;&#35821;&#65292;<a class="ulink" href="http://www.ietf.org/rfc/ien/ien137.txt" target="_top">http://www.ietf.org/rfc/ien/ien137.txt</a>&#12290;</p></div><div class="sect2" title="&#8220;&#21557;&#38393;&#30340;&#23569;&#25968;&#27966;&#8221;&#25928;&#24212;"><div class="titlepage"><div><div><h3 class="title"><a name="noisy-minority"></a>&#8220;&#21557;&#38393;&#30340;&#23569;&#25968;&#27966;&#8221;&#25928;&#24212;</h3></div></div></div><p>&#22312;&#25152;&#26377;&#30340;&#37038;&#20214;&#21015;&#34920;&#35752;&#35770;&#20013;&#65292;&#37117;&#26377;&#19968;&#20123;&#23569;&#25968;&#27966;&#19981;&#26029;&#29992;&#22823;&#37327;&#20887;&#38271;&#30340;&#37038;&#20214;&#34880;&#27927;&#21015;&#34920;&#65292;&#32473;&#20154;&#23384;&#22312;&#22823;&#37327;&#24322;&#35758;&#30340;&#21360;&#35937;&#12290;&#26377;&#20123;&#20687;filibuster&#65288;&#19968;&#31181;&#35758;&#20250;&#31243;&#24207;&#65292;&#38459;&#25376;&#35758;&#26696;&#30340;&#36890;&#36807;&#65289;&#65292;&#20294;&#26159;&#36825;&#31181;&#24191;&#27867;&#24322;&#35758;&#30340;&#24187;&#24819;&#26356;&#21152;&#24378;&#22823;&#65292;&#22240;&#20026;&#23427;&#20998;&#21106;&#20102;&#20219;&#24847;&#25968;&#37327;&#30340;&#19981;&#36830;&#32493;&#25991;&#31456;&#65292;&#22823;&#22810;&#25968;&#20154;&#26080;&#27861;&#36319;&#36394;&#20309;&#20154;&#22312;&#20160;&#20040;&#26102;&#38388;&#35828;&#20102;&#20160;&#20040;&#12290;&#20182;&#20204;&#20250;&#20135;&#29983;&#20027;&#39064;&#23384;&#22312;&#20005;&#37325;&#20105;&#35758;&#30340;&#30452;&#35273;&#21360;&#35937;&#65292;&#24182;&#31561;&#30528;&#23567;&#39064;&#22823;&#20570;&#30340;&#24179;&#24687;&#12290;</p><p>&#20013;&#21644;&#36825;&#31181;&#25928;&#24212;&#30340;&#26368;&#22909;&#26041;&#27861;&#26159;&#26126;&#30830;&#25351;&#20986;&#24182;&#25552;&#20379;&#35777;&#25454;&#35777;&#26126;&#36825;&#31181;&#24322;&#35758;&#30340;&#25968;&#37327;&#19982;&#35748;&#21487;&#30340;&#25968;&#37327;&#30456;&#27604;&#26159;&#24494;&#19981;&#36275;&#36947;&#30340;&#12290;&#20026;&#20102;&#22686;&#22823;&#36825;&#31181;&#24046;&#36317;&#65292;&#20320;&#25110;&#35768;&#20250;&#24076;&#26395;&#31169;&#19979;&#35843;&#26597;&#22823;&#22810;&#25968;&#26102;&#20505;&#20250;&#20445;&#25345;&#27785;&#40664;&#65292;&#20294;&#26159;&#20320;&#24576;&#30097;&#26159;&#35748;&#21487;&#22823;&#22810;&#25968;&#30340;&#20154;&#12290;&#19981;&#35201;&#35828;&#36825;&#20123;&#25345;&#24322;&#35758;&#32773;&#26159;&#25925;&#24847;&#22840;&#22823;&#36825;&#31181;&#21360;&#35937;&#12290;&#20182;&#20204;&#19968;&#33324;&#19981;&#20250;&#26159;&#25925;&#24847;&#65292;&#21363;&#20351;&#25925;&#24847;&#65292;&#25351;&#20986;&#26469;&#20063;&#27809;&#26377;&#31574;&#30053;&#19978;&#30340;&#22909;&#22788;&#12290;&#20320;&#21482;&#38656;&#35201;&#25351;&#20986;&#21452;&#26041;&#23454;&#38469;&#25968;&#23383;&#30340;&#27604;&#36739;&#65292;&#20154;&#20204;&#23601;&#20250;&#35748;&#35782;&#21040;&#20182;&#20204;&#23545;&#20110;&#24418;&#21183;&#30340;&#30452;&#35273;&#19982;&#29616;&#23454;&#19981;&#31526;&#12290;</p><p>&#36825;&#20010;&#24314;&#35758;&#24182;&#19981;&#26159;&#21482;&#33021;&#24212;&#29992;&#21040;&#20855;&#22791;&#26126;&#30830;&#25903;&#25345;&#21644;&#21453;&#23545;&#20301;&#32622;&#30340;&#38382;&#39064;&#12290;&#23427;&#21487;&#20197;&#24212;&#29992;&#21040;&#25152;&#26377;&#23567;&#39064;&#22823;&#20570;&#30340;&#38382;&#39064;&#19978;&#65292;&#20294;&#26159;&#22914;&#26524;&#22823;&#22810;&#25968;&#20154;&#35748;&#20026;&#35752;&#35770;&#30340;&#38382;&#39064;&#19981;&#26159;&#19968;&#20010;&#38382;&#39064;&#26102;&#65292;&#21017;&#19981;&#26159;&#36825;&#20040;&#28165;&#26970;&#12290;&#22914;&#26524;&#32463;&#36807;&#19968;&#27573;&#26102;&#38388;&#65292;&#20320;&#35748;&#20026;&#36825;&#20010;&#38382;&#39064;&#24182;&#19981;&#20540;&#24471;&#34892;&#21160;&#65292;&#24182;&#19988;&#30475;&#21040;&#23427;&#26080;&#27861;&#33719;&#24471;&#26356;&#22810;&#30340;&#21560;&#24341;&#21147;&#65288;&#21363;&#20351;&#26377;&#20102;&#22823;&#37327;&#30340;&#37038;&#20214;&#65289;&#65292;&#20320;&#21487;&#20197;&#20844;&#24320;&#35780;&#35770;&#20854;&#27809;&#26377;&#21560;&#24341;&#21147;&#12290;&#22914;&#26524;&#8220;&#21557;&#38393;&#30340;&#23569;&#25968;&#27966;&#8221;&#27491;&#22312;&#24037;&#20316;&#65292;&#20320;&#30340;&#25991;&#31456;&#23601;&#20250;&#20687;&#19968;&#32533;&#28165;&#39118;&#12290;&#22823;&#22810;&#25968;&#20154;&#23545;&#20110;&#36825;&#20010;&#35752;&#35770;&#30340;&#21360;&#35937;&#37117;&#20250;&#26377;&#19968;&#20123;&#38452;&#37057;&#65306;&#8220;&#22909;&#35937;&#26159;&#21457;&#29983;&#20102;&#19968;&#20123;&#22823;&#20107;&#65292;&#22240;&#20026;&#26377;&#24456;&#22810;&#25991;&#31456;&#65292;&#20294;&#26159;&#25105;&#30475;&#19981;&#20986;&#26377;&#20160;&#20040;&#36827;&#23637;&#12290;&#8221;&#36890;&#36807;&#35299;&#37322;&#35752;&#35770;&#30340;&#24418;&#24335;&#20351;&#20854;&#26174;&#24471;&#27604;&#23454;&#38469;&#19978;&#26356;&#21152;&#21557;&#38393;&#65292;&#20320;&#32473;&#20854;&#26032;&#30340;&#38754;&#35980;&#65292;&#20154;&#20204;&#21487;&#20197;&#37325;&#26032;&#20462;&#35746;&#33258;&#24049;&#23545;&#20110;&#21457;&#29983;&#38382;&#39064;&#30340;&#29702;&#35299;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="communications.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="difficult-people.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 6. &#20132;&#27969; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#21050;&#20799;&#22836;</td></tr></table></div></body></html>
