<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#25552;&#20132;&#32773;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><link rel="prev" href="transitions.html" title="&#36716;&#21270;"><link rel="next" href="credit.html" title="&#33635;&#35465;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#25552;&#20132;&#32773;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="transitions.html">Prev</a> </td><th width="60%" align="center">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</th><td width="20%" align="right"> <a accesskey="n" href="credit.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#25552;&#20132;&#32773;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="committers"></a>&#25552;&#20132;&#32773;</h2></div></div></div><p>&#20316;&#20026;&#25152;&#26377;&#24320;&#28304;&#39033;&#30446;&#20013;&#21807;&#19968;&#27491;&#24335;&#30340;&#26126;&#30830;&#38454;&#23618;&#65292;&#38656;&#35201;&#23545;&#25552;&#20132;&#32773;&#26684;&#22806;&#20851;&#27880;&#12290;&#25552;&#20132;&#32773;&#26159;&#31995;&#32479;&#20013;&#19981;&#21487;&#36991;&#20813;&#30340;&#23545;&#37492;&#21035;&#30340;&#35753;&#27493;&#65292;&#32780;&#20854;&#20182;&#35282;&#33394;&#21017;&#26159;&#23613;&#21487;&#33021;&#30340;&#38750;&#37492;&#21035;&#12290;&#20294;&#26159;&#8220;&#37492;&#21035;&#8221;&#36825;&#37324;&#32477;&#26080;&#36731;&#35270;&#30340;&#21547;&#20041;&#12290;&#25552;&#20132;&#32773;&#21457;&#25381;&#30340;&#21151;&#33021;&#26159;&#32477;&#19981;&#21487;&#23569;&#30340;&#65292;&#25105;&#19981;&#30456;&#20449;&#19968;&#20010;&#39033;&#30446;&#20250;&#22312;&#27809;&#26377;&#36825;&#20010;&#35282;&#33394;&#30340;&#24773;&#20917;&#19979;&#21462;&#24471;&#25104;&#21151;&#12290;&#25105;&#20204;&#38656;&#35201;&#36136;&#37327;&#25511;&#21046;&#65292;&#26159;&#30340;&#65292;&#25511;&#21046;&#12290;&#24635;&#20250;&#26377;&#35768;&#22810;&#20154;&#35273;&#24471;&#33258;&#24049;&#20855;&#22791;&#23545;&#26576;&#20010;&#31243;&#24207;&#20462;&#25913;&#30340;&#33021;&#21147;&#65292;&#20294;&#23454;&#38469;&#19978;&#21482;&#26377;&#23569;&#25968;&#20154;&#30830;&#23454;&#20855;&#22791;&#12290;&#39033;&#30446;&#19981;&#33021;&#20381;&#36182;&#20154;&#20204;&#33258;&#24049;&#30340;&#21028;&#26029;&#65292;&#24517;&#39035;&#35774;&#32622;&#26631;&#20934;&#24182;&#20026;&#36798;&#21040;&#26631;&#20934;&#30340;&#20154;&#36171;&#20104;&#25552;&#20132;&#26435;&#38480;<sup>[<a name="idp2854" href="#ftn.idp2854" class="footnote">28</a>]</sup>&#12290; &#21478;&#19968;&#26041;&#38754;&#65292;&#35201;&#35753;&#21487;&#20197;&#30452;&#25509;&#25552;&#20132;&#21464;&#26356;&#30340;&#20154;&#19982;&#19981;&#33021;&#35774;&#32622;&#26126;&#26174;&#26435;&#21033;&#21464;&#21270;&#30340;&#20154;&#19968;&#36215;&#24037;&#20316;&#12290;&#36825;&#31181;&#21464;&#21270;&#24517;&#39035;&#26159;&#21463;&#31649;&#29702;&#30340;&#65292;&#36825;&#26679;&#25165;&#19981;&#20250;&#25439;&#23475;&#39033;&#30446;&#12290;</p><p>&#22312;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="consensus-democracy.html#electorate" title="&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;">the section called &#8220;&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;&#8221;</a>&#65292;&#25105;&#20204;&#24050;&#32463;&#35752;&#35770;&#32771;&#34385;&#36807;&#26032;&#25552;&#20132;&#32773;&#30340;&#26426;&#21046;&#12290;&#36825;&#37324;&#25105;&#20204;&#20250;&#35752;&#35770;&#28508;&#22312;&#30340;&#26032;&#24535;&#24895;&#32773;&#24517;&#39035;&#34987;&#21028;&#26029;&#30340;&#26631;&#20934;&#65292;&#20197;&#21450;&#22312;&#19968;&#20010;&#22823;&#30340;&#31038;&#21306;&#20013;&#22914;&#20309;&#23637;&#31034;&#36825;&#20010;&#36807;&#31243;&#12290;</p><div class="sect2" title="&#36873;&#25321;&#25552;&#20132;&#32773;"><div class="titlepage"><div><div><h3 class="title"><a name="choosing-committers"></a>&#36873;&#25321;&#25552;&#20132;&#32773;</h3></div></div></div><p>&#22312;Subversion&#39033;&#30446;&#65292;&#25105;&#20204;&#20027;&#35201;&#26681;&#25454;&#24076;&#27874;&#20811;&#25289;&#24213;&#21407;&#29702;&#36873;&#25321;&#25552;&#20132;&#32773;&#65306;<span class="emphasis"><em>&#39318;&#20808;&#65292;&#19981;&#35201;&#20260;&#23475;</em></span>&#12290;&#25105;&#20204;&#30340;&#20027;&#35201;&#26631;&#20934;&#19981;&#26159;&#25216;&#26415;&#25216;&#24039;&#25110;&#23545;&#20195;&#30721;&#30340;&#35748;&#35782;&#65292;&#20165;&#20165;&#26159;&#25552;&#20132;&#32773;&#23637;&#31034;&#20986;&#22909;&#30340;&#21028;&#26029;&#12290;&#21028;&#26029;&#20165;&#24847;&#21619;&#30528;&#30693;&#36947;&#19981;&#35201;&#20570;&#20160;&#20040;&#12290;&#19968;&#20010;&#20154;&#21487;&#20197;&#21482;&#21457;&#24067;&#23567;&#30340;&#34917;&#19969;&#65292;&#20462;&#27491;&#20195;&#30721;&#20013;&#30340;&#23567;&#38382;&#39064;&#65307;&#20294;&#21482;&#35201;&#36825;&#20010;&#34917;&#19969;&#33021;&#22815;&#24178;&#20928;&#30340;&#24212;&#29992;&#65292;&#19981;&#20250;&#24102;&#26469;&#26032;&#30340;bug&#65292;&#33021;&#22815;&#26368;&#22823;&#31243;&#24230;&#30340;&#31526;&#21512;&#39033;&#30446;&#30340;&#26085;&#24535;&#20449;&#24687;&#21644;&#20195;&#30721;&#20064;&#24815;&#65292;&#32780;&#19988;&#26377;&#36275;&#22815;&#22810;&#30340;&#34917;&#19969;&#21487;&#20197;&#23637;&#31034;&#26126;&#26174;&#30340;&#27169;&#24335;&#65292;&#21017;&#29616;&#26377;&#30340;&#25552;&#20132;&#32773;&#36890;&#24120;&#20250;&#25552;&#35758;&#20026;&#35813;&#20154;&#36171;&#20104;&#25552;&#20132;&#26435;&#38480;&#12290;&#22914;&#26524;&#33267;&#23569;&#19977;&#20010;&#20154;&#36190;&#25104;&#65292;&#19988;&#27809;&#26377;&#20154;&#21453;&#23545;&#65292;&#21017;&#25552;&#35758;&#36890;&#36807;&#12290;&#35802;&#28982;&#65292;&#20063;&#35768;&#25105;&#20204;&#27809;&#26377;&#35777;&#25454;&#35777;&#26126;&#36825;&#20010;&#20154;&#26377;&#33021;&#21147;&#35299;&#20915;&#20195;&#30721;&#22522;&#25152;&#26377;&#37096;&#20998;&#30340;&#22797;&#26434;&#38382;&#39064;&#65292;&#20294;&#36825;&#24182;&#19981;&#37325;&#35201;&#65306;&#20182;&#25152;&#20570;&#30340;&#24050;&#32463;&#35777;&#26126;&#20182;&#33267;&#23569;&#33021;&#23545;&#33258;&#24049;&#30340;&#33021;&#21147;&#26377;&#27491;&#30830;&#30340;&#21028;&#26029;&#12290;&#25216;&#26415;&#25216;&#24039;&#21487;&#20197;&#20064;&#24471;&#65288;&#21644;&#35762;&#25480;&#65289;&#65292;&#20294;&#26080;&#27861;&#33719;&#24471;&#26368;&#37325;&#35201;&#30340;&#21028;&#26029;&#12290;&#28982;&#32780;&#65292;&#22312;&#36171;&#20104;&#19968;&#20010;&#20154;&#25552;&#20132;&#26435;&#38480;&#20043;&#21069;&#65292;&#36825;&#26159;&#20320;&#38656;&#35201;&#30830;&#20445;&#26576;&#20154;&#25152;&#20855;&#22791;&#30340;&#33021;&#21147;&#12290;</p><p>&#24403;&#19968;&#20010;&#26032;&#30340;&#25552;&#20132;&#32773;&#25552;&#35758;&#24341;&#36215;&#20102;&#35752;&#35770;&#65292;&#36890;&#24120;&#19981;&#20250;&#26159;&#20851;&#20110;&#25216;&#26415;&#33021;&#21147;&#65292;&#32780;&#26159;&#20851;&#20110;&#35813;&#20154;&#22312;&#37038;&#20214;&#21015;&#34920;&#25110;IRC&#20013;&#30340;&#34892;&#20026;&#26041;&#24335;&#12290;&#26377;&#26102;&#65292;&#26576;&#20154;&#23637;&#31034;&#20102;&#25216;&#26415;&#33021;&#21147;&#21644;&#25353;&#29031;&#39033;&#30446;&#27491;&#24335;&#26041;&#38024;&#24037;&#20316;&#30340;&#33021;&#21147;&#65292;&#20197;&#21450;&#22312;&#20844;&#20849;&#35770;&#22363;&#20013;&#19968;&#33268;&#30340;&#22909;&#25112;&#25110;&#19981;&#21512;&#20316;&#24615;&#12290;&#36825;&#38656;&#35201;&#35748;&#30495;&#30340;&#20851;&#27880;&#65307;&#22914;&#26524;&#21363;&#20351;&#32463;&#36807;&#20102;&#22238;&#22797;&#30340;&#25552;&#31034;&#65292;&#36825;&#20010;&#20154;&#20063;&#19968;&#30452;&#26410;&#33021;&#25913;&#21464;&#65292;&#25105;&#20204;&#19981;&#20250;&#23558;&#20854;&#28155;&#21152;&#20026;&#25552;&#20132;&#32773;&#65292;&#26080;&#35770;&#20854;&#25216;&#24039;&#24590;&#26679;&#39640;&#12290;&#22312;&#19968;&#20010;&#24535;&#24895;&#32773;&#22242;&#38431;&#20013;&#65292;&#31038;&#20250;&#25216;&#24039;&#65292;&#25110;&#32773;&#35828;&#22312;&#8220;&#27801;&#30418;&#20013;&#29609;&#32781;&#30340;&#8221;&#33021;&#21147;&#65292;&#19982;&#21407;&#22987;&#30340;&#25216;&#26415;&#33021;&#21147;&#21516;&#26679;&#37325;&#35201;&#12290;&#22240;&#20026;&#20219;&#20309;&#19996;&#35199;&#37117;&#20250;&#36827;&#20837;&#29256;&#26412;&#25511;&#21046;&#65292;&#28155;&#21152;&#19968;&#20010;&#19981;&#35813;&#28155;&#21152;&#30340;&#25552;&#20132;&#32773;&#19981;&#20250;&#22312;&#20195;&#30721;&#23618;&#38754;&#24102;&#26469;&#22826;&#22810;&#30340;&#38382;&#39064;&#65288;&#35780;&#23457;&#21487;&#20197;&#36805;&#36895;&#23450;&#20301;&#36825;&#20123;&#38382;&#39064;&#65289;&#65292;&#20294;&#37027;&#26679;&#20250;&#23548;&#33268;&#26368;&#32456;&#24378;&#21046;&#39033;&#30446;&#25910;&#22238;&#35813;&#20154;&#30340;&#25552;&#20132;&#26435;&#38480;&#8212;&#36825;&#32477;&#19981;&#26159;&#19968;&#39033;&#35753;&#20154;&#24841;&#24555;&#30340;&#34892;&#20026;&#65292;&#26377;&#26102;&#20250;&#35753;&#20154;&#22833;&#26395;&#12290;</p><p>&#35768;&#22810;&#39033;&#30446;&#22362;&#25345;&#28508;&#22312;&#30340;&#25552;&#20132;&#32773;&#23637;&#31034;&#20102;&#29305;&#23450;&#32423;&#21035;&#30340;&#25216;&#26415;&#19987;&#19994;&#25216;&#33021;&#21644;&#25345;&#20037;&#24615;&#65292;&#36890;&#36807;&#25552;&#20132;&#19968;&#23450;&#25968;&#37327;&#30340;&#38750;&#29712;&#30862;&#34917;&#19969;&#8212;&#20063;&#23601;&#26159;&#39033;&#30446;&#19981;&#20165;&#20165;&#24076;&#26395;&#30693;&#36947;&#20182;&#19981;&#20250;&#20260;&#23475;&#39033;&#30446;&#65292;&#32780;&#19988;&#24076;&#26395;&#30693;&#36947;&#20182;&#20250;&#20351;&#39033;&#30446;&#22312;&#20195;&#30721;&#22522;&#19978;&#33719;&#30410;&#12290;&#36825;&#26679;&#24456;&#22909;&#65292;&#20294;&#26159;&#35201;&#23567;&#24515;&#65292;&#19981;&#35201;&#23558;&#25552;&#20132;&#26435;&#21464;&#20026;&#19968;&#20010;&#25490;&#20182;&#20465;&#20048;&#37096;&#30340;&#36523;&#20221;&#12290;&#27599;&#20010;&#20154;&#30340;&#33041;&#23376;&#20013;&#37117;&#24212;&#35813;&#26377;&#19968;&#20010;&#38382;&#39064;&#65306;&#8220;&#24590;&#26679;&#20570;&#25165;&#20250;&#20026;&#20195;&#30721;&#24102;&#26469;&#26368;&#22909;&#30340;&#32467;&#26524;&#65311;&#8221;&#32780;&#19981;&#26159;&#8220;&#35748;&#21487;&#36825;&#20010;&#20154;&#26159;&#21542;&#20250;&#38477;&#20302;&#25552;&#20132;&#26435;&#20851;&#32852;&#30340;&#31038;&#20250;&#29366;&#24577;&#30340;&#20215;&#20540;&#65311;&#8221;&#22914;&#26524;&#24744;&#26377;100&#20010;&#25552;&#20132;&#32773;&#65292;10&#20010;&#36827;&#34892;&#24120;&#35268;&#30340;&#36739;&#22823;&#30340;&#21464;&#26356;&#65292;&#32780;&#20854;&#20182;90&#20010;&#21017;&#20165;&#20165;&#26159;&#27599;&#24180;&#20462;&#27491;&#20960;&#20010;&#25340;&#20889;&#21644;&#23567;&#30340;bug&#65292;&#20381;&#28982;&#27604;&#21482;&#26377;10&#20010;&#25552;&#20132;&#32773;&#26356;&#22909;&#12290;</p></div><div class="sect2" title="&#25910;&#22238;&#25552;&#20132;&#26435;&#38480;"><div class="titlepage"><div><div><h3 class="title"><a name="revoking-committers"></a>&#25910;&#22238;&#25552;&#20132;&#26435;&#38480;</h3></div></div></div><p>&#20851;&#20110;&#25910;&#22238;&#25552;&#20132;&#26435;&#38480;&#39318;&#20808;&#35201;&#20570;&#21040;&#65306;&#23581;&#35797;&#19981;&#35201;&#19968;&#24320;&#22987;&#23601;&#36827;&#20837;&#36825;&#31181;&#24773;&#20917;&#12290;&#21462;&#20915;&#20110;&#35841;&#30340;&#26435;&#38480;&#23558;&#20250;&#34987;&#25910;&#22238;&#65292;&#20197;&#21450;&#25910;&#22238;&#30340;&#21407;&#22240;&#65292;&#30456;&#20851;&#30340;&#35752;&#35770;&#23558;&#20250;&#26174;&#33879;&#19981;&#21516;&#12290;&#21363;&#20351;&#27809;&#26377;&#19981;&#21516;&#65292;&#36825;&#20063;&#23558;&#20250;&#26159;&#26377;&#25928;&#29575;&#24037;&#20316;&#30340;&#19968;&#39033;&#36153;&#26102;&#30340;&#20998;&#24515;&#30340;&#24037;&#20316;&#12290;</p><p>&#28982;&#32780;&#65292;&#22914;&#26524;&#24744;&#24517;&#39035;&#22914;&#27492;&#65292;&#19968;&#23450;&#35201;&#30830;&#20445;&#35752;&#35770;&#24517;&#39035;&#22788;&#20110;&#23558;&#20250;&#20026;&#35813;&#20154;<span class="emphasis"><em>&#36171;&#20104;</em></span>&#26435;&#38480;&#36827;&#34892;&#25237;&#31080;&#30340;&#20154;&#20043;&#38388;&#65292;&#26080;&#35770;&#20182;&#20204;&#25317;&#26377;&#24590;&#26679;&#30340;&#25237;&#31080;&#39118;&#21619;&#12290;&#19968;&#23450;&#19981;&#35201;&#21253;&#21547;&#26412;&#20154;&#12290;&#36825;&#20284;&#20046;&#21542;&#23450;&#20102;&#38024;&#23545;&#20445;&#23494;&#24615;&#30340;&#31105;&#20196;&#65292;&#20294;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#36825;&#26159;&#24517;&#35201;&#30340;&#12290;&#39318;&#20808;&#65292;&#27809;&#26377;&#20154;&#33021;&#22815;&#20197;&#21035;&#30340;&#26041;&#24335;&#33258;&#30001;&#35328;&#35770;&#12290;&#20854;&#27425;&#65292;&#22914;&#26524;&#34892;&#21160;&#22833;&#36133;&#65292;&#20320;&#19981;&#20250;&#24076;&#26395;&#35753;&#27492;&#20154;&#30693;&#36947;&#36825;&#34987;&#32771;&#34385;&#36807;&#65292;&#22240;&#20026;&#36825;&#20250;&#24102;&#26469;&#19968;&#20123;&#38382;&#39064;&#65288;&#8220;&#35841;&#31449;&#22312;&#25105;&#36825;&#36793;&#65311; &#35841;&#21453;&#23545;&#25105;&#65311;&#8221;&#65289;&#65292;&#20250;&#23548;&#33268;&#26368;&#22351;&#31867;&#22411;&#30340;&#20826;&#27966;&#20027;&#20041;&#12290;&#22312;&#19968;&#20123;&#32597;&#35265;&#30340;&#24773;&#24418;&#19979;&#65292;&#22242;&#38431;&#20250;&#24076;&#26395;&#26576;&#20154;&#30693;&#36947;&#25910;&#22238;&#25552;&#20132;&#26435;&#38480;&#30340;&#36807;&#31243;&#27491;&#22312;&#36827;&#34892;&#20013;&#65292;&#20316;&#20026;&#35686;&#21578;&#25552;&#31034;&#65292;&#20294;&#19968;&#23450;&#35201;&#30830;&#20445;&#36825;&#31181;&#20844;&#24320;&#26159;&#22242;&#38431;&#20915;&#31574;&#30340;&#32467;&#26524;&#12290;&#20219;&#20309;&#20154;&#19981;&#24212;&#24403;&#25797;&#33258;&#34892;&#21160;&#65292;&#23558;&#21035;&#20154;&#35748;&#20026;&#26159;&#31192;&#23494;&#30340;&#35752;&#35770;&#20449;&#24687;&#21644;&#34920;&#20915;&#36879;&#28431;&#20986;&#21435;&#12290;</p><p>&#19968;&#26086;&#25910;&#22238;&#20102;&#26576;&#20154;&#30340;&#26435;&#38480;&#65292;&#32467;&#26524;&#24517;&#28982;&#35201;&#20844;&#24320;&#65288;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="committers.html#commit-access-openness" title="&#36991;&#20813;&#31070;&#31192;">the section called &#8220;&#36991;&#20813;&#31070;&#31192;&#8221;</a>&#65289;&#65292;&#20320;&#38656;&#35201;&#23581;&#35797;&#23613;&#21487;&#33021;&#35880;&#24910;&#30340;&#20844;&#24067;&#20110;&#20247;&#12290;</p></div><div class="sect2" title="&#37096;&#20998;&#25552;&#20132;&#26435;&#38480;"><div class="titlepage"><div><div><h3 class="title"><a name="partial-committers"></a>&#37096;&#20998;&#25552;&#20132;&#26435;&#38480;</h3></div></div></div><p>&#26377;&#20123;&#39033;&#30446;&#25552;&#20379;&#32454;&#31890;&#24230;&#30340;&#25552;&#20132;&#26435;&#38480;&#12290;&#20363;&#22914;&#65292;&#26377;&#20123;&#36129;&#29486;&#32773;&#30340;&#25552;&#20132;&#26435;&#38480;&#38480;&#20110;&#25991;&#26723;&#65292;&#32780;&#19981;&#33021;&#26159;&#20195;&#30721;&#12290;&#24120;&#35265;&#30340;&#37096;&#20998;&#25552;&#20132;&#26435;&#38480;&#21253;&#25324;&#25991;&#26723;&#12289;&#32763;&#35793;&#12289;&#20854;&#20182;&#35821;&#35328;&#30340;&#32465;&#23450;&#20195;&#30721;&#65292;&#25171;&#21253;&#30340;&#29305;&#23450;&#25991;&#20214;&#65288;&#20363;&#22914;RedHat RPM&#35268;&#33539;&#25991;&#20214;&#31561;&#31561;&#65289;&#65292;&#20197;&#21450;&#20854;&#20182;&#21363;&#20351;&#21457;&#29983;&#38169;&#35823;&#20063;&#19981;&#20250;&#23548;&#33268;&#26680;&#24515;&#39033;&#30446;&#38382;&#39064;&#30340;&#22320;&#26041;&#12290;</p><p>&#22240;&#20026;&#25552;&#20132;&#26435;&#38480;&#19981;&#20165;&#20165;&#20851;&#20110;&#25552;&#20132;&#65292;&#32780;&#19988;&#20107;&#20851;&#36873;&#20030;&#36164;&#26684;&#65288;&#35265;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="consensus-democracy.html#electorate" title="&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;">the section called &#8220;&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;&#8221;</a>&#65289;&#65292;&#33258;&#28982;&#22238;&#24102;&#26469;&#21478;&#19968;&#20010;&#38382;&#39064;&#65306;&#37096;&#20998;&#25552;&#20132;&#32773;&#33021;&#22815;&#20026;&#20309;&#25237;&#31080;&#65311;&#27809;&#26377;&#19968;&#20010;&#27491;&#30830;&#30340;&#31572;&#26696;&#65307;&#36825;&#21462;&#20915;&#20110;&#20320;&#30340;&#39033;&#30446;&#26377;&#20309;&#31181;&#37096;&#20998;&#25552;&#20132;&#39046;&#22495;&#12290;&#22312;Subversion&#20013;&#65292;&#25105;&#20204;&#23613;&#21487;&#33021;&#35753;&#20107;&#24773;&#31616;&#21333;&#65306;&#19968;&#20010;&#37096;&#20998;&#25552;&#20132;&#32773;&#21482;&#21487;&#20197;&#21442;&#21152;&#25552;&#20132;&#32773;&#39046;&#22495;&#30340;&#37096;&#20998;&#25237;&#31080;&#65292;&#20854;&#20182;&#22320;&#26041;&#21017;&#19981;&#34892;&#12290;&#26356;&#37325;&#35201;&#30340;&#65292;&#25105;&#20204;&#26377;&#19968;&#20010;&#21487;&#20197;&#35206;&#30422;&#24314;&#35758;&#25237;&#31080;&#30340;&#26426;&#21046;&#65288;&#20854;&#23454;&#36136;&#22312;&#20110;&#65292;&#34920;&#20915;&#26102;&#25552;&#20132;&#32773;&#21487;&#20197;&#20889;"+0"&#25110;"+1 &#65288;&#38750;&#32465;&#23450;&#65289;"&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;"+1"&#65289;&#12290;......................</p><p>&#23436;&#20840;&#25552;&#20132;&#32773;&#21487;&#20197;&#20026;&#20219;&#20309;&#20107;&#24773;&#25237;&#31080;&#65292;&#23601;&#20687;&#20182;&#20204;&#21487;&#20197;&#20219;&#24847;&#25552;&#20132;&#19968;&#26679;&#65292;&#21482;&#26377;&#23436;&#20840;&#25552;&#20132;&#32773;&#21487;&#20197;&#20026;&#28155;&#21152;&#25152;&#26377;&#31867;&#22411;&#30340;&#25552;&#20132;&#32773;&#25237;&#31080;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#36890;&#24120;&#36825;&#31181;&#28155;&#21152;&#26032;&#37096;&#20998;&#25552;&#20132;&#32773;&#30340;&#33021;&#21147;&#36890;&#24120;&#20250;&#34987;&#20195;&#29702;&#65306;&#20219;&#24847;&#23436;&#20840;&#25552;&#20132;&#32773;&#21487;&#20197;&#8220;&#21457;&#36215;&#8221;&#19968;&#20010;&#26032;&#30340;&#37096;&#20998;&#25552;&#20132;&#32773;&#65292;&#32780;&#19988;&#26576;&#20010;&#39046;&#22495;&#30340;&#37096;&#20998;&#25552;&#20132;&#32773;&#36890;&#24120;&#20250;&#20026;&#21516;&#19968;&#39046;&#22495;&#36873;&#25321;&#26032;&#30340;&#25552;&#20132;&#32773;&#65288;&#36825;&#22312;&#20445;&#35777;&#32763;&#35793;&#24037;&#20316;&#27491;&#24120;&#36816;&#34892;&#26102;&#29305;&#21035;&#26377;&#30410;&#65289;&#12290;</p><p>&#20320;&#30340;&#39033;&#30446;&#21487;&#33021;&#26377;&#20123;&#35768;&#19981;&#21516;&#30340;&#23433;&#25490;&#65292;&#36825;&#21462;&#20915;&#20110;&#20320;&#25152;&#20316;&#24037;&#20316;&#30340;&#29305;&#24615;&#65292;&#20294;&#30456;&#21516;&#30340;&#21407;&#29702;&#36866;&#29992;&#20110;&#25152;&#26377;&#30340;&#39033;&#30446;&#12290;&#27599;&#20010;&#25552;&#20132;&#32773;&#24517;&#39035;&#33021;&#20026;&#22905;&#25552;&#20132;&#26435;&#38480;&#30456;&#20851;&#30340;&#20107;&#29289;&#36827;&#34892;&#25237;&#31080;&#65292;&#19981;&#30456;&#20851;&#30340;&#21017;&#19981;&#33021;&#65292;&#32780;&#19988;&#31243;&#24207;&#19978;&#30340;&#38382;&#39064;&#40664;&#35748;&#30001;&#23436;&#20840;&#25552;&#20132;&#32773;&#34920;&#20915;&#65292;&#38500;&#38750;&#26377;&#21407;&#22240;&#65288;&#35201;&#30001;&#23436;&#20840;&#25552;&#20132;&#32773;&#20915;&#23450;&#65289;&#26469;&#25193;&#22823;&#25237;&#31080;&#33539;&#22260;&#12290;</p><p>&#20851;&#20110;&#37096;&#20998;&#25552;&#20132;&#26435;&#38480;&#30340;&#24378;&#21046;&#24615;&#65306;&#26368;&#22909;<span class="emphasis"><em>&#19981;&#35201;</em></span>&#35753;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#32422;&#26463;&#25552;&#20132;&#39046;&#22495;&#65292;&#21363;&#20351;&#25216;&#26415;&#19978;&#21487;&#34892;&#12290;&#21407;&#22240;&#35831;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="vc.html#vc-authz" title="&#25480;&#26435;">the section called &#8220;&#25480;&#26435;&#8221;</a>&#12290;</p></div><div class="sect2" title="&#20241;&#30496;&#25552;&#20132;&#32773;"><div class="titlepage"><div><div><h3 class="title"><a name="dormant-committers"></a>&#20241;&#30496;&#25552;&#20132;&#32773;</h3></div></div></div><p>&#19968;&#20123;&#39033;&#30446;&#20250;&#22312;&#25552;&#20132;&#32773;&#22312;&#19968;&#23450;&#26102;&#38388;&#65288;&#20363;&#22914;&#19968;&#24180;&#65289;&#20869;&#26410;&#33021;&#25552;&#20132;&#20219;&#20309;&#19996;&#35199;&#26102;&#65292;&#33258;&#21160;&#21024;&#38500;&#20854;&#25552;&#20132;&#26435;&#38480;&#12290;&#25105;&#35748;&#20026;&#36825;&#26679;&#27809;&#26377;&#22826;&#22823;&#24110;&#21161;&#65292;&#29978;&#33267;&#26377;&#19981;&#33391;&#30340;&#21518;&#26524;&#65292;&#26377;&#20197;&#19979;&#20004;&#20010;&#21407;&#22240;&#12290;</p><p>&#39318;&#20808;&#65292;&#36825;&#20250;&#35825;&#20351;&#20154;&#20204;&#25552;&#20132;&#21487;&#25509;&#21463;&#20294;&#19981;&#24517;&#35201;&#30340;&#21464;&#26356;&#65292;&#20165;&#20165;&#20026;&#20102;&#20445;&#20303;&#23558;&#35201;&#36807;&#26399;&#30340;&#25552;&#20132;&#26435;&#38480;&#12290;&#20854;&#27425;&#65292;&#36825;&#26679;&#27809;&#26377;&#24847;&#20041;&#12290;&#22914;&#26524;&#36171;&#20104;&#25552;&#20132;&#26435;&#38480;&#30340;&#20027;&#35201;&#26631;&#20934;&#26159;&#21028;&#26029;&#21147;&#65292;&#20026;&#20309;&#20165;&#20165;&#22240;&#20026;&#20182;&#31163;&#24320;&#20102;&#39033;&#30446;&#23601;&#35748;&#20026;&#20854;&#21028;&#26029;&#21147;&#30340;&#19979;&#38477;&#65311;&#21363;&#20351;&#20182;&#23436;&#20840;&#30340;&#28040;&#22833;&#20102;&#20960;&#24180;&#65292;&#27809;&#26377;&#30475;&#20219;&#20309;&#20195;&#30721;&#25110;&#36319;&#36394;&#24320;&#21457;&#35752;&#35770;&#65292;&#20294;&#24403;&#20182;&#37325;&#26032;&#20986;&#29616;&#26102;&#65292;&#20182;&#20250;<span class="emphasis"><em>&#30693;&#36947;</em></span>&#20182;&#24050;&#32463;&#22810;&#20037;&#26410;&#20174;&#32852;&#31995;&#65292;&#24182;&#20197;&#27492;&#34892;&#21160;&#12290;&#20320;&#21407;&#26469;&#30456;&#20449;&#20182;&#30340;&#21028;&#26029;&#65292;&#20026;&#20309;&#19981;&#27704;&#36828;&#30456;&#20449;&#20182;&#65311;&#22914;&#26524;&#39640;&#26657;&#30340;&#25991;&#20973;&#19981;&#20250;&#36807;&#26399;&#65292;&#37027;&#20040;&#25552;&#20132;&#26435;&#38480;&#20063;&#19981;&#24212;&#35813;&#12290;</p><p>&#26377;&#26102;&#65292;&#19968;&#20010;&#25552;&#20132;&#32773;&#20250;&#35201;&#27714;&#23558;&#20854;&#21024;&#38500;&#65292;&#25110;&#22312;&#25552;&#20132;&#32773;&#21015;&#34920;&#20013;&#26126;&#30830;&#30340;&#26631;&#35760;&#20026;&#20241;&#30496;&#29366;&#24577;&#65288;&#20851;&#20110;&#35813;&#21015;&#34920;&#30340;&#26356;&#22810;&#20449;&#24687;&#35265;<span>&#21518;&#38754;&#30340;</span><a class="xref" href="committers.html#commit-access-openness" title="&#36991;&#20813;&#31070;&#31192;">the section called &#8220;&#36991;&#20813;&#31070;&#31192;&#8221;</a>&#65289;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#39033;&#30446;&#24403;&#28982;&#24517;&#39035;&#31572;&#24212;&#20010;&#20154;&#30340;&#24847;&#24895;&#12290;</p></div><div class="sect2" title="&#36991;&#20813;&#31070;&#31192;"><div class="titlepage"><div><div><h3 class="title"><a name="commit-access-openness"></a>&#36991;&#20813;&#31070;&#31192;</h3></div></div></div><p>&#23613;&#31649;&#22260;&#32469;&#28155;&#21152;&#29305;&#23450;&#26032;&#25552;&#20132;&#32773;&#30340;&#35752;&#35770;&#24517;&#39035;&#20445;&#25345;&#26426;&#23494;&#65292;&#20854;&#35268;&#21017;&#21644;&#27493;&#39588;&#26412;&#36523;&#19981;&#24212;&#35813;&#20445;&#23494;&#12290;&#23454;&#38469;&#19978;&#65292;&#26368;&#22909;&#20844;&#24320;&#65292;&#36825;&#26679;&#20154;&#20204;&#21487;&#20197;&#24847;&#35782;&#21040;&#25552;&#20132;&#32773;&#24182;&#19981;&#26159;&#20160;&#20040;&#31070;&#31192;&#30340;&#31192;&#23494;&#27861;&#24237;&#65292;&#20063;&#19981;&#26159;&#20961;&#20154;&#20813;&#36827;&#65292;&#32780;&#26159;&#20219;&#20309;&#20154;&#21487;&#20197;&#21442;&#19982;&#65292;&#20165;&#38656;&#35201;&#21457;&#24067;&#19968;&#20123;&#22909;&#30340;&#34917;&#19969;&#65292;&#24182;&#25351;&#23548;&#22914;&#20309;&#22312;&#31038;&#21306;&#20013;&#20132;&#27969;&#12290;&#22312;Subversion&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#23558;&#20449;&#24687;&#25918;&#22312;&#24320;&#21457;&#25351;&#21335;&#25991;&#26723;&#20013;&#65292;&#22240;&#20026;&#37027;&#20123;&#24076;&#26395;&#20026;&#39033;&#30446;&#36129;&#29486;&#20195;&#30721;&#30340;&#20154;&#20204;&#23545;&#22914;&#20309;&#36171;&#20104;&#25552;&#20132;&#26435;&#38480;&#26368;&#26377;&#20852;&#36259;&#12290;</p><p>&#38500;&#20102;&#21457;&#24067;&#27493;&#39588;&#65292;&#20063;&#35201;&#21457;&#24067;&#25552;&#20132;&#32773;<span class="emphasis"><em>&#21015;&#34920;</em></span>&#12290;&#35813;&#25991;&#20214;&#30340;&#20256;&#32479;&#20301;&#32622;&#26159;&#39033;&#30446;&#20195;&#30721;&#26641;&#39030;&#32423;&#30446;&#24405;&#20013;&#21483;&#20570;<code class="filename">MAINTAINERS</code>&#25110;<code class="filename">COMMITTERS</code>&#30340;&#25991;&#20214;&#12290;&#23427;&#39318;&#20808;&#24517;&#39035;&#21015;&#20986;&#25152;&#26377;&#30340;&#25552;&#20132;&#32773;&#65292;&#32039;&#36319;&#26159;&#22810;&#20010;&#37096;&#20998;&#25552;&#20132;&#22495;&#20197;&#21450;&#20854;&#20013;&#30340;&#25552;&#20132;&#32773;&#12290;&#35201;&#21015;&#20986;&#27599;&#20010;&#20154;&#30340;&#21517;&#23383;&#65292;&#22914;&#26524;&#35813;&#20154;&#24895;&#24847;&#65292;&#20063;&#21253;&#25324;&#37038;&#20214;&#22320;&#22336;&#65292;&#22320;&#22336;&#21487;&#20197;&#20026;&#38450;&#27490;&#22403;&#22334;&#37038;&#20214;&#36827;&#34892;&#32534;&#30721;&#65288;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="mailing-lists.html#address-hiding" title="&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;">the section called &#8220;&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;&#8221;</a>&#65289;&#12290;</p><p>&#22240;&#20026;&#23436;&#20840;&#25552;&#20132;&#32773;&#21644;&#37096;&#20998;&#25552;&#20132;&#32773;&#35775;&#38382;&#26435;&#38480;&#26377;&#30528;&#26126;&#26174;&#30340;&#21306;&#21035;&#65292;&#20063;&#20570;&#20986;&#20102;&#26126;&#30830;&#30340;&#23450;&#20041;&#65292;&#25152;&#20197;&#36825;&#20010;&#21015;&#34920;&#20063;&#24212;&#35813;&#21015;&#20986;&#36825;&#31181;&#21306;&#21035;&#12290;&#38500;&#27492;&#20197;&#22806;&#65292;&#35813;&#21015;&#34920;&#19981;&#24212;&#24403;&#35797;&#22270;&#34920;&#26126;&#39033;&#30446;&#20013;&#19981;&#21487;&#36991;&#20813;&#20250;&#20986;&#29616;&#30340;&#38750;&#27491;&#24335;&#30340;&#21306;&#21035;&#65292;&#20363;&#22914;&#35841;&#26356;&#20855;&#24433;&#21709;&#21147;&#12290;&#23427;&#26159;&#20844;&#20849;&#35760;&#24405;&#65292;&#19981;&#26159;&#33268;&#35874;&#25991;&#20214;&#12290;&#35831;&#20351;&#29992;&#23383;&#27597;&#39034;&#24207;&#25110;&#20854;&#20986;&#29616;&#39034;&#24207;&#21015;&#20986;&#25552;&#20132;&#32773;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2854" href="#idp2854" class="para">28</a>] </sup>&#35831;&#27880;&#24847;&#65292;&#22312;&#38750;&#38598;&#20013;&#24335;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#65292;&#25552;&#20132;&#26435;&#38480;&#30340;&#21547;&#20041;&#26377;&#20123;&#21306;&#21035;&#65292;&#22312;&#38750;&#38598;&#20013;&#24335;&#31995;&#32479;&#20013;&#65292;&#20219;&#20309;&#20154;&#21487;&#20197;&#24314;&#31435;&#19982;&#39033;&#30446;&#20851;&#32852;&#30340;&#29256;&#26412;&#24211;&#65292;&#24182;&#20026;&#33258;&#24049;&#35774;&#32622;&#21040;&#35813;&#24211;&#30340;&#35775;&#38382;&#26435;&#38480;&#12290;&#28982;&#32780;&#65292;&#25552;&#20132;&#26435;&#38480;&#30340;<span class="emphasis"><em>&#27010;&#24565;</em></span>&#20381;&#28982;&#36866;&#29992;&#65306;&#8220;&#25552;&#20132;&#26435;&#38480;&#8221;&#26159;&#8220;&#25913;&#21464;&#36719;&#20214;&#19979;&#19968;&#27425;&#21457;&#24067;&#20013;&#36755;&#36865;&#20195;&#30721;&#30340;&#26435;&#21033;&#8221;&#30340;&#32553;&#20889;&#12290;&#22312;&#38598;&#20013;&#24335;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#65292;&#36825;&#24847;&#21619;&#30528;&#30452;&#25509;&#30340;&#25552;&#20132;&#26435;&#38480;&#65307;&#22312;&#38750;&#38598;&#20013;&#24335;&#31995;&#32479;&#20013;&#65292;&#36825;&#34920;&#31034;&#20102;&#23558;&#26576;&#20154;&#30340;&#21464;&#26356;&#40664;&#35748;&#25302;&#20837;&#20027;&#21457;&#24067;&#12290;&#20854;&#23454;&#26159;&#30456;&#21516;&#30340;&#21547;&#20041;&#65307;&#20854;&#23454;&#29616;&#30340;&#26426;&#21046;&#24182;&#19981;&#37325;&#35201;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="transitions.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="credit.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36716;&#21270; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#33635;&#35465;</td></tr></table></div></body></html>
