<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 6. &#20132;&#27969;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="marketing.html" title="&#24066;&#22330;&#33829;&#38144;"><link rel="next" href="common-pitfalls.html" title="&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 6. &#20132;&#27969;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="marketing.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="common-pitfalls.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 6. &#20132;&#27969;"><div class="titlepage"><div><div><h2 class="title"><a name="communications"></a>Chapter 6. &#20132;&#27969;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="communications.html#you-are-what-you-write">&#20154;&#22914;&#20854;&#25991;</a></span></dt><dd><dl><dt><span class="sect2"><a href="communications.html#structure-and-formatting">&#32467;&#26500;&#21644;&#26684;&#24335;</a></span></dt><dt><span class="sect2"><a href="communications.html#writing-content">&#20869;&#23481;</a></span></dt><dt><span class="sect2"><a href="communications.html#writing-tone">&#22522;&#35843;</a></span></dt><dt><span class="sect2"><a href="communications.html#rudeness">&#35782;&#21035;&#26080;&#31036;</a></span></dt><dt><span class="sect2"><a href="communications.html#face">&#38754;&#23481;</a></span></dt></dl></dd><dt><span class="sect1"><a href="common-pitfalls.html">&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;</a></span></dt><dd><dl><dt><span class="sect2"><a href="common-pitfalls.html#post-with-purpose">&#19981;&#35201;&#21457;&#34920;&#26080;&#30446;&#30340;&#30340;&#25991;&#31456;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#productive-threads">&#22810;&#20135;VS&#38750;&#22810;&#20135;&#30340;&#32447;&#32034;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#bikeshed">&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#holy-wars">&#36991;&#20813;&#22307;&#25112;</a></span></dt><dt><span class="sect2"><a href="common-pitfalls.html#noisy-minority">&#8220;&#21557;&#38393;&#30340;&#23569;&#25968;&#27966;&#8221;&#25928;&#24212;</a></span></dt></dl></dd><dt><span class="sect1"><a href="difficult-people.html">&#21050;&#20799;&#22836;</a></span></dt><dd><dl><dt><span class="sect2"><a href="difficult-people.html#handling-difficult-people">&#22788;&#29702;&#21050;&#20799;&#22836;</a></span></dt><dt><span class="sect2"><a href="difficult-people.html#difficult-people-case-study">&#26696;&#20363;&#23398;&#20064;</a></span></dt></dl></dd><dt><span class="sect1"><a href="growth.html">&#22788;&#29702;&#25104;&#38271;</a></span></dt><dd><dl><dt><span class="sect2"><a href="growth.html#using-archives">&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;</a></span></dt><dd><dl><dt><span class="sect3"><a href="growth.html#all-as-archives">&#23558;&#25152;&#26377;&#30340;&#36164;&#28304;&#35270;&#20026;&#24402;&#26723;</a></span></dt></dl></dd><dt><span class="sect2"><a href="growth.html#codifying-tradition">&#32534;&#21046;&#27861;&#24459;&#30340;&#20256;&#32479;</a></span></dt></dl></dd><dt><span class="sect1"><a href="bug-tracker-usage.html">Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;</a></span></dt><dt><span class="sect1"><a href="publicity.html">&#20844;&#24320;&#24615;</a></span></dt><dd><dl><dt><span class="sect2"><a href="publicity.html#security">&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;</a></span></dt><dd><dl><dt><span class="sect3"><a href="publicity.html#security-receiving">&#25509;&#25910;&#25253;&#21578;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-finding-a-fix">&#40664;&#40664;&#30340;&#24320;&#21457;&#20462;&#27491;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-cve">CAN/CVE&#21495;&#30721;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-prenotification">&#39044;&#36890;&#30693;</a></span></dt><dt><span class="sect3"><a href="publicity.html#security-announcing">&#20844;&#24320;&#20998;&#21457;&#20462;&#27491;</a></span></dt></dl></dd></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#23558;&#20195;&#30721;&#20889;&#28165;&#26970;&#30340;&#33021;&#21147;&#25110;&#35768;&#26159;&#24320;&#28304;&#29615;&#22659;&#20013;&#26368;&#37325;&#35201;&#30340;&#19968;&#39033;&#25216;&#24039;&#12290;&#20174;&#38271;&#26399;&#26469;&#30475;&#65292;&#36825;&#19981;&#20165;&#20165;&#21462;&#20915;&#20110;&#32534;&#31243;&#22825;&#36171;&#12290;&#21363;&#20351;&#26159;&#20248;&#31168;&#30340;&#31243;&#24207;&#21592;&#65292;&#22914;&#26524;&#27809;&#26377;&#22909;&#30340;&#27807;&#36890;&#25216;&#24039;&#65292;&#22312;&#21516;&#19968;&#26102;&#38388;&#20063;&#21482;&#33021;&#23436;&#25104;&#19968;&#20214;&#20107;&#65292;&#21363;&#20351;&#22914;&#27492;&#20063;&#24456;&#38590;&#35753;&#20854;&#20182;&#20154;&#27880;&#24847;&#12290;&#20294;&#19968;&#20010;&#31967;&#31957;&#30340;&#31243;&#24207;&#21592;&#22914;&#26524;&#21892;&#20110;&#20132;&#27969;&#65292;&#21017;&#21487;&#20197;&#21327;&#35843;&#24182;&#35828;&#26381;&#35768;&#22810;&#20154;&#20570;&#24456;&#22810;&#20107;&#24773;&#65292;&#23545;&#20110;&#39033;&#30446;&#30340;&#26041;&#21521;&#21644;&#21160;&#21147;&#36215;&#30528;&#37325;&#35201;&#30340;&#20316;&#29992;&#12290;</p><p>&#26080;&#35770;&#20174;&#21738;&#20010;&#26041;&#21521;&#30475;&#65292;&#32534;&#20889;&#22909;&#20195;&#30721;&#30340;&#33021;&#21147;&#21644;&#19982;&#20854;&#20182;&#20154;&#20132;&#27969;&#30340;&#33021;&#21147;&#30475;&#36215;&#26469;&#27627;&#19981;&#30456;&#20851;&#12290;&#32534;&#30721;&#33021;&#21147;&#21644;&#25551;&#36848;&#25216;&#26415;&#38382;&#39064;&#30340;&#33021;&#21147;&#21017;&#26377;&#19968;&#20123;&#20851;&#31995;&#65292;&#20294;&#26159;&#25551;&#36848;&#25216;&#26415;&#38382;&#39064;&#21482;&#26159;&#39033;&#30446;&#20132;&#27969;&#20013;&#24456;&#23567;&#30340;&#19968;&#37096;&#20998;&#12290;&#26356;&#37325;&#35201;&#30340;&#26159;&#31227;&#24773;&#21040;&#20854;&#35835;&#32773;&#30340;&#33021;&#21147;&#65292;&#21487;&#20197;&#20687;&#20854;&#20182;&#20154;&#37027;&#26679;&#21435;&#30475;&#24453;&#33258;&#24049;&#30340;&#25991;&#31456;&#21644;&#22238;&#22797;&#65292;&#21487;&#20197;&#35753;&#20182;&#20154;&#20197;&#21516;&#26679;&#30340;&#23458;&#35266;&#24615;&#30475;&#24453;&#33258;&#24049;&#30340;&#25991;&#31456;&#12290;&#21516;&#26679;&#37325;&#35201;&#30340;&#26159;&#21457;&#29616;&#26576;&#31181;&#23186;&#20171;&#25110;&#20132;&#27969;&#26041;&#27861;&#19981;&#20877;&#26377;&#25928;&#65292;&#36825;&#25110;&#35768;&#26159;&#22240;&#20026;&#23427;&#24182;&#27809;&#26377;&#38543;&#29992;&#25143;&#25968;&#37327;&#30340;&#22686;&#22810;&#32780;&#25193;&#23637;&#65292;&#28982;&#21518;&#33457;&#26102;&#38388;&#21435;&#35299;&#20915;&#23427;&#12290;</p><p>&#22312;&#29702;&#35770;&#19978;&#24456;&#26126;&#26174;&#8212;&#20294;&#22240;&#20026;&#24320;&#28304;&#36719;&#20214;&#24320;&#21457;&#29615;&#22659;&#30340;&#21463;&#20247;&#21644;&#20132;&#27969;&#26426;&#21046;&#24341;&#36215;&#30340;&#28151;&#20081;&#65292;&#22312;&#23454;&#36341;&#20013;&#30340;&#38750;&#24120;&#22256;&#38590;&#12290;&#19968;&#20010;&#32473;&#23450;&#30340;&#24819;&#27861;&#24517;&#39035;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#20316;&#20026;bug&#36319;&#36394;&#31995;&#32479;&#30340;&#27880;&#37322;&#25110;&#20195;&#30721;&#30340;&#35828;&#26126;&#21457;&#24067;&#20986;&#26469;&#65311;&#24403;&#22312;&#19968;&#20010;&#20844;&#20849;&#35770;&#22363;&#22238;&#31572;&#19968;&#20010;&#38382;&#39064;&#26102;&#65292;&#24212;&#35813;&#22914;&#20309;&#20551;&#23450;&#35835;&#32773;&#30340;&#30693;&#35782;&#27700;&#24179;&#65292;&#21482;&#26159;&#20026;&#21672;&#35810;&#38382;&#39064;&#30340;&#8220;&#35835;&#32773;&#8221;&#35299;&#31572;&#65292;&#32780;&#26159;&#20026;&#25152;&#26377;&#20250;&#30475;&#21040;&#22238;&#22797;&#30340;&#35835;&#32773;&#65311;&#22914;&#20309;&#35753;&#24320;&#21457;&#32773;&#19982;&#20854;&#20182;&#29992;&#25143;&#20445;&#25345;&#24314;&#35774;&#24615;&#30340;&#32852;&#31995;&#65292;&#32780;&#36991;&#20813;&#38519;&#20837;&#29305;&#24615;&#35831;&#27714;&#12289;&#34394;&#20551;&#30340;bug&#25253;&#21578;&#21644;&#19968;&#33324;&#30340;&#32842;&#22825;&#12290;&#22914;&#20309;&#30693;&#36947;&#19968;&#20010;&#23186;&#20171;&#36798;&#21040;&#20102;&#23481;&#37327;&#30340;&#38480;&#24230;&#65292;&#20320;&#35813;&#22914;&#20309;&#20570;&#21602;&#65311;</p><p>&#38024;&#23545;&#36825;&#20123;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#37117;&#21482;&#33021;&#26159;&#37096;&#20998;&#30340;&#65292;&#22240;&#20026;&#20219;&#20309;&#29305;&#23450;&#26041;&#26696;&#37117;&#20250;&#38543;&#39033;&#30446;&#32467;&#26500;&#30340;&#25104;&#38271;&#25110;&#21464;&#21270;&#32780;&#24223;&#24323;&#12290;&#20182;&#20204;&#20063;&#32463;&#24120;&#26159;<span class="foreignphrase"><em class="foreignphrase">&#19987;&#38376;&#30340;</em></span>&#26041;&#26696;&#65292;&#22240;&#20026;&#20182;&#20204;&#38656;&#35201;&#38543;&#26426;&#24212;&#21464;&#12290;&#25152;&#26377;&#30340;&#21442;&#19982;&#32773;&#38656;&#35201;&#24847;&#35782;&#21040;&#20132;&#27969;&#22312;&#20309;&#26102;&#65292;&#22914;&#20309;&#38519;&#20837;&#22256;&#22659;&#65292;&#24182;&#31435;&#21051;&#21442;&#19982;&#21040;&#35299;&#20915;&#26041;&#26696;&#20013;&#21435;&#12290;&#24110;&#21161;&#20154;&#20204;&#23436;&#25104;&#36825;&#20214;&#20107;&#26159;&#31649;&#29702;&#24320;&#28304;&#39033;&#30446;&#30340;&#37325;&#35201;&#20219;&#21153;&#12290;&#26412;&#23567;&#33410;&#21518;&#38754;&#30340;&#37096;&#20998;&#20250;&#35752;&#35770;&#22914;&#20309;&#24341;&#23548;&#20320;&#33258;&#24049;&#30340;&#20132;&#27969;&#65292;&#20197;&#21450;&#22914;&#20309;&#22312;&#39033;&#30446;&#20013;&#20026;&#25152;&#26377;&#20154;&#32500;&#25252;&#20132;&#27969;&#26426;&#21046;&#30340;&#20248;&#20808;&#32423;&#12290;<sup>[<a name="idp1756" href="#ftn.idp1756" class="footnote">22</a>]</sup></p></div><div class="sect1" title="&#20154;&#22914;&#20854;&#25991;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="you-are-what-you-write"></a>&#20154;&#22914;&#20854;&#25991;</h2></div></div></div><p>&#32771;&#34385;&#22914;&#19979;&#24773;&#20917;&#65306;&#22240;&#29305;&#32593;&#19978;&#21035;&#20154;&#23545;&#20320;&#30340;&#20102;&#35299;&#37117;&#26469;&#33258;&#20320;&#25152;&#20889;&#30340;&#19996;&#35199;&#12290;&#20320;&#25110;&#35768;&#26159;&#19968;&#20010;&#23500;&#26377;&#25165;&#21326;&#12289;&#25935;&#38160;&#21644;&#39046;&#34966;&#27668;&#36136;&#30340;&#20154;&#8212;&#20294;&#26159;&#22914;&#26524;&#30340;&#20320;&#30340;&#37038;&#20214;&#25955;&#28459;&#19988;&#27809;&#26377;&#32452;&#32455;&#65292;&#20154;&#20204;&#20250;&#20197;&#20026;&#20320;&#20063;&#26159;&#36825;&#26679;&#12290;&#25110;&#32773;&#20063;&#35768;&#20320;&#26159;&#19968;&#20010;&#25955;&#28459;&#21644;&#26080;&#32452;&#32455;&#30340;&#20154;&#65292;&#20294;&#27809;&#20154;&#20250;&#30693;&#36947;&#36825;&#19968;&#28857;&#65292;&#21482;&#35201;&#20320;&#30340;&#25991;&#23383;&#33021;&#22815;&#28165;&#26224;&#19988;&#35328;&#20043;&#26377;&#29289;&#12290;</p><p>&#22312;&#20889;&#20316;&#19978;&#30340;&#25237;&#20837;&#22238;&#25253;&#24040;&#22823;&#12290;&#38271;&#26399;&#33258;&#30001;&#36719;&#20214;&#40657;&#23458;Jim Blandy&#35828;&#36807;&#36825;&#26679;&#19968;&#20010;&#25925;&#20107;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#22238;&#21040;1993&#65292;&#25105;&#20026;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#24037;&#20316;&#65292;&#27491;&#22312;&#20026;GNU Emacs&#30340;19&#29256;&#26412;&#36827;&#34892;beta&#27979;&#35797;&#12290;&#25105;&#20204;&#27599;&#21608;&#37117;&#20250;&#21457;&#24067;&#19968;&#20010;&#36825;&#26679;&#30340;beta&#29256;&#26412;&#65292;&#20154;&#20204;&#20250;&#36827;&#34892;&#27979;&#35797;&#24182;&#22238;&#39304;&#25105;&#20204;bug&#25253;&#21578;&#12290;&#26377;&#19968;&#20010;&#25105;&#20204;&#37117;&#19981;&#35748;&#35782;&#30340;&#20154;&#65292;&#20294;&#26159;&#23436;&#25104;&#30340;&#24037;&#20316;&#24456;&#22909;&#65306;&#20182;&#30340;&#25253;&#21578;&#24635;&#26159;&#21313;&#20998;&#28165;&#26224;&#65292;&#24182;&#33021;&#35753;&#25105;&#20204;&#30452;&#25509;&#25214;&#21040;&#38382;&#39064;&#65292;&#32780;&#19988;&#24403;&#20182;&#33258;&#24049;&#25552;&#20379;&#20462;&#27491;&#26102;&#65292;&#20063;&#20960;&#20046;&#37117;&#26159;&#27491;&#30830;&#30340;&#12290;&#20182;&#26159;&#39030;&#23574;&#20154;&#29289;&#12290;</p><p>&#29616;&#22312;&#65292;&#22312;FSF&#21487;&#20197;&#20351;&#29992;&#20854;&#20182;&#20154;&#32534;&#20889;&#30340;&#20195;&#30721;&#20043;&#21069;&#65292;&#25105;&#20204;&#20250;&#35753;&#20182;&#20204;&#20934;&#22791;&#19968;&#20123;&#25991;&#20070;&#24037;&#20316;&#65292;&#23558;&#35813;&#20195;&#30721;&#30340;&#29256;&#26435;&#21033;&#28070;&#36171;&#20104;&#32473;FSF&#12290;&#23436;&#20840;&#33719;&#24471;&#38476;&#29983;&#20154;&#30340;&#20195;&#30721;&#26159;&#22788;&#29702;&#27861;&#24459;&#28798;&#38590;&#30340;&#22909;&#21150;&#27861;&#12290;</p><p>&#25152;&#20197;&#25105;&#32473;&#36825;&#20010;&#23478;&#20249;&#21457;&#20102;&#19968;&#20221;&#34920;&#21333;&#65292;&#35828;&#65292;&#8220;&#36825;&#37324;&#26159;&#25105;&#20204;&#38656;&#35201;&#30340;&#19968;&#20123;&#25991;&#20070;&#24037;&#20316;&#65292;&#20320;&#31614;&#32626;&#36825;&#19968;&#20221;&#65292;&#35753;&#20320;&#30340;&#38599;&#20027;&#31614;&#21478;&#19968;&#20221;&#65292;&#28982;&#21518;&#25105;&#20204;&#23601;&#21487;&#20197;&#24320;&#22987;&#25552;&#20132;&#20320;&#30340;&#20462;&#27491;&#12290;&#38750;&#24120;&#24863;&#35874;&#12290;&#8221;</p><p>&#20182;&#22238;&#22797;&#20102;&#19968;&#23553;&#20449;&#24687;&#35828;&#65292;&#8220;&#25105;&#27809;&#26377;&#38599;&#20027;&#12290;&#8221;</p><p>&#25152;&#20197;&#25105;&#35828;&#65292;&#8220;&#24456;&#22909;&#65292;&#37027;&#23601;&#35753;&#20320;&#30340;&#22823;&#23398;&#31614;&#32626;&#23427;&#24182;&#21457;&#22238;&#26469;&#12290;&#8221;</p><p>&#19981;&#20037;&#65292;&#20182;&#21448;&#22238;&#22797;&#20102;&#65292;&#24182;&#35828;&#65292;&#8220;&#24456;&#22909;&#65292;&#23454;&#38469;&#19978;&#65292;&#25105;&#24050;&#32463;30&#23681;&#20102;&#65292;&#19982;&#29238;&#27597;&#19968;&#36215;&#20303;&#12290;&#8221;</p></blockquote></div><p>&#22240;&#20026;&#37027;&#20010;&#23567;&#23401;&#24182;&#27809;&#26377;&#20687;30&#23681;&#30340;&#20154;&#37027;&#26679;&#20889;&#19996;&#35199;&#65292;&#25152;&#20197;&#27809;&#26377;&#20154;&#30693;&#36947;&#20182;&#30340;&#24773;&#20917;&#12290;&#19979;&#38754;&#20063;&#26159;&#35753;&#20320;&#30340;&#20889;&#20316;&#33021;&#22815;&#24102;&#26469;&#33391;&#22909;&#21360;&#35937;&#30340;&#19968;&#20123;&#26041;&#27861;&#12290;</p><div class="sect2" title="&#32467;&#26500;&#21644;&#26684;&#24335;"><div class="titlepage"><div><div><h3 class="title"><a name="structure-and-formatting"></a>&#32467;&#26500;&#21644;&#26684;&#24335;</h3></div></div></div><p>&#19981;&#35201;&#20687;&#32534;&#20889;&#25163;&#26426;&#30701;&#20449;&#37027;&#26679;&#32534;&#20889;&#25152;&#26377;&#30340;&#19996;&#35199;&#12290;&#35201;&#20351;&#29992;&#23436;&#25972;&#30340;&#21477;&#23376;&#65292;&#27599;&#20010;&#21477;&#23376;&#39318;&#23383;&#27597;&#35201;&#22823;&#20889;&#65292;&#20063;&#35201;&#26681;&#25454;&#38656;&#35201;&#20998;&#27573;&#12290;&#22312;&#32534;&#20889;&#30005;&#23376;&#37038;&#20214;&#21644;&#20854;&#20182;&#20869;&#23481;&#26102;&#36825;&#19968;&#28857;&#26368;&#37325;&#35201;&#12290;&#22312;IRC&#25110;&#31867;&#20284;&#30340;&#30701;&#21629;&#35770;&#22363;&#19978;&#65292;&#24573;&#30053;&#22823;&#23567;&#20889;&#25110;&#21387;&#32553;&#24418;&#24335;&#30340;&#24120;&#35265;&#30701;&#35821;&#20063;&#26080;&#25152;&#35859;&#12290;&#21482;&#26159;&#19981;&#35201;&#25226;&#36825;&#20010;&#20064;&#24815;&#24102;&#21040;&#26356;&#27491;&#24335;&#65292;&#20250;&#25345;&#20037;&#21270;&#20445;&#23384;&#30340;&#35770;&#22363;&#20013;&#12290;&#37038;&#20214;&#12289;&#25991;&#26723;&#12289;bug&#25253;&#21578;&#21644;&#20854;&#20182;&#20250;&#27704;&#20037;&#20445;&#23384;&#30340;&#19996;&#35199;&#65292;&#24517;&#39035;&#20351;&#29992;&#26631;&#20934;&#35821;&#27861;&#21644;&#25340;&#20889;&#65292;&#24182;&#26377;&#19968;&#33268;&#30340;&#21465;&#20107;&#32467;&#26500;&#12290;&#24182;&#19981;&#26159;&#22240;&#20026;&#20219;&#20309;&#20107;&#24773;&#37117;&#26377;&#36981;&#24490;&#20219;&#24847;&#35268;&#21017;&#30340;&#20869;&#22312;&#29305;&#24615;&#65292;&#32780;&#26159;&#22240;&#20026;&#35268;&#21017;&#24182;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#20219;&#24847;&#30340;&#65306;&#20182;&#20204;&#28436;&#21270;&#25104;&#29616;&#22312;&#30340;&#24418;&#24335;&#26159;&#22240;&#20026;&#21487;&#20197;&#35753;&#25991;&#26412;&#26356;&#21487;&#35835;&#65292;&#22240;&#27492;&#20320;&#24212;&#35813;&#36981;&#24490;&#36825;&#20123;&#35268;&#21017;&#12290;&#21487;&#35835;&#24615;&#26159;&#20196;&#20154;&#21521;&#24448;&#30340;&#65292;&#24182;&#19981;&#26159;&#22240;&#20026;&#36825;&#26679;&#20154;&#20204;&#23601;&#33021;&#22815;&#29702;&#35299;&#20320;&#25152;&#20889;&#30340;&#65292;&#32780;&#19988;&#26159;&#22240;&#20026;&#36825;&#26679;&#21487;&#20197;&#35753;&#20320;&#30475;&#36215;&#26469;&#20687;&#26159;&#20154;&#20204;&#21487;&#20197;&#33457;&#26102;&#38388;&#36827;&#34892;&#28165;&#26224;&#20132;&#27969;&#30340;&#20154;&#65306;&#20063;&#23601;&#26159;&#20540;&#24471;&#20154;&#20204;&#20851;&#27880;&#30340;&#20154;&#12290;</p><p>&#23545;&#20110;&#20010;&#21035;&#30340;&#30005;&#23376;&#37038;&#20214;&#65292;&#26377;&#32463;&#39564;&#30340;&#24320;&#28304;&#24320;&#21457;&#32773;&#20250;&#20351;&#29992;&#29305;&#23450;&#30340;&#32422;&#23450;&#65306;</p><p>&#21482;&#21457;&#36865;&#25991;&#26412;&#37038;&#20214;&#65292;&#32780;&#19981;&#24212;&#35813;&#26159;HTML&#12289;&#23500;&#25991;&#26412;&#25110;&#20854;&#20182;&#26684;&#24335;&#65292;&#22240;&#20026;&#26377;&#35768;&#22810;&#21482;&#25903;&#25345;&#25991;&#26412;&#30340;&#37038;&#20214;&#38405;&#35835;&#22120;&#12290;&#23558;&#27599;&#34892;&#21015;&#38271;&#26684;&#24335;&#21270;&#20026;72&#12290;&#21015;&#38271;&#19981;&#35201;&#36229;&#36807;80&#65292;80&#24050;&#32463;&#25104;&#20026;<span class="foreignphrase"><em class="foreignphrase">&#20107;&#23454;&#19978;&#30340;</em></span>&#26631;&#20934;&#32456;&#31471;&#23485;&#24230;&#65288;&#20063;&#23601;&#26159;&#20250;&#26377;&#20154;&#20351;&#29992;&#26356;&#23485;&#30340;&#32456;&#31471;&#65292;&#20294;&#27809;&#26377;&#26356;&#31364;&#30340;&#65289;&#12290;&#36890;&#36807;&#23558;&#21015;&#25968;&#35774;&#32622;&#20026;<span class="emphasis"><em>&#23567;&#20110;</em></span>80&#65292;&#21487;&#20197;&#20026;&#20854;&#20182;&#20154;&#22238;&#22797;&#20013;&#30340;&#24341;&#29992;&#23383;&#31526;&#30041;&#20986;&#31354;&#38388;&#65292;&#20174;&#32780;&#19981;&#24517;&#35753;&#25991;&#26412;&#24378;&#21046;&#25442;&#34892;&#12290;</p><p><span class="emphasis"><em>&#20351;&#29992;&#30495;&#27491;&#30340;&#25442;&#34892;&#12290;</em></span>&#19968;&#20123;&#37038;&#20214;&#31243;&#24207;&#21487;&#20197;&#20351;&#29992;&#19968;&#31181;&#20551;&#30340;&#25442;&#34892;&#65292;&#21487;&#20197;&#35753;&#20320;&#32534;&#20889;&#30340;&#37038;&#20214;&#22312;&#27809;&#26377;&#23454;&#38469;&#25442;&#34892;&#26102;&#26174;&#31034;&#20986;&#26469;&#26377;&#25442;&#34892;&#12290;&#24403;&#37038;&#20214;&#21457;&#36865;&#20197;&#21518;&#65292;&#37038;&#20214;&#19981;&#20250;&#26377;&#20320;&#25152;&#20197;&#20026;&#30340;&#25442;&#34892;&#65292;&#20182;&#20204;&#20250;&#38750;&#24120;&#38590;&#30475;&#30340;&#20986;&#29616;&#22312;&#26576;&#20123;&#20154;&#30340;&#23631;&#24149;&#19978;&#12290;&#22914;&#26524;&#20320;&#30340;&#37038;&#20214;&#31243;&#24207;&#20351;&#29992;&#20551;&#25442;&#34892;&#65292;&#24212;&#35813;&#25214;&#19968;&#20010;&#24688;&#24403;&#30340;&#35774;&#32622;&#65292;&#21487;&#20197;&#22312;&#32534;&#20889;&#37038;&#20214;&#26102;&#26174;&#31034;&#30495;&#25442;&#34892;&#12290;</p><p>&#24403;&#21253;&#21547;&#23631;&#24149;&#36755;&#20986;&#65292;&#20195;&#30721;&#29255;&#27573;&#25110;&#20854;&#20182;&#26684;&#24335;&#21270;&#25991;&#26412;&#26102;&#65292;&#38656;&#35201;&#28165;&#26224;&#30340;&#22788;&#29702;&#32553;&#36827;&#65292;&#36825;&#26679;&#21487;&#20197;&#36731;&#26131;&#30340;&#21306;&#20998;&#20320;&#30340;&#21465;&#36848;&#21644;&#24341;&#29992;&#30340;&#20869;&#23481;&#12290; &#65288;&#24403;&#25105;&#24320;&#22987;&#25776;&#20889;&#27492;&#20070;&#26102;&#65292;&#25105;&#27809;&#26377;&#24819;&#36807;&#32534;&#20889;&#36825;&#20123;&#24314;&#35758;&#65292;&#20294;&#26159;&#24403;&#22312;&#35768;&#22810;&#24320;&#28304;&#37038;&#20214;&#21015;&#34920;&#20013;&#30475;&#21040;&#20102;&#24456;&#22810;&#20154;&#28151;&#21512;&#25991;&#26412;&#21644;&#20854;&#20182;&#36164;&#28304;&#65292;&#20197;&#33267;&#20110;&#26080;&#27861;&#21306;&#20998;&#24320;&#26102;&#65292;&#25105;&#25913;&#21464;&#20102;&#27880;&#24847;&#12290;&#36825;&#26679;&#30340;&#25928;&#26524;&#24456;&#35753;&#20154;&#28784;&#24515;&#12290;&#36825;&#35753;&#20182;&#20204;&#30340;&#25991;&#31456;&#24456;&#38590;&#34987;&#29702;&#35299;&#65292;&#24456;&#26126;&#26174;&#20063;&#35753;&#36825;&#20123;&#20154;&#30475;&#36215;&#26469;&#26377;&#28857;&#28151;&#20081;&#12290;&#65289;</p><p>&#24403;&#24341;&#29992;&#20854;&#20182;&#20154;&#30340;&#37038;&#20214;&#26102;&#65292;&#21487;&#20197;&#30452;&#25509;&#22312;&#21512;&#36866;&#30340;&#20301;&#32622;&#25554;&#20837;&#20320;&#30340;&#22238;&#24212;&#65292;&#22914;&#26524;&#38656;&#35201;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#20301;&#32622;&#65292;&#28982;&#21518;&#21024;&#33410;&#37027;&#20123;&#22312;&#20320;&#30340;&#37038;&#20214;&#19981;&#20351;&#29992;&#30340;&#37096;&#20998;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#20026;&#20840;&#25991;&#36827;&#34892;&#35780;&#36848;&#65292;&#21487;&#20197;&#20889;&#22312;<em class="firstterm">&#39030;&#37096;</em>&#65288;&#23558;&#20320;&#30340;&#22238;&#24212;&#32622;&#20110;&#24341;&#29992;&#30340;&#37038;&#20214;&#25991;&#26412;&#20043;&#21069;&#65289;&#65307;&#21542;&#21017;&#65292;&#35831;&#39318;&#20808;&#24341;&#36848;&#21407;&#37038;&#20214;&#30340;&#30456;&#20851;&#25991;&#26412;&#65292;&#28982;&#21518;&#32039;&#36319;&#20320;&#30340;&#22238;&#24212;&#12290;</p><p>&#23567;&#24515;&#26500;&#24314;&#26032;&#37038;&#20214;&#30340;&#20027;&#39064;&#34892;&#12290;&#36825;&#26159;&#37038;&#20214;&#20013;&#26368;&#37325;&#35201;&#30340;&#19968;&#34892;&#65292;&#22240;&#20026;&#23427;&#21487;&#20197;&#35753;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#20154;&#20915;&#23450;&#26159;&#21542;&#36827;&#19968;&#27493;&#38405;&#35835;&#12290;&#29616;&#20195;&#37038;&#20214;&#38405;&#35835;&#36719;&#20214;&#21487;&#20197;&#23558;&#30456;&#20851;&#20449;&#24687;&#32452;&#32455;&#25104;&#19968;&#32452;&#32447;&#32034;&#65292;&#24182;&#19981;&#20165;&#20165;&#26159;&#26681;&#25454;&#20849;&#21516;&#30340;&#20027;&#39064;&#65292;&#32780;&#19988;&#21487;&#20197;&#26681;&#25454;&#20854;&#20182;&#22836;&#65288;&#26377;&#26102;&#24182;&#19981;&#26174;&#31034;&#65289;&#12290;&#23427;&#36981;&#24490;&#20102;&#22914;&#19979;&#21407;&#21017;&#65292;&#22914;&#26524;&#32447;&#32034;&#36716;&#31227;&#21040;&#21478;&#19968;&#20010;&#20027;&#39064;&#65292;&#20320;&#21487;&#20197;&#8212;&#20063;&#24517;&#39035;&#8212;&#26681;&#25454;&#22238;&#22797;&#20462;&#25913;&#20027;&#39064;&#34892;&#12290;&#30001;&#20110;&#20854;&#20182;&#37038;&#20214;&#22836;&#65292;&#32447;&#32034;&#30340;&#23436;&#25972;&#24615;&#24471;&#20197;&#20445;&#20840;&#65292;&#20294;&#26159;&#26032;&#30340;&#20027;&#39064;&#21487;&#20197;&#24110;&#21161;&#20154;&#20204;&#33719;&#30693;&#20027;&#39064;&#24050;&#32463;&#36716;&#31227;&#12290;&#21516;&#26679;&#30340;&#65292;&#22914;&#26524;&#20320;&#30830;&#23454;&#24076;&#26395;&#24320;&#22987;&#19968;&#20010;&#26032;&#30340;&#20027;&#39064;&#65292;&#37027;&#20040;&#21487;&#20197;&#21457;&#24067;&#19968;&#20010;&#26032;&#30340;&#37038;&#20214;&#65292;&#32780;&#19981;&#26159;&#23545;&#29616;&#26377;&#37038;&#20214;&#20462;&#25913;&#20027;&#39064;&#24182;&#22238;&#22797;&#12290;&#21542;&#21017;&#65292;&#20320;&#30340;&#37038;&#20214;&#20250;&#20173;&#28982;&#20998;&#32452;&#21040;&#20320;&#25152;&#22238;&#22797;&#30340;&#32447;&#31243;&#20013;&#65292;&#22240;&#27492;&#20250;&#35753;&#20154;&#20204;&#19981;&#30693;&#36947;&#35752;&#35770;&#30340;&#20869;&#23481;&#24050;&#32463;&#25913;&#21464;&#12290;&#20877;&#27425;&#65292;&#24809;&#32602;&#19981;&#20165;&#20165;&#26159;&#25152;&#28010;&#36153;&#30340;&#26102;&#38388;&#65292;&#20063;&#20250;&#20351;&#20320;&#20351;&#29992;&#20132;&#27969;&#24037;&#20855;&#30340;&#20449;&#29992;&#21463;&#25439;&#12290;</p></div><div class="sect2" title="&#20869;&#23481;"><div class="titlepage"><div><div><h3 class="title"><a name="writing-content"></a>&#20869;&#23481;</h3></div></div></div><p>&#32452;&#32455;&#33391;&#22909;&#30340;&#37038;&#20214;&#20250;&#21560;&#24341;&#35835;&#32773;&#65292;&#20294;&#26159;&#20869;&#23481;&#21487;&#20197;&#30041;&#20303;&#20182;&#20204;&#12290;&#24403;&#28982;&#65292;&#27809;&#26377;&#21487;&#20197;&#30830;&#20445;&#22909;&#20869;&#23481;&#30340;&#22266;&#23450;&#35268;&#21017;&#65292;&#20294;&#26159;&#26377;&#19968;&#20123;&#21487;&#20197;&#35753;&#20854;&#26356;&#20687;&#30340;&#21407;&#29702;&#12290;</p><p>&#35753;&#20107;&#24773;&#23545;&#20320;&#30340;&#35835;&#32773;&#26356;&#31616;&#21333;&#12290;&#20219;&#20309;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#37117;&#26377;&#22823;&#37327;&#30340;&#20449;&#24687;&#65292;&#19981;&#33021;&#26399;&#26395;&#35835;&#32773;&#29087;&#24713;&#25152;&#26377;&#30340;&#19996;&#35199;&#8212;&#20107;&#23454;&#19978;&#65292;&#19981;&#21487;&#33021;&#26399;&#26395;&#20182;&#20204;&#30693;&#36947;&#22914;&#20309;&#29087;&#24713;&#12290;&#25152;&#20197;&#35201;&#23613;&#21487;&#33021;&#35753;&#20320;&#30340;&#25991;&#31456;&#20197;&#23613;&#37327;&#20415;&#21033;&#30340;&#24418;&#24335;&#25552;&#20379;&#32473;&#35835;&#32773;&#12290;&#22914;&#26524;&#20320;&#33021;&#22815;&#39069;&#22806;&#33457;&#36153;&#20960;&#20998;&#38047;&#22312;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#20013;&#25214;&#20986;&#29305;&#23450;&#32447;&#32034;&#30340;URL&#26102;&#65292;&#20174;&#32780;&#20943;&#23569;&#35835;&#32773;&#23547;&#25214;&#30340;&#40635;&#28902;&#65292;&#36825;&#26679;&#20570;&#38750;&#24120;&#20540;&#24471;&#12290;&#22914;&#26524;&#20320;&#21487;&#20197;&#33457;&#36153;5&#21040;10&#20998;&#38047;&#20026;&#22797;&#26434;&#30340;&#32447;&#32034;&#24635;&#32467;&#19968;&#20010;&#32467;&#35770;&#65292;&#20174;&#32780;&#20026;&#20154;&#20204;&#29702;&#35299;&#20320;&#30340;&#25991;&#31456;&#25552;&#20379;&#19968;&#20010;&#19978;&#19979;&#25991;&#29615;&#22659;&#65292;&#37027;&#20040;&#19968;&#23450;&#35201;&#21435;&#20570;&#12290;&#21487;&#20197;&#36825;&#26679;&#32771;&#34385;&#36825;&#20214;&#20107;&#65292;&#39033;&#30446;&#36234;&#25104;&#21151;&#65292;&#22312;&#20219;&#20309;&#35770;&#22363;&#20013;&#30340;&#35835;&#32773;-&#20316;&#32773;&#27604;&#29575;&#36234;&#39640;&#12290;&#22914;&#26524;&#20320;&#30340;&#25991;&#31456;&#34987;<span class="emphasis"><em>n</em></span>&#20010;&#29992;&#25143;&#30475;&#21040;&#65292;&#37027;&#20040;&#38543;&#30528;<span class="emphasis"><em>n</em></span>&#30340;&#22686;&#22823;&#65292;&#25193;&#23637;&#39069;&#22806;&#30340;&#21162;&#21147;&#33410;&#32422;&#20854;&#20182;&#20154;&#30340;&#26102;&#38388;&#23601;&#36234;&#20540;&#24471;&#12290;&#38543;&#30528;&#20154;&#20204;&#30475;&#21040;&#20320;&#23558;&#33258;&#24049;&#32622;&#20110;&#36825;&#20010;&#26631;&#20934;&#20043;&#19979;&#65292;&#20182;&#20204;&#20063;&#20250;&#22312;&#33258;&#24049;&#30340;&#20132;&#27969;&#20013;&#19982;&#27492;&#21305;&#37197;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#20250;&#24102;&#26469;&#39033;&#30446;&#25972;&#20307;&#25928;&#29575;&#30340;&#25552;&#21319;&#65306;&#24403;&#20154;&#20204;&#22312;<span class="emphasis"><em>n</em></span>&#20010;&#20154;&#21644;&#19968;&#20010;&#20154;&#36825;&#26679;&#21162;&#21147;&#20570;&#20986;&#36873;&#25321;&#26102;&#65292;&#22823;&#23478;&#20250;&#36873;&#25321;&#21069;&#32773;&#12290;</p><p>&#19981;&#35201;&#20351;&#29992;&#22840;&#24352;&#27861;&#12290;&#22312;&#32447;&#21457;&#24067;&#20013;&#30340;&#22840;&#22823;&#26159;&#32463;&#20856;&#30340;&#20891;&#22791;&#31454;&#36187;&#12290;&#20363;&#22914;&#65292;&#19968;&#20123;&#25253;&#21578;bug&#30340;&#20154;&#20250;&#25285;&#24515;&#24320;&#21457;&#32773;&#19981;&#20250;&#25237;&#20837;&#36275;&#22815;&#30340;&#27880;&#24847;&#21147;&#65292;&#25152;&#20197;&#20182;&#20204;&#23558;&#20854;&#25551;&#36848;&#20026;&#20005;&#37325;&#30340;&#12289;&#20250;&#20013;&#26029;&#20182;&#65288;&#20197;&#21450;&#20182;&#30340;&#25152;&#26377;&#26379;&#21451;/&#21516;&#20107;/&#20146;&#25114;&#65289;&#20351;&#29992;&#35813;&#36719;&#20214;&#30340;&#38382;&#39064;&#65292;&#32780;&#23454;&#38469;&#19978;&#21482;&#26159;&#19968;&#33324;&#30340;&#19981;&#36866;&#12290;&#20294;&#26159;&#22840;&#22823;&#24182;&#19981;&#38480;&#20110;&#29992;&#25143;&#8212;&#31243;&#24207;&#21592;&#20063;&#20250;&#22312;&#25216;&#26415;&#35752;&#35770;&#26102;&#20063;&#36825;&#26679;&#20570;&#65292;&#29305;&#21035;&#26159;&#24403;&#38382;&#39064;&#26159;&#20851;&#20110;&#20182;&#20204;&#19981;&#35748;&#21487;&#30340;&#26576;&#31181;&#21475;&#21619;&#32780;&#19981;&#26159;&#27491;&#30830;&#24615;&#26102;&#12290;</p><div class="blockquote"><blockquote class="blockquote"><p>&#8220;&#36825;&#26679;&#20570;&#20107;&#20250;&#35753;&#20195;&#30721;&#23436;&#20840;&#19981;&#21487;&#35835;&#12290; &#19982;J. Random&#30340;&#24314;&#35758;&#30456;&#27604;&#65292;&#36825;&#26159;&#32500;&#25252;&#30340;&#26790;&#39751;&#12290;&#8221;</p></blockquote></div><p>&#24403;&#25514;&#36766;&#19981;&#26159;&#22914;&#27492;&#23574;&#38160;&#65292;&#21516;&#26679;&#30340;&#24863;&#24773;&#20063;&#20250;&#21464;&#24471;<span class="emphasis"><em>&#26356;&#24378;</em></span>&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#8220;&#36825;&#26679;&#20063;&#21487;&#20197;&#24037;&#20316;&#65292;&#20294;&#26159;&#20986;&#20110;&#21487;&#35835;&#24615;&#21644;&#21487;&#32500;&#25252;&#24615;&#30340;&#32771;&#34385;&#65292;&#24182;&#19981;&#26159;&#29702;&#24819;&#30340;&#26041;&#24335;&#65292;&#25105;&#35748;&#20026;&#12290;J. Random's&#30340;&#24314;&#35758;&#36991;&#20813;&#20102;&#36825;&#31867;&#38382;&#39064;&#65292;&#22240;&#20026;&#23427;...&#8221;</p></blockquote></div><p>&#20320;&#19981;&#21487;&#33021;&#23436;&#20840;&#28040;&#28781;&#22840;&#22823;&#65292;&#19968;&#33324;&#26469;&#35828;&#20063;&#27809;&#26377;&#24517;&#35201;&#12290;&#19982;&#20854;&#20182;&#24418;&#24335;&#30340;&#20132;&#27969;&#38382;&#39064;&#30456;&#27604;&#65292;&#22840;&#22823;&#24182;&#19981;&#26159;&#23545;&#25152;&#26377;&#20154;&#37117;&#26377;&#23475;&#8212;&#20182;&#21482;&#20250;&#20260;&#23475;&#22840;&#22823;&#32773;&#12290;&#25509;&#25910;&#32773;&#20063;&#20250;&#20570;&#20986;&#30456;&#24212;&#30340;&#25269;&#28040;&#65292;&#27599;&#27425;&#37117;&#20250;&#35753;&#21457;&#36865;&#32773;&#25439;&#22833;&#33258;&#24049;&#30340;&#20449;&#29992;&#12290;&#22240;&#27492;&#65292;&#20026;&#20102;&#20320;&#33258;&#24049;&#22312;&#39033;&#30446;&#30340;&#24433;&#21709;&#21147;&#65292;&#35831;&#20351;&#29992;&#28201;&#21644;&#30340;&#26041;&#24335;&#12290;&#21482;&#26377;&#36825;&#26679;&#65292;&#20154;&#20204;&#22312;&#20250;&#22312;&#20320;<span class="emphasis"><em>&#30495;&#30340;</em></span>&#38656;&#35201;&#34920;&#36798;&#24378;&#28872;&#35266;&#28857;&#26102;&#37325;&#35270;&#20320;&#12290;</p><p>&#32534;&#36753;&#20004;&#27425;&#12290;&#23545;&#20110;&#20219;&#20309;&#36229;&#36807;&#20013;&#31561;&#38271;&#24230;&#27573;&#33853;&#30340;&#20449;&#24687;&#65292;&#35831;&#22312;&#20320;&#31532;&#19968;&#27425;&#35748;&#20026;&#23436;&#25104;&#20043;&#21518;&#20877;&#20174;&#22836;&#21040;&#23614;&#26816;&#26597;&#19968;&#36941;&#12290;&#36825;&#26159;&#25152;&#26377;&#21442;&#21152;&#36807;&#20889;&#20316;&#35838;&#31243;&#30340;&#20154;&#20250;&#24471;&#21040;&#30340;&#24544;&#21578;&#65292;&#20294;&#26159;&#22312;&#22312;&#32447;&#35752;&#35770;&#20013;&#26684;&#22806;&#37325;&#35201;&#12290;&#22240;&#20026;&#22312;&#32447;&#20889;&#20316;&#30340;&#36807;&#31243;&#24456;&#23481;&#26131;&#21464;&#24471;&#38750;&#24120;&#19981;&#36830;&#36143;&#65288;&#22312;&#32534;&#20889;&#20449;&#24687;&#30340;&#36807;&#31243;&#20013;&#65292;&#20320;&#38656;&#35201;&#22238;&#22836;&#26816;&#26597;&#20854;&#20182;&#37038;&#20214;&#65292;&#35775;&#38382;&#29305;&#23450;&#30340;&#32593;&#39029;&#65292;&#25110;&#32773;&#36816;&#34892;&#26576;&#20010;&#21629;&#20196;&#25429;&#33719;&#35843;&#35797;&#20449;&#24687;&#31561;&#65289;&#65292;&#36825;&#26679;&#24456;&#23481;&#26131;&#35753;&#20320;&#22833;&#21435;&#21465;&#20107;&#30340;&#24863;&#35273;&#12290;&#19981;&#36830;&#36143;&#32534;&#20889;&#30340;&#20449;&#24687;&#65292;&#32780;&#19988;&#22312;&#21457;&#36865;&#20197;&#21069;&#20063;&#19981;&#26816;&#26597;&#36890;&#24120;&#20250;&#34987;&#35748;&#20026;&#20250;&#35753;&#20182;&#20204;&#30340;&#20316;&#32773;&#25034;&#24700;&#65288;&#25110;&#32773;&#36825;&#26679;&#26576;&#20154;&#20250;&#24076;&#26395;&#65289;&#12290;&#33457;&#26102;&#38388;&#26816;&#26597;&#20320;&#21457;&#36865;&#30340;&#20869;&#23481;&#12290;&#20320;&#30340;&#20869;&#23481;&#32452;&#32455;&#30340;&#36234;&#22909;&#65292;&#23601;&#20250;&#26377;&#36234;&#22810;&#30340;&#20154;&#21435;&#38405;&#35835;&#12290;</p></div><div class="sect2" title="&#22522;&#35843;"><div class="titlepage"><div><div><h3 class="title"><a name="writing-tone"></a>&#22522;&#35843;</h3></div></div></div><p>&#22312;&#20889;&#36807;&#20960;&#21315;&#26465;&#20449;&#24687;&#21518;&#65292;&#20320;&#19968;&#23450;&#20250;&#21457;&#29616;&#33258;&#24049;&#20250;&#36235;&#21521;&#20110;&#31616;&#27905;&#12290;&#36825;&#30475;&#36215;&#26469;&#26159;&#22823;&#22810;&#25968;&#25216;&#26415;&#35770;&#22363;&#30340;&#26631;&#20934;&#65292;&#22312;&#26412;&#36136;&#19978;&#27809;&#26377;&#20219;&#20309;&#38169;&#35823;&#12290;&#22312;&#31038;&#20250;&#20132;&#27969;&#20013;&#19981;&#21487;&#25509;&#21463;&#30340;&#31616;&#27905;&#31243;&#24230;&#21017;&#26159;&#33258;&#30001;&#36719;&#20214;&#40657;&#23458;&#30340;&#40664;&#35748;&#31243;&#24230;&#12290;&#19979;&#38754;&#26159;&#25105;&#22312;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#20013;&#21457;&#34920;&#30340;&#20851;&#20110;&#33258;&#30001;&#20869;&#23481;&#31649;&#29702;&#36719;&#20214;&#30340;&#25991;&#31456;&#65292;&#23436;&#20840;&#24341;&#29992;&#65306;</p><pre class="screen">
&#24744;&#33021;&#26356;&#35814;&#32454;&#30340;&#35828;&#19968;&#19979;&#25152;&#36935;&#21040;&#30340;&#38382;&#39064;&#21527;&#65311;
&#21487;&#33021;&#26159;&#65306;

&#24744;&#20351;&#29992;&#20160;&#20040;&#29256;&#26412;&#30340;Slash&#65311;&#20320;&#33021;&#35828;&#20986;&#21407;&#22987;&#20449;&#24687;&#21527;&#12290;
&#20320;&#26159;&#22914;&#20309;&#32534;&#35793;&#30340;apache/mod_perl&#28304;&#65311;

&#20320;&#23581;&#35797;&#36807;&#21457;&#24067;&#22312;slashcode.com&#30340;Apache 2.0&#34917;&#19969;&#21527;&#65311;

  Shane
</pre><p>&#36825;<span class="emphasis"><em>&#23601;&#26159;</em></span>&#31616;&#27905;&#65281;&#27809;&#26377;&#38382;&#20505;&#65292;&#27809;&#26377;&#20182;&#30340;&#21517;&#23383;&#20197;&#22806;&#30340;&#31614;&#21517;&#65292;&#25972;&#20010;&#20449;&#24687;&#26412;&#36523;&#21482;&#26377;&#19968;&#31995;&#21015;&#23613;&#21487;&#33021;&#32039;&#20945;&#30340;&#30097;&#38382;&#21477;&#12290;&#20854;&#20013;&#30340;&#19968;&#20010;&#31048;&#20351;&#35821;&#21477;&#26159;&#38544;&#21547;&#30340;&#23545;&#21407;&#22987;&#20449;&#24687;&#30340;&#25209;&#35780;&#12290;&#34429;&#28982;&#22914;&#27492;&#65292;&#25105;&#36824;&#26159;&#24456;&#39640;&#20852;&#30475;&#21040;Shane&#30340;&#37038;&#20214;&#65292;&#24182;&#27809;&#26377;&#22240;&#20026;&#20854;&#31616;&#27905;&#32780;&#25226;&#20182;&#24403;&#20316;&#19968;&#20010;&#22823;&#24537;&#20154;&#12290;&#20107;&#23454;&#20165;&#20165;&#26159;&#20182;&#20204;&#22312;&#35810;&#38382;&#38382;&#39064;&#65292;&#32780;&#19981;&#26159;&#24573;&#30053;&#25105;&#30340;&#38382;&#39064;&#65292;&#24847;&#21619;&#30528;&#20182;&#24895;&#24847;&#22312;&#36825;&#20010;&#38382;&#39064;&#19978;&#33457;&#26356;&#22810;&#30340;&#26102;&#38388;&#12290;</p><p>&#35835;&#32773;&#33021;&#22815;&#23545;&#36825;&#31181;&#26041;&#24335;&#20316;&#20986;&#27491;&#38754;&#30340;&#21453;&#24212;&#21527;&#65311;&#36825;&#19981;&#26159;&#24517;&#39035;&#30340;&#65307;&#36825;&#21462;&#20915;&#20110;&#20154;&#21644;&#19978;&#19979;&#25991;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#26576;&#20154;&#21018;&#21018;&#25215;&#35748;&#22905;&#29359;&#20102;&#19968;&#20010;&#38169;&#35823;&#65288;&#20363;&#22914;&#20889;&#20102;&#19968;&#20010;bug&#65289;&#65292;&#32780;&#20320;&#26681;&#25454;&#20197;&#21069;&#30340;&#32463;&#39564;&#30693;&#36947;&#36825;&#20010;&#20154;&#23481;&#26131;&#19981;&#23433;&#20840;&#65292;&#37027;&#20040;&#20320;&#20173;&#20250;&#32534;&#20889;&#19968;&#20010;&#32039;&#20945;&#30340;&#22238;&#22797;&#65292;&#20320;&#24212;&#24403;&#30830;&#20449;&#20854;&#20013;&#21253;&#21547;&#19968;&#20123;&#32771;&#34385;&#20854;&#24863;&#21463;&#30340;&#20869;&#23481;&#12290;&#20320;&#30340;&#22238;&#22797;&#21487;&#33021;&#24456;&#31616;&#30701;&#65292;&#21482;&#26377;&#24037;&#31243;&#24072;&#23545;&#20110;&#24418;&#24335;&#30340;&#20998;&#26512;&#65292;&#21644;&#20320;&#24819;&#30340;&#19968;&#26679;&#31616;&#27905;&#12290;&#20294;&#26159;&#22312;&#26368;&#21518;&#65292;&#24212;&#35813;&#25351;&#26126;&#20320;&#30340;&#31616;&#27905;&#19981;&#24212;&#35813;&#29702;&#35299;&#20026;&#20919;&#28448;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#35201;&#24314;&#35758;&#22914;&#20309;&#27491;&#30830;&#30340;&#20462;&#27491;&#26576;&#20010;bug&#65292;&#24212;&#35813;&#31614;&#32626;&#8220;&#22909;&#36816;&#65292;&lt;&#36825;&#37324;&#26159;&#20320;&#30340;&#21517;&#23383;&gt;&#8221;&#25351;&#26126;&#20320;&#24076;&#26395;&#20182;&#20204;&#20570;&#22909;&#24037;&#20316;&#32780;&#19981;&#20250;&#21457;&#30127;&#12290;&#19968;&#20010;&#31505;&#33080;&#25110;&#20854;&#20182;&#31526;&#21495;&#34920;&#24773;&#36890;&#24120;&#20063;&#36275;&#22815;&#23433;&#25242;&#20320;&#30340;&#23545;&#35805;&#32773;&#12290;</p><p>&#20063;&#35768;&#20687;&#20851;&#24515;&#21442;&#19982;&#32773;&#25152;&#35828;&#20107;&#24773;&#30340;&#34920;&#38754;&#19968;&#26679;&#20851;&#24515;&#20854;&#24773;&#32490;&#26377;&#19968;&#20123;&#21476;&#24618;&#65292;&#20294;&#26159;&#35748;&#30495;&#30340;&#35828;&#65292;&#24773;&#32490;&#24433;&#21709;&#29983;&#20135;&#21147;&#12290;&#30001;&#20110;&#20854;&#20182;&#21407;&#22240;&#24773;&#32490;&#20063;&#38750;&#24120;&#37325;&#35201;&#65292;&#20294;&#22914;&#26524;&#20165;&#20986;&#20110;&#21151;&#21033;&#21407;&#22240;&#65292;&#25105;&#20204;&#20063;&#33021;&#21457;&#29616;&#19981;&#24555;&#20048;&#30340;&#20154;&#20250;&#20889;&#20986;&#31967;&#31957;&#30340;&#36719;&#20214;&#12290;&#22240;&#20026;&#22823;&#22810;&#25968;&#30005;&#23376;&#23186;&#20171;&#30340;&#26412;&#24615;&#25152;&#38480;&#65292;&#36890;&#24120;&#27809;&#26377;&#20851;&#20110;&#20154;&#20204;&#24773;&#32490;&#30340;&#26126;&#26174;&#32447;&#32034;&#12290;&#20320;&#24212;&#35813;&#26681;&#25454;&#36825;&#20123;&#29468;&#27979;&#65306;a)&#22823;&#22810;&#25968;&#20154;&#22312;&#37027;&#31181;&#24418;&#21183;&#19979;&#30340;&#24863;&#35273;&#65292;b)&#20320;&#22312;&#20197;&#21069;&#30340;&#20132;&#27969;&#20013;&#23545;&#21442;&#19982;&#32773;&#30340;&#20102;&#35299;&#12290;&#19968;&#20123;&#20154;&#37319;&#29992;&#26356;&#31616;&#21333;&#30340;&#24577;&#24230;&#65292;&#20165;&#26681;&#25454;&#34920;&#38754;&#22788;&#29702;&#20107;&#24773;&#65292;&#22914;&#26524;&#27809;&#26377;&#21442;&#19982;&#32773;&#30452;&#25509;&#35828;&#20986;&#33258;&#24049;&#30340;&#24863;&#21463;&#65292;&#21017;&#21035;&#20154;&#27809;&#26377;&#20041;&#21153;&#20687;&#20182;&#24050;&#32463;&#35828;&#20986;&#37027;&#26679;&#21435;&#23545;&#24453;&#22905;&#12290;&#25105;&#19981;&#20250;&#36873;&#29992;&#36825;&#20010;&#26041;&#27861;&#65292;&#26377;&#22914;&#19979;&#19968;&#20123;&#21407;&#22240;&#12290;&#39318;&#20808;&#65292;&#20154;&#20204;&#22312;&#30495;&#23454;&#29983;&#27963;&#20013;&#24182;&#19981;&#26159;&#36825;&#26679;&#22788;&#20107;&#30340;&#65292;&#20026;&#20160;&#20040;&#35201;&#22312;&#32447;&#19978;&#36825;&#26679;&#65311;&#20854;&#27425;&#65292;&#22240;&#20026;&#25152;&#26377;&#30340;&#20114;&#21160;&#21457;&#29983;&#22312;&#20844;&#20849;&#35770;&#22363;&#65292;&#20154;&#20204;&#20250;&#27604;&#31169;&#23494;&#24773;&#20917;&#19979;&#26356;&#21152;&#25511;&#21046;&#33258;&#24049;&#30340;&#24863;&#24773;&#34920;&#36798;&#12290;&#26356;&#31934;&#30830;&#30340;&#35828;&#65292;&#20182;&#20204;&#36890;&#24120;&#24076;&#26395;&#23545;&#26576;&#20154;&#30452;&#25509;&#34920;&#36798;&#24863;&#24773;&#65292;&#20363;&#22914;&#24863;&#28608;&#21644;&#24868;&#24594;&#65292;&#32780;&#19981;&#26159;&#30452;&#25509;&#30340;&#20869;&#37096;&#24773;&#32490;&#65292;&#20363;&#22914;&#19981;&#23433;&#21644;&#39556;&#20658;&#12290;&#24403;&#30693;&#36947;&#20854;&#20182;&#20154;&#20250;&#20851;&#27880;&#21040;&#20182;&#30340;&#24515;&#29702;&#29366;&#24577;&#26102;&#65292;&#22823;&#22810;&#25968;&#20154;&#20250;&#24037;&#20316;&#30340;&#26356;&#22909;&#12290;&#36890;&#36807;&#22312;&#32454;&#24494;&#32447;&#32034;&#19978;&#25237;&#20837;&#27880;&#24847;&#21147;&#65292;&#20320;&#21487;&#20197;&#22312;&#22823;&#22810;&#25968;&#26102;&#20505;&#29468;&#21040;&#38382;&#39064;&#65292;&#24182;&#19988;&#33021;&#22815;&#40723;&#33310;&#20154;&#20204;&#27604;&#21407;&#26469;&#26356;&#28145;&#20837;&#22320;&#21442;&#19982;&#12290;</p><p>&#25105;&#19981;&#26159;&#35828;&#65292;&#20320;&#30340;&#35282;&#33394;&#26159;&#22242;&#38431;&#27835;&#30103;&#24072;&#65292;&#19968;&#30452;&#36890;&#36807;&#35302;&#21450;&#21035;&#20154;&#30340;&#24773;&#32490;&#26469;&#24110;&#21161;&#27599;&#20010;&#20154;&#12290;&#20294;&#26159;&#36890;&#36807;&#23545;&#20110;&#20010;&#20154;&#34892;&#20026;&#38271;&#26399;&#27169;&#24335;&#30340;&#35266;&#23519;&#65292;&#21363;&#20351;&#20320;&#20204;&#20174;&#26469;&#20063;&#27809;&#26377;&#38754;&#23545;&#38754;&#65292;&#20063;&#20250;&#33719;&#24471;&#20687;&#21333;&#20010;&#20154;&#20043;&#38388;&#30340;&#24863;&#21463;&#12290;&#32780;&#19988;&#36890;&#36807;&#23545;&#20110;&#33258;&#24049;&#25991;&#31456;&#22522;&#35843;&#30340;&#25935;&#24863;&#24615;&#65292;&#20320;&#20250;&#20026;&#33258;&#24049;&#23545;&#20110;&#20854;&#20182;&#20154;&#24773;&#32490;&#30340;&#24433;&#21709;&#21147;&#24863;&#21040;&#21507;&#24778;&#65292;&#26368;&#32456;&#20250;&#20351;&#39033;&#30446;&#21463;&#30410;&#12290;</p></div><div class="sect2" title="&#35782;&#21035;&#26080;&#31036;"><div class="titlepage"><div><div><h3 class="title"><a name="rudeness"></a>&#35782;&#21035;&#26080;&#31036;</h3></div></div></div><p>&#24320;&#28304;&#25991;&#21270;&#30340;&#19968;&#20010;&#23450;&#24615;&#29305;&#24449;&#26159;&#23545;&#20110;&#20309;&#20026;&#26080;&#31036;&#30340;&#29305;&#33394;&#23450;&#20041;&#12290;&#19979;&#38754;&#21465;&#36848;&#30340;&#20064;&#24815;&#19981;&#21482;&#26159;&#20986;&#29616;&#22312;&#24320;&#28304;&#36719;&#20214;&#24320;&#21457;&#65292;&#20063;&#19981;&#21482;&#26159;&#22312;&#19968;&#33324;&#36719;&#20214;&#8212;&#22312;&#25968;&#23398;&#12289;&#20005;&#23494;&#31185;&#23398;&#25110;&#24037;&#31243;&#32426;&#24459;&#20013;&#20063;&#24182;&#19981;&#38476;&#29983;&#8212;&#33258;&#30001;&#36719;&#20214;&#65292;&#30001;&#20110;&#20854;&#36328;&#39046;&#22495;&#24615;&#65292;&#24182;&#26377;&#19981;&#26029;&#28044;&#20837;&#30340;&#26032;&#26469;&#32773;&#65292;&#35768;&#22810;&#19981;&#29087;&#24713;&#36825;&#31181;&#29615;&#22659;&#30340;&#20154;&#23558;&#35201;&#38754;&#23545;&#36825;&#20123;&#20064;&#24815;&#12290;</p><p>&#25105;&#20204;&#20808;&#20174;<span class="emphasis"><em>&#19981;</em></span>&#26080;&#31036;&#24320;&#22987;&#12290;</p><p>&#25216;&#26415;&#25209;&#35780;&#65292;&#21363;&#20351;&#24456;&#30452;&#25509;&#19988;&#27809;&#26377;&#38138;&#22443;&#65292;&#20063;&#19981;&#26159;&#26080;&#31036;&#30340;&#12290;&#23454;&#38469;&#19978;&#65292;&#36825;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#31181;&#35844;&#23194;&#65306;&#25209;&#35780;&#32773;&#22312;&#35828;&#35805;&#65292;&#35828;&#26126;&#30446;&#26631;&#20540;&#24471;&#37325;&#35270;&#65292;&#20540;&#24471;&#33457;&#26102;&#38388;&#30740;&#31350;&#12290;&#21487;&#20197;&#35828;&#65292;&#24179;&#38745;&#21482;&#26159;&#31616;&#21333;&#30340;&#24573;&#35270;&#26576;&#20154;&#30340;&#25991;&#31456;&#65292;&#33457;&#36153;&#26356;&#22810;&#26102;&#38388;&#25209;&#35780;&#23427;&#21017;&#26159;&#26356;&#22810;&#30340;&#36190;&#32654;&#65288;&#24403;&#28982;&#65292;&#38500;&#38750;&#25209;&#35780;&#21319;&#32423;&#21040;&#20102;<span class="foreignphrase"><em class="foreignphrase">&#38750;&#29702;&#24615;&#30340;</em></span>&#25915;&#20987;&#25110;&#20854;&#20182;&#24418;&#24335;&#30340;&#26126;&#26174;&#26080;&#31036;&#65289;&#12290;</p><p>&#36831;&#38045;&#12289;&#26420;&#23454;&#30340;&#38382;&#39064;&#65292;&#20363;&#22914;&#21069;&#38754;Shane&#30340;&#23545;&#25105;&#30340;&#37038;&#20214;&#65292;&#20063;&#19981;&#26159;&#26080;&#31036;&#12290;&#22312;&#20854;&#20182;&#29615;&#22659;&#19979;&#36825;&#31181;&#25552;&#38382;&#20250;&#30475;&#36215;&#26469;&#26377;&#20123;&#20919;&#37239;&#65292;&#29609;&#24324;&#25991;&#23383;&#25110;&#29978;&#33267;&#26159;&#22066;&#24324;&#65292;&#36890;&#24120;&#26159;&#26377;&#24847;&#30340;&#20005;&#37325;&#34892;&#20026;&#65292;&#32780;&#19988;&#38500;&#20102;&#23613;&#24555;&#37322;&#25918;&#20986;&#20449;&#24687;&#65292;&#27809;&#26377;&#38544;&#34255;&#30340;&#26085;&#31243;&#34920;&#12290;&#33879;&#21517;&#30340;&#25216;&#26415;&#25903;&#25345;&#38382;&#39064;&#8220;&#20320;&#30340;&#30005;&#33041;&#25554;&#30005;&#20102;&#21527;&#65311;&#8221;&#26159;&#32463;&#20856;&#30340;&#26696;&#20363;&#12290;&#25903;&#25345;&#32773;&#30830;&#23454;&#38656;&#35201;&#30693;&#36947;&#20320;&#30340;&#30005;&#33041;&#26159;&#21542;&#25554;&#30005;&#65292;&#32463;&#36807;&#19968;&#27573;&#26102;&#38388;&#30340;&#36825;&#31867;&#24037;&#20316;&#65292;&#20182;&#24050;&#32463;&#21388;&#20518;&#20102;&#22312;&#38382;&#39064;&#21069;&#28857;&#32512;&#19968;&#20123;&#26377;&#31036;&#35980;&#30340;&#22857;&#25215;&#65288;&#8220;&#35831;&#21407;&#35845;&#65292;&#25105;&#21482;&#26159;&#35201;&#38382;&#19968;&#20123;&#38382;&#39064;&#20197;&#25490;&#38500;&#19968;&#20123;&#21487;&#33021;&#24615;&#12290;&#26377;&#19968;&#20123;&#21487;&#33021;&#24456;&#22522;&#30784;&#65292;&#35831;&#26242;&#26102;&#24525;&#21463;&#19968;&#19979;&#25105;...&#8221;&#65289;&#12290; &#27492;&#21051;&#65292;&#20182;&#27809;&#26377;&#20877;&#20570;&#20219;&#20309;&#38138;&#22443;&#65292;&#21482;&#26159;&#30452;&#25509;&#38382;&#65306;&#21040;&#24213;&#25554;&#30005;&#20102;&#27809;&#26377;&#65311;&#31867;&#20284;&#30340;&#38382;&#39064;&#20250;&#19968;&#30452;&#22312;&#33258;&#30001;&#36719;&#20214;&#37038;&#20214;&#21015;&#34920;&#20013;&#34987;&#38382;&#36215;&#12290;&#30446;&#30340;&#19981;&#26159;&#20882;&#29359;&#25509;&#25910;&#32773;&#65292;&#32780;&#26159;&#24555;&#36895;&#25490;&#38500;&#22823;&#22810;&#25968;&#26126;&#26174;&#30340;&#65288;&#25110;&#35768;&#20063;&#26159;&#26368;&#24120;&#35265;&#30340;&#65289;&#35299;&#37322;&#12290;&#29702;&#35299;&#36825;&#31181;&#34892;&#20026;&#24182;&#20316;&#20986;&#21709;&#24212;&#30340;&#25509;&#25910;&#32773;&#20250;&#22240;&#20026;&#22823;&#24230;&#30340;&#24577;&#24230;&#33719;&#24471;&#25104;&#21151;&#12290;&#19981;&#33021;&#27491;&#30830;&#21453;&#24212;&#30340;&#25509;&#25910;&#32773;&#20063;&#19981;&#20250;&#21463;&#21040;&#35892;&#36131;&#12290;&#36825;&#21482;&#26159;&#25991;&#21270;&#30340;&#20914;&#31361;&#65292;&#19981;&#26159;&#26576;&#20154;&#30340;&#36807;&#38169;&#12290;&#35201;&#21644;&#34108;&#30340;&#35299;&#37322;&#20320;&#30340;&#38382;&#39064;&#65288;&#25110;&#25209;&#35780;&#65289;&#27809;&#26377;&#38544;&#34255;&#30340;&#21547;&#20041;&#65307;&#21482;&#26159;&#24076;&#26395;&#35753;&#65288;&#25110;&#20256;&#36882;&#65289;&#20449;&#24687;&#23613;&#21487;&#33021;&#26377;&#25928;&#29575;&#65292;&#26080;&#20182;&#12290;</p><p>&#37027;&#20040;&#24590;&#26679;&#26159;&#26080;&#31036;&#65311;</p><p>&#35814;&#32454;&#30340;&#25216;&#26415;&#35780;&#35770;&#19968;&#31181;&#24418;&#24335;&#30340;&#35844;&#23194;&#65292;&#21516;&#29702;&#65292;&#22914;&#26524;&#19981;&#33021;&#25552;&#20379;&#39640;&#36136;&#37327;&#25209;&#35780;&#20063;&#21487;&#20197;&#30475;&#20316;&#26159;&#19968;&#31181;&#20882;&#29359;&#12290;&#25105;&#19981;&#26159;&#35828;&#20165;&#20165;&#24573;&#30053;&#26576;&#20154;&#30340;&#24037;&#20316;&#65292;&#26159;&#25552;&#35758;&#12289;&#20195;&#30721;&#21464;&#26356;&#12289;&#26032;&#38382;&#39064;&#28155;&#21152;&#25110;&#20219;&#20309;&#20107;&#12290;&#38500;&#38750;&#24744;&#20043;&#21069;&#26126;&#30830;&#30340;&#25215;&#35834;&#20250;&#26377;&#35814;&#32454;&#30340;&#21453;&#24212;&#65292;&#19981;&#20570;&#20219;&#20309;&#21453;&#24212;&#20063;&#27809;&#26377;&#38169;&#12290;&#20154;&#20204;&#21482;&#20250;&#20551;&#35774;&#20320;&#27809;&#26377;&#26102;&#38388;&#22238;&#31572;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;<span class="emphasis"><em>&#35201;</em></span>&#21453;&#24212;&#65292;&#23601;&#35201;&#29992;&#24515;&#65306;&#33457;&#26102;&#38388;&#30495;&#30340;&#21435;&#20998;&#26512;&#65292;&#25552;&#20379;&#21512;&#36866;&#30340;&#23454;&#22312;&#20363;&#23376;&#65292;&#22312;&#20197;&#21069;&#30340;&#24402;&#26723;&#20013;&#21457;&#25496;&#30456;&#20851;&#30340;&#25991;&#31456;&#31561;&#31561;&#12290;&#25110;&#32773;&#22914;&#26524;&#20320;&#27809;&#26377;&#26102;&#38388;&#33457;&#36153;&#36825;&#31181;&#31934;&#21147;&#65292;&#20294;&#20173;&#38656;&#35201;&#20889;&#19968;&#20123;&#31616;&#30701;&#30340;&#22238;&#24212;&#65292;&#28982;&#21518;&#22312;&#20449;&#24687;&#20013;&#20844;&#24320;&#35828;&#26126;&#32570;&#38519;&#65288;&#8220;&#25105;&#30693;&#36947;&#26377;&#19968;&#20010;&#23545;&#24212;&#30340;&#38382;&#39064;&#65292;&#19981;&#36807;&#25105;&#27809;&#26102;&#38388;&#21435;&#25628;&#32034;&#65292;&#23545;&#19981;&#36215;&#8221;&#65289;&#12290;&#20027;&#35201;&#26159;&#35748;&#35782;&#21040;&#25991;&#21270;&#26631;&#20934;&#30340;&#23384;&#22312;&#65292;&#36890;&#36807;&#23653;&#34892;&#25215;&#35834;&#25110;&#20844;&#24320;&#30340;&#21578;&#30693;&#32570;&#20047;&#26102;&#38388;&#23454;&#29616;&#12290;&#26080;&#35770;&#20309;&#31181;&#26041;&#24335;&#65292;&#26631;&#20934;&#37117;&#20250;&#34987;&#21152;&#24378;&#12290;&#21363;&#20351;&#19981;&#33021;&#36798;&#21040;&#26631;&#20934;&#65292;&#19981;&#35201;&#22312;&#21516;&#19968;&#26102;&#38388;&#35299;&#37322;<span class="emphasis"><em>&#20026;&#20160;&#20040;</em></span>&#20320;&#27809;&#26377;&#36798;&#21040;&#65292;&#36825;&#26679;&#20570;&#22909;&#20687;&#26159;&#35828;&#36825;&#20010;&#20027;&#39064;&#65288;&#20197;&#21450;&#37027;&#20123;&#21442;&#19982;&#32773;&#65289;&#19981;&#20540;&#24471;&#20320;&#33457;&#36153;&#26102;&#38388;&#12290;&#26356;&#22909;&#22320;&#26159;&#36890;&#36807;&#31616;&#27905;&#32780;&#19981;&#26159;&#25042;&#24816;&#23637;&#31034;&#20320;&#30340;&#26102;&#38388;&#30340;&#20215;&#20540;&#12290;</p><p>&#20063;&#26377;&#19968;&#20123;&#20854;&#20182;&#24418;&#24335;&#30340;&#26080;&#31036;&#65292;&#24403;&#28982;&#65292;&#20294;&#26159;&#22823;&#22810;&#25968;&#24182;&#19981;&#21482;&#23384;&#22312;&#20110;&#33258;&#30001;&#36719;&#20214;&#24320;&#21457;&#65292;&#32780;&#19988;&#24120;&#35782;&#36275;&#22815;&#24341;&#23548;&#20320;&#36991;&#20813;&#20182;&#20204;&#12290;&#22914;&#26524;&#20320;&#36824;&#27809;&#26377;&#30475;&#65292;&#21487;&#20197;&#30475;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="setting-tone.html#prevent-rudeness" title="&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;">the section called &#8220;&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;&#8221;</a>&#12290;</p></div><div class="sect2" title="&#38754;&#23481;"><div class="titlepage"><div><div><h3 class="title"><a name="face"></a>&#38754;&#23481;</h3></div></div></div><p>&#20154;&#33041;&#20013;&#26377;&#19968;&#22359;&#19987;&#38376;&#36127;&#36131;&#35782;&#21035;&#38754;&#23481;&#30340;&#21306;&#22495;&#12290;&#23427;&#34987;&#38750;&#27491;&#24335;&#30340;&#31216;&#20026;&#8220;&#26797;&#22411;&#38754;&#23481;&#21306;&#22495;&#8221;&#65292;&#20854;&#33021;&#21147;&#22823;&#22810;&#26469;&#33258;&#22825;&#29983;&#65292;&#32780;&#19981;&#26159;&#23398;&#20064;&#24471;&#21040;&#12290;&#22240;&#20026;&#35782;&#21035;&#21333;&#20010;&#20154;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#29983;&#23384;&#25216;&#24039;&#65292;&#25152;&#20197;&#25105;&#20204;&#28436;&#21270;&#20986;&#20102;&#19987;&#38376;&#30340;&#30828;&#20214;&#36127;&#36131;&#36825;&#20010;&#24037;&#20316;&#12290;</p><p>&#20114;&#32852;&#32593;&#22522;&#20110;&#30340;&#20132;&#27969;&#20174;&#24515;&#29702;&#19978;&#35828;&#26377;&#20123;&#21476;&#24618;&#65292;&#22240;&#20026;&#38656;&#35201;&#35768;&#22810;&#26080;&#27861;&#29992;&#33258;&#28982;&#65292;&#21407;&#22987;&#30340;&#26041;&#27861;&#35782;&#21035;&#23545;&#26041;&#30340;&#20154;&#65292;&#36827;&#34892;&#32039;&#23494;&#30340;&#21512;&#20316;&#65306;&#39318;&#20808;&#26159;&#38754;&#37096;&#35782;&#21035;&#65292;&#20063;&#26377;&#22768;&#38899;&#21644;&#23039;&#21183;&#31561;&#12290;&#20026;&#20102;&#24357;&#34917;&#36825;&#31181;&#19981;&#36275;&#65292;&#21487;&#20197;&#22312;&#25152;&#26377;&#22320;&#26041;&#20351;&#29992;&#19968;&#33268;&#30340;<em class="firstterm">&#23631;&#24149;&#21517;&#31216;</em>&#12290;&#20182;&#24212;&#35813;&#26159;&#20320;&#37038;&#20214;&#22320;&#22336;&#30340;&#19968;&#37096;&#20998;&#65288;@&#20043;&#21069;&#30340;&#37096;&#20998;&#65289;&#65292;&#20320;&#30340;IRC&#29992;&#25143;&#21517;&#65292;&#20320;&#30340;&#29256;&#26412;&#24211;&#25552;&#20132;&#21517;&#65292;&#20320;&#30340;&#38382;&#39064;&#36319;&#36394;&#29992;&#25143;&#21517;&#31561;&#31561;&#12290;&#36825;&#20010;&#21517;&#23383;&#23601;&#26159;&#20320;&#30340;&#22312;&#32447;&#8220;&#38754;&#23481;&#8221;&#65306;&#19968;&#27573;&#21487;&#20197;&#21516;&#20320;&#30340;&#30495;&#23454;&#38754;&#23481;&#36215;&#21040;&#21516;&#26679;&#25928;&#26524;&#30340;&#26631;&#35782;&#23383;&#31526;&#20018;&#65292;&#23613;&#31649;&#20182;&#19981;&#26159;&#65292;&#20294;&#33267;&#23569;&#27169;&#25311;&#20102;&#20869;&#32622;&#22312;&#30005;&#33041;&#30340;&#30828;&#20214;&#12290;&#12290;</p><p>&#23631;&#24149;&#21517;&#31216;&#24212;&#35813;&#26159;&#20320;&#30495;&#23454;&#22995;&#21517;&#30340;&#30452;&#35273;&#65288;&#20363;&#22914;&#25105;&#30340;&#26159;&#8220;kfogel&#8221;&#65289;&#23637;&#31034;&#12290;&#22312;&#19968;&#20123;&#24773;&#20917;&#20013;&#65292;&#20250;&#20276;&#38543;&#20320;&#30340;&#23436;&#25972;&#21517;&#65292;&#20363;&#22914;&#22312;&#37038;&#20214;&#22836;&#20013;&#65306;</p><pre class="screen">
From: "Karl Fogel" &lt;kfogel@whateverdomain.com&gt;
</pre><p>&#23454;&#38469;&#19978;&#65292;&#36825;&#20010;&#20363;&#23376;&#26377;&#20004;&#20214;&#20107;&#12290;&#23601;&#20687;&#21069;&#38754;&#25552;&#21040;&#30340;&#65292;&#23631;&#24149;&#21517;&#31216;&#29992;&#30452;&#35273;&#26041;&#24335;&#21305;&#37197;&#30495;&#23454;&#22995;&#21517;&#12290;&#20294;&#26159;&#65292;&#30495;&#23454;&#22995;&#21517;&#26159;<span class="emphasis"><em>&#30495;&#23454;&#30340;</em></span>&#12290;&#32780;&#19981;&#26159;&#26576;&#31181;&#20462;&#39280;&#30340;&#21517;&#31216;&#65306;</p><pre class="screen">
From: "Wonder Hacker" &lt;wonderhacker@whateverdomain.com&gt;
</pre><p>Paul Steiner&#26377;&#19968;&#21103;&#33879;&#21517;&#30340;&#21345;&#36890;&#65292;&#21002;&#30331;&#22312;1993&#24180;6&#26376;5&#26085;&#30340;<em class="citetitle">&#32445;&#32422;&#23458;</em>&#65292;&#37324;&#38754;&#26159;&#19968;&#26465;&#29399;&#30331;&#24405;&#21040;&#20102;&#30005;&#33041;&#32456;&#31471;&#24182;&#38452;&#38505;&#30340;&#19982;&#21478;&#19968;&#20010;&#20154;&#20132;&#35848;&#65306;&#8220;&#22312;&#22240;&#29305;&#32593;&#19978;&#65292;&#27809;&#20154;&#30693;&#36947;&#20320;&#26159;&#19968;&#26465;&#29399;&#12290;&#8221;&#36825;&#31867;&#24605;&#24819;&#30340;&#32972;&#21518;&#26159;&#33258;&#25105;&#22840;&#22823;&#65292;&#36825;&#20123;&#26377;&#20123;&#20431;&#30382;&#30340;&#22312;&#32447;&#26631;&#35782;&#30340;&#20154;&#32473;&#20102;&#20182;&#20204;&#33258;&#24049;&#8212;&#22909;&#20687;&#34987;&#21483;&#20570;&#8220;Wonder Hacker&#8221;<span class="emphasis"><em>&#23601;</em></span>&#30495;&#30340;&#26159;&#31070;&#22855;&#40657;&#23458;&#20102;&#12290;&#20294;&#26159;&#20107;&#23454;&#27809;&#26377;&#25913;&#21464;&#65306;&#21363;&#20351;&#27809;&#20154;&#30693;&#36947;&#20320;&#26159;&#26465;&#29399;&#65292;&#20320;&#36824;&#26159;&#26465;&#29399;&#12290;&#19968;&#20010;&#24187;&#24819;&#30340;&#22312;&#32447;&#26631;&#35782;&#19981;&#20250;&#25171;&#21160;&#35835;&#32773;&#12290;&#30456;&#21453;&#65292;&#20182;&#20204;&#20250;&#35748;&#20026;&#20320;&#21482;&#26159;&#24418;&#35937;&#32780;&#27809;&#26377;&#26412;&#20307;&#65292;&#25110;&#32773;&#20165;&#20165;&#26159;&#20320;&#26159;&#19981;&#23433;&#20840;&#30340;&#12290;&#22312;&#25152;&#26377;&#30340;&#20132;&#27969;&#20013;&#20351;&#29992;&#30495;&#23454;&#22995;&#21517;&#65292;&#25110;&#32773;&#22240;&#20026;&#26576;&#20123;&#21407;&#22240;&#38656;&#35201;&#21311;&#21517;&#65292;&#37027;&#20040;&#23601;&#35831;&#36215;&#19968;&#20010;&#23436;&#20840;&#20687;&#30495;&#21517;&#30340;&#21517;&#31216;&#65292;&#24182;&#19968;&#30452;&#29992;&#19979;&#21435;&#12290;</p><p>&#20026;&#20102;&#20445;&#25345;&#20320;&#30340;&#22312;&#32447;&#38754;&#23481;&#30340;&#19968;&#33268;&#65292;&#26377;&#19968;&#20123;&#26041;&#27861;&#21487;&#20197;&#35753;&#20182;&#26356;&#21560;&#24341;&#20154;&#12290;&#22914;&#26524;&#20320;&#26377;&#27491;&#24335;&#30340;&#22836;&#34900;&#65288;&#20363;&#22914;&#8221;&#21338;&#22763;&#8220;&#12289;&#8221;&#25945;&#25480;&#8220;&#21644;&#8221;&#23548;&#24072;&#8220;&#65289;&#65292;&#19981;&#35201;&#28843;&#32768;&#65292;&#38500;&#38750;&#19982;&#23545;&#35805;&#20869;&#23481;&#30456;&#20851;&#65292;&#26368;&#22909;&#19981;&#35201;&#25552;&#21450;&#12290;&#20316;&#20026;&#19968;&#33324;&#30340;&#40657;&#23458;&#20043;&#36947;&#65292;&#29305;&#21035;&#26159;&#33258;&#30001;&#36719;&#20214;&#25991;&#21270;&#65292;&#35748;&#20026;&#36825;&#20123;&#22836;&#34900;&#26159;&#22810;&#20313;&#21644;&#19981;&#23433;&#20840;&#30340;&#26631;&#24535;&#65288;&#20363;&#22914;&#21483;&#20861;&#21644;&#30742;&#23478;&#65289;&#12290;&#24403;&#28982;&#65292;&#22914;&#26524;&#36825;&#20123;&#22836;&#34900;&#26159;&#20316;&#20026;&#26631;&#20934;&#30340;&#31614;&#21517;&#20986;&#29616;&#22312;&#27599;&#23553;&#37038;&#20214;&#65292;&#19981;&#35201;&#25226;&#36825;&#20010;&#24403;&#20316;&#25903;&#25345;&#20320;&#22312;&#35752;&#35770;&#20013;&#20301;&#32622;&#30340;&#24037;&#20855;&#8212;&#36825;&#31181;&#23581;&#35797;&#24517;&#23450;&#20107;&#19982;&#24895;&#36829;&#12290;&#20320;&#38656;&#35201;&#23562;&#25964;&#20154;&#30340;&#23478;&#20249;&#65292;&#32780;&#19981;&#26159;&#23562;&#25964;&#36825;&#20123;&#22836;&#34900;&#12290;</p><p>&#35828;&#21040;&#31614;&#21517;&#21306;&#65306;&#35201;&#20445;&#35777;&#30701;&#23567;&#26377;&#24847;&#20041;&#65292;&#25110;&#32773;&#26356;&#22909;&#30340;&#24773;&#20917;&#26159;&#27809;&#26377;&#31614;&#21517;&#21306;&#12290;&#36991;&#20813;&#22823;&#27573;&#30340;&#27861;&#24459;&#20813;&#36131;&#22768;&#26126;&#20986;&#29616;&#22312;&#27599;&#20010;&#37038;&#20214;&#30340;&#32467;&#23614;&#65292;&#29305;&#21035;&#26159;&#24403;&#20182;&#20204;&#34920;&#36798;&#30340;&#24863;&#24773;&#19982;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#21442;&#19982;&#31934;&#31070;&#19981;&#21305;&#37197;&#26102;&#12290;&#20363;&#22914;&#65292;&#22914;&#19979;&#26159;&#25105;&#21442;&#19982;&#30340;&#19968;&#20010;&#20844;&#24320;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#26576;&#20010;&#29992;&#25143;&#27599;&#20010;&#25991;&#31456;&#37117;&#20250;&#20986;&#29616;&#30340;&#30340;&#32463;&#20856;&#27969;&#27966;&#65306;</p><pre class="screen">
IMPORTANT NOTICE

If you have received this e-mail in error or wish to read our e-mail
disclaimer statement and monitoring policy, please refer to the
statement below or contact the sender.

This communication is from Deloitte &amp; Touche LLP.  Deloitte &amp;
Touche LLP is a limited liability partnership registered in England
and Wales with registered number OC303675.  A list of members' names
is available for inspection at Stonecutter Court, 1 Stonecutter
Street, London EC4A 4TR, United Kingdom, the firm's principal place of
business and registered office.  Deloitte &amp; Touche LLP is
authorised and regulated by the Financial Services Authority.

This communication and any attachments contain information which is
confidential and may also be privileged.  It is for the exclusive use
of the intended recipient(s).  If you are not the intended
recipient(s) please note that any form of disclosure, distribution,
copying or use of this communication or the information in it or in
any attachments is strictly prohibited and may be unlawful.  If you
have received this communication in error, please return it with the
title "received in error" to IT.SECURITY.UK@deloitte.co.uk then delete
the email and destroy any copies of it.

E-mail communications cannot be guaranteed to be secure or error free,
as information could be intercepted, corrupted, amended, lost,
destroyed, arrive late or incomplete, or contain viruses.  We do not
accept liability for any such matters or their consequences.  Anyone
who communicates with us by e-mail is taken to accept the risks in
doing so.

When addressed to our clients, any opinions or advice contained in
this e-mail and any attachments are subject to the terms and
conditions expressed in the governing Deloitte &amp; Touche LLP client
engagement letter.

Opinions, conclusions and other information in this e-mail and any
attachments which do not relate to the official business of the firm
are neither given nor endorsed by it.
</pre><p>&#23545;&#20110;&#21482;&#24819;&#20598;&#23572;&#35810;&#38382;&#19968;&#20010;&#38382;&#39064;&#30340;&#20154;&#65292;&#22914;&#27492;&#24040;&#22823;&#30340;&#20813;&#36131;&#22768;&#26126;&#34429;&#28982;&#26377;&#28857;&#20667;&#65292;&#20294;&#26159;&#27809;&#26377;&#20219;&#20309;&#27704;&#20037;&#30340;&#20260;&#23475;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#26576;&#20154;&#24076;&#26395;&#27963;&#36291;&#30340;&#21442;&#19982;&#21040;&#39033;&#30446;&#20013;&#65292;&#36825;&#20010;&#27861;&#24459;&#30340;&#38472;&#35789;&#28389;&#35843;&#20250;&#24320;&#22987;&#19968;&#20010;&#26356;&#28508;&#22312;&#30340;&#24433;&#21709;&#12290;&#23427;&#20250;&#37322;&#25918;&#20986;&#20004;&#20010;&#28508;&#22312;&#30340;&#30772;&#22351;&#24615;&#30340;&#20449;&#21495;&#65292;&#36825;&#20010;&#20154;&#23545;&#20110;&#33258;&#24049;&#30340;&#24037;&#20855;&#27809;&#26377;&#23436;&#20840;&#30340;&#25511;&#21046;&#26435;&#21147;&#8212;&#20182;&#38519;&#20837;&#20102;&#26576;&#20010;&#20844;&#21496;&#30340;&#37038;&#20214;&#31995;&#32479;&#65292;&#36825;&#20010;&#31995;&#32479;&#20250;&#22312;&#27599;&#20010;&#37038;&#20214;&#32467;&#23614;&#28155;&#21152;&#35752;&#21388;&#30340;&#20449;&#24687;&#65292;&#32780;&#20182;&#26080;&#27861;&#32469;&#36807;&#8212;&#20854;&#27425;&#65292;&#20182;&#23545;&#33258;&#24049;&#21442;&#19982;&#30340;&#33258;&#30001;&#36719;&#20214;&#27963;&#21160;&#21482;&#26377;&#26377;&#38480;&#25110;&#27809;&#26377;&#20219;&#20309;&#32452;&#32455;&#25903;&#25345;&#12290;&#35802;&#28982;&#65292;&#32452;&#32455;&#26126;&#26174;&#27809;&#26377;&#31105;&#27490;&#20182;&#22312;&#20844;&#20849;&#21015;&#34920;&#21457;&#34920;&#25991;&#31456;&#65292;&#20294;&#21487;&#20197;&#35753;&#20182;&#30340;&#25991;&#31456;&#30475;&#36215;&#26469;&#26126;&#26174;&#30340;&#19981;&#21463;&#27426;&#36814;&#65292;&#20223;&#20315;&#27844;&#28431;&#26426;&#23494;&#20449;&#24687;&#30340;&#39118;&#38505;&#24517;&#39035;&#25490;&#22312;&#31532;&#19968;&#20301;&#12290;</p><p>&#22914;&#26524;&#20320;&#25152;&#22312;&#30340;&#32452;&#32455;&#22362;&#25345;&#23545;&#25152;&#26377;&#22806;&#21457;&#37038;&#20214;&#28155;&#21152;&#36825;&#31181;&#31614;&#21517;&#21306;&#65292;&#24212;&#35813;&#32771;&#34385;&#30003;&#35831;&#19968;&#20010;&#20813;&#36153;&#37038;&#20214;&#24080;&#21495;&#65292;&#20363;&#22914;&#65292;<a class="ulink" href="http://gmail.google.com/" target="_top">gmail.google.com</a>&#12289;<a class="ulink" href="http://www.hotmail.com/" target="_top">www.hotmail.com</a>&#25110;<a class="ulink" href="http://www.yahoo.com/" target="_top">www.yahoo.com</a>&#65292;&#28982;&#21518;&#20316;&#20026;&#20320;&#22312;&#39033;&#30446;&#20013;&#30340;&#22320;&#22336;&#12290;</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1756" href="#idp1756" class="para">22</a>] </sup>&#20851;&#20110;&#36825;&#20010;&#20027;&#39064;&#26377;&#35768;&#22810;&#26377;&#36259;&#30340;&#23398;&#26415;&#30740;&#31350;&#65307;&#20363;&#22914;Gutwin&#12289;Penner&#21644;Schneider&#25152;&#33879;&#30340;<em class="citetitle">Group Awareness in Distributed Software
Development</em>&#12290;&#36825;&#31687;&#35770;&#25991;&#26366;&#32463;&#22312;&#32593;&#19978;&#20986;&#29616;&#36807;&#19968;&#27573;&#26102;&#38388;&#65292;&#20043;&#21518;&#28040;&#22833;&#65292;&#21518;&#26469;&#21448;&#22312;<a class="ulink" href="http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf" target="_top">http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf</a>&#20877;&#27425;&#20986;&#29616;&#12290;&#25152;&#20197;&#65292;&#22914;&#26524;&#36825;&#20010;&#22320;&#22336;&#26080;&#27861;&#35775;&#38382;&#65292;&#35831;&#36890;&#36807;&#25628;&#32034;&#24341;&#25806;&#25628;&#32034;&#26032;&#22320;&#22336;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="marketing.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="common-pitfalls.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#24066;&#22330;&#33829;&#38144; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;</td></tr></table></div></body></html>
