<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;"><link rel="prev" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;"><link rel="next" href="written-rules.html" title="&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="social-infrastructure.html">Prev</a> </td><th width="60%" align="center">Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</th><td width="20%" align="right"> <a accesskey="n" href="written-rules.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="consensus-democracy"></a>&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;</h2></div></div></div><p>&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#65292;&#36890;&#24120;&#20250;&#20174;&#24904;&#21892;&#29420;&#35009;&#27169;&#22411;&#36716;&#20026;&#26356;&#24320;&#25918;&#30340;&#27665;&#20027;&#31995;&#32479;&#12290;&#36825;&#19981;&#19968;&#23450;&#26159;&#28304;&#20110;&#23545;&#26576;&#20010;BD&#30340;&#19981;&#28385;&#65292;&#20511;&#29992;&#19968;&#20010;&#29983;&#29289;&#23398;&#30340;&#38544;&#21947;&#65292;&#21487;&#20197;&#31616;&#21333;&#30340;&#35748;&#20026;&#22242;&#38431;&#22522;&#30784;&#30340;&#31649;&#29702;&#26356;&#21152;&#8220;&#36827;&#21270;&#31283;&#23450;&#8221;&#12290;&#27599;&#24403;&#19968;&#20010;&#24904;&#21892;&#29420;&#35009;&#32773;&#24341;&#36864;&#65292;&#25110;&#23581;&#35797;&#23558;&#20915;&#31574;&#36131;&#20219;&#26356;&#22343;&#21248;&#30340;&#20998;&#37197;&#20986;&#21435;&#65292;&#36825;&#23601;&#26159;&#22242;&#38431;&#36873;&#23450;&#19968;&#20010;&#26032;&#30340;&#38750;&#29420;&#35009;&#31995;&#32479;&#30340;&#22909;&#26426;&#20250;&#8212;&#20063;&#23601;&#26159;&#35201;&#24314;&#31435;&#19968;&#22871;&#23466;&#27861;&#12290;&#22242;&#38431;&#21487;&#33021;&#38169;&#36807;&#20102;&#31532;&#19968;&#27425;&#26426;&#20250;&#12289;&#25110;&#32773;&#31532;&#20108;&#27425;&#65292;&#20294;&#26159;&#26368;&#32456;&#20250;&#36825;&#26679;&#20570;&#65307;&#19968;&#26086;&#20570;&#20102;&#65292;&#36825;&#20010;&#20915;&#23450;&#23601;&#19981;&#22826;&#20250;&#21453;&#36716;&#36807;&#26469;&#12290;&#24120;&#35782;&#35299;&#37322;&#20102;&#21407;&#22240;&#65306;&#22914;&#26524;&#26576;&#20010;N&#20301;&#25104;&#21592;&#30340;&#22242;&#38431;&#32473;&#26576;&#20010;&#20154;&#29305;&#27530;&#30340;&#26435;&#21033;&#65292;&#20063;&#23601;&#24847;&#21619;&#30528;&#26377;N - 1&#20301;&#25104;&#21592;&#37117;&#24895;&#24847;&#38477;&#20302;&#33258;&#24049;&#30340;&#20010;&#20154;&#24433;&#21709;&#12290;&#20154;&#20204;&#36890;&#24120;&#19981;&#24895;&#24847;&#36825;&#26679;&#20570;&#12290;&#21363;&#20351;&#20182;&#20204;&#36825;&#26679;&#20570;&#20102;&#65292;&#25152;&#20135;&#29983;&#30340;&#29420;&#35009;&#32479;&#27835;&#20173;&#28982;&#26159;&#26377;&#26465;&#20214;&#30340;&#65306;&#22242;&#38431;&#25512;&#20030;&#20102;BD&#65292;&#22242;&#38431;&#20063;&#21487;&#20197;&#32610;&#20813;BD&#12290;&#22240;&#27492;&#65292;&#19968;&#20010;&#39033;&#30446;&#30340;&#39046;&#23548;&#26435;&#19968;&#26086;&#20174;&#26576;&#20010;&#39749;&#21147;&#20010;&#20154;&#36716;&#31227;&#20026;&#26356;&#27491;&#24335;&#30340;&#22242;&#38431;&#20026;&#22522;&#30784;&#30340;&#31995;&#32479;&#65292;&#23601;&#24456;&#23569;&#20250;&#36208;&#22238;&#22836;&#36335;&#12290;</p><p>&#36825;&#31867;&#31995;&#32479;&#30340;&#24037;&#20316;&#32454;&#33410;&#26377;&#24456;&#22823;&#30340;&#21306;&#21035;&#65292;&#20294;&#26159;&#26377;&#20004;&#20010;&#20849;&#21516;&#30340;&#20803;&#32032;&#65306;&#39318;&#20808;&#65292;&#22242;&#38431;&#22823;&#22810;&#25968;&#26102;&#20505;&#22312;&#36798;&#25104;&#20849;&#35782;&#30340;&#24773;&#20917;&#19979;&#24037;&#20316;&#65292;&#20854;&#27425;&#65292;&#22312;&#26080;&#27861;&#36798;&#25104;&#20849;&#35782;&#26102;&#26377;&#19968;&#20010;&#27491;&#24335;&#30340;&#34920;&#20915;&#26426;&#21046;&#12290;</p><p><em class="firstterm">&#20849;&#35782;</em>&#20165;&#20165;&#24847;&#21619;&#30528;&#27599;&#20010;&#20154;&#37117;&#33021;&#22815;&#25509;&#21463;&#30340;&#19968;&#31181;&#21327;&#35758;&#12290;&#23427;&#19981;&#26159;&#19968;&#31181;&#21547;&#28151;&#30340;&#29366;&#24577;&#65306;&#24403;&#26377;&#20154;&#25552;&#20986;&#26576;&#20010;&#20849;&#35782;&#24050;&#32463;&#36798;&#25104;&#65292;&#32780;&#19988;&#27809;&#26377;&#20154;&#25552;&#20986;&#21453;&#23545;&#24847;&#35265;&#65292;&#25105;&#20204;&#35828;&#19968;&#20010;&#22242;&#38431;&#23545;&#26576;&#20010;&#38382;&#39064;&#36798;&#25104;&#20102;&#20849;&#35782;&#12290;&#24403;&#28982;&#65292;&#25552;&#20986;&#20849;&#35782;&#30340;&#20154;&#24212;&#24403;&#35814;&#32454;&#35828;&#26126;&#20849;&#35782;&#30340;&#20869;&#23481;&#65292;&#22914;&#26524;&#19981;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#35805;&#65292;&#36824;&#35201;&#35828;&#26126;&#21518;&#32493;&#30340;&#21160;&#20316;&#12290;</p><p>&#19968;&#20010;&#39033;&#30446;&#30340;&#22823;&#22810;&#25968;&#23545;&#35805;&#26159;&#20851;&#20110;&#25216;&#26415;&#20027;&#39064;&#30340;&#65292;&#20363;&#22914;&#20462;&#27491;bug&#30340;&#27491;&#30830;&#26041;&#27861;&#12289;&#26159;&#21542;&#28155;&#21152;&#26576;&#20010;&#29305;&#24615;&#12289;&#20197;&#21450;&#25991;&#26723;&#25509;&#21475;&#26377;&#22810;&#20005;&#26684;&#31561;&#31561;&#12290;&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#31649;&#29702;&#20043;&#25152;&#20197;&#21487;&#20197;&#24037;&#20316;&#27491;&#24120;&#65292;&#26159;&#22240;&#20026;&#23427;&#26080;&#32541;&#30340;&#28151;&#20837;&#20102;&#25216;&#26415;&#35752;&#35770;&#24403;&#20013;&#12290;&#22312;&#19968;&#20010;&#35752;&#35770;&#30340;&#26368;&#21518;&#65292;&#36890;&#24120;&#26159;&#30830;&#23450;&#26041;&#21521;&#30340;&#21327;&#23450;&#12290;&#26576;&#20123;&#20154;&#20250;&#21019;&#24314;&#19968;&#20010;&#32467;&#35770;&#24086;&#65292;&#20316;&#20026;&#25152;&#20316;&#20915;&#23450;&#30340;&#24635;&#32467;&#65292;&#21516;&#26102;&#20063;&#26159;&#38544;&#21547;&#30340;&#20849;&#35782;&#25552;&#35758;&#12290;&#36825;&#20063;&#32473;&#20102;&#26576;&#20154;&#26368;&#21518;&#19968;&#27425;&#26426;&#20250;&#35828;&#8220;&#31561;&#31561;&#65292;&#25105;&#23545;&#27492;&#24182;&#19981;&#21516;&#24847;&#12290;&#25105;&#20204;&#24212;&#35813;&#20877;&#35752;&#35770;&#19968;&#19979;&#12290;&#8221;</p><p>&#23545;&#20110;&#23567;&#30340;&#26377;&#20105;&#35758;&#30340;&#20915;&#35758;&#65292;&#36825;&#31181;&#20849;&#35782;&#30340;&#25552;&#35758;&#26159;&#38544;&#21547;&#30340;&#12290;&#20363;&#22914;&#65292;&#24403;&#19968;&#20010;&#24320;&#21457;&#32773;&#26412;&#33021;&#30340;&#25552;&#20132;&#20102;&#19968;&#20010;bug&#20462;&#27491;&#65292;&#25552;&#20132;&#26412;&#36523;&#23601;&#26159;&#19968;&#20010;&#20849;&#35782;&#25552;&#35758;&#65306;&#8220;&#25105;&#26009;&#23450;&#25105;&#20204;&#37117;&#35748;&#21487;&#36825;&#20010;bug&#38656;&#35201;&#20462;&#27491;&#65292;&#32780;&#36825;&#23601;&#26159;&#25105;&#20570;&#30340;&#20462;&#27491;&#12290;&#8221;&#24403;&#28982;&#65292;&#24320;&#21457;&#32773;&#19981;&#20250;&#30495;&#30340;&#36825;&#20040;&#35828;&#65307;&#22905;&#21482;&#26159;&#25552;&#20132;&#20462;&#27491;&#65292;&#32780;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#20154;&#26080;&#38656;&#34920;&#26126;&#31435;&#22330;&#65292;&#22240;&#20026;&#27785;&#40664;&#20195;&#34920;&#20102;&#35748;&#21487;&#12290;&#22914;&#26524;&#26377;&#20154;&#25552;&#20132;&#30340;&#32467;&#26524;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#23548;&#33268;&#20849;&#35782;&#65292;&#32467;&#26524;&#23601;&#26159;&#39033;&#30446;&#20250;&#35937;&#36825;&#20010;&#21464;&#26356;&#27809;&#26377;&#25552;&#20132;&#19968;&#26679;&#36827;&#34892;&#35752;&#35770;&#12290;&#36825;&#20010;&#26041;&#27861;&#21487;&#20197;&#27491;&#24120;&#24037;&#20316;&#30340;&#21407;&#22240;&#35831;&#30475;&#19979;&#19968;&#20010;&#23567;&#33410;&#12290;</p><div class="sect2" title="&#29256;&#26412;&#25511;&#21046;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#25918;&#36731;&#26494;"><div class="titlepage"><div><div><h3 class="title"><a name="version-control-relaxation"></a>&#29256;&#26412;&#25511;&#21046;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#25918;&#36731;&#26494;</h3></div></div></div><p>&#22914;&#26524;&#39033;&#30446;&#28304;&#20195;&#30721;&#24050;&#32463;&#32435;&#20837;&#29256;&#26412;&#25511;&#21046;&#65292;&#36825;&#24847;&#21619;&#30528;&#22823;&#22810;&#25968;&#20915;&#23450;&#37117;&#21487;&#20197;&#36731;&#26131;&#30340;&#21462;&#28040;&#12290;&#19968;&#20010;&#24120;&#35265;&#30340;&#24773;&#20917;&#26159;&#26576;&#20154;&#33258;&#20197;&#20026;&#25552;&#20132;&#20102;&#19968;&#20010;&#21035;&#20154;&#20250;&#21916;&#27426;&#30340;&#21464;&#26356;&#65292;&#20294;&#23454;&#38469;&#19978;&#24182;&#19981;&#22914;&#27492;&#12290;&#36890;&#24120;&#22987;&#20110;&#21453;&#23545;&#32773;&#23545;&#20110;&#36951;&#28431;&#26576;&#20010;&#39044;&#20808;&#35752;&#35770;&#30340;&#36947;&#27465;&#24320;&#22987;&#65292;&#24403;&#28982;&#65292;&#22914;&#26524;&#21453;&#23545;&#32773;&#22312;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#20013;&#27809;&#26377;&#21457;&#29616;&#27492;&#31867;&#35752;&#35770;&#30340;&#32426;&#24405;&#65292;&#21487;&#20197;&#30465;&#30053;&#36825;&#19968;&#27493;&#12290;&#21478;&#19968;&#20010;&#26041;&#27861;&#26159;&#65292;&#21464;&#26356;&#26159;&#21542;&#24050;&#32463;&#25552;&#20132;&#27809;&#26377;&#29702;&#30001;&#24433;&#21709;&#25105;&#20204;&#35752;&#35770;&#30340;&#22522;&#35843;&#12290;&#25152;&#26377;&#30340;&#21464;&#26356;&#37117;&#21487;&#20197;&#22238;&#36864;&#65292;&#33267;&#23569;&#22312;&#24341;&#20837;&#20381;&#36182;&#30340;&#21464;&#26356;&#20043;&#21069;&#37117;&#27809;&#26377;&#38382;&#39064;&#65288;&#20363;&#22914;&#65292;&#22312;&#31227;&#38500;&#21407;&#26469;&#30340;&#21464;&#26356;&#21518;&#20250;&#30772;&#22351;&#26032;&#20195;&#30721;&#65289;&#12290;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#35753;&#39033;&#30446;&#26377;&#33021;&#21147;&#25910;&#22238;&#38169;&#35823;&#25110;&#20179;&#20419;&#21028;&#26029;&#30340;&#21518;&#26524;&#12290;&#36825;&#20063;&#37322;&#25918;&#20102;&#20154;&#20204;&#65292;&#20351;&#20182;&#20204;&#23545;&#20110;&#20570;&#20219;&#20309;&#20107;&#24773;&#20043;&#21069;&#25152;&#38656;&#35201;&#30340;&#21453;&#39304;&#21487;&#20197;&#30456;&#20449;&#33258;&#24049;&#30340;&#30452;&#35273;&#12290;</p><p>&#36825;&#20063;&#24847;&#21619;&#30528;&#36798;&#25104;&#20849;&#35782;&#30340;&#36807;&#31243;&#19981;&#38656;&#35201;&#38750;&#24120;&#27491;&#24335;&#12290;&#35768;&#22810;&#39033;&#30446;&#36319;&#30528;&#24863;&#35273;&#22788;&#29702;&#12290;&#23567;&#30340;&#21464;&#26356;&#21487;&#20197;&#30452;&#25509;&#24341;&#20837;&#65292;&#32780;&#26080;&#38656;&#35752;&#35770;&#65292;&#25110;&#32773;&#21482;&#38656;&#35201;&#36890;&#36807;&#26368;&#23569;&#30340;&#35752;&#35770;&#26469;&#28857;&#22836;&#30830;&#35748;&#12290;&#23545;&#20110;&#37325;&#35201;&#30340;&#21464;&#26356;&#65292;&#29305;&#21035;&#26159;&#26377;&#21487;&#33021;&#36896;&#25104;&#22823;&#37327;&#20195;&#30721;&#19981;&#31283;&#23450;&#30340;&#21464;&#26356;&#65292;&#20154;&#20204;&#24212;&#24403;&#38656;&#35201;&#31561;&#24453;&#19968;&#20004;&#22825;&#25165;&#33021;&#36798;&#25104;&#20849;&#35782;&#65292;&#19981;&#24212;&#24403;&#22240;&#20026;&#26576;&#20154;&#27809;&#26377;&#36275;&#22815;&#39057;&#32321;&#30340;&#26816;&#26597;&#37038;&#20214;&#65292;&#32780;&#23558;&#20854;&#25490;&#26021;&#22312;&#23545;&#35805;&#20043;&#22806;&#12290;</p><p>&#22240;&#27492;&#65292;&#24403;&#26576;&#20154;&#30456;&#20449;&#20182;&#30693;&#36947;&#24212;&#35813;&#20570;&#20160;&#20040;&#65292;&#20182;&#24212;&#24403;&#32487;&#32493;&#21069;&#36827;&#21644;&#23436;&#25104;&#23427;&#12290;&#36825;&#19981;&#20165;&#20165;&#36866;&#29992;&#20110;&#36719;&#20214;&#20462;&#27491;&#65292;&#20063;&#21487;&#20197;&#29992;&#20110;&#32593;&#31449;&#26356;&#26032;&#12289;&#25991;&#26723;&#21464;&#26356;&#21644;&#20854;&#20182;&#20219;&#20309;&#19981;&#20250;&#24341;&#36215;&#20105;&#35758;&#30340;&#20107;&#24773;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#38656;&#35201;&#36827;&#34892;&#22238;&#36864;&#25805;&#20316;&#30340;&#24773;&#20917;&#24456;&#23569;&#65292;&#24212;&#24403;&#26681;&#25454;&#23454;&#38469;&#24773;&#20917;&#22788;&#29702;&#12290;&#24403;&#28982;&#65292;&#19981;&#24212;&#24403;&#40723;&#21169;&#20154;&#20204;&#21018;&#24846;&#33258;&#29992;&#12290;&#27491;&#22312;&#35752;&#35770;&#21644;&#24050;&#32463;&#29983;&#25928;&#30340;&#20915;&#23450;&#20250;&#36896;&#25104;&#19968;&#23450;&#30340;&#24515;&#29702;&#24046;&#24322;&#65292;&#21363;&#20351;&#23427;&#22312;&#25216;&#26415;&#19978;&#26159;&#21487;&#36870;&#30340;&#12290;&#20154;&#20204;&#19968;&#30452;&#35748;&#20026;&#21160;&#21147;&#31561;&#21516;&#20110;&#34892;&#21160;&#65292;&#30456;&#23545;&#20110;&#22238;&#36864;&#21464;&#26356;&#65292;&#20154;&#20204;&#26356;&#24773;&#24895;&#22312;&#24320;&#22987;&#30340;&#26102;&#20505;&#38459;&#27490;&#23427;&#12290;&#22914;&#26524;&#24320;&#21457;&#32773;&#28389;&#29992;&#36825;&#20010;&#20107;&#23454;&#65292;&#36807;&#20110;&#24555;&#36895;&#30340;&#25552;&#20132;&#26377;&#20105;&#35758;&#30340;&#21464;&#26356;&#65292;&#19981;&#31649;&#24590;&#26679;&#65292;&#20154;&#20204;&#21487;&#20197;&#20063;&#24517;&#28982;&#20250;&#25265;&#24616;&#65292;&#20250;&#23558;&#24320;&#21457;&#32773;&#32622;&#20110;&#26356;&#20005;&#26684;&#30340;&#26631;&#20934;&#65292;&#30452;&#21040;&#20107;&#24773;&#25913;&#36827;&#12290;</p></div><div class="sect2" title="&#22914;&#26524;&#26080;&#27861;&#36798;&#25104;&#20849;&#35782;&#65292;&#37027;&#20040;&#34920;&#20915;&#65281;"><div class="titlepage"><div><div><h3 class="title"><a name="voting"></a>&#22914;&#26524;&#26080;&#27861;&#36798;&#25104;&#20849;&#35782;&#65292;&#37027;&#20040;&#34920;&#20915;&#65281;</h3></div></div></div><p>&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#19968;&#20123;&#20105;&#35770;&#26080;&#27861;&#36798;&#25104;&#20849;&#35782;&#12290;&#24403;&#25171;&#30772;&#27515;&#38145;&#30340;&#25152;&#26377;&#20854;&#20182;&#26041;&#27861;&#37117;&#24050;&#32463;&#22833;&#25928;&#65292;&#26368;&#21518;&#30340;&#26041;&#26696;&#23601;&#26159;&#34920;&#20915;&#12290;&#20294;&#26159;&#65292;&#22312;&#34920;&#20915;&#20043;&#21069;&#65292;&#19968;&#23450;&#35201;&#29702;&#28165;&#34920;&#20915;&#30340;&#36873;&#39033;&#12290;&#36825;&#37324;&#19968;&#20999;&#21448;&#37325;&#28436;&#20102;&#65292;&#25216;&#26415;&#35752;&#35770;&#30340;&#27491;&#24120;&#36807;&#31243;&#20250;&#28151;&#21512;&#39033;&#30446;&#20915;&#31574;&#31243;&#24207;&#30340;&#20598;&#28982;&#21457;&#29616;&#12290;&#27492;&#31867;&#38656;&#35201;&#34920;&#20915;&#30340;&#38382;&#39064;&#36890;&#24120;&#20250;&#24456;&#22797;&#26434;&#65292;&#20855;&#26377;&#22810;&#26041;&#38754;&#30340;&#38382;&#39064;&#12290;&#22312;&#25152;&#26377;&#27492;&#31867;&#22797;&#26434;&#35752;&#35770;&#20013;&#65292;&#38656;&#35201;&#26377;&#19968;&#20004;&#20010;&#20154;&#25198;&#28436;<em class="firstterm">&#35802;&#23454;&#30340;&#20013;&#38388;&#20154;</em>&#30340;&#35282;&#33394;&#65306;&#23450;&#26399;&#21457;&#24067;&#21508;&#31181;&#35770;&#28857;&#30340;&#25688;&#35201;&#65292;&#24182;&#20445;&#25345;&#23545;&#20110;&#20998;&#27495;&#65288;&#21644;&#19968;&#33268;&#24847;&#35265;&#65289;&#26680;&#24515;&#35770;&#28857;&#30340;&#36319;&#36394;&#12290;&#36825;&#20123;&#25688;&#35201;&#21487;&#20197;&#24110;&#21161;&#27599;&#20010;&#20154;&#35780;&#20272;&#25152;&#20570;&#24037;&#20316;&#30340;&#36827;&#23637;&#65292;&#24182;&#25552;&#37266;&#27599;&#20010;&#20154;&#36824;&#38656;&#35201;&#35299;&#20915;&#20160;&#20040;&#38382;&#39064;&#12290;&#22914;&#26524;&#38656;&#35201;&#34920;&#20915;&#65292;&#36825;&#20123;&#25688;&#35201;&#20063;&#21487;&#20197;&#20316;&#20026;&#34920;&#20915;&#34920;&#26684;&#30340;&#21407;&#24418;&#12290;&#22914;&#26524;&#35802;&#23454;&#20013;&#38388;&#20154;&#30340;&#20219;&#21153;&#23436;&#25104;&#30340;&#22909;&#65292;&#24403;&#26102;&#26426;&#25104;&#29087;&#23601;&#21487;&#20197;&#21457;&#24067;&#34920;&#20915;&#30340;&#21487;&#20449;&#35831;&#27714;&#65292;&#32780;&#22242;&#38431;&#20250;&#24076;&#26395;&#20351;&#29992;&#20197;&#20182;&#20204;&#23545;&#20110;&#27492;&#38382;&#39064;&#30340;&#25688;&#35201;&#20026;&#22522;&#30784;&#30340;&#34920;&#20915;&#34920;&#26684;&#12290;&#20013;&#38388;&#20154;&#33258;&#24049;&#20063;&#21487;&#20197;&#21442;&#19982;&#36777;&#35770;&#65307;&#21482;&#35201;&#20182;&#20204;&#21487;&#20197;&#29702;&#35299;&#24182;&#20844;&#24179;&#30340;&#34920;&#31034;&#20854;&#20182;&#20154;&#30340;&#35266;&#28857;&#65292;&#19981;&#20250;&#22240;&#20826;&#27966;&#35266;&#28857;&#32780;&#24433;&#21709;&#20197;&#20013;&#31435;&#22320;&#24577;&#24230;&#24635;&#32467;&#36777;&#35770;&#30340;&#29366;&#24577;&#65292;&#23601;&#27809;&#24517;&#35201;&#35753;&#20182;&#20204;&#33073;&#31163;&#20105;&#35770;&#12290;</p><p>&#34920;&#20915;&#30340;&#23454;&#38469;&#20869;&#23481;&#36890;&#24120;&#19981;&#24212;&#24403;&#26159;&#26377;&#20105;&#35758;&#30340;&#12290;&#24403;&#34920;&#20915;&#26102;&#21051;&#21040;&#26469;&#65292;&#20998;&#27495;&#36890;&#24120;&#20250;&#24402;&#32435;&#20026;&#19968;&#20123;&#21253;&#21547;&#21487;&#35782;&#21035;&#30340;&#26631;&#31614;&#21644;&#31616;&#30701;&#25551;&#36848;&#30340;&#20851;&#38190;&#38382;&#39064;&#12290;&#20598;&#23572;&#26576;&#20010;&#24320;&#21457;&#32773;&#20250;&#21453;&#23545;&#34920;&#20915;&#26412;&#36523;&#30340;&#24418;&#24335;&#12290;&#26377;&#26102;&#20505;&#20182;&#30340;&#32771;&#34385;&#26159;&#26377;&#36947;&#29702;&#30340;&#65292;&#20363;&#22914;&#65292;&#19968;&#20010;&#36873;&#39033;&#34987;&#36951;&#28431;&#20102;&#25110;&#25551;&#36848;&#30340;&#19981;&#22815;&#31934;&#30830;&#12290;&#20294;&#26159;&#36824;&#26377;&#19968;&#20123;&#26102;&#20505;&#65292;&#24320;&#21457;&#32773;&#20165;&#20165;&#24076;&#26395;&#36991;&#24320;&#36825;&#20010;&#34920;&#20915;&#65292;&#22240;&#20026;&#20182;&#30693;&#36947;&#34920;&#20915;&#19981;&#20250;&#24471;&#21040;&#33258;&#24049;&#26399;&#26395;&#30340;&#32467;&#26524;&#12290;&#22914;&#20309;&#22788;&#29702;&#27492;&#31867;&#33988;&#24847;&#38459;&#25376;&#21487;&#20197;&#30475;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="difficult-people.html" title="&#21050;&#20799;&#22836;">the section called &#8220;&#21050;&#20799;&#22836;&#8221;</a>&#12290;</p><p>&#35201;&#35760;&#20303;&#25351;&#26126;&#34920;&#20915;&#31995;&#32479;&#65292;&#22240;&#20026;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#31867;&#22411;&#65292;&#20154;&#20204;&#24456;&#23481;&#26131;&#38169;&#35823;&#30340;&#20551;&#23450;&#20351;&#29992;&#26576;&#20010;&#27493;&#39588;&#12290;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#30340;&#36739;&#22909;&#36873;&#25321;&#26159;<em class="firstterm">&#21516;&#24847;&#34920;&#20915;&#65288;approval voting&#65289;</em>&#65292;&#20063;&#23601;&#26159;&#27599;&#20010;&#34920;&#20915;&#32773;&#21487;&#20197;&#36873;&#25321;&#22810;&#20010;&#20013;&#24847;&#30340;&#36873;&#39033;&#12290;&#21516;&#24847;&#34920;&#20915;&#26131;&#20110;&#35299;&#37322;&#21644;&#32479;&#35745;&#65292;&#20063;&#19981;&#20250;&#20687;&#20854;&#20182;&#26041;&#27861;&#37027;&#26679;&#65292;&#23427;&#21482;&#26377;&#19968;&#36718;&#34920;&#20915;&#12290;&#20851;&#20110;&#21516;&#24847;&#34920;&#20915;&#21644;&#20854;&#20182;&#34920;&#20915;&#31995;&#32479;&#30340;&#26356;&#22810;&#32454;&#33410;&#21487;&#20197;&#30475;<a class="ulink" href="http://en.wikipedia.org/wiki/Voting_system#List_of_systems" target="_top">http://en.wikipedia.org/wiki/Voting_system#List_of_systems</a>&#65292;&#20294;&#26159;&#35201;&#36991;&#20813;&#38519;&#20837;&#20351;&#29992;&#20309;&#31181;&#34920;&#20915;&#31995;&#32479;&#30340;&#38271;&#26399;&#36777;&#35770;&#65288;&#22240;&#20026;&#65292;&#24403;&#28982;&#20320;&#20250;&#21457;&#29616;&#20320;&#38519;&#20837;&#20102;&#20351;&#29992;&#20309;&#31181;&#34920;&#20915;&#31995;&#32479;&#36873;&#25321;&#34920;&#20915;&#31995;&#32479;&#30340;&#36777;&#35770;&#65281;&#65289;&#12290;&#21516;&#24847;&#34920;&#20915;&#26159;&#27491;&#30830;&#36873;&#25321;&#30340;&#19968;&#20010;&#21407;&#22240;&#26159;&#20219;&#20309;&#20154;&#37117;&#24456;&#38590;&#21453;&#23545;&#8212;&#20316;&#20026;&#34920;&#20915;&#31995;&#32479;&#23427;&#36275;&#22815;&#20844;&#24179;&#12290;</p><p>&#26368;&#21518;&#65292;&#20844;&#24320;&#24341;&#23548;&#34920;&#20915;&#12290;&#27809;&#26377;&#24517;&#35201;&#23545;&#20844;&#24320;&#35752;&#35770;&#30340;&#20107;&#21153;&#36827;&#34892;&#31192;&#23494;&#25110;&#21311;&#21517;&#30340;&#34920;&#20915;&#12290;&#35753;&#27599;&#20010;&#21442;&#19982;&#32773;&#22312;&#39033;&#30446;&#37038;&#20214;&#21015;&#34920;&#20013;&#21457;&#24067;&#33258;&#24049;&#30340;&#34920;&#20915;&#65292;&#36825;&#26679;&#27599;&#20010;&#35266;&#23519;&#32773;&#37117;&#21487;&#20197;&#33258;&#24049;&#26816;&#26597;&#32467;&#26524;&#65292;&#32780;&#19988;&#25152;&#26377;&#30340;&#20869;&#23481;&#37117;&#20250;&#35760;&#24405;&#21040;&#24402;&#26723;&#20013;&#12290;</p></div><div class="sect2" title="&#20309;&#26102;&#34920;&#20915;"><div class="titlepage"><div><div><h3 class="title"><a name="when-to-vote"></a>&#20309;&#26102;&#34920;&#20915;</h3></div></div></div><p>&#26368;&#38590;&#30340;&#20107;&#24773;&#26159;&#20915;&#23450;&#20309;&#26102;&#24320;&#22987;&#34920;&#20915;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#24456;&#23569;&#20250;&#36827;&#34892;&#34920;&#20915;&#8212;&#26159;&#20854;&#20182;&#26041;&#27861;&#37117;&#22833;&#36133;&#21518;&#30340;&#34917;&#25937;&#26041;&#27861;&#12290;&#19981;&#35201;&#23558;&#34920;&#20915;&#24403;&#20316;&#35299;&#20915;&#20105;&#36777;&#30340;&#37325;&#35201;&#26041;&#27861;&#12290;&#23427;&#19981;&#26159;&#12290;&#23427;&#21487;&#20197;&#32456;&#32467;&#35752;&#35770;&#65292;&#20063;&#20250;&#32467;&#26463;&#20851;&#20110;&#27492;&#38382;&#39064;&#30340;&#21019;&#36896;&#24615;&#24605;&#32771;&#12290;&#21482;&#35201;&#35752;&#35770;&#36824;&#20250;&#32487;&#32493;&#65292;&#23601;&#26377;&#21487;&#33021;&#20250;&#26377;&#20154;&#24471;&#20986;&#25152;&#26377;&#20154;&#28385;&#24847;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#36825;&#32463;&#24120;&#20196;&#20154;&#21507;&#24778;&#65306;&#27963;&#36291;&#30340;&#20105;&#35770;&#21487;&#20197;&#20135;&#29983;&#20851;&#20110;&#38382;&#39064;&#30340;&#26032;&#26041;&#27861;&#65292;&#20063;&#20250;&#24471;&#20986;&#20351;&#27599;&#20010;&#20154;&#37117;&#28385;&#24847;&#30340;&#25552;&#35758;&#12290;&#21363;&#20351;&#27809;&#26377;&#20986;&#29616;&#26032;&#30340;&#25552;&#35758;&#65292;&#36890;&#24120;&#37319;&#32435;&#26576;&#31181;&#22949;&#21327;&#20063;&#27604;&#20030;&#34892;&#34920;&#20915;&#35201;&#22909;&#12290;&#32463;&#36807;&#22949;&#21327;&#65292;&#27599;&#20010;&#20154;&#37117;&#25110;&#35768;&#20250;&#26377;&#28857;&#19981;&#39640;&#20852;&#65292;&#20294;&#26159;&#34920;&#20915;&#36807;&#21518;&#65292;&#26377;&#20123;&#20154;&#20250;&#24320;&#24515;&#65292;&#36824;&#26377;&#20123;&#20154;&#20250;&#22833;&#26395;&#12290;&#20174;&#25919;&#27835;&#35270;&#35282;&#65292;&#21069;&#19968;&#31181;&#29366;&#24577;&#26356;&#21487;&#21462;&#65306;&#33267;&#23569;&#27599;&#20010;&#20154;&#37117;&#20250;&#24863;&#21040;&#20026;&#33258;&#24049;&#30340;&#19981;&#24555;&#33795;&#21462;&#20102;&#19968;&#23450;&#30340;&#20215;&#20540;&#12290;&#20182;&#20250;&#19981;&#28385;&#24847;&#65292;&#20294;&#20854;&#20182;&#20154;&#20063;&#19968;&#26679;&#12290;</p><p>&#34920;&#20915;&#30340;&#20027;&#35201;&#20248;&#28857;&#26159;&#26368;&#32456;&#21487;&#20197;&#35299;&#20915;&#38382;&#39064;&#65292;&#36825;&#26679;&#27599;&#20010;&#20154;&#37117;&#21487;&#20197;&#32487;&#32493;&#21069;&#36827;&#12290;&#20294;&#26159;&#36890;&#36807;&#25968;&#20154;&#22836;&#65292;&#32780;&#19981;&#26159;&#36890;&#36807;&#26377;&#29702;&#24615;&#30340;&#23545;&#35805;&#35299;&#20915;&#38382;&#39064;&#65292;&#23548;&#33268;&#27599;&#20010;&#20154;&#24471;&#20986;&#30456;&#21516;&#30340;&#32467;&#35770;&#12290;&#24320;&#28304;&#39033;&#30446;&#20013;&#30340;&#20154;&#36234;&#26377;&#32463;&#39564;&#65292;&#23601;&#20250;&#36234;&#21457;&#29616;&#20182;&#20204;&#36234;&#19981;&#20250;&#24613;&#20110;&#29992;&#34920;&#20915;&#35299;&#20915;&#38382;&#39064;&#12290;&#30456;&#21453;&#65292;&#20182;&#20204;&#20250;&#23581;&#35797;&#32771;&#23519;&#20197;&#21069;&#26410;&#32771;&#34385;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#25110;&#32773;&#23545;&#20197;&#21069;&#35745;&#21010;&#30340;&#26041;&#27861;&#36827;&#34892;&#36739;&#22823;&#30340;&#22949;&#21327;&#12290;&#26377;&#35768;&#22810;&#25216;&#26415;&#25163;&#27573;&#21487;&#20197;&#38450;&#27490;&#36807;&#26089;&#30340;&#34920;&#20915;&#12290;&#26368;&#26126;&#26174;&#30340;&#26041;&#27861;&#26159;&#35828;&#8220;&#25105;&#35273;&#24471;&#36824;&#27809;&#26377;&#20934;&#22791;&#22909;&#24320;&#22987;&#34920;&#20915;&#65292;&#8221;&#28982;&#21518;&#35299;&#37322;&#20026;&#20160;&#20040;&#36824;&#19981;&#34892;&#12290;&#21478;&#19968;&#20010;&#26041;&#27861;&#26159;&#35201;&#27714;&#36827;&#34892;&#38750;&#27491;&#24335;&#65288;&#26080;&#32422;&#26463;&#21147;&#30340;&#65289;&#30340;&#20030;&#25163;&#34920;&#20915;&#12290;&#22914;&#26524;&#32467;&#26524;&#26126;&#30830;&#20542;&#21521;&#21040;&#19968;&#36793;&#65292;&#23601;&#20250;&#35753;&#26576;&#20123;&#20154;&#31435;&#21051;&#26356;&#24076;&#26395;&#36827;&#34892;&#22949;&#21327;&#65292;&#20197;&#36991;&#20813;&#27491;&#24335;&#30340;&#34920;&#20915;&#12290;&#20294;&#26159;&#26368;&#26377;&#25928;&#29575;&#30340;&#26041;&#27861;&#26159;&#31616;&#21333;&#30340;&#25552;&#20379;&#19968;&#20010;&#26032;&#30340;&#26041;&#26696;&#65292;&#25110;&#32773;&#19968;&#20010;&#36739;&#26089;&#24314;&#35758;&#30340;&#26032;&#35270;&#28857;&#65292;&#25152;&#20197;&#20154;&#20204;&#21487;&#20197;&#37325;&#26032;&#23457;&#35270;&#38382;&#39064;&#65292;&#32780;&#19981;&#26159;&#31616;&#21333;&#30340;&#19981;&#26029;&#37325;&#22797;&#21516;&#26679;&#30340;&#35770;&#28857;&#12290;</p><p>&#22312;&#26576;&#20123;&#24456;&#32597;&#35265;&#30340;&#24773;&#20917;&#20013;&#65292;&#27599;&#20010;&#20154;&#37117;&#35748;&#20026;&#25152;&#26377;&#25240;&#20013;&#30340;&#35299;&#20915;&#26041;&#26696;&#37117;&#27604;&#20219;&#20309;&#19968;&#20010;&#38750;&#25240;&#20013;&#26041;&#26696;&#35201;&#24046;&#12290;&#24403;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#26102;&#65292;&#34920;&#20915;&#23601;&#20250;&#26377;&#36739;&#23569;&#30340;&#24322;&#35758;&#65292;&#19981;&#20165;&#20165;&#22240;&#20026;&#23427;&#33021;&#22815;&#24471;&#21040;&#19968;&#20010;&#39640;&#20154;&#19968;&#31561;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#32780;&#19988;&#26159;&#22240;&#20026;&#36825;&#26679;&#19981;&#20250;&#23548;&#33268;&#25152;&#26377;&#20154;&#23545;&#32467;&#26524;&#24863;&#21040;&#19981;&#39640;&#20852;&#12290;&#23613;&#31649;&#37027;&#26679;&#65292;&#34920;&#20915;&#20063;&#19981;&#24212;&#35813;&#21254;&#24537;&#36827;&#34892;&#12290;&#23548;&#33268;&#34920;&#20915;&#30340;&#35752;&#35770;&#21487;&#20197;&#25945;&#32946;&#20840;&#20307;&#36873;&#27665;&#65292;&#25152;&#20197;&#36807;&#26089;&#30340;&#32467;&#26463;&#35752;&#35770;&#20250;&#38477;&#20302;&#32467;&#26524;&#30340;&#36136;&#37327;&#12290;</p><p>&#65288;&#35201;&#27880;&#24847;&#21069;&#38754;&#25152;&#35828;&#30340;&#34920;&#20915;&#24314;&#35758;&#19981;&#36866;&#29992;&#20110;<span><a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a>&#30340;</span><a class="xref" href="stabilizing-a-release.html" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;">the section called &#8220;&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;&#8221;</a>&#20013;&#25551;&#36848;&#30340;&#21464;&#26356;&#21253;&#21547;&#34920;&#20915;&#12290;&#27492;&#26102;&#65292;&#34920;&#20915;&#26356;&#20687;&#26159;&#19968;&#31181;&#20132;&#27969;&#26426;&#21046;&#65292;&#19968;&#31181;&#22312;&#21464;&#26356;&#35780;&#23457;&#36807;&#31243;&#27880;&#20876;&#26576;&#20154;&#21442;&#19982;&#30340;&#26041;&#27861;&#65292;&#36825;&#26679;&#27599;&#20010;&#20154;&#37117;&#21487;&#20197;&#35828;&#20986;&#23545;&#20110;&#19968;&#20010;&#21464;&#26356;&#25910;&#21040;&#20102;&#22810;&#23569;&#35780;&#23457;&#12290;&#65289;</p></div><div class="sect2" title="&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;"><div class="titlepage"><div><div><h3 class="title"><a name="electorate"></a>&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;</h3></div></div></div><p>&#26377;&#20102;&#34920;&#20915;&#31995;&#32479;&#23601;&#20250;&#20986;&#29616;&#19968;&#20010;&#20840;&#27665;&#36873;&#20030;&#30340;&#38382;&#39064;&#65306;&#35841;&#24212;&#35813;&#34920;&#20915;&#65311;&#36825;&#26377;&#21487;&#33021;&#25104;&#20026;&#25935;&#24863;&#30340;&#38382;&#39064;&#65292;&#22240;&#20026;&#23427;&#24378;&#21046;&#39033;&#30446;&#27491;&#24335;&#35782;&#21035;&#20986;&#19968;&#20123;&#26356;&#24212;&#35813;&#21442;&#19982;&#30340;&#20154;&#65292;&#20063;&#23601;&#26159;&#27604;&#20854;&#20182;&#20154;&#26356;&#26377;&#21028;&#26029;&#21147;&#30340;&#20154;&#12290;</p><p>&#26368;&#22909;&#30340;&#26041;&#27861;&#26159;&#37319;&#29992;&#24050;&#23384;&#22312;&#30340;&#21010;&#20998;&#65292;&#25552;&#20132;&#35775;&#38382;&#65292;&#24182;&#20026;&#20182;&#20204;&#38468;&#21152;&#34920;&#20915;&#29305;&#26435;&#12290;&#22312;&#25552;&#20379;&#23436;&#20840;&#21644;&#37096;&#20998;&#25552;&#20132;&#35775;&#38382;&#30340;&#39033;&#30446;&#20013;&#65292;&#37096;&#20998;&#25552;&#20132;&#32773;&#26159;&#21542;&#21487;&#20197;&#34920;&#20915;&#30340;&#38382;&#39064;&#65292;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#37096;&#20998;&#25552;&#20132;&#35775;&#38382;&#34987;&#36171;&#20104;&#30340;&#36807;&#31243;&#12290; &#22914;&#26524;&#39033;&#30446;&#33258;&#30001;&#22788;&#29702;&#65292;&#20363;&#22914;&#65292;&#22312;&#29256;&#26412;&#24211;&#20013;&#32500;&#25252;&#35768;&#22810;&#31532;&#19977;&#26041;&#36129;&#29486;&#24037;&#20855;&#30340;&#26041;&#27861;&#65292;&#37027;&#26102;&#23601;&#24212;&#24403;&#28548;&#28165;&#37096;&#20998;&#25552;&#20132;&#35775;&#38382;&#21482;&#26159;&#20851;&#20110;&#25552;&#20132;&#65292;&#32780;&#19981;&#26159;&#34920;&#20915;&#12290;&#30456;&#21453;&#30340;&#26263;&#31034;&#33258;&#28982;&#20063;&#25104;&#31435;&#65306;&#22240;&#20026;&#23436;&#20840;&#25552;&#20132;&#32773;<span class="emphasis"><em>&#20250;</em></span>&#26377;&#25552;&#20132;&#29305;&#26435;&#65292;&#20182;&#20204;&#24212;&#24403;&#19981;&#20165;&#20165;&#26159;&#31243;&#24207;&#21592;&#65292;&#32780;&#19988;&#26159;&#20840;&#27665;&#36873;&#20030;&#30340;&#25104;&#21592;&#12290;&#22914;&#26524;&#26576;&#20154;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#26377;&#20998;&#35010;&#25110;&#30772;&#22351;&#20542;&#21521;&#65292;&#37027;&#20040;&#35201;&#23567;&#24515;&#23558;&#20854;&#21152;&#20026;&#25552;&#20132;&#32773;&#65292;&#21363;&#20351;&#36825;&#20010;&#20154;&#22312;&#25216;&#26415;&#19978;&#38750;&#24120;&#23092;&#29087;&#12290;</p><p>&#34920;&#20915;&#31995;&#32479;&#26412;&#36523;&#24212;&#24403;&#29992;&#26469;&#36873;&#25321;&#26032;&#30340;&#25552;&#20132;&#32773;&#65292;&#21253;&#25324;&#23436;&#20840;&#21644;&#37096;&#20998;&#25552;&#20132;&#32773;&#12290;&#20294;&#36825;&#26159;&#19968;&#20010;&#19981;&#22826;&#24120;&#35265;&#30340;&#38656;&#35201;&#27880;&#24847;&#20445;&#23494;&#24615;&#30340;&#24773;&#20917;&#12290;&#20320;&#19981;&#33021;&#20026;&#19968;&#20010;&#28508;&#22312;&#30340;&#25552;&#20132;&#32773;&#22312;&#20844;&#20849;&#37038;&#20214;&#21015;&#34920;&#34920;&#20915;&#65292;&#22240;&#20026;&#19981;&#33021;&#20260;&#23475;&#20505;&#36873;&#32773;&#30340;&#24863;&#24773;&#65288;&#21644;&#33635;&#35465;&#65289;&#12290;&#30456;&#21453;&#65292;&#36890;&#24120;&#30340;&#26041;&#27861;&#26159;&#26576;&#20010;&#29616;&#26377;&#30340;&#25552;&#20132;&#32773;&#22312;&#21482;&#21253;&#21547;&#25552;&#20132;&#32773;&#30340;&#31169;&#26377;&#37038;&#20214;&#21015;&#34920;&#20013;&#21457;&#24067;&#19968;&#20010;&#31169;&#26377;&#37038;&#20214;&#65292;&#24314;&#35758;&#32473;&#26576;&#20154;&#38468;&#21152;&#25552;&#20132;&#26435;&#38480;&#12290;&#20854;&#20182;&#25552;&#20132;&#32773;&#21487;&#20197;&#33258;&#30001;&#21457;&#34920;&#24847;&#35265;&#65292;&#20182;&#20204;&#28165;&#26970;&#35752;&#35770;&#26159;&#31169;&#19979;&#36827;&#34892;&#30340;&#12290;&#36890;&#24120;&#27809;&#26377;&#24322;&#35758;&#65292;&#22240;&#32780;&#27809;&#26377;&#34920;&#20915;&#30340;&#24517;&#35201;&#12290;&#22312;&#31561;&#24453;&#20960;&#22825;&#20043;&#21518;&#65292;&#30830;&#20445;&#27599;&#20010;&#25552;&#20132;&#32773;&#26377;&#26426;&#20250;&#22238;&#24212;&#20043;&#21518;&#65292;&#25552;&#35758;&#32773;&#36890;&#30693;&#20505;&#36873;&#32773;&#24182;&#36171;&#20104;&#20854;&#25552;&#20132;&#26435;&#38480;&#12290;&#22914;&#26524;&#23384;&#22312;&#24322;&#35758;&#65292;&#22240;&#32780;&#20986;&#29616;&#20854;&#20182;&#38382;&#39064;&#30340;&#35752;&#35770;&#65292;&#21487;&#33021;&#20250;&#23548;&#33268;&#34920;&#20915;&#12290;&#22240;&#20026;&#36825;&#20010;&#36807;&#31243;&#38656;&#35201;&#24320;&#25918;&#21644;&#22374;&#30333;&#65292;&#25152;&#20197;&#21457;&#29983;&#35752;&#35770;&#30340;&#20107;&#23454;&#24212;&#24403;&#23436;&#20840;&#20445;&#23494;&#12290;&#22914;&#26524;&#34987;&#32771;&#34385;&#30340;&#20154;&#30693;&#36947;&#20107;&#24773;&#30340;&#36827;&#23637;&#65292;&#28982;&#21518;&#27809;&#26377;&#25552;&#20379;&#25552;&#20132;&#26435;&#38480;&#65292;&#20182;&#21487;&#33021;&#35748;&#20026;&#20182;&#24050;&#32463;&#22312;&#34920;&#20915;&#20013;&#22833;&#36133;&#65292;&#20250;&#24863;&#21040;&#21463;&#21040;&#20260;&#23475;&#12290;&#24403;&#28982;&#65292;&#22914;&#26524;&#26576;&#20154;&#26126;&#30830;&#30340;&#35201;&#27714;&#25552;&#20132;&#26435;&#38480;&#65292;&#27809;&#26377;&#20854;&#20182;&#30340;&#36873;&#25321;&#65292;&#35201;&#20040;&#21516;&#24847;&#65292;&#35201;&#20040;&#25298;&#32477;&#12290;&#22914;&#26524;&#26159;&#21518;&#32773;&#65292;&#24212;&#24403;&#23613;&#37327;&#30340;&#26377;&#31036;&#35980;&#65292;&#24182;&#20351;&#29992;&#28165;&#26224;&#30340;&#35299;&#37322;&#65306;&#8220;&#25105;&#20204;&#21916;&#27426;&#20320;&#30340;&#34917;&#19969;&#65292;&#20294;&#26159;&#36824;&#27809;&#26377;&#30475;&#21040;&#36275;&#22815;&#30340;&#34917;&#19969;&#65292;&#8221;&#25110;&#32773;&#8220;&#25105;&#20204;&#24863;&#35874;&#20320;&#30340;&#34917;&#19969;&#65292;&#20294;&#26159;&#22312;&#23454;&#38469;&#20351;&#29992;&#20043;&#21069;&#38656;&#35201;&#30456;&#24403;&#22823;&#30340;&#35843;&#25972;&#65292;&#25152;&#20197;&#25105;&#20204;&#35273;&#24471;&#29616;&#22312;&#36824;&#19981;&#33021;&#25918;&#24515;&#32473;&#20320;&#25552;&#20132;&#26435;&#38480;&#12290;&#25105;&#20204;&#24076;&#26395;&#19979;&#19968;&#27425;&#20250;&#26377;&#20123;&#25913;&#35266;&#12290;&#8221;&#35831;&#35760;&#20303;&#65292;&#20320;&#25152;&#35828;&#30340;&#20250;&#26159;&#19968;&#20010;&#25171;&#20987;&#65292;&#36825;&#35201;&#30475;&#20010;&#20154;&#30340;&#33258;&#20449;&#24515;&#27700;&#24179;&#12290;&#24212;&#24403;&#20174;&#20182;&#20204;&#30340;&#35282;&#24230;&#24819;&#24819;&#22914;&#26524;&#20320;&#30475;&#21040;&#37027;&#20123;&#37038;&#20214;&#30340;&#24863;&#35273;&#12290;</p><p>&#22240;&#20026;&#28155;&#21152;&#26032;&#25552;&#20132;&#32773;&#19981;&#26159;&#37027;&#31181;&#19968;&#27425;&#24615;&#20915;&#23450;&#65292;&#20250;&#26377;&#21518;&#32493;&#30340;&#32467;&#26524;&#65292;&#26576;&#20123;&#39033;&#30446;&#20250;&#26377;&#34920;&#20915;&#30340;&#29305;&#27530;&#35201;&#27714;&#12290;&#20363;&#22914;&#65292;&#20182;&#20204;&#20250;&#35201;&#27714;&#25552;&#35758;&#33267;&#23569;&#33719;&#24471;<span class="emphasis"><em>n</em></span>&#20010;&#32943;&#23450;&#30340;&#34920;&#20915;&#65292;&#32780;&#19988;&#27809;&#26377;&#21542;&#23450;&#30340;&#34920;&#20915;&#65292;&#25110;&#21322;&#25968;&#20197;&#19978;&#30340;&#36190;&#21516;&#31080;&#12290;&#31934;&#30830;&#30340;&#21442;&#25968;&#24182;&#19981;&#37325;&#35201;&#65307;&#20027;&#35201;&#30340;&#24605;&#24819;&#26159;&#22312;&#28155;&#21152;&#25552;&#20132;&#32773;&#26102;&#38656;&#35201;&#35753;&#22242;&#38431;&#23567;&#24515;&#22788;&#29702;&#12290;&#31867;&#20284;&#30340;&#65292;&#25110;&#26356;&#20005;&#26684;&#30340;&#65292;&#29305;&#21035;&#30340;&#38656;&#27714;&#20063;&#21487;&#20197;&#24212;&#29992;&#21040;&#36873;&#20030;<span class="emphasis"><em>&#31227;&#38500;</em></span>&#25552;&#20132;&#32773;&#19978;&#65292;&#23613;&#31649;&#24456;&#24076;&#26395;&#37027;&#27704;&#36828;&#27809;&#26377;&#24517;&#35201;&#21457;&#29983;&#12290;&#20851;&#20110;&#28155;&#21152;&#21644;&#31227;&#38500;&#25552;&#20132;&#32773;&#30340;&#38750;&#34920;&#20915;&#26041;&#38754;&#30340;&#20449;&#24687;&#21487;&#20197;&#30475;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="committers.html" title="&#25552;&#20132;&#32773;">the section called &#8220;&#25552;&#20132;&#32773;&#8221;</a>&#12290;</p></div><div class="sect2" title="&#27665;&#24847;&#35843;&#26597;&#19982;&#34920;&#20915;"><div class="titlepage"><div><div><h3 class="title"><a name="polls"></a>&#27665;&#24847;&#35843;&#26597;&#19982;&#34920;&#20915;</h3></div></div></div><p>&#23545;&#20110;&#29305;&#23450;&#31867;&#22411;&#30340;&#34920;&#20915;&#65292;&#26377;&#26102;&#20505;&#25193;&#23637;&#36873;&#27665;&#20250;&#24456;&#26377;&#29992;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#24320;&#21457;&#32773;&#21482;&#26159;&#19981;&#33021;&#30830;&#23450;&#21738;&#31181;&#30028;&#38754;&#31526;&#21512;&#20154;&#20204;&#23454;&#38469;&#20351;&#29992;&#36719;&#20214;&#30340;&#26041;&#24335;&#65292;&#19968;&#20010;&#26041;&#27861;&#23601;&#26159;&#35810;&#38382;&#39033;&#30446;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#25152;&#26377;&#20154;&#36827;&#34892;&#34920;&#20915;&#12290;&#36825;&#26356;&#24212;&#35813;&#21483;&#20570;<em class="firstterm">&#27665;&#24847;&#35843;&#26597;</em>&#32780;&#19981;&#26159;&#34920;&#20915;&#65292;&#20294;&#26159;&#24320;&#21457;&#32773;&#21487;&#33021;&#23558;&#32467;&#26524;&#35270;&#20026;&#26377;&#32422;&#26463;&#21147;&#30340;&#12290;&#22312;&#20219;&#20309;&#27665;&#35843;&#20013;&#65292;&#35201;&#30830;&#20445;&#21442;&#19982;&#32773;&#21487;&#20197;&#38468;&#21152;&#36873;&#39033;&#65306;&#22914;&#26524;&#26576;&#20154;&#23545;&#20110;&#27665;&#35843;&#38382;&#39064;&#24819;&#21040;&#20102;&#26356;&#22909;&#30340;&#36873;&#39033;&#65292;&#22905;&#30340;&#22238;&#24212;&#20250;&#25104;&#20026;&#26368;&#37325;&#35201;&#30340;&#27665;&#35843;&#32467;&#26524;&#12290;</p></div><div class="sect2" title="&#21542;&#20915;&#26435;"><div class="titlepage"><div><div><h3 class="title"><a name="veto"></a>&#21542;&#20915;&#26435;</h3></div></div></div><p>&#26576;&#20123;&#39033;&#30446;&#20801;&#35768;&#19968;&#31181;&#29305;&#27530;&#30340;&#34920;&#20915;&#31867;&#22411;&#65292;&#31216;&#20026;<em class="firstterm">&#21542;&#20915;&#26435;</em>&#12290;&#21542;&#20915;&#26435;&#26159;&#19968;&#31181;&#24320;&#21457;&#32773;&#20572;&#27490;&#20179;&#20419;&#25110;&#32771;&#34385;&#19981;&#22815;&#20805;&#20998;&#21464;&#26356;&#30340;&#26041;&#27861;&#65292;&#33267;&#23569;&#24076;&#26395;&#27599;&#20010;&#20154;&#33021;&#22815;&#20877;&#36827;&#34892;&#19968;&#20123;&#35752;&#35770;&#12290;&#32771;&#34385;&#21040;&#21542;&#20915;&#26435;&#20171;&#20046;&#20110;&#24378;&#28872;&#21453;&#23545;&#21644;&#38459;&#25376;&#20043;&#38388;&#12290;&#23427;&#30830;&#20999;&#30340;&#21547;&#20041;&#23545;&#20110;&#27599;&#20010;&#39033;&#30446;&#37117;&#19981;&#23613;&#30456;&#21516;&#12290;&#26377;&#20123;&#39033;&#30446;&#35753;&#21542;&#20915;&#24456;&#38590;&#34987;&#36926;&#36234;&#65307;&#26377;&#20123;&#21017;&#20801;&#35768;&#32463;&#36807;&#24378;&#21046;&#30340;&#26356;&#22810;&#35752;&#35770;&#24310;&#36831;&#21518;&#65292;&#34987;&#26222;&#36890;&#30340;&#22810;&#25968;&#25237;&#31080;&#26367;&#20195;&#12290;&#20219;&#20309;&#21542;&#20915;&#24517;&#39035;&#20276;&#38543;&#23436;&#25972;&#30340;&#35299;&#37322;&#65307;&#20219;&#20309;&#27809;&#26377;&#36825;&#31867;&#35299;&#37322;&#30340;&#21542;&#20915;&#37117;&#24212;&#24403;&#34987;&#35748;&#20026;&#26159;&#26080;&#25928;&#30340;&#12290;</p><p>&#21542;&#20915;&#26435;&#20250;&#24102;&#26469;&#23545;&#20854;&#30340;&#28389;&#29992;&#12290;&#26377;&#26102;&#20505;&#24320;&#21457;&#32773;&#20250;&#24613;&#36843;&#30340;&#36890;&#36807;&#21542;&#20915;&#26435;&#26469;&#20026;&#33258;&#24049;&#30340;&#35770;&#28857;&#21152;&#37325;&#30749;&#30721;&#65292;&#32780;&#30495;&#27491;&#38656;&#35201;&#30340;&#26159;&#26356;&#22810;&#30340;&#35752;&#35770;&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;&#33258;&#24049;&#23545;&#20110;&#21542;&#20915;&#26435;&#30340;&#21193;&#24378;&#20351;&#29992;&#26469;&#38450;&#27490;&#23545;&#20110;&#21542;&#20915;&#30340;&#28389;&#29992;&#65292;&#24182;&#26377;&#31036;&#35980;&#30340;&#35686;&#21578;&#26576;&#20154;&#22826;&#36807;&#39057;&#32321;&#30340;&#20351;&#29992;&#21542;&#20915;&#26435;&#12290;&#22914;&#26524;&#24517;&#35201;&#65292;&#20320;&#21487;&#20197;&#25552;&#37266;&#22242;&#38431;&#65292;&#21542;&#20915;&#26435;&#21482;&#22312;&#22242;&#38431;&#20063;&#35748;&#21487;&#30340;&#26102;&#20505;&#26377;&#25928;&#8212;&#27605;&#31455;&#65292;&#22914;&#26524;&#24456;&#26126;&#26174;&#22823;&#22810;&#25968;&#24320;&#21457;&#32773;&#24076;&#26395;X&#65292;&#37027;&#20040;&#23601;&#24212;&#35813;&#37319;&#32435;X&#12290;&#21542;&#20915;&#30340;&#24320;&#21457;&#32773;&#35201;&#20040;&#33258;&#24049;&#35753;&#27493;&#65292;&#35201;&#20040;&#35753;&#22242;&#38431;&#20915;&#23450;&#21066;&#24369;&#21542;&#20915;&#26435;&#30340;&#20316;&#29992;&#12290;</p><p>&#20320;&#21487;&#33021;&#20250;&#30475;&#21040;&#20154;&#20204;&#20889;&#20102;&#19968;&#20010;&#8220;-1&#8221;&#26469;&#34920;&#31034;&#21542;&#20915;&#12290;&#36825;&#31181;&#26041;&#27861;&#26469;&#33258;&#25317;&#26377;&#39640;&#24230;&#22797;&#26434;&#34920;&#20915;&#21644;&#21542;&#20915;&#36807;&#31243;&#30340;Apache&#36719;&#20214;&#22522;&#37329;&#20250;&#65292;&#20855;&#20307;&#20869;&#23481;&#21487;&#20197;&#30475;<a class="ulink" href="http://www.apache.org/foundation/voting.html" target="_top">http://www.apache.org/foundation/voting.html</a>&#12290;Apache&#26631;&#20934;&#20063;&#20256;&#25773;&#21040;&#20102;&#20854;&#20182;&#39033;&#30446;&#65292;&#20320;&#21487;&#20197;&#30475;&#21040;&#20182;&#20204;&#30340;&#20064;&#24815;&#22312;&#24320;&#28304;&#19990;&#30028;&#30340;&#35768;&#22810;&#22320;&#26041;&#20197;&#19981;&#21516;&#30340;&#38754;&#35980;&#20986;&#29616;&#12290;&#20174;&#25216;&#26415;&#19978;&#35762;&#65292;&#21363;&#20351;&#26681;&#25454;Apache&#26631;&#20934;&#65292;&#8220;-1&#8221;&#20063;&#19981;&#26159;&#34920;&#31034;&#27491;&#24335;&#30340;&#21542;&#20915;&#65292;&#32780;&#21482;&#26159;&#19968;&#31181;&#34920;&#36798;&#21542;&#20915;&#25110;&#24378;&#28872;&#21453;&#23545;&#30340;&#38750;&#27491;&#24335;&#26041;&#27861;&#12290;</p><p>&#31867;&#20284;&#20110;&#34920;&#20915;&#65292;&#21542;&#20915;&#26435;&#20063;&#21487;&#20197;&#26159;&#36861;&#21152;&#30340;&#12290;&#22914;&#26524;&#26377;&#38382;&#39064;&#30340;&#21464;&#26356;&#24050;&#32463;&#25552;&#20132;&#65292;&#34892;&#21160;&#24050;&#32463;&#25191;&#34892;&#65288;&#38500;&#20102;&#19968;&#20123;&#19981;&#21487;&#25405;&#22238;&#30340;&#20107;&#24773;&#65292;&#20363;&#22914;&#26032;&#38395;&#21457;&#24067;&#65289;&#65292;&#19981;&#24212;&#35813;&#20197;&#27492;&#20026;&#29702;&#30001;&#21453;&#23545;&#19968;&#20010;&#21542;&#20915;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#21542;&#20915;&#22312;&#20107;&#24773;&#21457;&#29983;&#20960;&#21608;&#21518;&#25165;&#20986;&#29616;&#65292;&#23427;&#20063;&#19981;&#20250;&#34987;&#37325;&#35270;&#65292;&#32780;&#19988;&#36825;&#31181;&#24773;&#20917;&#26681;&#26412;&#19981;&#24212;&#35813;&#21457;&#29983;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="social-infrastructure.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="social-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="written-rules.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;</td></tr></table></div></body></html>
