<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#22865;&#32422;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="money-vs-love.html" title="&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;"><link rel="next" href="funding-non-programming.html" title="&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22865;&#32422;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="money-vs-love.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="funding-non-programming.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#22865;&#32422;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="contracting"></a>&#22865;&#32422;</h2></div></div></div><p>&#22312;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#30340;&#22865;&#32422;&#38656;&#35201;&#23567;&#24515;&#22788;&#29702;&#12290;&#29702;&#24819;&#29366;&#20917;&#19979;&#65292;&#20320;&#24076;&#26395;&#19968;&#20010;&#25215;&#21253;&#32773;&#30340;&#24037;&#20316;&#34987;&#31038;&#21306;&#25509;&#21463;&#24182;&#25171;&#21253;&#36827;&#20837;&#20844;&#20849;&#21457;&#24067;&#29256;&#26412;&#12290;&#22312;&#29702;&#35770;&#19978;&#65292;&#35841;&#26159;&#25215;&#21253;&#32773;&#24182;&#19981;&#37325;&#35201;&#65292;&#21482;&#35201;&#20182;&#30340;&#20316;&#21697;&#36275;&#22815;&#22909;&#24182;&#28385;&#36275;&#39033;&#30446;&#30340;&#25351;&#23548;&#26041;&#38024;&#12290;&#29702;&#35770;&#21644;&#23454;&#36341;&#19968;&#33324;&#20063;&#26159;&#19968;&#33268;&#30340;&#65306;&#19968;&#20010;&#36890;&#36807;&#36129;&#29486;&#22909;&#30340;&#34917;&#19969;&#23637;&#31034;&#33258;&#24049;&#30340;&#23436;&#20840;&#38476;&#29983;&#20154;&#36890;&#24120;&#33021;&#23558;&#20195;&#30721;&#32622;&#20837;&#36719;&#20214;&#24403;&#20013;&#12290;&#38382;&#39064;&#26159;&#65292;&#19968;&#20010;&#23436;&#20840;&#30340;&#38476;&#29983;&#20154;&#24456;&#38590;&#20026;&#38750;&#29712;&#30862;&#30340;&#25913;&#36827;&#25110;&#26032;&#30340;&#29305;&#24615;&#36129;&#29486;&#22909;&#30340;&#34917;&#19969;&#65307;&#19968;&#20010;&#20154;&#24517;&#39035;&#39318;&#20808;&#21644;&#39033;&#30446;&#30340;&#20854;&#20182;&#20154;&#36827;&#34892;&#35752;&#35770;&#12290;&#35752;&#35770;&#30340;&#26102;&#38388;&#19981;&#33021;&#31934;&#30830;&#39044;&#27979;&#12290;&#22914;&#26524;&#25215;&#21253;&#32773;&#26681;&#25454;&#23567;&#26102;&#20184;&#36153;&#65292;&#20320;&#26368;&#32456;&#21487;&#33021;&#20250;&#20184;&#20986;&#36229;&#36807;&#39044;&#26399;&#30340;&#36153;&#29992;&#65307;&#22914;&#26524;&#20182;&#26159;&#36890;&#36807;&#24635;&#36153;&#29992;&#25903;&#20184;&#65292;&#37027;&#20040;&#20182;&#26368;&#32456;&#20250;&#20570;&#20986;&#36229;&#36807;&#25215;&#21463;&#33021;&#21147;&#30340;&#24037;&#20316;&#12290;</p><p>&#36825;&#37324;&#26377;&#20004;&#31181;&#26041;&#24335;&#12290;&#36739;&#22909;&#30340;&#19968;&#20010;&#26041;&#27861;&#26159;&#26681;&#25454;&#20197;&#21069;&#30340;&#32463;&#39564;&#65292;&#23545;&#35752;&#35770;&#36807;&#31243;&#30340;&#38271;&#24230;&#20570;&#20986;&#19968;&#20010;&#26377;&#26681;&#25454;&#30340;&#25512;&#27979;&#65292;&#24182;&#35201;&#32771;&#34385;&#21040;&#20986;&#38169;&#30340;&#24310;&#35823;&#65292;&#24182;&#26681;&#25454;&#36825;&#20123;&#20449;&#24687;&#23436;&#25104;&#22865;&#32422;&#12290;&#36825;&#20063;&#26377;&#21033;&#20110;&#23613;&#21487;&#33021;&#30340;&#23558;&#38382;&#39064;&#20998;&#31163;&#20026;&#35768;&#22810;&#23567;&#30340;&#29420;&#31435;&#30340;&#21306;&#22359;&#65292;&#22686;&#21152;&#27599;&#20010;&#21306;&#22359;&#30340;&#21487;&#39044;&#27979;&#33021;&#21147;&#12290;&#21478;&#19968;&#20010;&#26041;&#27861;&#26159;&#20026;&#27599;&#19968;&#20010;&#21457;&#24067;&#30340;&#34917;&#19969;&#21333;&#29420;&#22865;&#32422;&#65292;&#28982;&#21518;&#23558;&#34917;&#19969;&#30340;&#34987;&#25509;&#21463;&#24403;&#20316;&#20844;&#20849;&#39033;&#30446;&#19968;&#20010;&#29420;&#31435;&#30340;&#20107;&#20214;&#12290;&#36825;&#26679;&#32534;&#20889;&#22865;&#32422;&#23601;&#21487;&#20197;&#24456;&#23481;&#26131;&#65292;&#20294;&#26159;&#21482;&#35201;&#20320;&#20381;&#36182;&#36825;&#20010;&#36719;&#20214;&#65292;&#25110;&#33267;&#23569;&#22312;&#36825;&#20010;&#34917;&#19969;&#25110;&#23545;&#24212;&#21151;&#33021;&#36827;&#20837;&#20027;&#32447;&#30340;&#36825;&#20123;&#26102;&#38388;&#37324;&#65292;&#20320;&#24517;&#39035;&#25215;&#25285;&#32500;&#25252;&#21333;&#20010;&#34917;&#19969;&#30340;&#36131;&#20219;&#12290;&#24403;&#28982;&#65292;&#21363;&#20351;&#26159;&#20320;&#20013;&#24847;&#30340;&#26041;&#27861;&#65292;&#22865;&#32422;&#26412;&#36523;&#19981;&#33021;&#35201;&#27714;&#20195;&#30721;&#24517;&#39035;&#21487;&#20197;&#25509;&#21463;&#34917;&#19969;&#65292;&#22240;&#20026;&#37027;&#20250;&#21253;&#21547;&#20986;&#21806;&#19968;&#20123;&#19981;&#33021;&#38144;&#21806;&#30340;&#19996;&#35199;&#12290; &#65288;&#22914;&#26524;&#39033;&#30446;&#30340;&#20313;&#19979;&#25104;&#21592;&#19981;&#24076;&#26395;&#23545;&#36825;&#20010;&#29305;&#24615;&#25552;&#20379;&#25903;&#25345;&#65311;&#65289;&#28982;&#32780;&#65292;&#22865;&#32422;&#21487;&#20197;&#35201;&#27714;<span class="foreignphrase"><em class="foreignphrase">&#30495;&#35802;&#22320;</em></span>&#25237;&#20837;&#20197;&#33719;&#24471;&#31038;&#21306;&#25509;&#21463;&#30340;&#26426;&#20250;&#65292;&#20063;&#23601;&#26159;&#22312;&#31038;&#21306;&#35748;&#21487;&#30340;&#24773;&#20917;&#19979;&#34987;&#25552;&#20132;&#21040;&#29256;&#26412;&#24211;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#39033;&#30446;&#32534;&#20889;&#20102;&#20195;&#30721;&#21464;&#26356;&#30340;&#26631;&#20934;&#65292;&#22865;&#32422;&#21487;&#20197;&#21442;&#32771;&#36825;&#20010;&#26631;&#20934;&#24182;&#25351;&#26126;&#20316;&#21697;&#24517;&#39035;&#36798;&#26631;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#36825;&#36890;&#24120;&#20250;&#36229;&#20986;&#27599;&#20010;&#20154;&#26399;&#26395;&#30340;&#26041;&#24335;&#12290;</p><p>&#26368;&#22909;&#30340;&#31574;&#30053;&#26159;&#38599;&#20323;&#39033;&#30446;&#30340;&#19968;&#20010;&#24320;&#21457;&#32773;&#8212;&#26368;&#22909;&#26159;&#25552;&#20132;&#32773;&#8212;&#20316;&#20026;&#25215;&#21253;&#32773;&#12290;&#36825;&#21487;&#20197;&#30475;&#20316;&#26159;&#36141;&#20080;&#24433;&#21709;&#21147;&#30340;&#19968;&#31181;&#24418;&#24335;&#12290;&#20294;&#26159;&#24182;&#19981;&#26159;&#34920;&#38754;&#19978;&#37027;&#26679;&#30340;&#19981;&#36947;&#24503;&#12290;&#19968;&#20010;&#24320;&#21457;&#32773;&#23545;&#20110;&#39033;&#30446;&#30340;&#24433;&#21709;&#21147;&#20027;&#35201;&#21462;&#20915;&#20110;&#20182;&#30340;&#20195;&#30721;&#36136;&#37327;&#21644;&#19982;&#20854;&#20182;&#24320;&#21457;&#32773;&#30340;&#20132;&#20114;&#12290;&#20182;&#20316;&#20026;&#25215;&#21253;&#32773;&#23436;&#25104;&#29305;&#23450;&#24037;&#20316;&#30340;&#20030;&#21160;&#24182;&#19981;&#20250;&#25552;&#21319;&#20182;&#30340;&#29366;&#24577;&#65292;&#24403;&#28982;&#20063;&#19981;&#20250;&#38477;&#20302;&#65292;&#23613;&#31649;&#36825;&#26679;&#20250;&#35753;&#20154;&#20204;&#23545;&#20182;&#26356;&#21152;&#20180;&#32454;&#30340;&#23457;&#35270;&#12290;&#22823;&#22810;&#25968;&#24320;&#21457;&#32773;&#19981;&#20250;&#22240;&#20026;&#36820;&#22238;&#19981;&#24403;&#25110;&#24191;&#27867;&#21453;&#23545;&#30340;&#26032;&#29305;&#24615;&#32780;&#35753;&#33258;&#24049;&#30340;&#38271;&#26399;&#20301;&#32622;&#32463;&#21463;&#39118;&#38505;&#12290;&#23454;&#38469;&#19978;&#65292;&#24403;&#20320;&#38599;&#20323;&#19968;&#20010;&#36825;&#26679;&#25215;&#21253;&#32773;&#26102;&#65292;&#19968;&#23450;&#31243;&#24230;&#19978;&#20320;&#20250;&#24471;&#21040;&#65292;&#25110;&#32773;&#35828;&#19968;&#23450;&#20250;&#24471;&#21040;&#19968;&#20123;&#20851;&#20110;&#21738;&#20123;&#21464;&#26356;&#20250;&#34987;&#31038;&#21306;&#25509;&#21463;&#30340;&#24544;&#21578;&#12290;&#39033;&#30446;&#30340;&#20248;&#20808;&#32423;&#20063;&#20250;&#24471;&#21040;&#20123;&#35768;&#36716;&#21464;&#12290;&#22240;&#20026;&#20248;&#20808;&#32423;&#21482;&#19982;&#21738;&#20010;&#20154;&#26377;&#26102;&#38388;&#23436;&#25104;&#21738;&#20010;&#20219;&#21153;&#26377;&#20851;&#65292;&#24403;&#20320;&#20026;&#26576;&#20154;&#30340;&#26102;&#38388;&#25903;&#20184;&#26102;&#65292;&#20250;&#23548;&#33268;&#20182;&#20204;&#24037;&#20316;&#30340;&#20248;&#20808;&#32423;&#25552;&#21069;&#19968;&#20123;&#12290;&#36825;&#26159;&#32463;&#39564;&#20016;&#23500;&#30340;&#24320;&#28304;&#24320;&#21457;&#32773;&#37117;&#29702;&#35299;&#30340;&#19968;&#20010;&#20107;&#23454;&#65292;&#33267;&#23569;&#20182;&#20204;&#20013;&#30340;&#26576;&#20123;&#20154;&#20250;&#23558;&#31934;&#21147;&#25237;&#20837;&#21040;&#25215;&#21253;&#32773;&#30340;&#24037;&#20316;&#19978;&#65292;&#20165;&#20165;&#22240;&#20026;&#23427;&#30475;&#36215;&#26469;&#23558;&#35201;<span class="emphasis"><em>&#23436;&#25104;</em></span>&#65292;&#25152;&#20197;&#20182;&#20204;&#24076;&#26395;&#21435;&#24110;&#21161;&#27491;&#30830;&#23436;&#25104;&#12290;&#25110;&#35768;&#20182;&#20204;&#19981;&#20250;&#32534;&#20889;&#20219;&#20309;&#20195;&#30721;&#65292;&#20294;&#26159;&#20182;&#20204;&#36824;&#26159;&#20250;&#35752;&#35770;&#35774;&#35745;&#24182;&#35780;&#23457;&#20195;&#30721;&#65292;&#36825;&#20123;&#37117;&#38750;&#24120;&#26377;&#29992;&#12290;&#20986;&#20110;&#20197;&#19978;&#21407;&#22240;&#65292;&#25215;&#21253;&#32773;&#26368;&#22909;&#26159;&#37027;&#20123;&#24050;&#32463;&#21442;&#19982;&#21040;&#39033;&#30446;&#30340;&#20154;&#12290;</p><p>&#36825;&#26679;&#31435;&#21051;&#20984;&#26174;&#20102;&#20004;&#20010;&#38382;&#39064;&#65306;&#25215;&#21253;&#21327;&#35758;&#24517;&#39035;&#26159;&#31169;&#23494;&#30340;&#21527;&#65311;&#22914;&#26524;&#19981;&#26159;&#65292;&#20320;&#24212;&#24403;&#20026;&#20320;&#22312;&#31038;&#21306;&#20013;&#36896;&#25104;&#30340;&#19981;&#23433;&#32780;&#24863;&#21040;&#25285;&#24551;&#21527;&#65311;&#20320;&#20026;&#26576;&#20123;&#24320;&#21457;&#32773;&#25552;&#20379;&#20102;&#25215;&#21253;&#21512;&#21516;&#65292;&#20026;&#20160;&#20040;&#19981;&#26159;&#20854;&#20182;&#20154;&#21602;&#65311;</p><p>&#22914;&#26524;&#21487;&#20197;&#65292;&#26368;&#22909;&#23558;&#21512;&#21516;&#20844;&#24320;&#12290;&#21542;&#21017;&#65292;&#25215;&#21253;&#32773;&#30340;&#34892;&#20026;&#19982;&#31038;&#21306;&#20013;&#30340;&#20854;&#20182;&#20154;&#30456;&#27604;&#20250;&#30475;&#36215;&#26469;&#26377;&#20123;&#22855;&#24618;&#8212;&#25110;&#35768;&#20182;&#31361;&#28982;&#23545;&#19968;&#20123;&#36807;&#21435;&#20174;&#26410;&#34920;&#29616;&#20986;&#20852;&#36259;&#30340;&#29305;&#24615;&#23637;&#31034;&#20986;&#20102;&#19981;&#21487;&#29702;&#35299;&#30340;&#39640;&#20248;&#20808;&#32423;&#12290;&#24403;&#20154;&#20204;&#35810;&#38382;&#20854;&#21407;&#22240;&#26102;&#65292;&#20182;&#24590;&#26679;&#25165;&#33021;&#36991;&#20813;&#35828;&#20986;&#20182;&#26159;&#26681;&#25454;&#21512;&#21516;&#32534;&#20889;&#20195;&#30721;&#65292;&#21516;&#26102;&#22238;&#31572;&#30340;&#35753;&#20154;&#20449;&#26381;&#12290;</p><p>&#19982;&#27492;&#21516;&#26102;&#65292;&#20320;&#21644;&#25215;&#21253;&#32773;&#37117;&#19981;&#24212;&#35813;&#34920;&#29616;&#30340;&#20223;&#20315;&#20854;&#20182;&#20154;&#24212;&#24403;&#25226;&#20320;&#30340;&#23433;&#25490;&#30475;&#24471;&#36807;&#37325;&#12290;&#25105;&#35265;&#36807;&#19968;&#20123;&#25215;&#21253;&#32773;&#25307;&#25671;&#30528;&#36827;&#20837;&#24320;&#21457;&#21015;&#34920;&#65292;&#33258;&#35748;&#20026;&#20182;&#20204;&#30340;&#30041;&#35328;&#24212;&#35813;&#34987;&#26356;&#21152;&#37073;&#37325;&#30340;&#23545;&#24453;&#65292;&#20165;&#20165;&#22240;&#20026;&#20182;&#20204;&#26159;&#25903;&#20184;&#34218;&#27700;&#30340;&#12290;&#37027;&#31181;&#24577;&#24230;&#20063;&#26159;&#23545;&#20110;&#39033;&#30446;&#20854;&#20182;&#20154;&#30340;&#19968;&#31181;&#20449;&#21495;&#65292;&#25215;&#21253;&#32773;&#30475;&#37325;&#21512;&#21516;&#36825;&#20214;&#20107;&#8212;&#32780;&#19981;&#26159;&#21512;&#21516;<span class="emphasis"><em>&#23548;&#33268;</em></span>&#30340;&#20195;&#30721;&#8212;&#26412;&#24212;&#24403;&#26159;&#37325;&#35201;&#30340;&#20107;&#24773;&#12290;&#20294;&#26159;&#20174;&#20854;&#20182;&#24320;&#21457;&#32773;&#30340;&#35270;&#35282;&#65292;&#21482;&#26377;&#20195;&#30721;&#26377;&#24847;&#20041;&#12290;&#22312;&#20219;&#20309;&#26102;&#20505;&#65292;&#27880;&#24847;&#21147;&#24212;&#35813;&#20445;&#25345;&#22312;&#25216;&#26415;&#38382;&#39064;&#19978;&#65292;&#32780;&#19981;&#26159;&#35841;&#32473;&#35841;&#20184;&#34218;&#27700;&#30340;&#32454;&#33410;&#12290;&#20363;&#22914;&#65292;Subversion&#31038;&#21306;&#30340;&#19968;&#20010;&#24320;&#21457;&#32773;&#29992;&#19968;&#31181;&#20248;&#38597;&#30340;&#26041;&#24335;&#22788;&#29702;&#25215;&#21253;&#12290;&#24403;&#22312;IRC&#35752;&#35770;&#20182;&#30340;&#20195;&#30721;&#21464;&#26356;&#26102;&#65292;&#20182;&#20250;&#22312;&#26049;&#30333;&#65288;&#36890;&#24120;&#26159;&#22312;&#31169;&#26377;&#22791;&#27880;&#65292;&#19968;&#31181;IRC <em class="firstterm">privmsg</em>&#65292;&#21457;&#36865;&#32473;&#20854;&#20182;&#25552;&#20132;&#32773;&#65289;&#20013;&#25552;&#21450;&#20182;&#26159;&#34987;&#25903;&#20184;&#34218;&#27700;&#23436;&#25104;&#29305;&#23450;bug&#25110;&#29305;&#24615;&#12290;&#20294;&#26159;&#20182;&#20063;&#19968;&#30452;&#34920;&#29616;&#20986;&#26080;&#35770;&#22914;&#20309;&#20182;&#37117;&#20250;&#20316;&#20986;&#37027;&#20123;&#21464;&#26356;&#30340;&#21360;&#35937;&#65292;&#24182;&#24456;&#39640;&#20852;&#37329;&#38065;&#21487;&#20197;&#35753;&#20182;&#23436;&#25104;&#37027;&#20123;&#24037;&#20316;&#12290;&#20182;&#21487;&#20197;&#34920;&#38706;&#23458;&#25143;&#30340;&#36523;&#20221;&#65292;&#20063;&#21487;&#20197;&#19981;&#34920;&#38706;&#65292;&#20294;&#26159;&#26080;&#35770;&#24590;&#26679;&#65292;&#20182;&#27809;&#26377;&#35814;&#36848;&#21512;&#21516;&#12290;&#20182;&#20851;&#20110;&#27492;&#20107;&#30340;&#22791;&#27880;&#21482;&#26159;&#19968;&#20010;&#23545;&#20110;&#22914;&#20309;&#23436;&#25104;&#24037;&#20316;&#30340;&#21478;&#31867;&#25216;&#26415;&#35752;&#35770;&#30340;&#20462;&#39280;&#12290;</p><p>&#37027;&#20010;&#20363;&#23376;&#20063;&#23637;&#31034;&#20102;&#24320;&#25918;&#25215;&#21253;&#21512;&#21516;&#24102;&#26469;&#30410;&#22788;&#30340;&#21478;&#19968;&#20010;&#21407;&#22240;&#12290;&#20250;&#26377;&#22810;&#20010;&#32452;&#32455;&#20026;&#24320;&#28304;&#39033;&#30446;&#36164;&#21161;&#25215;&#21253;&#65292;&#22914;&#26524;&#20182;&#20204;&#37117;&#30693;&#36947;&#20854;&#20182;&#20154;&#30340;&#30446;&#26631;&#65292;&#20182;&#20204;&#21487;&#20197;&#26356;&#22909;&#30340;&#35843;&#37197;&#36164;&#28304;&#12290;&#22312;&#19978;&#38754;&#30340;&#20363;&#23376;&#20013;&#65292;&#39033;&#30446;&#26368;&#22823;&#30340;&#21019;&#24314;&#32773;&#65288;CollabNet&#65289;&#27809;&#26377;&#20197;&#20219;&#20309;&#26041;&#24335;&#21442;&#19982;&#36825;&#31181;&#35745;&#20214;&#25215;&#21253;&#65292;&#20294;&#26159;&#24403;&#30693;&#36947;&#26377;&#20154;&#20026;&#26576;&#20123;bug&#20462;&#27491;&#25552;&#20379;&#36164;&#21161;&#26102;&#65292;CollabNet&#20415;&#23558;&#20854;&#36164;&#28304;&#36716;&#21521;&#21040;&#20102;&#20854;&#20182;bug&#19978;&#65292;&#20174;&#25972;&#20307;&#19978;&#22823;&#22823;&#25552;&#39640;&#20102;&#39033;&#30446;&#30340;&#25928;&#29575;&#12290;</p><p>&#20854;&#20182;&#24320;&#21457;&#32773;&#20250;&#24974;&#24680;&#36825;&#20123;&#22240;&#20026;&#34218;&#27700;&#32780;&#20026;&#39033;&#30446;&#24037;&#20316;&#30340;&#20154;&#21527;&#65311;&#36890;&#24120;&#24773;&#20917;&#19979;&#19981;&#20250;&#65292;&#36825;&#20123;&#24471;&#21040;&#25903;&#20184;&#30340;&#20154;&#37117;&#26159;&#31038;&#21306;&#20540;&#30340;&#23562;&#25964;&#30340;&#25104;&#21592;&#12290;&#27809;&#26377;&#20154;&#20250;&#26399;&#24453;&#25215;&#21253;&#24037;&#20316;&#20250;&#20844;&#24179;&#30340;&#20998;&#21457;&#32473;&#25152;&#26377;&#30340;&#25552;&#20132;&#32773;&#12290;&#20154;&#20204;&#29702;&#35299;&#38271;&#26399;&#20851;&#31995;&#30340;&#37325;&#35201;&#24615;&#65306;&#20174;&#20107;&#25215;&#21253;&#30340;&#19981;&#30830;&#23450;&#24615;&#20250;&#23548;&#33268;&#19968;&#26086;&#20320;&#21457;&#29616;&#26576;&#20154;&#20540;&#30340;&#20449;&#36182;&#65292;&#20320;&#23601;&#19981;&#22826;&#20250;&#21482;&#26159;&#22240;&#20026;&#20844;&#24179;&#24615;&#32780;&#25214;&#20854;&#20182;&#20154;&#12290;&#21487;&#20197;&#36825;&#26679;&#24819;&#19968;&#19979;&#65306;&#20320;&#31532;&#19968;&#27425;&#38599;&#20323;&#26102;&#65292;&#19981;&#20250;&#26377;&#25265;&#24616;&#65292;&#22240;&#20026;&#20320;&#24517;&#39035;<span class="emphasis"><em>&#36873;&#20986;</em></span>&#26576;&#20154;&#8212;&#19981;&#33021;&#38599;&#20323;&#25152;&#26377;&#20154;&#19981;&#26159;&#20320;&#30340;&#38169;&#12290;&#27492;&#21518;&#65292;&#24403;&#20320;&#31532;&#20108;&#27425;&#38599;&#20323;&#27492;&#20154;&#26102;&#65292;&#37027;&#21482;&#26159;&#24120;&#35782;&#65306;&#20320;&#24050;&#32463;&#20102;&#35299;&#20102;&#20182;&#65292;&#19978;&#19968;&#27425;&#26159;&#25104;&#21151;&#30340;&#65292;&#20026;&#20160;&#20040;&#35201;&#25215;&#25285;&#19981;&#24517;&#35201;&#30340;&#39118;&#38505;&#65311;&#22240;&#27492;&#65292;&#21482;&#38599;&#20323;&#19968;&#20010;&#25110;&#20004;&#20010;&#20154;&#65292;&#32780;&#19981;&#26159;&#23558;&#24037;&#20316;&#20998;&#25955;&#24320;&#65292;&#36825;&#26159;&#38750;&#24120;&#33258;&#28982;&#30340;&#12290;</p><div class="sect2" title="&#35780;&#23457;&#21644;&#25509;&#21463;&#21464;&#26356;"><div class="titlepage"><div><div><h3 class="title"><a name="community-review-acceptance"></a>&#35780;&#23457;&#21644;&#25509;&#21463;&#21464;&#26356;</h3></div></div></div><p>&#31038;&#21306;&#23545;&#20110;&#25215;&#21253;&#24037;&#20316;&#30340;&#25104;&#21151;&#20063;&#38750;&#24120;&#37325;&#35201;&#12290;&#20182;&#20204;&#20026;&#36739;&#22823;&#21464;&#26356;&#25152;&#25237;&#20837;&#30340;&#35774;&#35745;&#21644;&#35780;&#23457;&#36807;&#31243;&#19981;&#33021;&#21482;&#26159;&#20107;&#21518;&#22788;&#29702;&#12290;&#19981;&#24212;&#35813;&#25226;&#23427;&#24403;&#20316;&#24037;&#20316;&#30340;&#19968;&#20010;&#37096;&#20998;&#65292;&#24182;&#19988;&#23436;&#20840;&#20132;&#32473;&#25215;&#21253;&#32773;&#12290;&#19981;&#35201;&#25226;&#31038;&#21306;&#30340;&#20180;&#32454;&#23457;&#26597;&#24403;&#20316;&#38656;&#35201;&#20811;&#26381;&#30340;&#38556;&#30861;&#8212;&#32780;&#24212;&#35813;&#25226;&#23427;&#24403;&#20316;&#19968;&#20010;&#20813;&#36153;&#30340;&#35774;&#35745;&#22996;&#21592;&#20250;&#21644;QA&#37096;&#38376;&#12290;&#21487;&#20197;&#20174;&#25915;&#20987;&#24615;&#30340;&#36861;&#36880;&#20013;&#33719;&#30410;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#24525;&#21463;&#12290;</p><div class="sect3" title="&#26696;&#20363;&#30740;&#31350;&#65306;CVS&#23494;&#30721;&#35748;&#35777;&#21327;&#35758;"><div class="titlepage"><div><div><h4 class="title"><a name="cvs-pserver"></a>&#26696;&#20363;&#30740;&#31350;&#65306;CVS&#23494;&#30721;&#35748;&#35777;&#21327;&#35758;</h4></div></div></div><p>1995&#24180;&#65292;&#20316;&#20026;&#21512;&#20249;&#20154;&#20013;&#30340;&#19968;&#20010;&#65292;&#25105;&#20026;CVS&#65288;&#24182;&#34892;&#29256;&#26412;&#31995;&#32479;&#65292;&#35265;<a class="ulink" href="http://www.cvshome.org/" target="_top">http://www.cvshome.org/</a>&#65289;&#25552;&#20379;&#25903;&#25345;&#21644;&#25913;&#36827;&#12290;&#25105;&#30340;&#25645;&#26723;Jim&#21644;&#25105;&#65292;&#24403;&#26102;&#22312;&#38750;&#27491;&#24335;&#30340;&#32500;&#25252;&#30528;CVS&#12290;&#20294;&#26159;&#25105;&#20204;&#27809;&#26377;&#20180;&#32454;&#32771;&#34385;&#22914;&#20309;&#19982;&#24050;&#26377;&#30340;&#65292;&#20027;&#35201;&#26159;&#24535;&#24895;&#32773;&#30340;CVS&#24320;&#21457;&#31038;&#21306;&#22788;&#29702;&#20851;&#31995;&#12290;&#25105;&#20204;&#21482;&#26159;&#20551;&#23450;&#20182;&#20204;&#20250;&#21457;&#36865;&#34917;&#19969;&#65292;&#25105;&#20204;&#20250;&#24212;&#29992;&#34917;&#19969;&#65292;&#37027;&#26679;&#23601;&#20250;&#19968;&#20999;&#27491;&#24120;&#12290;</p><p>&#37027;&#26102;&#65292;&#32593;&#32476;&#21270;&#30340;CVS&#36824;&#21482;&#33021;&#36890;&#36807;&#22914;<code class="literal">rsh</code>&#30340;&#36828;&#31243;&#30331;&#24405;&#31243;&#24207;&#23436;&#25104;&#12290;&#22312;CVS&#35775;&#38382;&#26102;&#20351;&#29992;&#19982;&#30331;&#24405;&#30456;&#21516;&#30340;&#23494;&#30721;&#26174;&#28982;&#23384;&#22312;&#23433;&#20840;&#39118;&#38505;&#65292;&#35768;&#22810;&#32452;&#32455;&#22240;&#27492;&#32780;&#25918;&#24323;&#12290;&#19968;&#20010;&#20027;&#35201;&#30340;&#25237;&#36164;&#38134;&#34892;&#38599;&#20323;&#25105;&#20204;&#26469;&#28155;&#21152;&#19968;&#20010;&#35748;&#35777;&#26426;&#21046;&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#21487;&#20197;&#20351;&#29992;&#32593;&#32476;CVS&#23433;&#20840;&#30340;&#36830;&#25509;&#36828;&#31243;&#21150;&#20844;&#23460;&#12290;</p><p>Jim&#21644;&#25105;&#24471;&#21040;&#36825;&#20010;&#22865;&#32422;&#24182;&#22352;&#19979;&#26469;&#35774;&#35745;&#26032;&#30340;&#35748;&#35777;&#31995;&#32479;&#12290;&#25105;&#20204;&#38754;&#20020;&#30340;&#38382;&#39064;&#38750;&#24120;&#31616;&#21333;&#65288;&#24403;&#26102;&#32654;&#22269;&#23545;&#20110;&#21152;&#23494;&#31639;&#27861;&#20195;&#30721;&#26377;&#20986;&#21475;&#25511;&#21046;&#65292;&#25152;&#20197;&#23458;&#25143;&#30693;&#36947;&#25105;&#20204;&#26080;&#27861;&#23454;&#29616;&#36739;&#24378;&#30340;&#21152;&#23494;&#65289;&#65292;&#20294;&#26159;&#22240;&#20026;&#25105;&#20204;&#27809;&#26377;&#35774;&#35745;&#36825;&#31181;&#21327;&#35758;&#30340;&#32463;&#39564;&#65292;&#25105;&#20204;&#36824;&#26159;&#20316;&#20986;&#20102;&#35768;&#22810;&#23545;&#20110;&#19987;&#23478;&#26469;&#35828;&#38750;&#24120;&#26126;&#26174;&#30340;&#38169;&#35823;&#12290;&#22914;&#26524;&#25105;&#20204;&#33021;&#22815;&#33457;&#26102;&#38388;&#20889;&#19979;&#25552;&#35758;&#24182;&#20132;&#32473;&#20854;&#20182;&#24320;&#21457;&#32773;&#35780;&#23457;&#65292;&#36825;&#20123;&#38169;&#35823;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#34987;&#21457;&#29616;&#12290;&#20294;&#26159;&#25105;&#20204;&#27809;&#26377;&#36825;&#26679;&#20570;&#65292;&#22240;&#20026;&#25105;&#20204;&#24403;&#26102;&#27809;&#26377;&#25226;&#24320;&#21457;&#21015;&#34920;&#24403;&#20316;&#21487;&#20197;&#21033;&#29992;&#30340;&#36164;&#28304;&#12290;&#25105;&#20204;&#35748;&#20026;&#20154;&#20204;&#23558;&#20250;&#25509;&#21463;&#25152;&#26377;&#25105;&#20204;&#25552;&#20132;&#30340;&#19996;&#35199;&#65292;&#32780;&#19988;&#8212;&#22240;&#20026;&#25105;&#20204;&#19981;&#30693;&#36947;&#25105;&#20204;&#25152;&#19981;&#30693;&#36947;&#30340;&#8212;&#25105;&#20204;&#19981;&#24895;&#24847;&#22312;&#20247;&#30446;&#30589;&#30589;&#20043;&#19979;&#24037;&#20316;&#65292;&#20363;&#22914;&#39057;&#32321;&#21457;&#24067;&#34917;&#19969;&#65292;&#22312;&#19968;&#20010;&#29305;&#27530;&#30340;&#20998;&#25903;&#20316;&#20986;&#36739;&#23567;&#12289;&#31616;&#21333;&#21644;&#26131;&#28040;&#21270;&#30340;&#25552;&#20132;&#31561;&#31561;&#12290;&#26368;&#21518;&#30340;&#35748;&#35777;&#21327;&#35758;&#24182;&#19981;&#26159;&#24456;&#22909;&#65292;&#24403;&#28982;&#65292;&#19968;&#26086;&#24314;&#31435;&#36215;&#26469;&#65292;&#23601;&#24456;&#38590;&#22312;&#25913;&#36827;&#20102;&#65292;&#22240;&#20026;&#20860;&#23481;&#24615;&#30340;&#32771;&#34385;&#12290;</p><p>&#38382;&#39064;&#30340;&#26681;&#28304;&#26159;&#32570;&#20047;&#32463;&#39564;&#65292;&#25105;&#20204;&#21487;&#20197;&#36731;&#26131;&#30340;&#35748;&#35782;&#21040;&#25105;&#20204;&#38656;&#35201;&#30340;&#30693;&#35782;&#12290;&#38382;&#39064;&#26159;&#25105;&#20204;&#23545;&#24535;&#24895;&#32773;&#24320;&#21457;&#31038;&#21306;&#30340;&#24577;&#24230;&#12290;&#25105;&#20204;&#23558;&#23545;&#21464;&#26356;&#30340;&#25509;&#21463;&#24403;&#25104;&#20102;&#36328;&#36234;&#38556;&#30861;&#65292;&#32780;&#19981;&#26159;&#21464;&#26356;&#21487;&#20197;&#34987;&#25913;&#36827;&#30340;&#19968;&#20010;&#36807;&#31243;&#12290;&#22240;&#20026;&#25105;&#20204;&#24456;&#33258;&#20449;&#25105;&#20204;&#25152;&#20570;&#30340;&#20219;&#20309;&#20107;&#24773;&#37117;&#20960;&#20046;&#20250;&#34987;&#25509;&#21463;&#65288;&#20107;&#23454;&#20063;&#26159;&#22914;&#27492;&#65289;&#65292;&#25152;&#20197;&#25918;&#24323;&#20102;&#35753;&#20854;&#20182;&#20154;&#21442;&#19982;&#30340;&#21162;&#21147;&#12290;</p></div><p>&#24456;&#26126;&#26174;&#65292;&#24403;&#20320;&#36873;&#20102;&#19968;&#20010;&#25215;&#21253;&#32773;&#65292;&#20320;&#19968;&#23450;&#24076;&#26395;&#20182;&#25317;&#26377;&#27492;&#24037;&#20316;&#30340;&#27491;&#30830;&#25216;&#26415;&#25216;&#33021;&#21644;&#32463;&#39564;&#12290;&#20294;&#26159;&#65292;&#21516;&#26679;&#37325;&#35201;&#30340;&#26159;&#35201;&#36873;&#25321;&#19968;&#20010;&#25317;&#26377;&#19982;&#31038;&#21306;&#20854;&#20182;&#24320;&#21457;&#32773;&#26377;&#24314;&#35774;&#24615;&#20132;&#27969;&#21382;&#21490;&#30340;&#20154;&#12290;&#20320;&#24471;&#21040;&#30340;&#19981;&#20165;&#20165;&#26159;&#19968;&#20010;&#20154;&#65292;&#20063;&#26159;&#19968;&#20010;&#20195;&#29702;&#20154;&#65292;&#20182;&#23558;&#20250;&#26500;&#24314;&#19968;&#22871;&#19987;&#19994;&#25216;&#33021;&#32593;&#32476;&#20197;&#30830;&#20445;&#20182;&#26159;&#20197;&#20581;&#22766;&#21644;&#21487;&#32500;&#25252;&#30340;&#26041;&#24335;&#23436;&#25104;&#30340;&#24037;&#20316;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="money-vs-love.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="funding-non-programming.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;</td></tr></table></div></body></html>
