<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;"><link rel="prev" href="license-choosing.html" title="&#36873;&#25321;&#19968;&#20010;&#35768;&#21487;&#35777;"><link rel="next" href="dual-licensing.html" title="&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="license-choosing.html">Prev</a> </td><th width="60%" align="center">Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</th><td width="20%" align="right"> <a accesskey="n" href="dual-licensing.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="copyright-assignment"></a>&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435;</h2></div></div></div><p>&#26377;&#19977;&#31181;&#22788;&#29702;&#33258;&#30001;&#20195;&#30721;&#21644;&#25991;&#26723;&#29256;&#26435;&#25152;&#26377;&#26435;&#30340;&#26041;&#27861;&#65292;&#35768;&#22810;&#20154;&#20026;&#27492;&#20570;&#20986;&#20102;&#36129;&#29486;&#12290;&#31532;&#19968;&#31181;&#26159;&#23436;&#20840;&#26080;&#35270;&#29256;&#26435;&#30340;&#38382;&#39064;&#65288;&#25105;&#19981;&#24314;&#35758;&#22914;&#27492;&#65289;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#26159;&#20174;&#39033;&#30446;&#20013;&#24037;&#20316;&#30340;&#27599;&#20010;&#20154;&#37027;&#37324;&#25910;&#38598;&#19968;&#20010;<em class="firstterm">&#36129;&#29486;&#32773;&#35768;&#21487;&#35777;&#21327;&#35758;</em>&#65288;<em class="firstterm">CLA</em>&#65289;&#65292;&#26126;&#30830;&#39033;&#30446;&#23545;&#20351;&#29992;&#20010;&#20154;&#36129;&#29486;&#30340;&#26435;&#21033;&#12290;&#36825;&#36890;&#24120;&#23545;&#22823;&#22810;&#25968;&#39033;&#30446;&#24050;&#32463;&#36275;&#22815;&#20102;&#65292;&#26356;&#22909;&#30340;&#26159;&#22312;&#19968;&#20123;&#21496;&#27861;&#26435;&#20013;&#65292;CLA&#26159;&#21487;&#20197;&#36890;&#36807;email&#21457;&#36865;&#30340;&#12290;&#31532;&#19977;&#31181;&#26041;&#27861;&#26159;&#20174;&#36129;&#29486;&#32773;&#37027;&#37324;&#33719;&#24471;&#30495;&#27491;&#30340;&#29256;&#26435;&#21327;&#35758;&#65292;&#36825;&#26679;&#39033;&#30446;&#65288;&#20363;&#22914;&#19968;&#20123;&#27861;&#24459;&#23454;&#20307;&#65292;&#36890;&#24120;&#26159;&#38750;&#30408;&#21033;&#65289;&#23601;&#26159;&#25152;&#26377;&#19996;&#35199;&#30340;&#29256;&#26435;&#25152;&#26377;&#32773;&#12290;&#36825;&#36890;&#24120;&#26159;&#26080;&#25032;&#21487;&#20987;&#30340;&#26041;&#27861;&#65292;&#20294;&#20063;&#26159;&#36129;&#29486;&#32773;&#30340;&#36127;&#25285;&#65307;&#21482;&#26377;&#23569;&#25968;&#39033;&#30446;&#22362;&#25345;&#22914;&#27492;&#12290;</p><p>&#35831;&#27880;&#24847;&#65292;&#21363;&#20351;&#22312;&#38598;&#20013;&#24335;&#30340;&#29256;&#26435;&#25152;&#26377;&#26435;&#26102;&#65292;&#20195;&#30721;<sup>[<a name="idp3157" href="#ftn.idp3157" class="footnote">30</a>]</sup>&#36824;&#26159;&#33258;&#30001;&#30340;&#65292;&#22240;&#20026;&#24320;&#28304;&#35768;&#21487;&#35777;&#24182;&#27809;&#26377;&#32473;&#29256;&#26435;&#25345;&#26377;&#32773;&#21487;&#20197;&#23558;&#25152;&#26377;&#20195;&#30721;&#30340;&#25335;&#36125;&#25910;&#22238;&#25152;&#26377;&#30340;&#26435;&#21033;&#12290;&#25152;&#20197;&#21363;&#20351;&#20316;&#20026;&#27861;&#24459;&#23454;&#20307;&#30340;&#39033;&#30446;&#31361;&#28982;&#36716;&#21521;&#24320;&#22987;&#23558;&#25152;&#26377;&#30340;&#20195;&#30721;&#20351;&#29992;&#38480;&#21046;&#35768;&#21487;&#35777;&#21457;&#24067;&#65292;&#20063;&#19981;&#20250;&#32473;&#20844;&#20849;&#31038;&#21306;&#24102;&#26469;&#20160;&#20040;&#38382;&#39064;&#12290;&#20854;&#20182;&#24320;&#21457;&#32773;&#21487;&#20197;&#31616;&#21333;&#30340;&#26681;&#25454;&#26368;&#26032;&#30340;&#20195;&#30721;&#25335;&#36125;&#24320;&#22987;&#19968;&#20010;&#20998;&#21449;&#65292;&#24182;&#24403;&#20316;&#27809;&#21457;&#29983;&#20219;&#20309;&#20107;&#24773;&#19968;&#26679;&#32487;&#32493;&#12290;&#22240;&#20026;&#20182;&#20204;&#30693;&#36947;&#20182;&#20204;&#21487;&#20197;&#36825;&#26679;&#20570;&#65292;&#22823;&#22810;&#25968;&#34987;&#38382;&#21450;&#31614;&#32626;CLA&#25110;&#29256;&#26435;&#21327;&#35758;&#26102;&#20250;&#38750;&#24120;&#21512;&#20316;&#12290;</p><div class="sect2" title="&#26080;&#20026;&#32780;&#27835;"><div class="titlepage"><div><div><h3 class="title"><a name="copyright-assignment-none"></a>&#26080;&#20026;&#32780;&#27835;</h3></div></div></div><p>&#22823;&#22810;&#25968;&#39033;&#30446;&#20174;&#26469;&#27809;&#26377;&#20174;&#20182;&#20204;&#30340;&#36129;&#29486;&#32773;&#37027;&#37324;&#25910;&#38598;&#36807;CLA&#25110;&#29256;&#26435;&#21327;&#35758;&#12290;&#30456;&#21453;&#65292;&#21482;&#35201;&#20195;&#30721;&#26159;&#21512;&#29702;&#28165;&#38500;&#65292;&#32780;&#19988;&#36129;&#29486;&#32773;&#24895;&#24847;&#23558;&#20854;&#32452;&#21512;&#36827;&#39033;&#30446;&#65292;&#20182;&#20204;&#23601;&#20250;&#25509;&#21463;&#20195;&#30721;&#12290;</p><p>&#22312;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#26159;&#27491;&#24120;&#30340;&#12290;&#20294;&#26159;&#20598;&#23572;&#20250;&#26377;&#20154;&#20915;&#23450;&#22240;&#29256;&#26435;&#20405;&#23475;&#32780;&#35785;&#35772;&#65292;&#22768;&#31216;&#20182;&#20204;&#26159;&#38382;&#39064;&#20195;&#30721;&#30340;&#25152;&#26377;&#32773;&#65292;&#32780;&#19988;&#20182;&#20204;&#20174;&#27809;&#26377;&#21516;&#24847;&#36825;&#20123;&#20195;&#30721;&#30001;&#39033;&#30446;&#20351;&#29992;&#24320;&#28304;&#35768;&#21487;&#35777;&#20998;&#21457;&#12290;&#20363;&#22914;&#65292;SCO&#22242;&#38431;&#21521;Linux&#22242;&#38431;&#36825;&#26679;&#20570;&#30340;&#65292;&#32454;&#33410;&#35265;<a class="ulink" href="http://en.wikipedia.org/wiki/SCO-Linux_controversies" target="_top">http://en.wikipedia.org/wiki/SCO-Linux_controversies</a>&#12290;&#24403;&#36825;&#20123;&#21457;&#29983;&#26102;&#65292;&#39033;&#30446;&#27809;&#26377;&#25991;&#26723;&#35828;&#26126;&#36129;&#29486;&#32773;&#27491;&#24335;&#30340;&#36171;&#20104;&#20351;&#29992;&#36825;&#20123;&#20195;&#30721;&#30340;&#26435;&#21033;&#65292;&#21487;&#33021;&#20250;&#23548;&#33268;&#19968;&#20123;&#27861;&#24459;&#36777;&#25252;&#12290;</p></div><div class="sect2" title="&#36129;&#29486;&#32773;&#35768;&#21487;&#35777;&#21327;&#35758;"><div class="titlepage"><div><div><h3 class="title"><a name="copyright-assignment-cla"></a>&#36129;&#29486;&#32773;&#35768;&#21487;&#35777;&#21327;&#35758;</h3></div></div></div><p>CLA&#21487;&#33021;&#26159;&#22312;&#23433;&#20840;&#24615;&#21644;&#20415;&#21033;&#24615;&#20043;&#38388;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#25240;&#34935;&#12290;&#19968;&#20010;CLA&#36890;&#24120;&#26159;&#19968;&#20010;&#21457;&#36865;&#32473;&#24320;&#21457;&#32773;&#22635;&#20889;&#24182;&#21457;&#22238;&#39033;&#30446;&#30340;&#30005;&#23376;&#34920;&#26684;&#12290;&#22312;&#22823;&#22810;&#25968;&#21496;&#27861;&#20013;&#65292;&#37038;&#20214;&#25552;&#20132;&#24050;&#32463;&#36275;&#22815;&#12290;&#25110;&#35768;&#38656;&#35201;&#23433;&#20840;&#30005;&#23376;&#31614;&#21517;&#65307;&#21487;&#20197;&#21672;&#35810;&#24459;&#24072;&#25214;&#20986;&#23545;&#20320;&#30340;&#39033;&#30446;&#26368;&#21512;&#36866;&#30340;&#26041;&#27861;&#12290;</p><p>&#22823;&#22810;&#25968;&#39033;&#30446;&#20351;&#29992;&#20004;&#20010;&#20123;&#35768;&#19981;&#21516;&#30340;CLA&#65292;&#19968;&#20010;&#38024;&#23545;&#20010;&#20154;&#65292;&#19968;&#20010;&#38024;&#23545;&#20844;&#21496;&#36129;&#29486;&#32773;&#12290;&#20294;&#26159;&#22312;&#20004;&#31181;&#31867;&#22411;&#20013;&#65292;&#26680;&#24515;&#30340;&#35821;&#35328;&#26159;&#30456;&#21516;&#30340;&#65306;&#36129;&#29486;&#32773;&#36171;&#20104;&#39033;&#30446;<span class="emphasis"><em>"...&#27704;&#20037;&#30340;&#12289;&#20840;&#19990;&#30028;&#30340;&#12289;&#38750;&#29420;&#21344;&#30340;&#12289;&#20813;&#36153;&#30340;&#12289;&#29305;&#35768;&#33258;&#26377;&#12289;&#19981;&#33021;&#21462;&#28040;&#30340;&#29256;&#26435;&#35768;&#21487;&#35777;&#65292;&#21487;&#20197;&#29992;&#20110;&#37325;&#26032;&#21046;&#20316;&#12289;&#20934;&#22791;&#34893;&#29983;&#20316;&#21697;&#12289;&#20844;&#24320;&#26174;&#31034;&#12289;&#20844;&#24320;&#25805;&#20316;&#12289;&#21457;&#25918;&#20174;&#23646;&#35777;&#20070;&#21644;&#20998;&#21457;&#36825;&#20123;&#36129;&#29486;&#21644;&#27492;&#31867;&#34893;&#29983;&#20316;&#21697;&#12290;"</em></span>&#20877;&#27425;&#24378;&#35843;&#65292;&#20320;&#24212;&#24403;&#26377;&#19968;&#20010;&#24459;&#24072;&#30830;&#35748;CLA&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#33021;&#20102;&#35299;&#25152;&#26377;&#36825;&#20123;&#31243;&#24207;&#65292;&#37027;&#26679;&#20250;&#24456;&#22909;&#12290;</p><p>&#24403;&#20320;&#20174;&#36129;&#29486;&#32773;&#37027;&#37324;&#35831;&#27714;CLA&#26102;&#65292;&#35831;&#30830;&#35748;&#24378;&#35843;&#20320;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#35201;&#27714;&#30495;&#27491;&#30340;&#29256;&#26435;&#25480;&#20104;&#12290;&#23454;&#38469;&#19978;&#65292;&#35768;&#22810;CLA&#20351;&#29992;&#36825;&#20123;&#35821;&#21477;&#26469;&#25552;&#37266;&#35835;&#32773;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#36825;&#20165;&#20165;&#26159;&#19968;&#20010;&#35768;&#21487;&#35777;&#21327;&#35758;&#65307;&#23427;&#19981;&#20250;&#36716;&#31227;&#29256;&#26435;&#25152;&#26377;&#26435;&#65292;&#20063;&#19981;&#20250;&#25913;&#21464;&#22240;&#20219;&#20309;&#30446;&#30340;&#20351;&#29992;&#33258;&#24049;&#36129;&#29486;&#30340;&#26435;&#21033;&#12290;</em></span></p></blockquote></div><p>&#19979;&#38754;&#26159;&#19968;&#20123;&#20363;&#23376;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#20010;&#20154;&#36129;&#29486;&#32773;CLA&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="circle"><li class="listitem"><p><a class="ulink" href="http://apache.org/licenses/icla.txt" target="_top">http://apache.org/licenses/icla.txt</a>
      </p></li><li class="listitem"><p><a class="ulink" href="http://code.google.com/legal/individual-cla-v1.0.html" target="_top">http://code.google.com/legal/individual-cla-v1.0.html</a>
      </p></li></ul></div></li><li class="listitem"><p>&#20844;&#21496;&#36129;&#29486;&#32773;CLA&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="circle"><li class="listitem"><p><a class="ulink" href="http://apache.org/licenses/cla-corporate.txt" target="_top">http://apache.org/licenses/cla-corporate.txt</a>
      </p></li><li class="listitem"><p><a class="ulink" href="http://code.google.com/legal/corporate-cla-v1.0.html" target="_top">http://code.google.com/legal/corporate-cla-v1.0.html</a>
      </p></li></ul></div></li></ul></div></div><div class="sect2" title="&#29256;&#26435;&#36716;&#31227;"><div class="titlepage"><div><div><h3 class="title"><a name="copyright-assignment-transfer"></a>&#29256;&#26435;&#36716;&#31227;</h3></div></div></div><p>&#29256;&#26435;&#36716;&#31227;&#30340;&#21547;&#20041;&#26159;&#36129;&#29486;&#32773;&#23558;&#33258;&#24049;&#30340;&#36129;&#29486;&#36171;&#20104;&#32473;&#39033;&#30446;&#29256;&#26435;&#25152;&#26377;&#26435;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#38656;&#35201;&#20070;&#38754;&#23436;&#25104;&#24182;&#20256;&#30495;&#25110;&#37038;&#23492;&#32473;&#39033;&#30446;&#12290;</p><p>&#19968;&#20123;&#39033;&#30446;&#22362;&#25345;&#23436;&#20840;&#30340;&#21327;&#35758;&#65292;&#22240;&#20026;&#22914;&#26524;&#24320;&#28304;&#35768;&#21487;&#35777;&#30340;&#26465;&#27454;&#38656;&#35201;&#24378;&#21046;&#26102;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#27861;&#24459;&#23454;&#20307;&#25317;&#26377;&#25972;&#20010;&#20195;&#30721;&#22522;&#30340;&#29256;&#26435;&#20250;&#38750;&#24120;&#26377;&#29992;&#12290;&#22914;&#26524;&#27809;&#26377;&#21333;&#20010;&#23454;&#20307;&#26377;&#36825;&#26679;&#30340;&#26435;&#21033;&#65292;&#25152;&#26377;&#36129;&#29486;&#32773;&#38656;&#35201;&#21512;&#20316;&#65292;&#20294;&#38382;&#39064;&#21457;&#29983;&#26102;&#21487;&#33021;&#26576;&#20154;&#27809;&#26377;&#26102;&#38388;&#25110;&#26080;&#27861;&#25214;&#21040;&#12290;</p><p>&#19981;&#21516;&#30340;&#32452;&#32455;&#23545;&#20110;&#25910;&#38598;&#25480;&#26435;&#30340;&#20005;&#33499;&#31243;&#24230;&#19981;&#21516;&#12290;&#26377;&#19968;&#20123;&#20165;&#20165;&#26159;&#26576;&#20010;&#36129;&#29486;&#32773;&#22312;&#20844;&#20849;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#31616;&#21333;&#38750;&#27491;&#24335;&#38472;&#36848;&#8212;&#31867;&#20284;&#8220;&#25105;&#36825;&#37324;&#23558;&#25105;&#30340;&#22312;&#35813;&#39033;&#30446;&#30340;&#20195;&#30721;&#25480;&#26435;&#65292;&#20351;&#29992;&#20854;&#20313;&#20195;&#30721;&#30456;&#21516;&#30340;&#35768;&#21487;&#35777;&#26465;&#27454;&#12290; &#8221;&#33267;&#23569;&#26377;&#19968;&#20010;&#25105;&#20132;&#27969;&#36807;&#30340;&#24459;&#24072;&#35748;&#20026;&#36825;&#26679;&#24050;&#32463;&#36275;&#22815;&#65292;&#22823;&#20307;&#25512;&#27979;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#23427;&#21457;&#29983;&#22312;&#19968;&#20010;&#29256;&#26435;&#25480;&#26435;&#24050;&#32463;&#38750;&#24120;&#26222;&#36890;&#21644;&#39044;&#26399;&#30340;&#26041;&#24335;&#65292;&#32780;&#19988;&#22240;&#20026;&#23427;&#20195;&#34920;&#20102;&#39033;&#30446;&#19968;&#26041;&#23545;&#20110;&#30830;&#20445;&#24320;&#21457;&#32773;&#30495;&#27491;&#24847;&#22270;&#30340;<span class="foreignphrase"><em class="foreignphrase">&#35802;&#24847;</em></span>&#21162;&#21147;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#21017;&#36827;&#20837;&#23545;&#31435;&#30340;&#26497;&#31471;&#65306;&#20182;&#20204;&#35201;&#27714;&#36129;&#29486;&#32773;&#29289;&#29702;&#19978;&#31614;&#32626;&#24182;&#37038;&#23492;&#19968;&#20221;&#25991;&#20214;&#65292;&#21253;&#21547;&#29256;&#26435;&#25480;&#26435;&#30340;&#27491;&#24335;&#25551;&#36848;&#65292;&#26377;&#26102;&#20165;&#38024;&#23545;&#19968;&#20221;&#36129;&#29486;&#65292;&#26377;&#26102;&#38024;&#23545;&#24403;&#21069;&#21644;&#26410;&#26469;&#30340;&#36129;&#29486;&#12290;&#22914;&#26524;&#24320;&#21457;&#32773;&#34987;&#38599;&#20323;&#65292;FSF&#20063;&#20250;&#35201;&#27714;&#38599;&#21592;&#31614;&#32626;&#36825;&#20010;&#19996;&#35199;&#12290;</p><p>FSF&#30340;&#20559;&#25191;&#29378;&#21487;&#29702;&#35299;&#30340;&#12290;&#22914;&#26524;&#26576;&#20154;&#36829;&#21453;&#20102;GPL&#20851;&#20110;&#23558;&#20182;&#20204;&#30340;&#36719;&#20214;&#32452;&#21512;&#21040;&#31169;&#26377;&#31243;&#24207;&#30340;&#26465;&#27454;&#65292;FSF&#20250;&#38656;&#35201;&#19982;&#20043;&#22312;&#27861;&#24237;&#19978;&#26007;&#20105;&#65292;&#20182;&#20204;&#24076;&#26395;&#20182;&#20204;&#30340;&#29256;&#26435;&#22312;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#26102;&#21487;&#20197;&#26080;&#25032;&#21487;&#20987;&#12290;&#22240;&#20026;FSF&#26159;&#35768;&#22810;&#27969;&#34892;&#36719;&#20214;&#30340;&#25345;&#26377;&#32773;&#65292;&#20182;&#20204;&#35748;&#20026;&#36825;&#26159;&#30495;&#23454;&#21487;&#33021;&#30340;&#12290;&#26080;&#35770;&#20320;&#30340;&#32452;&#32455;&#26159;&#21542;&#26377;&#21482;&#26377;&#20320;&#25152;&#20915;&#23450;&#30340;&#38656;&#35201;&#31867;&#20284;&#30340;&#23567;&#24515;&#35880;&#24910;&#65292;&#35831;&#21672;&#35810;&#24459;&#24072;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#38500;&#38750;&#19968;&#20123;&#29305;&#21035;&#30340;&#21407;&#22240;&#38656;&#35201;&#20320;&#30340;&#39033;&#30446;&#25317;&#26377;&#23436;&#20840;&#30340;&#29256;&#26435;&#25480;&#26435;&#65292;&#20320;&#21487;&#20197;&#30452;&#25509;&#37319;&#29992;CLA&#65307;&#20182;&#20204;&#23545;&#27599;&#20010;&#20154;&#37117;&#24456;&#31616;&#21333;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3157" href="#idp3157" class="para">30</a>] </sup>&#20043;&#21518;&#25105;&#20351;&#29992;&#30340;&#8220;&#20195;&#30721;&#8221;&#25351;&#30340;&#26159;&#20195;&#30721;&#21644;&#25991;&#26723;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="license-choosing.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="dual-licensing.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36873;&#25321;&#19968;&#20010;&#35768;&#21487;&#35777; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#21452;&#35768;&#21487;&#35777;&#27169;&#24335;</td></tr></table></div></body></html>
