<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#33635;&#35465;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><link rel="prev" href="committers.html" title="&#25552;&#20132;&#32773;"><link rel="next" href="forks.html" title="&#20998;&#21449;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#33635;&#35465;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="committers.html">Prev</a> </td><th width="60%" align="center">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</th><td width="20%" align="right"> <a accesskey="n" href="forks.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#33635;&#35465;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="credit"></a>&#33635;&#35465;</h2></div></div></div><p>&#33635;&#35465;&#26159;&#33258;&#30001;&#36719;&#20214;&#19990;&#30028;&#30340;&#20027;&#35201;&#36135;&#24065;&#12290;&#26080;&#35770;&#20154;&#20204;&#24590;&#26679;&#35828;&#20182;&#21442;&#19982;&#39033;&#30446;&#30340;&#21160;&#26426;&#65292;&#25105;&#19981;&#30693;&#36947;&#26377;&#21738;&#20010;&#24320;&#21457;&#32773;&#20250;&#20048;&#20110;&#21311;&#21517;&#65292;&#25110;&#20197;&#20854;&#20182;&#20154;&#30340;&#21517;&#20041;&#30340;&#20570;&#36825;&#20123;&#20107;&#12290;&#26377;&#19968;&#20123;&#26377;&#24418;&#30340;&#21407;&#22240;&#65306;&#19968;&#20010;&#20154;&#22312;&#19968;&#20010;&#39033;&#30446;&#30340;&#21517;&#22768;&#22823;&#20307;&#19978;&#20915;&#23450;&#20102;&#20182;&#30340;&#24433;&#21709;&#21147;&#65292;&#21442;&#19982;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#20063;&#20250;&#38388;&#25509;&#30340;&#24102;&#26469;&#37329;&#38065;&#65292;&#22240;&#20026;&#26576;&#20123;&#38599;&#20027;&#24076;&#26395;&#23547;&#25214;&#31616;&#21382;&#12290;&#20063;&#26377;&#19968;&#20123;&#26080;&#24418;&#30340;&#21407;&#22240;&#65292;&#25110;&#35768;&#26356;&#21152;&#24378;&#22823;&#65306;&#20154;&#20204;&#21482;&#24076;&#26395;&#34987;&#36175;&#35782;&#65292;&#26412;&#33021;&#30340;&#23547;&#25214;&#34987;&#21035;&#20154;&#35782;&#21035;&#30340;&#26631;&#24535;&#12290;&#33635;&#35465;&#30340;&#24076;&#26395;&#26159;&#39033;&#30446;&#19968;&#20010;&#26368;&#37325;&#35201;&#30340;&#21160;&#26426;&#12290;&#24403;&#23567;&#30340;&#36129;&#29486;&#34987;&#35748;&#21487;&#65292;&#20154;&#20204;&#20250;&#36820;&#22238;&#20316;&#20986;&#26356;&#22810;&#12290;</p><p>&#21327;&#20316;&#24320;&#21457;&#36719;&#20214;&#30340;&#19968;&#39033;&#37325;&#35201;&#29305;&#24615;&#26159;&#65288;&#35265;<a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#65289;&#20445;&#25345;&#20309;&#20154;&#20309;&#26102;&#20570;&#20102;&#20309;&#20107;&#30340;&#31934;&#30830;&#35760;&#24405;&#12290;&#22914;&#26524;&#23384;&#22312;&#65292;&#35831;&#23613;&#21487;&#33021;&#20351;&#29992;&#29616;&#26377;&#30340;&#26426;&#21046;&#30830;&#20445;&#33635;&#35465;&#31934;&#30830;&#30340;&#20998;&#37197;&#65292;&#35201;&#26681;&#25454;&#36129;&#29486;&#30340;&#26412;&#24615;&#29305;&#21035;&#22788;&#29702;&#12290;&#19981;&#35201;&#20165;&#20165;&#20889;&#19979;"&#24863;&#35874;J. Random &lt;jrandom@example.com&gt;"&#65292;&#20316;&#20026;&#26367;&#20195;&#21487;&#20197;&#22312;&#26085;&#24535;&#20449;&#24687;&#20013;&#20889;&#20026;"&#24863;&#35874;J. Random jrandom@example.com&gt;&#30340;bug&#25253;&#21578;&#20197;&#21450;&#23545;&#20110;&#37325;&#29616;bug&#30340;&#25551;&#36848;"&#12290;</p><p>&#22312;Subversion&#20013;&#65292;&#23545;&#20110;bug&#25253;&#21578;&#32773;&#30340;&#33635;&#35465;&#65292;&#25105;&#20204;&#26377;&#19968;&#20010;&#38750;&#27491;&#24335;&#30340;&#20294;&#26159;&#19968;&#33268;&#30340;&#25919;&#31574;&#65292;&#22914;&#26524;&#26377;&#21457;&#36215;&#30340;&#38382;&#39064;&#65292;&#21017;&#22312;&#38382;&#39064;&#20013;&#35760;&#24405;&#65292;&#22914;&#26524;&#27809;&#26377;&#21457;&#36215;&#38382;&#39064;&#65292;&#21017;&#22312;&#20462;&#27491;&#35813;bug&#30340;&#25552;&#20132;&#26085;&#24535;&#20449;&#24687;&#20013;&#35760;&#24405;&#12290;&#23545;&#20110;&#25552;&#20132;&#32534;&#21495;14525&#20043;&#21069;&#30340;Subversion&#26085;&#24535;&#36827;&#34892;&#20102;&#19968;&#20010;&#24555;&#36895;&#35843;&#26597;&#65292;&#21457;&#29616;10%&#30340;&#25552;&#20132;&#21253;&#21547;&#20102;&#26576;&#20154;&#21517;&#23383;&#21644;&#37038;&#20214;&#22320;&#22336;&#30340;&#33635;&#35465;&#20449;&#24687;&#65292;&#36890;&#24120;&#26159;&#25253;&#21578;&#25110;&#20998;&#26512;&#35813;&#25552;&#20132;&#30340;bug&#20462;&#27491;&#30340;&#20154;&#12290;&#35831;&#27880;&#24847;&#65292;&#36825;&#20123;&#20154;&#19982;&#23454;&#38469;&#20316;&#20986;&#25552;&#20132;&#30340;&#24320;&#21457;&#32773;&#19981;&#21516;&#65292;&#36825;&#20123;&#24320;&#21457;&#32773;&#30340;&#21517;&#23383;&#24050;&#32463;&#33258;&#21160;&#35760;&#24405;&#21040;&#20102;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#22312;&#30446;&#21069;Subversion&#30340;80&#20301;&#23436;&#20840;&#21644;&#37096;&#20998;&#25552;&#20132;&#32773;&#20013;&#65292;&#26377;55&#20301;&#22312;&#20182;&#20204;&#25104;&#20026;&#25552;&#20132;&#32773;&#20043;&#21069;&#65292;&#26366;&#32463;&#22312;&#25552;&#20132;&#26085;&#24535;&#65288;&#36890;&#24120;&#22810;&#27425;&#65289;&#20013;&#34987;&#35760;&#24405;&#36807;&#33635;&#35465;&#12290;&#24403;&#28982;&#36825;&#24182;&#19981;&#26159;&#35828;&#65292;&#34987;&#35760;&#24405;&#33635;&#35465;&#26159;&#32487;&#32493;&#21442;&#19982;&#30340;&#19968;&#20010;&#22240;&#32032;&#65292;&#20294;&#33267;&#23569;&#32473;&#20102;&#20154;&#20204;&#30693;&#36947;&#33258;&#24049;&#30340;&#36129;&#29486;&#22914;&#20309;&#34987;&#35748;&#21487;&#30340;&#27675;&#22260;&#12290;</p><p>&#24456;&#37325;&#35201;&#30340;&#19968;&#28857;&#26159;&#21306;&#20998;&#24120;&#35268;&#30340;&#24863;&#35874;&#21644;&#29305;&#21035;&#24863;&#35874;&#12290;&#24403;&#35752;&#35770;&#29305;&#23450;&#20195;&#30721;&#29255;&#27573;&#25110;&#20854;&#23427;&#26576;&#20154;&#30340;&#36129;&#29486;&#26102;&#65292;&#26368;&#22909;&#33021;&#22815;&#24863;&#35874;&#20182;&#20204;&#30340;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#20551;&#35774;&#8220;Daniel&#26368;&#36817;&#23545;&#20110;&#22686;&#37327;&#20195;&#30721;&#30340;&#21464;&#26356;&#24847;&#21619;&#30528;&#25105;&#20204;&#29616;&#22312;&#21487;&#20197;&#23454;&#29616;&#29305;&#24615;X&#8221;&#65292;&#38656;&#35201;&#21516;&#26102;&#24110;&#21161;&#20154;&#20204;&#35782;&#21035;&#20320;&#25152;&#35848;&#35770;&#30340;&#21464;&#26356;&#24182;&#24863;&#35874;Daniel&#30340;&#24037;&#20316;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#20165;&#20165;&#21333;&#29420;&#24863;&#35874;Daniel&#23545;&#20110;&#22686;&#37327;&#20195;&#30721;&#30340;&#21464;&#26356;&#26080;&#27861;&#36798;&#21040;&#21363;&#21051;&#30340;&#23454;&#36341;&#30446;&#30340;&#12290;&#23427;&#19981;&#20250;&#22686;&#21152;&#20219;&#20309;&#20449;&#24687;&#65292;&#22240;&#20026;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21644;&#20854;&#20182;&#26426;&#21046;&#24050;&#32463;&#35760;&#24405;&#20102;&#20182;&#25152;&#20570;&#30340;&#21464;&#26356;&#12290;&#24863;&#35874;&#25152;&#26377;&#20154;&#30340;&#25152;&#26377;&#24037;&#20316;&#21017;&#20250;&#20998;&#25955;&#26368;&#32456;&#30340;&#20449;&#24687;&#65292;&#22240;&#20026;&#24863;&#35874;&#30340;&#20869;&#23481;&#26159;&#20182;&#19982;&#25152;&#26377;&#40664;&#35748;&#30340;&#12289;&#32972;&#26223;&#30340;&#35780;&#35770;&#32423;&#21035;&#30456;&#27604;&#30340;&#31361;&#20986;&#31243;&#24230;&#12290;&#24403;&#28982;&#36825;&#24182;&#19981;&#24847;&#21619;&#30528;&#20320;&#19981;&#38656;&#35201;&#24863;&#35874;&#22823;&#23478;&#12290;&#21482;&#38656;&#35201;&#30830;&#20445;&#19981;&#20250;&#38519;&#20837;&#33635;&#35465;&#36890;&#36135;&#33192;&#32960;&#12290;&#36981;&#24490;&#19979;&#38754;&#30340;&#25351;&#23548;&#20250;&#26377;&#25152;&#24110;&#21161;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#36825;&#20010;&#35770;&#22363;&#36234;&#26159;&#30701;&#26242;&#65292;&#36234;&#24212;&#35813;&#23545;&#22312;&#36825;&#37324;&#33258;&#30001;&#34920;&#36798;&#24863;&#35874;&#24863;&#21040;&#33258;&#30001;&#12290;&#20363;&#22914;&#65292; &#22312;IRC&#23545;&#35805;&#20013;&#24863;&#35874;&#26576;&#20154;&#20256;&#26469;&#30340;bug&#20462;&#27491;&#24456;&#22909;&#65292;&#22312;&#37038;&#20214;&#20013;&#26049;&#25970;&#20391;&#38544;&#20063;&#24456;&#19981;&#38169;&#12290;&#20294;&#26159;&#26368;&#22909;&#19981;&#35201;&#21333;&#29420;&#21457;&#19968;&#20010;&#24863;&#35874;&#26576;&#20154;&#30340;&#37038;&#20214;&#65292;&#38500;&#38750;&#26159;&#30495;&#30340;&#19981;&#21516;&#23547;&#24120;&#30340;&#22766;&#20030;&#12290;&#24456;&#26377;&#21487;&#33021;&#65292;&#19981;&#35201;&#22240;&#20026;&#34920;&#36798;&#24863;&#28608;&#24324;&#20081;&#39033;&#30446;&#30340;&#32593;&#39029;&#12290;&#19968;&#26086;&#20320;&#24320;&#22987;&#36825;&#26679;&#20570;&#65292;&#20415;&#20250;&#27704;&#36828;&#26080;&#27861;&#28165;&#29702;&#65292;&#20063;&#26080;&#27861;&#20572;&#27490;&#12290;&#32780;&#19988;<span class="emphasis"><em>&#32477;&#19981;&#35201;</em></span>&#23558;&#24863;&#35874;&#32622;&#20110;&#20195;&#30721;&#30340;&#27880;&#37322;&#20043;&#20013;&#65307;&#36825;&#23558;&#20250;&#20998;&#25955;&#27880;&#37322;&#20027;&#35201;&#30446;&#30340;&#30340;&#27880;&#24847;&#21147;&#65292;&#27880;&#37322;&#26412;&#26469;&#30340;&#20316;&#29992;&#26159;&#24110;&#21161;&#35835;&#32773;&#29702;&#35299;&#20195;&#30721;&#12290;</p></li><li class="listitem"><p>&#19968;&#20010;&#20154;&#21442;&#19982;&#39033;&#30446;&#36234;&#23569;&#65292;&#23601;&#26356;&#24212;&#35813;&#23545;&#22905;&#30340;&#25152;&#20316;&#25152;&#20026;&#25552;&#20986;&#24863;&#35874;&#12290;&#36825;&#20284;&#20046;&#19982;&#30452;&#35273;&#24182;&#19981;&#19968;&#33268;&#65292;&#20294;&#26159;&#34920;&#31034;&#24863;&#35874;&#30340;&#24577;&#24230;&#36866;&#29992;&#19982;&#26576;&#20154;&#20316;&#20986;&#30340;&#36129;&#29486;&#65292;&#36229;&#20986;&#20102;&#20320;&#23545;&#20182;&#30340;&#39044;&#26399;&#12290;&#22240;&#27492;&#65292;&#19968;&#30452;&#24863;&#35874;&#24120;&#35268;&#36129;&#29486;&#32773;&#30340;&#26085;&#24120;&#24037;&#20316;&#34920;&#29616;&#20102;&#23545;&#20182;&#20204;&#25152;&#20570;&#24037;&#20316;&#30340;&#36739;&#20302;&#30340;&#39044;&#26399;&#12290;&#22914;&#26524;&#35828;&#26377;&#25928;&#26524;&#65292;&#21487;&#33021;&#26159;&#21453;&#25928;&#26524;&#65281;</p><p>&#36825;&#20010;&#35268;&#21017;&#26377;&#19968;&#20123;&#20598;&#23572;&#30340;&#20363;&#22806;&#12290;&#22914;&#26524;&#24863;&#35874;&#26576;&#20154;&#23436;&#25104;&#20102;&#39044;&#26399;&#35282;&#33394;&#65292;&#32780;&#36825;&#20010;&#35282;&#33394;&#21453;&#22797;&#21253;&#21547;&#20102;&#35768;&#22810;&#20020;&#26102;&#30340;&#12289;&#32039;&#24352;&#30340;&#21162;&#21147;&#65292;&#21017;&#36825;&#26159;&#21487;&#20197;&#25509;&#21463;&#30340;&#12290;&#19968;&#20010;&#26631;&#20934;&#30340;&#20363;&#23376;&#26159;&#21457;&#24067;&#31649;&#29702;&#21592;&#65292;&#20182;&#22312;&#27599;&#27425;&#21457;&#24067;&#26102;&#37117;&#20250;&#25237;&#20837;&#32039;&#24352;&#30340;&#24037;&#20316;&#65292;&#20294;&#20854;&#20182;&#26102;&#38388;&#21017;&#38519;&#20837;&#20241;&#30496;&#65288;&#20316;&#20026;&#21457;&#24067;&#31649;&#29702;&#21592;&#20241;&#30496;&#65292;&#22312;&#26377;&#20123;&#24773;&#20917;&#19979;&#8212;&#23427;&#36824;&#21487;&#20197;&#26159;&#27963;&#36291;&#30340;&#24320;&#21457;&#32773;&#65292;&#20294;&#37027;&#26159;&#21478;&#22806;&#19968;&#22238;&#20107;&#20102;&#65289;&#12290;</p></li><li class="listitem"><p>&#23601;&#20687;&#25209;&#35780;&#21644;&#33635;&#35465;&#65292;&#24863;&#35874;&#24517;&#39035;&#26159;&#29305;&#23450;&#30340;&#12290;&#19981;&#35201;&#22240;&#20026;&#20255;&#22823;&#32780;&#24863;&#35874;&#65292;&#21363;&#20351;&#30830;&#23454;&#22914;&#27492;&#12290;&#35201;&#20026;&#20182;&#20204;&#25152;&#20570;&#30340;&#36229;&#20986;&#23547;&#24120;&#30340;&#20107;&#24773;&#34920;&#31034;&#24863;&#35874;&#65292;&#22914;&#26524;&#33021;&#24688;&#24403;&#30340;&#35828;&#20986;&#20182;&#20204;&#30340;&#20255;&#22823;&#20043;&#22788;&#20063;&#33021;&#39069;&#22806;&#21152;&#20998;&#12290;</p></li></ul></div><p>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#22312;&#30830;&#20445;&#26576;&#20010;&#20154;&#30340;&#36129;&#29486;&#24050;&#32463;&#34987;&#35782;&#21035;&#20986;&#26469;&#65292;&#21644;&#30830;&#20445;&#25972;&#20010;&#39033;&#30446;&#26159;&#19968;&#20010;&#22242;&#38431;&#65292;&#32780;&#19981;&#26159;&#19968;&#20123;&#33635;&#32768;&#30340;&#20010;&#20307;&#26102;&#65292;&#24635;&#20250;&#26377;&#20123;&#32039;&#24352;&#12290;&#21482;&#35201;&#24847;&#35782;&#21040;&#36825;&#31181;&#32039;&#24352;&#65292;&#24182;&#19988;&#24378;&#35843;&#34920;&#29616;&#22242;&#38431;&#65292;&#20197;&#21450;&#26410;&#33021;&#25484;&#25569;&#30340;&#20107;&#29289;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="committers.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="forks.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#25552;&#20132;&#32773; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20998;&#21449;</td></tr></table></div></body></html>
