<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="publicity.html" title="&#20844;&#24320;&#24615;"><link rel="next" href="release-branches.html" title="&#21457;&#24067;&#20998;&#25903;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="publicity.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="release-branches.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><div class="titlepage"><div><div><h2 class="title"><a name="development-cycle"></a>Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="development-cycle.html#release-numbering">&#29256;&#26412;&#21495;</a></span></dt><dd><dl><dt><span class="sect2"><a href="development-cycle.html#release-number-components">&#29256;&#26412;&#21495;&#32452;&#25104;&#37096;&#20998;</a></span></dt><dt><span class="sect2"><a href="development-cycle.html#release-number-simple-strategy">&#31616;&#21333;&#31574;&#30053;</a></span></dt><dt><span class="sect2"><a href="development-cycle.html#release-number-even-odd-strategy">&#22855;&#20598;&#25968;&#31574;&#30053;</a></span></dt></dl></dd><dt><span class="sect1"><a href="release-branches.html">&#21457;&#24067;&#20998;&#25903;</a></span></dt><dd><dl><dt><span class="sect2"><a href="release-branches.html#release-branch-mechanics">&#21457;&#24067;&#20998;&#25903;&#30340;&#25216;&#24039;</a></span></dt></dl></dd><dt><span class="sect1"><a href="stabilizing-a-release.html">&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;</a></span></dt><dd><dl><dt><span class="sect2"><a href="stabilizing-a-release.html#release-owner">&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;</a></span></dt><dt><span class="sect2"><a href="stabilizing-a-release.html#release-voting">&#21464;&#26356;&#34920;&#20915;</a></span></dt><dd><dl><dt><span class="sect3"><a href="stabilizing-a-release.html#release-stabilization-collaboration">&#31649;&#29702;&#21327;&#20316;&#21457;&#24067;&#31283;&#23450;&#21270;</a></span></dt><dt><span class="sect3"><a href="stabilizing-a-release.html#release-manager">&#21457;&#24067;&#32463;&#29702;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="packaging.html">&#25171;&#21253;</a></span></dt><dd><dl><dt><span class="sect2"><a href="packaging.html#packaging-format">&#26684;&#24335;</a></span></dt><dt><span class="sect2"><a href="packaging.html#packaging-name-and-layout">&#21629;&#21517;&#21644;&#24067;&#23616;</a></span></dt><dd><dl><dt><span class="sect3"><a href="packaging.html#release-capitalization">&#22823;&#20889;&#36824;&#26159;&#19981;&#22823;&#20889;</a></span></dt><dt><span class="sect3"><a href="packaging.html#release-prereleases">&#39044;&#21457;&#24067;</a></span></dt></dl></dd><dt><span class="sect2"><a href="packaging.html#packaging-build-install">&#32534;&#35793;&#21644;&#23433;&#35013;</a></span></dt><dt><span class="sect2"><a href="packaging.html#binary-packages">&#20108;&#36827;&#21046;&#21253;</a></span></dt></dl></dd><dt><span class="sect1"><a href="testing-and-releasing.html">&#27979;&#35797;&#21644;&#21457;&#24067;</a></span></dt><dd><dl><dt><span class="sect2"><a href="testing-and-releasing.html#candidate-releases">&#20505;&#36873;&#21457;&#24067;</a></span></dt><dt><span class="sect2"><a href="testing-and-releasing.html#release-announcement">&#23459;&#21578;&#21457;&#24067;</a></span></dt></dl></dd><dt><span class="sect1"><a href="release-lines.html">&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;</a></span></dt><dd><dl><dt><span class="sect2"><a href="release-lines.html#security-releases">&#23433;&#20840;&#21457;&#24067;</a></span></dt></dl></dd><dt><span class="sect1"><a href="releases-and-daily-development.html">&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</a></span></dt><dd><dl><dt><span class="sect2"><a href="releases-and-daily-development.html#planning">&#35745;&#21010;&#21457;&#24067;</a></span></dt></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#26412;&#31456;&#20851;&#20110;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#22914;&#20309;&#25171;&#21253;&#21644;&#21457;&#24067;&#36719;&#20214;&#65292;&#20197;&#21450;&#22914;&#20309;&#35753;&#25972;&#20010;&#24320;&#21457;&#27169;&#24335;&#30340;&#32452;&#32455;&#22260;&#32469;&#36825;&#20010;&#30446;&#26631;&#12290;</p><p>&#24320;&#28304;&#39033;&#30446;&#21644;&#31169;&#26377;&#39033;&#30446;&#30340;&#20027;&#35201;&#21306;&#21035;&#26159;&#32570;&#20047;&#23545;&#24320;&#21457;&#22242;&#38431;&#30340;&#20013;&#22830;&#31649;&#29702;&#12290;&#24403;&#20934;&#22791;&#26032;&#29256;&#26412;&#26102;&#65292;&#36825;&#20010;&#21306;&#21035;&#23588;&#20854;&#26126;&#26174;&#65306;&#19968;&#20010;&#20844;&#21496;&#21487;&#20197;&#35753;&#25972;&#20010;&#24320;&#21457;&#22242;&#38431;&#38598;&#20013;&#31934;&#21147;&#22312;&#21363;&#23558;&#21457;&#29983;&#30340;&#29256;&#26412;&#19978;&#65292;&#32780;&#23558;&#26032;&#29305;&#24615;&#24320;&#21457;&#21644;&#19981;&#37325;&#35201;&#30340;bug&#20462;&#27491;&#25918;&#22312;&#19968;&#36793;&#12290;&#24535;&#24895;&#22242;&#38431;&#19981;&#20250;&#22914;&#27492;&#25972;&#40784;&#21010;&#19968;&#12290;&#20154;&#20204;&#22240;&#20026;&#21508;&#31181;&#21508;&#26679;&#30340;&#21407;&#22240;&#20026;&#39033;&#30446;&#24037;&#20316;&#65292;&#24635;&#26377;&#20123;&#20154;&#20250;&#23545;&#21457;&#24067;&#29256;&#26412;&#19981;&#24863;&#20852;&#36259;&#65292;&#20250;&#24076;&#26395;&#22312;&#21457;&#24067;&#26102;&#32487;&#32493;&#24120;&#35268;&#30340;&#24320;&#21457;&#24037;&#20316;&#12290;&#22240;&#20026;&#24320;&#21457;&#19981;&#20250;&#32467;&#26463;&#65292;&#24320;&#28304;&#30340;&#21457;&#24067;&#27969;&#31243;&#24456;&#23481;&#26131;&#21464;&#38271;&#65292;&#20294;&#19981;&#20250;&#22914;&#21830;&#19994;&#21457;&#24067;&#27969;&#31243;&#37027;&#26679;&#20998;&#35010;&#12290;&#36825;&#23601;&#20687;&#20462;&#29702;&#39640;&#36895;&#36335;&#12290;&#26377;&#20004;&#31181;&#20462;&#29702;&#26041;&#27861;&#65306;&#20320;&#21487;&#20197;&#23558;&#20854;&#23436;&#20840;&#20851;&#38381;&#65292;&#36825;&#26679;&#33337;&#21592;&#20204;&#21487;&#20197;&#20840;&#21147;&#25237;&#20837;&#65292;&#30452;&#21040;&#38382;&#39064;&#34987;&#35299;&#20915;&#65292;&#25110;&#32773;&#20320;&#21487;&#20197;&#22312;&#22810;&#20010;&#23567;&#36947;&#19978;&#21516;&#26102;&#24037;&#20316;&#65292;&#32780;&#35753;&#20854;&#20182;&#20154;&#21487;&#20197;&#33258;&#30001;&#36890;&#34892;&#12290;&#31532;&#19968;&#31181;&#26041;&#27861;<span class="emphasis"><em>&#23545;&#20462;&#29702;&#33337;&#21592;&#38750;&#24120;&#26377;&#25928;&#29575;</em></span>&#65292;&#20294;&#23545;&#20110;&#20854;&#20182;&#20154;&#26469;&#35828;&#8212;&#23436;&#25104;&#20219;&#21153;&#21069;&#36947;&#36335;&#34987;&#23436;&#20840;&#20851;&#38381;&#12290;&#31532;&#20108;&#31181;&#26041;&#27861;&#65292;&#20462;&#29702;&#33337;&#21592;&#65288;&#29616;&#22312;&#20182;&#20204;&#38656;&#35201;&#19982;&#36739;&#23569;&#65289;&#20250;&#38656;&#35201;&#26356;&#38271;&#30340;&#26102;&#38388;&#65292;&#20294;&#33267;&#23569;&#36947;&#36335;&#20445;&#25345;&#21487;&#29992;&#65292;&#23613;&#31649;&#19981;&#33021;&#23436;&#20840;&#30021;&#36890;&#12290;</p><p>&#24320;&#28304;&#39033;&#30446;&#36890;&#24120;&#20250;&#20351;&#29992;&#31532;&#20108;&#31181;&#26041;&#27861;&#12290;&#23454;&#38469;&#19978;&#65292;&#23545;&#20110;&#21516;&#26102;&#25317;&#26377;&#22810;&#26465;&#29256;&#26412;&#32447;&#30340;&#25104;&#29087;&#36719;&#20214;&#65292;&#39033;&#30446;&#19968;&#30452;&#22788;&#20110;&#20462;&#29702;&#23567;&#36335;&#30340;&#29366;&#24577;&#12290;&#24635;&#20250;&#26377;&#20123;&#23567;&#36947;&#20250;&#34987;&#20851;&#38381;&#65307;&#19968;&#30452;&#23384;&#22312;&#30340;&#20294;&#26159;&#36739;&#20302;&#32423;&#21035;&#30340;&#19981;&#20415;&#33021;&#22815;&#34987;&#25972;&#20010;&#24320;&#21457;&#22242;&#38431;&#23481;&#24525;&#65292;&#25152;&#20197;&#25165;&#33021;&#22815;&#26377;&#35268;&#24459;&#30340;&#35745;&#21010;&#21457;&#24067;&#29256;&#26412;&#12290;</p><p>&#36825;&#20010;&#27169;&#22411;&#19981;&#20165;&#20165;&#33021;&#29992;&#20110;&#29256;&#26412;&#21457;&#24067;&#12290;&#20854;&#21407;&#29702;&#26159;&#24182;&#34892;&#20219;&#21153;&#24182;&#19981;&#26159;&#20114;&#30456;&#20381;&#36182;&#30340;&#8212;&#36825;&#24182;&#19981;&#26159;&#21482;&#23384;&#22312;&#20110;&#24320;&#28304;&#39033;&#30446;&#30340;&#21407;&#29702;&#65292;&#20294;&#24320;&#28304;&#39033;&#30446;&#20351;&#29992;&#20102;&#33258;&#24049;&#30340;&#26041;&#27861;&#23454;&#29616;&#20102;&#23427;&#12290;&#20182;&#20204;&#19981;&#33021;&#25215;&#21463;&#23545;&#20462;&#36335;&#24037;&#38431;&#21592;&#25110;&#24120;&#35268;&#20132;&#36890;&#30340;&#36807;&#24230;&#25171;&#25200;&#65292;&#21516;&#26679;&#20063;&#19981;&#33021;&#25215;&#21463;&#35753;&#20154;&#20204;&#21482;&#26159;&#31449;&#22312;&#40644;&#32447;&#20197;&#22806;&#65292;&#31561;&#24453;&#20132;&#36890;&#30095;&#23548;&#12290;&#22240;&#32780;&#65292;&#20182;&#20204;&#20250;&#21521;&#24179;&#32531;&#30340;&#12289;&#31283;&#23450;&#31649;&#29702;&#36127;&#25285;&#30340;&#36807;&#31243;&#21457;&#23637;&#65292;&#32780;&#19981;&#20250;&#26159;&#20805;&#28385;&#26356;&#22810;&#30340;&#23665;&#35895;&#21644;&#39640;&#23792;&#12290;&#24535;&#24895;&#32773;&#36890;&#24120;&#20250;&#24076;&#26395;&#24037;&#20316;&#20013;&#21482;&#26377;&#19968;&#20123;&#34429;&#28982;&#25345;&#32493;&#20294;&#19981;&#22826;&#20005;&#37325;&#30340;&#19981;&#20415;&#65307;&#25552;&#20379;&#20123;&#35768;&#20182;&#20204;&#21487;&#39044;&#27979;&#24615;&#20250;&#35753;&#20182;&#20204;&#21487;&#20197;&#33258;&#30001;&#30340;&#23433;&#25490;&#33258;&#24049;&#30340;&#26085;&#31243;&#65292;&#26080;&#38656;&#25285;&#24515;&#22312;&#39033;&#30446;&#20013;&#21457;&#29983;&#20914;&#31361;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#39033;&#30446;&#20027;&#26085;&#31243;&#20013;&#26377;&#20123;&#27963;&#21160;&#20250;&#25490;&#38500;&#20854;&#20182;&#27963;&#21160;&#65292;&#23601;&#20250;&#23548;&#33268;&#24456;&#22810;&#24320;&#21457;&#32773;&#20572;&#27490;&#24456;&#38271;&#26102;&#38388;&#8212;&#19981;&#20165;&#38750;&#24120;&#27809;&#26377;&#25928;&#29575;&#65292;&#20063;&#38750;&#24120;&#26080;&#32842;&#65292;&#22240;&#32780;&#20250;&#24456;&#21361;&#38505;&#65292;&#22240;&#20026;&#26080;&#32842;&#30340;&#24320;&#21457;&#32773;&#20250;&#24456;&#24555;&#21464;&#25104;&#21069;&#24320;&#21457;&#32773;&#12290;</p><p>&#29256;&#26412;&#21457;&#24067;&#24037;&#20316;&#23454;&#38469;&#19978;&#26159;&#24182;&#34892;&#24320;&#21457;&#20013;&#26368;&#23481;&#26131;&#34987;&#27880;&#24847;&#21040;&#30340;&#38750;&#24320;&#21457;&#20219;&#21153;&#65292;&#25152;&#20197;&#19979;&#38754;&#31456;&#33410;&#20013;&#25551;&#36848;&#30340;&#26041;&#27861;&#20027;&#35201;&#38024;&#23545;&#22914;&#20309;&#20801;&#35768;&#21457;&#24067;&#12290;&#28982;&#32780;&#65292;&#20063;&#26377;&#20854;&#20182;&#30340;&#24182;&#34892;&#20219;&#21153;&#65292;&#20363;&#22914;&#32763;&#35793;&#21644;&#22269;&#38469;&#21270;&#12289;&#22312;&#25972;&#20010;&#20195;&#30721;&#30340;&#22522;&#30784;&#19978;&#36880;&#28176;&#25193;&#22823;API&#21464;&#26356;&#31561;&#12290;</p></div><div class="sect1" title="&#29256;&#26412;&#21495;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-numbering"></a>&#29256;&#26412;&#21495;</h2></div></div></div><p>&#22312;&#25105;&#20204;&#35752;&#35770;&#22914;&#20309;&#21457;&#24067;&#20043;&#21069;&#65292;&#39318;&#20808;&#30475;&#19968;&#19979;&#22914;&#20309;&#21629;&#21517;&#29256;&#26412;&#65292;&#29992;&#25143;&#38656;&#35201;&#20174;&#29256;&#26412;&#20013;&#30693;&#36947;&#20160;&#20040;&#12290;&#19968;&#20010;&#29256;&#26412;&#21457;&#24067;&#24847;&#21619;&#30528;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#32769;&#30340;bug&#34987;&#20462;&#27491;&#20102;&#12290;&#24656;&#24597;&#25152;&#26377;&#30340;&#29992;&#25143;&#37117;&#35748;&#20026;&#27599;&#20010;&#29256;&#26412;&#37117;&#29702;&#25152;&#24403;&#28982;&#24212;&#35813;&#20570;&#21040;&#36825;&#19968;&#28857;&#12290;</p></li><li class="listitem"><p>&#20250;&#24102;&#26469;&#26032;bug&#12290;&#19968;&#33324;&#24773;&#20917;&#19979;&#36825;&#26159;&#24517;&#28982;&#30340;&#65292;&#38500;&#38750;&#26159;&#23433;&#20840;&#29256;&#26412;&#25110;&#20854;&#20182;&#29305;&#27530;&#24773;&#20917;&#65288;&#35265;<span>&#26412;&#31456;&#21518;&#38754;</span><a class="xref" href="release-lines.html#security-releases" title="&#23433;&#20840;&#21457;&#24067;">the section called &#8220;&#23433;&#20840;&#21457;&#24067;&#8221;</a>&#65289;&#12290;</p></li><li class="listitem"><p>&#20063;&#21152;&#20837;&#20102;&#26032;&#30340;&#29305;&#24615;&#12290;</p></li><li class="listitem"><p>&#26032;&#37197;&#32622;&#36873;&#39033;&#20063;&#20250;&#34987;&#28155;&#21152;&#65292;&#25110;&#32773;&#19968;&#20123;&#20197;&#21069;&#30340;&#36873;&#39033;&#26377;&#20102;&#24494;&#22937;&#30340;&#21464;&#21270;&#12290;&#21644;&#19978;&#20010;&#29256;&#26412;&#30456;&#27604;&#65292;&#23433;&#35013;&#27493;&#39588;&#21487;&#33021;&#26377;&#36731;&#24494;&#30340;&#35843;&#25972;&#65292;&#21363;&#20351;&#20154;&#20204;&#19981;&#24076;&#26395;&#36825;&#26679;&#12290;</p></li><li class="listitem"><p>&#20063;&#21487;&#33021;&#24102;&#26469;&#19981;&#20860;&#23481;&#30340;&#21464;&#21270;&#65292;&#20363;&#22914;&#20197;&#21069;&#29256;&#26412;&#30340;&#36719;&#20214;&#25152;&#29992;&#30340;&#25968;&#25454;&#26684;&#24335;&#24517;&#39035;&#20570;&#20986;&#26576;&#31181;&#65288;&#21487;&#33021;&#26159;&#25163;&#24037;&#30340;&#65289;&#21333;&#21521;&#30340;&#36716;&#21270;&#65292;&#25165;&#33021;&#32487;&#32493;&#20351;&#29992;&#12290;</p></li></ul></div><p>&#23601;&#20687;&#20320;&#30475;&#21040;&#30340;&#65292;&#21457;&#29983;&#30340;&#19981;&#37117;&#26159;&#22909;&#20107;&#12290;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#32463;&#39564;&#20016;&#23500;&#30340;&#29992;&#25143;&#24635;&#26159;&#23545;&#26032;&#29256;&#26412;&#20445;&#25345;&#24656;&#24807;&#65292;&#29305;&#21035;&#26159;&#24403;&#36719;&#20214;&#24050;&#32463;&#36275;&#22815;&#25104;&#29087;&#65292;&#24050;&#32463;&#33021;&#22815;&#28385;&#36275;&#20182;&#20204;&#30340;&#38656;&#35201;&#26102;&#65288;&#25110;&#32773;&#35748;&#20026;&#20182;&#20204;&#28385;&#36275;&#20102;&#65289;&#12290;&#21363;&#20351;&#26032;&#29305;&#24615;&#26159;&#22909;&#22351;&#21442;&#21322;&#30340;&#20107;&#24773;&#65292;&#20063;&#24847;&#21619;&#30528;&#36719;&#20214;&#29616;&#22312;&#21487;&#33021;&#20197;&#19981;&#21487;&#39044;&#26399;&#30340;&#26041;&#24335;&#36816;&#34892;&#12290;</p><p>&#22240;&#27492;&#21457;&#24067;&#29256;&#26412;&#32534;&#21495;&#30340;&#30446;&#30340;&#26159;&#21452;&#37325;&#30340;&#65306;&#24456;&#26126;&#26174;&#36825;&#20010;&#32534;&#21495;&#21487;&#20197;&#22312;&#20132;&#27969;&#20013;&#26126;&#30830;&#21457;&#24067;&#30340;&#39034;&#24207;&#65288;&#20363;&#22914;&#65292;&#36890;&#36807;&#27604;&#36739;&#20004;&#20010;&#29256;&#26412;&#21495;&#65292;&#20320;&#21487;&#20197;&#30475;&#20986;&#21738;&#20010;&#29256;&#26412;&#26356;&#32769;&#65289;&#65292;&#21478;&#19968;&#26041;&#38754;&#65292;&#20063;&#24212;&#35813;&#23613;&#21487;&#33021;&#32039;&#20945;&#30340;&#34920;&#26126;&#35813;&#21457;&#24067;&#25152;&#24102;&#26469;&#21464;&#26356;&#30340;&#31243;&#24230;&#21644;&#24615;&#36136;&#12290;</p><p>&#20165;&#20165;&#26159;&#21495;&#30721;&#21527;&#65311;&#25110;&#22810;&#25110;&#23569;&#26159;&#12290;&#29256;&#26412;&#32534;&#21495;&#31574;&#30053;&#26159;&#26368;&#21476;&#32769;&#30340;&#33258;&#34892;&#36710;&#24211;&#35752;&#35770;&#65288;&#35265;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="common-pitfalls.html#bikeshed" title="&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;">the section called &#8220;&#20027;&#39064;&#36234;&#36719;&#65292;&#36777;&#35770;&#36234;&#38271;&#8221;</a>&#65289;&#65292;&#36825;&#20010;&#19990;&#30028;&#20063;&#20284;&#20046;&#20174;&#26469;&#27809;&#26377;&#33021;&#36798;&#25104;&#19968;&#20010;&#21333;&#29420;&#30340;&#23436;&#25972;&#30340;&#26631;&#20934;&#12290;&#28982;&#32780;&#65292;&#36824;&#26159;&#20986;&#29616;&#20102;&#19968;&#20123;&#22909;&#30340;&#31574;&#30053;&#65292;&#20381;&#25454;&#20102;&#19968;&#20123;&#24191;&#27867;&#35748;&#21516;&#30340;&#21407;&#29702;&#65306;<span class="emphasis"><em>&#19968;&#33268;&#24615;</em></span>&#12290;&#37319;&#21462;&#19968;&#31181;&#32534;&#21495;&#26041;&#24335;&#65292;&#35760;&#24405;&#19979;&#26469;&#65292;&#24182;&#22362;&#25345;&#20351;&#29992;&#12290;&#20320;&#30340;&#29992;&#25143;&#20250;&#24863;&#28608;&#19981;&#23613;&#12290;</p><div class="sect2" title="&#29256;&#26412;&#21495;&#32452;&#25104;&#37096;&#20998;"><div class="titlepage"><div><div><h3 class="title"><a name="release-number-components"></a>&#29256;&#26412;&#21495;&#32452;&#25104;&#37096;&#20998;</h3></div></div></div><p>&#26412;&#23567;&#33410;&#35814;&#32454;&#25551;&#36848;&#20102;&#19968;&#20123;&#21457;&#24067;&#29256;&#26412;&#21495;&#30340;&#27491;&#24335;&#24815;&#20363;&#65292;&#35748;&#20026;&#26159;&#24050;&#30693;&#30340;&#39044;&#20808;&#30693;&#35782;&#12290;&#30446;&#30340;&#20165;&#20165;&#26159;&#20316;&#20026;&#19968;&#20010;&#21442;&#32771;&#12290;&#22914;&#26524;&#20320;&#24050;&#32463;&#20102;&#35299;&#20102;&#36825;&#20123;&#24815;&#20363;&#65292;&#20320;&#21487;&#20197;&#36339;&#36807;&#26412;&#23567;&#33410;&#12290;</p><p>&#21457;&#24067;&#21495;&#30721;&#26159;&#19968;&#32452;&#28857;&#20998;&#21106;&#30340;&#25968;&#23383;&#65306;</p><div class="informalexample"><div class="literallayout"><p>Scanley 2.3<br>
Singer 5.11.4</p></div></div><p>...&#31561;&#31561;&#12290;&#36825;&#20123;&#28857;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#23567;&#25968;&#28857;&#65292;&#32780;&#20165;&#20165;&#26159;&#20998;&#38548;&#31526;&#65307;&#8220;5.3.9&#8221;&#20043;&#21518;&#23558;&#20250;&#26159;&#8220;5.3.10&#8221;&#12290;&#26576;&#20123;&#39033;&#30446;&#20598;&#23572;&#20063;&#20250;&#29992;&#20854;&#20182;&#30340;&#25552;&#31034;&#65292;&#20363;&#22914;&#38750;&#24120;&#26377;&#21517;&#30340;Linux&#20869;&#26680;&#65292;&#22312;Linux 1.0&#20043;&#21069;&#20351;&#29992;&#30340;&#26159;&#8220;0.95&#8221;&#12289;&#8220;0.96&#8221;... &#8220;0.99&#8221;&#65292;&#20294;&#26159;&#36825;&#31181;&#28857;&#21495;&#25104;&#20026;&#20102;&#22266;&#26377;&#30340;&#20064;&#24815;&#65292;&#24050;&#32463;&#34987;&#35748;&#20026;&#26159;&#19968;&#31181;&#26631;&#20934;&#12290;&#25968;&#23383;&#37096;&#20998;&#65288;&#19981;&#21253;&#21547;&#28857;&#30340;&#25968;&#23383;&#37096;&#20998;&#65289;&#30340;&#25968;&#37327;&#27809;&#26377;&#38480;&#21046;&#65292;&#20294;&#26159;&#22823;&#22810;&#25968;&#39033;&#30446;&#19981;&#24212;&#35813;&#36229;&#36807;3&#25110;4&#12290;&#22312;&#21518;&#38754;&#25105;&#20204;&#20250;&#23545;&#21407;&#22240;&#26377;&#26356;&#28165;&#26970;&#30340;&#35748;&#35782;&#12290;</p><p>&#38500;&#20102;&#25968;&#23383;&#37096;&#20998;&#20043;&#22806;&#65292;&#19968;&#20123;&#39033;&#30446;&#20063;&#20250;&#38468;&#21152;&#19968;&#20010;&#25551;&#36848;&#26631;&#31614;&#65292;&#20363;&#22914;&#8220;Alpha&#8221;&#25110;&#8220;Beta&#8221;&#65288;&#35265;<a class="xref" href="getting-started.html#alpha-and-beta" title="Alpha&#21644;Beta">Alpha&#21644;Beta</a>&#65289;&#65292;&#20363;&#22914;&#65306;</p><div class="informalexample"><div class="literallayout"><p>Scanley 2.3.0 (Alpha)<br>
Singer 5.11.4 (Beta)</p></div></div><p>Alpha&#25110;Beta&#20462;&#39280;&#24847;&#21619;&#30528;&#36825;&#20010;&#29256;&#26412;&#26159;&#19968;&#20010;&#23558;&#35201;&#21457;&#24067;&#29256;&#26412;&#65288;&#21516;&#26679;&#30340;&#29256;&#26412;&#21495;&#65292;&#20294;&#27809;&#26377;&#20462;&#39280;&#65289;&#30340;<span class="emphasis"><em>&#20808;&#20363;</em></span>&#12290;&#22240;&#27492;&#65292;&#8220;2.3.0 (Alpha)&#8221;&#23558;&#20250;&#24102;&#26469;&#8220;2.3.0&#8221;&#12290;&#20026;&#20102;&#33021;&#25490;&#21015;&#22909;&#22810;&#20010;&#36825;&#26679;&#30340;&#20505;&#36873;&#29256;&#26412;&#65292;&#20462;&#39280;&#31526;&#20063;&#21487;&#20197;&#26377;&#19968;&#20010;&#20043;&#21518;&#30340;&#20462;&#39280;&#12290;&#20363;&#22914;&#65292;&#19979;&#38754;&#26159;&#19968;&#31995;&#21015;&#21363;&#23558;&#21457;&#24067;&#30340;&#29256;&#26412;&#65292;&#26681;&#25454;&#21457;&#24067;&#26102;&#38388;&#25490;&#24207;&#65306;</p><div class="informalexample"><div class="literallayout"><p>Scanley 2.3.0 (Alpha 1)<br>
Scanley 2.3.0 (Alpha 2)<br>
Scanley 2.3.0 (Beta 1)<br>
Scanley 2.3.0 (Beta 2)<br>
Scanley 2.3.0 (Beta 3)<br>
Scanley 2.3.0</p></div></div><p>&#35831;&#27880;&#24847;&#24403;&#20351;&#29992;&#8220;Alpha&#8221;&#20462;&#39280;&#31526;&#26102;&#65292;Scanley&#30340;"2.3"&#20889;&#20316;"2.3.0"&#12290;&#36825;&#20004;&#20010;&#21495;&#30721;&#26159;&#31561;&#21516;&#30340;&#8212;&#20986;&#20110;&#31616;&#30701;&#30340;&#30446;&#30340;&#65292;&#32467;&#23614;&#25152;&#26377;&#30340;0&#37117;&#21487;&#20197;&#20002;&#25481;&#8212;&#20294;&#26159;&#24403;&#26377;&#20462;&#39280;&#35789;&#26102;&#65292;&#31616;&#30701;&#25104;&#20026;&#26080;&#38656;&#32771;&#34385;&#30340;&#38382;&#39064;&#65292;&#25152;&#20197;&#20154;&#20204;&#20250;&#36873;&#25321;&#23436;&#25972;&#30340;&#26041;&#24335;&#12290;</p><p>&#21478;&#22806;&#19968;&#20123;&#21322;&#27491;&#35268;&#30340;&#20462;&#39280;&#35789;&#21253;&#25324;&#8220;Stable&#8221;&#12289;&#8220;Unstable&#8221;&#12289;&#8220;Development&#8221;&#21644;&#8220;RC&#8221;&#65288;&#8220;&#21457;&#24067;&#20505;&#36873;&#8221;&#65289;&#12290;&#26368;&#24120;&#29992;&#30340;&#36824;&#26159;&#8220;Alpha&#8221;&#21644;&#8220;Beta&#8221;&#65292;&#32780;&#8220;RC&#8221;&#29992;&#20110;&#31532;&#19977;&#26041;&#65292;&#20294;&#26159;&#35831;&#27880;&#24847;&#8220;RC&#8221;&#24635;&#20250;&#21253;&#21547;&#19968;&#20010;&#25968;&#23383;&#20462;&#39280;&#12290;&#20063;&#23601;&#26159;&#19981;&#35201;&#20351;&#29992;&#8220;Scanley 2.3.0 (RC)&#8221;&#65292;&#32780;&#20351;&#29992;&#8220;Scanley 2.3.0 (RC 1)&#8221;&#65292;&#28982;&#21518;&#26159;RC2&#65292;&#20197;&#27492;&#31867;&#25512;&#12290;</p><p>&#8220;Alpha&#8221;&#12289;&#8220;Beta&#8221;&#21644;&#8220;RC&#8221;&#37117;&#26159;&#24050;&#32463;&#24191;&#20026;&#20154;&#30693;&#30340;&#26631;&#31614;&#20102;&#65292;&#25152;&#20197;&#25105;&#19981;&#24314;&#35758;&#20320;&#20351;&#29992;&#20854;&#20182;&#26631;&#31614;&#65292;&#21363;&#20351;&#26159;&#37027;&#20123;&#20045;&#30475;&#36215;&#26469;&#26356;&#24120;&#35265;&#32780;&#38750;&#26041;&#35328;&#30340;&#35789;&#27719;&#65292;&#20284;&#20046;&#26159;&#26356;&#22909;&#30340;&#36873;&#25321;&#12290;&#20294;&#26159;&#37027;&#20123;&#20174;&#21457;&#24067;&#21253;&#23433;&#35013;&#36719;&#20214;&#30340;&#20154;&#23545;&#20110;&#36825;&#19977;&#20010;&#35789;&#27719;&#24050;&#32463;&#38750;&#24120;&#29087;&#24713;&#65292;&#27809;&#26377;&#29702;&#30001;&#36873;&#25321;&#29305;&#31435;&#29420;&#34892;&#12290;</p><p>&#23613;&#31649;&#21457;&#24067;&#29256;&#26412;&#21495;&#30721;&#20013;&#30340;&#28857;&#25968;&#24182;&#19981;&#26159;&#23567;&#25968;&#28857;&#65292;&#20294;&#20063;&#26159;&#36215;&#21040;&#20102;&#20301;&#32622;&#26631;&#31034;&#30340;&#20316;&#29992;&#12290;&#25152;&#26377;&#30340;&#8220;0.X.Y&#8221;&#26089;&#20110;&#8220;1.0&#8221;&#65288;&#31561;&#21516;&#20110;&#8220;1.0.0&#8221;&#65289;&#12290;&#8220;3.14.158&#8221;&#26159;&#8220;3.14.159&#8221;&#30452;&#25509;&#21069;&#32487;&#29256;&#26412;&#65292;&#32780;&#8220;3.14.160&#8221;&#21644;&#8220;3.15.&#20219;&#24847;&#25968;&#8221;&#21017;&#26159;&#8220;3.14.158&#8221;&#30340;&#21518;&#32487;&#29256;&#26412;&#65292;&#25285;&#19981;&#26159;&#30452;&#25509;&#21518;&#32487;&#12290;</p><p>&#19968;&#33268;&#30340;&#21457;&#24067;&#29256;&#26412;&#21495;&#30721;&#31574;&#30053;&#21487;&#20197;&#35753;&#29992;&#25143;&#20165;&#20165;&#20174;&#26576;&#20010;&#36719;&#20214;&#30340;&#29256;&#26412;&#21495;&#23601;&#21487;&#20197;&#21028;&#26029;&#20986;&#29256;&#26412;&#30340;&#37325;&#35201;&#31243;&#24230;&#12290;&#22312;&#19968;&#20010;&#19977;&#37096;&#20998;&#30340;&#31995;&#32479;&#20013;&#65292;&#31532;&#19968;&#37096;&#20998;&#26159;<em class="firstterm">&#20027; &#29256;&#26412;&#21495;</em>&#65292;&#31532;&#20108;&#37096;&#20998;&#26159;<em class="firstterm">&#27425; &#29256;&#26412;&#21495;&#30721;</em>&#65292;&#32780;&#31532;&#19977;&#37096;&#20998;&#26159;<em class="firstterm">&#23567; &#29256;&#26412;&#21495;&#30721;</em>&#12290;&#20363;&#22914;&#29256;&#26412;&#8220;2.10.17&#8221;&#26159;&#20027;&#29256;&#26412;2&#31995;&#21015;&#30340;&#27425;&#35201;&#29256;&#26412;10&#24320;&#21457;&#32447;&#30340;&#23567;&#29256;&#26412;17&#12290;&#35789;&#27719;&#8220;&#24320;&#21457;&#32447;&#8221;&#21644;&#8220;&#31995;&#21015;&#8221;&#22312;&#36825;&#37324;&#24182;&#19981;&#27491;&#24335;&#65292;&#20294;&#20182;&#20204;&#20195;&#34920;&#20102;&#20154;&#20204;&#26399;&#26395;&#30340;&#21547;&#20041;&#12290;&#19968;&#20010;&#20027;&#31995;&#21015;&#20165;&#20165;&#26159;&#20849;&#20139;&#21516;&#19968;&#20010;&#20027;&#21495;&#30721;&#30340;&#29256;&#26412;&#65292;&#32780;&#27425;&#35201;&#31995;&#21015;&#65288;&#25110;&#27425;&#35201;&#24320;&#21457;&#32447;&#65289;&#21017;&#30001;&#30456;&#21516;&#27425;&#35201;<span class="emphasis"><em>&#21644;</em></span>&#20027;&#21495;&#30721;&#30340;&#29256;&#26412;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#8220;2.4.0&#8221;&#21644;&#8220;3.4.1&#8221;&#24182;&#19981;&#26159;&#20301;&#20110;&#21516;&#19968;&#20010;&#27425;&#35201;&#31995;&#21015;&#65292;&#21363;&#20351;&#20182;&#20204;&#37117;&#26377;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;4&#12290;&#21478;&#19968;&#20010;&#24773;&#20917;&#19979;&#65292;&#8220;2.4.0&#8221;&#21644;&#8220;2.4.2&#8221;&#21017;&#20301;&#20110;&#21516;&#19968;&#20010;&#27425;&#35201;&#24320;&#21457;&#32447;&#65292;&#23613;&#31649;&#20182;&#20204;&#24182;&#19981;&#26159;&#30456;&#37051;&#30340;&#29256;&#26412;&#65292;&#22240;&#20026;&#8220;2.4.1&#8221;&#29256;&#26412;&#20301;&#20110;&#20182;&#20204;&#20043;&#38388;&#12290;</p><p>&#36825;&#20123;&#21495;&#30721;&#30340;&#21547;&#20041;&#21487;&#20197;&#26159;&#20320;&#33258;&#24049;&#25152;&#26399;&#26395;&#30340;&#65306;&#20027;&#21495;&#30721;&#30340;&#21464;&#26356;&#34920;&#31034;&#21457;&#29983;&#20102;&#20027;&#35201;&#30340;&#21464;&#21270;&#65307;&#27425;&#35201;&#21495;&#30721;&#30340;&#21464;&#21270;&#34920;&#31034;&#21457;&#29983;&#20102;&#27425;&#35201;&#30340;&#21464;&#26356;&#12290;&#26377;&#19968;&#20123;&#39033;&#30446;&#20250;&#26377;&#31532;4&#37096;&#20998;&#65292;&#36890;&#24120;&#21483;&#20570;<em class="firstterm">&#34917;&#19969; &#21495;&#30721;</em>&#65292;&#29305;&#21035;&#26159;&#19968;&#20123;&#23545;&#21306;&#21035;&#36827;&#34892;&#32454;&#33268;&#25511;&#21046;&#30340;&#39033;&#30446;&#65288;&#26377;&#19968;&#28857;&#35753;&#20154;&#28151;&#28102;&#30340;&#26159;&#65292;&#19968;&#20123;&#39033;&#30446;&#23558;&#19977;&#37096;&#20998;&#31995;&#32479;&#20013;&#30340;&#8220;&#24494;&#65288;micro&#65289;&#8221;&#29256;&#26412;&#20316;&#20026;&#8220;&#34917;&#19969;&#8221;&#12290;&#65289;&#12290;&#20063;&#26377;&#19968;&#20123;&#39033;&#30446;&#20351;&#29992;&#26368;&#21518;&#19968;&#37096;&#20998;&#20316;&#20026;<em class="firstterm">&#26500;&#24314; &#21495;&#30721;</em>&#65292;&#38543;&#30528;&#39033;&#30446;&#30340;&#27599;&#19968;&#27425;&#26500;&#24314;&#36882;&#22686;&#65292;&#20195;&#34920;&#20102;&#27599;&#27425;&#21464;&#26356;&#30340;&#21464;&#21270;&#12290;&#36825;&#26679;&#24110;&#21161;&#20102;&#39033;&#30446;&#23558;&#27599;&#20010;bug&#25253;&#21578;&#19982;&#29305;&#23450;&#26500;&#24314;&#32852;&#31995;&#36215;&#26469;&#65292;&#29305;&#21035;&#26159;&#24403;&#20108;&#36827;&#21046;&#21457;&#24067;&#21253;&#26159;&#21457;&#24067;&#40664;&#35748;&#26041;&#27861;&#26102;&#29305;&#21035;&#26377;&#29992;&#12290;</p><p>&#23613;&#31649;&#23545;&#20110;&#20351;&#29992;&#22810;&#23569;&#20010;&#37096;&#20998;&#65292;&#27599;&#20010;&#37096;&#20998;&#30340;&#21547;&#20041;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#20064;&#24815;&#65292;&#21306;&#21035;&#36890;&#24120;&#24456;&#23567;&#8212;&#20320;&#20250;&#21463;&#21040;&#19968;&#20123;&#21387;&#21147;&#65292;&#20294;&#26159;&#19981;&#20250;&#22826;&#22823;&#12290;&#19979;&#38754;&#20004;&#23567;&#33410;&#35752;&#35770;&#20102;&#26368;&#24120;&#29992;&#30340;&#20960;&#20010;&#20064;&#24815;&#12290;</p></div><div class="sect2" title="&#31616;&#21333;&#31574;&#30053;"><div class="titlepage"><div><div><h3 class="title"><a name="release-number-simple-strategy"></a>&#31616;&#21333;&#31574;&#30053;</h3></div></div></div><p>&#22914;&#26524;&#20165;&#20165;&#20250;&#25913;&#21464;&#24494;&#23567;&#29256;&#26412;&#21495;&#30721;&#65292;&#22823;&#22810;&#25968;&#39033;&#30446;&#23545;&#20110;&#23558;&#20309;&#31181;&#21464;&#26356;&#32435;&#20837;&#21040;&#21457;&#24067;&#20013;&#20250;&#26377;&#19968;&#20123;&#35268;&#21017;&#65292;&#25913;&#21464;&#20027;&#35201;&#29256;&#26412;&#21495;&#30721;&#21017;&#20063;&#20250;&#26377;&#30456;&#24212;&#30340;&#35268;&#21017;&#12290;&#27809;&#26377;&#36825;&#20123;&#35268;&#21017;&#30340;&#26631;&#20934;&#38598;&#21512;&#65292;&#20294;&#19979;&#38754;&#25551;&#36848;&#26159;&#24050;&#32463;&#22312;&#35768;&#22810;&#39033;&#30446;&#24191;&#27867;&#20351;&#29992;&#30340;&#30340;&#25919;&#31574;&#12290;&#20320;&#25110;&#35768;&#20250;&#22312;&#33258;&#24049;&#30340;&#39033;&#30446;&#20013;&#37319;&#29992;&#36825;&#20123;&#26041;&#27861;&#65292;&#20294;&#21363;&#20351;&#19981;&#20351;&#29992;&#65292;&#36825;&#20173;&#26159;&#21457;&#24067;&#21495;&#30721;&#25152;&#24212;&#20256;&#36798;&#20449;&#24687;&#30340;&#22909;&#26696;&#20363;&#12290;&#36825;&#20010;&#25919;&#31574;&#26159;APR&#39033;&#30446;&#20351;&#29992;&#30340;&#32534;&#21495;&#31995;&#32479;&#65292;&#35831;&#30475;<a class="ulink" href="http://apr.apache.org/versioning.html" target="_top">http://apr.apache.org/versioning.html</a>&#12290;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#23545;&#20110;&#24494;&#23567;&#21495;&#30721;&#30340;&#21464;&#26356;&#65288;&#20063;&#23601;&#26159;&#22312;&#21516;&#19968;&#20010;&#27425;&#35201;&#24320;&#21457;&#32447;&#19978;&#21457;&#29983;&#30340;&#21464;&#21270;&#65289;&#21482;&#33021;&#26159;&#21521;&#21069;&#21644;&#21521;&#21518;&#20860;&#23481;&#30340;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#21464;&#26356;&#21482;&#33021;&#26159;bug&#20462;&#27491;&#65292;&#25110;&#20165;&#20165;&#26159;&#23545;&#29616;&#26377;&#29305;&#24615;&#36739;&#23567;&#30340;&#25913;&#36827;&#12290;&#26032;&#29305;&#24615;&#19968;&#23450;&#19981;&#33021;&#22312;&#24494;&#23567;&#29256;&#26412;&#21457;&#24067;&#20013;&#24341;&#20837;&#12290;</p></li><li class="listitem"><p>&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#65288;&#20063;&#23601;&#26159;&#20301;&#20110;&#21516;&#19968;&#20010;&#20027;&#24320;&#21457;&#32447;&#65289;&#30340;&#21464;&#26356;&#24517;&#39035;&#26159;&#21521;&#21069;&#20860;&#23481;&#65292;&#20294;&#19981;&#24517;&#21521;&#21518;&#20860;&#23481;&#12290;&#22312;&#27425;&#35201;&#29256;&#26412;&#20013;&#24341;&#20837;&#26032;&#29305;&#24615;&#38750;&#24120;&#24120;&#35265;&#65292;&#20294;&#26159;&#36890;&#24120;&#19981;&#35201;&#19968;&#27425;&#21253;&#21547;&#36807;&#22810;&#29305;&#24615;&#12290;</p></li><li class="listitem"><p>&#20027;&#29256;&#26412;&#21495;&#30721;&#30340;&#21464;&#26356;&#26631;&#35782;&#20102;&#20860;&#23481;&#24615;&#30340;&#36793;&#30028;&#12290;&#26032;&#30340;&#20027;&#29256;&#26412;&#21457;&#24067;&#19981;&#24517;&#21521;&#21069;&#21644;&#21521;&#21518;&#20860;&#23481;&#12290;&#26032;&#30340;&#20027;&#29256;&#26412;&#21457;&#24067;&#24212;&#35813;&#21253;&#21547;&#26032;&#30340;&#29305;&#24615;&#65292;&#29978;&#33267;&#23436;&#20840;&#30340;&#26032;&#29305;&#24615;&#38598;&#21512;&#12290;</p></li></ol></div><p><em class="firstterm">&#21521;&#21518;&#20860;&#23481;</em>&#21644;<em class="firstterm">&#21521;&#21069;&#20860;&#23481;</em>&#30340;&#21547;&#20041;&#21462;&#20915;&#20110;&#20320;&#30340;&#36719;&#20214;&#65292;&#20294;&#36890;&#24120;&#26080;&#38656;&#26126;&#30830;&#30340;&#35299;&#37322;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#26159;&#23458;&#25143;&#31471;/&#26381;&#21153;&#22120;&#24212;&#29992;&#65292;&#37027;&#20040;&#8220;&#21521;&#21518;&#20860;&#23481;&#8221;&#24847;&#21619;&#30528;&#23558;&#26381;&#21153;&#22120;&#21319;&#32423;&#21040;2.6.0&#19981;&#20250;&#23548;&#33268;2.5.4&#30340;&#23458;&#25143;&#31471;&#22833;&#25928;&#65292;&#25110;&#32773;&#24037;&#20316;&#26041;&#24335;&#21457;&#29983;&#21464;&#21270;&#65288;&#24403;&#28982;&#35201;&#25490;&#38500;&#20462;&#27491;&#30340;bug&#65289;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#23558;&#23458;&#25143;&#31471;&#21319;&#32423;&#21040;2.6.0&#65292;&#21487;&#20197;&#35753;&#23458;&#25143;&#31471;&#20139;&#21463;2.5.4&#26080;&#27861;&#20351;&#29992;<span class="emphasis"><em>&#26032;</em></span>&#21151;&#33021;&#12290;&#22914;&#26524;&#19981;&#33021;&#20570;&#21040;&#36825;&#19968;&#28857;&#65292;&#21017;&#21319;&#32423;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#8220;&#21521;&#21069;&#20860;&#23481;&#8221;&#65306;&#26174;&#28982;&#65292;&#20320;&#29616;&#22312;&#19981;&#33021;&#23558;&#23458;&#25143;&#31471;&#38477;&#32423;&#21040;2.5.4&#65292;&#24182;&#20445;&#25345;2.6.0&#30340;&#21151;&#33021;&#65292;&#22240;&#20026;&#19968;&#20123;&#21151;&#33021;&#26159;2.6.0&#26032;&#22686;&#30340;&#12290;</p><p>&#36825;&#20063;&#26159;&#24494;&#23567;&#29256;&#26412;&#20027;&#35201;&#29992;&#20110;bug&#20462;&#27491;&#30340;&#21407;&#22240;&#12290;&#19968;&#23450;&#35201;&#20445;&#25345;&#21452;&#21521;&#30340;&#20860;&#23481;&#24615;&#65306;&#22914;&#26524;&#20320;&#20174;2.5.3&#21319;&#32423;&#21040;2.5.4&#65292;&#28982;&#21518;&#25913;&#21464;&#20027;&#24847;&#38477;&#32423;&#21040;2.5.3&#20063;&#19981;&#20250;&#26377;&#20219;&#20309;&#21151;&#33021;&#25439;&#22833;&#12290;&#24403;&#28982;&#65292;2.5.4&#20013;&#20462;&#27491;&#30340;bug&#20250;&#20877;&#27425;&#20986;&#29616;&#65292;&#20294;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#26032;&#29305;&#24615;&#65292;&#21482;&#26159;bug&#21487;&#33021;&#20250;&#22952;&#30861;&#29616;&#26377;&#29305;&#24615;&#30340;&#20351;&#29992;&#12290;</p><p>&#23458;&#25143;&#31471;/&#26381;&#21153;&#22120;&#21327;&#35758;&#20165;&#20165;&#26159;&#35768;&#22810;&#21487;&#33021;&#30340;&#20860;&#23481;&#24615;&#39046;&#22495;&#30340;&#19968;&#31181;&#24773;&#20917;&#12290;&#21478;&#19968;&#31181;&#26159;&#25968;&#25454;&#26684;&#24335;&#65306;&#36719;&#20214;&#20250;&#23558;&#25968;&#25454;&#20889;&#20837;&#27704;&#20037;&#23384;&#20648;&#21527;&#65311;&#22914;&#26524;&#26159;&#65292;&#21017;&#25968;&#25454;&#30340;&#20889;&#20837;&#21644;&#35835;&#21462;&#24517;&#39035;&#20381;&#29031;&#21457;&#24067;&#21495;&#30721;&#25919;&#31574;&#25152;&#25215;&#35834;&#30340;&#20860;&#23481;&#24615;&#26041;&#38024;&#12290;&#29256;&#26412;2.6.0&#38656;&#35201;&#33021;&#22815;&#35835;&#21462;2.5.4&#20889;&#30340;&#25991;&#20214;&#65292;&#20294;&#26159;&#21487;&#33021;&#20250;&#26263;&#33258;&#23558;&#26684;&#24335;&#21319;&#32423;&#21040;2.5.4&#26080;&#27861;&#38405;&#35835;&#30340;&#26032;&#26684;&#24335;&#65292;&#22240;&#20026;&#36328;&#27425;&#35201;&#29256;&#26412;&#36793;&#30028;&#30340;&#26080;&#38656;&#26377;&#38477;&#32423;&#30340;&#33021;&#21147;&#12290;&#22914;&#26524;&#20854;&#20182;&#31243;&#24207;&#20351;&#29992;&#20320;&#30340;&#39033;&#30446;&#21457;&#24067;&#30340;&#20195;&#30721;&#24211;&#65292;&#21017;API&#20063;&#26159;&#38656;&#35201;&#32771;&#34385;&#30340;&#20860;&#23481;&#24615;&#39046;&#22495;&#65306;&#20320;&#24517;&#39035;&#30830;&#20445;&#26126;&#30830;&#35828;&#26126;&#28304;&#20195;&#30721;&#21644;&#20108;&#36827;&#21046;&#20860;&#23481;&#24615;&#35268;&#21017;&#65292;&#29992;&#25143;&#26080;&#38656;&#25285;&#24515;&#30452;&#25509;&#21319;&#32423;&#26159;&#21542;&#23433;&#20840;&#12290;&#22905;&#24212;&#24403;&#21487;&#20197;&#36890;&#36807;&#29256;&#26412;&#21495;&#30721;&#31435;&#21051;&#30693;&#36947;&#32467;&#26524;&#12290;</p><p>&#22312;&#36825;&#20010;&#31995;&#32479;&#20013;&#65292;&#21482;&#26377;&#22686;&#21152;&#20027;&#29256;&#26412;&#21495;&#30721;&#26102;&#20320;&#25165;&#33021;&#20174;&#22836;&#24320;&#22987;&#12290;&#36825;&#30830;&#23454;&#26377;&#20123;&#19981;&#20415;&#65306;&#20063;&#35768;&#20320;&#20250;&#24076;&#26395;&#22686;&#21152;&#26576;&#20123;&#29305;&#24615;&#65292;&#24076;&#26395;&#37325;&#26032;&#35774;&#35745;&#21327;&#35758;&#65292;&#20294;&#26159;&#20026;&#20102;&#32500;&#25252;&#20860;&#23481;&#24615;&#32780;&#26080;&#27861;&#23454;&#29616;&#12290;&#36825;&#20010;&#38382;&#39064;&#27809;&#26377;&#39764;&#27861;&#35299;&#20915;&#26041;&#26696;&#65292;&#38500;&#38750;&#20320;&#33021;&#22312;&#19968;&#24320;&#22987;&#23601;&#20197;&#21487;&#25193;&#23637;&#30340;&#26041;&#24335;&#36827;&#34892;&#35774;&#35745;&#65288;&#20540;&#24471;&#29992;&#21333;&#29420;&#19968;&#26412;&#20070;&#35752;&#35770;&#30340;&#20027;&#39064;&#65292;&#24403;&#28982;&#36229;&#20986;&#20102;&#26412;&#20070;&#30340;&#33539;&#22260;&#65289;&#12290;&#20294;&#26159;&#36890;&#36807;&#20844;&#24067;&#21457;&#24067;&#20860;&#23481;&#24615;&#25919;&#31574;&#65292;&#24182;&#36981;&#23432;&#23427;&#65292;&#26159;&#21457;&#24067;&#36719;&#20214;&#19981;&#33021;&#22238;&#36991;&#30340;&#19968;&#37096;&#20998;&#12290;&#26576;&#20010;&#20302;&#21155;&#30340;&#24778;&#22855;&#21482;&#20250;&#30095;&#36828;&#35768;&#22810;&#29992;&#25143;&#12290;&#21018;&#21018;&#25551;&#36848;&#30340;&#25919;&#31574;&#33021;&#36215;&#21040;&#30340;&#20316;&#29992;&#26377;&#38480;&#65292;&#22240;&#20026;&#23427;&#24050;&#32463;&#24191;&#27867;&#20256;&#25773;&#65292;&#20294;&#26159;&#22240;&#20026;&#23427;&#26131;&#20110;&#35299;&#37322;&#21644;&#35760;&#24518;&#65292;&#25152;&#20197;&#19981;&#29087;&#24713;&#30340;&#20154;&#20063;&#21487;&#20197;&#24456;&#24555;&#25509;&#21463;&#12290;</p><p>&#20063;&#38656;&#35201;&#30693;&#36947;&#19978;&#36848;&#35268;&#21017;&#24182;&#19981;&#36866;&#29992;&#20110;pre-1.0&#30340;&#29256;&#26412;&#65288;&#23613;&#31649;&#24744;&#30340;&#21457;&#24067;&#25919;&#31574;&#24212;&#24403;&#26126;&#30830;&#38472;&#36848;&#65292;&#21482;&#26159;&#35201;&#35828;&#28165;&#26970;&#65289;&#12290;&#19968;&#20010;&#36824;&#22788;&#20110;&#21021;&#22987;&#21457;&#24067;&#29366;&#24577;&#30340;&#24320;&#21457;&#21487;&#20197;&#21457;&#24067;0.1&#12289;0.2&#12289;0.3&#20197;&#21450;&#20381;&#27425;&#30340;&#21518;&#32493;&#29256;&#26412;&#65292;&#30452;&#21040;1.0&#65292;&#36825;&#20123;&#21457;&#24067;&#20043;&#38388;&#30340;&#21306;&#21035;&#21487;&#20197;&#20219;&#24847;&#22823;&#12290;pre-1.0&#29256;&#26412;&#30340;&#24494;&#23567;&#29256;&#26412;&#21495;&#21487;&#20197;&#30465;&#30053;&#12290;&#21462;&#20915;&#20110;&#39033;&#30446;&#30340;&#29305;&#24615;&#21644;&#29256;&#26412;&#30340;&#21306;&#21035;&#65292;&#20320;&#25110;&#35768;&#20250;&#21457;&#29616;0.1.0&#12289;0.1.1&#20063;&#24456;&#26377;&#25928;&#12290;pre-1.0&#30340;&#29256;&#26412;&#21495;&#30721;&#35268;&#21017;&#36890;&#24120;&#27604;&#36739;&#26494;&#25955;&#65292;&#20027;&#35201;&#26159;&#22240;&#20026;&#20154;&#20204;&#26126;&#30333;&#22312;&#39033;&#30446;&#21021;&#26399;&#65292;&#36739;&#24378;&#30340;&#20860;&#23481;&#24615;&#38480;&#21046;&#20250;&#20005;&#37325;&#38459;&#30861;&#24320;&#21457;&#65292;&#32780;&#19988;&#36739;&#26089;&#30340;&#20351;&#29992;&#32773;&#20063;&#36739;&#33021;&#22815;&#23481;&#24525;&#36825;&#31181;&#21464;&#21270;&#12290;</p><p>&#35831;&#29282;&#35760;&#25152;&#26377;&#36825;&#20123;&#25351;&#20196;&#20165;&#36866;&#29992;&#20110;&#19977;&#37096;&#20998;&#31995;&#32479;&#12290;&#20320;&#30340;&#39033;&#30446;&#21487;&#20197;&#36731;&#26131;&#30340;&#24471;&#21040;&#19981;&#21516;&#30340;&#19977;&#37096;&#20998;&#31995;&#32479;&#65292;&#29978;&#33267;&#21487;&#20197;&#20915;&#23450;&#19981;&#20351;&#29992;&#36825;&#20040;&#32454;&#33268;&#30340;&#31890;&#24230;&#65292;&#32780;&#20165;&#20165;&#20351;&#29992;&#20004;&#37096;&#20998;&#31995;&#32479;&#12290;&#37325;&#35201;&#30340;&#26159;&#35201;&#23613;&#26089;&#20915;&#23450;&#65292;&#20165;&#25353;&#29031;&#27599;&#20010;&#37096;&#20998;&#30340;&#21547;&#20041;&#21457;&#24067;&#65292;&#24182;&#22362;&#25345;&#19979;&#21435;&#12290;</p></div><div class="sect2" title="&#22855;&#20598;&#25968;&#31574;&#30053;"><div class="titlepage"><div><div><h3 class="title"><a name="release-number-even-odd-strategy"></a>&#22855;&#20598;&#25968;&#31574;&#30053;</h3></div></div></div><p>&#19968;&#20123;&#39033;&#30446;&#20351;&#29992;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#37096;&#20998;&#34920;&#31034;&#39033;&#30446;&#30340;&#31283;&#23450;&#31243;&#24230;&#65306;&#20598;&#25968;&#34920;&#31034;&#31283;&#23450;&#65292;&#22855;&#25968;&#34920;&#31034;&#19981;&#31283;&#23450;&#12290;&#20165;&#36866;&#29992;&#20110;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#65292;&#19981;&#33021;&#29992;&#20110;&#20027;&#29256;&#26412;&#21495;&#30721;&#21644;&#24494;&#23567;&#29256;&#26412;&#21495;&#30721;&#12290;&#24494;&#23567;&#29256;&#26412;&#21495;&#30721;&#20381;&#28982;&#34920;&#31034;bug&#20462;&#27491;&#65288;&#27809;&#26377;&#26032;&#29305;&#24615;&#65289;&#65292;&#20027;&#29256;&#26412;&#21495;&#30721;&#30340;&#36882;&#22686;&#20381;&#28982;&#34920;&#31034;&#37325;&#22823;&#21464;&#26356;&#65292;&#26032;&#29305;&#24615;&#38598;&#21512;&#12290;</p><p>&#22855;&#20598;&#31995;&#32479;&#20248;&#21183;&#22312;&#20110;&#23427;&#24050;&#32463;&#34987;Linux&#20869;&#26680;&#39033;&#30446;&#20351;&#29992;&#65292;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#26041;&#27861;&#65292;&#21487;&#20197;&#21457;&#24067;&#26032;&#21151;&#33021;&#29992;&#20110;&#27979;&#35797;&#65292;&#32780;&#26080;&#38656;&#35753;&#20135;&#21697;&#29992;&#25143;&#21463;&#21040;&#28508;&#22312;&#19981;&#31283;&#23450;&#20195;&#30721;&#30340;&#24433;&#21709;&#12290;&#20154;&#20204;&#22312;&#30475;&#21040;&#8220;2.4.21&#8221;&#26102;&#21487;&#20197;&#35748;&#20026;&#33021;&#22815;&#29992;&#20110;&#20182;&#20204;&#20351;&#29992;&#30340;web&#26381;&#21153;&#22120;&#65292;&#20294;&#24403;&#30475;&#21040;&#8220;2.5.1&#8221;&#26102;&#65292;&#21017;&#21487;&#20197;&#29992;&#20110;&#23478;&#29992;&#24037;&#20316;&#31449;&#30340;&#23454;&#39564;&#20013;&#12290;&#24320;&#21457;&#22242;&#38431;&#25484;&#25569;&#20102;&#26469;&#33258;&#19981;&#31283;&#23450;&#65288;&#22855;&#25968;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#65289;&#31995;&#21015;&#30340;bug&#25253;&#21578;&#65292;&#24403;&#22312;&#35813;&#31995;&#21015;&#30340;&#19968;&#20123;&#24494;&#23567;&#29256;&#26412;&#20013;&#23436;&#25104;&#20102;&#35768;&#22810;&#24037;&#20316;&#21518;&#65292;&#20182;&#20204;&#20415;&#22686;&#21152;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#65288;&#21464;&#25104;&#20598;&#25968;&#65289;&#65292;&#23558;&#24494;&#23567;&#29256;&#26412;&#21495;&#30721;&#24674;&#22797;&#21040;&#8220;0&#8221;&#65292;&#24182;&#21457;&#24067;&#25512;&#23450;&#30340;&#31283;&#23450;&#21253;&#12290;</p><p>&#36825;&#20010;&#31995;&#32479;&#20445;&#30041;&#20102;&#21069;&#38754;&#32473;&#23450;&#30340;&#20860;&#23481;&#24615;&#25919;&#31574;&#65292;&#25110;&#33267;&#23569;&#27809;&#26377;&#21457;&#29983;&#20914;&#31361;&#12290;&#20165;&#20165;&#26159;&#22312;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#19978;&#37325;&#36733;&#20102;&#19968;&#20123;&#39069;&#22806;&#30340;&#20449;&#24687;&#12290;&#20165;&#20165;&#26159;&#35753;&#38656;&#35201;&#30340;&#20154;&#27599;&#27425;&#38656;&#35201;&#22686;&#21152;&#20004;&#20010;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#65292;&#24182;&#27809;&#26377;&#37325;&#22823;&#30340;&#25439;&#23475;&#12290;&#22855;&#20598;&#31995;&#32479;&#36890;&#24120;&#26368;&#36866;&#21512;&#29992;&#20110;&#25317;&#26377;&#36739;&#38271;&#21457;&#24067;&#21608;&#26399;&#30340;&#39033;&#30446;&#65292;&#20197;&#21450;&#22240;&#20026;&#26412;&#24615;&#19978;&#23601;&#38656;&#35201;&#36739;&#39640;&#27604;&#20363;&#30340;&#20445;&#30041;&#29992;&#25143;&#33021;&#20026;&#26032;&#29305;&#24615;&#35780;&#20272;&#31283;&#23450;&#24615;&#30340;&#39033;&#30446;&#12290;&#24403;&#28982;&#36825;&#19981;&#26159;&#35753;&#26032;&#21151;&#33021;&#24471;&#20197;&#27979;&#35797;&#30340;&#21807;&#19968;&#26041;&#27861;&#65292;<span>&#26412;&#31456;&#21518;&#38754;&#30340;&#31456;&#33410;</span><a class="xref" href="stabilizing-a-release.html" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;">the section called &#8220;&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;&#8221;</a>&#25551;&#36848;&#20102;&#21478;&#19968;&#20010;&#26041;&#27861;&#65292;&#20063;&#26159;&#26356;&#24120;&#35265;&#30340;&#20844;&#24067;&#19981;&#31283;&#23450;&#20195;&#30721;&#30340;&#26041;&#27861;&#65292;&#30452;&#25509;&#36890;&#36807;&#21457;&#24067;&#21517;&#31216;&#30340;&#26631;&#35782;&#35753;&#20154;&#20204;&#30693;&#26195;&#39118;&#38505;/&#25910;&#30410;&#30340;&#20195;&#20215;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="publicity.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="release-branches.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20844;&#24320;&#24615; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#21457;&#24067;&#20998;&#25903;</td></tr></table></div></body></html>
