<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21050;&#20799;&#22836;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="communications.html" title="Chapter 6. &#20132;&#27969;"><link rel="prev" href="common-pitfalls.html" title="&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449;"><link rel="next" href="growth.html" title="&#22788;&#29702;&#25104;&#38271;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21050;&#20799;&#22836;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="common-pitfalls.html">Prev</a> </td><th width="60%" align="center">Chapter 6. &#20132;&#27969;</th><td width="20%" align="right"> <a accesskey="n" href="growth.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#21050;&#20799;&#22836;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="difficult-people"></a>&#21050;&#20799;&#22836;</h2></div></div></div><p>&#22312;&#30005;&#23376;&#35770;&#22363;&#23545;&#20184;&#21050;&#20799;&#22836;&#24182;&#19981;&#27604;&#22312;&#29616;&#23454;&#20013;&#23481;&#26131;&#12290;&#36825;&#37324;&#8220;&#21050;&#8221;&#19981;&#26159;&#8220;&#26080;&#31036;&#8221;&#12290;&#26080;&#31036;&#30340;&#20154;&#24456;&#35752;&#21388;&#65292;&#20294;&#19981;&#19968;&#23450;&#38590;&#23545;&#20184;&#12290;&#26412;&#20070;&#24050;&#32463;&#20171;&#32461;&#20102;&#22914;&#20309;&#22788;&#29702;&#20182;&#20204;&#65306;&#22312;&#31532;&#19968;&#26102;&#38388;&#22238;&#22797;&#26080;&#31036;&#34892;&#20026;&#65292;&#20043;&#21518;&#65292;&#36873;&#25321;&#24573;&#30053;&#20182;&#20204;&#25110;&#32773;&#21516;&#20854;&#20182;&#20154;&#19968;&#26679;&#23545;&#24453;&#20182;&#20204;&#12290;&#22914;&#26524;&#20182;&#20204;&#32487;&#32493;&#26080;&#31036;&#65292;&#20182;&#20204;&#20250;&#35753;&#33258;&#24049;&#26356;&#21152;&#19981;&#21463;&#27426;&#36814;&#65292;&#24182;&#22312;&#39033;&#30446;&#20013;&#27627;&#26080;&#24433;&#21709;&#21147;&#65292;&#25152;&#20197;&#36825;&#26159;&#20182;&#20204;&#33258;&#24049;&#30340;&#38382;&#39064;&#12290;</p><p>&#30495;&#27491;&#30340;&#38382;&#39064;&#19981;&#26159;&#23436;&#20840;&#26080;&#31036;&#30340;&#20154;&#65292;&#32780;&#26159;&#37027;&#20123;&#25805;&#24324;&#25110;&#28389;&#29992;&#39033;&#30446;&#36827;&#31243;&#65292;&#28040;&#32791;&#20182;&#20154;&#26102;&#38388;&#21644;&#33021;&#37327;&#65292;&#32780;&#19981;&#20250;&#20026;&#39033;&#30446;&#24102;&#26469;&#20219;&#20309;&#21033;&#30410;&#30340;&#20154;&#12290;&#36825;&#20123;&#20154;&#32463;&#24120;&#20250;&#23547;&#25214;&#39033;&#30446;&#35268;&#31243;&#20013;&#30340;&#26964;&#28857;&#65292;&#32780;&#37322;&#25918;&#22312;&#20854;&#20182;&#22320;&#26041;&#26080;&#27861;&#33719;&#24471;&#30340;&#24433;&#21709;&#21147;&#12290;&#36825;&#27604;&#21333;&#32431;&#30340;&#26080;&#31036;&#26356;&#21152;&#29409;&#29502;&#65292;&#22240;&#20026;&#20854;&#23548;&#33268;&#30340;&#34892;&#20026;&#25110;&#25439;&#23475;&#37117;&#19981;&#26159;&#38543;&#24847;&#30340;&#35266;&#23519;&#32773;&#33021;&#22815;&#21457;&#29616;&#30340;&#12290;&#19968;&#20010;&#32463;&#20856;&#30340;&#26696;&#20363;&#26159;filibuster&#65292;&#26576;&#20154;&#20250;&#19968;&#30452;&#22768;&#31216;&#35752;&#35770;&#30340;&#20107;&#24773;&#36824;&#27809;&#26377;&#20934;&#22791;&#22909;&#35299;&#20915;&#65292;&#24182;&#19968;&#30452;&#25552;&#20379;&#26356;&#22810;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20197;&#21450;&#23545;&#26087;&#26041;&#26696;&#30340;&#26032;&#35270;&#28857;&#65292;&#32780;&#23454;&#38469;&#19978;&#26159;&#20182;&#24863;&#21040;&#20250;&#36798;&#25104;&#20849;&#35782;&#25110;&#25237;&#31080;&#65292;&#32780;&#20182;&#21487;&#33021;&#26080;&#27861;&#20445;&#25345;&#39046;&#20808;&#12290;&#21478;&#19968;&#20010;&#20363;&#23376;&#26159;&#24403;&#19968;&#20010;&#36777;&#35770;&#26080;&#27861;&#36798;&#25104;&#19968;&#33268;&#65292;&#20294;&#26159;&#22242;&#38431;&#23581;&#35797;&#33267;&#23569;&#29702;&#28165;&#24322;&#35758;&#24182;&#20026;&#25152;&#26377;&#20154;&#21046;&#20316;&#19968;&#20221;&#20197;&#21518;&#21487;&#20197;&#21442;&#32771;&#30340;&#24635;&#32467;&#26102;&#12290;&#33988;&#24847;&#38459;&#25376;&#32773;&#30693;&#36947;&#24635;&#32467;&#20250;&#23548;&#21521;&#20182;&#19981;&#26399;&#26395;&#30340;&#32467;&#26524;&#65292;&#25152;&#20197;&#20250;&#36890;&#36807;&#21453;&#23545;&#21512;&#29702;&#30340;&#24314;&#35758;&#25110;&#24341;&#20837;&#24847;&#26009;&#20043;&#22806;&#30340;&#26032;&#26465;&#30446;&#26469;&#22840;&#22823;&#38382;&#39064;&#30340;&#22797;&#26434;&#24615;&#65292;&#35797;&#22270;&#24310;&#36831;&#24635;&#32467;&#12290;</p><div class="sect2" title="&#22788;&#29702;&#21050;&#20799;&#22836;"><div class="titlepage"><div><div><h3 class="title"><a name="handling-difficult-people"></a>&#22788;&#29702;&#21050;&#20799;&#22836;</h3></div></div></div><p>&#20026;&#20102;&#20013;&#21644;&#36825;&#31181;&#34892;&#20026;&#65292;&#25105;&#20204;&#38656;&#35201;&#29702;&#35299;&#20174;&#20107;&#36825;&#31181;&#34892;&#20026;&#30340;&#24515;&#29702;&#12290;&#20154;&#20204;&#24182;&#19981;&#26159;&#26377;&#24847;&#35782;&#30340;&#36825;&#26679;&#20570;&#12290;&#27809;&#26377;&#20154;&#20250;&#22312;&#26089;&#26216;&#36215;&#24202;&#24182;&#23545;&#33258;&#24049;&#35828;&#65306;&#8220;&#20170;&#22825;&#65292;&#25105;&#20250;&#22788;&#29702;&#35268;&#31243;&#34920;&#21333;&#65292;&#20174;&#32780;&#25104;&#20026;&#24700;&#20154;&#30340;&#33988;&#24847;&#38459;&#25376;&#32773;&#12290;&#8221;&#30456;&#21453;&#65292;&#36825;&#31181;&#34892;&#20026;&#32463;&#24120;&#26159;&#20986;&#20110;&#24076;&#26395;&#22312;&#39033;&#30446;&#20114;&#21160;&#21644;&#20915;&#31574;&#20013;&#21457;&#34920;&#24847;&#35265;&#30340;&#21322;&#20559;&#25191;&#30340;&#24773;&#32490;&#12290;&#26377;&#20123;&#20154;&#24863;&#35273;&#33258;&#24049;&#27809;&#26377;&#34987;&#37325;&#35270;&#65292;&#25110;&#32773;&#65288;&#26356;&#20005;&#37325;&#30340;&#24773;&#20917;&#65289;&#35748;&#20026;&#23384;&#22312;&#19968;&#20010;&#38024;&#23545;&#33258;&#24049;&#30340;&#38452;&#35851;&#38598;&#22242;&#8212;&#20854;&#20182;&#39033;&#30446;&#25104;&#21592;&#20915;&#23450;&#25104;&#31435;&#19968;&#20010;&#25490;&#20182;&#30340;&#20465;&#20048;&#37096;&#65292;&#32780;&#20182;&#19981;&#26159;&#20854;&#25104;&#21592;&#12290;&#28982;&#21518;&#20316;&#20026;&#36777;&#25252;&#65292;&#22312;&#20182;&#30340;&#24605;&#24819;&#20013;&#65292;&#35748;&#20026;&#25353;&#29031;&#23383;&#38754;&#24847;&#24605;&#36981;&#24490;&#39033;&#30446;&#30340;&#35268;&#21017;&#65292;&#24182;&#21442;&#19982;&#21040;&#39033;&#30446;&#35268;&#31243;&#30340;&#27491;&#24335;&#22788;&#29702;&#20013;&#65292;&#20174;&#32780;&#35753;&#25152;&#26377;&#20854;&#20182;&#30340;&#20154;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#37325;&#35270;&#20182;&#12290;&#22312;&#26497;&#31471;&#30340;&#20363;&#23376;&#20013;&#65292;&#26576;&#20123;&#20154;&#29978;&#33267;&#20250;&#35748;&#20026;&#33258;&#24049;&#27491;&#22312;&#20026;&#25327;&#25937;&#39033;&#30446;&#32780;&#23396;&#20891;&#22859;&#25112;&#12290;</p><p>&#19981;&#26159;&#25152;&#26377;&#30340;&#20154;&#22312;&#21516;&#19968;&#26102;&#38388;&#21487;&#20197;&#30475;&#21040;&#36825;&#31181;&#25915;&#20987;&#65292;&#26576;&#20123;&#20154;&#21487;&#33021;&#20250;&#23436;&#20840;&#30475;&#19981;&#21040;&#65292;&#38500;&#38750;&#25552;&#20379;&#20102;&#24378;&#26377;&#21147;&#30340;&#35777;&#25454;&#12290;&#36825;&#24847;&#21619;&#30528;&#20013;&#21644;&#23427;&#38656;&#35201;&#22823;&#37327;&#30340;&#24037;&#20316;&#12290;&#35828;&#26381;&#33258;&#24049;&#23427;&#30340;&#21457;&#29983;&#24182;&#19981;&#36275;&#22815;&#65307;&#20320;&#20063;&#38656;&#35201;&#37197;&#32622;&#36275;&#22815;&#30340;&#35777;&#25454;&#35828;&#26381;&#20182;&#20154;&#65292;&#24182;&#20351;&#29992;&#32771;&#34385;&#21608;&#21040;&#30340;&#26041;&#27861;&#20998;&#21457;&#36825;&#20123;&#35777;&#25454;&#12290;</p><p>&#32771;&#34385;&#21040;&#26377;&#22823;&#37327;&#30340;&#24037;&#20316;&#65292;&#26368;&#22909;&#19981;&#35201;&#23481;&#24525;&#22826;&#38271;&#26102;&#38388;&#12290;&#32771;&#34385;&#21040;&#23427;&#30340;&#23492;&#29983;&#24615;&#65292;&#20294;&#21482;&#26159;&#28201;&#21644;&#30340;&#30142;&#30149;&#65306;&#24863;&#26579;&#26102;&#24182;&#19981;&#20250;&#23545;&#39033;&#30446;&#36896;&#25104;&#36807;&#22823;&#30340;&#25439;&#23475;&#65292;&#33647;&#29289;&#21453;&#32780;&#21487;&#33021;&#26377;&#20005;&#37325;&#30340;&#21103;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#25439;&#23475;&#21464;&#24471;&#26080;&#27861;&#23481;&#24525;&#65292;&#23601;&#24212;&#35813;&#37319;&#21462;&#34892;&#21160;&#12290;&#20174;&#25910;&#38598;&#35265;&#21040;&#30340;&#27169;&#24335;&#30340;&#35760;&#24405;&#24320;&#22987;&#12290;&#30830;&#20445;&#21253;&#21547;&#23545;&#20844;&#20849;&#24402;&#26723;&#30340;&#24341;&#29992;&#8212;&#36825;&#26159;&#39033;&#30446;&#20445;&#30041;&#36825;&#20123;&#35760;&#24405;&#30340;&#21407;&#22240;&#65292;&#25152;&#20197;&#20320;&#20063;&#21487;&#20197;&#21033;&#29992;&#23427;&#20204;&#12290;&#19968;&#26086;&#24314;&#31435;&#20102;&#22909;&#30340;&#26696;&#20363;&#65292;&#24320;&#22987;&#19982;&#20854;&#20182;&#21442;&#19982;&#32773;&#30340;&#31169;&#19979;&#23545;&#35805;&#12290;&#19981;&#35201;&#21578;&#35785;&#20182;&#20204;&#20320;&#25152;&#35266;&#23519;&#30340;&#65307;&#30456;&#21453;&#65292;&#39318;&#20808;&#35201;&#35810;&#38382;&#20182;&#20204;&#25152;&#35266;&#23519;&#30340;&#12290;&#36825;&#24656;&#24597;&#26159;&#20320;&#26368;&#21518;&#19968;&#27425;&#25910;&#38598;&#20182;&#20154;&#23545;&#20110;&#40635;&#28902;&#21046;&#36896;&#32773;&#34892;&#20026;&#26410;&#36807;&#28388;&#21453;&#39304;&#30340;&#26426;&#20250;&#65307;&#19968;&#26086;&#20320;&#24320;&#22987;&#23545;&#27492;&#20107;&#30340;&#20844;&#24320;&#35752;&#35770;&#65292;&#24847;&#35265;&#23601;&#20250;&#20998;&#21270;&#65292;&#27809;&#20154;&#20250;&#35760;&#24471;&#36807;&#21435;&#23545;&#20110;&#27492;&#20107;&#30340;&#24819;&#27861;&#12290;</p><p>&#22914;&#26524;&#31169;&#19979;&#35752;&#35770;&#34920;&#26126;&#33267;&#23569;&#26377;&#20854;&#20182;&#20154;&#20063;&#21457;&#29616;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#21017;&#26159;&#26102;&#20505;&#34892;&#21160;&#20102;&#12290;&#20320;&#24212;&#24403;<span class="emphasis"><em>&#21313;&#20998;</em></span>&#23567;&#24515;&#65292;&#22240;&#20026;&#24456;&#23481;&#26131;&#32473;&#36825;&#20123;&#20154;&#26426;&#20250;&#35753;&#20320;&#26174;&#24471;&#23545;&#20182;&#20204;&#19981;&#22815;&#20844;&#24179;&#12290;&#26080;&#35770;&#20320;&#20570;&#20160;&#20040;&#65292;&#19981;&#35201;&#25351;&#25511;&#20182;&#20204;&#22240;&#20026;&#20559;&#25191;&#29378;&#24694;&#24847;&#28389;&#29992;&#39033;&#30446;&#30340;&#35268;&#31243;&#65292;&#25110;&#32773;&#20219;&#20309;&#20320;&#24576;&#30097;&#20182;&#20204;&#30340;&#20107;&#24773;&#12290;&#20320;&#30340;&#31574;&#30053;&#26159;&#24517;&#39035;&#20445;&#25345;&#21512;&#29702;&#24615;&#21644;&#23545;&#20110;&#39033;&#30446;&#25972;&#20307;&#21033;&#30410;&#32771;&#34385;&#65292;&#20197;&#25913;&#33391;&#20010;&#20154;&#30340;&#34892;&#20026;&#25110;&#20351;&#20043;&#31163;&#24320;&#20316;&#20026;&#30446;&#26631;&#12290;&#21462;&#20915;&#20110;&#20854;&#20182;&#24320;&#21457;&#32773;&#65292;&#20197;&#21450;&#20320;&#19982;&#20182;&#20204;&#30340;&#20851;&#31995;&#65292;&#39318;&#20808;&#22312;&#31169;&#19979;&#37324;&#33719;&#21462;&#21516;&#30431;&#32773;&#26159;&#19968;&#20010;&#20248;&#21183;&#12290;&#25110;&#32773;&#22914;&#26524;&#19981;&#26159;&#65307;&#21017;&#21482;&#33021;&#20250;&#26263;&#20013;&#30340;&#30772;&#22351;&#65292;&#22914;&#26524;&#20154;&#20204;&#35748;&#20026;&#20320;&#27491;&#22312;&#20174;&#20107;&#19968;&#39033;&#19981;&#24403;&#30340;&#25919;&#27835;&#35837;&#35876;&#27963;&#21160;&#12290;</p><p>&#35201;&#29282;&#35760;&#65292;&#23613;&#31649;&#26159;&#21478;&#22806;&#19968;&#20010;&#20154;&#20855;&#26377;&#30772;&#22351;&#24615;&#65292;&#20294;&#22914;&#26524;&#20320;&#19981;&#33021;&#25903;&#25345;&#20320;&#30340;&#20844;&#24320;&#25351;&#25511;&#65292;&#37027;&#20040;<span class="emphasis"><em>&#20320;</em></span>&#23601;&#20250;&#30475;&#36215;&#26469;&#26159;&#37027;&#20010;&#30772;&#22351;&#32773;&#12290;&#35831;&#30830;&#20445;&#20320;&#25317;&#26377;&#36275;&#22815;&#22810;&#30340;&#23454;&#20363;&#26469;&#25551;&#36848;&#20320;&#25152;&#35828;&#30340;&#65292;&#24182;&#22312;&#30452;&#25509;&#35828;&#20986;&#30340;&#24773;&#20917;&#19979;&#23613;&#21487;&#33021;&#30340;&#20445;&#25345;&#31036;&#35980;&#12290;&#20320;&#21487;&#33021;&#26080;&#27861;&#35828;&#26381;&#26377;&#38382;&#39064;&#30340;&#20154;&#65292;&#20294;&#21482;&#35201;&#33021;&#35828;&#26381;&#25152;&#26377;&#20854;&#20182;&#20154;&#23601;&#36275;&#22815;&#20102;&#12290;</p></div><div class="sect2" title="&#26696;&#20363;&#23398;&#20064;"><div class="titlepage"><div><div><h3 class="title"><a name="difficult-people-case-study"></a>&#26696;&#20363;&#23398;&#20064;</h3></div></div></div><p>&#25105;&#21482;&#35760;&#24471;&#19968;&#27425;&#65292;&#22312;10&#24180;&#30340;&#33258;&#30001;&#36719;&#20214;&#24037;&#20316;&#20013;&#65292;&#20107;&#24773;&#21464;&#24471;&#22826;&#22351;&#65292;&#20197;&#33267;&#20110;&#25105;&#20204;&#24517;&#39035;&#35201;&#27714;&#26576;&#20154;&#20572;&#27490;&#21457;&#24067;&#25991;&#31456;&#12290;&#26356;&#24120;&#35265;&#30340;&#24773;&#20917;&#26159;&#65292;&#20182;&#24182;&#19981;&#26159;&#26080;&#31036;&#65292;&#21482;&#26159;&#24076;&#26395;&#26356;&#26377;&#30410;&#12290;&#20182;&#21482;&#26159;&#19981;&#30693;&#36947;&#20309;&#26102;&#21457;&#24067;&#20309;&#26102;&#19981;&#21457;&#24067;&#12290;&#25105;&#20204;&#30340;&#37038;&#20214;&#21015;&#34920;&#23545;&#20844;&#20247;&#20844;&#24320;&#65292;&#20294;&#26159;&#20182;&#21457;&#24067;&#30340;&#22826;&#39057;&#32321;&#65292;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#20027;&#39064;&#20013;&#25552;&#20986;&#38382;&#39064;&#65292;&#25104;&#20026;&#20102;&#31038;&#21306;&#30340;&#22122;&#38899;&#38382;&#39064;&#12290;&#25105;&#20204;&#24050;&#32463;&#21644;&#34108;&#30340;&#21578;&#35785;&#20182;&#22312;&#21457;&#34920;&#25991;&#31456;&#21069;&#23545;&#25991;&#31456;&#22810;&#20570;&#19968;&#28857;&#30740;&#31350;&#65292;&#20294;&#26159;&#27809;&#26377;&#25928;&#26524;&#12290;</p><p>&#26368;&#32456;&#26377;&#25928;&#30340;&#31574;&#30053;&#26159;&#22914;&#20309;&#26681;&#25454;&#20013;&#31435;&#12289;&#23450;&#37327;&#30340;&#25968;&#25454;&#26500;&#24314;&#24378;&#22823;&#26696;&#20363;&#30340;&#23436;&#32654;&#26696;&#20363;&#12290;&#25105;&#20204;&#30340;&#19968;&#20010;&#24320;&#21457;&#32773;&#30740;&#31350;&#20102;&#19968;&#20123;&#24402;&#26723;&#65292;&#28982;&#21518;&#23558;&#22914;&#19979;&#20449;&#24687;&#31169;&#19979;&#21457;&#36865;&#32473;&#20102;&#19968;&#20123;&#24320;&#21457;&#32773;&#12290;&#20882;&#29359;&#32773;&#65288;&#22312;&#21015;&#34920;&#20013;&#30340;&#22995;&#26174;&#31034;&#20026;&#8220;J. Random&#8221;&#65289;&#22312;&#39033;&#30446;&#20013;&#30340;&#21382;&#21490;&#19981;&#22810;&#65292;&#27809;&#26377;&#36129;&#29486;&#20219;&#20309;&#20195;&#30721;&#25110;&#25991;&#26723;&#12290;&#28982;&#32780;&#20182;&#26159;&#37038;&#20214;&#21015;&#34920;&#20013;&#31532;3&#27963;&#36291;&#30340;&#29992;&#25143;&#65306;</p><pre class="screen">
From: "Brian W. Fitzpatrick" &lt;fitz@collab.net&gt;
To: [... recipient list omitted for anonymity ...]
Subject: The Subversion Energy Sink
Date: Wed, 12 Nov 2003 23:37:47 -0600

In the last 25 days, the top 6 posters to the svn [dev|users] list have
been:

    294  kfogel@collab.net
    236  "C. Michael Pilato" &lt;cmpilato@collab.net&gt;
    220  "J. Random" &lt;jrandom@problematic-poster.com&gt;
    176  Branko &#268;ibej &lt;brane@xbc.nu&gt;
    130  Philip Martin &lt;philip@codematters.co.uk&gt;
    126  Ben Collins-Sussman &lt;sussman@collab.net&gt;

&#25105;&#21487;&#20197;&#35828;&#36825;&#20123;&#20154;&#20013;&#30340;5&#20301;&#20250;&#22312;&#19981;&#20037;&#30340;&#23558;&#26469;&#23558;Subversion&#24102;&#21040;1.0&#12290;

&#25105;&#20063;&#24517;&#39035;&#35828;&#25105;&#20204;&#20013;&#30340;&#19968;&#20301;&#20063;&#22312;&#28040;&#32791;&#21478;&#22806;5&#20154;&#30340;&#26102;&#38388;&#21644;&#31934;&#21147;&#65292;&#26356;&#19981;&#29992;&#35828;&#25972;&#20010;
&#37038;&#20214;&#21015;&#34920;&#65292;&#22240;&#32780;&#65288;&#34429;&#38750;&#25925;&#24847;&#65289;&#20063;&#24310;&#32531;&#20102;Subversion&#30340;&#24320;&#21457;&#12290;&#25105;&#27809;&#26377;&#20570;&#32447;&#32034;&#20998;&#26512;
&#20294;&#26159;&#36890;&#36807;vgrep&#25105;&#30340;Subversion&#37038;&#20214;&#65292;&#25105;&#21457;&#29616;&#27492;&#20154;&#30340;&#27599;&#20010;&#37038;&#20214;&#37117;&#20250;&#34987;&#19978;&#38754;5&#20154;&#20013;
&#30340;2&#20154;&#22238;&#22797;&#36807;&#12290;

&#25105;&#35273;&#24471;&#26377;&#24517;&#35201;&#20570;&#19968;&#27425;&#26681;&#26412;&#30340;&#24178;&#39044;&#65292;&#21363;&#20351;&#25105;&#20204;&#20250;&#21523;&#36305;&#21069;&#38754;&#25552;&#21040;&#30340;&#36825;&#20010;&#20154;&#65292;&#21644;&#34108;
&#21644;&#21451;&#22909;&#30340;&#26041;&#27861;&#34987;&#35777;&#26126;&#27809;&#26377;&#25928;&#26524;&#12290;

dev@subversion&#26159;&#36741;&#21161;&#36827;&#34892;&#29256;&#26412;&#24211;&#25511;&#21046;&#31995;&#32479;&#24320;&#21457;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#22242;&#38431;
&#24515;&#29702;&#27835;&#30103;&#20250;&#35758;&#12290;

-Fitz&#65292;&#23581;&#35797;&#20174;&#22534;&#31215;&#20102;3&#22825;&#30340;svn&#37038;&#20214;&#20013;&#36153;&#21147;&#21069;&#34892;
</pre><p>&#23613;&#31649;&#19968;&#24320;&#22987;&#36824;&#19981;&#26126;&#26174;&#65292;&#20294;J. Random&#30340;&#34892;&#20026;&#26159;&#28389;&#29992;&#39033;&#30446;&#35268;&#31243;&#30340;&#20856;&#22411;&#26696;&#20363;&#12290;&#20182;&#19981;&#20250;&#20687;filibuster&#19968;&#20010;&#34920;&#20915;&#37027;&#26679;&#26126;&#26174;&#65292;&#20294;&#26159;&#20182;&#21033;&#29992;&#20102;&#37038;&#20214;&#21015;&#34920;&#20013;&#25104;&#21592;&#33258;&#25105;&#35780;&#23457;&#30340;&#25919;&#31574;&#12290;&#25105;&#20204;&#20381;&#36182;&#27599;&#20010;&#20010;&#20307;&#30340;&#21028;&#26029;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#27809;&#26377;&#35268;&#31243;&#36164;&#28304;&#21487;&#20197;&#22788;&#29702;&#26576;&#20154;&#26159;&#21542;&#27809;&#26377;&#25110;&#27809;&#26377;&#32451;&#20064;&#36825;&#31181;&#21028;&#26029;&#12290;&#27809;&#26377;&#21487;&#20197;&#35753;&#26576;&#20154;&#25351;&#20986;&#24182;&#35828;&#26576;&#20010;&#23478;&#20249;&#36829;&#21453;&#30340;&#35268;&#21017;&#65292;&#20294;&#27599;&#20010;&#20154;&#30693;&#36947;&#20182;&#36807;&#20110;&#39057;&#32321;&#30340;&#25991;&#31456;&#24050;&#32463;&#25104;&#20026;&#19968;&#20010;&#20005;&#37325;&#38382;&#39064;&#12290;</p><p>Fitz&#30340;&#31574;&#30053;&#26159;&#19987;&#27178;&#30340;&#20107;&#21518;&#22238;&#24819;&#12290;&#20182;&#25910;&#38598;&#20102;&#23450;&#37327;&#30340;&#35777;&#25454;&#65292;&#28982;&#21518;&#35880;&#24910;&#30340;&#23558;&#20854;&#39318;&#20808;&#21457;&#36865;&#32473;&#37027;&#20123;&#22312;&#20219;&#20309;&#36807;&#28608;&#34892;&#21160;&#20013;&#37117;&#20250;&#23545;&#25903;&#25345;&#36215;&#20851;&#38190;&#20316;&#29992;&#30340;&#20154;&#12290;&#20182;&#20204;&#35748;&#21487;&#26377;&#24517;&#35201;&#37319;&#21462;&#34892;&#21160;&#65292;&#26368;&#21518;&#25105;&#20204;&#22312;&#30005;&#35805;&#19978;&#32852;&#31995;&#20102;J. Random&#65292;&#30452;&#25509;&#25551;&#36848;&#20102;&#36825;&#20010;&#38382;&#39064;&#65292;&#21578;&#30693;&#20182;&#20572;&#27490;&#21457;&#34920;&#25991;&#31456;&#12290;&#20182;&#20174;&#26410;&#30495;&#30340;&#29702;&#35299;&#21407;&#22240;&#65307;&#22914;&#26524;&#33021;&#22815;&#29702;&#35299;&#65292;&#20182;&#21487;&#33021;&#20250;&#23581;&#35797;&#39318;&#20808;&#36827;&#34892;&#21512;&#36866;&#30340;&#21028;&#26029;&#32451;&#20064;&#12290;&#20294;&#26159;&#20182;&#35748;&#21487;&#20572;&#27490;&#21457;&#24067;&#25991;&#31456;&#65292;&#37038;&#20214;&#21015;&#34920;&#21448;&#21464;&#24471;&#21487;&#29992;&#20102;&#12290;&#36825;&#20010;&#31574;&#30053;&#21487;&#20197;&#21457;&#25381;&#20316;&#29992;&#30340;&#37096;&#20998;&#21407;&#22240;&#25110;&#35768;&#26159;&#25105;&#20204;&#21487;&#20197;&#38480;&#21046;&#20854;&#21457;&#34920;&#30340;&#38544;&#21547;&#23041;&#32961;&#65292;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#36719;&#20214;&#30340;&#23457;&#26680;&#21151;&#33021;&#26469;&#38450;&#27490;&#22403;&#22334;&#37038;&#20214;&#65288;&#30475;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="mailing-lists.html#spam-prevention" title="&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;">the section called &#8220;&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;&#8221;</a>&#65289;&#12290;&#20294;&#26159;&#25105;&#20204;&#33021;&#22815;&#35753;&#35813;&#36873;&#25321;&#20316;&#20026;&#22791;&#29992;&#30340;&#21407;&#22240;&#26159;Fitz&#24050;&#32463;&#20174;&#20851;&#38190;&#20154;&#29289;&#37027;&#37324;&#25910;&#38598;&#20102;&#24517;&#35201;&#30340;&#25903;&#25345;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="common-pitfalls.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="growth.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36991;&#20813;&#24120;&#35265;&#30340;&#38519;&#38449; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#22788;&#29702;&#25104;&#38271;</td></tr></table></div></body></html>
