<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;"><link rel="prev" href="copyright-assignment.html" title="&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435;"><link rel="next" href="patents.html" title="&#19987;&#21033;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="copyright-assignment.html">Prev</a> </td><th width="60%" align="center">Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</th><td width="20%" align="right"> <a accesskey="n" href="patents.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="dual-licensing"></a>&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;</h2></div></div></div><p>&#19968;&#20123;&#39033;&#30446;&#24076;&#26395;&#36890;&#36807;&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;&#36164;&#21161;&#33258;&#24049;&#65292;&#20063;&#23601;&#26159;&#31169;&#26377;&#34893;&#29983;&#20316;&#21697;&#21521;&#25152;&#26377;&#32773;&#25903;&#20184;&#20351;&#29992;&#20195;&#30721;&#30340;&#29256;&#26435;&#65292;&#20294;&#20195;&#30721;&#23545;&#20110;&#24320;&#28304;&#36719;&#20214;&#20381;&#28982;&#20813;&#36153;&#12290;&#24456;&#33258;&#28982;&#65292;&#20195;&#30721;&#24211;&#27604;&#29420;&#31435;&#24212;&#29992;&#26356;&#36866;&#21512;&#36825;&#31181;&#26041;&#24335;&#12290;&#31934;&#30830;&#30340;&#26465;&#27454;&#21508;&#19981;&#30456;&#21516;&#12290;&#36890;&#24120;&#20854;&#23646;&#20110;&#33258;&#30001;&#30340;&#35768;&#21487;&#35777;&#20026;GNU GPL&#65292;&#22240;&#20026;&#23427;&#24050;&#32463;&#31105;&#27490;&#20102;&#20182;&#20154;&#22312;&#26410;&#32463;&#29256;&#26435;&#25345;&#26377;&#32773;&#20801;&#35768;&#21069;&#65292;&#23558;&#35206;&#30422;&#30340;&#20195;&#30721;&#32452;&#21512;&#21040;&#20182;&#20204;&#30340;&#31169;&#26377;&#20135;&#21697;&#20013;&#65292;&#20294;&#26159;&#26377;&#26102;&#19968;&#20123;&#33258;&#23450;&#20041;&#35768;&#21487;&#35777;&#36215;&#21040;&#30456;&#21516;&#30340;&#25928;&#26524;&#12290;&#21069;&#32773;&#30340;&#19968;&#20010;&#20363;&#23376;&#26159;MySQL&#35768;&#21487;&#35777;&#65292;&#36825;&#37324;&#26377;&#25551;&#36848;<a class="ulink" href="http://www.mysql.com/company/legal/licensing/" target="_top">http://www.mysql.com/company/legal/licensing/</a>&#65307;&#21518;&#32773;&#30340;&#20363;&#23376;&#26159;Sleepycat&#36719;&#20214;&#35768;&#21487;&#35777;&#31574;&#30053;&#65292;&#25551;&#36848;&#22312;<a class="ulink" href="http://www.oracle.com/technology/software/products/berkeley-db/htdocs/licensing.html" target="_top">http://www.oracle.com/technology/software/products/berkeley-db/htdocs/licensing.html</a>&#12290;</p><p>&#20320;&#25110;&#35768;&#26377;&#20123;&#30097;&#24785;&#65306;&#20026;&#20160;&#20040;&#26126;&#26126;GNU&#30340;GPL&#35268;&#23450;&#20195;&#30721;&#24517;&#39035;&#22312;&#36739;&#23569;&#32422;&#26463;&#30340;&#26465;&#27454;&#19979;&#21457;&#24067;&#65292;&#32780;&#29256;&#26435;&#25345;&#26377;&#32773;&#36824;&#21487;&#20197;&#25552;&#20379;&#31169;&#26377;&#35768;&#21487;&#35777;&#12290;&#31572;&#26696;&#26159;GPL&#30340;&#26465;&#27454;&#26159;&#29256;&#26435;&#25345;&#26377;&#32773;&#20026;&#25152;&#26377;&#20854;&#20182;&#20154;&#35774;&#32622;&#30340;&#65307;&#32780;&#25152;&#26377;&#32773;&#21487;&#20197;&#33258;&#30001;&#30340;&#20915;&#23450;<span class="emphasis"><em>&#26159;&#21542;</em></span>&#23545;&#20854;&#26412;&#36523;&#24212;&#29992;&#36825;&#20123;&#26465;&#27454;&#12290;&#23545;&#27492;&#65292;&#19968;&#20010;&#22909;&#30340;&#29702;&#35299;&#26041;&#27861;&#26159;&#24819;&#35937;&#29256;&#26435;&#25152;&#26377;&#32773;&#22312;&#26742;&#37324;&#26377;&#26080;&#25968;&#20221;&#36719;&#20214;&#30340;&#25335;&#36125;&#12290;&#27599;&#27425;&#23427;&#20174;&#26742;&#20013;&#21462;&#20986;&#19968;&#20010;&#21457;&#36865;&#21040;&#19990;&#30028;&#19978;&#26102;&#65292;&#23427;&#21487;&#20197;&#20915;&#23450;&#26159;&#37319;&#29992;GPL&#65292;&#31169;&#26377;&#25110;&#20854;&#20182;&#35768;&#21487;&#35777;&#12290;&#36825;&#24182;&#19981;&#26159;&#20165;&#20165;&#19982;GPL&#25110;&#20854;&#20182;&#20219;&#20309;&#24320;&#28304;&#35768;&#21487;&#35777;&#30456;&#20851;&#65292;&#23427;&#20165;&#20165;&#26159;&#29256;&#26435;&#27861;&#25152;&#36171;&#20104;&#30340;&#26435;&#21033;&#12290;</p><p>&#21452;&#35768;&#21487;&#35777;&#30340;&#21560;&#24341;&#21147;&#22312;&#20110;&#65292;&#20026;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#25552;&#20379;&#20102;&#19968;&#31181;&#21487;&#38752;&#30340;&#25910;&#20837;&#26469;&#28304;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#23427;&#20063;&#21487;&#33021;&#24178;&#25200;&#24320;&#28304;&#39033;&#30446;&#26412;&#36523;&#30340;&#19968;&#33324;&#21160;&#21147;&#24615;&#12290;&#38382;&#39064;&#26159;&#20219;&#20309;&#20026;&#20195;&#30721;&#20316;&#20986;&#36129;&#29486;&#30340;&#24535;&#24895;&#32773;&#29616;&#22312;&#24320;&#22987;&#20026;&#20004;&#20010;&#19981;&#21516;&#30340;&#23454;&#20307;&#36129;&#29486;&#65306;&#20195;&#30721;&#30340;&#33258;&#30001;&#29256;&#26412;&#21644;&#31169;&#26377;&#29256;&#26412;&#12290;&#24403;&#28982;&#65292;&#36129;&#29486;&#32773;&#20250;&#20048;&#20110;&#36129;&#29486;&#33258;&#26377;&#29256;&#26412;&#65292;&#22240;&#20026;&#36825;&#26159;&#24320;&#28304;&#39033;&#30446;&#30340;&#26631;&#20934;&#65292;&#22914;&#26524;&#26159;&#20026;&#20182;&#20154;&#30340;&#21322;&#31169;&#26377;&#25910;&#20837;&#36129;&#29486;&#65292;&#22905;&#20250;&#24863;&#21040;&#21487;&#31505;&#12290;&#30001;&#20110;&#21452;&#35768;&#21487;&#35777;&#30340;&#36825;&#19968;&#20107;&#23454;&#21152;&#21095;&#20102;&#36825;&#31181;&#23604;&#23596;&#65292;&#29256;&#26435;&#25152;&#26377;&#32773;&#30830;&#23454;&#38656;&#35201;&#20174;&#25152;&#26377;&#36129;&#29486;&#32773;&#25910;&#38598;&#27491;&#24335;&#30340;&#65292;&#31614;&#32626;&#30340;&#29256;&#26435;&#25480;&#26435;&#65292;&#20174;&#32780;&#25165;&#33021;&#20445;&#25252;&#33258;&#36523;&#20043;&#21518;&#19981;&#20250;&#21463;&#21040;&#19981;&#28385;&#30340;&#36129;&#29486;&#32773;&#23545;&#20110;&#20174;&#31169;&#26377;&#25910;&#20837;&#20013;&#33719;&#21462;&#33258;&#24049;&#20221;&#39069;&#30340;&#25351;&#25511;&#12290;&#25910;&#38598;&#36825;&#31181;&#25480;&#26435;&#25991;&#20214;&#30340;&#36807;&#31243;&#24847;&#21619;&#30528;&#36129;&#29486;&#32773;&#35201;&#20005;&#37239;&#30340;&#38754;&#23545;&#36825;&#19968;&#20107;&#23454;&#65292;&#20182;&#20204;&#22312;&#20026;&#21035;&#20154;&#36186;&#38065;&#32780;&#24037;&#20316;&#12290;</p><p>&#19981;&#26159;&#25152;&#26377;&#30340;&#24535;&#24895;&#32773;&#20250;&#22240;&#27492;&#32780;&#22256;&#25200;&#65307;&#27605;&#31455;&#20182;&#20204;&#30340;&#36129;&#29486;&#20063;&#36827;&#20837;&#20102;&#24320;&#28304;&#29256;&#26412;&#65292;&#36825;&#26159;&#20182;&#20204;&#30340;&#20852;&#36259;&#25152;&#22312;&#12290;&#34429;&#28982;&#22914;&#27492;&#65292;&#21452;&#35768;&#21487;&#35777;&#26159;&#29256;&#26435;&#25345;&#26377;&#32773;&#36171;&#20104;&#33258;&#24049;&#65292;&#32780;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#20154;&#25152;&#27809;&#26377;&#30340;&#29305;&#26435;&#30340;&#19968;&#20010;&#20363;&#23376;&#65292;&#32780;&#19988;&#19968;&#23450;&#31243;&#24230;&#19978;&#20250;&#24341;&#36215;&#19968;&#20123;&#32039;&#24352;&#65292;&#33267;&#23569;&#23545;&#26576;&#19968;&#20123;&#24535;&#24895;&#32773;&#12290;</p><p>&#22312;&#23454;&#36341;&#20013;&#65292;&#25105;&#20204;&#30475;&#21040;&#35768;&#22810;&#22522;&#20110;&#21452;&#35768;&#21487;&#35777;&#36719;&#20214;&#30340;&#20844;&#21496;&#30830;&#23454;&#27809;&#26377;&#30495;&#27491;&#24179;&#31561;&#30340;&#24320;&#21457;&#31038;&#21306;&#12290;&#20182;&#20204;&#21482;&#33021;&#20174;&#22806;&#37096;&#33719;&#24471;&#24456;&#23567;&#35268;&#27169;&#30340;bug&#20462;&#27491;&#21644;&#28165;&#29702;&#34917;&#19969;&#65292;&#32780;&#36890;&#36807;&#20869;&#37096;&#28304;&#20570;&#22823;&#37327;&#33392;&#33510;&#30340;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;Zack Urloker&#65292;MySQL&#30340;&#21103;&#20027;&#31649;&#21578;&#35785;&#25105;&#65292;&#20844;&#21496;&#36890;&#24120;&#26368;&#32456;&#20250;&#38599;&#20323;&#26368;&#27963;&#36291;&#30340;&#24535;&#24895;&#32773;&#12290;&#22240;&#32780;&#65292;&#23613;&#31649;&#20135;&#21697;&#26412;&#36523;&#26159;&#24320;&#28304;&#30340;&#65292;&#20351;&#29992;GPL&#35768;&#21487;&#35777;&#65292;&#23427;&#30340;&#24320;&#21457;&#36824;&#26159;&#25110;&#22810;&#25110;&#23569;&#21463;&#21040;&#20844;&#21496;&#30340;&#25511;&#21046;&#65292;&#34429;&#28982;&#20063;&#21487;&#33021;&#26377;&#20154;&#30830;&#23454;&#19981;&#28385;&#24847;&#36825;&#20010;&#20844;&#21496;&#25226;&#25345;&#30528;&#36825;&#20010;&#36719;&#20214;&#32780;&#20998;&#21449;&#36825;&#20010;&#39033;&#30446;&#12290;&#19968;&#23450;&#31243;&#24230;&#19978;&#65292;&#36825;&#31181;&#23041;&#32961;&#36843;&#20351;&#20844;&#21496;&#25919;&#31574;&#30340;&#20869;&#23481;&#65292;&#20294;&#22312;&#20063;&#26377;&#19968;&#23450;&#20960;&#29575;&#65292;MySQL&#27809;&#26377;&#21457;&#29616;&#22312;&#24320;&#28304;&#19990;&#30028;&#25110;&#20043;&#22806;&#23384;&#22312;&#30528;&#25509;&#21463;&#30340;&#38382;&#39064;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="copyright-assignment.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="patents.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#19987;&#21033;</td></tr></table></div></body></html>
