<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20998;&#21449;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><link rel="prev" href="credit.html" title="&#33635;&#35465;"><link rel="next" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20998;&#21449;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="credit.html">Prev</a> </td><th width="60%" align="center">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</th><td width="20%" align="right"> <a accesskey="n" href="legal.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20998;&#21449;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="forks"></a>&#20998;&#21449;</h2></div></div></div><p>&#22312;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="social-infrastructure.html#forkability" title="&#20998;&#21449;&#33021;&#21147;&#65288;forkability&#65289;">the section called &#8220;&#20998;&#21449;&#33021;&#21147;&#65288;forkability&#65289;&#8221;</a>&#65292;&#25105;&#20204;&#35828;&#20102;<span class="emphasis"><em>&#28508;&#22312;&#30340;</em></span>&#20998;&#21449;&#33021;&#21147;&#23545;&#20110;&#39033;&#30446;&#31649;&#29702;&#30340;&#37325;&#35201;&#24433;&#21709;&#12290;&#20294;&#26159;&#24403;&#20998;&#21449;&#30830;&#23454;&#21457;&#29983;&#26102;&#65292;&#25105;&#20204;&#24212;&#35813;&#24590;&#20040;&#20570;&#65311;&#20320;&#24212;&#35813;&#22914;&#20309;&#22788;&#29702;&#65292;&#20250;&#21457;&#29983;&#24590;&#26679;&#30340;&#24773;&#20917;&#65311;&#19982;&#20043;&#23545;&#24212;&#65292;&#20309;&#26102;&#20320;&#24212;&#24403;<span class="emphasis"><em>&#24320;&#22987;</em></span>&#19968;&#20010;&#20998;&#21449;&#12290;</p><p>&#31572;&#26696;&#21462;&#20915;&#20110;&#20320;&#36873;&#25321;&#30340;&#20998;&#21449;&#31867;&#22411;&#12290;&#26377;&#19968;&#20123;&#20998;&#21449;&#28304;&#20110;&#23545;&#20110;&#39033;&#30446;&#26041;&#21521;&#30340;&#21451;&#21892;&#20294;&#19981;&#21487;&#35843;&#21644;&#30340;&#24322;&#35758;&#65307;&#20063;&#26377;&#19968;&#20123;&#30001;&#20110;&#25216;&#26415;&#20998;&#27495;&#21644;&#20010;&#20154;&#20914;&#31361;&#12290;&#24403;&#28982;&#65292;&#24456;&#38590;&#35828;&#28165;&#26970;&#20108;&#32773;&#20043;&#38388;&#30340;&#21306;&#21035;&#65292;&#22240;&#20026;&#25216;&#26415;&#20105;&#35770;&#20063;&#20250;&#21253;&#21547;&#20010;&#20154;&#20803;&#32032;&#12290;&#25152;&#26377;&#20998;&#21449;&#30340;&#20849;&#21516;&#20043;&#22788;&#26159;&#26377;&#19968;&#38431;&#24320;&#21457;&#32773;&#65288;&#26377;&#26102;&#20165;&#20165;&#26159;&#19968;&#20010;&#24320;&#21457;&#32773;&#65289;&#35748;&#20026;&#19982;&#26576;&#20123;&#20154;&#25110;&#25152;&#26377;&#20854;&#20182;&#20154;&#19968;&#36215;&#24037;&#20316;&#30340;&#25104;&#26412;&#24050;&#32463;&#22823;&#20110;&#25910;&#30410;&#12290;</p><p>&#19968;&#26086;&#39033;&#30446;&#20998;&#21449;&#65292;&#23545;&#20110;&#20998;&#21449;&#19982;&#8220;&#21407;&#8221;&#39033;&#30446;&#35841;&#26159;&#35841;&#38750;&#65292;&#27809;&#26377;&#26126;&#30830;&#30340;&#31572;&#26696;&#12290;&#20154;&#20204;&#20250;&#36890;&#20439;&#30340;&#35828;&#20998;&#21449;F&#26469;&#33258;&#20110;&#39033;&#30446;P&#65292;&#22909;&#20687;P&#32487;&#32493;&#27839;&#30528;&#33258;&#28982;&#36335;&#24452;&#20445;&#25345;&#19981;&#21464;&#65292;&#32780;F&#21017;&#36827;&#20837;&#26032;&#30340;&#39046;&#22495;&#65292;&#20294;&#36825;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010;&#35266;&#23519;&#32773;&#30340;&#22768;&#26126;&#12290;&#20294;&#36825;&#32431;&#23646;&#20010;&#20154;&#24863;&#35273;&#65306;&#24403;&#36275;&#22815;&#39640;&#30334;&#20998;&#27604;&#30340;&#35266;&#23519;&#32773;&#35748;&#21487;&#65292;&#36825;&#20010;&#26029;&#35328;&#20415;&#25104;&#20026;&#30495;&#12290;&#24182;&#19981;&#26159;&#35828;&#19968;&#24320;&#22987;&#23601;&#26377;&#19968;&#20010;&#23458;&#35266;&#20107;&#23454;&#65292;&#32780;&#21482;&#26159;&#19968;&#24320;&#22987;&#30340;&#19968;&#20010;&#19981;&#22826;&#23436;&#32654;&#30340;&#24863;&#35273;&#12290;&#27492;&#22806;&#65292;&#24863;&#35273;<span class="emphasis"><em>&#26159;</em></span>&#23458;&#35266;&#20107;&#23454;&#65292;&#22240;&#20026;&#26368;&#32456;&#19968;&#20010;&#39033;&#30446;&#8212;&#25110;&#19968;&#20010;&#20998;&#21449;&#8212;&#20165;&#20165;&#26159;&#23384;&#22312;&#20110;&#20154;&#20204;&#24605;&#24819;&#20013;&#30340;&#19968;&#20010;&#23454;&#20307;&#12290;</p><p>&#22914;&#26524;&#24320;&#22987;&#20998;&#21449;&#30340;&#20154;&#20204;&#24863;&#35273;&#33258;&#24049;&#26159;&#22312;&#24314;&#31435;&#20027;&#39033;&#30446;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#21017;&#24863;&#30693;&#38382;&#39064;&#21487;&#20197;&#31435;&#21051;&#36731;&#26131;&#30340;&#35299;&#20915;&#12290;&#27599;&#20010;&#20154;&#65292;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#20250;&#23558;&#20998;&#21449;&#35270;&#20026;&#26032;&#30340;&#39033;&#30446;&#65292;&#26377;&#26032;&#30340;&#21517;&#31216;&#65288;&#25110;&#35768;&#22522;&#20110;&#26087;&#26377;&#30340;&#21517;&#31216;&#65292;&#20294;&#23481;&#26131;&#19982;&#20043;&#21306;&#20998;&#65289;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#32593;&#39029;&#20197;&#21450;&#21333;&#29420;&#30340;&#21746;&#23398;&#25110;&#30446;&#26631;&#12290;&#24403;&#21452;&#26041;&#37117;&#35748;&#20026;&#33258;&#24049;&#26159;&#21407;&#39033;&#30446;&#36951;&#20135;&#30340;&#23432;&#21355;&#32773;&#65292;&#29702;&#25152;&#24403;&#28982;&#32487;&#32493;&#20351;&#29992;&#21407;&#26469;&#30340;&#21517;&#31216;&#26102;&#65292;&#20107;&#24773;&#20250;&#21464;&#30340;&#22797;&#26434;&#12290;&#22914;&#26524;&#26576;&#20010;&#32452;&#32455;&#25317;&#26377;&#36825;&#20010;&#21517;&#31216;&#30340;&#21830;&#26631;&#26435;&#65292;&#25110;&#23545;&#20110;&#22495;&#21517;&#25110;&#32593;&#39029;&#26377;&#27861;&#24459;&#25511;&#21046;&#65292;&#36890;&#24120;&#21487;&#20197;&#24179;&#28369;&#30340;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65306;&#36825;&#20010;&#32452;&#32455;&#21487;&#20197;&#20915;&#23450;&#35841;&#26159;&#36825;&#20010;&#39033;&#30446;&#65292;&#35841;&#26159;&#20998;&#21449;&#65292;&#22240;&#20026;&#23427;&#25317;&#26377;&#20844;&#20849;&#20851;&#31995;&#25112;&#20105;&#20013;&#30340;&#25152;&#26377;&#21345;&#29255;&#12290;&#24456;&#33258;&#28982;&#65292;&#19968;&#33324;&#19981;&#20250;&#22914;&#27492;&#36807;&#20998;&#65306;&#22240;&#20026;&#27599;&#20010;&#20154;&#37117;&#30693;&#36947;&#26435;&#21033;&#21160;&#21147;&#23398;&#65292;&#20182;&#20204;&#20250;&#36991;&#20813;&#19968;&#22330;&#32467;&#23616;&#24050;&#23450;&#30340;&#25112;&#26007;&#65292;&#20250;&#30452;&#25509;&#36339;&#21040;&#32467;&#23616;&#12290;</p><p>&#24184;&#36816;&#30340;&#26159;&#65292;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#21487;&#20197;&#36731;&#26494;&#30340;&#21306;&#20998;&#21738;&#20010;&#26159;&#39033;&#30446;&#65292;&#21738;&#20010;&#26159;&#20998;&#21449;&#65292;&#22240;&#20026;&#20998;&#21449;&#20174;&#26412;&#36136;&#19978;&#26159;&#19968;&#20010;&#33258;&#20449;&#30340;&#25237;&#31080;&#12290;&#22914;&#26524;&#36807;&#21322;&#30340;&#24320;&#21457;&#32773;&#20542;&#21521;&#20110;&#37319;&#32435;&#20998;&#21449;&#30340;&#36807;&#31243;&#65292;&#36890;&#24120;&#24847;&#21619;&#30528;&#27809;&#26377;&#24517;&#35201;&#20998;&#21449;&#8212;&#36825;&#20010;&#39033;&#30446;&#21487;&#20197;&#33258;&#24049;&#36208;&#36825;&#26465;&#36335;&#65292;&#38500;&#38750;&#23427;&#26377;&#19968;&#20010;&#39037;&#22266;&#30340;&#29420;&#35009;&#32773;&#65292;&#25353;&#29031;&#29420;&#35009;&#26041;&#24335;&#36816;&#34892;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#25903;&#25345;&#32773;&#23569;&#20110;&#19968;&#21322;&#65292;&#21017;&#20998;&#21449;&#21017;&#26126;&#26174;&#26159;&#23569;&#25968;&#27966;&#30340;&#21453;&#21467;&#65292;&#26681;&#25454;&#31036;&#35980;&#21644;&#24120;&#35782;&#65292;&#23427;&#24212;&#24403;&#35748;&#20026;&#33258;&#24049;&#26159;&#20998;&#21449;&#65292;&#32780;&#19981;&#26159;&#20027;&#32447;&#12290;</p><div class="sect2" title="&#22788;&#29702;&#20998;&#21449;"><div class="titlepage"><div><div><h3 class="title"><a name="forks-handling"></a>&#22788;&#29702;&#20998;&#21449;</h3></div></div></div><p>&#22914;&#26524;&#26576;&#20154;&#22312;&#39033;&#30446;&#20013;&#23041;&#32961;&#36827;&#34892;&#20998;&#21449;&#65292;&#35831;&#20445;&#25345;&#20919;&#38745;&#24182;&#29282;&#35760;&#20320;&#30340;&#38271;&#26399;&#30446;&#26631;&#12290;&#20998;&#21449;&#30340;<span class="emphasis"><em>&#23384;&#22312;</em></span>&#19981;&#26159;&#23545;&#39033;&#30446;&#30340;&#20260;&#23475;&#65292;&#32780;&#26159;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#30340;&#25439;&#22833;&#12290;&#20320;&#30495;&#27491;&#30340;&#30446;&#26631;&#65292;&#19981;&#26159;&#20026;&#20102;&#38215;&#21387;&#20998;&#21449;&#65292;&#32780;&#26159;&#26368;&#23567;&#21270;&#20854;&#25439;&#23475;&#12290;&#20063;&#35768;&#20320;&#20250;&#29983;&#27668;&#65292;&#20320;&#25110;&#35768;&#24863;&#21040;&#20998;&#21449;&#26159;&#19981;&#20844;&#27491;&#21644;&#19981;&#35831;&#33258;&#26469;&#30340;&#65292;&#20294;&#22914;&#26524;&#36825;&#26679;&#20844;&#24320;&#34920;&#31034;&#21017;&#26159;&#23545;&#26410;&#20915;&#23450;&#29992;&#25143;&#30340;&#30095;&#36828;&#12290;&#30456;&#21453;&#65292;&#19981;&#35201;&#24378;&#21046;&#20154;&#20204;&#20570;&#20986;&#21807;&#19968;&#30340;&#36873;&#25321;&#65292;&#35201;&#19982;&#20998;&#21449;&#23454;&#34892;&#21487;&#34892;&#30340;&#21512;&#20316;&#12290;&#39318;&#20808;&#65292;&#19981;&#35201;&#22240;&#20026;&#26576;&#20154;&#20915;&#23450;&#22312;&#20998;&#21449;&#19978;&#24037;&#20316;&#65292;&#32780;&#21024;&#38500;&#20854;&#22312;&#20320;&#30340;&#39033;&#30446;&#20013;&#30340;&#25552;&#20132;&#26435;&#38480;&#12290;&#22312;&#20998;&#21449;&#19978;&#24037;&#20316;&#24182;&#19981;&#24847;&#21619;&#30528;&#20182;&#31435;&#21051;&#22833;&#21435;&#20102;&#22312;&#21407;&#39033;&#30446;&#24037;&#20316;&#30340;&#36164;&#26684;&#65307;&#20043;&#21069;&#30340;&#25552;&#20132;&#32773;&#20043;&#21518;&#36824;&#26159;&#25552;&#20132;&#32773;&#12290;&#27492;&#22806;&#65292;&#20320;&#24212;&#24403;&#23637;&#31034;&#19982;&#20998;&#21449;&#20445;&#25345;&#20860;&#23481;&#30340;&#24895;&#26395;&#65292;&#24182;&#34920;&#36798;&#20320;&#24076;&#26395;&#24320;&#21457;&#32773;&#33021;&#22815;&#22312;&#20108;&#32773;&#20043;&#38388;&#25644;&#36816;&#21512;&#36866;&#30340;&#21464;&#26356;&#12290;&#22914;&#26524;&#20320;&#23545;&#39033;&#30446;&#26381;&#21153;&#22120;&#26377;&#31649;&#29702;&#26435;&#38480;&#65292;&#19968;&#24320;&#22987;&#23601;&#20844;&#24320;&#25552;&#20379;&#20998;&#21449;&#30340;&#22522;&#30784;&#26550;&#26500;&#24110;&#21161;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20182;&#20204;&#26080;&#27861;&#36890;&#36807;&#20854;&#20182;&#26041;&#27861;&#33719;&#24471;&#65292;&#21487;&#20197;&#20026;&#20182;&#20204;&#25552;&#20379;&#19968;&#20010;&#23436;&#25972;&#30340;&#65292;&#29256;&#26412;&#25511;&#21046;&#24211;&#30340;&#28145;&#24230;&#21382;&#21490;&#21103;&#26412;&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#19981;&#24517;&#20197;&#26080;&#21382;&#21490;&#25968;&#25454;&#20316;&#20026;&#24320;&#22987;&#65288;&#24517;&#35201;&#24615;&#21462;&#20915;&#20110;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65289;&#12290;&#35810;&#38382;&#20182;&#20204;&#26159;&#21542;&#26377;&#20854;&#20182;&#30340;&#38656;&#35201;&#65292;&#24182;&#23613;&#20320;&#25152;&#33021;&#25552;&#20379;&#12290;&#36825;&#31181;&#25903;&#25345;&#34920;&#26126;&#20102;&#20320;&#19981;&#20250;&#38459;&#25376;&#20182;&#20204;&#65292;&#32780;&#19988;&#24076;&#26395;&#35813;&#20998;&#21449;&#20197;&#33258;&#24049;&#20215;&#20540;&#25104;&#21151;&#25110;&#32773;&#22833;&#36133;&#65292;&#20165;&#27492;&#32780;&#24050;&#12290;</p><p>&#36825;&#26679;&#20570;&#8212;&#20197;&#21450;&#20844;&#24320;&#36825;&#26679;&#20570;&#30340;&#8212;&#21407;&#22240;&#23454;&#38469;&#19978;&#24182;&#19981;&#20250;&#24110;&#21161;&#20998;&#21449;&#65292;&#20294;&#26159;&#36890;&#36807;&#23613;&#21487;&#33021;&#30340;&#23637;&#31034;&#38750;&#25253;&#22797;&#24515;&#24577;&#65292;&#20250;&#20351;&#24320;&#21457;&#32773;&#30456;&#20449;&#20320;&#36825;&#36793;&#26159;&#23433;&#20840;&#24102;&#12290;&#25112;&#20105;&#20013;&#26377;&#26102;&#24378;&#21046;&#20154;&#20204;&#36873;&#25321;&#19968;&#36793;&#38750;&#24120;&#26377;&#24847;&#20041;&#65288;&#25112;&#30053;&#24847;&#20041;&#65292;&#32780;&#19981;&#26159;&#20154;&#30340;&#24863;&#35273;&#65289;&#65292;&#20294;&#26159;&#33258;&#30001;&#36719;&#20214;&#20960;&#20046;&#20174;&#19981;&#36825;&#26679;&#20570;&#12290;&#23454;&#38469;&#19978;&#65292;&#20998;&#21449;&#21518;&#19968;&#20123;&#24320;&#21457;&#32773;&#20250;&#20844;&#24320;&#30340;&#22312;&#20004;&#20010;&#39033;&#30446;&#21516;&#26102;&#24037;&#20316;&#65292;&#24182;&#23613;&#21487;&#33021;&#20445;&#25345;&#20108;&#32773;&#20860;&#23481;&#12290;&#36825;&#20123;&#24320;&#21457;&#32773;&#20445;&#25345;&#20102;&#20998;&#21449;&#20043;&#21518;&#30340;&#20132;&#27969;&#12290;&#20182;&#20204;&#20801;&#35768;&#24744;&#30340;&#39033;&#30446;&#20174;&#20998;&#21449;&#20013;&#26377;&#36259;&#30340;&#26032;&#29305;&#24449;&#20013;&#33719;&#30410;&#65288;&#26159;&#30340;&#65292;&#20998;&#25903;&#20063;&#26377;&#20320;&#24819;&#35201;&#30340;&#65289;&#65292;&#21478;&#22806;&#20063;&#20250;&#22686;&#38271;&#22312;&#26410;&#26469;&#21512;&#24182;&#30340;&#21487;&#33021;&#12290;</p><p>&#26377;&#26102;&#65292;&#26576;&#20010;&#20998;&#25903;&#21464;&#24471;&#24322;&#24120;&#25104;&#21151;&#65292;&#21363;&#20351;&#20182;&#26368;&#21021;&#30340;&#29053;&#21160;&#32773;&#20063;&#35748;&#20026;&#20182;&#20204;&#24320;&#22987;&#20110;&#19968;&#27425;&#20998;&#21449;&#65292;&#20294;&#25104;&#20026;&#20154;&#20154;&#37117;&#21916;&#27426;&#30340;&#29256;&#26412;&#65292;&#26368;&#32456;&#30001;&#20110;&#20854;&#27969;&#34892;&#24615;&#21462;&#20195;&#20102;&#26368;&#21021;&#30340;&#29256;&#26412;&#12290;&#19968;&#20010;&#33879;&#21517;&#30340;&#23454;&#20363;&#26159;GCC/EGCS&#20998;&#21449;&#65292;<em class="firstterm">GNU Compiler Collection</em>&#65288;<em class="firstterm">GCC</em>&#65292;&#20197;&#21069;&#31216;&#20026;<em class="firstterm">GNU C
Compiler</em>&#65289;&#26159;&#26368;&#33879;&#21517;&#30340;&#24320;&#28304;&#26412;&#20195;&#30721;&#32534;&#35793;&#22120;&#65292;&#20063;&#26159;&#19990;&#30028;&#19978;&#26368;&#20415;&#20110;&#31227;&#26893;&#30340;&#32534;&#35793;&#22120;&#12290;&#28304;&#20110;&#23545;GCC&#23448;&#26041;&#32500;&#25252;&#32773;&#21644;Cygnus&#36719;&#20214;&#30340;&#20998;&#27495;&#12290;<sup>[<a name="idp2947" href="#ftn.idp2947" class="footnote">29</a>]</sup>GCC&#30340;&#19968;&#20010;&#26368;&#27963;&#36291;&#30340;&#24320;&#21457;&#22242;&#38431;&#65292;Cygnus&#21019;&#24314;&#20102;&#19968;&#20010;GCC&#30340;&#20998;&#21449;&#65292;&#31216;&#20026;<em class="firstterm">EGCS</em>&#12290;&#35813;&#20998;&#21449;&#35880;&#24910;&#20445;&#25345;&#38750;&#25932;&#23545;&#20301;&#32622;&#65306;&#20174;&#20219;&#20309;&#35282;&#24230;&#30475;&#65292;EGCS&#24320;&#21457;&#32773;&#20174;&#27809;&#26377;&#35797;&#22270;&#25226;&#20182;&#20204;&#29256;&#26412;&#30340;GCC&#25551;&#32472;&#25104;&#26032;&#30340;&#23448;&#26041;&#29256;&#26412;&#12290;&#30456;&#21453;&#65292;&#20182;&#20204;&#38598;&#20013;&#31934;&#21147;&#20351;EGCS&#23613;&#21487;&#33021;&#30340;&#22909;&#65292;&#27604;&#23448;&#26041;&#30340;GCC&#32500;&#25252;&#32773;&#20197;&#26356;&#24555;&#30340;&#39057;&#29575;&#25972;&#21512;&#34917;&#19969;&#12290;EGCS&#21463;&#21040;&#20102;&#27426;&#36814;&#65292;&#26368;&#32456;&#19968;&#20123;&#20027;&#27969;&#30340;&#25805;&#20316;&#31995;&#32479;&#21457;&#24067;&#21830;&#20915;&#23450;&#23558;EGCS&#32780;&#19981;&#26159;GCC&#20316;&#20026;&#25171;&#21253;&#20135;&#21697;&#30340;&#40664;&#35748;&#32534;&#35793;&#22120;&#12290;&#27492;&#21051;&#65292;&#23545;&#20110;GCC&#30340;&#32500;&#25252;&#32773;&#24456;&#28165;&#26970;&#65292;&#22362;&#25345;&#8220;GCC&#8221;&#30340;&#21517;&#31216;&#65292;&#32780;&#35753;&#25152;&#26377;&#20154;&#20999;&#25442;&#21040;EGCS&#20998;&#21449;&#19978;&#38656;&#35201;&#27599;&#20010;&#20154;&#25215;&#21463;&#27627;&#26080;&#24517;&#35201;&#30340;&#21517;&#31216;&#20462;&#25913;&#36127;&#25285;&#65292;&#23545;&#38450;&#27490;&#20999;&#25442;&#27627;&#26080;&#24847;&#20041;&#12290;&#25152;&#20197;GCC&#37319;&#29992;&#20102;EGCS&#30340;&#20195;&#30721;&#22522;&#65292;&#20877;&#19968;&#27425;&#21482;&#26377;&#19968;&#20010;GCC&#65292;&#20294;&#22240;&#20026;&#20998;&#21449;&#33719;&#24471;&#20102;&#26497;&#22823;&#30340;&#25913;&#36827;&#12290;</p><p>&#36825;&#20010;&#20363;&#23376;&#21521;&#25105;&#20204;&#23637;&#31034;&#20102;&#20026;&#20160;&#20040;&#19981;&#33021;&#21333;&#32431;&#30340;&#23558;&#20998;&#21449;&#35270;&#20026;&#19968;&#20214;&#22351;&#20107;&#12290;&#20998;&#21449;&#26102;&#21487;&#33021;&#20805;&#28385;&#30171;&#33510;&#21644;&#19981;&#21463;&#27426;&#36814;&#65292;&#20294;&#20320;&#19981;&#33021;&#24517;&#28982;&#30693;&#36947;&#23427;&#26159;&#21542;&#20250;&#25104;&#21151;&#12290;&#22240;&#32780;&#65292;&#20320;&#21644;&#39033;&#30446;&#30340;&#20313;&#19979;&#37096;&#20998;&#35201;&#19968;&#30452;&#30041;&#24847;&#23427;&#65292;&#19981;&#20165;&#20165;&#35201;&#20934;&#22791;&#22909;&#21560;&#25910;&#21487;&#33021;&#30340;&#29305;&#24615;&#21644;&#20195;&#30721;&#65292;&#22312;&#26497;&#31471;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#20998;&#21449;&#33719;&#24471;&#20102;&#39033;&#30446;&#30340;&#31934;&#31070;&#21344;&#26377;&#29575;&#65292;&#29978;&#33267;&#38656;&#35201;&#21152;&#20837;&#20998;&#21449;&#12290;&#24403;&#28982;&#65292;&#36890;&#36807;&#35266;&#23519;&#35841;&#21152;&#20837;&#20102;&#20998;&#21449;&#20320;&#20063;&#33021;&#39044;&#27979;&#21040;&#20854;&#25104;&#21151;&#30340;&#21487;&#33021;&#24615;&#12290;&#22914;&#26524;&#20998;&#21449;&#30001;&#39033;&#30446;&#26368;&#22823;&#30340;&#25265;&#24616;&#32773;&#24320;&#21551;&#65292;&#24182;&#26377;&#23569;&#25968;&#19981;&#28385;&#30340;&#30475;&#36215;&#26469;&#36215;&#19981;&#21040;&#24314;&#35774;&#20316;&#29992;&#30340;&#24320;&#21457;&#32773;&#21152;&#20837;&#65292;&#20182;&#20204;&#23558;&#26080;&#27861;&#36890;&#36807;&#20998;&#21449;&#35299;&#20915;&#38382;&#39064;&#65292;&#20320;&#20063;&#26080;&#39035;&#25285;&#24515;&#20998;&#21449;&#20250;&#23558;&#21407;&#39033;&#30446;&#30340;&#21160;&#21147;&#24102;&#36208;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;&#30475;&#21040;&#26377;&#24433;&#21709;&#21644;&#20196;&#20154;&#23562;&#25964;&#30340;&#24320;&#21457;&#32773;&#25903;&#25345;&#36825;&#20010;&#20998;&#21449;&#65292;&#20320;&#24517;&#39035;&#38382;&#33258;&#24049;&#36825;&#26159;&#20026;&#20160;&#20040;&#12290;&#25110;&#35768;&#25972;&#20010;&#39033;&#30446;&#34987;&#38480;&#21046;&#20102;&#65292;&#26368;&#22909;&#30340;&#26041;&#26696;&#26159;&#22312;&#20027;&#32447;&#39033;&#30446;&#37319;&#32435;&#19968;&#20123;&#20998;&#21449;&#25171;&#31639;&#30340;&#34892;&#21160;&#8212;&#20174;&#26412;&#36136;&#19978;&#65292;&#36890;&#36807;&#21464;&#25104;&#23427;&#32780;&#36991;&#20813;&#20998;&#21449;&#12290;</p></div><div class="sect2" title="&#21021;&#22987;&#19968;&#20010;&#20998;&#21449;"><div class="titlepage"><div><div><h3 class="title"><a name="forks-initiating"></a>&#21021;&#22987;&#19968;&#20010;&#20998;&#21449;</h3></div></div></div><p>&#36825;&#37324;&#30340;&#25152;&#26377;&#24314;&#35758;&#20551;&#35774;&#20320;&#23558;&#20998;&#21449;&#20316;&#20026;&#26368;&#21518;&#30340;&#20381;&#38752;&#12290;&#21021;&#22987;&#20998;&#21449;&#21069;&#32791;&#23613;&#20102;&#25152;&#26377;&#30340;&#21487;&#33021;&#24615;&#12290;&#20998;&#21449;&#24635;&#26159;&#24847;&#21619;&#30528;&#20002;&#22833;&#24320;&#21457;&#32773;&#65292;&#21482;&#30041;&#19979;&#19968;&#20010;&#19981;&#30830;&#23450;&#30340;&#22312;&#20197;&#21518;&#33719;&#24471;&#26032;&#20135;&#21697;&#30340;&#25215;&#35834;&#12290;&#23427;&#20063;&#24847;&#21619;&#30528;&#24320;&#22987;&#20102;&#23545;&#29992;&#25143;&#27880;&#24847;&#21147;&#30340;&#31454;&#36187;&#65306;&#27599;&#20010;&#19979;&#36733;&#36825;&#20010;&#36719;&#20214;&#30340;&#20154;&#37117;&#20250;&#38382;&#33258;&#24049;&#65306;&#8220;&#21734;&#65292;&#36825;&#20010;&#36824;&#26159;&#37027;&#20010;&#65311; &#8221; &#26080;&#35770;&#20320;&#26159;&#21738;&#20010;&#65292;&#24773;&#20917;&#20063;&#26159;&#32942;&#33039;&#30340;&#65292;&#22240;&#20026;&#20986;&#29616;&#20102;&#21407;&#26412;&#19981;&#23384;&#22312;&#30340;&#38382;&#39064;&#12290;&#19968;&#20123;&#32500;&#25252;&#20998;&#21449;&#30340;&#20154;&#20204;&#20250;&#32500;&#25252;&#36719;&#20214;&#30340;&#25972;&#20307;&#29983;&#24577;&#31995;&#32479;&#30340;&#20581;&#24247;&#65292;&#36890;&#36807;&#26631;&#20934;&#30340;&#33258;&#28982;&#36873;&#25321;&#35770;&#28857;&#65306;&#36866;&#32773;&#29983;&#23384;&#65292;&#24847;&#21619;&#30528;&#26368;&#32456;&#27599;&#20010;&#20154;&#24471;&#21040;&#26356;&#22909;&#30340;&#36719;&#20214;&#12290;&#20174;&#29983;&#24577;&#23398;&#30340;&#35282;&#24230;&#36825;&#25110;&#35768;&#26159;&#27491;&#30830;&#30340;&#65292;&#20294;&#23545;&#20110;&#21333;&#20010;&#39033;&#30446;&#26469;&#35828;&#21017;&#24182;&#19981;&#27491;&#30830;&#12290;&#22823;&#22810;&#25968;&#20998;&#21449;&#24182;&#19981;&#25104;&#21151;&#65292;&#22823;&#22810;&#25968;&#39033;&#30446;&#19981;&#21916;&#27426;&#34987;&#20998;&#21449;&#12290;</p><p>&#19968;&#20010;&#25512;&#35770;&#23601;&#26159;&#19981;&#35201;&#20351;&#29992;&#20998;&#21449;&#30340;&#23041;&#32961;&#20316;&#20026;&#26497;&#31471;&#30340;&#36777;&#35770;&#25216;&#24039;&#8212;&#8220;&#25353;&#29031;&#25105;&#30340;&#26041;&#24335;&#65292;&#21542;&#21017;&#25105;&#35201;&#23558;&#39033;&#30446;&#20998;&#21449;&#65281; &#8221;&#8212;&#22240;&#20026;&#27599;&#20010;&#20154;&#37117;&#20250;&#24847;&#35782;&#21040;&#22914;&#26524;&#26159;&#26080;&#27861;&#21560;&#24341;&#24320;&#21457;&#32773;&#31163;&#24320;&#21407;&#39033;&#30446;&#30340;&#20998;&#21449;&#65292;&#19981;&#22826;&#21487;&#33021;&#38271;&#20037;&#23384;&#27963;&#12290;&#25152;&#26377;&#30340;&#35266;&#23519;&#32773;&#8212;&#19981;&#20165;&#26159;&#24320;&#21457;&#32773;&#65292;&#36824;&#26377;&#29992;&#25143;&#21644;&#25805;&#20316;&#31995;&#32479;&#25171;&#21253;&#32773;&#8212;&#20250;&#23545;&#36873;&#25321;&#21738;&#19968;&#26041;&#20570;&#20986;&#33258;&#24049;&#30340;&#21028;&#26029;&#12290;&#20320;&#19981;&#24517;&#34920;&#29616;&#20986;&#26497;&#31471;&#19981;&#24773;&#24895;&#20998;&#21449;&#65292;&#36825;&#26679;&#22914;&#26524;&#20320;&#26368;&#32456;&#36825;&#26679;&#20570;&#20102;&#65292;&#20320;&#21487;&#20197;&#20809;&#33635;&#30340;&#23459;&#24067;&#36825;&#26159;&#26368;&#21518;&#19968;&#26465;&#36335;&#12290;</p><p>&#22312;&#35780;&#20272;&#20320;&#30340;&#20998;&#21449;&#25104;&#21151;&#21487;&#33021;&#24615;&#26102;&#65292;&#19981;&#35201;&#24573;&#35270;<span class="emphasis"><em>&#25152;&#26377;&#30340;</em></span>&#22240;&#32032;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#39033;&#30446;&#30340;&#35768;&#22810;&#24320;&#21457;&#32773;&#37117;&#26377;&#21516;&#19968;&#20010;&#38599;&#20027;&#65292;&#37027;&#20040;&#21363;&#20351;&#20182;&#20204;&#19981;&#28385;&#19988;&#31169;&#19979;&#37324;&#20542;&#21521;&#20110;&#20998;&#21449;&#65292;&#20063;&#19981;&#22826;&#20250;&#22823;&#22768;&#35828;&#20986;&#20182;&#20204;&#30340;&#38599;&#20027;&#26159;&#36190;&#25104;&#36824;&#26159;&#21453;&#23545;&#12290;&#35768;&#22810;&#33258;&#30001;&#36719;&#20214;&#31243;&#24207;&#21592;&#20197;&#20026;&#22914;&#26524;&#20195;&#30721;&#26377;&#33258;&#30001;&#35768;&#21487;&#35777;&#65292;&#37027;&#20040;&#27809;&#26377;&#21738;&#20010;&#20844;&#21496;&#21487;&#20197;&#25511;&#21046;&#24320;&#21457;&#12290;&#35768;&#21487;&#35777;&#30830;&#23454;&#22914;&#27492;&#65292;&#26159;&#19968;&#31181;&#32456;&#26497;&#24847;&#35782;&#65292;&#33258;&#30001;&#30340;&#20445;&#38556;&#8212;&#22914;&#26524;&#20854;&#20182;&#20154;&#24378;&#28872;&#30340;&#24076;&#26395;&#20998;&#21449;&#39033;&#30446;&#65292;&#24182;&#26377;&#36275;&#22815;&#30340;&#36164;&#28304;&#65292;&#23427;&#21487;&#20197;&#36825;&#26679;&#20570;&#12290;&#20294;&#26159;&#22312;&#23454;&#36341;&#20013;&#65292;&#19968;&#20123;&#39033;&#30446;&#24320;&#21457;&#22242;&#38431;&#22823;&#22810;&#30001;&#19968;&#20010;&#23454;&#20307;&#36164;&#21161;&#65292;&#27809;&#26377;&#35777;&#25454;&#35828;&#26126;&#36825;&#20123;&#23454;&#20307;&#30340;&#25903;&#25345;&#26080;&#20851;&#32039;&#35201;&#12290;&#22914;&#26524;&#20182;&#20204;&#21453;&#23545;&#20998;&#21449;&#65292;&#20182;&#20204;&#30340;&#24320;&#21457;&#32773;&#19981;&#20250;&#31163;&#24320;&#65292;&#21363;&#20351;&#31169;&#19979;&#37324;&#24076;&#26395;&#22914;&#27492;&#12290;</p><p>&#22914;&#26524;&#20320;&#36824;&#26159;&#30830;&#35748;&#24517;&#39035;&#20998;&#21449;&#65292;&#26368;&#22909;&#39318;&#20808;&#31169;&#19979;&#32852;&#32476;&#22909;&#25903;&#25345;&#65292;&#28982;&#21518;&#20351;&#29992;&#19981;&#21547;&#25932;&#24847;&#30340;&#35821;&#35843;&#23459;&#24067;&#20998;&#21449;&#12290;&#21363;&#20351;&#20320;&#23545;&#24403;&#21069;&#30340;&#32500;&#25252;&#32773;&#24863;&#21040;&#24868;&#24594;&#65292;&#25110;&#32773;&#22833;&#26395;&#65292;&#19981;&#35201;&#22312;&#36825;&#20123;&#20449;&#24687;&#20013;&#20889;&#20986;&#26469;&#12290;&#21482;&#38656;&#35201;&#19981;&#38706;&#22768;&#33394;&#30340;&#38472;&#36848;&#23548;&#33268;&#20320;&#20915;&#23450;&#20998;&#21449;&#30340;&#21160;&#26426;&#65292;&#20197;&#21450;&#20320;&#23545;&#25152;&#20998;&#21449;&#21407;&#39033;&#30446;&#24182;&#26080;&#25932;&#24847;&#12290;&#20551;&#23450;&#20320;&#32771;&#34385;&#19968;&#27425;&#20998;&#21449;&#65288;&#30456;&#23545;&#20110;&#23545;&#21407;&#39033;&#30446;&#30340;&#32039;&#24613;&#20445;&#23384;&#65289;&#65292;&#24378;&#35843;&#20320;&#20998;&#21449;&#30340;&#26159;&#20195;&#30721;&#32780;&#19981;&#26159;&#21517;&#31216;&#65292;&#24182;&#36873;&#25321;&#19968;&#20010;&#19982;&#21407;&#39033;&#30446;&#19981;&#20250;&#20914;&#31361;&#30340;&#21517;&#31216;&#12290;&#20320;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#21253;&#21547;&#25110;&#24341;&#29992;&#21407;&#21517;&#31216;&#30340;&#21517;&#31216;&#65292;&#21482;&#35201;&#19981;&#20250;&#36896;&#25104;&#35782;&#21035;&#19978;&#30340;&#28151;&#28102;&#12290;&#24403;&#28982;&#65292;&#22312;&#20998;&#21449;&#30340;&#20027;&#39029;&#19978;&#20063;&#21487;&#20197;&#31361;&#20986;&#35299;&#37322;&#20854;&#26469;&#33258;&#30340;&#21407;&#22987;&#31243;&#24207;&#65292;&#29978;&#33267;&#23545;&#20110;&#26367;&#20195;&#23427;&#30340;&#26399;&#26395;&#12290;&#20294;&#26159;&#19981;&#35201;&#36843;&#20351;&#29992;&#25143;&#35299;&#24320;&#35782;&#21035;&#20105;&#35758;&#65292;&#32473;&#20182;&#20204;&#24102;&#26469;&#39069;&#22806;&#30340;&#40635;&#28902;&#12290;</p><p>&#26368;&#32456;&#65292;&#36890;&#36807;&#20026;&#21407;&#39033;&#30446;&#30340;&#25152;&#26377;&#25552;&#20132;&#32773;&#65292;&#21253;&#25324;&#37027;&#20123;&#20844;&#24320;&#21453;&#23545;&#20998;&#21449;&#30340;&#25552;&#20132;&#32773;&#36171;&#20104;&#25552;&#20132;&#26435;&#38480;&#65292;&#23601;&#21487;&#20197;&#33258;&#21160;&#35753;&#20107;&#24773;&#24320;&#22987;&#36816;&#36716;&#12290;&#21363;&#20351;&#20182;&#20204;&#19981;&#20250;&#35775;&#38382;&#65292;&#20294;&#20320;&#30340;&#20449;&#24687;&#26159;&#26126;&#30830;&#30340;&#65306;&#36825;&#37324;&#23384;&#22312;&#20105;&#35758;&#65292;&#20294;&#26159;&#27809;&#26377;&#25932;&#20154;&#65292;&#20320;&#27426;&#36814;&#26469;&#33258;&#25152;&#26377;&#31454;&#20105;&#28304;&#30340;&#20195;&#30721;&#36129;&#29486;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2947" href="#idp2947" class="para">29</a>] </sup>&#29616;&#22312;&#26159;RedHat&#65288;<a class="ulink" href="http://www.redhat.com/" target="_top">http://www.redhat.com/</a>&#65289;&#30340;&#19968;&#37096;&#20998;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="credit.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="legal.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#33635;&#35465; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</td></tr></table></div></body></html>
