<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="contracting.html" title="&#22865;&#32422;"><link rel="next" href="marketing.html" title="&#24066;&#22330;&#33829;&#38144;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="contracting.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="marketing.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="funding-non-programming"></a>&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;</h2></div></div></div><p>&#32534;&#31243;&#21482;&#26159;&#24320;&#28304;&#39033;&#30446;&#30340;&#25152;&#26377;&#24037;&#20316;&#30340;&#19968;&#37096;&#20998;&#12290;&#20174;&#39033;&#30446;&#24535;&#24895;&#32773;&#30340;&#35270;&#35282;&#65292;&#36825;&#26159;&#26368;&#26126;&#26174;&#21644;&#36855;&#20154;&#30340;&#37096;&#20998;&#12290;&#24456;&#19981;&#24184;&#65292;&#36825;&#24847;&#21619;&#30528;&#20854;&#20182;&#27963;&#21160;&#65292;&#20363;&#22914;&#25991;&#26723;&#12289;&#27491;&#24335;&#27979;&#35797;&#31561;&#31561;&#65292;&#26159;&#21487;&#20197;&#24573;&#30053;&#30340;&#65292;&#33267;&#23569;&#19982;&#31169;&#26377;&#36719;&#20214;&#30456;&#27604;&#65292;&#25237;&#20837;&#20102;&#26356;&#23569;&#30340;&#31934;&#21147;&#12290;&#20844;&#21496;&#32452;&#32455;&#26377;&#26102;&#21487;&#20197;&#24357;&#34917;&#36825;&#20214;&#20107;&#65292;&#36890;&#36807;&#25237;&#20837;&#19968;&#20123;&#20182;&#20204;&#20869;&#37096;&#36719;&#20214;&#24320;&#21457;&#26102;&#30340;&#22522;&#30784;&#26550;&#26500;&#21040;&#24320;&#28304;&#39033;&#30446;&#12290;</p><p>&#22312;&#20844;&#21496;&#20869;&#37096;&#36807;&#31243;&#21644;&#20844;&#20849;&#24320;&#21457;&#31038;&#21306;&#20043;&#38388;&#30340;&#36716;&#25442;&#26159;&#25104;&#21151;&#30340;&#20851;&#38190;&#12290;&#19981;&#36807;&#36825;&#31181;&#36716;&#25442;&#20063;&#19981;&#26159;&#36731;&#32780;&#26131;&#20030;&#30340;&#65306;&#36890;&#24120;&#20108;&#32773;&#24182;&#19981;&#26159;&#19968;&#22330;&#25509;&#36817;&#30340;&#27604;&#36187;&#65292;&#36825;&#31181;&#21306;&#21035;&#21482;&#33021;&#36890;&#36807;&#20154;&#20026;&#24178;&#39044;&#36830;&#25509;&#36215;&#26469;&#12290;&#20363;&#22914;&#65292;&#20844;&#21496;&#20250;&#20351;&#29992;&#19982;&#20844;&#20849;&#39033;&#30446;&#19981;&#21516;&#30340;bug&#36319;&#36394;&#31995;&#32479;&#12290;&#21363;&#20351;&#20351;&#29992;&#30456;&#21516;&#30340;&#36319;&#36394;&#36719;&#20214;&#65292;&#20854;&#20013;&#23384;&#25918;&#30340;&#25968;&#25454;&#20063;&#20250;&#22823;&#19981;&#30456;&#21516;&#65292;&#22240;&#20026;&#19968;&#20010;&#20844;&#21496;&#38656;&#35201;&#30340;bug&#36319;&#36394;&#19982;&#33258;&#30001;&#36719;&#20214;&#31038;&#21306;&#23436;&#20840;&#19981;&#21516;&#12290;&#20301;&#20110;&#26576;&#19968;&#36319;&#36394;&#31995;&#32479;&#30340;&#20449;&#24687;&#22312;&#26144;&#23556;&#21040;&#21478;&#19968;&#20010;&#31995;&#32479;&#26102;&#65292;&#24517;&#28982;&#35201;&#21024;&#38500;&#26426;&#23494;&#37096;&#20998;&#65292;&#20174;&#21478;&#19968;&#20010;&#26041;&#21521;&#26469;&#35828;&#65292;&#21017;&#26159;&#35201;&#28155;&#21152;&#12290;</p><p>&#26412;&#23567;&#33410;&#20313;&#19979;&#37096;&#20998;&#20851;&#20110;&#22914;&#20309;&#26500;&#24314;&#21644;&#32500;&#25252;&#36825;&#31181;&#32852;&#31995;&#12290;&#26368;&#21518;&#30340;&#32467;&#26524;&#24517;&#23450;&#26159;&#24320;&#28304;&#36719;&#20214;&#36816;&#34892;&#30340;&#26356;&#21152;&#24179;&#28369;&#65292;&#31038;&#21306;&#20250;&#35748;&#21487;&#20844;&#21496;&#23545;&#20110;&#36164;&#28304;&#30340;&#25237;&#36164;&#65292;&#20063;&#19981;&#20250;&#24863;&#21040;&#20844;&#21496;&#25484;&#25511;&#20107;&#24773;&#24448;&#33258;&#24049;&#30340;&#30446;&#26631;&#21457;&#23637;&#26377;&#20160;&#20040;&#19981;&#36866;&#21512;&#12290;</p><div class="sect2" title="&#36136;&#37327;&#20445;&#35777;&#65288;&#20063;&#25104;&#20026;&#19987;&#19994;&#27979;&#35797;&#65289;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-qa"></a>&#36136;&#37327;&#20445;&#35777;&#65288;&#20063;&#25104;&#20026;&#19987;&#19994;&#27979;&#35797;&#65289;</h3></div></div></div><p>&#22312;&#31169;&#26377;&#36719;&#20214;&#24320;&#21457;&#20013;&#65292;&#19968;&#33324;&#37117;&#26377;&#19968;&#32452;&#20154;&#19987;&#27880;&#20110;&#36136;&#37327;&#20445;&#35777;&#65306;&#23547;&#25214;bug&#12289;&#24615;&#33021;&#21644;&#25193;&#23637;&#24615;&#27979;&#35797;&#12289;&#25509;&#21475;&#21644;&#25991;&#26723;&#26816;&#26597;&#31561;&#31561;&#12290;&#20316;&#20026;&#19968;&#33324;&#30340;&#21407;&#21017;&#65292;&#27492;&#31867;&#27963;&#21160;&#19968;&#33324;&#19981;&#20250;&#34987;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#24535;&#24895;&#32773;&#31038;&#21306;&#31215;&#26497;&#30340;&#36861;&#27714;&#12290;&#37096;&#20998;&#21407;&#22240;&#26159;&#24456;&#38590;&#20026;&#27979;&#35797;&#20043;&#31867;&#30340;&#19981;&#36215;&#30524;&#24037;&#20316;&#25214;&#21040;&#24535;&#24895;&#32773;&#65292;&#20063;&#22240;&#20026;&#20154;&#20204;&#24635;&#26159;&#20551;&#23450;&#20182;&#20204;&#26377;&#19968;&#20010;&#22823;&#30340;&#29992;&#25143;&#31038;&#21306;&#65292;&#21487;&#20197;&#32473;&#39033;&#30446;&#22909;&#30340;&#27979;&#35797;&#35206;&#30422;&#65292;&#20197;&#21450;&#24615;&#33021;&#21644;&#25193;&#23637;&#24615;&#27979;&#35797;&#65292;&#20063;&#22240;&#20026;&#24535;&#24895;&#32773;&#32463;&#24120;&#26080;&#27861;&#20351;&#29992;&#24517;&#35201;&#30340;&#30828;&#20214;&#36164;&#28304;&#12290;</p><p>&#26377;&#24456;&#22810;&#29992;&#25143;&#31561;&#20215;&#20110;&#26377;&#35768;&#22810;&#27979;&#35797;&#32773;&#30340;&#20551;&#35774;&#24182;&#19981;&#25104;&#31435;&#12290;&#35802;&#28982;&#65292;&#26377;&#26102;&#20505;&#20998;&#37197;&#27979;&#35797;&#32773;&#22312;&#26222;&#36890;&#29615;&#22659;&#20013;&#36827;&#34892;&#22522;&#26412;&#21151;&#33021;&#27979;&#35797;&#26377;&#19968;&#28857;&#29992;&#22788;&#65306;bug&#20250;&#22312;&#29992;&#25143;&#30340;&#26085;&#24120;&#25805;&#20316;&#20013;&#36805;&#36895;&#34987;&#21457;&#29616;&#12290;&#20294;&#26159;&#22240;&#20026;&#29992;&#25143;&#21482;&#26159;&#26399;&#26395;&#25226;&#20107;&#24773;&#23436;&#25104;&#65292;&#20182;&#20204;&#19981;&#20250;&#26377;&#24847;&#35782;&#30340;&#24320;&#22987;&#25506;&#32034;&#31243;&#24207;&#26410;&#30693;&#30340;&#26368;&#26032;&#21151;&#33021;&#12290;&#27492;&#22806;&#65292;&#24403;&#20182;&#20204;&#22312;&#19968;&#20010;&#31616;&#21333;&#30340;&#22330;&#26223;&#21457;&#29616;&#20102;&#19968;&#20010;bug&#65292;&#20182;&#20204;&#32463;&#24120;&#24708;&#24708;&#30340;&#23454;&#29616;&#36825;&#20010;&#22330;&#26223;&#65292;&#32780;&#19981;&#20250;&#21435;&#25253;&#21578;&#36825;&#20010;bug&#12290;&#22823;&#22810;&#25968;&#27809;&#26377;&#24847;&#35782;&#21040;&#65292;&#20320;&#30340;&#23458;&#25143;&#65288;&#39537;&#20351;<span class="emphasis"><em>&#20320;</em></span>&#36827;&#34892;&#36719;&#20214;&#24320;&#21457;&#30340;&#20154;&#65289;&#23545;&#20110;&#36719;&#20214;&#30340;&#20351;&#29992;&#27169;&#24335;&#20250;&#19982;&#26222;&#36890;&#29992;&#25143;&#30340;&#20351;&#29992;&#27169;&#24335;&#22312;&#32479;&#35745;&#23398;&#19978;&#26377;&#26174;&#33879;&#30340;&#19981;&#21516;&#12290;</p><p>&#19987;&#19994;&#30340;&#27979;&#35797;&#22242;&#38431;&#21487;&#20197;&#36805;&#36895;&#21457;&#29616;&#27492;&#31867;bug&#65292;&#21644;&#20182;&#20204;&#22312;&#31169;&#26377;&#36719;&#20214;&#26102;&#19968;&#26679;&#23481;&#26131;&#12290;&#30495;&#27491;&#30340;&#25361;&#25112;&#26159;&#23558;&#27979;&#35797;&#22242;&#38431;&#30340;&#32467;&#26524;&#20197;&#26377;&#29992;&#30340;&#24418;&#24335;&#21453;&#39304;&#32473;&#20844;&#20247;&#12290;&#22312;&#20869;&#37096;&#27979;&#35797;&#37096;&#38376;&#20013;&#65292;&#36890;&#24120;&#26377;&#33258;&#24049;&#25253;&#21578;&#27979;&#35797;&#32467;&#26524;&#30340;&#26041;&#27861;&#65292;&#20063;&#38656;&#35201;&#20351;&#29992;&#20844;&#21496;&#29305;&#23450;&#30340;&#26415;&#35821;&#65292;&#25110;&#19982;&#29305;&#23450;&#23458;&#25143;&#21644;&#20182;&#20204;&#25968;&#25454;&#38598;&#30456;&#20851;&#30340;&#19987;&#19994;&#30693;&#35782;&#12290;&#36825;&#31181;&#25253;&#21578;&#23545;&#20110;&#20844;&#20849;bug&#36319;&#36394;&#24182;&#19981;&#36866;&#21512;&#65292;&#19968;&#26041;&#38754;&#26159;&#22240;&#20026;&#20854;&#26684;&#24335;&#65292;&#21478;&#19968;&#26041;&#38754;&#26159;&#22240;&#20026;&#26426;&#23494;&#24615;&#12290;&#21363;&#20351;&#20320;&#20844;&#21496;&#30340;&#20869;&#37096;bug&#36319;&#36394;&#36719;&#20214;&#19982;&#20844;&#20849;&#39033;&#30446;&#30456;&#21516;&#65292;&#20173;&#28982;&#38656;&#35201;&#23545;&#27492;&#38382;&#39064;&#21457;&#29983;&#30340;&#20844;&#21496;&#29305;&#23450;&#30340;&#35780;&#35770;&#21644;&#20803;&#25968;&#25454;&#21464;&#26356;&#36827;&#34892;&#31649;&#29702;&#65288;&#20363;&#22914;&#65292;&#25552;&#21319;&#26576;&#20010;&#38382;&#39064;&#30340;&#20869;&#37096;&#31561;&#32423;&#65292;&#25110;&#32773;&#35774;&#23450;&#20854;&#20026;&#29305;&#23450;&#23458;&#25143;&#36827;&#34892;&#35299;&#20915;&#65289;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#27880;&#37322;&#26159;&#26426;&#23494;&#30340;&#8212;&#26377;&#26102;&#20505;&#20182;&#20204;&#29978;&#33267;&#19981;&#20250;&#23637;&#31034;&#32473;&#23458;&#25143;&#12290;&#20294;&#26159;&#21363;&#20351;&#27809;&#26377;&#26426;&#23494;&#65292;&#20182;&#20204;&#23545;&#20110;&#20844;&#20849;&#39033;&#30446;&#20063;&#27809;&#26377;&#24847;&#20041;&#65292;&#22240;&#27492;&#20844;&#20247;&#19981;&#24819;&#22240;&#27492;&#20998;&#25955;&#27880;&#24847;&#21147;&#12290;</p><p>&#26680;&#24515;bug&#25253;&#21578;&#26412;&#36523;&#23545;&#20110;&#20844;&#20247;<span class="emphasis"><em>&#38750;&#24120;</em></span>&#37325;&#35201;&#12290;&#23454;&#38469;&#19978;&#65292;&#26469;&#33258;&#27979;&#35797;&#22242;&#38431;&#30340;bug&#25253;&#21578;&#20250;&#27604;&#26222;&#36890;&#29992;&#25143;&#30340;&#25253;&#21578;&#26356;&#26377;&#20215;&#20540;&#65292;&#22240;&#20026;&#27979;&#35797;&#22242;&#38431;&#26159;&#22312;&#20026;&#21457;&#29616;&#38382;&#39064;&#36827;&#34892;&#25506;&#27979;&#65292;&#32780;&#26222;&#36890;&#29992;&#25143;&#19981;&#26159;&#12290;&#22240;&#20026;&#20320;&#19981;&#22826;&#21487;&#33021;&#20174;&#20219;&#20309;&#20854;&#20182;&#26469;&#28304;&#33719;&#21462;&#36825;&#26679;&#30340;bug&#25253;&#21578;&#65292;&#20320;&#19968;&#23450;&#24076;&#26395;&#23558;&#20854;&#20445;&#30041;&#24182;&#21457;&#24067;&#32473;&#20844;&#20247;&#12290;</p><p>&#20026;&#27492;&#65292;&#22914;&#26524;&#20182;&#20204;&#24895;&#24847;&#65292;&#25110;&#32773;&#21487;&#20197;&#23558;&#20869;&#37096;&#27979;&#35797;&#25253;&#21578;&#30340;&#38382;&#39064;&#36716;&#21270;&#21040;&#20844;&#20849;&#36319;&#36394;&#31995;&#32479;&#20013;&#65292;QA&#37096;&#38376;&#21487;&#20197;&#22312;&#20844;&#20849;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#20013;&#24402;&#26723;&#38382;&#39064;&#12290;&#36716;&#21270;&#20165;&#20165;&#24847;&#21619;&#30528;&#20351;&#29992;&#19981;&#28041;&#21450;&#29992;&#25143;&#29305;&#23450;&#20449;&#24687;&#65288;&#37325;&#29616;&#30340;&#22788;&#26041;&#20250;&#20351;&#29992;&#29992;&#25143;&#25968;&#25454;&#65292;&#24403;&#28982;&#35201;&#20551;&#23450;&#29992;&#25143;&#23545;&#27492;&#35748;&#21487;&#65289;&#30340;&#26041;&#24335;&#25551;&#36848;bug&#12290;</p><p>&#25512;&#33616;&#35753;QA&#37096;&#38376;&#22312;&#20844;&#20849;&#36319;&#36394;&#31995;&#32479;&#30452;&#25509;&#22635;&#20889;&#38382;&#39064;&#12290;&#36825;&#26679;&#20250;&#35753;&#20844;&#20247;&#23545;&#20320;&#20844;&#21496;&#30340;&#25237;&#20837;&#26356;&#21152;&#24863;&#28608;&#65306;&#26377;&#29992;&#30340;bug&#25253;&#21578;&#21644;&#25216;&#26415;&#36129;&#29486;&#19968;&#26679;&#20250;&#22686;&#21152;&#20320;&#30340;&#32452;&#32455;&#30340;&#20449;&#35465;&#12290;&#36825;&#26679;&#20063;&#32473;&#20102;&#24320;&#21457;&#32773;&#19968;&#20010;&#19982;&#27979;&#35797;&#22242;&#38431;&#30452;&#25509;&#20132;&#27969;&#30340;&#28192;&#36947;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20869;&#37096;QA&#22242;&#38431;&#30417;&#25511;&#30528;&#20844;&#20849;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#65292;&#19968;&#20010;&#24320;&#21457;&#32773;&#21487;&#20197;&#20026;&#19968;&#20010;&#21487;&#37327;&#27979;bug&#65288;&#24320;&#21457;&#32773;&#27809;&#26377;&#36164;&#28304;&#33258;&#24049;&#27979;&#35797;&#65289;&#25552;&#20132;&#20462;&#27491;&#65292;&#24182;&#20026;&#35813;&#38382;&#39064;&#25552;&#20132;&#19968;&#20010;&#35828;&#26126;&#35810;&#38382;QA&#22242;&#38431;&#26597;&#30475;&#35813;&#20462;&#27491;&#26159;&#21542;&#36215;&#21040;&#20102;&#39044;&#26399;&#30340;&#25928;&#26524;&#12290;&#20063;&#35768;&#20250;&#36935;&#21040;&#19968;&#20123;&#24320;&#21457;&#32773;&#30340;&#25269;&#21046;&#65307;&#26368;&#22909;&#24773;&#20917;&#19979;&#65292;&#31243;&#24207;&#21592;&#20250;&#25226;QA&#24403;&#20316;&#24517;&#35201;&#30340;&#39764;&#39740;&#12290;&#36890;&#36807;&#21457;&#29616;&#26174;&#33879;&#30340;bug&#65292;&#22635;&#20889;&#22797;&#26434;&#30340;&#25253;&#21578;&#65292;QA&#22242;&#38431;&#21487;&#20197;&#36731;&#26131;&#30340;&#36798;&#21040;&#36825;&#20010;&#30446;&#26631;&#65307;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20182;&#20204;&#30340;&#25253;&#21578;&#29978;&#33267;&#27809;&#26377;&#26469;&#33258;&#26222;&#36890;&#29992;&#25143;&#31038;&#21306;&#30340;&#25253;&#21578;&#36136;&#37327;&#39640;&#65292;&#37027;&#20040;&#35753;&#20182;&#20204;&#19982;&#24320;&#21457;&#22242;&#38431;&#30452;&#25509;&#20132;&#27969;&#20063;&#27809;&#26377;&#20160;&#20040;&#24847;&#20041;&#12290;</p><p>&#26080;&#35770;&#21738;&#19968;&#31181;&#26041;&#27861;&#65292;&#19968;&#26086;&#20844;&#20849;&#38382;&#39064;&#24050;&#32463;&#23384;&#22312;&#65292;&#21407;&#26469;&#30340;&#20869;&#37096;&#38382;&#39064;&#23601;&#24212;&#24403;&#22312;&#25216;&#26415;&#20869;&#23481;&#20013;&#24341;&#29992;&#20844;&#20849;&#38382;&#39064;&#12290;&#31649;&#29702;&#23618;&#21644;&#26377;&#34218;&#24320;&#21457;&#32773;&#26681;&#25454;&#38656;&#35201;&#65292;&#25110;&#35768;&#21487;&#20197;&#32487;&#32493;&#20851;&#27880;&#21253;&#21547;&#20844;&#21496;&#29305;&#23450;&#27880;&#37322;&#30340;&#20869;&#37096;&#38382;&#39064;&#65292;&#20294;&#26159;&#20351;&#29992;&#20844;&#20849;&#38382;&#39064;&#21487;&#20197;&#35753;&#25152;&#26377;&#20154;&#30475;&#21040;&#23545;&#24212;&#30340;&#20449;&#24687;&#12290;</p><p>&#20320;&#24212;&#24403;&#20250;&#39044;&#26399;&#26377;&#39069;&#22806;&#30340;&#25104;&#26412;&#12290;&#32500;&#25252;&#19968;&#20010;bug&#30340;&#20004;&#20010;&#38382;&#39064;&#65292;&#23558;&#20250;&#27604;&#19968;&#20010;&#26102;&#32791;&#36153;&#26356;&#22810;&#30340;&#24037;&#20316;&#12290;&#22909;&#22788;&#26159;&#65292;&#23558;&#26377;&#26356;&#22810;&#30340;&#31243;&#24207;&#21592;&#23558;&#20250;&#30475;&#21040;&#36825;&#20010;&#25253;&#21578;&#65292;&#24182;&#19988;&#33021;&#20026;&#36825;&#20010;&#35299;&#20915;&#26041;&#26696;&#20316;&#20986;&#36129;&#29486;&#12290;</p></div><div class="sect2" title="&#27861;&#24459;&#24314;&#35758;&#21644;&#20445;&#25252;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-legal"></a>&#27861;&#24459;&#24314;&#35758;&#21644;&#20445;&#25252;</h3></div></div></div><p>&#20844;&#21496;&#65292;&#26080;&#35770;&#26159;&#30408;&#21033;&#25110;&#38750;&#36194;&#21033;&#65292;&#24656;&#24597;&#26159;&#21807;&#19968;&#22312;&#33258;&#30001;&#36719;&#20214;&#20013;&#23558;&#31934;&#21147;&#25237;&#20837;&#21040;&#27861;&#24459;&#38382;&#39064;&#19978;&#30340;&#23454;&#20307;&#12290;&#21333;&#20010;&#24320;&#21457;&#32773;&#36890;&#24120;&#29702;&#35299;&#22810;&#31181;&#24320;&#28304;&#35768;&#21487;&#35777;&#30340;&#24494;&#22937;&#65292;&#20294;&#20182;&#20204;&#27809;&#26377;&#26102;&#38388;&#21644;&#36164;&#28304;&#21435;&#23545;&#29256;&#26435;&#12289;&#21830;&#26631;&#21644;&#29256;&#26435;&#27861;&#36827;&#34892;&#35814;&#32454;&#30740;&#31350;&#12290;&#22914;&#26524;&#20320;&#30340;&#20844;&#21496;&#25317;&#26377;&#27861;&#24459;&#37096;&#38376;&#65292;&#21487;&#20197;&#36890;&#36807;&#21542;&#20915;&#20195;&#30721;&#30340;&#29256;&#26435;&#29366;&#24577;&#26469;&#24110;&#21161;&#39033;&#30446;&#65292;&#24182;&#21487;&#20197;&#24110;&#21161;&#24320;&#21457;&#32773;&#29702;&#35299;&#21487;&#33021;&#30340;&#29256;&#26435;&#21644;&#21830;&#26631;&#38382;&#39064;&#12290;&#22914;&#20309;&#24110;&#21161;&#30340;&#20855;&#20307;&#24418;&#24335;&#23558;&#20250;&#22312;<a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#35752;&#35770;&#12290;&#20027;&#35201;&#26159;&#30830;&#20445;&#27861;&#24459;&#37096;&#38376;&#21644;&#24320;&#21457;&#31038;&#21306;&#30340;&#20132;&#27969;&#65292;&#22914;&#26524;&#21457;&#29983;&#36825;&#31181;&#20132;&#27969;&#65292;&#20027;&#35201;&#26159;&#22240;&#20026;&#23436;&#20840;&#19981;&#21516;&#30340;&#21452;&#26041;&#37117;&#26377;&#30456;&#20114;&#30340;&#28212;&#26395;&#12290;&#22312;&#20598;&#28982;&#24773;&#20917;&#19979;&#65292;&#36825;&#20004;&#32452;&#20154;&#20250;&#20114;&#30456;&#35752;&#35770;&#65292;&#27599;&#19968;&#26041;&#20250;&#20551;&#23450;&#25317;&#26377;&#21478;&#19968;&#26041;&#27809;&#26377;&#30340;&#39046;&#22495;&#29305;&#23450;&#30693;&#35782;&#12290;&#19968;&#20010;&#22909;&#30340;&#31574;&#30053;&#26159;&#22312;&#20013;&#38388;&#35774;&#23450;&#19968;&#20010;&#32852;&#32476;&#65292;&#22312;&#20219;&#20309;&#38656;&#35201;&#30340;&#26102;&#20505;&#36827;&#34892;&#36716;&#21270;&#12290;</p></div><div class="sect2" title="&#25991;&#26723;&#21644;&#21487;&#29992;&#24615;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-documentation-usability"></a>&#25991;&#26723;&#21644;&#21487;&#29992;&#24615;</h3></div></div></div><p>&#25991;&#26723;&#21644;&#21487;&#29992;&#24615;&#37117;&#26159;&#24320;&#28304;&#39033;&#30446;&#33879;&#21517;&#30340;&#36719;&#32907;&#65292;&#23613;&#31649;&#25105;&#35748;&#20026;&#65292;&#22312;&#25991;&#26723;&#26041;&#38754;&#65292;&#33258;&#30001;&#21644;&#31169;&#26377;&#36719;&#20214;&#30340;&#24046;&#36317;&#34987;&#22840;&#22823;&#20102;&#12290;&#28982;&#32780;&#26681;&#25454;&#32463;&#39564;&#65292;&#22823;&#22810;&#25968;&#24320;&#28304;&#36719;&#20214;&#32570;&#20047;&#19968;&#27969;&#30340;&#25991;&#26723;&#21644;&#21487;&#29992;&#24615;&#30740;&#31350;&#12290;</p><p>&#22914;&#26524;&#20320;&#30340;&#32452;&#32455;&#24076;&#26395;&#20026;&#19968;&#20010;&#39033;&#30446;&#24357;&#34917;&#36825;&#20010;&#24046;&#36317;&#65292;&#26368;&#22909;&#38599;&#20323;&#19968;&#20123;<span class="emphasis"><em>&#19981;&#23646;&#20110;</em></span>&#39033;&#30446;&#24120;&#35268;&#24320;&#21457;&#32773;&#65292;&#20294;&#21487;&#20197;&#19982;&#24320;&#21457;&#32773;&#36827;&#34892;&#26377;&#25928;&#29575;&#20132;&#27969;&#30340;&#20154;&#12290;&#19981;&#38599;&#20323;&#24320;&#21457;&#32773;&#26377;&#20004;&#20010;&#21407;&#22240;&#65306;&#39318;&#20808;&#65292;&#20320;&#19981;&#20250;&#20174;&#39033;&#30446;&#24102;&#36208;&#24320;&#21457;&#26102;&#38388;&#65307;&#20854;&#27425;&#65292;&#36317;&#31163;&#39033;&#30446;&#36807;&#36817;&#30340;&#20154;&#36890;&#24120;&#19981;&#26159;&#32534;&#20889;&#25991;&#26723;&#25110;&#30740;&#31350;&#21487;&#29992;&#24615;&#30340;&#26368;&#20339;&#20154;&#36873;&#65292;&#20182;&#20204;&#24456;&#38590;&#20174;&#22806;&#37096;&#35270;&#35282;&#35266;&#23519;&#36719;&#20214;&#12290;</p><p>&#28982;&#32780;&#65292;&#20174;&#20107;&#35813;&#24037;&#20316;&#30340;&#20154;&#36824;&#26159;&#26377;&#24517;&#35201;&#19982;&#24320;&#21457;&#32773;&#36827;&#34892;&#20132;&#27969;&#12290;&#25214;&#21040;&#30340;&#20154;&#38656;&#35201;&#25317;&#26377;&#19982;&#32534;&#30721;&#22242;&#38431;&#20132;&#27969;&#30340;&#25216;&#33021;&#65292;&#20294;&#19981;&#24517;&#23545;&#36719;&#20214;&#36807;&#20110;&#19987;&#19994;&#32780;&#26080;&#27861;&#31227;&#24773;&#20110;&#26222;&#36890;&#29992;&#25143;&#12290;</p><p>&#19968;&#20010;&#20013;&#31561;&#29992;&#25143;&#24456;&#21487;&#33021;&#26159;&#32534;&#20889;&#22909;&#25991;&#26723;&#30340;&#21512;&#36866;&#20154;&#36873;&#12290;&#23454;&#38469;&#19978;&#65292;&#26412;&#20070;&#21457;&#34892;&#31532;&#19968;&#29256;&#21518;&#65292;&#25105;&#25910;&#21040;&#24320;&#28304;&#24320;&#21457;&#32773;Dirk Reiners&#30340;&#19968;&#23553;&#30005;&#23376;&#37038;&#20214;&#65306;</p><pre class="screen">
&#20851;&#20110;&#37329;&#38065;::&#25991;&#26723;&#21644;&#21487;&#29992;&#24615;&#30340;&#19968;&#20123;&#24847;&#35265;&#65306;&#24403;&#25105;&#20204;&#35201;&#33457;&#19968;&#20123;&#38065;
&#24182;&#20915;&#23450;&#25105;&#20204;&#26368;&#38656;&#35201;&#30340;&#26159;&#32534;&#20889;&#21021;&#23398;&#32773;&#25945;&#31243;&#26102;&#65292;&#25105;&#20204;&#38599;&#20323;&#20102;&#19968;
&#20010;&#20013;&#32423;&#29992;&#25143;&#12290;&#20182;&#21018;&#21018;&#32463;&#21382;&#20102;&#31995;&#32479;&#30340;&#20837;&#38376;&#65292;&#25152;&#20197;&#33021;&#22815;&#35760;&#20303;&#38382;&#39064;
&#65292;&#20294;&#26159;&#22240;&#20026;&#24050;&#32463;&#36890;&#36807;&#38382;&#39064;&#65292;&#25152;&#20197;&#20182;&#30693;&#36947;&#22914;&#20309;&#25551;&#36848;&#38382;&#39064;&#12290;&#36825;&#26679;
&#20182;&#23601;&#21487;&#20197;&#32534;&#20889;&#19968;&#20123;&#21482;&#38656;&#30001;&#26680;&#24515;&#24320;&#21457;&#32773;&#36827;&#34892;&#23569;&#37327;&#20462;&#27491;&#30340;&#20869;&#23481;&#65292;
&#21516;&#26102;&#36824;&#26159;&#20250;&#35206;&#30422;&#24320;&#21457;&#32452;&#20250;&#35748;&#20026;&#8216;&#38750;&#24120;&#26126;&#26174;&#30340;&#8217;&#32780;&#36951;&#28431;&#30340;&#20869;&#23481;&#12290;
&#20182;&#30340;&#26696;&#20363;&#29978;&#33267;&#26356;&#22909;&#65292;&#38543;&#30528;&#20182;&#30340;&#24037;&#20316;&#65292;&#24341;&#20837;&#20102;&#35768;&#22810;&#29992;&#25143;&#65288;&#23398;
&#29983;&#65289;&#36827;&#20837;&#31995;&#32479;&#65292;&#25152;&#20197;&#20182;&#32452;&#21512;&#20102;&#35768;&#22810;&#20154;&#30340;&#32463;&#39564;&#65292;&#26377;&#26102;&#20505;&#26576;&#20123;&#20107;
&#30475;&#36215;&#26469;&#21482;&#26159;&#22909;&#36816;&#24403;&#22836;&#65292;&#24656;&#24597;&#19981;&#26159;&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#37117;&#26377;&#25928;&#12290;
</pre></div><div class="sect2" title="&#25552;&#20379;&#20027;&#26426;/&#24102;&#23485;"><div class="titlepage"><div><div><h3 class="title"><a name="subsidize-hosting"></a>&#25552;&#20379;&#20027;&#26426;/&#24102;&#23485;</h3></div></div></div><p>&#23545;&#20110;&#19981;&#20351;&#29992;&#21253;&#35013;&#20027;&#26426;&#30340;&#31449;&#28857;&#65288;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="web-site.html#canned-hosting" title="&#21253;&#35013;&#20027;&#26426;">the section called &#8220;&#21253;&#35013;&#20027;&#26426;&#8221;</a>&#65289;&#65292;&#25552;&#20379;&#26381;&#21153;&#22120;&#21644;&#32593;&#32476;&#36830;&#25509;&#8212;&#20197;&#21450;&#26356;&#37325;&#35201;&#30340;&#31995;&#32479;&#31649;&#29702;&#24110;&#21161;&#8212;&#20250;&#26159;&#37325;&#35201;&#30340;&#36741;&#21161;&#12290;&#21363;&#20351;&#36825;&#26159;&#20320;&#30340;&#32452;&#32455;&#20026;&#39033;&#30446;&#25152;&#20570;&#30340;&#21807;&#19968;&#24037;&#20316;&#65292;&#20063;&#26159;&#19968;&#31181;&#33719;&#21462;&#20844;&#20849;&#20851;&#31995;&#22238;&#25253;&#30340;&#36866;&#24230;&#26377;&#25928;&#30340;&#26041;&#27861;&#65292;&#23613;&#31649;&#65292;&#23427;&#19981;&#20250;&#24102;&#26469;&#20219;&#20309;&#23545;&#20110;&#39033;&#30446;&#26041;&#21521;&#30340;&#24433;&#21709;&#12290;</p><p>&#20320;&#21487;&#33021;&#20250;&#22312;&#39033;&#30446;&#20027;&#39029;&#21457;&#29616;&#19968;&#20010;&#24191;&#21578;&#26465;&#25110;&#33268;&#35874;&#65292;&#29992;&#20197;&#24863;&#35874;&#25552;&#20379;&#20027;&#26426;&#30340;&#20844;&#21496;&#12290;&#22914;&#26524;&#20320;&#36890;&#36807;&#35774;&#32622;&#20027;&#26426;&#65292;&#35753;&#39033;&#30446;&#32593;&#22336;&#20301;&#20110;&#20844;&#21496;&#22495;&#21517;&#20043;&#19979;&#65292;&#37027;&#20040;&#21333;&#32431;&#36890;&#36807;URL&#20320;&#23601;&#33719;&#24471;&#20102;&#39069;&#22806;&#30340;&#32852;&#31995;&#12290;&#36825;&#20250;&#23548;&#33268;&#22823;&#22810;&#25968;&#29992;&#25143;&#35748;&#20026;&#36719;&#20214;&#19982;&#20320;&#30340;&#20844;&#21496;&#26377;&#20851;&#65292;&#21363;&#20351;&#27809;&#26377;&#22312;&#24320;&#21457;&#20013;&#20316;&#20986;&#20219;&#20309;&#36129;&#29486;&#12290;&#38382;&#39064;&#26159;&#65292;&#24320;&#21457;&#32773;&#20063;&#20250;&#24847;&#35782;&#21040;&#36825;&#31181;&#20851;&#32852;&#30340;&#36235;&#21183;&#65292;&#20250;&#23545;&#39033;&#30446;&#20301;&#20110;&#20320;&#30340;&#39046;&#22495;&#24863;&#21040;&#19981;&#36866;&#65292;&#38500;&#38750;&#20320;&#33021;&#36129;&#29486;&#20986;&#38500;&#24102;&#23485;&#20197;&#22806;&#30340;&#26356;&#22810;&#36164;&#28304;&#12290;&#27605;&#31455;&#65292;&#29616;&#22312;&#26377;&#24456;&#22810;&#23384;&#25918;&#20027;&#26426;&#30340;&#22320;&#26041;&#12290;&#31038;&#21306;&#20250;&#26368;&#32456;&#24863;&#35273;&#21040;&#36825;&#31181;&#38544;&#21547;&#20449;&#29992;&#20998;&#21270;&#19982;&#20027;&#26426;&#24102;&#26469;&#30340;&#20415;&#21033;&#24182;&#19981;&#30456;&#37197;&#65292;&#24182;&#23558;&#39033;&#30446;&#24102;&#21040;&#21035;&#30340;&#22320;&#26041;&#12290;&#25152;&#20197;&#65292;&#22914;&#26524;&#20320;&#24076;&#26395;&#25552;&#20379;&#20027;&#26426;&#65292;&#35201;&#36825;&#26679;&#20570;&#8212;&#19981;&#20294;&#35201;&#35745;&#21010;&#25237;&#20837;&#26356;&#22810;&#65292;&#26356;&#35201;&#32454;&#24515;&#30340;&#32771;&#34385;&#22768;&#26126;&#25237;&#20837;&#22810;&#23569;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="contracting.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="marketing.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#22865;&#32422; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#24066;&#22330;&#33829;&#38144;</td></tr></table></div></body></html>
