<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 2. &#36215;&#27493;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="today.html" title="&#29616;&#29366;"><link rel="next" href="license-quickstart.html" title="&#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 2. &#36215;&#27493;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="today.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="license-quickstart.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 2. &#36215;&#27493;"><div class="titlepage"><div><div><h2 class="title"><a name="getting-started"></a>Chapter 2. &#36215;&#27493;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="getting-started.html#starting-from-what-you-have">&#20174;&#20320;&#25152;&#25317;&#26377;&#30340;&#24320;&#22987;</a></span></dt><dd><dl><dt><span class="sect2"><a href="getting-started.html#choosing-a-name">&#36873;&#25321;&#19968;&#20010;&#22909;&#21517;&#23383;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#mission-statement">&#26377;&#19968;&#20221;&#28165;&#26970;&#30340;&#20351;&#21629;&#38472;&#36848;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#state-freedom">&#22768;&#26126;&#39033;&#30446;&#26159;&#33258;&#30001;&#36719;&#20214;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#features-and-requirements">&#29305;&#24615;&#21644;&#38656;&#27714;&#21015;&#34920;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#development-status">&#24320;&#21457;&#29366;&#24577;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#downloads">&#19979;&#36733;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#vc-and-bug-tracker-access">&#29256;&#26412;&#25511;&#21046;&#21644;Bug&#36319;&#36394;&#35775;&#38382;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#communications-channels">&#27807;&#36890;&#28192;&#36947;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#developer-guidelines">&#24320;&#21457;&#32773;&#25351;&#21335;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#documentation">&#25991;&#26723;</a></span></dt><dd><dl><dt><span class="sect3"><a href="getting-started.html#documentation-availability">&#25991;&#26723;&#30340;&#21487;&#29992;&#24615;</a></span></dt><dt><span class="sect3"><a href="getting-started.html#developer-documentation">&#24320;&#21457;&#32773;&#25991;&#26723;</a></span></dt></dl></dd><dt><span class="sect2"><a href="getting-started.html#example-output">&#36755;&#20986;&#21644;&#23631;&#24149;&#25130;&#22270;&#23454;&#20363;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#starting-with-canned-hosting">&#21253;&#35013;&#20027;&#26426;</a></span></dt></dl></dd><dt><span class="sect1"><a href="license-quickstart.html">&#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992;</a></span></dt><dd><dl><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-non-gpl">&#8220;&#21487;&#20197;&#20570;&#20219;&#20309;&#20107;&#24773;&#30340;&#8221;&#35768;&#21487;&#35777;</a></span></dt><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-gpl">GPL</a></span></dt><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-applying">&#22914;&#20309;&#20026;&#20320;&#30340;&#36719;&#20214;&#24212;&#29992;&#35768;&#21487;&#35777;</a></span></dt></dl></dd><dt><span class="sect1"><a href="setting-tone.html">&#35774;&#32622;&#39118;&#26684;</a></span></dt><dd><dl><dt><span class="sect2"><a href="setting-tone.html#avoid-private-discussions">&#36991;&#20813;&#31169;&#19979;&#35752;&#35770;</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#prevent-rudeness">&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#code-review">&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#opening-closed-projects">&#23558;&#19968;&#20010;&#23553;&#38381;&#39033;&#30446;&#24320;&#25918;&#26102;&#65292;&#23545;&#20110;&#25913;&#21464;&#30340;&#24433;&#21709;&#35201;&#26684;&#22806;&#25935;&#24863;</a></span></dt></dl></dd><dt><span class="sect1"><a href="announcing.html">&#36890;&#21578;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#26377;&#20851;&#33258;&#30001;&#36719;&#20214;&#26159;&#22914;&#20309;&#21457;&#36215;&#30340;&#32463;&#20856;&#27169;&#22411;&#26159;&#30001;Eric Raymond&#25552;&#20986;&#30340;&#65292;&#22312;&#19968;&#31687;&#20170;&#22825;&#24050;&#24191;&#20026;&#20154;&#30693;&#30340;&#26377;&#20851;&#24320;&#28304;&#24320;&#21457;&#30340;&#35770;&#25991;<em class="citetitle">&#12298;&#22823;&#25945;&#22530;&#21644;&#38598;&#24066;&#12299;</em>&#20013;&#65292;&#20182;&#20889;&#36947;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#27599;&#19968;&#20010;&#22909;&#30340;&#36719;&#20214;&#37117;&#22987;&#20110;&#25376;&#21040;&#19968;&#20010;&#24320;&#21457;&#32773;&#30340;&#30162;&#30162;&#22788;&#12290;</em></span></p><p>&#65288;&#26469;&#33258;<span class="bold"><strong><a class="ulink" href="http://www.catb.org/~esr/writings/cathedral-bazaar/" target="_top">http://www.catb.org/~esr/writings/cathedral-bazaar/</a></strong></span>&#65289;</p></blockquote></div><p>&#27880;&#24847;Raymond&#24182;&#27809;&#26377;&#35828;&#21482;&#26377;&#24403;&#26576;&#20123;&#24320;&#21457;&#20154;&#21592;&#24515;&#37324;&#30162;&#30162;&#20043;&#21518;&#25165;&#20250;&#23548;&#33268;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#30340;&#35806;&#29983;&#12290;&#30456;&#21453;&#65292;&#20182;&#26159;&#35828;&#21482;&#26377;&#24403;&#31243;&#24207;&#21592;&#23545;&#35299;&#20915;&#26576;&#20010;&#38382;&#39064;&#20135;&#29983;&#20102;&#20010;&#20154;&#20852;&#36259;&#20043;&#21518;&#65292;&#25165;&#33021;&#20135;&#29983;&#20248;&#31168;&#30340;&#36719;&#20214;&#65307;&#36825;&#19968;&#28857;&#21516;&#33258;&#30001;&#36719;&#20214;&#30340;&#32852;&#31995;&#22312;&#20110;&#65292;&#22823;&#37096;&#20998;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#26368;&#21021;&#21160;&#26426;&#37117;&#26159;&#22987;&#20110;&#19968;&#20010;&#20154;&#30340;&#30162;&#30162;&#22788;&#12290;</p><p>&#36825;&#20173;&#28982;&#26159;&#22823;&#37096;&#20998;&#39033;&#30446;&#30340;&#21160;&#22240;&#65292;&#20294;&#33258;&#20174;1997&#24180;Raymond&#20889;&#19979;&#36825;&#20123;&#35805;&#20043;&#21518;&#36825;&#31181;&#29616;&#35937;&#27491;&#22312;&#24930;&#24930;&#20943;&#23569;&#12290;&#20170;&#22825;&#25105;&#20204;&#26377;&#20102;&#19968;&#20123;&#32452;&#32455;&#8212;&#21253;&#25324;&#30408;&#21033;&#24615;&#30340;&#22823;&#20225;&#19994;&#8212;&#20174;&#38646;&#24320;&#22987;&#22823;&#22411;&#30340;&#65292;&#38598;&#20013;&#24335;&#31649;&#29702;&#30340;&#24320;&#28304;&#39033;&#30446;&#12290;&#21333;&#20010;&#30340;&#31243;&#24207;&#21592;&#20026;&#20102;&#35299;&#20915;&#19968;&#20010;&#20010;&#20154;&#38382;&#39064;&#25970;&#20986;&#19968;&#20123;&#20195;&#30721;&#32780;&#26368;&#21518;&#24847;&#35782;&#21040;&#21487;&#20197;&#26377;&#26356;&#24191;&#27867;&#22320;&#24212;&#29992;&#30340;&#20363;&#23376;&#20173;&#28982;&#26159;&#35768;&#22810;&#26032;&#33258;&#30001;&#36719;&#20214;&#30340;&#28304;&#22836;&#65292;&#20294;&#19981;&#20877;&#26159;&#21807;&#19968;&#30340;&#25925;&#20107;&#12290;</p><p>&#28982;&#32780;Raymond&#30340;&#35266;&#28857;&#20173;&#28982;&#26159;&#30495;&#30693;&#28796;&#35265;&#12290;&#20851;&#38190;&#22312;&#20110;&#36719;&#20214;&#30340;&#29983;&#20135;&#32773;&#23545;&#23427;&#30340;&#25104;&#21151;&#26377;&#30452;&#25509;&#30340;&#20852;&#36259;&#65292;&#22240;&#20026;&#26159;&#33258;&#24049;&#29992;&#12290;&#22914;&#26524;&#36719;&#20214;&#27809;&#33021;&#36798;&#21040;&#26399;&#26395;&#30340;&#30446;&#26631;&#65292;&#37027;&#20123;&#32534;&#20889;&#23427;&#30340;&#20010;&#20154;&#25110;&#26159;&#32452;&#32455;&#20250;&#22312;&#26085;&#24120;&#24037;&#20316;&#20013;&#24863;&#21040;&#19981;&#28385;&#12290;&#20363;&#22914;&#65292;OpenAdapter&#39033;&#30446;&#65288;<a class="ulink" href="http://www.openadapter.org/" target="_top">http://www.openadapter.org/</a>&#65289;&#65292;&#36825;&#26159;&#19968;&#20010;&#30001;&#24503;&#32047;&#26031;&#39039;·&#20811;&#33713;&#27779;&#29305;&#25237;&#36164;&#38134;&#34892;&#65288;investment
bank Dresdner Kleinwort Wasserstein&#65289;&#21457;&#36215;&#30340;&#19968;&#20010;&#29992;&#20110;&#38598;&#25104;&#19981;&#21516;&#36130;&#32463;&#20449;&#24687;&#31995;&#32479;&#30340;&#24320;&#28304;&#26694;&#26550;&#65292;&#23601;&#24456;&#38590;&#35828;&#26159;&#22987;&#20110;&#21738;&#20010;&#31243;&#24207;&#21592;&#30340;&#20010;&#20154;&#30162;&#30162;&#22788;&#12290;&#23427;&#22987;&#20110;&#19968;&#20010;&#32452;&#32455;&#30340;&#30162;&#30162;&#22788;&#12290;&#36825;&#20123;&#30162;&#30162;&#22788;&#30452;&#25509;&#26469;&#33258;&#36825;&#20010;&#32452;&#32455;&#21644;&#20182;&#20204;&#30340;&#21512;&#20249;&#20154;&#30340;&#32463;&#39564;&#65292;&#22240;&#27492;&#22914;&#26524;&#36825;&#20010;&#39033;&#30446;&#27809;&#33021;&#20943;&#36731;&#36825;&#20123;&#30162;&#30162;&#30151;&#65292;&#20182;&#20204;&#31435;&#21051;&#33021;&#22815;&#24863;&#35273;&#21040;&#12290;&#36825;&#31181;&#24773;&#24418;&#20135;&#20986;&#20102;&#20248;&#31168;&#30340;&#36719;&#20214;&#65292;&#22240;&#20026;&#24418;&#25104;&#20102;&#19968;&#20010;&#33391;&#24615;&#30340;&#24490;&#29615;&#12290;&#31243;&#24207;&#19981;&#26159;&#20026;&#20102;&#21334;&#32473;&#20854;&#20182;&#20154;&#32780;&#32534;&#20889;&#30340;&#65292;&#19981;&#26159;&#20026;&#35299;&#20915;<span class="emphasis"><em>&#20182;&#20154;&#30340;</em></span>&#38382;&#39064;&#12290;&#23427;&#26159;&#20026;&#35299;&#20915;&#26576;&#20010;<span class="emphasis"><em>&#33258;&#24049;&#30340;</em></span>&#38382;&#39064;&#32780;&#32534;&#20889;&#30340;&#65292;&#20043;&#21518;&#20877;&#21516;&#20854;&#20182;&#30340;&#20154;&#20998;&#20139;&#65292;&#36275;&#21487;&#20197;&#25226;&#38382;&#39064;&#24819;&#20687;&#25104;&#30142;&#30149;&#65292;&#32780;&#31243;&#24207;&#26159;&#20998;&#21457;&#30340;&#33647;&#29289;&#65292;&#29992;&#26469;&#24443;&#24213;&#22320;&#28040;&#28781;&#20256;&#26579;&#30149;&#12290;</p><p>&#26412;&#31456;&#26159;&#20851;&#20110;&#22914;&#20309;&#23558;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20171;&#32461;&#32473;&#20840;&#19990;&#30028;&#65292;&#20294;&#26159;&#20854;&#20013;&#30340;&#24456;&#22810;&#24314;&#35758;&#21548;&#36215;&#26469;&#20250;&#24456;&#20687;&#19968;&#20010;&#21355;&#29983;&#32452;&#32455;&#22312;&#20998;&#21457;&#33647;&#29289;&#12290;&#20004;&#32773;&#30340;&#30446;&#26631;&#30340;&#30830;&#38750;&#24120;&#30456;&#20284;&#65306;&#20320;&#35201;&#24324;&#28165;&#26970;&#33647;&#21697;&#30340;&#20316;&#29992;&#65292;&#25226;&#23427;&#21457;&#25918;&#21040;&#38656;&#35201;&#30340;&#20154;&#25163;&#20013;&#65292;&#24182;&#30830;&#20445;&#37027;&#20123;&#20154;&#30693;&#36947;&#22914;&#20309;&#20351;&#29992;&#23427;&#12290;&#20294;&#23545;&#19968;&#20010;&#36719;&#20214;&#65292;&#20320;&#36824;&#38656;&#35201;&#35825;&#20351;&#37027;&#20123;&#25509;&#21463;&#32773;&#21152;&#20837;&#30740;&#31350;&#35745;&#21010;&#26469;&#25913;&#36827;&#8220;&#33647;&#29289;&#8221;&#12290;</p><p>&#33258;&#30001;&#36719;&#20214;&#30340;&#21457;&#24067;&#26159;&#19968;&#39033;&#21452;&#37325;&#20219;&#21153;&#12290;&#36719;&#20214;&#26082;&#35201;&#28385;&#36275;&#20351;&#29992;&#32773;&#65292;&#20063;&#35201;&#28385;&#36275;&#24320;&#21457;&#32773;&#12290;&#36825;&#20004;&#31181;&#38656;&#27714;&#19981;&#19968;&#23450;&#26159;&#20914;&#31361;&#30340;&#65292;&#20294;&#26159;&#20250;&#20026;&#39033;&#30446;&#21021;&#26399;&#30340;&#23637;&#31034;&#22686;&#21152;&#22797;&#26434;&#24230;&#12290;&#20854;&#20013;&#26377;&#20123;&#20449;&#24687;&#23545;&#20004;&#32773;&#37117;&#26377;&#29992;&#65292;&#26377;&#20123;&#21482;&#26159;&#23545;&#20854;&#20013;&#19968;&#31867;&#26377;&#29992;&#12290;&#23545;&#20004;&#31181;&#20449;&#24687;&#37117;&#24212;&#35813;&#20381;&#29031;&#23637;&#31034;&#30340;&#27604;&#20363;&#21407;&#21017;&#65306;&#25551;&#36848;&#30340;&#35814;&#32454;&#31243;&#24230;&#24212;&#35813;&#21516;&#35835;&#32773;&#22312;&#35813;&#38454;&#27573;&#25152;&#24212;&#35813;&#33457;&#36153;&#30340;&#26102;&#38388;&#21644;&#21162;&#21147;&#31243;&#24230;&#30456;&#23545;&#24212;&#12290;&#26356;&#22810;&#30340;&#21162;&#21147;&#24212;&#35813;&#24102;&#26469;&#26356;&#22810;&#30340;&#22238;&#25253;&#12290;&#24403;&#36825;&#31181;&#20851;&#31995;&#21457;&#29983;&#20559;&#24046;&#26102;&#65292;&#20154;&#20204;&#26377;&#21487;&#33021;&#24456;&#24555;&#22833;&#21435;&#20449;&#20219;&#24182;&#19988;&#20572;&#27490;&#25237;&#20837;&#31934;&#21147;&#12290;</p><p>&#36825;&#19968;&#28857;&#30340;&#24517;&#28982;&#32467;&#26524;&#23601;&#26159;<span class="emphasis"><em>&#24418;&#35937;</em></span>&#30340;&#37325;&#35201;&#24615;&#12290;&#31243;&#24207;&#21592;&#20204;&#23545;&#36825;&#19968;&#28857;&#24635;&#26159;&#21988;&#20043;&#20197;&#40763;&#12290;&#23545;&#26412;&#36136;&#36229;&#36234;&#24418;&#24335;&#30340;&#28909;&#29233;&#25104;&#20102;&#20182;&#20204;&#32844;&#19994;&#33258;&#35946;&#24863;&#30340;&#19968;&#37096;&#20998;&#12290;&#25152;&#20197;&#27627;&#19981;&#24847;&#22806;&#65292;&#35768;&#22810;&#31243;&#24207;&#21592;&#34920;&#29616;&#20986;&#23545;&#33829;&#38144;&#21644;&#20844;&#20851;&#24037;&#20316;&#30340;&#21388;&#24694;&#65292;&#21516;&#26679;&#65292;&#32844;&#19994;&#22270;&#24418;&#35774;&#35745;&#24072;&#24448;&#24448;&#20063;&#23545;&#31243;&#24207;&#21592;&#20204;&#30340;&#20135;&#21697;&#24863;&#21040;&#24778;&#24656;&#19975;&#29366;&#12290;</p><p>&#36825;&#26159;&#19968;&#20010;&#36951;&#25022;&#65292;&#22240;&#20026;&#26377;&#26102;&#20505;&#24418;&#24335;<span class="emphasis"><em>&#23601;&#26159;</em></span>&#26412;&#36136;&#65292;&#24182;&#19988;&#39033;&#30446;&#30340;&#23637;&#31034;&#23601;&#26159;&#36825;&#31181;&#24773;&#24418;&#20043;&#19968;&#12290;&#20363;&#22914;&#65292;&#27983;&#35272;&#32593;&#39029;&#30340;&#20154;&#23545;&#19968;&#20010;&#39033;&#30446;&#30340;&#31532;&#19968;&#35266;&#24863;&#23601;&#26159;&#26469;&#33258;&#32593;&#31449;&#30340;&#22806;&#35266;&#12290;&#36825;&#31181;&#35266;&#24863;&#30340;&#24418;&#25104;&#35201;&#26089;&#20110;&#20219;&#20309;&#19968;&#31181;&#23454;&#38469;&#30340;&#20869;&#23481;&#20043;&#21069;&#8212;&#21253;&#25324;&#25991;&#23383;&#21644;&#38142;&#25509;&#12290;&#19981;&#31649;&#36825;&#30475;&#36215;&#26469;&#22810;&#20040;&#19981;&#20844;&#24179;&#65292;&#20154;&#20204;&#26080;&#27861;&#19981;&#24418;&#25104;&#19968;&#20010;&#21363;&#26102;&#30340;&#31532;&#19968;&#21360;&#35937;&#12290;&#32593;&#31449;&#30340;&#24418;&#35937;&#21521;&#35835;&#32773;&#20256;&#36882;&#20102;&#19968;&#20010;&#20449;&#21495;&#65292;&#21363;&#32593;&#31449;&#30340;&#23637;&#31034;&#26159;&#21542;&#32463;&#36807;&#20102;&#31934;&#24515;&#23433;&#25490;&#12290;&#20154;&#31867;&#23545;&#26816;&#27979;&#24515;&#24605;&#30340;&#25237;&#20837;&#26377;&#30528;&#26497;&#20026;&#25935;&#38160;&#30340;&#24863;&#35273;&#12290;&#25105;&#20204;&#20013;&#30340;&#22823;&#22810;&#25968;&#20154;&#37117;&#33021;&#22312;&#19968;&#30629;&#38388;&#30475;&#20986;&#19968;&#20010;&#32593;&#31449;&#26159;&#38543;&#20415;&#25289;&#36215;&#26469;&#30340;&#36824;&#26159;&#32463;&#36807;&#35748;&#30495;&#24605;&#32771;&#30340;&#12290;&#36825;&#26159;&#20320;&#30340;&#39033;&#30446;&#23637;&#29616;&#20986;&#20449;&#24687;&#30340;&#31532;&#19968;&#27493;&#65292;&#23427;&#25152;&#24314;&#31435;&#36215;&#26469;&#30340;&#21360;&#35937;&#23558;&#23545;&#25972;&#20010;&#39033;&#30446;&#30340;&#21518;&#32493;&#37096;&#20998;&#26045;&#21152;&#24433;&#21709;&#12290;</p><p>&#22240;&#27492;&#65292;&#23613;&#31649;&#26412;&#31456;&#30340;&#22823;&#37096;&#20998;&#31687;&#24133;&#35848;&#35770;&#30340;&#26159;&#20320;&#24212;&#35813;&#29992;&#20160;&#20040;&#26679;&#30340;&#20869;&#23481;&#24320;&#22987;&#20320;&#30340;&#39033;&#30446;&#65292;&#20294;&#21035;&#24536;&#20102;&#22806;&#35266;&#21644;&#24863;&#35273;&#21516;&#26679;&#37325;&#35201;&#12290;&#22240;&#20026;&#39033;&#30446;&#30340;&#32593;&#31449;&#21516;&#26102;&#20026;&#20351;&#29992;&#32773;&#21644;&#24320;&#21457;&#32773;&#20004;&#31867;&#20154;&#26381;&#21153;&#30340;&#65292;&#30456;&#24212;&#30340;&#25237;&#20837;&#20063;&#35201;&#36879;&#26126;&#21644;&#26377;&#38024;&#23545;&#24615;&#12290;&#34429;&#28982;&#36825;&#19981;&#26159;&#19968;&#26412;&#35752;&#35770;&#32593;&#39029;&#35774;&#35745;&#30340;&#19987;&#33879;&#65292;&#20294;&#26159;&#24403;&#32593;&#31449;&#26159;&#20026;&#22810;&#31181;&#31867;&#22411;&#30340;&#35835;&#32773;&#26381;&#21153;&#26102;&#65292;&#26377;&#19968;&#26465;&#37325;&#35201;&#21407;&#21017;&#26159;&#20540;&#24471;&#19968;&#25552;&#30340;&#65292;&#22312;&#28857;&#20987;&#19968;&#20010;&#38142;&#25509;&#20043;&#21069;&#29992;&#25143;&#24212;&#35813;&#23545;&#23427;&#30340;&#21435;&#22788;&#26377;&#19968;&#20010;&#22823;&#27010;&#30340;&#20102;&#35299;&#12290;&#20363;&#22914;&#65292;&#24403;&#30475;&#21040;&#8220;&#29992;&#25143;&#25991;&#26723;&#8221;&#30340;<span class="emphasis"><em>&#38142;&#25509;</em></span>&#26102;&#65292;&#26126;&#26174;&#24212;&#35813;&#26159;&#38142;&#25509;&#21040;&#29992;&#25143;&#25991;&#26723;&#65292;&#32780;&#19981;&#26159;&#24320;&#21457;&#32773;&#25991;&#26723;&#12290;&#36816;&#20316;&#19968;&#20010;&#39033;&#30446;&#19968;&#26041;&#38754;&#26159;&#20026;&#20102;&#25552;&#20379;&#20449;&#24687;&#65292;&#20294;&#21516;&#26102;&#20063;&#26159;&#25552;&#20379;&#33298;&#36866;&#12290;&#24403;&#29992;&#25143;&#21644;&#24320;&#21457;&#32773;&#20204;&#27491;&#22312;&#29369;&#35947;&#35201;&#19981;&#35201;&#21152;&#20837;&#26102;&#65292;&#20320;&#24212;&#35813;&#22312;&#39044;&#26399;&#30340;&#22320;&#26041;&#29992;&#19968;&#22871;&#32943;&#23450;&#24615;&#30340;&#26631;&#20934;&#26469;&#20351;&#20182;&#20204;&#23433;&#24515;&#12290;&#23427;&#34920;&#26126;&#39033;&#30446;&#26377;&#32479;&#19968;&#30340;&#31649;&#29702;&#65292;&#24050;&#32463;&#39044;&#20272;&#21040;&#20102;&#20154;&#20204;&#21487;&#33021;&#25552;&#20986;&#30340;&#38382;&#39064;&#65292;&#24182;&#19988;&#33268;&#21147;&#20110;&#22312;&#21482;&#33457;&#36153;&#25552;&#38382;&#32773;&#26368;&#23569;&#30340;&#31934;&#21147;&#30340;&#21069;&#25552;&#19979;&#26469;&#35299;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;&#36890;&#36807;&#26174;&#29616;&#36825;&#31181;&#20805;&#20998;&#20934;&#22791;&#30340;&#27675;&#22260;&#65292;&#35813;&#39033;&#30446;&#21457;&#20986;&#20102;&#19968;&#20010;&#20449;&#24687;&#65306;&#8220;&#22914;&#26524;&#21152;&#20837;&#65292;&#20320;&#30340;&#26102;&#38388;&#19981;&#20250;&#34987;&#30333;&#30333;&#28010;&#36153;&#65292;&#8221;&#32780;&#36825;&#27491;&#26159;&#20154;&#20204;&#24819;&#21548;&#21040;&#30340;&#12290;</p><div class="sect2" title="&#20294;&#39318;&#20808;&#29615;&#39038;&#22235;&#21608;"><div class="titlepage"><div><div><h3 class="title"><a name="look-around"></a>&#20294;&#39318;&#20808;&#29615;&#39038;&#22235;&#21608;</h3></div></div></div><p>&#24320;&#22987;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#20043;&#21069;&#65292;&#32473;&#20320;&#19968;&#20010;&#37325;&#35201;&#30340;&#21578;&#35819;&#65306;</p><p>&#19968;&#23450;&#35201;&#25214;&#25214;&#30475;&#26159;&#21542;&#26377;&#19968;&#20010;&#29616;&#23384;&#30340;&#39033;&#30446;&#24050;&#32463;&#20570;&#20102;&#20320;&#24819;&#20570;&#30340;&#12290;&#26377;&#24456;&#22823;&#30340;&#20960;&#29575;&#26377;&#20154;&#26089;&#20110;&#20320;&#24050;&#32463;&#35299;&#20915;&#20102;&#20320;&#24819;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;&#22914;&#26524;&#20182;&#20204;&#24050;&#32463;&#35299;&#20915;&#20102;&#23427;&#65292;&#24182;&#19988;&#22312;&#19968;&#20010;&#33258;&#30001;&#35768;&#21487;&#35777;&#19979;&#21457;&#24067;&#20102;&#20182;&#20204;&#30340;&#20195;&#30721;&#65292;&#37027;&#20170;&#22825;&#20320;&#23601;&#27809;&#26377;&#24517;&#35201;&#37325;&#26032;&#21457;&#26126;&#36718;&#23376;&#20102;&#12290;&#24403;&#28982;&#26377;&#20363;&#22806;&#65306;&#22914;&#26524;&#26159;&#20026;&#20102;&#32451;&#20064;&#25165;&#24320;&#22987;&#19968;&#20010;&#39033;&#30446;&#65292;&#37027;&#29616;&#26377;&#30340;&#20195;&#30721;&#23545;&#20320;&#27809;&#29992;&#65307;&#25110;&#32773;&#20320;&#33041;&#20013;&#30340;&#35745;&#21010;&#38750;&#24120;&#29305;&#21035;&#65292;&#20320;&#32943;&#23450;&#19981;&#20250;&#26377;&#20854;&#20182;&#20154;&#26377;&#21516;&#26679;&#30340;&#24819;&#27861;&#65292;&#37027;&#20320;&#20063;&#19981;&#22952;&#35797;&#35797;&#30475;&#12290;&#20294;&#24635;&#30340;&#26469;&#35828;&#27809;&#26377;&#29702;&#30001;&#19981;&#20808;&#30475;&#19968;&#30475;&#65292;&#32780;&#25910;&#33719;&#24635;&#26159;&#24456;&#22823;&#12290;&#22914;&#26524;&#24120;&#35265;&#30340;&#20114;&#32852;&#32593;&#25628;&#32034;&#24341;&#25806;&#21457;&#29616;&#19981;&#20102;&#20160;&#20040;&#65292;&#35797;&#35797;&#22312;<a class="ulink" href="http://freshmeat.net/" target="_top">http://freshmeat.net/</a>&#65288;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#30340;&#26032;&#38395;&#31449;&#28857;&#65292;&#26377;&#20851;&#23427;&#30340;&#26356;&#22810;&#20171;&#32461;&#23558;&#22312;&#21518;&#38754;&#25552;&#21040;&#65289;&#21644;<a class="ulink" href="http://www.sourceforge.net/" target="_top">http://www.sourceforge.net/</a>&#19978;&#25214;&#25214;&#30475;&#65292;&#21516;&#26102;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#26377;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#30340;&#30446;&#24405;&#22312;<a class="ulink" href="http://directory.fsf.org/" target="_top">http://directory.fsf.org/</a>&#12290;</p><p>&#21363;&#20351;&#20320;&#25214;&#19981;&#21040;&#36319;&#20320;&#30340;&#24819;&#27861;&#19968;&#27169;&#19968;&#26679;&#30340;&#39033;&#30446;&#65292;&#20320;&#20063;&#35768;&#33021;&#25214;&#21040;&#21313;&#20998;&#25509;&#36817;&#30340;&#65292;&#28982;&#21518;&#21152;&#20837;&#36825;&#20010;&#39033;&#30446;&#20026;&#23427;&#22686;&#21152;&#21151;&#33021;&#27604;&#20320;&#33258;&#24049;&#20174;&#38646;&#24320;&#22987;&#19968;&#20010;&#39033;&#30446;&#35201;&#26356;&#26377;&#24847;&#20041;&#12290;</p></div></div><div class="sect1" title="&#20174;&#20320;&#25152;&#25317;&#26377;&#30340;&#24320;&#22987;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="starting-from-what-you-have"></a>&#20174;&#20320;&#25152;&#25317;&#26377;&#30340;&#24320;&#22987;</h2></div></div></div><p>&#20320;&#29615;&#39038;&#20102;&#22235;&#21608;&#65292;&#27809;&#25214;&#21040;&#30495;&#27491;&#36866;&#21512;&#20320;&#30340;&#36719;&#20214;&#65292;&#22240;&#32780;&#20915;&#23450;&#24320;&#22987;&#19968;&#20010;&#26032;&#30340;&#39033;&#30446;&#12290;</p><p>&#29616;&#22312;&#24212;&#35813;&#20570;&#20160;&#20040;&#21602;&#65311;</p><p>&#24320;&#22987;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#26368;&#38590;&#30340;&#37096;&#20998;&#26159;&#23558;&#20010;&#20307;&#30340;&#35774;&#24819;&#36716;&#21270;&#20256;&#36798;&#32473;&#20844;&#20247;&#12290;&#20320;&#25110;&#26159;&#20320;&#30340;&#22242;&#20307;&#20063;&#35768;&#23545;&#35201;&#20570;&#30340;&#20107;&#24773;&#24050;&#32463;&#21313;&#20998;&#26126;&#20102;&#65292;&#20294;&#26159;&#23558;&#36825;&#19968;&#30446;&#26631;&#28165;&#26970;&#22320;&#20256;&#36798;&#32473;&#19990;&#30028;&#36824;&#38656;&#35201;&#20184;&#20986;&#19968;&#30058;&#21162;&#21147;&#12290;&#28982;&#32780;&#65292;&#37027;&#26159;&#24517;&#39035;&#33457;&#26102;&#38388;&#20570;&#30340;&#20107;&#24773;&#12290;&#20320;&#21644;&#20854;&#20182;&#30340;&#21019;&#24314;&#20154;&#24517;&#39035;&#20915;&#23450;&#20320;&#20204;&#39033;&#30446;&#30340;&#20316;&#29992;&#8212;&#20063;&#23601;&#26159;&#35828;&#65292;&#21010;&#23450;&#39033;&#30446;&#30340;&#33539;&#22260;&#65292;&#20570;&#20160;&#20040;&#65292;<span class="emphasis"><em>&#19981;&#20570;&#20160;&#20040;</em></span>&#8212;&#28982;&#21518;&#25776;&#20889;&#19968;&#20221;&#39033;&#30446;&#20219;&#21153;&#38472;&#36848;&#12290;&#36825;&#37096;&#20998;&#36890;&#24120;&#19981;&#22826;&#38590;&#65292;&#20294;&#26377;&#26102;&#20505;&#33021;&#26292;&#38706;&#20986;&#19968;&#20123;&#26377;&#20851;&#39033;&#30446;&#26412;&#36136;&#30340;&#33222;&#24819;&#65292;&#29978;&#33267;&#20110;&#20998;&#27495;&#65292;&#37027;&#20063;&#27809;&#20851;&#31995;&#65292;&#29616;&#22312;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#24635;&#27604;&#25302;&#21040;&#20197;&#21518;&#22909;&#12290;&#19979;&#19968;&#27493;&#23601;&#26159;&#23558;&#39033;&#30446;&#25171;&#21253;&#23637;&#31034;&#32473;&#20844;&#20247;&#65292; &#32780;&#37027;&#32431;&#31929;&#26159;&#21333;&#35843;&#20047;&#21619;&#30340;&#24037;&#20316;&#12290;</p><p>&#20043;&#25152;&#20197;&#36825;&#26679;&#35828;&#26159;&#22240;&#20026;&#25171;&#21253;&#30340;&#24037;&#20316;&#23601;&#26159;&#25226;&#22823;&#23478;&#37117;&#24050;&#32463;&#30693;&#36947;&#30340;&#19996;&#35199;&#32452;&#32455;&#21644;&#32534;&#36753;&#25104;&#25991;&#20214;&#8212;&#36825;&#37324;&#25152;&#35828;&#30340;&#8220;&#22823;&#23478;&#8221;&#25351;&#30340;&#26159;&#21040;&#30446;&#21069;&#20026;&#27490;&#21442;&#19982;&#39033;&#30446;&#24037;&#20316;&#30340;&#20154;&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#37027;&#20123;&#20570;&#36825;&#39033;&#24037;&#20316;&#30340;&#20154;&#26469;&#35828;&#65292;&#27809;&#26377;&#20160;&#20040;&#31435;&#31487;&#35265;&#24433;&#30340;&#22909;&#22788;&#12290;&#20182;&#20204;&#24182;&#19981;&#38656;&#35201;&#19968;&#20010;<code class="filename">README</code>&#26469;&#20102;&#35299;&#25972;&#20010;&#39033;&#30446;&#30340;&#27010;&#20917;&#65292;&#20063;&#19981;&#38656;&#35201;&#19968;&#20010;&#35774;&#35745;&#25991;&#20214;&#25110;&#26159;&#29992;&#25143;&#25163;&#20876;&#12290;&#20182;&#20204;&#19981;&#38656;&#35201;&#20180;&#32454;&#25490;&#21015;&#22909;&#30340;&#65292;&#19982;&#38750;&#27491;&#24335;&#32780;&#21448;&#26222;&#36941;&#37319;&#29992;&#30340;&#36719;&#20214;&#28304;&#30721;&#21457;&#24067;&#26041;&#24335;&#30456;&#19968;&#33268;&#30340;&#20195;&#30721;&#26641;&#24418;&#22270;&#12290;&#23545;&#20182;&#20204;&#26469;&#35828;&#65292;&#26080;&#35770;&#20195;&#30721;&#24590;&#20040;&#23433;&#25490;&#37117;&#27809;&#38382;&#39064;&#65292;&#22240;&#20026;&#20182;&#20204;&#24050;&#32463;&#23545;&#27492;&#21313;&#20998;&#29087;&#24713;&#65292;&#21482;&#35201;&#28304;&#30721;&#33021;&#22815;&#36816;&#34892;&#65292;&#20182;&#20204;&#23601;&#30693;&#36947;&#24590;&#20040;&#29992;&#12290;&#29978;&#33267;&#20110;&#65292;&#39033;&#30446;&#26368;&#26681;&#26412;&#30340;&#35774;&#35745;&#35774;&#24819;&#27809;&#26377;&#20570;&#25104;&#25991;&#20214;&#23545;&#20182;&#20204;&#26469;&#35828;&#20063;&#26159;&#26080;&#20851;&#32039;&#35201;&#30340;&#65307;&#22240;&#20026;&#20182;&#20204;&#23545;&#37027;&#19968;&#26041;&#38754;&#20063;&#24456;&#29087;&#24713;&#20102;&#12290;</p><p>&#28982;&#32780;&#65292;&#26032;&#21442;&#19982;&#30340;&#20154;&#38656;&#35201;&#36825;&#20123;&#19996;&#35199;&#12290;&#22909;&#22312;&#20182;&#20204;&#24182;&#19981;&#26159;&#22312;&#19968;&#24320;&#22987;&#23601;&#38656;&#35201;&#20840;&#37096;&#30340;&#36164;&#26009;&#12290;&#22312;&#19968;&#20010;&#39033;&#30446;&#20844;&#20043;&#20110;&#20247;&#20043;&#21069;&#65292;&#20320;&#19981;&#24517;&#25552;&#20379;&#27599;&#19968;&#20010;&#26377;&#20851;&#30340;&#32454;&#33410;&#12290;&#22312;&#19968;&#20010;&#29702;&#24819;&#30340;&#19990;&#30028;&#37324;&#65292;&#27599;&#19968;&#20010;&#26032;&#30340;&#24320;&#28304;&#36719;&#20214;&#39033;&#30446;&#22312;&#24320;&#22987;&#30340;&#26102;&#20505;&#23601;&#20855;&#22791;&#20102;&#19968;&#20010;&#35814;&#32454;&#30340;&#35774;&#35745;&#25991;&#20214;&#65292;&#19968;&#22871;&#23436;&#25972;&#30340;&#29992;&#25143;&#25163;&#20876;&#65288;&#23545;&#24050;&#32463;&#35745;&#21010;&#22909;&#20294;&#36824;&#26410;&#23454;&#26045;&#30340;&#29305;&#24615;&#26377;&#29305;&#21035;&#30340;&#26631;&#35782;&#65289;&#65292;&#28418;&#20142;&#22320;&#32780;&#21448;&#21487;&#31227;&#26893;&#22320;&#25171;&#22909;&#20102;&#21253;&#30340;&#20195;&#30721;&#65292;&#24182;&#19988;&#36824;&#21487;&#20197;&#22312;&#20219;&#20309;&#30005;&#33041;&#31995;&#32479;&#24179;&#21488;&#19978;&#36816;&#34892;&#31561;&#31561;&#12290;&#28982;&#32780;&#22312;&#29616;&#23454;&#24403;&#20013;&#65292;&#20570;&#22909;&#19978;&#36848;&#21508;&#39033;&#24037;&#20316;&#26159;&#38750;&#24120;&#32791;&#36153;&#26102;&#38388;&#30340;&#65292;&#21487;&#26159;&#19968;&#26086;&#39033;&#30446;&#21551;&#21160;&#20043;&#21518;&#65292;&#36825;&#20123;&#24037;&#20316;&#21487;&#20197;&#25351;&#26395;&#19968;&#20123;&#33258;&#24895;&#20154;&#21592;&#21327;&#21161;&#23436;&#25104;&#12290;</p><p>&#37325;&#35201;&#30340;<span class="emphasis"><em>&#26159;</em></span>&#24517;&#39035;&#20570;&#22909;&#23637;&#31034;&#36825;&#19968;&#27493;&#65292;&#20197;&#20415;&#26032;&#30340;&#21442;&#19982;&#32773;&#33021;&#22815;&#39034;&#21033;&#36890;&#36807;&#24320;&#22987;&#26102;&#22240;&#23545;&#39033;&#30446;&#19981;&#29087;&#24713;&#32780;&#36896;&#25104;&#30340;&#38556;&#30861;&#12290;&#35774;&#24819;&#33258;&#20030;&#36807;&#31243;&#20013;&#30340;&#31532;&#19968;&#27493;&#65292;&#23601;&#26159;&#23558;&#39033;&#30446;&#21551;&#21160;&#25152;&#38656;&#30340;&#33021;&#32791;&#38477;&#21040;&#26368;&#20302;&#28857;&#12290;&#25105;&#21548;&#35828;&#36807;&#20154;&#20204;&#29992;<em class="firstterm">&#20999;&#20837;&#33021;&#32791;</em>&#36825;&#20010;&#35789;&#26469;&#24418;&#23481;&#36825;&#19968;&#24320;&#31471;&#65306;&#21363;&#19968;&#20010;&#26032;&#30340;&#21442;&#19982;&#32773;&#22312;&#25910;&#33719;&#20043;&#21069;&#25152;&#24517;&#39035;&#20184;&#20986;&#30340;&#33021;&#37327;&#12290;&#19968;&#20010;&#39033;&#30446;&#30340;&#20999;&#20837;&#33021;&#32791;&#25511;&#21046;&#24471;&#36234;&#20302;&#36234;&#22909;&#12290;&#20320;&#30340;&#39318;&#35201;&#20219;&#21153;&#23601;&#26159;&#23558;&#20999;&#20837;&#33021;&#32791;&#38477;&#20302;&#21040;&#33021;&#22815;&#40723;&#21169;&#20154;&#21442;&#19982;&#39033;&#30446;&#24037;&#20316;&#30340;&#27700;&#24179;&#12290;</p><p>&#20197;&#19979;&#21508;&#23567;&#33410;&#20998;&#21035;&#25551;&#36848;&#20102;&#24320;&#22987;&#19968;&#20010;&#26032;&#39033;&#30446;&#30340;&#19968;&#20010;&#37325;&#35201;&#30340;&#26041;&#38754;&#12290;&#25490;&#21015;&#39034;&#24207;&#22823;&#33268;&#26159;&#25353;&#29031;&#19968;&#20010;&#26032;&#30340;&#35775;&#38382;&#32773;&#23558;&#36935;&#21040;&#30340;&#24773;&#24418;&#23433;&#25490;&#30340;&#65292;&#24403;&#28982;&#20320;&#22312;&#23454;&#38469;&#25805;&#20316;&#26102;&#21487;&#20197;&#19981;&#25353;&#29031;&#36825;&#20010;&#39034;&#24207;&#36827;&#34892;&#12290;&#20320;&#21487;&#20197;&#23558;&#23427;&#20204;&#30475;&#20316;&#26159;&#19968;&#20010;&#26816;&#26597;&#21015;&#34920;&#12290;&#24403;&#20320;&#24320;&#22987;&#19968;&#20010;&#39033;&#30446;&#26102;&#65292;&#21482;&#35201;&#19968;&#19968;&#26816;&#26597;&#65292;&#30830;&#20445;&#27599;&#19968;&#27493;&#39588;&#37117;&#20570;&#21040;&#20102;&#65292;&#25110;&#32773;&#22312;&#20320;&#30465;&#30053;&#26576;&#19968;&#37096;&#20998;&#26102;&#65292;&#33267;&#23569;&#20320;&#23545;&#23558;&#26469;&#21487;&#33021;&#20986;&#29616;&#30340;&#21518;&#26524;&#26377;&#25226;&#25569;&#23601;&#34892;&#20102;&#12290;</p><div class="sect2" title="&#36873;&#25321;&#19968;&#20010;&#22909;&#21517;&#23383;"><div class="titlepage"><div><div><h3 class="title"><a name="choosing-a-name"></a>&#36873;&#25321;&#19968;&#20010;&#22909;&#21517;&#23383;</h3></div></div></div><p>&#35774;&#24819;&#20320;&#26159;&#21478;&#22806;&#19968;&#20010;&#20154;&#65292;&#24688;&#22909;&#21548;&#35828;&#36807;&#20320;&#30340;&#39033;&#30446;&#65292;&#25110;&#32773;&#26159;&#26159;&#22312;&#25628;&#32034;&#19968;&#20010;&#36719;&#20214;&#26469;&#35299;&#20915;&#26576;&#20010;&#38382;&#39064;&#26102;&#30896;&#24039;&#30475;&#21040;&#20102;&#20320;&#30340;&#39033;&#30446;&#12290;&#20182;&#39318;&#20808;&#30475;&#21040;&#30340;&#26159;&#39033;&#30446;&#30340;&#21517;&#23383;&#12290;</p><p>&#19968;&#20010;&#22909;&#21517;&#23383;&#19981;&#20250;&#33258;&#28982;&#32780;&#28982;&#22320;&#20351;&#20320;&#30340;&#39033;&#30446;&#25104;&#21151;&#65292;&#32780;&#19968;&#20010;&#19981;&#22909;&#30340;&#21517;&#23383;&#20063;&#19981;&#20250;&#32456;&#32467;&#20320;&#30340;&#39033;&#30446;&#8212;&#24403;&#28982;&#20102;&#65292;&#19968;&#20010;<span class="emphasis"><em>&#30495;&#27491;</em></span>&#31967;&#31957;&#30340;&#21517;&#23383;&#20063;&#35768;&#20250;&#65292;&#20294;&#26159;&#35753;&#25105;&#20204;&#39318;&#20808;&#20551;&#23450;&#35841;&#20063;&#19981;&#20250;&#36843;&#19981;&#21450;&#24453;&#22320;&#35753;&#33258;&#24049;&#30340;&#39033;&#30446;&#22833;&#36133;&#21543;&#12290;&#30830;&#23454;&#65292;&#19968;&#20010;&#19981;&#22909;&#30340;&#21517;&#23383;&#20250;&#24310;&#32531;&#20182;&#20154;&#25509;&#21463;&#35813;&#39033;&#30446;&#30340;&#36895;&#24230;&#65292;&#35201;&#20040;&#26159;&#22240;&#20026;&#20154;&#20204;&#19981;&#20250;&#35748;&#30495;&#23545;&#24453;&#23427;&#65292;&#35201;&#20040;&#26159;&#22240;&#20026;&#20154;&#20204;&#24456;&#38590;&#35760;&#20303;&#23427;&#30340;&#21517;&#23383;&#12290;</p><p>&#19968;&#20010;&#22909;&#21517;&#23383;&#65306;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#21578;&#35785;&#20154;&#20204;&#26377;&#20851;&#39033;&#30446;&#24615;&#36136;&#65292;&#25110;&#33267;&#23569;&#21517;&#23383;&#19982;&#24615;&#36136;&#26159;&#26126;&#26174;&#30456;&#20851;&#32852;&#30340;&#19968;&#20123;&#27010;&#24565;&#65292;&#36825;&#26679;&#20154;&#20204;&#30475;&#21040;&#21517;&#23383;&#26102;&#23601;&#30693;&#36947;&#20102;&#39033;&#30446;&#33021;&#20570;&#20160;&#20040;&#65292;&#37027;&#20040;&#20154;&#20204;&#20197;&#21518;&#20415;&#24456;&#23481;&#26131;&#24819;&#36215;&#36825;&#20010;&#21517;&#23383;&#12290;</p></li><li class="listitem"><p>&#20415;&#20110;&#35760;&#24518;&#12290;&#22312;&#27492;&#65292;&#25105;&#20204;&#24517;&#39035;&#25215;&#35748;&#33521;&#35821;&#23454;&#38469;&#19978;&#24050;&#25104;&#20026;&#32593;&#32476;&#40664;&#35748;&#35821;&#35328;&#36825;&#19968;&#20107;&#23454;&#12290;&#8220;&#20415;&#20110;&#35760;&#24518;&#8221;&#23601;&#24847;&#21619;&#30528;&#8220;&#20415;&#20110;&#33021;&#38405;&#35835;&#33521;&#35821;&#30340;&#20154;&#35760;&#24518;&#8221;&#12290;&#20363;&#22914;&#65292;&#26576;&#19968;&#38750;&#33521;&#35821;&#21457;&#38899;&#30340;&#21452;&#20851;&#35821;&#23545;&#20110;&#35813;&#35821;&#35328;&#20043;&#22806;&#30340;&#35768;&#22810;&#33021;&#38405;&#35835;&#33521;&#35821;&#30340;&#20154;&#26469;&#35828;&#26159;&#24456;&#38590;&#29702;&#35299;&#30340;&#12290;&#35201;&#26159;&#36825;&#20010;&#21452;&#20851;&#35821;&#29305;&#21035;&#31934;&#24425;&#24182;&#19988;&#20196;&#20154;&#38590;&#24536;&#65292;&#37027;&#25110;&#35768;&#20540;&#24471;&#19968;&#35797;&#65307;&#20294;&#24517;&#39035;&#35760;&#20303;&#65292;&#36825;&#20010;&#21517;&#23383;&#22312;&#35768;&#22810;&#20154;&#30340;&#33041;&#28023;&#37324;&#24182;&#19981;&#20250;&#20135;&#29983;&#22312;&#27597;&#35821;&#20154;&#22763;&#36523;&#19978;&#25152;&#26377;&#30340;&#25928;&#26524;&#12290;</p></li><li class="listitem"><p>&#19981;&#19982;&#21478;&#19968;&#20010;&#39033;&#30446;&#37325;&#21517;&#65292;&#20063;&#19981;&#20405;&#29359;&#20219;&#20309;&#21830;&#26631;&#26435;&#12290;&#36825;&#26082;&#34920;&#29616;&#32844;&#19994;&#32654;&#24503;&#65292;&#20063;&#26159;&#33391;&#22909;&#30340;&#27861;&#24459;&#24847;&#35782;&#12290;&#20320;&#35201;&#36991;&#20813;&#21046;&#36896;&#36523;&#20221;&#28151;&#20081;&#12290;&#21363;&#20415;&#27809;&#26377;&#19981;&#21516;&#30340;&#19996;&#35199;&#37325;&#21517;&#30340;&#29616;&#35937;&#65292;&#25105;&#20204;&#29616;&#22312;&#35201;&#25630;&#28165;&#26970;&#32593;&#32476;&#19978;&#24050;&#26377;&#30340;&#19996;&#35199;&#24050;&#32463;&#24456;&#19981;&#23481;&#26131;&#20102;&#12290;</p><p>&#22312;&#21069;&#38754;<a class="xref" href="getting-started.html#look-around" title="&#20294;&#39318;&#20808;&#29615;&#39038;&#22235;&#21608;">the section called &#8220;&#20294;&#39318;&#20808;&#29615;&#39038;&#22235;&#21608;&#8221;</a>&#37324;&#25552;&#21450;&#30340;&#36164;&#26009;&#26377;&#21161;&#20110;&#20320;&#21457;&#29616;&#26159;&#21542;&#21478;&#19968;&#20010;&#39033;&#30446;&#24050;&#32463;&#37319;&#29992;&#20102;&#20320;&#27491;&#22312;&#32771;&#34385;&#30340;&#21517;&#23383;&#12290;&#20813;&#36153;&#30340;&#21830;&#26631;&#25628;&#32034;&#35265;<a class="ulink" href="http://www.nameprotect.org/" target="_top">http://www.nameprotect.org/</a>&#21644;<a class="ulink" href="http://www.uspto.gov/" target="_top">http://www.uspto.gov/</a>&#12290;</p></li><li class="listitem"><p>&#23613;&#21487;&#33021;&#25104;&#20026;<code class="systemitem">.com</code>&#12289;<code class="systemitem">.net</code>&#12289;&#20197;&#21450;<code class="systemitem">.org</code>&#39030;&#32423;&#22495;&#20013;&#30340;&#19968;&#20010;&#22495;&#21517;&#12290;&#20320;&#24212;&#35813;&#36873;&#25321;&#20854;&#20013;&#30340;&#19968;&#20010;&#65292;&#25110;&#35768;&#26159;<code class="systemitem">.org</code>&#21543;&#65292;&#20316;&#20026;&#39033;&#30446;&#27491;&#24335;&#30340;&#32593;&#22336;&#65307;&#32780;&#21478;&#22806;&#20004;&#20010;&#32593;&#22336;&#37117;&#36716;&#21457;&#21040;&#21069;&#19968;&#20010;&#65292;&#36825;&#36824;&#21487;&#20197;&#38450;&#27490;&#20854;&#20182;&#20154;&#29992;&#39033;&#30446;&#30340;&#21517;&#23383;&#21046;&#36896;&#36523;&#20221;&#28151;&#20081;&#12290;&#21363;&#20351;&#20320;&#25171;&#31639;&#23558;&#39033;&#30446;&#25918;&#22312;&#20854;&#23427;&#30340;&#32593;&#31449;&#31354;&#38388;&#19978;&#65292;&#65288;&#35265;<a class="xref" href="getting-started.html#starting-with-canned-hosting" title="&#21253;&#35013;&#20027;&#26426;">the section called &#8220;&#21253;&#35013;&#20027;&#26426;&#8221;</a>&#65289;&#65292;&#20320;&#20173;&#28982;&#21487;&#20197;&#27880;&#20876;&#33258;&#24049;&#39033;&#30446;&#30340;&#22495;&#21517;&#65292;&#32780;&#36716;&#21457;&#33267;&#20320;&#23384;&#25918;&#39033;&#30446;&#30340;&#20027;&#39029;&#19978;&#12290;&#23545;&#29992;&#25143;&#26469;&#35828;&#65292;&#20351;&#29992;&#19968;&#20010;&#23481;&#26131;&#35760;&#24518;&#30340;URL&#26159;&#21313;&#20998;&#26377;&#24110;&#21161;&#30340;&#12290;</p></li></ul></div><p>

</p></div><div class="sect2" title="&#26377;&#19968;&#20221;&#28165;&#26970;&#30340;&#20351;&#21629;&#38472;&#36848;"><div class="titlepage"><div><div><h3 class="title"><a name="mission-statement"></a>&#26377;&#19968;&#20221;&#28165;&#26970;&#30340;&#20351;&#21629;&#38472;&#36848;</h3></div></div></div><p>&#20154;&#20204;&#25214;&#21040;&#20102;&#39033;&#30446;&#30340;&#32593;&#39029;&#20043;&#21518;&#65292;&#19979;&#19968;&#27493;&#23601;&#35201;&#30475;&#19968;&#20221;&#31616;&#30701;&#30340;&#39033;&#30446;&#25551;&#36848;&#65292;&#21363;&#20351;&#21629;&#38472;&#36848;&#65292;&#20197;&#20415;&#65288;&#22312;30&#31186;&#20043;&#20869;&#65289;&#20915;&#23450;&#20182;&#20204;&#26159;&#21542;&#23545;&#35813;&#39033;&#30446;&#26377;&#20852;&#36259;&#24182;&#33719;&#21462;&#26356;&#22810;&#20449;&#24687;&#12290;&#22240;&#27492;&#65292;&#36825;&#20221;&#20351;&#21629;&#38472;&#36848;&#24517;&#39035;&#25918;&#22312;&#39318;&#39029;&#26174;&#33879;&#30340;&#20301;&#32622;&#65292;&#26368;&#22909;&#26159;&#32039;&#36148;&#30528;&#39033;&#30446;&#21517;&#23383;&#30340;&#19979;&#26041;&#12290;</p><p>&#20351;&#21629;&#38472;&#36848;&#24517;&#39035;&#20855;&#20307;&#65292;&#32039;&#20945;&#65307;&#32780;&#26368;&#37325;&#35201;&#30340;&#26159;&#31616;&#30701;&#12290;&#20197;&#19979;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#20363;&#23376;&#65292;&#26469;&#33258;<a class="ulink" href="http://www.openoffice.org/" target="_top">http://www.openoffice.org/</a>&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#21019;&#24314;&#19968;&#20010;&#20197;&#31038;&#21306;&#20026;&#22522;&#30784;&#65292;&#39046;&#20808;&#30340;&#22269;&#38469;&#21270;&#21150;&#20844;&#23460;&#22871;&#20214;&#65292;&#33021;&#22815;&#22312;&#25152;&#26377;&#20027;&#35201;&#30340;&#24179;&#21488;&#19978;&#36816;&#34892;&#65292;&#24182;&#20511;&#22522;&#20110;API&#21644;XML&#25991;&#20214;&#26684;&#24335;&#30340;&#24320;&#25918;&#32452;&#20214;&#65292;&#25552;&#20379;&#23545;&#25152;&#26377;&#21151;&#33021;&#21644;&#25968;&#25454;&#30340;&#25509;&#20837;&#24615;&#12290;</em></span></p></blockquote></div><p>&#36825;&#20221;&#20351;&#21629;&#38472;&#36848;&#20165;&#20165;&#29992;&#20102;&#31616;&#30701;&#30340;&#20960;&#21477;&#35805;&#65292;&#36890;&#36807;&#22823;&#37327;&#20381;&#36182;&#35835;&#32773;&#24050;&#26377;&#30340;&#30693;&#35782;&#26126;&#30333;&#26080;&#35823;&#22320;&#20256;&#36798;&#20102;&#25152;&#35201;&#20256;&#36798;&#30340;&#20449;&#24687;&#12290; &#8220;&#20197;&#31038;&#21306;&#20026;&#22522;&#30784;&#8221;&#34920;&#26126;&#35813;&#36719;&#20214;&#19981;&#21463;&#20219;&#20309;&#19968;&#23478;&#22823;&#20844;&#21496;&#25511;&#21046;&#20854;&#24320;&#21457;&#65307;&#8220;<span class="emphasis"><em>&#22269;&#38469;&#21270;</em></span>&#8221;&#25351;&#30340;&#26159;&#35813;&#36719;&#20214;&#20801;&#35768;&#20154;&#20204;&#22312;&#26412;&#22320;&#21450;&#22810;&#31181;&#35821;&#35328;&#29615;&#22659;&#19979;&#24037;&#20316;&#65307;&#8220;<span class="emphasis"><em>&#25152;&#26377;&#20027;&#35201;&#30340;&#24179;&#21488;</em></span>&#8221;&#35828;&#30340;&#26159;&#35813;&#36719;&#20214;&#21487;&#31227;&#26893;&#21040;Unix&#65292;&#33529;&#26524;&#21644;&#35270;&#31383;&#25805;&#20316;&#31995;&#32479;&#12290;&#20854;&#20313;&#30340;&#25991;&#23383;&#21017;&#35828;&#26126;&#24320;&#25918;&#25509;&#21475;&#20197;&#21450;&#26131;&#35835;&#30340;&#25991;&#20214;&#26684;&#24335;&#37117;&#26159;&#35813;&#36719;&#20214;&#30446;&#26631;&#20013;&#37325;&#35201;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;&#36825;&#20221;&#20351;&#21629;&#38472;&#36848;&#24182;&#27809;&#26377;&#22312;&#23383;&#38754;&#19978;&#21578;&#35785;&#35835;&#32773;&#23427;&#26088;&#22312;&#25104;&#20026;&#24494;&#36719;Office&#30340;&#24320;&#28304;&#26367;&#20195;&#21697;&#65292;&#20294;&#26159;&#20154;&#20204;&#20174;&#23383;&#37324;&#34892;&#38388;&#20415;&#33021;&#30475;&#20986;&#23427;&#30340;&#21547;&#20041;&#12290;&#20045;&#19968;&#30475;&#65292;&#36825;&#20221;&#20351;&#21629;&#38472;&#36848;&#20284;&#20046;&#26377;&#20123;&#31354;&#27867;&#65292;&#20294;&#23454;&#38469;&#19978;&#30028;&#23450;&#24471;&#30456;&#24403;&#26126;&#30830;&#65306;&#8220;<span class="emphasis"><em>&#21150;&#20844;&#23460;&#22871;&#20214;</em></span>&#8221;&#23545;&#37027;&#20123;&#29087;&#24713;&#36825;&#20010;&#36719;&#20214;&#30340;&#20154;&#26469;&#35828;&#26159;&#38750;&#24120;&#20855;&#20307;&#30340;&#19996;&#35199;&#12290;&#22312;&#27492;&#65292;&#35835;&#32773;&#24050;&#26377;&#30340;&#30693;&#35782;&#65288;&#36825;&#37324;&#25351;&#30340;&#26159;&#35835;&#32773;&#26377;&#21487;&#33021;&#23545;&#24494;&#36719;Office&#36719;&#20214;&#30340;&#20102;&#35299;&#65289;&#21448;&#19968;&#27425;&#29992;&#26469;&#25226;&#20351;&#21629;&#38472;&#36848;&#21464;&#24471;&#31616;&#27905;&#26126;&#20102;&#20102;&#12290;</p><p>&#19968;&#20221;&#20351;&#21629;&#38472;&#36848;&#30340;&#24615;&#36136;&#19981;&#21333;&#21333;&#26159;&#30001;&#23427;&#25152;&#25551;&#36848;&#30340;&#36719;&#20214;&#20915;&#23450;&#30340;&#65292;&#32780;&#22312;&#19968;&#23450;&#31243;&#24230;&#19978;&#24471;&#30475;&#26159;&#30001;&#35841;&#26469;&#20889;&#30340;&#12290;&#20363;&#22914;&#65292;OpenOffice.org&#20351;&#29992;"<span class="emphasis"><em>&#20197;&#31038;&#21306;&#20026;&#22522;&#30784;</em></span>"&#36825;&#20010;&#35789;&#26159;&#24456;&#26377;&#36947;&#29702;&#30340;&#65292;&#22240;&#20026;&#36825;&#20010;&#39033;&#30446;&#26368;&#21021;&#26159;&#30001;Sun Microsystems&#21457;&#36215;&#65292;&#32780;&#33267;&#20170;&#20173;&#20027;&#35201;&#26159;&#30001;&#36825;&#23478;&#20844;&#21496;&#36190;&#21161;&#30340;&#12290;&#22312;&#20854;&#20351;&#21629;&#38472;&#36848;&#20013;&#20351;&#29992;"&#20197;&#31038;&#21306;&#20026;&#22522;&#30784;"&#36825;&#20960;&#20010;&#23383;&#65292;Sun&#34920;&#26126;&#23427;&#23545;&#19968;&#20123;&#25285;&#24515;&#35813;&#20844;&#21496;&#26377;&#21487;&#33021;&#35797;&#22270;&#22404;&#26029;&#24320;&#21457;&#36825;&#19968;&#36719;&#20214;&#30340;&#24551;&#34385;&#26159;&#26377;&#25935;&#24863;&#24230;&#30340;&#12290;&#36825;&#26679;&#30340;&#22788;&#29702;&#26041;&#27861;&#65292;&#21363;&#34920;&#26126;&#23545;&#19968;&#20010;&#26377;&#21487;&#33021;&#20986;&#29616;&#30340;&#28508;&#22312;&#30340;&#38382;&#39064;&#26377;&#24847;&#35782;&#65292;&#23601;&#32473;&#23558;&#26469;&#23436;&#20840;&#36991;&#20813;&#36825;&#20010;&#38382;&#39064;&#30340;&#20986;&#29616;&#22880;&#23450;&#20102;&#24456;&#22909;&#30340;&#22522;&#30784;&#12290;&#35805;&#21448;&#35828;&#22238;&#26469;&#65292;&#22914;&#26524;&#39033;&#30446;&#24182;&#38750;&#30001;&#19968;&#23478;&#22823;&#20844;&#21496;&#36190;&#21161;&#65292;&#37027;&#25110;&#35768;&#26681;&#26412;&#19981;&#38656;&#35201;&#36825;&#26679;&#30340;&#35789;&#35821;&#65307;&#35828;&#21040;&#24213;&#65292;&#31038;&#21306;&#24320;&#21457;&#24050;&#32463;&#25104;&#20026;&#20170;&#22825;&#30340;&#27169;&#24335;&#20102;&#65292;&#22240;&#32780;&#27809;&#26377;&#29702;&#30001;&#35201;&#29305;&#21035;&#23558;&#37027;&#26679;&#30340;&#35789;&#35821;&#20889;&#22312;&#20351;&#21629;&#38472;&#36848;&#20013;&#12290;</p></div><div class="sect2" title="&#22768;&#26126;&#39033;&#30446;&#26159;&#33258;&#30001;&#36719;&#20214;"><div class="titlepage"><div><div><h3 class="title"><a name="state-freedom"></a>&#22768;&#26126;&#39033;&#30446;&#26159;&#33258;&#30001;&#36719;&#20214;</h3></div></div></div><p>&#30475;&#36807;&#20351;&#21629;&#38472;&#36848;&#20043;&#21518;&#20173;&#23545;&#39033;&#30446;&#26377;&#20852;&#36259;&#30340;&#20154;&#33258;&#28982;&#24819;&#35201;&#20102;&#35299;&#26356;&#22810;&#30340;&#24773;&#20917;&#65292;&#25110;&#35768;&#35201;&#30475;&#19968;&#30475;&#29992;&#25143;&#25991;&#20214;&#21644;&#24320;&#21457;&#20154;&#21592;&#25991;&#20214;&#65292;&#26368;&#32456;&#21487;&#33021;&#19979;&#36733;&#19968;&#20123;&#19996;&#35199;&#12290;&#20294;&#22312;&#20570;&#36825;&#20123;&#20107;&#24773;&#20197;&#21069;&#65292;&#20182;&#20204;&#35201;&#30830;&#23450;&#36825;&#26159;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#12290;</p><p><span class="emphasis"><em>&#32593;&#31449;&#30340;&#39318;&#39029;&#24517;&#39035;&#28165;&#28165;&#26970;&#26970;&#22320;&#20889;&#26126;&#36825;&#26159;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#12290;</em></span>&#36825;&#30475;&#36215;&#26469;&#22909;&#20687;&#26080;&#38656;&#21152;&#20197;&#24378;&#35843;&#65292;&#20294;&#26159;&#20320;&#20250;&#24778;&#35766;&#26377;&#22810;&#23569;&#39033;&#30446;&#24573;&#30053;&#20102;&#36825;&#19968;&#28857;&#12290;&#25105;&#35265;&#36807;&#19981;&#23569;&#33258;&#30001;&#36719;&#20214;&#32593;&#31449;&#65292;&#20854;&#39318;&#39029;&#19981;&#20294;&#27809;&#26377;&#35828;&#26126;&#35813;&#36719;&#20214;&#26159;&#22312;&#21738;&#19968;&#20010;&#33258;&#30001;&#35768;&#21487;&#35777;&#19979;&#21457;&#24067;&#30340;&#65292;&#32780;&#19988;&#26681;&#26412;&#27809;&#22312;&#39318;&#39029;&#34920;&#26126;&#36825;&#26159;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#12290;&#26377;&#26102;&#20505;&#36825;&#19968;&#33267;&#20851;&#37325;&#35201;&#30340;&#20449;&#24687;&#34987;&#27425;&#35201;&#22320;&#25918;&#22312;&#20102;&#19979;&#36733;&#39029;&#65292;&#25110;&#26159;&#24320;&#21457;&#20154;&#21592;&#39029;&#65292;&#25110;&#26159;&#20854;&#23427;&#30340;&#19968;&#20010;&#38656;&#35201;&#22810;&#28857;&#20987;&#19968;&#27425;&#40736;&#26631;&#25165;&#33021;&#30475;&#21040;&#30340;&#19968;&#20010;&#22320;&#26041;&#12290;&#22312;&#19968;&#20123;&#26497;&#31471;&#30340;&#20363;&#23376;&#20013;&#65292;&#32593;&#39029;&#19978;&#21738;&#20799;&#37117;&#25214;&#19981;&#21040;&#33258;&#30001;&#35768;&#21487;&#35777;&#8212;&#21482;&#26377;&#19979;&#36733;&#36719;&#20214;&#25171;&#24320;&#20043;&#21518;&#25165;&#33021;&#30475;&#21040;&#12290;</p><p>&#21035;&#29359;&#36825;&#20010;&#38169;&#35823;&#12290;&#36825;&#19968;&#24573;&#30053;&#26377;&#21487;&#33021;&#35753;&#20320;&#22833;&#21435;&#35768;&#22810;&#28508;&#22312;&#30340;&#24320;&#21457;&#20154;&#21592;&#21644;&#29992;&#25143;&#12290;&#21153;&#24517;&#22312;&#39318;&#39029;&#65292;&#20063;&#23601;&#26159;&#20351;&#21629;&#38472;&#36848;&#30340;&#27491;&#19979;&#26041;&#65292;&#22768;&#26126;&#35813;&#39033;&#30446;&#26159;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#25110;&#26159;&#8220;&#24320;&#28304;&#36719;&#20214;&#8221;&#65292;&#24182;&#27880;&#26126;&#30830;&#20999;&#30340;&#35768;&#21487;&#35777;&#12290;&#26377;&#20851;&#36873;&#25321;&#35768;&#21487;&#35777;&#30340;&#24555;&#36895;&#25351;&#21335;&#65292;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="license-quickstart.html" title="&#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992;">the section called &#8220;&#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992;&#8221;</a>&#65292;&#32780;&#26377;&#20851;&#35768;&#21487;&#35777;&#38382;&#39064;&#30340;&#35814;&#32454;&#35752;&#35770;&#35265;<a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#12290;</p><p>&#33267;&#27492;&#65292;&#25105;&#20204;&#20551;&#24819;&#20013;&#30340;&#35775;&#38382;&#32773;&#24050;&#32463;&#20915;&#23450;&#8212;&#25110;&#35768;&#22312;&#38543;&#21518;&#30340;&#19968;&#20998;&#38047;&#20043;&#20869;&#8212;&#20182;&#25171;&#31639;&#33267;&#23569;&#20877;&#33457;5&#20998;&#38047;&#30340;&#26102;&#38388;&#30740;&#31350;&#19968;&#19979;&#36825;&#20010;&#39033;&#30446;&#12290;&#19979;&#38754;&#20960;&#20010;&#23567;&#33410;&#35201;&#25551;&#36848;&#20182;&#22312;&#20043;&#21518;&#30340;5&#20998;&#38047;&#37324;&#23558;&#36935;&#21040;&#30340;&#24773;&#24418;&#12290;</p></div><div class="sect2" title="&#29305;&#24615;&#21644;&#38656;&#27714;&#21015;&#34920;"><div class="titlepage"><div><div><h3 class="title"><a name="features-and-requirements"></a>&#29305;&#24615;&#21644;&#38656;&#27714;&#21015;&#34920;</h3></div></div></div><p>&#20320;&#24212;&#35813;&#21015;&#20986;&#19968;&#20010;&#31616;&#30701;&#30340;&#28165;&#21333;&#65292;&#35828;&#26126;&#36719;&#20214;&#25903;&#25345;&#30340;&#21508;&#31181;&#29305;&#24615;&#65288;&#22914;&#26524;&#26576;&#20123;&#29305;&#24615;&#36824;&#26410;&#23436;&#25104;&#65292;&#20063;&#21487;&#20197;&#21015;&#20986;&#65292;&#20294;&#26159;&#22312;&#26049;&#36793;&#27880;&#26126;<span class="emphasis"><em>&#35745;&#21010;&#20013;</em></span>&#8221;&#25110;&#8220;<span class="emphasis"><em>&#24314;&#35774;&#20013;</em></span>&#8221;&#65289;&#65292;&#20197;&#21450;&#36816;&#34892;&#35813;&#36719;&#20214;&#25152;&#35201;&#27714;&#30340;&#31995;&#32479;&#29615;&#22659;&#12290;&#21015;&#36825;&#20221;&#28165;&#21333;&#26102;&#65292;&#20320;&#21482;&#35201;&#35774;&#24819;&#19968;&#20010;&#20154;&#35831;&#20320;&#31616;&#30701;&#22320;&#20171;&#32461;&#36825;&#20010;&#36719;&#20214;&#30340;&#29305;&#24615;/&#38656;&#27714;&#26159;&#20160;&#20040;&#12290;&#36890;&#24120;&#65292;&#37027;&#21482;&#26159;&#25353;&#29031;&#36923;&#36753;&#23545;&#20351;&#21629;&#38472;&#36848;&#20316;&#36827;&#19968;&#27493;&#30340;&#25193;&#20805;&#12290;&#20363;&#22914;&#65292;&#20351;&#21629;&#38472;&#36848;&#21487;&#33021;&#20889;&#30340;&#26159;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#21019;&#24314;&#19968;&#20010;&#20840;&#25991;&#32034;&#24341;&#22120;&#24182;&#37197;&#22791;&#20016;&#23500;API&#30340;&#25628;&#32034;&#24341;&#25806;&#65292;&#29992;&#20110;&#32534;&#31243;&#20154;&#21592;&#25628;&#32034;&#22823;&#25209;&#37327;&#25991;&#26412;&#25991;&#20214;&#12290;</em></span></p></blockquote></div><p>&#29305;&#24615;&#21644;&#38656;&#27714;&#28165;&#21333;&#23558;&#21015;&#20986;&#26356;&#35814;&#32454;&#30340;&#20869;&#23481;&#65292;&#23545;&#20351;&#21629;&#38472;&#36848;&#30340;&#33539;&#22260;&#21152;&#20197;&#35828;&#26126;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#29305;&#24615;&#65306;</em></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="emphasis"><em>&#25628;&#32034;&#32431;&#25991;&#26412;&#65292;HTML&#21644;XML&#25991;&#20214;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#23383;&#25110;&#35789;&#25628;&#32034;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#65288;&#35745;&#21010;&#20013;&#65289;&#27169;&#31946;&#21305;&#37197;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#65288;&#35745;&#21010;&#20013;&#65289;&#22686;&#37327;&#26356;&#26032;&#32034;&#24341;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#65288;&#35745;&#21010;&#20013;&#65289;&#32034;&#24341;&#36828;&#31243;&#31449;&#28857;</em></span></p></li></ul></div><p><span class="emphasis"><em>&#38656;&#27714;&#65306;</em></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="emphasis"><em>Python 2.2&#25110;&#26356;&#39640;&#29256;&#26412;</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>&#36275;&#22815;&#30340;&#30828;&#30424;&#31354;&#38388;&#20197;&#20648;&#23384;&#32034;&#24341;&#65288;&#22823;&#32422;&#21407;&#25991;&#20214;&#22823;&#23567;&#30340;2&#20493;&#65289;</em></span></p></li></ul></div></blockquote></div><p>&#26377;&#20102;&#36825;&#26679;&#30340;&#20449;&#24687;&#65292;&#35835;&#32773;&#20415;&#33021;&#24456;&#24555;&#22320;&#20915;&#23450;&#36825;&#20010;&#36719;&#20214;&#26159;&#21542;&#36866;&#29992;&#20110;&#20182;&#20204;&#65292;&#20063;&#21487;&#20197;&#32771;&#34385;&#26159;&#21542;&#20197;&#24320;&#21457;&#20154;&#21592;&#30340;&#36523;&#20221;&#21442;&#19982;&#20854;&#20013;&#12290;</p></div><div class="sect2" title="&#24320;&#21457;&#29366;&#24577;"><div class="titlepage"><div><div><h3 class="title"><a name="development-status"></a>&#24320;&#21457;&#29366;&#24577;</h3></div></div></div><p>&#20154;&#20204;&#24635;&#26159;&#24076;&#26395;&#20102;&#35299;&#19968;&#20010;&#39033;&#30446;&#30340;&#29366;&#20917;&#12290;&#23545;&#26032;&#30340;&#39033;&#30446;&#65292;&#20182;&#20204;&#24819;&#30693;&#36947;&#39033;&#30446;&#30340;&#25215;&#35834;&#21644;&#29616;&#23454;&#20043;&#38388;&#23384;&#22312;&#30528;&#22810;&#22823;&#30340;&#36317;&#31163;&#12290;&#23545;&#25104;&#29087;&#30340;&#39033;&#30446;&#65292;&#20182;&#20204;&#24819;&#30693;&#36947;&#32500;&#25252;&#24471;&#22914;&#20309;&#65292;&#26032;&#21457;&#24067;&#30340;&#39057;&#29575;&#24590;&#26679;&#65292;&#20197;&#21450;&#23545;Bug&#25253;&#21578;&#21453;&#24212;&#30340;&#21450;&#26102;&#24615;&#31561;&#31561;&#12290;</p><p>&#35201;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#65292;&#20320;&#24212;&#35813;&#24314;&#31435;&#24320;&#21457;&#29366;&#24577;&#39029;&#65292;&#21015;&#20986;&#39033;&#30446;&#30340;&#36817;&#26399;&#30446;&#26631;&#21644;&#38656;&#27714;&#65288;&#20363;&#22914;&#65292;&#38656;&#35201;&#20855;&#22791;&#26576;&#26041;&#38754;&#19987;&#38271;&#30340;&#24320;&#21457;&#20154;&#21592;&#65289;&#12290;&#24320;&#21457;&#29366;&#24577;&#39029;&#20063;&#21487;&#20197;&#21015;&#20986;&#36807;&#21435;&#21457;&#24067;&#30340;&#35760;&#24405;&#65292;&#20854;&#20013;&#21253;&#21547;&#29305;&#24615;&#28165;&#21333;&#65292;&#20197;&#20415;&#35775;&#38382;&#32773;&#20102;&#35299;&#39033;&#30446;&#26159;&#22914;&#20309;&#23450;&#20041;&#8220;&#36827;&#23637;&#8221;&#30340;&#65292;&#24182;&#26681;&#25454;&#36825;&#19968;&#23450;&#20041;&#20102;&#35299;&#39033;&#30446;&#36827;&#23637;&#30340;&#36895;&#24230;&#12290;</p><p>&#21035;&#22240;&#20026;&#20320;&#30340;&#39033;&#30446;&#30475;&#36215;&#26469;&#27809;&#20934;&#22791;&#22909;&#32780;&#24863;&#21040;&#23475;&#24597;&#65292;&#20063;&#19981;&#35201;&#21521;&#22840;&#22823;&#24320;&#21457;&#29366;&#24577;&#30340;&#35825;&#24785;&#22949;&#21327;&#12290;&#35841;&#37117;&#28165;&#26970;&#36719;&#20214;&#26159;&#20998;&#38454;&#27573;&#24320;&#21457;&#30340;&#20135;&#21697;&#65307;&#20320;&#19981;&#24517;&#35273;&#24471;&#38590;&#20197;&#24320;&#21475;&#35828;&#20986;&#65306;&#8220;&#36825;&#26159;&#20173;&#24102;&#26377;Bug&#30340;alpha&#36719;&#20214;&#65292;&#23427;&#21487;&#20197;&#36816;&#34892;&#12290;&#32780;&#19988;&#33267;&#23569;&#26377;&#26102;&#20505;&#33021;&#27491;&#24120;&#24037;&#20316;&#65292;&#20294;&#20320;&#20351;&#29992;&#36825;&#20010;&#36719;&#20214;&#23601;&#24471;&#33258;&#24049;&#25215;&#25285;&#39118;&#38505;&#12290;&#8221;&#36825;&#31867;&#35821;&#35328;&#19981;&#20250;&#21523;&#36305;&#20320;&#22312;&#36825;&#20010;&#38454;&#27573;&#38656;&#35201;&#30340;&#24320;&#21457;&#20154;&#21592;&#12290;&#28982;&#32780;&#65292;&#23545;&#20110;&#29992;&#25143;&#26469;&#35828;&#65292;&#26368;&#31967;&#31957;&#30340;&#20107;&#24773;&#33707;&#36807;&#20110;&#22312;&#36719;&#20214;&#20934;&#22791;&#22909;&#20043;&#21069;&#23601;&#21560;&#24341;&#29992;&#25143;&#12290;&#19968;&#26086;&#20896;&#19978;&#20102;&#31283;&#23450;&#24615;&#24046;&#25110;&#26159;Bug&#22810;&#22810;&#30340;&#21517;&#22768;&#65292;&#36719;&#20214;&#23601;&#24456;&#38590;&#20877;&#27491;&#21517;&#20102;&#12290;&#37319;&#21462;&#20445;&#23432;&#30340;&#31574;&#30053;&#23545;&#38271;&#36828;&#30340;&#30446;&#26631;&#26159;&#38750;&#24120;&#26377;&#30410;&#30340;&#65307;&#36719;&#20214;&#30340;&#31283;&#23450;&#24615;&#36229;&#20986;&#29992;&#25143;&#30340;&#39044;&#26399;&#24635;&#27604;&#36798;&#19981;&#21040;&#29992;&#25143;&#30340;&#26399;&#26395;<span class="emphasis"><em>&#22909;&#24471;&#22810;</em></span>&#65292;&#32780;&#32473;&#29992;&#25143;&#24778;&#21916;&#23601;&#20250;&#32473;&#20135;&#21697;&#24102;&#26469;&#26368;&#20339;&#21475;&#30865;&#12290;</p><div class="sidebar" title="Alpha&#21644;Beta"><a name="alpha-and-beta"></a><div class="titlepage"><div><div><p class="title"><b>Alpha&#21644;Beta</b></p></div></div></div><p>&#26415;&#35821;<em class="firstterm">alpha</em>&#36825;&#20010;&#35789;&#36890;&#24120;&#25351;&#30340;&#26159;&#31532;&#19968;&#27425;&#21457;&#24067;&#65292;&#20294;&#26159;&#29992;&#25143;&#21487;&#20197;&#20351;&#29992;&#35813;&#36719;&#20214;&#36827;&#34892;&#24037;&#20316;&#65292;&#24182;&#19988;&#36719;&#20214;&#20063;&#20855;&#22791;&#20102;&#26368;&#21021;&#35745;&#21010;&#30340;&#25152;&#26377;&#21151;&#33021;&#65292;&#20294;&#24050;&#30693;&#30340;Bug&#20173;&#28982;&#23384;&#22312;&#12290;Alpha&#36719;&#20214;&#30340;&#20027;&#35201;&#30446;&#30340;&#22312;&#20110;&#33719;&#21462;&#22238;&#39304;&#65292;&#20197;&#20415;&#24320;&#21457;&#20154;&#21592;&#20102;&#35299;&#20182;&#20204;&#24212;&#35813;&#20570;&#20160;&#20040;&#12290;&#19979;&#19968;&#20010;&#38454;&#27573;&#65292;<em class="firstterm">beta</em>&#26159;&#25351;&#36719;&#20214;&#20013;&#25152;&#26377;&#21385;&#23475;&#30340;Bug&#37117;&#24050;&#32463;&#34987;&#28040;&#28781;&#20102;&#65292;&#20294;&#26159;&#36719;&#20214;&#36824;&#26410;&#32463;&#36807;&#36275;&#22815;&#30340;&#27979;&#35797;&#65292;&#22240;&#32780;&#36824;&#19981;&#33021;&#27491;&#24335;&#21457;&#24067;&#12290;Beta&#36719;&#20214;&#30340;&#30446;&#30340;&#26377;&#20108;&#65292;&#19968;&#26159;&#22312;&#26410;&#21457;&#29616;Bug&#30340;&#24773;&#20917;&#19979;&#27491;&#24335;&#21457;&#24067;&#36719;&#20214;&#65292;&#20108;&#26159;&#25552;&#20379;&#32473;&#24320;&#21457;&#20154;&#21592;&#35814;&#32454;&#30340;&#22238;&#39304;&#65292;&#20197;&#20415;&#20182;&#20204;&#33021;&#22815;&#23613;&#24555;&#35299;&#20915;&#38382;&#39064;&#20043;&#21518;&#27491;&#24335;&#21457;&#24067;&#36719;&#20214;&#12290;Alpha&#21644;Beta&#30340;&#24046;&#21035;&#36890;&#24120;&#26159;&#30001;&#21028;&#26029;&#32780;&#20915;&#23450;&#30340;&#12290;</p></div></div><div class="sect2" title="&#19979;&#36733;"><div class="titlepage"><div><div><h3 class="title"><a name="downloads"></a>&#19979;&#36733;</h3></div></div></div><p>&#24212;&#35813;&#21487;&#20197;&#20197;&#26631;&#20934;&#26684;&#24335;&#19979;&#36733;&#36719;&#20214;&#30340;&#28304;&#20195;&#30721;&#12290;&#22312;&#19968;&#20010;&#39033;&#30446;&#21018;&#36215;&#27493;&#26102;&#65292;&#20108;&#36827;&#21046;&#65288;&#21487;&#25191;&#34892;&#30340;&#65289;&#36719;&#20214;&#21253;&#19981;&#26159;&#24517;&#35201;&#30340;&#65292;&#38500;&#38750;&#35813;&#36719;&#20214;&#30340;&#26500;&#24314;&#21644;&#20381;&#36182;&#35201;&#27714;&#30456;&#24403;&#22797;&#26434;&#65292;&#20197;&#33267;&#20110;&#20165;&#20165;&#36816;&#34892;&#35813;&#36719;&#20214;&#23601;&#38656;&#35201;&#22823;&#37327;&#30340;&#20154;&#21147;&#25237;&#20837;&#12290; &#65288;&#22914;&#26524;&#24773;&#20917;&#26159;&#37027;&#26679;&#30340;&#35805;&#65292;&#35813;&#39033;&#30446;&#20063;&#23558;&#24456;&#38590;&#21560;&#24341;&#24320;&#21457;&#20154;&#21592;&#30340;&#21442;&#19982;&#65281;&#65289;</p><p>&#21457;&#34892;&#26426;&#21046;&#24212;&#35813;&#23613;&#37327;&#20570;&#21040;&#26041;&#20415;&#65292;&#26631;&#20934;&#21270;&#20197;&#21450;&#28165;&#26970;&#26080;&#35823;&#12290;&#20551;&#22914;&#20320;&#35201;&#26681;&#38500;&#19968;&#31181;&#30142;&#30149;&#65292;&#20320;&#20998;&#21457;&#30340;&#33647;&#29289;&#19981;&#20250;&#26159;&#38656;&#35201;&#19968;&#31181;&#38750;&#26631;&#20934;&#21270;&#30340;&#27880;&#23556;&#22120;&#26469;&#25805;&#20316;&#30340;&#21543;&#12290;&#21516;&#26679;&#30340;&#36947;&#29702;&#65292;&#36719;&#20214;&#24212;&#35813;&#19982;&#26631;&#20934;&#21270;&#30340;&#26500;&#36896;&#21644;&#23433;&#35013;&#26041;&#27861;&#30456;&#19968;&#33268;&#65307;&#19968;&#20010;&#36719;&#20214;&#36317;&#31163;&#26631;&#20934;&#21270;&#36234;&#36828;&#65292;&#29992;&#25143;&#21644;&#24320;&#21457;&#20154;&#21592;&#25918;&#24323;&#35813;&#36719;&#20214;&#24182;&#19988;&#19968;&#22836;&#38654;&#27700;&#22320;&#31163;&#24320;&#30340;&#21487;&#33021;&#24615;&#23601;&#36234;&#22823;&#12290;</p><p>&#37027;&#21548;&#36215;&#26469;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#36947;&#29702;&#65292;&#20294;&#26159;&#35768;&#22810;&#39033;&#30446;&#24448;&#24448;&#31561;&#21040;&#24456;&#26202;&#30340;&#26102;&#20505;&#25165;&#21160;&#25163;&#35299;&#20915;&#26631;&#20934;&#21270;&#23433;&#35013;&#31243;&#24207;&#65292;&#22240;&#20026;&#20182;&#20204;&#24635;&#26159;&#21578;&#35785;&#33258;&#24049;&#36825;&#19968;&#27493;&#20160;&#20040;&#26102;&#20505;&#37117;&#21487;&#20197;&#20570;&#65306;<span class="emphasis"><em>&#8220;&#31561;&#21040;&#20195;&#30721;&#25509;&#36817;&#23436;&#24037;&#30340;&#26102;&#20505;&#20877;&#26469;&#35299;&#20915;&#36825;&#20123;&#25152;&#26377;&#30340;&#38382;&#39064;&#21543;&#12290;&#8221;</em></span>&#27530;&#19981;&#30693;&#22312;&#25302;&#24310;&#23436;&#25104;&#36719;&#20214;&#24314;&#35774;&#21644;&#23433;&#35013;&#31243;&#24207;&#36825;&#31867;&#26543;&#29157;&#24037;&#20316;&#30340;&#26102;&#20505;&#65292;&#20182;&#20204;&#23454;&#38469;&#19978;&#26159;&#22312;&#25512;&#36831;&#23436;&#25104;&#20195;&#30721;&#30340;&#26102;&#38388;&#8212;&#22240;&#20026;&#20182;&#20204;&#35753;&#19968;&#20123;&#26412;&#26469;&#21487;&#20197;&#20026;&#36719;&#20214;&#32534;&#31243;&#20570;&#36129;&#29486;&#30340;&#24320;&#21457;&#20154;&#21592;&#22833;&#21435;&#20102;&#20852;&#36259;&#12290;&#26368;&#31967;&#31957;&#30340;&#26159;&#65292;&#20182;&#20204;&#26681;&#26412;&#23601;<span class="emphasis"><em>&#19981;&#30693;&#36947;</em></span>&#20182;&#20204;&#22833;&#21435;&#20102;&#37027;&#20123;&#24320;&#21457;&#20154;&#21592;&#65292;&#22240;&#20026;&#37027;&#26159;&#19968;&#36830;&#20018;&#26080;&#26524;&#32780;&#32456;&#30340;&#19968;&#20010;&#36807;&#31243;&#65306;&#26576;&#20154;&#25308;&#35775;&#20102;&#19968;&#20010;&#32593;&#39029;&#65292;&#19979;&#36733;&#20102;&#36719;&#20214;&#65292;&#35797;&#22270;&#21442;&#19982;&#26500;&#24314;&#65292;&#22833;&#36133;&#20102;&#65292;&#25918;&#24323;&#32780;&#31163;&#24320;&#20102;&#12290;&#38500;&#20102;&#25308;&#35775;&#32773;&#26412;&#20154;&#20197;&#22806;&#65292;&#35841;&#20250;&#30693;&#36947;&#21457;&#29983;&#20102;&#36825;&#19968;&#20999;&#65311;&#39033;&#30446;&#21442;&#19982;&#32773;&#20013;&#35841;&#20063;&#19981;&#20250;&#24847;&#35782;&#21040;&#26576;&#20301;&#25308;&#35775;&#32773;&#30340;&#20852;&#36259;&#21644;&#33391;&#22909;&#24847;&#24895;&#22312;&#24708;&#26080;&#22768;&#24687;&#20013;&#20415;&#34987;&#25212;&#26432;&#20102;&#12290;</p><p>&#26543;&#29157;&#20294;&#20855;&#26377;&#39640;&#22238;&#25253;&#30340;&#24037;&#20316;&#24212;&#35813;&#23613;&#26089;&#23436;&#25104;&#65292;&#32780;&#36890;&#36807;&#33391;&#22909;&#21253;&#35013;&#20415;&#33021;&#22815;&#22823;&#22823;&#38477;&#20302;&#36827;&#20837;&#39033;&#30446;&#38556;&#30861;&#30340;&#24037;&#20316;&#26174;&#28982;&#26159;&#20855;&#26377;&#24456;&#39640;&#30340;&#22238;&#25253;&#29575;&#30340;&#12290;</p><p>&#24403;&#20320;&#21457;&#24067;&#19968;&#20010;&#21487;&#20197;&#19979;&#36733;&#30340;&#36719;&#20214;&#21253;&#26102;&#65292;&#33267;&#20851;&#37325;&#35201;&#30340;&#19968;&#28857;&#26159;&#32473;&#20104;&#36825;&#19968;&#27425;&#21457;&#24067;&#19968;&#20010;&#29420;&#19968;&#26080;&#20108;&#30340;&#29256;&#26412;&#21495;&#30721;&#65292;&#20197;&#20415;&#20154;&#20204;&#23545;&#20004;&#27425;&#21457;&#24067;&#21152;&#20197;&#27604;&#36739;&#65292;&#20174;&#32780;&#20102;&#35299;&#21738;&#20123;&#19996;&#35199;&#34987;&#26367;&#20195;&#20102;&#12290;&#26377;&#20851;&#29256;&#26412;&#32534;&#21495;&#30340;&#35814;&#32454;&#35752;&#35770;&#35265;<a class="xref" href="development-cycle.html#release-numbering" title="&#29256;&#26412;&#21495;">the section called &#8220;&#29256;&#26412;&#21495;&#8221;</a>&#65292;&#32780;&#26500;&#24314;&#21644;&#23433;&#35013;&#31243;&#24207;&#26631;&#20934;&#21270;&#30340;&#35814;&#32454;&#20869;&#23481;&#35265;<a class="xref" href="packaging.html" title="&#25171;&#21253;">the section called &#8220;&#25171;&#21253;&#8221;</a><span>&#20197;&#21450;<a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a></span>&#12290;</p></div><div class="sect2" title="&#29256;&#26412;&#25511;&#21046;&#21644;Bug&#36319;&#36394;&#35775;&#38382;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-and-bug-tracker-access"></a>&#29256;&#26412;&#25511;&#21046;&#21644;Bug&#36319;&#36394;&#35775;&#38382;</h3></div></div></div><p>&#19979;&#36733;&#28304;&#30721;&#36719;&#20214;&#21253;&#23545;&#20110;&#21482;&#24819;&#23433;&#35013;&#21644;&#20351;&#29992;&#36719;&#20214;&#30340;&#20154;&#26469;&#35828;&#36275;&#30691;&#65292;&#20294;&#23545;&#20110;&#24819;&#35201;&#35299;&#20915;bug&#38382;&#39064;&#25110;&#22686;&#21152;&#26032;&#29305;&#24615;&#30340;&#37027;&#20123;&#20154;&#23601;&#19981;&#22815;&#20102;&#12290;&#23613;&#31649;&#27599;&#22812;&#28304;&#20195;&#30721;&#24555;&#29031;&#20250;&#26377;&#20123;&#24110;&#21161;&#65292;&#20294;&#26159;&#23545;&#19968;&#20010;&#27963;&#36291;&#30340;&#24320;&#21457;&#31038;&#21306;&#26469;&#35828;&#65292;&#20173;&#28982;&#19981;&#22815;&#32454;&#33268;&#12290;&#20154;&#20204;&#38656;&#35201;&#23454;&#26102;&#36827;&#20837;&#26368;&#26032;&#30340;&#20195;&#30721;&#31995;&#32479;&#65292;&#32780;&#33021;&#22815;&#23454;&#29616;&#36825;&#19968;&#28857;&#30340;&#36884;&#24452;&#20415;&#26159;&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#22914;&#26524;&#19968;&#20010;&#20154;&#22312;&#21311;&#21517;&#24773;&#20917;&#19979;&#20415;&#21487;&#20197;&#33719;&#21462;&#21463;&#29256;&#26412;&#25511;&#21046;&#30340;&#20195;&#30721;&#65292;&#37027;&#23601;&#24847;&#21619;&#30528;&#35813;&#36719;&#20214;&#23545;&#29992;&#25143;&#21644;&#24320;&#21457;&#20154;&#21592;&#26157;&#31034;&#65306;&#39033;&#30446;&#27491;&#21162;&#21147;&#20026;&#20154;&#20204;&#30340;&#21442;&#19982;&#21019;&#36896;&#26465;&#20214;&#12290;&#35201;&#26159;&#20320;&#19981;&#33021;&#39532;&#19978;&#25552;&#20379;&#29256;&#26412;&#25511;&#21046;&#65292;&#20063;&#24212;&#35813;&#20986;&#19968;&#20010;&#22768;&#26126;&#65292;&#21578;&#30693;&#20154;&#20204;&#20320;&#20250;&#23613;&#24555;&#37027;&#26679;&#20570;&#12290;&#26377;&#20851;&#29256;&#26412;&#25511;&#21046;&#30340;&#22522;&#30784;&#26550;&#26500;&#35814;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#20013;&#30340;</span><a class="xref" href="vc.html" title="&#29256;&#26412;&#25511;&#21046;">the section called &#8220;&#29256;&#26412;&#25511;&#21046;&#8221;</a>&#12290;</p><p>&#23545;&#20110;&#39033;&#30446;&#30340;Bug&#36319;&#36394;&#31995;&#32479;&#26469;&#35828;&#65292;&#20063;&#26159;&#21516;&#26679;&#30340;&#36947;&#29702;&#12290;Bug&#36319;&#36394;&#31995;&#32479;&#20043;&#25152;&#20197;&#37325;&#35201;&#19981;&#21482;&#22240;&#20026;&#23427;&#23545;&#24320;&#21457;&#20154;&#21592;&#21313;&#20998;&#26377;&#29992;&#65292;&#32780;&#19988;&#23545;&#20851;&#27880;&#39033;&#30446;&#30340;&#20154;&#26469;&#35828;&#26159;&#19968;&#31181;&#26631;&#24535;&#12290;&#22312;&#35768;&#22810;&#20154;&#30475;&#26469;&#65292;&#19968;&#20010;&#21487;&#20197;&#36827;&#20837;&#30340;Bug&#25968;&#25454;&#24211;&#26159;&#19968;&#20010;&#39033;&#30446;&#26159;&#21542;&#20005;&#32899;&#35748;&#30495;&#30340;&#37325;&#35201;&#26631;&#24535;&#20043;&#19968;&#12290;&#20877;&#32773;&#65292;&#25968;&#25454;&#24211;&#20013;&#30340;Bug&#25968;&#37327;&#36234;&#22810;&#65292;&#39033;&#30446;&#30475;&#36215;&#26469;&#36234;&#22909;&#12290;&#36825;&#21548;&#36215;&#26469;&#20284;&#20046;&#26377;&#24726;&#24120;&#29702;&#65292;&#20294;&#26159;&#35831;&#35760;&#20303;Bug&#25968;&#37327;&#30340;&#35760;&#24405;&#23454;&#38469;&#19978;&#21462;&#20915;&#20110;&#19977;&#20010;&#22240;&#32032;&#65306;&#36719;&#20214;&#20013;&#23384;&#22312;&#30340;Bug&#32477;&#23545;&#25968;&#37327;&#65292;&#20351;&#29992;&#35813;&#36719;&#20214;&#30340;&#29992;&#25143;&#20154;&#25968;&#65292;&#20197;&#21450;&#29992;&#25143;&#35760;&#24405;&#26032;&#21457;&#29616;&#30340;Bug&#30340;&#26041;&#20415;&#31243;&#24230;&#12290;&#22312;&#36825;&#19977;&#20010;&#22240;&#32032;&#24403;&#20013;&#65292;&#21518;&#20004;&#20010;&#27604;&#21069;&#19968;&#20010;&#37325;&#35201;&#24471;&#22810;&#12290;&#20219;&#20309;&#20855;&#26377;&#19968;&#23450;&#35268;&#27169;&#21644;&#22797;&#26434;&#24615;&#30340;&#36719;&#20214;&#22522;&#26412;&#19978;&#37117;&#23384;&#22312;&#19968;&#23450;&#25968;&#37327;&#26377;&#24453;&#34987;&#21457;&#29616;&#30340;Bug&#12290;&#30495;&#27491;&#30340;&#38382;&#39064;&#26159;&#65292;&#19968;&#20010;&#39033;&#30446;&#22312;&#35760;&#24405;&#21644;&#20248;&#20808;&#35299;&#20915;Bug&#38382;&#39064;&#26041;&#38754;&#20570;&#24471;&#26377;&#22810;&#22909;&#65311;&#22914;&#26524;&#19968;&#20010;&#39033;&#30446;&#26377;&#19968;&#20010;&#36739;&#22823;&#32780;&#21448;&#32500;&#25252;&#24471;&#24456;&#22909;&#30340;Bug&#25968;&#25454;&#24211;&#65288;&#24847;&#24605;&#26159;bug&#38382;&#39064;&#24471;&#21040;&#21450;&#26102;&#22320;&#22238;&#24212;&#65292;&#37325;&#22797;bug&#34987;&#21512;&#24182;&#31561;&#31561;&#65289;&#65292;&#37027;&#20040;&#36825;&#20010;&#39033;&#30446;&#23601;&#20250;&#27604;&#37027;&#20123;&#27809;&#26377;Bug&#25968;&#25454;&#24211;&#65292;&#25110;&#32773;Bug&#25968;&#25454;&#24211;&#37324;&#31354;&#31354;&#22914;&#20063;&#30340;&#39033;&#30446;&#32473;&#20104;&#20154;&#20204;&#26356;&#22909;&#30340;&#21360;&#35937;&#12290;</p><p>&#24403;&#28982;&#65292;&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#21018;&#21018;&#36215;&#27493;&#65292;&#37027;&#20040;Bug&#25968;&#25454;&#24211;&#37324;&#23601;&#21482;&#26377;&#20026;&#25968;&#19981;&#22810;&#30340;Bug&#65292;&#32780;&#23545;&#27492;&#20320;&#20063;&#27809;&#26377;&#20160;&#20040;&#21150;&#27861;&#12290;&#20294;&#26159;&#22914;&#26524;&#22312;&#24320;&#21457;&#29366;&#20917;&#39029;&#24378;&#35843;&#39033;&#30446;&#20173;&#22788;&#20110;&#21021;&#21019;&#26399;&#65292;&#19988;&#20154;&#20204;&#30475;&#21040;bug&#25968;&#25454;&#24211;&#37324;&#22823;&#22810;&#25968;&#30340;&#25991;&#26723;&#37117;&#26159;&#36817;&#26399;&#24314;&#31435;&#30340;&#65292;&#20182;&#20204;&#20415;&#21487;&#20197;&#30001;&#27492;&#25512;&#26029;&#20986;&#35813;&#39033;&#30446;&#20173;&#28982;&#26377;&#33391;&#22909;&#30340;&#35299;&#20915;<span class="emphasis"><em>&#29575;</em></span>&#65292;&#20063;&#23601;&#19981;&#20250;&#22240;&#20026;&#30475;&#21040;&#30456;&#23545;&#36739;&#20302;&#30340;&#24050;&#32463;&#35760;&#24405;&#30340;Bug&#32477;&#23545;&#25968;&#37327;&#32780;&#20135;&#29983;&#19981;&#36866;&#24403;&#30340;&#35686;&#35273;&#12290;</p><p>&#35831;&#27880;&#24847;Bug&#36319;&#36394;&#31995;&#32479;&#30340;&#29992;&#36884;&#19981;&#27490;&#36861;&#36394;&#36719;&#20214;&#30340;Bug&#65292;&#32780;&#19988;&#20063;&#29992;&#26469;&#36319;&#36394;&#25193;&#23637;&#35831;&#27714;&#65292;&#25991;&#26723;&#21464;&#26356;&#65292;&#24453;&#35299;&#20915;&#30340;&#20219;&#21153;&#65292;&#20197;&#21450;&#20854;&#23427;&#19968;&#20123;&#38382;&#39064;&#12290;&#36816;&#34892;&#19968;&#20010;Bug&#36319;&#36394;&#31995;&#32479;&#30340;&#35814;&#32454;&#20869;&#23481;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#20013;&#30340;</span><a class="xref" href="bug-tracker.html" title="Bug&#36319;&#36394;">the section called &#8220;Bug&#36319;&#36394;&#8221;</a>&#65292;&#25152;&#20197;&#22312;&#27492;&#25105;&#23601;&#19981;&#36184;&#36848;&#20102;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;Bug&#36319;&#36394;<span class="emphasis"><em>&#19968;&#23450;</em></span>&#35201;&#26174;&#31034;&#20986;&#26469;&#65292;&#32780;&#19988;&#35201;&#30830;&#20445;&#39033;&#30446;&#30340;&#39318;&#39029;&#19978;&#20415;&#33021;&#30475;&#21040;&#36825;&#19968;&#28857;&#12290;</p></div><div class="sect2" title="&#27807;&#36890;&#28192;&#36947;"><div class="titlepage"><div><div><h3 class="title"><a name="communications-channels"></a>&#27807;&#36890;&#28192;&#36947;</h3></div></div></div><p>&#39033;&#30446;&#30340;&#35775;&#23458;&#36890;&#24120;&#37117;&#24076;&#26395;&#30693;&#36947;&#22914;&#20309;&#33021;&#32852;&#31995;&#19978;&#21442;&#19982;&#39033;&#30446;&#30340;&#26377;&#20851;&#20154;&#21592;&#12290;&#25552;&#20379;&#37038;&#20214;&#21015;&#34920;&#22320;&#22336;&#12289;&#32842;&#22825;&#23460;&#12289;IRC&#39057;&#36947;&#12289;&#20197;&#21450;&#20219;&#20309;&#20854;&#23427;&#24418;&#24335;&#30340;&#35770;&#22363;&#65292;&#20197;&#20415;&#20854;&#20182;&#21442;&#19982;&#39033;&#30446;&#30340;&#20154;&#21516;&#26679;&#21487;&#20197;&#32852;&#31995;&#19978;&#12290;&#21578;&#35785;&#20154;&#20204;&#20320;&#21644;&#39033;&#30446;&#30340;&#20854;&#20182;&#26377;&#20851;&#20154;&#21592;&#37117;&#22312;&#37038;&#20214;&#21015;&#34920;&#19978;&#65292;&#22240;&#32780;&#20154;&#20204;&#20415;&#30693;&#36947;&#20182;&#20204;&#26377;&#36884;&#24452;&#23558;&#22238;&#39304;&#20256;&#36882;&#32473;&#24320;&#21457;&#20154;&#21592;&#12290;&#20320;&#22312;&#37038;&#20214;&#21015;&#34920;&#19978;&#24182;&#19981;&#24847;&#21619;&#30528;&#20320;&#25215;&#35834;&#22238;&#31572;&#25152;&#26377;&#30340;&#38382;&#39064;&#65292;&#20063;&#19981;&#31561;&#20110;&#20320;&#35201;&#28385;&#36275;&#25152;&#26377;&#20154;&#25552;&#20986;&#30340;&#26377;&#20851;&#29305;&#24615;&#30340;&#35201;&#27714;&#12290;&#38271;&#36828;&#26469;&#30475;&#65292;&#22823;&#22810;&#25968;&#29992;&#25143;&#25110;&#35768;&#26681;&#26412;&#20174;&#19981;&#21442;&#19982;&#35770;&#22363;&#65292;&#28982;&#32780;&#65292;&#22914;&#26524;&#20182;&#20204;&#30693;&#36947;&#20182;&#20204;&#38656;&#35201;&#30340;&#26102;&#20505;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#37027;&#26679;&#20570;&#65292;&#37027;&#23545;&#20182;&#20204;&#23601;&#26159;&#19968;&#31181;&#27427;&#24944;&#12290;</p><p>&#22312;&#39033;&#30446;&#24320;&#21457;&#21021;&#26399;&#65292;&#27809;&#26377;&#24517;&#35201;&#23558;&#29992;&#25143;&#35770;&#22363;&#19982;&#24320;&#21457;&#20154;&#21592;&#35770;&#22363;&#20998;&#24320;&#12290;&#26356;&#22909;&#30340;&#21150;&#27861;&#26159;&#35753;&#25152;&#26377;&#19982;&#36719;&#20214;&#26377;&#20851;&#30340;&#20154;&#21592;&#22312;&#8220;&#21516;&#19968;&#38388;&#23627;&#23376;&#8221;&#37324;&#36827;&#34892;&#20132;&#35848;&#12290;&#22312;&#26089;&#26399;&#20351;&#29992;&#36719;&#20214;&#30340;&#20154;&#24403;&#20013;&#65292;&#24320;&#21457;&#20154;&#21592;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#30028;&#32447;&#36890;&#24120;&#24456;&#27169;&#31946;&#65307;&#19981;&#26159;&#27809;&#26377;&#30028;&#32447;&#65292;&#20294;&#26159;&#24320;&#21457;&#20154;&#21592;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#27604;&#20363;&#22312;&#39033;&#30446;&#26089;&#26399;&#36828;&#36828;&#39640;&#20110;&#21518;&#38754;&#30340;&#38454;&#27573;&#12290;&#23613;&#31649;&#25105;&#20204;&#19981;&#33021;&#20551;&#35774;&#27599;&#19968;&#20301;&#26089;&#26399;&#19982;&#39033;&#30446;&#26377;&#20851;&#30340;&#20154;&#37117;&#26159;&#24819;&#35201;&#20171;&#20837;&#36719;&#20214;&#24320;&#21457;&#30340;&#32534;&#31243;&#20154;&#21592;&#65292;&#20294;&#26159;&#25105;&#20204;&#21487;&#20197;&#32943;&#23450;&#20182;&#20204;&#33267;&#23569;&#24456;&#26377;&#20852;&#36259;&#22320;&#20851;&#27880;&#39033;&#30446;&#21457;&#23637;&#20013;&#36827;&#34892;&#30340;&#35752;&#35770;&#65292;&#24182;&#20102;&#35299;&#39033;&#30446;&#21457;&#23637;&#30340;&#26041;&#21521;&#12290;</p><p>&#30001;&#20110;&#26412;&#31456;&#21482;&#35752;&#35770;&#39033;&#30446;&#30340;&#21021;&#24314;&#65292;&#25152;&#20197;&#22312;&#27492;&#25105;&#20204;&#21482;&#35201;&#35828;&#26126;&#26377;&#24517;&#35201;&#24314;&#31435;&#20197;&#19978;&#25152;&#35828;&#30340;&#20132;&#27969;&#35770;&#22363;&#23601;&#34892;&#20102;&#12290;&#31245;&#21518;&#65292;&#22312;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a></span>&#20013;&#30340;<a class="xref" href="growth.html" title="&#22788;&#29702;&#25104;&#38271;">the section called &#8220;&#22788;&#29702;&#25104;&#38271;&#8221;</a>&#65292;&#25105;&#20204;&#23558;&#35752;&#35770;&#22312;&#20160;&#20040;&#22320;&#26041;&#20197;&#21450;&#22914;&#20309;&#24314;&#31435;&#36825;&#26679;&#30340;&#35770;&#22363;&#65292;&#21450;&#21487;&#33021;&#38656;&#35201;&#30340;&#21327;&#35843;&#21644;&#20854;&#23427;&#26041;&#38754;&#30340;&#31649;&#29702;&#65292;&#21478;&#22806;&#65292;&#22312;&#26102;&#26426;&#25104;&#29087;&#30340;&#26102;&#20505;&#65292;&#22914;&#20309;&#20998;&#31163;&#29992;&#25143;&#19982;&#24320;&#21457;&#20154;&#21592;&#30340;&#35770;&#22363;&#32780;&#36991;&#20813;&#36896;&#25104;&#26080;&#27861;&#36926;&#36234;&#30340;&#40511;&#27807;&#12290;</p></div><div class="sect2" title="&#24320;&#21457;&#32773;&#25351;&#21335;"><div class="titlepage"><div><div><h3 class="title"><a name="developer-guidelines"></a>&#24320;&#21457;&#32773;&#25351;&#21335;</h3></div></div></div><p>&#22914;&#26524;&#26377;&#20154;&#32771;&#34385;&#21442;&#19982;&#39033;&#30446;&#65292;&#22905;&#20250;&#23547;&#25214;&#24320;&#21457;&#32773;&#25351;&#21335;&#12290;&#19982;&#31038;&#20250;&#24615;&#25991;&#26723;&#30456;&#27604;&#65292;&#24320;&#21457;&#32773;&#25351;&#21335;&#36890;&#24120;&#27809;&#26377;&#24456;&#22810;&#30340;&#25216;&#24039;&#65306;&#21482;&#38656;&#35201;&#35299;&#37322;&#24320;&#21457;&#32773;&#20043;&#38388;&#65292;&#20197;&#21450;&#19982;&#29992;&#25143;&#20043;&#38388;&#22914;&#20309;&#20132;&#20114;&#65292;&#20197;&#21450;&#22914;&#20309;&#26368;&#32456;&#23436;&#25104;&#20219;&#21153;&#12290;</p><p>&#36825;&#37096;&#20998;&#30340;&#32454;&#33410;&#21487;&#20197;&#30475;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#20013;&#30340;</span><a class="xref" href="written-rules.html" title="&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;">the section called &#8220;&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;&#8221;</a>&#65292;&#20294;&#24320;&#21457;&#25351;&#21335;&#30340;&#22522;&#26412;&#20803;&#32032;&#21253;&#25324;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#19982;&#20854;&#23427;&#24320;&#21457;&#32773;&#20132;&#27969;&#35770;&#22363;&#30340;&#38142;&#25509;</p></li><li class="listitem"><p>&#25253;&#21578;Bug&#21644;&#25552;&#20132;&#34917;&#19969;&#30340;&#25351;&#23548;</p></li><li class="listitem"><p>&#35828;&#26126;&#36827;&#34892;&#24320;&#21457;&#30340;<span class="emphasis"><em>&#26041;&#27861;</em></span>&#8212;&#39033;&#30446;&#26159;&#20161;&#24904;&#19987;&#21046;&#12289;&#36824;&#26159;&#27665;&#20027;&#30340;&#12289;&#36824;&#26159;&#20854;&#23427;&#12290;</p></li></ul></div><p>

&#23545;&#20110;&#8220;&#19987;&#21046;&#8221;&#36825;&#37324;&#27809;&#26377;&#20219;&#20309;&#36731;&#34065;&#30340;&#21547;&#20041;&#12290;&#22914;&#26524;&#23384;&#22312;&#19968;&#20010;&#24320;&#21457;&#32773;&#23545;&#25152;&#26377;&#21464;&#26356;&#25317;&#26377;&#21542;&#20915;&#26435;&#65292;&#36825;&#23436;&#20840;&#27809;&#26377;&#38382;&#39064;&#12290;&#35768;&#22810;&#25104;&#21151;&#30340;&#39033;&#30446;&#20197;&#36825;&#31181;&#26041;&#24335;&#36827;&#34892;&#12290;&#20851;&#38190;&#26159;&#39033;&#30446;&#33021;&#22815;&#35828;&#20986;&#26469;&#23427;&#30340;&#20570;&#27861;&#12290;&#19968;&#20010;&#20551;&#35013;&#27665;&#20027;&#30340;&#29420;&#35009;&#20250;&#35753;&#20154;&#21388;&#24694;&#65307;&#22914;&#26524;&#29420;&#35009;&#32773;&#21482;&#35201;&#26377;&#33021;&#21147;&#24182;&#34987;&#20449;&#20219;&#65292;&#19968;&#20999;&#37117;&#20250;&#24456;&#22909;&#12290;</p><p>&#23436;&#25972;&#30340;&#24320;&#21457;&#32773;&#25351;&#21335;&#23454;&#20363;&#21487;&#20197;&#30475;<a class="ulink" href="http://svn.collab.net/repos/svn/trunk/www/hacking.html" target="_top">http://svn.collab.net/repos/svn/trunk/www/hacking.html</a>&#65292;&#25110;&#32773;&#26159;&#26356;&#21152;&#20851;&#27880;&#31649;&#29702;&#21644;&#21442;&#19982;&#31934;&#31070;&#65292;&#32780;&#36739;&#23569;&#20851;&#27880;&#25216;&#26415;&#20107;&#21153;&#30340;<a class="ulink" href="http://www.openoffice.org/dev_docs/guidelines.html" target="_top">http://www.openoffice.org/dev_docs/guidelines.html</a>&#12290;</p><p>&#20026;&#31243;&#24207;&#21592;&#25552;&#20379;&#21333;&#29420;&#30340;&#36719;&#20214;&#25351;&#23548;&#30340;&#38382;&#39064;&#20250;&#22312;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="getting-started.html#developer-documentation" title="&#24320;&#21457;&#32773;&#25991;&#26723;">the section called &#8220;&#24320;&#21457;&#32773;&#25991;&#26723;&#8221;</a>&#35752;&#35770;&#12290;</p></div><div class="sect2" title="&#25991;&#26723;"><div class="titlepage"><div><div><h3 class="title"><a name="documentation"></a>&#25991;&#26723;</h3></div></div></div><p>&#25991;&#26723;&#38750;&#24120;&#24517;&#35201;&#12290;&#38656;&#35201;&#26377;&#19968;&#20123;&#29992;&#25143;&#21487;&#20197;&#35835;&#30340;<span class="emphasis"><em>&#20869;&#23481;</em></span>&#65292;&#21363;&#20351;&#23427;&#38750;&#24120;&#22522;&#26412;&#21644;&#19981;&#23436;&#25972;&#12290;&#22312;&#21021;&#26399;&#36825;&#26679;&#20570;&#30830;&#23454;&#26159;&#19968;&#20214;&#8220;&#33510;&#24046;&#20107;&#8221;&#65292;&#32463;&#24120;&#25104;&#20026;&#26032;&#24320;&#28304;&#39033;&#30446;&#30340;&#31532;&#19968;&#20010;&#22833;&#36133;&#20043;&#22788;&#12290;&#25552;&#20986;&#20351;&#21629;&#22768;&#26126;&#21644;&#29305;&#24615;&#21015;&#34920;&#12289;&#36873;&#25321;&#19968;&#20010;&#35768;&#21487;&#35777;&#12289;&#27010;&#36848;&#24320;&#21457;&#29366;&#24577;&#8212;&#36825;&#37117;&#26159;&#30456;&#23545;&#30340;&#23567;&#20219;&#21153;&#65292;&#23436;&#25104;&#21518;&#36890;&#24120;&#21487;&#20197;&#19981;&#24517;&#36820;&#22238;&#32487;&#32493;&#24037;&#20316;&#12290;&#32780;&#21478;&#19968;&#26041;&#38754;&#65292;&#25991;&#26723;&#27704;&#36828;&#27809;&#26377;&#30495;&#27491;&#30340;&#32467;&#26463;&#65292;&#36825;&#21487;&#33021;&#20063;&#26159;&#20154;&#20204;&#24635;&#26159;&#24310;&#36831;&#24320;&#22987;&#25991;&#26723;&#30340;&#19968;&#20010;&#21407;&#22240;&#12290;</p><p>&#19968;&#20010;&#38544;&#20239;&#30340;&#20107;&#23454;&#26159;&#65292;&#25991;&#26723;&#23545;&#20110;&#32534;&#20889;&#32773;&#30340;&#21151;&#29992;&#19982;&#38405;&#35835;&#32773;&#30340;&#21151;&#29992;&#26159;&#30456;&#21453;&#30340;&#12290;&#23545;&#20110;&#21021;&#22987;&#29992;&#25143;&#26469;&#35828;&#26368;&#37325;&#35201;&#30340;&#26159;&#22522;&#30784;&#25991;&#26723;&#65306;&#22914;&#20309;&#24555;&#36895;&#37197;&#32622;&#36719;&#20214;&#65292;&#36719;&#20214;&#22914;&#20309;&#24037;&#20316;&#30340;&#27010;&#36848;&#20197;&#21450;&#19968;&#20123;&#24120;&#35268;&#25805;&#20316;&#30340;&#25351;&#23548;&#12290;&#32780;&#36825;&#20123;&#36890;&#24120;&#26159;<span class="emphasis"><em>&#32534;&#20889;&#32773;</em></span>&#25152;&#38750;&#24120;&#29087;&#24713;&#30340;&#20869;&#23481;&#8212;&#20197;&#33267;&#20110;&#24456;&#38590;&#20174;&#35835;&#32773;&#30340;&#35282;&#24230;&#30475;&#38382;&#39064;&#65292;&#22240;&#32780;&#20182;&#20204;&#19981;&#20250;&#36153;&#21147;&#21435;&#34920;&#36848;&#19968;&#20123;&#38750;&#24120;&#26126;&#26174;&#32780;&#19981;&#20540;&#19968;&#25552;&#30340;&#27493;&#39588;&#12290;</p><p>&#23545;&#36825;&#20010;&#38382;&#39064;&#27809;&#26377;&#31070;&#22855;&#30340;&#35299;&#20915;&#21150;&#27861;&#12290;&#24517;&#39035;&#26377;&#20154;&#22352;&#19979;&#26469;&#20889;&#22909;&#20869;&#23481;&#65292;&#28982;&#21518;&#20132;&#32473;&#26222;&#36890;&#30340;&#29992;&#25143;&#26469;&#39564;&#35777;&#23427;&#30340;&#36136;&#37327;&#12290;&#20351;&#29992;&#31616;&#21333;&#21644;&#23481;&#26131;&#32534;&#36753;&#30340;&#26684;&#24335;&#65292;&#20363;&#22914;HTML&#12289;&#32431;&#25991;&#26412;&#12289;Texinfo&#25110;&#19968;&#20123;XML&#30340;&#21464;&#31181;&#8212;&#20415;&#20110;&#22312;&#28608;&#21169;&#19979;&#21487;&#20197;&#36731;&#22411;&#21644;&#24555;&#36895;&#30340;&#20316;&#20986;&#25913;&#36827;&#12290;&#36825;&#19981;&#20165;&#26159;&#20026;&#20102;&#28040;&#38500;&#26368;&#21021;&#20316;&#32773;&#36827;&#34892;&#22686;&#37327;&#25913;&#36827;&#25152;&#24102;&#26469;&#30340;&#20195;&#20215;&#65292;&#20063;&#26159;&#20026;&#20102;&#24076;&#26395;&#20462;&#25913;&#25991;&#26723;&#30340;&#26032;&#21152;&#20837;&#32773;&#12290;</p><p>&#19968;&#20010;&#20445;&#35777;&#22522;&#26412;&#21021;&#22987;&#25991;&#26723;&#23436;&#25104;&#30340;&#26041;&#27861;&#26159;&#39044;&#20808;&#38480;&#21046;&#20854;&#33539;&#22260;&#12290;&#36825;&#31181;&#26041;&#27861;&#33267;&#23569;&#19981;&#20250;&#35753;&#25105;&#20204;&#24863;&#35273;&#26159;&#22312;&#23436;&#25104;&#19968;&#20010;&#24320;&#25918;&#32467;&#23614;&#30340;&#20219;&#21153;&#12290;&#19968;&#20010;&#32463;&#39564;&#26159;&#23427;&#24517;&#39035;&#36798;&#21040;&#19979;&#38754;&#30340;&#26368;&#20302;&#26631;&#20934;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#21578;&#35785;&#35835;&#32773;&#20182;&#20204;&#25152;&#38656;&#30340;&#25216;&#26415;&#25216;&#33021;&#12290;</p></li><li class="listitem"><p>&#28165;&#26970;&#21644;&#23436;&#25972;&#30340;&#25551;&#36848;&#22914;&#20309;&#37197;&#32622;&#36719;&#20214;&#65292;&#24182;&#22312;&#25991;&#26723;&#30340;&#24320;&#22836;&#37096;&#20998;&#21578;&#35785;&#29992;&#25143;&#22914;&#20309;&#36816;&#34892;&#30830;&#35748;&#23433;&#35013;&#25104;&#21151;&#30340;&#35786;&#26029;&#27979;&#35797;&#25110;&#31616;&#21333;&#21629;&#20196;&#12290;&#21551;&#21160;&#25991;&#26723;&#26377;&#26102;&#20505;&#27604;&#20351;&#29992;&#25991;&#26723;&#26356;&#37325;&#35201;&#12290;&#19968;&#20010;&#20154;&#25237;&#20837;&#21040;&#36719;&#20214;&#23433;&#35013;&#21644;&#24320;&#22987;&#30340;&#21162;&#21147;&#36234;&#22810;&#65292;&#22905;&#23601;&#36234;&#26377;&#21487;&#33021;&#25345;&#32493;&#30340;&#25630;&#26126;&#30333;&#27809;&#26377;&#24456;&#22909;&#25991;&#26723;&#25551;&#36848;&#30340;&#39640;&#32423;&#21151;&#33021;&#12290;&#24403;&#20154;&#20204;&#25918;&#24323;&#26102;&#65292;&#20182;&#20204;&#20250;&#24456;&#26089;&#23601;&#25918;&#24323;&#65307;&#22240;&#27492;&#65292;&#22312;&#26089;&#26399;&#38454;&#27573;&#65292;&#20363;&#22914;&#23433;&#35013;&#26102;&#65292;&#38656;&#35201;&#26368;&#22810;&#30340;&#25903;&#25345;&#12290;</p></li><li class="listitem"><p>&#25552;&#20379;&#19968;&#20010;&#26222;&#36890;&#20219;&#21153;&#30340;&#25945;&#31243;&#24335;&#30340;&#23454;&#20363;&#12290;&#24456;&#26174;&#28982;&#65292;&#19981;&#21516;&#20219;&#21153;&#30340;&#20363;&#23376;&#36234;&#22810;&#36234;&#22909;&#65292;&#20294;&#26159;&#26102;&#38388;&#26377;&#38480;&#65292;&#26368;&#22909;&#36824;&#26159;&#36873;&#25321;&#19968;&#20010;&#20219;&#21153;&#24182;&#23436;&#25972;&#30340;&#23436;&#25104;&#23427;&#12290;&#19968;&#26086;&#20154;&#20204;&#30475;&#21040;&#36825;&#20010;&#36719;&#20214;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#20351;&#29992;&#65292;&#20182;&#20204;&#20250;&#24320;&#22987;&#25506;&#32034;&#20854;&#20182;&#38656;&#35201;&#30340;&#21151;&#33021;&#8212;&#22914;&#26524;&#20320;&#36275;&#22815;&#24184;&#36816;&#65292;&#20182;&#20204;&#20250;&#33258;&#24049;&#34917;&#20805;&#25991;&#26723;&#12290;&#36825;&#23558;&#20250;&#35753;&#25105;&#20204;&#21040;&#19979;&#19968;&#28857;...</p></li><li class="listitem"><p>&#26631;&#31034;&#25991;&#26723;&#20013;&#26410;&#23436;&#25104;&#30340;&#37096;&#20998;&#12290;&#36890;&#36807;&#21521;&#35835;&#32773;&#23637;&#31034;&#36825;&#20123;&#19981;&#36275;&#65292;&#21487;&#20197;&#23454;&#29616;&#20320;&#19982;&#20182;&#20204;&#35266;&#28857;&#30340;&#32852;&#30431;&#12290;&#20320;&#30340;&#31227;&#24773;&#20316;&#29992;&#21487;&#20197;&#20351;&#20182;&#20204;&#24674;&#22797;&#20449;&#24515;&#65292;&#19981;&#24517;&#20026;&#30830;&#23450;&#20160;&#20040;&#26159;&#39033;&#30446;&#26368;&#37325;&#35201;&#30340;&#20107;&#24773;&#32780;&#25379;&#25166;&#12290;&#36825;&#20123;&#26631;&#31034;&#19981;&#38656;&#35201;&#25215;&#35834;&#22635;&#34917;&#36825;&#20123;&#31354;&#30333;&#30340;&#26399;&#38480;&#8212;&#23427;&#31561;&#20110;&#26159;&#21512;&#24773;&#21512;&#29702;&#30340;&#20844;&#24320;&#24449;&#38598;&#24535;&#24895;&#32773;&#12290;</p></li></ul></div><p>&#26368;&#21518;&#19968;&#28857;&#26356;&#24191;&#27867;&#37325;&#35201;&#65292;&#20063;&#26356;&#23454;&#38469;&#65292;&#24182;&#21487;&#20197;&#24212;&#29992;&#21040;&#25972;&#20010;&#39033;&#30446;&#20013;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#25991;&#26723;&#20013;&#12290;&#24320;&#28304;&#39046;&#22495;&#20013;&#19968;&#20010;&#37117;&#30693;&#36947;&#30340;&#38382;&#39064;&#23601;&#26159;&#39033;&#30446;&#35268;&#33539;&#12290;&#20320;&#19981;&#24517;&#22840;&#22823;&#39033;&#30446;&#30340;&#36825;&#31181;&#30701;&#22788;&#65292;&#20320;&#21482;&#38656;&#23567;&#24515;&#20919;&#38745;&#30340;&#35782;&#21035;&#20986;&#38656;&#35201;&#36825;&#31181;&#35268;&#33539;&#65288;&#35828;&#26126;&#25991;&#26723;&#12289;Bug&#36319;&#36394;&#25968;&#25454;&#24211;&#25110;&#37038;&#20214;&#21015;&#34920;&#35752;&#35770;&#20013;&#37117;&#21487;&#20197;&#65289;&#30340;&#22330;&#26223;&#12290;&#23601;&#39033;&#30446;&#32780;&#35328;&#65292;&#27809;&#26377;&#20154;&#20250;&#35270;&#20854;&#20026;&#22833;&#36133;&#20027;&#20041;&#65292;&#20063;&#19981;&#20250;&#35748;&#20026;&#36825;&#26159;&#23545;&#22312;&#29305;&#23450;&#26085;&#26399;&#23436;&#25104;&#30340;&#25215;&#35834;&#65292;&#38500;&#38750;&#39033;&#30446;&#26126;&#30830;&#20316;&#20986;&#36825;&#31181;&#25215;&#35834;&#12290;&#22240;&#20026;&#20351;&#29992;&#36719;&#20214;&#30340;&#25152;&#26377;&#20154;&#37117;&#20250;&#21457;&#29616;&#36825;&#31181;&#19981;&#36275;&#65292;&#20182;&#20204;&#26368;&#22909;&#33021;&#22312;&#24515;&#29702;&#19978;&#20570;&#22909;&#20934;&#22791;&#8212;&#28982;&#21518;&#39033;&#30446;&#23601;&#26377;&#20102;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#30340;&#22362;&#23454;&#30693;&#35782;&#12290;</p><div class="sidebar" title="&#32500;&#25252;FAQ"><a name="starting-a-faq"></a><div class="titlepage"><div><div><p class="title"><b>&#32500;&#25252;FAQ</b></p></div></div></div><p>&#19968;&#20010;<em class="firstterm">FAQ</em>&#65288;&#8220;&#24120;&#35265;&#38382;&#39064;&#21015;&#34920;&#8221;&#65289;&#23601;&#25945;&#32946;&#24847;&#20041;&#30340;&#22238;&#25253;&#26469;&#35762;&#65292;&#21487;&#33021;&#26159;&#26368;&#22909;&#30340;&#25237;&#36164;&#20043;&#19968;&#12290;&#38750;&#24120;&#25552;&#20513;&#23558;FAQ&#35843;&#25972;&#20026;&#29992;&#25143;&#21644;&#24320;&#21457;&#32773;&#23454;&#38469;&#25552;&#20986;&#30340;&#38382;&#39064;&#8212;&#32780;&#19981;&#24212;&#35813;&#26159;&#20320;<span class="emphasis"><em>&#26399;&#26395;</em></span>&#20182;&#20204;&#25552;&#20986;&#30340;&#38382;&#39064;&#8212;&#22240;&#27492;&#65292;&#19968;&#20010;&#32500;&#25252;&#33391;&#22909;&#30340;FAQ&#21487;&#20197;&#35753;&#21672;&#35810;&#32773;&#20174;&#20013;&#20934;&#30830;&#30340;&#25214;&#21040;&#23547;&#25214;&#30340;&#31572;&#26696;&#12290;&#22312;&#36935;&#21040;&#38382;&#39064;&#26102;&#65292;FAQ&#36890;&#24120;&#26159;&#29992;&#25143;&#39318;&#20808;&#26597;&#25214;&#30340;&#22320;&#26041;&#65292;&#29978;&#33267;&#27604;&#27491;&#24335;&#25163;&#20876;&#26356;&#21463;&#20154;&#20559;&#29233;&#65292;&#21487;&#33021;&#25104;&#20026;&#20854;&#20182;&#31449;&#28857;&#38142;&#25509;&#26368;&#22810;&#30340;&#25991;&#26723;&#12290;</p><p>&#20294;&#24456;&#19981;&#24184;&#65292;&#20320;&#19981;&#21487;&#33021;&#22312;&#39033;&#30446;&#30340;&#24320;&#22987;&#23601;&#23436;&#25104;FAQ&#12290;&#22909;&#30340;FAQ&#19981;&#26159;&#20889;&#25104;&#30340;&#65292;&#32780;&#26159;&#38271;&#25104;&#30340;&#12290;&#23427;&#20204;&#26159;&#36890;&#36807;&#23450;&#20041;&#21709;&#24212;&#25991;&#26723;&#65292;&#38543;&#30528;&#20154;&#20204;&#23545;&#36719;&#20214;&#30340;&#26085;&#24120;&#20351;&#29992;&#32780;&#36827;&#21270;&#12290;&#22240;&#20026;&#19981;&#33021;&#39044;&#24863;&#21040;&#29992;&#25143;&#23558;&#20250;&#25552;&#20986;&#30340;&#38382;&#39064;&#65292;&#25152;&#20197;&#25105;&#20204;&#26080;&#27861;&#20174;&#22836;&#24320;&#22987;&#32534;&#20889;&#26377;&#29992;&#30340;FAQ&#12290;</p><p>&#22240;&#27492;&#65292;&#19981;&#35201;&#22312;&#36825;&#26041;&#38754;&#28010;&#36153;&#26102;&#38388;&#20102;&#12290;&#20294;&#26080;&#35770;&#22914;&#20309;&#65292;&#20320;&#25110;&#35768;&#20250;&#21457;&#29616;&#21019;&#24314;&#19968;&#20010;FAQ&#30340;&#31354;&#30333;&#27169;&#26495;&#20250;&#24456;&#26377;&#29992;&#65292;&#24456;&#26126;&#26174;&#36825;&#26679;&#21487;&#20197;&#24110;&#21161;&#20154;&#20204;&#22312;&#39033;&#30446;&#36827;&#34892;&#20013;&#36129;&#29486;&#38382;&#39064;&#21644;&#31572;&#26696;&#12290;&#27492;&#26102;&#65292;&#26368;&#37325;&#35201;&#30340;&#24615;&#36136;&#19981;&#26159;&#23436;&#25972;&#65292;&#32780;&#26159;&#26041;&#20415;&#65306;&#22914;&#26524;&#28155;&#21152;FAQ&#38750;&#24120;&#31616;&#21333;&#65292;&#20154;&#20204;&#23601;&#20250;&#21435;&#28155;&#21152;&#12290; &#65288;&#27491;&#30830;&#30340;FAQ&#32500;&#25252;&#24212;&#35813;&#26159;&#29305;&#27530;&#21644;&#36855;&#24785;&#24615;&#30340;&#38382;&#39064;&#65292;&#23558;&#20250;&#22312;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a></span>&#30340;<a class="xref" href="share-management.html#faq-manager" title="FAQ&#31649;&#29702;&#21592;">the section called &#8220;FAQ&#31649;&#29702;&#21592;&#8221;</a>&#35814;&#32454;&#35752;&#35770;&#12290;&#65289;</p></div><div class="sect3" title="&#25991;&#26723;&#30340;&#21487;&#29992;&#24615;"><div class="titlepage"><div><div><h4 class="title"><a name="documentation-availability"></a>&#25991;&#26723;&#30340;&#21487;&#29992;&#24615;</h4></div></div></div><p>&#22312;&#20004;&#20010;&#22320;&#26041;&#24517;&#39035;&#26377;&#25991;&#26723;&#65306;&#22312;&#32447;&#65288;&#30452;&#25509;&#22312;&#32593;&#31449;&#19978;&#65289;&#65292;<span class="emphasis"><em>&#20197;&#21450;</em></span>&#36719;&#20214;&#21487;&#19979;&#36733;&#20998;&#21457;&#29256;&#26412;&#65288;&#35265;<span><a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a></span>&#30340;<a class="xref" href="packaging.html" title="&#25171;&#21253;">the section called &#8220;&#25171;&#21253;&#8221;</a>&#65289;&#20013;&#12290;&#23427;&#24517;&#39035;&#20197;&#21487;&#27983;&#35272;&#30340;&#24418;&#24335;&#22312;&#32447;&#65292;&#22240;&#20026;&#36890;&#24120;&#20154;&#20204;&#20250;&#22312;&#31532;&#19968;&#27425;&#19979;&#36733;&#36719;&#20214;<span class="emphasis"><em>&#20043;&#21069;</em></span>&#39318;&#20808;&#38405;&#35835;&#25991;&#26723;&#65292;&#20197;&#20915;&#23450;&#26159;&#21542;&#19979;&#36733;&#12290;&#20294;&#26159;&#20063;&#24517;&#39035;&#21644;&#36719;&#20214;&#37197;&#22871;&#65292;&#22240;&#20026;&#21407;&#21017;&#19978;&#19979;&#36733;&#20013;&#24517;&#39035;&#21253;&#25324;&#20351;&#29992;&#36719;&#20214;&#21253;&#30340;&#25152;&#26377;&#24517;&#39035;&#20869;&#23481;&#12290;</p><p>&#23545;&#20110;&#22312;&#32447;&#25991;&#26723;&#65292;&#35201;&#30830;&#23450;&#26377;&#19968;&#20010;&#25351;&#21521;&#21253;&#21547;<span class="emphasis"><em>&#23436;&#25972;</em></span>&#25991;&#26723;&#30340;&#65288;&#35831;&#22312;&#38142;&#25509;&#26049;&#27880;&#26126;"monolithic"&#25110;"all-in-one"&#25110;"single large
page"&#65292;&#20197;&#25552;&#37266;&#20154;&#20204;&#30693;&#36947;&#38656;&#35201;&#26356;&#38271;&#30340;&#19979;&#36733;&#26102;&#38388;&#65289;&#21333;&#29420;HTML&#39029;&#30340;&#38142;&#25509;&#12290;&#36825;&#26159;&#22240;&#20026;&#20154;&#20204;&#32463;&#24120;&#20250;&#22312;&#25972;&#20010;&#25991;&#26723;&#20013;&#23547;&#25214;&#29305;&#23450;&#30340;&#35789;&#27719;&#25110;&#30701;&#35821;&#12290;&#36890;&#24120;&#26159;&#20182;&#20204;&#24050;&#32463;&#30693;&#36947;&#20182;&#20204;&#22312;&#25214;&#20160;&#20040;&#65307;&#21482;&#26159;&#35760;&#19981;&#20303;&#20855;&#20307;&#30340;&#31456;&#33410;&#12290;&#23545;&#20110;&#27492;&#31867;&#20154;&#65292;&#26368;&#37057;&#38391;&#30340;&#23601;&#26159;&#36935;&#21040;&#19968;&#20010;&#30446;&#24405;&#39029;&#38754;&#12289;&#28982;&#21518;&#26159;&#25351;&#23548;&#39029;&#38754;&#12289;&#28982;&#21518;&#26159;&#23433;&#35013;&#25351;&#23548;&#31561;&#31561;&#12290;&#24403;&#39029;&#38754;&#26159;&#22914;&#27492;&#29712;&#30862;&#26102;&#65292;&#27983;&#35272;&#22120;&#30340;&#25628;&#32034;&#21151;&#33021;&#23558;&#21464;&#24471;&#27627;&#26080;&#20316;&#29992;&#12290;&#20998;&#39029;&#30340;&#26679;&#24335;&#36866;&#21512;&#37027;&#20123;&#30693;&#36947;&#20182;&#20204;&#25152;&#38656;&#31456;&#33410;&#65292;&#25110;&#26159;&#20174;&#22836;&#21040;&#23614;&#38405;&#35835;&#30340;&#20154;&#12290;&#20294;&#36825;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#35775;&#38382;&#25991;&#26723;&#30340;&#24120;&#35268;&#26041;&#24335;&#12290;&#36890;&#24120;&#26159;&#26576;&#20154;&#24050;&#32463;&#29087;&#24713;&#20102;&#36719;&#20214;&#65292;&#36820;&#22238;&#26469;&#25628;&#32034;&#29305;&#23450;&#30340;&#35789;&#27719;&#25110;&#30701;&#35821;&#12290;&#22914;&#26524;&#26410;&#33021;&#25552;&#20379;&#19968;&#20010;&#21333;&#29420;&#30340;&#12289;&#21487;&#25628;&#32034;&#30340;&#25991;&#26723;&#20250;&#35753;&#20182;&#20204;&#27963;&#30340;&#24456;&#36763;&#33510;&#12290;</p></div><div class="sect3" title="&#24320;&#21457;&#32773;&#25991;&#26723;"><div class="titlepage"><div><div><h4 class="title"><a name="developer-documentation"></a>&#24320;&#21457;&#32773;&#25991;&#26723;</h4></div></div></div><p>&#24320;&#21457;&#32773;&#25991;&#26723;&#20027;&#35201;&#20026;&#20102;&#24110;&#21161;&#31243;&#24207;&#21592;&#29702;&#35299;&#20195;&#30721;&#65292;&#20174;&#32780;&#20462;&#25913;&#21644;&#25193;&#23637;&#36719;&#20214;&#12290;&#36825;&#19982;&#26356;&#20851;&#27880;&#31038;&#20132;&#24615;&#32780;&#19981;&#26159;&#25216;&#26415;&#24615;&#30340;<span class="emphasis"><em>&#24320;&#21457;&#32773;&#25351;&#21335;</em></span>&#26377;&#20123;&#35768;&#19981;&#21516;&#12290;&#24320;&#21457;&#32773;&#25351;&#21335;&#21578;&#35785;&#31243;&#24207;&#21592;&#22914;&#20309;&#19982;&#20195;&#30721;&#26412;&#36523;&#25171;&#20132;&#36947;&#12290;&#20026;&#20102;&#26041;&#20415;&#65292;&#36825;&#20004;&#20010;&#25991;&#26723;&#36890;&#24120;&#20250;&#25972;&#29702;&#20026;&#19968;&#20221;&#25991;&#26723;&#65288;&#20363;&#22914;&#21069;&#38754;&#25552;&#21040;&#30340;<a class="ulink" href="http://svn.collab.net/repos/svn/trunk/www/hacking.html" target="_top">http://svn.collab.net/repos/svn/trunk/www/hacking.html</a>&#65289;&#65292;&#20294;&#26159;&#36825;&#19981;&#26159;&#24517;&#39035;&#30340;&#12290;</p><p>&#23613;&#31649;&#24320;&#21457;&#32773;&#25991;&#26723;&#21487;&#33021;&#24456;&#26377;&#29992;&#65292;&#20294;&#20063;&#27809;&#26377;&#20026;&#20102;&#23427;&#32780;&#24433;&#21709;&#21457;&#24067;&#12290;&#21482;&#35201;&#21407;&#22987;&#20316;&#32773;&#36824;&#22312;&#32780;&#19988;&#24895;&#24847;&#65292;&#23601;&#21487;&#20197;&#22238;&#31572;&#20851;&#20110;&#20195;&#30721;&#30340;&#38382;&#39064;&#65292;&#19968;&#24320;&#22987;&#36825;&#23601;&#36275;&#22815;&#20102;&#12290;&#23454;&#38469;&#19978;&#65292;&#21453;&#22797;&#22238;&#31572;&#30456;&#21516;&#30340;&#38382;&#39064;&#26159;&#32534;&#20889;&#36825;&#20010;&#25991;&#26723;&#30340;&#21160;&#21147;&#25152;&#22312;&#12290;&#20294;&#21363;&#20351;&#25991;&#26723;&#36824;&#27809;&#26377;&#20889;&#65292;&#22362;&#23450;&#22320;&#21442;&#19982;&#32773;&#20063;&#20381;&#28982;&#20250;&#35774;&#27861;&#20197;&#33258;&#24049;&#30340;&#26041;&#24335;&#22788;&#29702;&#20195;&#30721;&#12290;&#39537;&#20351;&#20154;&#20204;&#33457;&#26102;&#38388;&#30740;&#31350;&#20195;&#30721;&#22522;&#30340;&#21407;&#22240;&#26159;&#20182;&#20204;&#21457;&#29616;&#36825;&#20123;&#20195;&#30721;&#23545;&#20182;&#20204;&#26377;&#29992;&#12290;&#22914;&#26524;&#20154;&#20204;&#30456;&#20449;&#36825;&#19968;&#28857;&#65292;&#20182;&#20204;&#23601;&#20250;&#33457;&#26102;&#38388;&#21435;&#25630;&#26126;&#30333;&#65307;&#22914;&#26524;&#20182;&#20204;&#19981;&#30456;&#20449;&#65292;&#20877;&#22810;&#30340;&#24320;&#21457;&#32773;&#25991;&#26723;&#20063;&#30041;&#19981;&#20303;&#20182;&#20204;&#12290;</p><p>&#22914;&#26524;&#20320;&#26377;&#26102;&#38388;&#20026;&#19968;&#20010;&#35835;&#32773;&#20889;&#25991;&#26723;&#65292;&#37027;&#36824;&#26159;&#20889;&#32473;&#25152;&#26377;&#29992;&#25143;&#21543;&#12290;&#25152;&#26377;&#29992;&#25143;&#30340;&#25991;&#26723;&#65292;&#21644;&#24320;&#21457;&#32773;&#25991;&#26723;&#26377;&#21516;&#26679;&#30340;&#25928;&#26524;&#65307;&#20026;&#36719;&#20214;&#24037;&#20316;&#30340;&#31243;&#24207;&#21592;&#19968;&#23450;&#23545;&#22914;&#20309;&#20351;&#29992;&#20063;&#38750;&#24120;&#29087;&#24713;&#12290;&#20043;&#21518;&#65292;&#24403;&#20320;&#30475;&#21040;&#31243;&#24207;&#21592;&#21453;&#22797;&#35810;&#38382;&#30456;&#21516;&#30340;&#38382;&#39064;&#26102;&#65292;&#20320;&#23601;&#24212;&#35813;&#20026;&#20182;&#20204;&#32534;&#20889;&#21333;&#29420;&#30340;&#25991;&#26723;&#12290;</p><p>&#19968;&#20123;&#39033;&#30446;&#20351;&#29992;wiki&#20316;&#20026;&#21021;&#22987;&#25991;&#26723;&#65292;&#29978;&#33267;&#20316;&#20026;&#20182;&#20204;&#20027;&#35201;&#30340;&#25991;&#26723;&#12290;&#22312;&#25105;&#30340;&#32463;&#39564;&#37324;&#65292;&#21482;&#26377;&#25991;&#26723;&#26159;&#34987;&#23569;&#25968;&#35748;&#21487;&#25991;&#26723;&#30340;&#32452;&#32455;&#26041;&#24335;&#21644;&#21253;&#21547;&#20869;&#23481;&#30340;&#25104;&#21592;&#32534;&#36753;&#26102;&#65292;&#25165;&#33021;&#27491;&#24120;&#24037;&#20316;&#12290;&#26356;&#22810;&#32454;&#33410;&#22312;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a></span>&#30340;<a class="xref" href="wikis.html" title="Wikis">the section called &#8220;Wikis&#8221;</a>&#12290;</p></div></div><div class="sect2" title="&#36755;&#20986;&#21644;&#23631;&#24149;&#25130;&#22270;&#23454;&#20363;"><div class="titlepage"><div><div><h3 class="title"><a name="example-output"></a>&#36755;&#20986;&#21644;&#23631;&#24149;&#25130;&#22270;&#23454;&#20363;</h3></div></div></div><p>&#22914;&#26524;&#19968;&#20010;&#39033;&#30446;&#21253;&#21547;&#22270;&#24418;&#21270;&#30340;&#29992;&#25143;&#30028;&#38754;&#65292;&#25110;&#32773;&#29983;&#25104;&#22270;&#24418;&#21644;&#20854;&#20182;&#29305;&#21035;&#30340;&#36755;&#20986;&#65292;&#37027;&#20040;&#23601;&#24212;&#35813;&#23558;&#36825;&#20123;&#26679;&#20363;&#25918;&#21040;&#39033;&#30446;&#32593;&#31449;&#19978;&#12290;&#22914;&#26524;&#26159;&#30028;&#38754;&#65292;&#37027;&#24212;&#35813;&#26159;&#25130;&#22270;&#65307;&#23545;&#20110;&#36755;&#20986;&#65292;&#21487;&#20197;&#26159;&#25130;&#22270;&#25110;&#21482;&#26159;&#25991;&#20214;&#12290;&#20294;&#26159;&#20026;&#20102;&#36814;&#21512;&#20154;&#20204;&#31435;&#21051;&#28385;&#36275;&#30340;&#38656;&#35201;&#65306;&#19968;&#20010;&#21333;&#29420;&#30340;&#25130;&#22270;&#27604;&#22823;&#27573;&#25551;&#36848;&#25991;&#23383;&#21644;&#37038;&#20214;&#21015;&#34920;&#30340;&#21792;&#21480;&#26356;&#35753;&#20154;&#20449;&#26381;&#65292;&#22240;&#20026;&#25130;&#22270;&#26159;&#36719;&#20214;&#33021;&#27491;&#24120;<span class="emphasis"><em>&#24037;&#20316;</em></span>&#30340;&#19981;&#23481;&#20105;&#36777;&#30340;&#35777;&#25454;&#12290;&#23427;&#21487;&#33021;&#20805;&#28385;bug&#12289;&#21487;&#33021;&#38590;&#20110;&#23433;&#35013;&#12289;&#21487;&#33021;&#25991;&#26723;&#19981;&#20840;&#65292;&#20294;&#26159;&#25130;&#22270;&#26159;&#19968;&#20010;&#20154;&#25237;&#20837;&#36275;&#22815;&#30340;&#31934;&#21147;&#65292;&#21487;&#20197;&#20351;&#20043;&#36816;&#34892;&#30340;&#35777;&#25454;&#12290;</p><div class="sidebar" title="&#23631;&#24149;&#25130;&#22270;"><a name="screenshots"></a><div class="titlepage"><div><div><p class="title"><b>&#23631;&#24149;&#25130;&#22270;</b></p></div></div></div><p>&#22914;&#26524;&#27809;&#20570;&#36807;&#25130;&#22270;&#65292;&#21487;&#33021;&#20250;&#24863;&#35273;&#26377;&#28857;&#40635;&#28902;&#65292;&#36825;&#37324;&#26159;&#19968;&#20123;&#21046;&#20316;&#25130;&#22270;&#30340;&#22522;&#26412;&#25351;&#23548;&#12290;&#20351;&#29992;Gimp&#65288;<a class="ulink" href="http://www.gimp.org/" target="_top">http://www.gimp.org/</a>&#65289;&#65292;&#25171;&#24320;<span class="guimenu">File</span>-&gt;<span class="guimenu">Acquire</span>-&gt;<span class="guimenu">Screenshot</span>&#65292;&#28982;&#21518;&#36873;&#25321;<span class="guimenuitem">Single Window</span>&#25110;
  <span class="guimenuitem">Whole Screen</span>&#65292;&#28982;&#21518;&#28857;
  <span class="guimenuitem">OK</span>&#12290;&#28982;&#21518;&#20320;&#30340;&#19979;&#19968;&#27425;&#40736;&#26631;&#28857;&#20987;&#23601;&#20250;&#25429;&#25417;&#31383;&#21475;&#25110;&#23631;&#24149;&#65292;&#25104;&#20026;Gimp&#30340;&#19968;&#20010;&#25991;&#20214;&#12290;&#22914;&#26524;&#24517;&#35201;&#65292;&#36824;&#21487;&#20197;&#23545;&#22270;&#20687;&#36827;&#34892;&#21098;&#35009;&#21644;&#22823;&#23567;&#35843;&#25972;&#65292;&#30456;&#20851;&#25351;&#23548;&#22312;<a class="ulink" href="http://www.gimp.org/tutorials/Lite_Quickies/#crop" target="_top">http://www.gimp.org/tutorials/Lite_Quickies/#crop</a>&#12290;</p></div></div><p>&#36824;&#26377;&#19968;&#20123;&#19996;&#35199;&#38656;&#35201;&#25918;&#32622;&#21040;&#32593;&#31449;&#20013;&#65292;&#22914;&#26524;&#20320;&#26377;&#26102;&#38388;&#65292;&#25110;&#32773;&#22914;&#26524;&#20986;&#20110;&#26576;&#31181;&#21407;&#22240;&#32780;&#26174;&#24471;&#29305;&#21035;&#21512;&#36866;&#65306;&#19968;&#20010;&#26032;&#38395;&#39029;&#12289;&#19968;&#20010;&#39033;&#30446;&#21382;&#21490;&#39029;&#12289;&#19968;&#20010;&#30456;&#20851;&#38142;&#25509;&#39029;&#12289;&#31449;&#28857;&#25628;&#32034;&#29305;&#24615;&#21644;&#25424;&#36192;&#39029;&#31561;&#31561;&#12290;&#24320;&#22987;&#26102;&#36825;&#20123;&#37117;&#19981;&#26159;&#24517;&#35201;&#30340;&#65292;&#20294;&#23558;&#26469;&#35201;&#19968;&#30452;&#30041;&#24847;&#12290;</p><div class="sect2" title="&#21253;&#35013;&#20027;&#26426;"><div class="titlepage"><div><div><h3 class="title"><a name="starting-with-canned-hosting"></a>&#21253;&#35013;&#20027;&#26426;</h3></div></div></div><p>&#26377;&#19968;&#20123;&#31449;&#28857;&#20026;&#24320;&#28304;&#39033;&#30446;&#25552;&#20379;&#20813;&#36153;&#30340;&#20027;&#26426;&#21644;&#22522;&#30784;&#35774;&#26045;&#65306;web&#31449;&#28857;&#12289;&#29256;&#26412;&#25511;&#21046;&#12289;bug&#36319;&#36394;&#12289;&#19979;&#36733;&#21306;&#12289;&#35752;&#35770;&#35770;&#22363;&#21644;&#23450;&#26399;&#22791;&#20221;&#31561;&#31561;&#12290;&#20855;&#20307;&#32454;&#33410;&#31449;&#28857;&#20043;&#38388;&#21508;&#19981;&#30456;&#21516;&#65292;&#36890;&#36807;&#20351;&#29992;&#36825;&#20123;&#31449;&#28857;&#65292;&#20320;&#21487;&#20197;&#20813;&#36153;&#24471;&#21040;&#22522;&#30784;&#26381;&#21153;&#12290;&#20294;&#26159;&#24456;&#26126;&#26174;&#20320;&#20063;&#21516;&#26102;&#25918;&#24323;&#20102;&#36890;&#36807;&#29992;&#25143;&#32463;&#39564;&#65292;&#26469;&#36827;&#34892;&#32454;&#21270;&#25511;&#21046;&#30340;&#33021;&#21147;&#12290;&#20027;&#26426;&#26381;&#21153;&#20915;&#23450;&#20102;&#31449;&#28857;&#36816;&#34892;&#30340;&#36719;&#20214;&#65292;&#20063;&#25511;&#21046;&#20102;&#25110;&#33267;&#23569;&#24433;&#21709;&#20102;&#39033;&#30446;&#31449;&#28857;&#30340;&#24863;&#35266;&#12290;</p><p><span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="web-site.html#canned-hosting" title="&#21253;&#35013;&#20027;&#26426;">the section called &#8220;&#21253;&#35013;&#20027;&#26426;&#8221;</a>&#26159;&#21253;&#35013;&#20027;&#26426;&#20248;&#32570;&#28857;&#30340;&#35814;&#32454;&#35752;&#35770;&#65292;&#20063;&#26377;&#25552;&#20379;&#36825;&#31181;&#26381;&#21153;&#30340;&#31449;&#28857;&#21015;&#34920;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="today.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="license-quickstart.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#29616;&#29366; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992;</td></tr></table></div></body></html>
