<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#22788;&#29702;&#25104;&#38271;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="communications.html" title="Chapter 6. &#20132;&#27969;"><link rel="prev" href="difficult-people.html" title="&#21050;&#20799;&#22836;"><link rel="next" href="bug-tracker-usage.html" title="Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22788;&#29702;&#25104;&#38271;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="difficult-people.html">Prev</a> </td><th width="60%" align="center">Chapter 6. &#20132;&#27969;</th><td width="20%" align="right"> <a accesskey="n" href="bug-tracker-usage.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#22788;&#29702;&#25104;&#38271;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="growth"></a>&#22788;&#29702;&#25104;&#38271;</h2></div></div></div><p>&#24320;&#28304;&#19990;&#30028;&#20013;&#25104;&#21151;&#30340;&#20215;&#20540;&#24456;&#37325;&#12290;&#38543;&#30528;&#20320;&#30340;&#36719;&#20214;&#30340;&#27969;&#34892;&#65292;&#25628;&#23547;&#20449;&#24687;&#30340;&#20154;&#20063;&#20250;&#24613;&#21095;&#22686;&#21152;&#65292;&#32780;&#33021;&#22815;&#25552;&#20379;&#20449;&#24687;&#30340;&#20154;&#21017;&#22686;&#38271;&#30340;&#24930;&#24456;&#22810;&#12290;&#27492;&#22806;&#65292;&#21363;&#20351;&#27604;&#29575;&#33021;&#22815;&#20445;&#25345;&#24179;&#34913;&#65292;&#22312;&#22823;&#22810;&#25968;&#24320;&#28304;&#39033;&#30446;&#20013;&#22788;&#29702;&#20132;&#27969;&#20063;&#20381;&#28982;&#23384;&#22312;&#22522;&#30784;&#25193;&#23637;&#38382;&#39064;&#12290;&#20197;&#37038;&#20214;&#21015;&#34920;&#20026;&#20363;&#12290;&#22823;&#22810;&#25968;&#39033;&#30446;&#26377;&#19968;&#20010;&#19968;&#33324;&#29992;&#25143;&#38382;&#39064;&#30340;&#37038;&#20214;&#21015;&#34920;&#8212;&#26377;&#26102;&#65292;&#21015;&#34920;&#30340;&#21517;&#31216;&#26159;&#8220;users&#8221;&#12289;&#8220;discuss&#8221;&#12289;&#8220;help&#8221;&#25110;&#20854;&#20182;&#12290;&#26080;&#35770;&#21517;&#31216;&#26159;&#20160;&#20040;&#65292;&#21015;&#34920;&#30340;&#30446;&#30340;&#30456;&#21516;&#65306;&#20026;&#20154;&#20204;&#33719;&#21462;&#38382;&#39064;&#30340;&#31572;&#26696;&#25552;&#20379;&#19968;&#20010;&#22330;&#25152;&#65292;&#21516;&#26102;&#20854;&#20182;&#20154;&#21487;&#20197;&#35266;&#30475;&#24182;&#36890;&#36807;&#35266;&#23519;&#36825;&#31181;&#20132;&#25442;&#65288;&#20551;&#35774;&#30340;&#65289;&#33719;&#21462;&#30693;&#35782;&#12290;</p><p>&#36825;&#31181;&#37038;&#20214;&#21015;&#34920;&#21487;&#20197;&#22312;&#25968;&#21315;&#29992;&#25143;&#21644;&#27599;&#22825;&#20960;&#30334;&#25991;&#31456;&#30340;&#24773;&#20917;&#19979;&#24037;&#20316;&#33391;&#22909;&#12290;&#20294;&#20043;&#21518;&#19981;&#20037;&#65292;&#36825;&#20010;&#31995;&#32479;&#23601;&#20250;&#20986;&#29616;&#38382;&#39064;&#65292;&#22240;&#20026;&#27599;&#20010;&#35746;&#38405;&#32773;&#30475;&#21040;&#30340;&#25991;&#31456;&#20250;&#36229;&#36807;&#21333;&#20010;&#35746;&#38405;&#32773;&#27599;&#22825;&#21487;&#20197;&#22788;&#29702;&#30340;&#25968;&#37327;&#65292;&#36825;&#20010;&#21015;&#34920;&#25104;&#20026;&#20102;&#20854;&#25104;&#21592;&#30340;&#36127;&#25285;&#12290;&#24819;&#35937;&#19968;&#19979;&#65292;&#22914;&#26524;&#24494;&#36719;&#26377;&#19968;&#20010;&#38024;&#23545;Windows XP&#30340;&#37038;&#20214;&#21015;&#34920;&#12290;Windows XP&#26377;&#25968;&#20159;&#30340;&#29992;&#25143;&#65292;&#22914;&#26524;&#20165;&#26377;&#21315;&#20998;&#20043;&#19968;&#30340;&#29992;&#25143;&#22312;24&#23567;&#26102;&#20869;&#26377;&#38382;&#39064;&#65292;&#37027;&#20040;&#36825;&#20010;&#20551;&#35774;&#30340;&#21015;&#34920;&#27599;&#22825;&#20063;&#20250;&#26377;&#25968;&#21313;&#19975;&#30340;&#25991;&#31456;&#65281;&#19981;&#21487;&#33021;&#26377;&#36825;&#31181;&#21015;&#34920;&#65292;&#22240;&#20026;&#19981;&#21487;&#33021;&#26377;&#20154;&#20250;&#19968;&#30452;&#35746;&#38405;&#23427;&#12290;&#38382;&#39064;&#19981;&#20165;&#20165;&#38480;&#20110;&#37038;&#20214;&#21015;&#34920;&#65307;&#21516;&#26679;&#30340;&#36923;&#36753;&#20063;&#21487;&#20197;&#24212;&#29992;&#21040;IRC&#39057;&#36947;&#65292;&#22312;&#32447;&#35752;&#35770;&#35770;&#22363;&#65292;&#20197;&#21450;&#25152;&#26377;&#20174;&#21333;&#20010;&#20154;&#33719;&#21462;&#38382;&#39064;&#30340;&#22242;&#38431;&#12290;&#20854;&#26263;&#31034;&#24182;&#19981;&#21513;&#21033;&#65306;&#22823;&#35268;&#27169;&#24182;&#34892;&#25903;&#25345;&#30340;&#26222;&#36890;&#24320;&#28304;&#27169;&#22411;&#19981;&#33021;&#25193;&#23637;&#21040;&#25903;&#37197;&#20840;&#19990;&#30028;&#30340;&#32423;&#21035;&#12290;</p><p>&#24403;&#35770;&#22363;&#36798;&#21040;&#20020;&#30028;&#28857;&#26102;&#24182;&#19981;&#20250;&#21457;&#29983;&#29190;&#28856;&#12290;&#21482;&#26377;&#19968;&#20010;&#38745;&#24708;&#24708;&#30340;&#36127;&#38754;&#21453;&#39304;&#25928;&#26524;&#65306;&#20154;&#20204;&#20250;&#21462;&#28040;&#21015;&#34920;&#30340;&#35746;&#38405;&#65292;&#25110;&#32773;&#31163;&#24320;IRC&#39057;&#36947;&#65292;&#25110;&#32773;&#19981;&#20877;&#21435;&#21672;&#35810;&#38382;&#39064;&#65292;&#22240;&#20026;&#20182;&#20204;&#26080;&#27861;&#21435;&#21548;&#25152;&#26377;&#30340;&#22122;&#38899;&#12290;&#22240;&#20026;&#26377;&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#20316;&#20986;&#20102;&#29702;&#24615;&#30340;&#36873;&#25321;&#65292;&#35770;&#22363;&#30340;&#27963;&#21160;&#20250;&#30475;&#36215;&#26469;&#19968;&#30452;&#22788;&#20110;&#21487;&#31649;&#29702;&#30340;&#32423;&#21035;&#12290;&#20294;&#26159;&#65292;&#23427;&#31934;&#30830;&#30340;&#22788;&#20110;&#21487;&#31649;&#29702;&#32423;&#21035;&#26159;&#22240;&#20026;&#29702;&#24615;&#30340;&#65288;&#25110;&#20165;&#20165;&#26159;&#26377;&#32463;&#39564;&#30340;&#65289;&#20154;&#20250;&#21435;&#23547;&#25214;&#20854;&#20182;&#22320;&#26041;&#33719;&#21462;&#20449;&#24687;&#8212;&#32780;&#32570;&#20047;&#32463;&#39564;&#30340;&#20154;&#20250;&#30041;&#19979;&#26469;&#32487;&#32493;&#21457;&#34920;&#25991;&#31456;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#65292;&#22914;&#26524;&#20173;&#20351;&#29992;&#26410;&#25193;&#23637;&#30340;&#20132;&#27969;&#27169;&#22411;&#65292;&#37027;&#23601;&#20250;&#20135;&#29983;&#35810;&#38382;&#21644;&#22238;&#31572;&#30340;&#24179;&#22343;&#36136;&#37327;&#36880;&#28176;&#19979;&#38477;&#30340;&#21103;&#20316;&#29992;&#65292;&#24863;&#35273;&#23601;&#22909;&#35937;&#26032;&#29992;&#25143;&#27604;&#21407;&#26469;&#26356;&#21574;&#20102;&#65292;&#20294;&#23454;&#38469;&#19978;&#24182;&#19981;&#26159;&#22914;&#27492;&#12290;&#21482;&#26159;&#39640;&#20154;&#21475;&#35770;&#22363;&#30340;&#25910;&#30410;/&#33457;&#36153;&#27604;&#21464;&#24471;&#26356;&#20302;&#65292;&#33258;&#28982;&#37027;&#20123;&#26377;&#32463;&#39564;&#30340;&#20154;&#20250;&#24320;&#22987;&#22312;&#20854;&#20182;&#22320;&#26041;&#23547;&#25214;&#31572;&#26696;&#12290;&#26681;&#25454;&#39033;&#30446;&#30340;&#25104;&#38271;&#35843;&#25972;&#20132;&#27969;&#26426;&#21046;&#21253;&#21547;&#20004;&#20010;&#30456;&#20851;&#30340;&#31574;&#30053;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#35782;&#21035;&#20986;&#35770;&#22363;&#29305;&#23450;&#37096;&#20998;&#65292;&#29978;&#33267;&#25972;&#20010;&#35770;&#22363;&#27491;&#22312;&#32463;&#21382;&#26377;&#38480;&#21046;&#30340;&#22686;&#38271;&#65292;&#23558;&#36825;&#37096;&#20998;&#20998;&#21106;&#20026;&#26032;&#30340;&#26356;&#19987;&#19994;&#30340;&#35770;&#22363;&#65288;&#20063;&#23601;&#26159;&#35828;&#19981;&#35201;&#35753;&#22351;&#30340;&#25302;&#32047;&#22909;&#30340;&#65289;&#12290;</p></li><li class="listitem"><p>&#30830;&#20445;&#26377;&#35768;&#22810;&#33258;&#21160;&#30340;&#20449;&#24687;&#26469;&#28304;&#65292;&#24182;&#32452;&#32455;&#26377;&#24207;&#12289;&#26356;&#26032;&#21450;&#26102;&#21644;&#26131;&#20110;&#26597;&#25214;&#12290;</p></li></ol></div><p>&#31574;&#30053;&#65288;1&#65289;&#36890;&#24120;&#24182;&#19981;&#38590;&#12290;&#22823;&#22810;&#25968;&#39033;&#30446;&#26377;&#19968;&#20010;&#20027;&#35201;&#35770;&#22363;&#24320;&#22987;&#65306;&#19968;&#20010;&#19968;&#33324;&#30340;&#35752;&#35770;&#37038;&#20214;&#21015;&#34920;&#65292;&#20250;&#21253;&#21547;&#25152;&#26377;&#30340;&#29305;&#24615;&#26500;&#24819;&#12289;&#35774;&#35745;&#38382;&#39064;&#21644;&#32534;&#30721;&#38382;&#39064;&#12290;&#39033;&#30446;&#30340;&#21442;&#19982;&#32773;&#37117;&#20250;&#22312;&#36825;&#20010;&#21015;&#34920;&#19978;&#12290;&#32463;&#36807;&#19968;&#27573;&#26102;&#38388;&#65292;&#25972;&#20010;&#21015;&#34920;&#23601;&#20250;&#24456;&#28165;&#26224;&#30340;&#36827;&#21270;&#20026;&#22522;&#20110;&#19981;&#21516;&#20027;&#39064;&#30340;&#23376;&#21015;&#34920;&#12290;&#20363;&#22914;&#65292;&#19968;&#20123;&#32447;&#32034;&#24456;&#26126;&#26174;&#26159;&#20851;&#20110;&#24320;&#21457;&#21644;&#35774;&#35745;&#65307;&#32780;&#21478;&#22806;&#19968;&#20123;&#26159;&#35832;&#22914;&#8220;&#22914;&#20309;&#23436;&#25104;X&#65311;&#8221;&#30340;&#29992;&#25143;&#38382;&#39064;&#65307;&#25110;&#35768;&#36824;&#26377;&#31532;&#19977;&#31867;&#20851;&#20110;&#22914;&#20309;&#22788;&#29702;bug&#25253;&#21578;&#21644;&#22686;&#24378;&#35831;&#27714;&#30340;&#20027;&#39064;&#65307;&#31561;&#31561;&#12290;&#23545;&#20110;&#27599;&#19968;&#20010;&#20010;&#20307;&#65292;&#25110;&#35768;&#20250;&#21442;&#19982;&#21040;&#35768;&#22810;&#19981;&#21516;&#30340;&#32447;&#32034;&#31867;&#22411;&#65292;&#20294;&#26159;&#36825;&#20123;&#31867;&#22411;&#20043;&#38388;&#27809;&#26377;&#36807;&#22810;&#30340;&#37325;&#21472;&#12290;&#20182;&#20204;&#21487;&#20197;&#21010;&#20998;&#21040;&#19981;&#21516;&#30340;&#21015;&#34920;&#65292;&#32780;&#19981;&#20250;&#36896;&#25104;&#20005;&#37325;&#30340;&#21106;&#25454;&#38382;&#39064;&#65292;&#22240;&#20026;&#36825;&#20123;&#20027;&#39064;&#26497;&#23569;&#20250;&#36328;&#36234;&#20027;&#39064;&#30340;&#36793;&#30028;&#12290;</p><p>&#23454;&#38469;&#19978;&#36825;&#31181;&#20998;&#21106;&#26159;&#20004;&#27493;&#39588;&#30340;&#36807;&#31243;&#12290;&#20320;&#21019;&#24314;&#26032;&#30340;&#21015;&#34920;&#65288;&#25110;&#32773;IRC&#39057;&#36947;&#65292;&#25110;&#20219;&#20309;&#20854;&#20182;&#30340;&#19996;&#35199;&#65289;&#65292;&#28982;&#21518;&#20320;&#35201;&#33457;&#24517;&#35201;&#30340;&#26102;&#38388;&#26377;&#31036;&#35980;&#30340;&#21792;&#21480;&#21644;&#25552;&#37266;&#20154;&#20204;<span class="emphasis"><em>&#20351;&#29992;</em></span>&#26032;&#30340;&#26356;&#21512;&#36866;&#30340;&#35770;&#22363;&#12290;&#21518;&#19968;&#20010;&#27493;&#39588;&#20250;&#25345;&#32493;&#20960;&#21608;&#65292;&#20294;&#26159;&#26368;&#32456;&#20154;&#20204;&#20250;&#26126;&#30333;&#12290;&#20320;&#21482;&#38656;&#23545;&#25152;&#26377;&#21457;&#36865;&#21040;&#38169;&#35823;&#30446;&#26631;&#30340;&#20154;&#35299;&#37322;&#36825;&#20010;&#38382;&#39064;&#65292;&#28982;&#21518;&#22240;&#20026;&#22823;&#23478;&#37117;&#30475;&#21040;&#24471;&#21040;&#65292;&#20154;&#20204;&#23601;&#20250;&#34987;&#40723;&#21169;&#20363;&#34892;&#20844;&#20107;&#19968;&#26679;&#21435;&#24110;&#21161;&#35299;&#20915;&#12290;&#24403;&#28982;&#65292;&#25552;&#20379;&#19968;&#20010;&#25152;&#26377;&#21015;&#34920;&#30340;&#25351;&#21335;&#32593;&#39029;&#20063;&#38750;&#24120;&#26377;&#29992;&#65307;&#20320;&#30340;&#22238;&#22797;&#21487;&#20197;&#30452;&#25509;&#24341;&#29992;&#32593;&#39029;&#65292;&#28982;&#21518;&#20316;&#20026;&#22870;&#21169;&#65292;&#25509;&#25910;&#32773;&#20250;&#22312;&#21457;&#34920;&#25991;&#31456;&#21069;&#36890;&#36807;&#25351;&#21335;&#23398;&#20064;&#21040;&#19968;&#20123;&#19996;&#35199;&#12290;</p><p>&#31574;&#30053;&#65288;2&#65289;&#26159;&#19968;&#20010;&#25345;&#32493;&#30340;&#36807;&#31243;&#65292;&#20250;&#20276;&#38543;&#39033;&#30446;&#30340;&#19968;&#29983;&#65292;&#38656;&#35201;&#35768;&#22810;&#21442;&#19982;&#32773;&#12290;&#24403;&#28982;&#65292;&#23427;&#37096;&#20998;&#20381;&#36182;&#20110;&#26159;&#21542;&#25317;&#26377;&#21450;&#26102;&#30340;&#25991;&#26723;&#65288;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="getting-started.html#documentation" title="&#25991;&#26723;">the section called &#8220;&#25991;&#26723;&#8221;</a>&#65289;&#65292;&#24182;&#33021;&#22815;&#25351;&#24341;&#20154;&#20204;&#21435;&#35266;&#30475;&#12290;&#20294;&#19981;&#20165;&#20165;&#22914;&#27492;&#65307;&#36825;&#20010;&#23567;&#33410;&#30340;&#21518;&#38754;&#20250;&#35814;&#32454;&#35752;&#35770;&#36825;&#20010;&#31574;&#30053;&#12290;</p><div class="sect2" title="&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;"><div class="titlepage"><div><div><h3 class="title"><a name="using-archives"></a>&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;</h3></div></div></div><p>&#36890;&#24120;&#26469;&#35828;&#65292;&#24320;&#28304;&#39033;&#30446;&#20013;&#30340;&#25152;&#26377;&#20132;&#27969;&#65288;&#38500;&#20102;&#19968;&#20123;IRC&#30340;&#23545;&#35805;&#65289;&#37117;&#24212;&#35813;&#24402;&#26723;&#12290;&#24402;&#26723;&#24212;&#35813;&#20844;&#24320;&#19988;&#21487;&#25628;&#32034;&#65292;&#24182;&#35201;&#20855;&#22791;&#24341;&#29992;&#30340;&#31283;&#23450;&#24615;&#65306;&#20063;&#23601;&#26159;&#19968;&#26086;&#20449;&#24687;&#35760;&#24405;&#21040;&#20102;&#29305;&#23450;&#30340;&#22320;&#22336;&#65292;&#23601;&#21487;&#20197;&#27704;&#36828;&#20351;&#29992;&#36825;&#20010;&#22320;&#22336;&#12290;</p><p>&#23613;&#21487;&#33021;&#22810;&#30340;&#20351;&#29992;&#37027;&#20123;&#24402;&#26723;&#65292;&#36234;&#26174;&#33879;&#36234;&#22909;&#12290;&#21363;&#20351;&#20320;&#30693;&#36947;&#26576;&#20010;&#38382;&#39064;&#30340;&#31572;&#26696;&#23601;&#22312;&#20320;&#30340;&#33041;&#20013;&#65292;&#20294;&#22914;&#26524;&#20320;&#30693;&#36947;&#24402;&#26723;&#20013;&#26377;&#19968;&#20010;&#21253;&#21547;&#27492;&#31572;&#26696;&#30340;&#24341;&#29992;&#65292;&#37027;&#20040;&#35831;&#25214;&#21040;&#24182;&#23637;&#31034;&#20986;&#26469;&#12290;&#27599;&#27425;&#20320;&#20351;&#29992;&#20844;&#24320;&#21487;&#35265;&#30340;&#26041;&#24335;&#23436;&#25104;&#65292;&#26377;&#20123;&#20154;&#23601;&#20250;&#30693;&#36947;&#24402;&#26723;&#65292;&#24182;&#20250;&#22312;&#20854;&#20013;&#23547;&#25214;&#31572;&#26696;&#12290;&#21478;&#22806;&#65292;&#36890;&#36807;&#24341;&#29992;&#24402;&#26723;&#32780;&#19981;&#26159;&#37325;&#20889;&#24314;&#35758;&#65292;&#21487;&#20197;&#21152;&#24378;&#23545;&#20110;&#22797;&#21046;&#20449;&#24687;&#30340;&#31038;&#20250;&#26631;&#20934;&#12290;&#20026;&#20160;&#20040;&#21516;&#19968;&#20010;&#31572;&#26696;&#20250;&#20986;&#29616;&#22312;&#19981;&#21516;&#30340;&#22320;&#26041;&#65311;&#24403;&#21487;&#20197;&#25214;&#21040;&#31572;&#26696;&#30340;&#22320;&#26041;&#36824;&#27604;&#36739;&#23569;&#65292;&#20154;&#20204;&#23601;&#26356;&#21487;&#33021;&#20250;&#35760;&#20303;&#22320;&#22336;&#24182;&#20877;&#27425;&#26597;&#25214;&#12290;&#31934;&#24515;&#25918;&#32622;&#30340;&#24341;&#29992;&#20063;&#21487;&#20197;&#24110;&#21161;&#25913;&#36827;&#25628;&#32034;&#32467;&#26524;&#30340;&#36136;&#37327;&#65292;&#22240;&#20026;&#20182;&#20204;&#21487;&#20197;&#21152;&#24378;&#30446;&#26631;&#36164;&#28304;&#22312;&#20114;&#32852;&#32593;&#25628;&#32034;&#24341;&#25806;&#20013;&#30340;&#26435;&#37325;&#12290;</p><p>&#24403;&#28982;&#26377;&#26102;&#22797;&#21046;&#20449;&#24687;&#20063;&#26377;&#24847;&#20041;&#12290;&#20363;&#22914;&#65292;&#22312;&#24402;&#26723;&#20013;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#26469;&#33258;&#21035;&#20154;&#30340;&#22238;&#24212;&#35828;&#65306;</p><pre class="screen">
&#30475;&#36215;&#26469;&#20320;&#30340;Scanley&#32034;&#24341;&#24320;&#22987;fronbnicated&#12290;&#20026;&#20102;unfrobnicate&#65292;&#21487;&#20197;&#25353;&#29031;&#22914;&#19979;&#27493;&#39588;&#65306;

1. &#20851;&#38381;Scanley&#26381;&#21153;&#22120;&#12290;
2. &#36816;&#34892;Scanley&#30340;'defrobnicate'&#31243;&#24207;&#12290;
3. &#21551;&#21160;&#26381;&#21153;&#22120;&#12290;
</pre><p>&#28982;&#21518;&#65292;&#20960;&#20010;&#26376;&#20043;&#21518;&#65292;&#20320;&#30475;&#21040;&#21478;&#22806;&#19968;&#31687;&#25991;&#31456;&#26174;&#31034;&#26576;&#20154;&#30340;&#32034;&#24341;&#21464;&#24471;frobnicated&#12290;&#20320;&#25628;&#32034;&#24402;&#26723;&#24182;&#21457;&#29616;&#20102;&#19978;&#38754;&#36825;&#20010;&#36739;&#26089;&#30340;&#22238;&#22797;&#65292;&#20294;&#26159;&#20320;&#35748;&#35782;&#21040;&#23427;&#36951;&#28431;&#20102;&#19968;&#20123;&#27493;&#39588;&#65288;&#25110;&#35768;&#26159;&#22240;&#20026;&#35823;&#35299;&#65292;&#20063;&#21487;&#33021;&#26159;&#22240;&#20026;&#36719;&#20214;&#22312;&#37027;&#31687;&#25991;&#31456;&#20043;&#21518;&#21457;&#29983;&#20102;&#25913;&#21464;&#65289;&#12290;&#26368;&#32463;&#20856;&#30340;&#26041;&#24335;&#26159;&#21457;&#34920;&#19968;&#31687;&#26032;&#25991;&#31456;&#65292;&#26356;&#23436;&#25972;&#30340;&#25351;&#23548;&#65292;&#24182;&#26126;&#30830;&#30340;&#24223;&#24323;&#36739;&#26089;&#30340;&#37027;&#31687;&#25991;&#31456;&#65306;</p><pre class="screen">
&#30475;&#36215;&#26469;&#20320;&#30340;Scanley&#32034;&#24341;&#24050;&#32463;&#21464;&#24471;frobnicated&#12290;&#25105;&#20204;&#22312;7&#26376;&#20221;&#30475;&#21040;&#36807;&#36825;&#20010;&#38382;
&#39064;&#65292;&#32780;&#19988;J. Random&#22312;http://blahblahblah/blah&#21457;&#24067;&#36807;&#19968;&#20010;&#35299;&#20915;&#21150;&#27861;&#12290;&#19979;&#38754;
&#26159;&#26681;&#25454;J. Random&#30340;&#25351;&#23548;unfrobnicate&#20320;&#30340;&#32034;&#24341;&#30340;&#26041;&#27861;&#65292;&#26377;&#19968;&#20123;&#25193;&#23637;&#65306;

1. &#20851;&#38381;Scanley&#26381;&#21153;&#22120;&#12290;
2. &#25104;&#20026;&#36890;&#24120;&#36816;&#34892;Scanley&#26381;&#21153;&#22120;&#30340;&#29992;&#25143;&#12290;
3. &#20316;&#20026;&#35813;&#29992;&#25143;&#65292;&#22312;&#32034;&#24341;&#19978;&#36816;&#34892;'defrobnicate'&#31243;&#24207;&#12290;
4. &#25163;&#24037;&#36816;&#34892;Scanley&#65292;&#24182;&#26597;&#30475;&#32034;&#24341;&#26159;&#21542;&#24037;&#20316;&#12290;
5. &#37325;&#21551;&#26381;&#21153;&#22120;&#12290;
</pre><p>&#65288;&#22312;&#29702;&#24819;&#30340;&#19990;&#30028;&#65292;&#21487;&#20197;&#20026;&#21407;&#26469;&#30340;&#25991;&#31456;&#38468;&#21152;&#19968;&#20010;&#27880;&#37322;&#65292;&#35828;&#26126;&#26377;&#36739;&#26032;&#30340;&#20449;&#24687;&#65292;&#24182;&#25351;&#21521;&#26032;&#25991;&#31456;&#12290;&#28982;&#32780;&#65292;&#25105;&#19981;&#30693;&#36947;&#26377;&#20160;&#20040;&#24402;&#26723;&#36719;&#20214;&#25903;&#25345;&#8220;&#24223;&#24323;&#8221;&#29305;&#24615;&#65292;&#25110;&#35768;&#22240;&#20026;&#22312;&#19981;&#36829;&#21453;&#24402;&#26723;&#36880;&#26465;&#30340;&#24402;&#26723;&#23436;&#25972;&#24615;&#30340;&#24773;&#20917;&#19979;&#23454;&#29616;&#26377;&#19968;&#28857;&#29409;&#29502;&#12290;&#36825;&#26159;&#35774;&#32622;&#19968;&#20010;&#19987;&#38376;&#30340;&#32593;&#39029;&#22238;&#31572;&#24120;&#35265;&#38382;&#39064;&#30340;&#21478;&#19968;&#20010;&#21407;&#22240;&#12290;&#65289;</p><p>&#24402;&#26723;&#21487;&#33021;&#32463;&#24120;&#34987;&#29992;&#26469;&#26597;&#25214;&#25216;&#26415;&#38382;&#39064;&#30340;&#31572;&#26696;&#65292;&#20294;&#26159;&#20182;&#20204;&#23545;&#20110;&#39033;&#30446;&#30340;&#37325;&#35201;&#24615;&#19981;&#20165;&#22914;&#27492;&#12290;&#22914;&#26524;&#35828;&#39033;&#30446;&#30340;&#27491;&#24335;&#25351;&#21335;&#30340;&#27861;&#23450;&#27861;&#24459;&#65292;&#37027;&#20040;&#24402;&#26723;&#23601;&#26159;&#19981;&#25104;&#25991;&#27861;&#65306;&#25152;&#26377;&#20915;&#31574;&#22914;&#20309;&#21046;&#23450;&#21644;&#22914;&#20309;&#24471;&#20986;&#30340;&#35760;&#24405;&#12290;&#23545;&#20110;&#20219;&#20309;&#37325;&#29616;&#30340;&#35752;&#35770;&#65292;&#20174;&#24402;&#26723;&#25628;&#32034;&#24320;&#22987;&#26159;&#20041;&#19981;&#23481;&#36766;&#30340;&#12290;&#36825;&#20801;&#35768;&#20320;&#20174;&#24403;&#21069;&#29366;&#24577;&#12289;&#26399;&#26395;&#30340;&#30446;&#26631;&#12289;&#20030;&#21453;&#35777;&#21644;&#21457;&#29616;&#20320;&#27809;&#26377;&#24819;&#21040;&#31435;&#22330;&#30340;&#25688;&#35201;&#24320;&#22987;&#35752;&#35770;&#12290;&#21478;&#22806;&#65292;&#20854;&#20182;&#21442;&#19982;&#32773;&#20250;<span class="emphasis"><em>&#26399;&#26395;</em></span>&#20320;&#24050;&#32463;&#20570;&#20102;&#24402;&#26723;&#25628;&#32034;&#12290;&#21363;&#20351;&#20043;&#21069;&#30340;&#35752;&#35770;&#27809;&#26377;&#32467;&#26524;&#65292;&#22312;&#20320;&#37325;&#26032;&#25552;&#20986;&#36825;&#20010;&#20027;&#39064;&#26102;&#20063;&#35201;&#25351;&#20986;&#23427;&#20204;&#65292;&#36825;&#26679;&#20154;&#20204;&#23601;&#21487;&#20197;&#33258;&#24049;&#30475;&#21040;a) &#35752;&#35770;&#27809;&#26377;&#32467;&#26524;&#65292;&#24182;&#19988;b) &#20320;&#20570;&#20102;&#21151;&#35838;&#65292;&#37027;&#20040;&#29616;&#22312;&#35828;&#19968;&#20123;&#27809;&#35828;&#36807;&#30340;&#35805;&#21543;&#12290;</p><div class="sect3" title="&#23558;&#25152;&#26377;&#30340;&#36164;&#28304;&#35270;&#20026;&#24402;&#26723;"><div class="titlepage"><div><div><h4 class="title"><a name="all-as-archives"></a>&#23558;&#25152;&#26377;&#30340;&#36164;&#28304;&#35270;&#20026;&#24402;&#26723;</h4></div></div></div><p>&#20043;&#21069;&#30340;&#25152;&#26377;&#24314;&#35758;&#19981;&#21482;&#26159;&#33021;&#24212;&#29992;&#21040;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#12290;&#38646;&#25955;&#30340;&#20449;&#24687;&#37117;&#20301;&#20110;&#31283;&#23450;&#65292;&#20415;&#21033;&#21644;&#21487;&#26597;&#35810;&#30340;&#22320;&#22336;&#65292;&#36825;&#24517;&#39035;&#25104;&#20026;&#39033;&#30446;&#25152;&#26377;&#20449;&#24687;&#30340;&#32452;&#32455;&#21407;&#21017;&#12290;&#25105;&#20204;&#20197;&#39033;&#30446;FAQ&#20026;&#20363;&#36827;&#34892;&#30740;&#31350;&#12290;</p><p>&#20154;&#20204;&#22914;&#20309;&#20351;&#29992;FAQ&#65311;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#20182;&#20204;&#24076;&#26395;&#22312;&#20854;&#20013;&#26597;&#25214;&#29305;&#23450;&#30340;&#21333;&#35789;&#21644;&#30701;&#35821;&#12290;</p></li><li class="listitem"><p>&#20182;&#20204;&#24076;&#26395;&#36827;&#34892;&#27983;&#35272;&#65292;&#33719;&#21462;&#20449;&#24687;&#65292;&#32780;&#19981;&#26159;&#21435;&#23547;&#25214;&#29305;&#23450;&#38382;&#39064;&#30340;&#31572;&#26696;&#12290;</p></li><li class="listitem"><p>&#20182;&#20204;&#24076;&#26395;&#35832;&#22914;Google&#20043;&#31867;&#30340;&#25628;&#32034;&#24341;&#25806;&#21487;&#20197;&#30693;&#36947;FAQ&#30340;&#20869;&#23481;&#65292;&#25152;&#20197;&#21487;&#20197;&#25628;&#32034;&#21040;FAQ&#26465;&#30446;&#12290;</p></li><li class="listitem"><p>&#20182;&#20204;&#24076;&#26395;&#22312;FAQ&#20013;&#30452;&#25509;&#20026;&#20854;&#20182;&#20154;&#25552;&#20379;&#29305;&#23450;&#39033;&#30446;&#30340;&#24341;&#29992;&#12290;</p></li><li class="listitem"><p>&#20182;&#20204;&#24076;&#26395;&#20026;FAQ&#25552;&#20379;&#26032;&#30340;&#26448;&#26009;&#65292;&#20294;&#26159;&#27880;&#24847;&#21040;&#28155;&#21152;&#27604;&#26597;&#35810;&#22238;&#31572;&#35201;&#23569;&#35768;&#22810;&#8212;FAQ&#26356;&#22810;&#30340;&#26159;&#38405;&#35835;&#65292;&#32780;&#19981;&#26159;&#32534;&#20889;&#12290;</p></li></ol></div><p>&#31532;1&#28857;&#26263;&#31034;&#25105;&#20204;FAQ&#19968;&#23450;&#35201;&#20197;&#25991;&#26412;&#26684;&#24335;&#23384;&#22312;&#12290;&#31532;2&#21644;&#31532;3&#28857;&#26263;&#31034;FAQ&#24212;&#24403;&#20197;HTML&#26684;&#24335;&#23384;&#22312;&#65292;&#31532;2&#28857;&#20063;&#35828;&#26126;HTML&#24517;&#39035;&#38024;&#23545;&#21487;&#35835;&#24615;&#36827;&#34892;&#35774;&#35745;&#65288;&#21363;&#20320;&#20250;&#24076;&#26395;&#25511;&#21046;&#36215;&#35266;&#24863;&#65289;&#65292;&#32780;&#19988;&#24517;&#39035;&#26377;&#30446;&#24405;&#12290;&#31532;4&#28857;&#24847;&#21619;&#30528;FAQ&#30340;&#27599;&#20010;&#26465;&#30446;&#37117;&#36171;&#20104;&#20102;&#19968;&#20010;HTML<em class="firstterm">&#21629;&#21517;&#30340;Anchor</em>&#65292;&#19968;&#20010;&#29992;&#25143;&#21487;&#20197;&#21040;&#36798;&#39029;&#38754;&#29305;&#23450;&#20301;&#32622;&#30340;&#26631;&#35760;&#12290;&#31532;5&#28857;&#35828;&#26126;FAQ&#30340;&#28304;&#25991;&#20214;&#24517;&#39035;&#29992;&#20415;&#21033;&#30340;&#26041;&#27861;&#23384;&#22312;&#65288;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="vc.html#version-everything" title="&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;">the section called &#8220;&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;&#8221;</a>&#65289;&#65292;&#24182;&#20351;&#29992;&#26131;&#20110;&#32534;&#36753;&#30340;&#26684;&#24335;&#12290;</p><div class="sidebar" title="&#21629;&#21517;&#30340;Anchor&#21644;ID&#23646;&#24615;"><a name="html-named-anchors-and-ids"></a><div class="titlepage"><div><div><p class="title"><b>&#21629;&#21517;&#30340;Anchor&#21644;ID&#23646;&#24615;</b></p></div></div></div><p>&#26377;&#20004;&#31181;&#26041;&#27861;&#21487;&#20197;&#35753;&#27983;&#35272;&#22120;&#36339;&#21040;&#32593;&#39029;&#30340;&#29305;&#23450;&#20301;&#32622;&#65292;&#21629;&#21517;&#30340;Anchor&#21644;id&#23646;&#24615;&#12290;</p><p><em class="firstterm">&#21629;&#21517;&#30340;anchor</em>&#21482;&#26159;&#26222;&#36890;&#30340;HTML anchor&#20803;&#32032;&#65288;<code class="literal">&lt;a&gt;...&lt;/a&gt;</code>&#65289;&#65292;&#20294;&#21253;&#21547;&#19968;&#20010;&#8220;name&#8221;&#23646;&#24615;&#65306;</p><pre class="screen">&lt;a name="mylabel"&gt;...&lt;/a&gt;</pre><p>&#26356;&#22810;&#29616;&#22312;&#29256;&#26412;&#30340;HTML&#37117;&#25903;&#25345;&#21407;&#22987;&#30340;<em class="firstterm">id&#23646;&#24615;</em>&#65292;&#21487;&#20197;&#38468;&#21152;&#21040;&#20219;&#20309;HTML&#20803;&#32032;&#65292;&#19981;&#20165;&#20165;&#26159;<code class="literal">&lt;a&gt;</code>&#12290;&#20363;&#22914;&#65306;</p><pre class="screen">&lt;p id="mylabel"&gt;...&lt;/p&gt;</pre><p>&#21629;&#21517;&#30340;anchor&#21644;id&#23646;&#24615;&#20197;&#21516;&#26679;&#30340;&#26041;&#27861;&#24212;&#29992;&#12290;&#36890;&#36807;&#22312;URL&#21518;&#36861;&#21152;&#20117;&#21495;&#21644;&#26631;&#31614;&#65292;&#21487;&#20197;&#35753;&#27983;&#35272;&#22120;&#30452;&#25509;&#36339;&#36716;&#21040;&#39029;&#38754;&#30340;&#23450;&#28857;&#20301;&#32622;&#65306;</p><pre class="screen">http://myproject.example.com/faq.html#mylabel</pre><p>&#20107;&#23454;&#19978;&#65292;&#25152;&#26377;&#27983;&#35272;&#22120;&#37117;&#25903;&#25345;&#21629;&#21517;&#30340;anchor&#65307;&#32477;&#22823;&#22810;&#25968;&#29616;&#20195;&#27983;&#35272;&#22120;&#25903;&#25345;id&#23646;&#24615;&#12290;&#23433;&#20840;&#36215;&#35265;&#65292;&#25105;&#20250;&#24314;&#35758;&#35201;&#20040;&#21333;&#29420;&#20351;&#29992;&#21629;&#21517;&#30340;anchor&#65292;&#35201;&#20040;&#21516;&#26102;&#20351;&#29992;&#21629;&#21517;&#30340;anchor<span class="emphasis"><em>&#21644;</em></span>id&#23646;&#24615;&#65288;&#24403;&#28982;&#35201;&#27599;&#19968;&#23545;&#20351;&#29992;&#30456;&#21516;&#30340;&#26631;&#31614;&#65289;&#12290;&#21629;&#21517;&#30340;anchor&#19981;&#33021;&#33258;&#20851;&#38381;&#8212;&#21363;&#20351;&#20803;&#32032;&#20013;&#27809;&#26377;&#25991;&#26412;&#65292;&#20320;&#36824;&#26159;&#38656;&#35201;&#20889;&#25104;&#20004;&#37096;&#20998;&#30340;&#24418;&#24335;&#65306;</p><pre class="screen">&lt;a name="mylabel"&gt;&lt;/a&gt;</pre><p>...&#23613;&#31649;&#19968;&#33324;&#37117;&#20250;&#26377;&#20123;&#25991;&#26412;&#65292;&#20363;&#22914;&#23567;&#33410;&#30340;&#26631;&#39064;&#12290;</p><p>&#26080;&#35770;&#20320;&#26159;&#29992;&#21629;&#21517;&#30340;anchor&#12289;&#36824;&#26159;id&#23646;&#24615;&#12289;&#25110;&#32773;&#20004;&#32773;&#30342;&#26377;&#65292;&#35831;&#29282;&#35760;&#37027;&#20123;&#27809;&#26377;&#20351;&#29992;&#26631;&#31614;&#30340;&#20154;&#30475;&#19981;&#21040;&#36825;&#20123;&#26631;&#31614;&#12290;&#20294;&#26159;&#36825;&#20123;&#20154;&#20250;&#24076;&#26395;&#30693;&#36947;&#29305;&#23450;&#20301;&#32622;&#30340;&#26631;&#31614;&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#21487;&#20197;&#23558;&#26576;&#20010;FAQ&#30340;URL&#21457;&#36865;&#32473;&#33258;&#24049;&#30340;&#26379;&#21451;&#12290;&#20026;&#27492;&#65292;&#38656;&#35201;&#20026;&#28155;&#21152;&#20102;&#8220;name&#8221;&#21644;/&#25110;&#8220;id&#8221;&#23646;&#24615;&#30340;&#20803;&#32032;&#28155;&#21152;<em class="firstterm">title&#23646;&#24615;</em>&#12290;</p><pre class="screen">&lt;a name="mylabel" title="#mylabel"&gt;...&lt;/a&gt;</pre><p>&#24403;&#40736;&#26631;&#25351;&#38024;&#31227;&#21040;&#26377;title&#23646;&#24615;&#30340;&#20803;&#32032;&#26102;&#65292;&#22823;&#22810;&#25968;&#27983;&#35272;&#22120;&#20250;&#24377;&#20986;&#23567;&#26041;&#26694;&#26174;&#31034;&#36825;&#20010;title&#12290;&#25105;&#36890;&#24120;&#20250;&#21253;&#21547;&#20117;&#21495;&#65292;&#25552;&#37266;&#29992;&#25143;&#36825;&#23601;&#26159;&#28155;&#21152;&#22312;URL&#20043;&#21518;&#65292;&#20174;&#32780;&#21487;&#20197;&#22312;&#19979;&#27425;&#30452;&#25509;&#36339;&#36716;&#30340;&#35813;&#20301;&#32622;&#12290;</p></div><p>&#26684;&#24335;&#21270;FAQ&#21482;&#26159;&#22914;&#20309;&#35753;&#19968;&#20010;&#36164;&#28304;&#21487;&#20197;&#23637;&#31034;&#20986;&#26469;&#30340;&#20363;&#23376;&#12290;&#21516;&#26679;&#30340;&#23646;&#24615;&#8212;&#30452;&#25509;&#30340;&#21683;&#22013;&#32034;&#24615;&#12289;&#20027;&#35201;&#25628;&#32034;&#24341;&#25806;&#30340;&#23384;&#22312;&#24615;&#12289;&#21487;&#27983;&#35272;&#24615;&#12289;&#24341;&#29992;&#31283;&#23450;&#24615;&#21644;&#65288;&#21512;&#36866;&#30340;&#22320;&#26041;&#65289;&#21487;&#32534;&#36753;&#24615;&#8212;&#21487;&#20197;&#24212;&#29992;&#21040;&#20854;&#20182;&#32593;&#39029;&#12289;&#28304;&#20195;&#30721;&#26641;&#21644;bug&#36319;&#36394;&#31995;&#32479;&#31561;&#31561;&#12290;&#21482;&#26159;&#22312;&#19981;&#20037;&#20043;&#21069;&#22823;&#22810;&#25968;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#36719;&#20214;&#25165;&#35748;&#35782;&#21040;&#20102;&#36825;&#20123;&#23646;&#24615;&#30340;&#37325;&#35201;&#24615;&#65292;&#20063;&#26159;&#37038;&#20214;&#21015;&#34920;&#20542;&#21521;&#20110;&#26412;&#36523;&#20855;&#22791;&#36825;&#20123;&#21151;&#33021;&#30340;&#21407;&#22240;&#65292;&#20854;&#20182;&#26684;&#24335;&#25110;&#35768;&#38656;&#35201;&#32500;&#25252;&#32773;&#33457;&#36153;&#26356;&#22810;&#30340;&#32463;&#21382;&#65288;<a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#35752;&#35770;&#20102;&#22914;&#20309;&#22312;&#22810;&#20010;&#24535;&#24895;&#32773;&#38388;&#20998;&#25285;&#36127;&#25285;&#65289;&#12290;</p></div></div><div class="sect2" title="&#32534;&#21046;&#27861;&#24459;&#30340;&#20256;&#32479;"><div class="titlepage"><div><div><h3 class="title"><a name="codifying-tradition"></a>&#32534;&#21046;&#27861;&#24459;&#30340;&#20256;&#32479;</h3></div></div></div><p>&#38543;&#30528;&#39033;&#30446;&#30340;&#26085;&#31215;&#26376;&#32047;&#21644;&#22797;&#26434;&#21270;&#65292;&#27599;&#20010;&#26032;&#26469;&#30340;&#21442;&#19982;&#32773;&#24517;&#39035;&#21560;&#25910;&#30340;&#25968;&#25454;&#37327;&#22823;&#22686;&#12290;&#37027;&#20123;&#20276;&#38543;&#39033;&#30446;&#24456;&#38271;&#26102;&#38388;&#30340;&#20154;&#33021;&#22815;&#26681;&#25454;&#20197;&#21069;&#30340;&#32463;&#21382;&#35748;&#35782;&#21040;&#21644;&#21457;&#26126;&#39033;&#30446;&#30340;&#20064;&#20439;&#12290;&#20182;&#20204;&#20250;&#26412;&#33021;&#30340;&#24847;&#35782;&#21040;&#31215;&#32047;&#20102;&#22823;&#37327;&#20256;&#32479;&#65292;&#24182;&#20250;&#20026;&#26032;&#26469;&#32773;&#30340;&#22823;&#37327;&#36807;&#22833;&#32780;&#24863;&#21040;&#24778;&#35766;&#12290;&#24403;&#28982;&#65292;&#38382;&#39064;&#19981;&#26159;&#26032;&#26469;&#32773;&#30340;&#36136;&#37327;&#38477;&#20302;&#20102;&#65307;&#32780;&#22240;&#20026;&#20182;&#20204;&#38754;&#23545;&#30340;&#26159;&#27604;&#20197;&#21069;&#26356;&#22810;&#30340;&#31215;&#32047;&#36127;&#25285;&#12290;</p><p>&#19968;&#20010;&#39033;&#30446;&#31215;&#32047;&#30340;&#20256;&#32479;&#21462;&#20915;&#20110;&#20182;&#20204;&#20132;&#27969;&#21644;&#20445;&#23384;&#20449;&#24687;&#30340;&#26041;&#27861;&#65292;&#20197;&#21450;&#20182;&#20204;&#30340;&#32534;&#30721;&#26631;&#20934;&#21644;&#20854;&#20182;&#25216;&#26415;&#22791;&#24536;&#24405;&#12290;&#25105;&#20204;&#24050;&#32463;&#30475;&#20102;&#20004;&#31181;&#26631;&#20934;&#65292;&#20998;&#21035;&#22312;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="getting-started.html#developer-documentation" title="&#24320;&#21457;&#32773;&#25991;&#26723;">the section called &#8220;&#24320;&#21457;&#32773;&#25991;&#26723;&#8221;</a>&#21644;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="written-rules.html" title="&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;">the section called &#8220;&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;&#8221;</a>&#65292;&#20063;&#37117;&#26377;&#21508;&#33258;&#30340;&#20363;&#23376;&#12290;&#26412;&#23567;&#33410;&#20851;&#27880;&#30340;&#26159;&#22914;&#20309;&#22312;&#39033;&#30446;&#36827;&#21270;&#20013;&#20445;&#25345;&#25351;&#21335;&#30340;&#21450;&#26102;&#24615;&#65292;&#29305;&#21035;&#26159;&#20851;&#20110;&#22914;&#20309;&#31649;&#29702;&#20132;&#27969;&#30340;&#25351;&#21335;&#65292;&#22240;&#20026;&#36825;&#20123;&#25351;&#21335;&#20250;&#38543;&#30528;&#39033;&#30446;&#35268;&#27169;&#21644;&#22797;&#26434;&#24615;&#30340;&#25104;&#38271;&#21457;&#29983;&#26368;&#26174;&#33879;&#30340;&#21464;&#21270;&#12290;</p><p>&#39318;&#20808;&#65292;&#20851;&#27880;&#20154;&#20204;&#38519;&#20837;&#28151;&#28102;&#30340;&#27169;&#24335;&#12290;&#22914;&#26524;&#20320;&#30475;&#21040;&#21516;&#26679;&#30340;&#24773;&#24418;&#23649;&#27425;&#21457;&#29983;&#65292;&#29305;&#21035;&#26159;&#21457;&#29983;&#22312;&#26032;&#21442;&#19982;&#32773;&#36523;&#19978;&#26102;&#65292;&#23601;&#26159;&#38656;&#35201;&#35760;&#24405;&#25351;&#21335;&#30340;&#26426;&#20250;&#20102;&#12290;&#20854;&#27425;&#65292;&#19981;&#35201;&#21388;&#28902;&#21453;&#22797;&#35828;&#21516;&#26679;&#30340;&#35805;&#65292;&#20063;&#19981;&#35201;<span class="emphasis"><em>&#34920;&#29616;&#20986;</em></span>&#23545;&#35828;&#36825;&#20123;&#35805;&#30340;&#21388;&#28902;&#12290;&#20320;&#21644;&#20854;&#20182;&#39033;&#30446;&#32769;&#20853;&#37117;&#38656;&#35201;&#32463;&#24120;&#30340;&#37325;&#22797;&#33258;&#24049;&#65307;&#36825;&#26159;&#26032;&#25163;&#21040;&#26469;&#26102;&#19981;&#21487;&#36991;&#20813;&#30340;&#21103;&#20316;&#29992;&#12290;</p><p>&#27599;&#20010;&#32593;&#39029;&#12289;&#27599;&#20010;&#37038;&#20214;&#21015;&#34920;&#20449;&#24687;&#21644;&#27599;&#20010;IRC&#39057;&#36947;&#24517;&#39035;&#32771;&#34385;&#24191;&#21578;&#31354;&#38388;&#8212;&#19981;&#26159;&#21830;&#19994;&#24191;&#21578;&#65292;&#32780;&#26159;&#33258;&#24049;&#39033;&#30446;&#36164;&#28304;&#30340;&#24191;&#21578;&#12290;&#20320;&#25152;&#25918;&#32622;&#30340;&#20869;&#23481;&#21462;&#20915;&#20110;&#20250;&#35266;&#30475;&#23427;&#30340;&#20154;&#21475;&#32479;&#35745;&#25968;&#25454;&#12290;&#19968;&#20010;&#38024;&#23545;&#29992;&#25143;&#38382;&#39064;&#30340;IRC&#39057;&#36947;&#65292;&#20854;&#20013;&#36890;&#24120;&#26159;&#37027;&#20123;&#20174;&#26410;&#19982;&#39033;&#30446;&#20132;&#20114;&#30340;&#20154;&#8212;&#36890;&#24120;&#26159;&#21482;&#23433;&#35013;&#20102;&#36719;&#20214;&#65292;&#38656;&#35201;&#31435;&#21051;&#33719;&#24471;&#38382;&#39064;&#31572;&#26696;&#30340;&#20154;&#65288;&#27605;&#31455;&#65292;&#22914;&#26524;&#20182;&#20204;&#21487;&#20197;&#31561;&#24453;&#65292;&#20182;&#20204;&#21487;&#20197;&#21457;&#36865;&#21040;&#37038;&#20214;&#21015;&#34920;&#65292;&#25972;&#20307;&#19978;&#20182;&#23558;&#20250;&#33457;&#36153;&#36739;&#23569;&#30340;&#26102;&#38388;&#65292;&#23613;&#31649;&#37027;&#26679;&#20250;&#38656;&#35201;&#26356;&#38271;&#30340;&#26102;&#38388;&#24471;&#21040;&#22238;&#31572;&#65289;&#12290;&#20154;&#20204;&#36890;&#24120;&#19981;&#20250;&#22312;IRC&#39057;&#36947;&#20316;&#20986;&#27704;&#20037;&#25237;&#36164;&#65292;&#20182;&#20204;&#20250;&#38706;&#38754;&#65292;&#35810;&#38382;&#38382;&#39064;&#65292;&#28982;&#21518;&#31163;&#24320;&#12290;</p><p>&#22240;&#32780;&#65292;&#39057;&#36947;&#30340;&#20027;&#39064;&#24517;&#39035;&#38024;&#23545;&#37027;&#20123;&#24076;&#26395;<span class="emphasis"><em>&#31435;&#21051;</em></span>&#23547;&#25214;&#36719;&#20214;&#25216;&#26415;&#22238;&#31572;&#30340;&#20154;&#65292;&#32780;&#23545;&#37027;&#20123;&#20197;&#38271;&#26399;&#26041;&#24335;&#21442;&#19982;&#39033;&#30446;&#30340;&#20154;&#65292;&#31038;&#21306;&#20132;&#27969;&#25351;&#21335;&#25110;&#35768;&#26356;&#21512;&#36866;&#12290;&#19979;&#38754;&#26159;&#30495;&#27491;&#24537;&#30860;&#39057;&#36947;&#30340;&#22788;&#29702;&#26041;&#24335;&#65288;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="irc.html" title="IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;">the section called &#8220;IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;&#8221;</a>&#65289;&#65306;</p><pre class="screen">
&#20320;&#29616;&#22312;&#20301;&#20110;#linuxhelp

&#20851;&#20110;#linuxhelp&#30340;&#20027;&#39064;&#35831;&#38405;&#35835;
http://www.catb.org/~esr/faqs/smart-questions.html &amp;&amp;
http://www.tldp.org/docs.html#howto &#35810;&#38382;&#38382;&#39064;&#20043;&#21069; | &#39057;&#36947;&#35268;&#21017;
&#22312;http://www.nerdfest.org/lh_rules.html | &#21319;&#32423;&#21040;&#20869;&#26680;2.6.x
&#35831;&#30475; http://kerneltrap.org/node/view/799 
 | &#20869;&#23384;&#35835;&#21487;&#33021;&#24615;: http://tinyurl.com/4s6mc -&gt;
&#26356;&#26032;&#21040;2.6.8.1&#25110;2.4.27 | &#21704;&#24076;&#31639;&#27861;&#28798;&#38590;: http://tinyurl.com/6w8rf
| reiser4&#25918;&#20986;
</pre><p>&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#65292;&#8220;&#24191;&#21578;&#31354;&#38388;&#8221;&#26159;&#36861;&#21152;&#22312;&#27599;&#23553;&#37038;&#20214;&#21518;&#30340;&#23567;&#27880;&#33050;&#12290;&#22823;&#22810;&#25968;&#39033;&#30446;&#20250;&#22312;&#36825;&#37324;&#25918;&#32622;&#35746;&#38405;/&#21462;&#28040;&#35746;&#38405;&#30340;&#25351;&#23548;&#65292;&#20063;&#21487;&#33021;&#26159;&#39033;&#30446;&#20027;&#39029;&#25110;FAQ&#30340;&#38142;&#25509;&#12290;&#20320;&#25110;&#35768;&#20250;&#35748;&#20026;&#25152;&#26377;&#35746;&#38405;&#21015;&#34920;&#30340;&#20154;&#37117;&#20250;&#30693;&#36947;&#22914;&#20309;&#20570;&#65292;&#24456;&#21487;&#33021;&#26159;&#8212;&#20294;&#26159;&#20250;&#26377;&#26356;&#22810;&#19981;&#26159;&#35746;&#38405;&#32773;&#30340;&#20154;&#20250;&#30475;&#21040;&#37038;&#20214;&#21015;&#34920;&#20449;&#24687;&#12290;&#19968;&#20010;&#24402;&#26723;&#30340;&#25991;&#31456;&#20250;&#34987;&#38142;&#25509;&#21040;&#35768;&#22810;&#22320;&#26041;&#65307;&#23454;&#38469;&#19978;&#65292;&#26576;&#20123;&#25991;&#31456;&#26368;&#32456;&#20250;&#21464;&#24471;&#23478;&#21947;&#25143;&#26195;&#65292;&#26377;&#36828;&#22810;&#20110;&#21015;&#34920;&#35746;&#38405;&#32773;&#30340;&#38405;&#35835;&#32773;&#12290;</p><p>&#26684;&#24335;&#21270;&#21487;&#20197;&#20135;&#29983;&#26126;&#26174;&#30340;&#21306;&#21035;&#12290;&#20363;&#22914;&#65292;&#22312;Subversion&#39033;&#30446;&#65292;&#25105;&#20204;&#22312;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="bug-tracker.html#bug-filtering" title="Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;">the section called &#8220;Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;&#8221;</a>&#20013;&#25551;&#36848;&#30340;&#20351;&#29992;bug&#36807;&#28388;&#25216;&#26415;&#65292;&#21462;&#24471;&#20102;&#26377;&#38480;&#30340;&#25104;&#21151;&#12290;&#32463;&#39564;&#19981;&#36275;&#30340;&#20154;&#20250;&#19968;&#30452;&#21457;&#36215;&#35768;&#22810;&#34394;&#20551;&#30340;bug&#25253;&#21578;&#65292;&#27599;&#24403;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#65292;&#26723;&#26696;&#31649;&#29702;&#21592;&#24517;&#39035;&#20687;&#20182;&#20043;&#21069;&#30340;500&#20154;&#37027;&#26679;&#23545;&#27492;&#26377;&#36275;&#22815;&#30340;&#35748;&#35782;&#12290;&#26576;&#22825;&#65292;&#25105;&#20204;&#30340;&#26576;&#20010;&#24320;&#21457;&#32773;&#32456;&#20110;&#24525;&#26080;&#21487;&#24525;&#65292;&#23545;&#37027;&#20123;&#19981;&#38405;&#35835;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#25351;&#21335;&#30340;&#20498;&#38665;&#29992;&#25143;&#24320;&#22987;&#21457;&#28779;&#65292;&#21478;&#19968;&#20010;&#24320;&#21457;&#32773;&#21017;&#20915;&#23450;&#36825;&#31181;&#24773;&#20917;&#19981;&#24212;&#35813;&#20877;&#21457;&#29983;&#20102;&#12290;&#20182;&#24314;&#35758;&#37325;&#26032;&#35843;&#25972;&#38382;&#39064;&#36319;&#36394;&#39318;&#39029;&#30340;&#24067;&#23616;&#65292;&#36825;&#26679;&#26368;&#35201;&#30340;&#37096;&#20998;&#65292;&#20063;&#23601;&#26159;&#22312;&#25552;&#20132;&#20043;&#21069;&#24517;&#39035;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#35752;&#35770;bug&#30340;&#21629;&#20196;&#65292;&#23558;&#20250;&#20351;&#29992;&#36739;&#22823;&#21644;&#31895;&#20307;&#32418;&#33394;&#23383;&#20307;&#65292;&#20142;&#40644;&#33394;&#32972;&#26223;&#65292;&#39029;&#38754;&#23621;&#20013;&#31361;&#20986;&#26174;&#31034;&#22788;&#29702;&#12290;&#25105;&#20204;&#36825;&#26679;&#20570;&#20102;&#65288;&#20320;&#21487;&#20197;&#22312;<a class="ulink" href="http://subversion.tigris.org/project_issues.html" target="_top">http://subversion.tigris.org/project_issues.html</a>&#30475;&#21040;&#32467;&#26524;&#65289;&#65292;&#32467;&#26524;&#26159;&#34394;&#20551;&#38382;&#39064;&#30340;&#24405;&#20837;&#29575;&#22823;&#22823;&#38477;&#20302;&#12290;&#25105;&#20204;&#20381;&#28982;&#20250;&#24471;&#21040;&#34394;&#20551;&#30340;&#38382;&#39064;&#65292;&#24403;&#28982;&#8212;&#25105;&#20204;&#19968;&#30452;&#20250;&#8212;&#20294;&#26159;&#27604;&#20363;&#26174;&#33879;&#38477;&#20302;&#65292;&#29978;&#33267;&#26159;&#22312;&#29992;&#25143;&#25968;&#22823;&#22686;&#30340;&#24773;&#20917;&#19979;&#12290;&#32467;&#26524;&#19981;&#20165;&#26159;bug&#25968;&#25454;&#24211;&#20013;&#30340;&#22403;&#22334;&#22823;&#22823;&#20943;&#23569;&#65292;&#32780;&#19988;&#37027;&#20123;&#21709;&#24212;&#38382;&#39064;&#30340;&#20154;&#20063;&#24471;&#21040;&#20102;&#22909;&#24773;&#32490;&#65292;&#20063;&#23601;&#26356;&#23481;&#26131;&#22312;&#38754;&#23545;&#32597;&#35265;&#30340;&#34394;&#20551;bug&#26102;&#20445;&#25345;&#21451;&#22909;&#12290;&#36825;&#26679;&#19981;&#20165;&#25913;&#21892;&#20102;&#39033;&#30446;&#30340;&#24418;&#35937;&#65292;&#20063;&#25913;&#21892;&#20102;&#24535;&#24895;&#32773;&#30340;&#24515;&#29702;&#20581;&#24247;&#12290;</p><p>&#20165;&#20165;&#26159;&#20889;&#20986;&#25351;&#23548;&#26041;&#38024;&#30340;&#35838;&#31243;&#23545;&#20110;&#25105;&#20204;&#26469;&#35828;&#36824;&#36828;&#36828;&#19981;&#22815;&#12290;&#25105;&#20204;&#20063;&#24517;&#39035;&#35753;&#26368;&#38656;&#35201;&#30340;&#20154;&#30475;&#21040;&#36825;&#20123;&#19996;&#35199;&#65292;&#23427;&#20204;&#30340;&#29366;&#24577;&#35201;&#20687;&#20171;&#32461;&#26448;&#26009;&#19968;&#26679;&#26684;&#24335;&#21270;&#22788;&#29702;&#65292;&#36825;&#26679;&#23545;&#39033;&#30446;&#19981;&#29087;&#24713;&#30340;&#20154;&#20204;&#20063;&#21487;&#20197;&#31435;&#21051;&#28165;&#26224;&#26126;&#20102;&#12290;</p><p>&#38745;&#24577;&#32593;&#39029;&#19981;&#26159;&#21457;&#24067;&#39033;&#30446;&#20064;&#24815;&#21807;&#19968;&#30340;&#32500;&#32435;&#26031;&#12290;&#19968;&#23450;&#25968;&#37327;&#30340;&#30340;&#20132;&#20114;&#25919;&#31574;&#65288;&#21451;&#24773;&#25552;&#31034;&#30340;&#24863;&#35273;&#65292;&#32780;&#19981;&#26159;&#20919;&#20912;&#20912;&#30340;&#25163;&#38096;&#33050;&#38243;&#65289;&#20063;&#26159;&#24517;&#38656;&#30340;&#12290;&#25152;&#26377;&#30340;&#21516;&#32423;&#35780;&#23457;&#65292;&#29978;&#33267;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="setting-tone.html#code-review" title="&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;">the section called &#8220;&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;&#8221;</a>&#25551;&#36848;&#30340;&#25552;&#20132;&#35780;&#23457;&#65292;&#37117;&#24212;&#35813;&#21253;&#25324;&#23545;&#20110;&#20154;&#20204;&#26159;&#21542;&#36981;&#23432;&#39033;&#30446;&#35268;&#33539;&#30340;&#26816;&#26597;&#65292;&#29305;&#21035;&#26159;&#19982;&#20132;&#27969;&#20064;&#24815;&#30456;&#20851;&#30340;&#12290;</p><p>Subversion&#39033;&#30446;&#30340;&#21478;&#19968;&#20010;&#20363;&#23376;&#65306;&#25105;&#20204;&#22312;&#29256;&#26412;&#25511;&#21046;&#29256;&#26412;&#24211;&#35774;&#23450;&#20102;&#8220;r12908&#8221;&#34920;&#31034;&#8220;&#20462;&#35746;&#29256;&#26412;12908&#8221;&#30340;&#20064;&#24815;&#12290;&#23567;&#20889;&#30340;&#8220;r&#8221;&#21069;&#32512;&#24456;&#23481;&#26131;&#36755;&#20837;&#65292;&#21448;&#22240;&#20026;&#23427;&#21482;&#26377;&#25968;&#23383;&#30340;&#19968;&#21322;&#39640;&#24230;&#65292;&#25152;&#20197;&#19982;&#25968;&#23383;&#22312;&#19968;&#36215;&#26102;&#38750;&#24120;&#26131;&#20110;&#35782;&#21035;&#12290;&#24403;&#28982;&#65292;&#35774;&#23450;&#20102;&#20064;&#24815;&#24182;&#19981;&#24847;&#21619;&#30528;&#27599;&#20010;&#20154;&#37117;&#20250;&#19968;&#30452;&#20197;&#27491;&#30830;&#30340;&#26041;&#24335;&#20351;&#29992;&#23427;&#12290;&#22240;&#32780;&#65292;&#27599;&#24403;&#26377;&#36825;&#26679;&#21253;&#21547;&#26085;&#24535;&#20449;&#24687;&#30340;&#25552;&#20132;&#37038;&#20214;&#26102;&#65306;</p><pre class="screen">
------------------------------------------------------------------------
r12908 | qsimon | 2005-02-02 14:15:06 -0600 (Wed, 02 Feb 2005) | 4 lines

Patch from J. Random Contributor &lt;jrcontrib@gmail.com&gt;

* trunk/contrib/client-side/psvn/psvn.el:
  Fixed some typos from revision 12828.
------------------------------------------------------------------------
</pre><p>...&#26576;&#20123;&#25552;&#20132;&#35780;&#23457;&#32773;&#23601;&#20250;&#35828;&#8220;&#39034;&#20415;&#35828;&#19968;&#21477;&#65292;&#35831;&#20351;&#29992;&#8216;r12828&#8217;&#65292;&#32780;&#19981;&#26159;&#20462;&#35746;&#29256;&#26412;&#65288;revision&#65289;12828&#24341;&#29992;&#36807;&#21435;&#30340;&#21464;&#26356;&#12290;&#36825;&#19981;&#26159;&#21334;&#24324;&#23398;&#38382;&#65307;&#37325;&#35201;&#30340;&#26159;&#33258;&#21160;&#35299;&#26512;&#21644;&#20154;&#31867;&#38405;&#35835;&#12290;</p><p>&#36890;&#36807;&#36981;&#24490;&#19968;&#33324;&#30340;&#21407;&#29702;&#65292;&#21253;&#25324;&#23545;&#24120;&#35265;&#23454;&#20307;&#30340;&#26435;&#23041;&#21442;&#32771;&#26041;&#27861;&#65292;&#20197;&#21450;&#24517;&#39035;&#25918;&#20043;&#22235;&#28023;&#30342;&#20934;&#21442;&#32771;&#26041;&#27861;&#65292;&#36825;&#20010;&#39033;&#30446;&#36755;&#20986;&#29305;&#23450;&#30340;&#26631;&#20934;&#12290;&#36825;&#20123;&#26631;&#20934;&#20351;&#24471;&#20154;&#20204;&#21487;&#20197;&#32534;&#20889;&#24037;&#20855;&#29992;&#26356;&#26377;&#20215;&#20540;&#30340;&#26041;&#24335;&#23637;&#29616;&#39033;&#30446;&#20132;&#27969;&#8212;&#20363;&#22914;&#65292;&#19968;&#20010;&#26684;&#24335;&#20026;&#8220;r12828&#8221;&#30340;&#20462;&#35746;&#29256;&#26412;&#21487;&#20197;&#22312;&#29256;&#26412;&#24211;&#27983;&#35272;&#24037;&#20855;&#20013;&#34987;&#36716;&#21270;&#20026;&#21487;&#29992;&#30340;&#38142;&#25509;&#12290;&#20294;&#26159;&#22914;&#26524;&#20462;&#35746;&#29256;&#26412;&#20889;&#25104;&#8220;revision 12828&#8221;&#65292;&#21017;&#36825;&#39033;&#24037;&#20316;&#23558;&#20250;&#38590;&#35768;&#22810;&#65292;&#19968;&#26041;&#38754;&#22240;&#20026;&#38142;&#25509;&#20250;&#22312;&#25442;&#34892;&#22788;&#20998;&#38548;&#65292;&#21478;&#19968;&#26041;&#38754;&#20063;&#22240;&#20026;&#38480;&#21046;&#19981;&#36275;&#65288;&#21333;&#35789;&#8220;revision&#8221;&#20250;&#32463;&#24120;&#21333;&#29420;&#20986;&#29616;&#65292;&#19968;&#32452;&#25968;&#23383;&#20063;&#20250;&#21333;&#29420;&#20986;&#29616;&#65292;&#32780;&#20182;&#20204;&#30340;&#32452;&#21512;&#8220;r12828&#8221;&#21017;&#21482;&#24847;&#21619;&#30528;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65289;&#12290;&#31867;&#20284;&#30340;&#65292;&#21516;&#26679;&#30340;&#20851;&#27880;&#38754;&#20063;&#36866;&#24212;&#20110;&#38382;&#39064;&#21495;&#30721;&#65292;FAQ&#39033;&#30446;&#65288;&#25552;&#31034;&#65306;&#22312;<a class="xref" href="growth.html#html-named-anchors-and-ids" title="&#21629;&#21517;&#30340;Anchor&#21644;ID&#23646;&#24615;">&#21629;&#21517;&#30340;Anchor&#21644;ID&#23646;&#24615;</a>&#25551;&#36848;&#30340;&#65292;&#20351;&#29992;&#21629;&#21517;&#38170;&#28857;&#30340;URL&#65289;&#31561;&#31561;&#12290;</p><p>&#21363;&#20351;&#23545;&#20110;&#27809;&#26377;&#31616;&#30701;&#21644;&#26435;&#23041;&#24418;&#24335;&#30340;&#23454;&#20307;&#65292;&#20063;&#35201;&#40723;&#21169;&#20154;&#20204;&#25552;&#20379;&#19968;&#33268;&#30340;&#20851;&#38190;&#32454;&#33410;&#20449;&#24687;&#12290;&#20363;&#22914;&#65292;&#24403;&#24341;&#29992;&#21040;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#20449;&#24687;&#26102;&#65292;&#19981;&#35201;&#21482;&#32473;&#20986;&#21457;&#36865;&#32773;&#21644;&#20027;&#39064;&#65307;&#35831;&#20063;&#32473;&#20986;&#24402;&#26723;URL<span class="emphasis"><em>&#21644;</em></span>&#20449;&#24687;&#30340;ID&#22836;&#12290;&#36825;&#26679;&#21487;&#20197;&#35753;&#37027;&#20123;&#34429;&#28982;&#33258;&#24049;&#20063;&#26377;&#37038;&#20214;&#21015;&#34920;&#25335;&#36125;&#65288;&#20154;&#20204;&#26377;&#26102;&#20250;&#20445;&#23384;&#31163;&#32447;&#22791;&#20221;&#65292;&#20363;&#22914;&#22312;&#26053;&#34892;&#20013;&#20351;&#29992;&#31508;&#35760;&#26412;&#26102;&#65289;&#30340;&#20154;&#65292;&#33021;&#22815;&#26126;&#30830;&#26080;&#35823;&#30340;&#23450;&#20301;&#21040;&#27491;&#30830;&#30340;&#20449;&#24687;&#65292;&#29978;&#33267;&#26080;&#39035;&#35775;&#38382;&#20182;&#20204;&#33258;&#24049;&#30340;&#24402;&#26723;&#12290;&#21457;&#36865;&#32773;&#21644;&#20027;&#39064;&#24182;&#19981;&#36275;&#22815;&#65292;&#22240;&#20026;&#19968;&#22825;&#37324;&#21516;&#19968;&#20010;&#20154;&#21487;&#33021;&#20026;&#26576;&#19968;&#20010;&#32447;&#32034;&#21457;&#34920;&#36807;&#35768;&#22810;&#25991;&#31456;&#12290;</p><p>&#39033;&#30446;&#24840;&#22823;&#65292;&#24840;&#26159;&#38656;&#35201;&#36825;&#31867;&#19968;&#33268;&#24615;&#12290;&#19968;&#33268;&#24615;&#24847;&#21619;&#30528;&#20154;&#20204;&#20250;&#22312;&#25152;&#26377;&#30340;&#22320;&#26041;&#65292;&#30475;&#21040;&#34987;&#20197;&#30456;&#21516;&#30340;&#26041;&#24335;&#36981;&#24490;&#30340;&#27169;&#24335;&#65292;&#36825;&#26679;&#20182;&#20204;&#30693;&#36947;&#33258;&#24049;&#20063;&#38656;&#35201;&#36981;&#24490;&#36825;&#20123;&#27169;&#24335;&#12290;&#20316;&#20026;&#22238;&#25253;&#65292;&#20943;&#23569;&#20102;&#22238;&#31572;&#38382;&#39064;&#30340;&#24517;&#35201;&#12290;&#25317;&#26377;&#20960;&#30334;&#19975;&#35835;&#32773;&#30340;&#36127;&#25285;&#24182;&#19981;&#27604;&#20165;&#20165;&#19968;&#20010;&#26356;&#22823;&#65307;&#25193;&#23637;&#24615;&#30340;&#38382;&#39064;&#28304;&#20110;&#19968;&#23450;&#27604;&#20363;&#30340;&#35835;&#32773;&#24320;&#22987;&#25552;&#38382;&#20102;&#12290;&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#65292;&#24517;&#39035;&#20381;&#38752;&#22686;&#21152;&#20449;&#24687;&#30340;&#23494;&#24230;&#21644;&#21487;&#35775;&#38382;&#24615;&#65292;&#25165;&#33021;&#20943;&#23569;&#36825;&#31181;&#27604;&#20363;&#65292;&#36825;&#26679;&#20154;&#20204;&#25165;&#33021;&#26356;&#23481;&#26131;&#30340;&#25214;&#21040;&#31572;&#26696;&#65292;&#32780;&#26080;&#38656;&#25552;&#38382;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="difficult-people.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="bug-tracker-usage.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#21050;&#20799;&#22836; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;</td></tr></table></div></body></html>
