<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 1. &#20171;&#32461;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="disclaimer.html" title="&#20813;&#36131;&#22768;&#26126;"><link rel="next" href="today.html" title="&#29616;&#29366;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 1. &#20171;&#32461;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="disclaimer.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="today.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 1. &#20171;&#32461;"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>Chapter 1. &#20171;&#32461;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="introduction.html#history">&#21382;&#21490;</a></span></dt><dd><dl><dt><span class="sect2"><a href="introduction.html#propertization">&#31169;&#26377;&#36719;&#20214;&#21644;&#33258;&#30001;&#36719;&#20214;&#30340;&#20852;&#36215;</a></span></dt><dd><dl><dt><span class="sect3"><a href="introduction.html#history-conscious-resistance">&#26377;&#24847;&#35782;&#30340;&#21453;&#25239;</a></span></dt><dt><span class="sect3"><a href="introduction.html#history-accidental-resistance">&#24847;&#22806;&#30340;&#21453;&#25239;</a></span></dt></dl></dd><dt><span class="sect2"><a href="introduction.html#free-vs-open-source">&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;</a></span></dt></dl></dd><dt><span class="sect1"><a href="today.html">&#29616;&#29366;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#22823;&#37096;&#20998;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#26159;&#22833;&#36133;&#30340;&#12290;</p><p>&#20154;&#20204;&#24635;&#19981;&#22826;&#21916;&#27426;&#21548;&#22826;&#22810;&#22833;&#36133;&#30340;&#25925;&#20107;&#65292;&#21482;&#26377;&#25104;&#21151;&#30340;&#39033;&#30446;&#25165;&#33021;&#21560;&#24341;&#25105;&#20204;&#30340;&#27880;&#24847;&#21147;&#12290;&#26519;&#26519;&#24635;&#24635;&#30340;&#33258;&#30001;&#36719;&#20214;&#30340;&#24635;&#25968;&#26159;&#24778;&#20154;&#30340;<sup>[<a name="idp121" href="#ftn.idp121" class="footnote">2</a>]</sup>&#65292;&#23613;&#31649;&#21482;&#26377;&#19968;&#23567;&#37096;&#20998;&#30340;&#39033;&#30446;&#25104;&#21151;&#20102;&#65292;&#20294;&#36825;&#20173;&#28982;&#21482;&#26159;&#37027;&#20123;&#24191;&#20026;&#20154;&#30693;&#30340;&#39033;&#30446;&#30340;&#19968;&#37096;&#20998;&#12290;&#26377;&#22826;&#22810;&#30340;&#39033;&#30446;&#30001;&#20110;&#19981;&#20026;&#20154;&#30693;&#65292;&#21363;&#20351;&#22833;&#36133;&#20102;&#25105;&#20204;&#20063;&#19981;&#20250;&#21548;&#21040;&#12290;&#25105;&#20204;&#26080;&#27861;&#29992;&#19968;&#20010;&#30830;&#23450;&#30340;&#26102;&#38388;&#28857;&#26469;&#23459;&#21028;&#19968;&#20010;&#39033;&#30446;&#30340;&#27515;&#21009;&#65292;&#20154;&#20204;&#21482;&#26159;&#20572;&#27490;&#24037;&#20316;&#26080;&#25152;&#20107;&#20107;&#12290;&#21363;&#20351;&#25105;&#20204;&#30693;&#36947;&#19968;&#20010;&#39033;&#30446;&#30340;&#26368;&#21518;&#19968;&#20010;&#21464;&#21160;&#26159;&#20309;&#26102;&#28155;&#21152;&#30340;&#65292;&#20294;&#26159;&#22312;&#24403;&#26102;&#37027;&#20123;&#20570;&#36825;&#20123;&#24037;&#20316;&#30340;&#20154;&#36890;&#24120;&#24182;&#19981;&#30693;&#36947;&#36825;&#20250;&#26159;&#26368;&#21518;&#30340;&#26202;&#39184;&#12290;&#25105;&#20204;&#29978;&#33267;&#26080;&#27861;&#26126;&#30830;&#22320;&#23450;&#20041;&#20309;&#26102;&#19968;&#20010;&#39033;&#30446;&#25165;&#31639;&#26159;&#26029;&#27668;&#20102;&#12290;&#26159;&#20572;&#27490;&#27963;&#21160;6&#20010;&#26376;&#20043;&#21518;&#65311;&#26159;&#29992;&#25143;&#25968;&#37327;&#20572;&#27490;&#22686;&#38271;&#24182;&#19988;&#20154;&#25968;&#36824;&#23569;&#20110;&#24320;&#21457;&#32773;&#30340;&#25968;&#37327;&#26102;&#65311;&#24403;&#19968;&#20010;&#39033;&#30446;&#30340;&#24320;&#21457;&#32773;&#21457;&#29616;&#20182;&#20204;&#21482;&#26159;&#22312;&#37325;&#22797;&#21035;&#20154;&#30340;&#24037;&#20316;&#65292;&#32780;&#20915;&#23450;&#25918;&#24323;&#39033;&#30446;&#65292;&#28982;&#21518;&#20182;&#20204;&#20915;&#23450;&#21152;&#20837;&#21478;&#19968;&#20010;&#39033;&#30446;&#65292;&#24182;&#19988;&#22312;&#39033;&#30446;&#20013;&#20351;&#29992;&#20043;&#21069;&#30340;&#19968;&#20123;&#24037;&#20316;&#25104;&#26524;&#65311;&#21407;&#20808;&#30340;&#39033;&#30446;&#27515;&#20129;&#20102;&#65292;&#25110;&#32773;&#21482;&#26159;&#25644;&#20102;&#19968;&#27425;&#23478;&#65311;</p><p>&#22240;&#20026;&#26159;&#22914;&#27492;&#22797;&#26434;&#65292;&#24471;&#20986;&#19968;&#20010;&#31934;&#30830;&#30340;&#22833;&#36133;&#29575;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;&#20294;&#26159;&#21313;&#22810;&#24180;&#20197;&#26469;&#27969;&#20256;&#20110;SourceForge.net&#25110;&#26159;&#29992;Google&#25628;&#32034;&#24471;&#21040;&#30340;&#24320;&#28304;&#36816;&#21160;&#20256;&#38395;&#65292;&#37117;&#25351;&#21521;&#21516;&#19968;&#20010;&#32467;&#35770;&#65306;&#36825;&#20010;&#27604;&#29575;&#26159;&#38750;&#24120;&#39640;&#30340;&#65292;&#20063;&#35768;&#33021;&#36798;&#21040;90&#8211;95%&#12290;&#22914;&#26524;&#25226;&#37027;&#20123;&#34429;&#28982;&#23384;&#27963;&#20294;&#26159;&#20869;&#24551;&#22806;&#24739;&#30340;&#39033;&#30446;&#31639;&#22312;&#20869;&#65292;&#36825;&#20010;&#27604;&#29575;&#36824;&#23558;&#26356;&#39640;&#65292;&#36825;&#20123;&#39033;&#30446;&#36890;&#24120;&#20173;&#28982;<span class="emphasis"><em>&#22312;</em></span>&#29983;&#20135;&#21487;&#25191;&#34892;&#30340;&#20195;&#30721;&#65292;&#20294;&#24050;&#19981;&#20877;&#26159;&#24320;&#21457;&#32773;&#30340;&#20048;&#22253;&#20102;&#65292;&#35201;&#20040;&#26159;&#26080;&#27861;&#23613;&#20854;&#25152;&#33021;&#30340;&#24555;&#36895;&#21644;&#20114;&#30456;&#20381;&#36182;&#30340;&#20316;&#20986;&#36827;&#23637;&#20102;&#12290;</p><p>&#36825;&#26412;&#20070;&#30340;&#30446;&#30340;&#26088;&#22312;&#35828;&#26126;&#22914;&#20309;&#36991;&#20813;&#22833;&#36133;&#12290;&#23427;&#19981;&#20165;&#28436;&#31034;&#20102;&#22914;&#20309;&#25165;&#26159;&#27491;&#30830;&#30340;&#20570;&#20107;&#26041;&#27861;&#65292;&#32780;&#19988;&#21578;&#35785;&#20320;&#38169;&#35823;&#20986;&#22312;&#20309;&#22788;&#65292;&#20197;&#20415;&#20320;&#21450;&#26102;&#21457;&#29616;&#21644;&#32416;&#27491;&#38169;&#35823;&#12290;&#25105;&#24076;&#26395;&#22312;&#35835;&#36807;&#27492;&#20070;&#20043;&#21518;&#65292;&#20320;&#19981;&#20165;&#33021;&#23545;&#22914;&#20309;&#36991;&#20813;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#24120;&#35265;&#38519;&#38449;&#26377;&#20016;&#23500;&#30340;&#25216;&#26415;&#20648;&#22791;&#65292;&#32780;&#19988;&#23545;&#22914;&#20309;&#20351;&#19968;&#20010;&#25104;&#21151;&#30340;&#39033;&#30446;&#24471;&#21040;&#25104;&#38271;&#21644;&#32500;&#25252;&#26377;&#28145;&#20837;&#30340;&#20102;&#35299;&#12290;&#25104;&#21151;&#19981;&#26159;&#19968;&#22330;&#38646;&#21644;&#28216;&#25103;&#65292;&#27492;&#20070;&#20063;&#19981;&#26159;&#25945;&#20320;&#22914;&#20309;&#22312;&#31454;&#20105;&#20013;&#33719;&#32988;&#25110;&#26159;&#39046;&#20808;&#30340;&#12290;&#30456;&#21453;&#65292;&#36816;&#20316;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#30340;&#37325;&#35201;&#37096;&#20998;&#23601;&#26159;&#27969;&#30021;&#22320;&#21516;&#20851;&#32852;&#39033;&#30446;&#21512;&#20316;&#12290;&#22312;&#26356;&#39640;&#30340;&#23618;&#27425;&#19978;&#65292;&#27599;&#19968;&#20010;&#25104;&#21151;&#30340;&#39033;&#30446;&#37117;&#20026;&#22312;&#19990;&#30028;&#33539;&#22260;&#20869;&#33258;&#30001;&#36719;&#20214;&#30340;&#25104;&#38271;&#20316;&#20986;&#19968;&#20221;&#36129;&#29486;&#12290;</p><p>&#22914;&#26524;&#35828;&#23548;&#33268;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#22833;&#36133;&#30340;&#21407;&#22240;&#31867;&#22411;&#19982;&#31169;&#26377;&#36719;&#20214;&#26159;&#30456;&#21516;&#30340;&#65292;&#37027;&#26159;&#20196;&#20154;&#35825;&#24785;&#30340;&#12290;&#23454;&#38469;&#19978;&#65292;&#22312;&#33258;&#30001;&#36719;&#20214;&#20869;&#19981;&#20250;&#26377;&#35832;&#22914;&#24314;&#31435;&#22312;&#19981;&#20999;&#23454;&#38469;&#30340;&#38656;&#27714;&#19978;&#30340;&#22404;&#26029;&#65292;&#21547;&#28151;&#19981;&#28165;&#30340;&#35268;&#33539;&#65292;&#21487;&#24604;&#30340;&#20195;&#30721;&#31649;&#29702;&#65292;&#35774;&#35745;&#38454;&#27573;&#19981;&#36275;&#31561;&#31561;&#31548;&#32617;&#22312;&#20256;&#32479;&#36719;&#20214;&#24037;&#19994;&#19978;&#30340;&#24189;&#28789;&#12290;&#26377;&#20851;&#36825;&#20123;&#20027;&#39064;&#30340;&#20070;&#24050;&#32463;&#26159;&#27735;&#29275;&#20805;&#26635;&#65292;&#25105;&#19981;&#25171;&#31639;&#37325;&#22797;&#12290;&#25105;&#24819;&#20570;&#30340;&#26159;&#25551;&#36848;&#33258;&#30001;&#36719;&#20214;&#29420;&#26377;&#30340;&#38382;&#39064;&#12290;&#24403;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#24320;&#22987;&#36816;&#36716;&#65292;&#26368;&#24120;&#35265;&#30340;&#38382;&#39064;&#26159;&#24320;&#21457;&#32773;&#65288;&#25110;&#26159;&#32463;&#29702;&#65289;&#38590;&#20197;&#35782;&#21035;&#24320;&#28304;&#36719;&#20214;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#29420;&#29305;&#38382;&#39064;&#65292;&#23613;&#31649;&#20182;&#20204;&#21487;&#33021;&#24050;&#32463;&#22312;&#37027;&#20123;&#38381;&#28304;&#36719;&#20214;&#30340;&#24120;&#35265;&#38382;&#39064;&#19978;&#25684;&#25171;&#20102;&#22810;&#24180;&#12290;</p><p>&#19968;&#20010;&#26368;&#24120;&#35265;&#30340;&#38169;&#35823;&#23601;&#26159;&#24613;&#20110;&#20174;&#24320;&#28304;&#30340;&#24418;&#24335;&#26412;&#36523;&#33719;&#24471;&#22909;&#22788;&#65292;&#20294;&#36825;&#26159;&#19981;&#20999;&#23454;&#38469;&#30340;&#12290;&#19968;&#32440;&#24320;&#25918;&#35768;&#21487;&#35777;&#19981;&#20250;&#19968;&#19979;&#23376;&#35753;&#25104;&#32676;&#30340;&#27963;&#36291;&#24320;&#21457;&#32773;&#33258;&#24895;&#22320;&#25226;&#20182;&#20204;&#30340;&#26102;&#38388;&#20132;&#32473;&#20320;&#30340;&#39033;&#30446;&#65292;&#23558;&#19968;&#20010;&#21407;&#26412;&#38382;&#39064;&#22810;&#22810;&#30340;&#39033;&#30446;&#24320;&#28304;&#20063;&#19981;&#33021;&#33258;&#21160;&#22320;&#20462;&#27491;&#36825;&#20123;&#38382;&#39064;&#12290;&#23454;&#38469;&#19978;&#24456;&#21487;&#33021;&#30456;&#21453;&#65292;&#19982;&#19981;&#24320;&#28304;&#30456;&#27604;&#65292;&#24320;&#25918;&#19968;&#20010;&#39033;&#30446;&#30701;&#26399;&#20869;&#20250;&#24102;&#26469;&#19968;&#31995;&#21015;&#20840;&#26032;&#30340;&#22797;&#26434;&#38382;&#39064;&#21644;&#20195;&#20215;&#12290;&#24320;&#25918;&#24847;&#21619;&#30528;&#35201;&#35753;&#23436;&#20840;&#38476;&#29983;&#30340;&#20154;&#35835;&#25026;&#20195;&#30721;&#65292;&#24314;&#31435;&#19968;&#20010;&#24320;&#21457;&#32593;&#31449;&#21644;&#37038;&#20214;&#21015;&#34920;&#65292;&#36890;&#24120;&#36824;&#20250;&#31532;&#19968;&#27425;&#38656;&#35201;&#20889;&#25991;&#26723;&#12290;&#36825;&#20123;&#20107;&#24773;&#30340;&#24037;&#20316;&#37327;&#26159;&#30456;&#24403;&#22823;&#30340;&#12290;&#24403;&#28982;&#22914;&#26524;&#26377;&#24320;&#21457;&#32773;<span class="emphasis"><em>&#34920;&#31034;</em></span>&#20986;&#20102;&#20852;&#36259;&#65292;&#22312;&#20182;&#20204;&#20026;&#20320;&#30340;&#39033;&#30446;&#24102;&#26469;&#22909;&#22788;&#20043;&#21069;&#22238;&#31572;&#20182;&#20204;&#30340;&#38382;&#39064;&#20063;&#26159;&#19968;&#20010;&#39069;&#22806;&#30340;&#36127;&#25285;&#12290;&#22914;&#21516;&#24320;&#21457;&#32773;Jamie Zawinski&#22238;&#24518;Mozilla&#39033;&#30446;&#26089;&#26399;&#30340;&#28151;&#20081;&#29366;&#20917;&#25152;&#35828;&#22320;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#24320;&#28304;&#30340;&#30830;&#34892;&#65292;&#20294;&#23427;&#32477;&#19981;&#26159;&#19975;&#33021;&#33647;&#12290;&#25105;&#23545;&#20320;&#30340;&#24544;&#21578;&#26159;&#65306;&#20320;&#19981;&#33021;&#25351;&#26395;&#22312;&#19968;&#20010;&#22402;&#27515;&#39033;&#30446;&#19978;&#27922;&#19968;&#28857;"&#24320;&#28304;&#30340;&#31934;&#28789;&#39764;&#31881;"&#23601;&#33021;&#35753;&#25152;&#26377;&#20107;&#24773;&#22855;&#36857;&#33324;&#22320;&#36816;&#36716;&#36215;&#26469;&#12290;&#20570;&#36719;&#20214;&#26159;&#22256;&#38590;&#30340;&#12290;&#38382;&#39064;&#19981;&#20250;&#37027;&#20040;&#31616;&#21333;&#12290;</em></span></p><p>&#65288;&#26469;&#33258;<span class="bold"><strong><a class="ulink" href="http://www.jwz.org/gruntle/nomo.html" target="_top">http://www.jwz.org/gruntle/nomo.html</a></strong></span>&#65289;</p></blockquote></div><p>&#19968;&#20010;&#30456;&#20851;&#30340;&#38169;&#35823;&#26159;&#23545;&#23637;&#31034;&#21644;&#25171;&#21253;&#30340;&#36731;&#35270;&#65292;&#29305;&#21035;&#26159;&#24403;&#19968;&#20010;&#39033;&#30446;&#39034;&#21033;&#36816;&#36716;&#26102;&#24635;&#35748;&#20026;&#36825;&#20123;&#20197;&#21518;&#20877;&#20570;&#19981;&#36831;&#12290;&#23637;&#31034;&#21644;&#25171;&#21253;&#26377;&#24456;&#22810;&#30340;&#30446;&#30340;&#65292;&#25152;&#26377;&#30340;&#19968;&#20999;&#37117;&#26159;&#20026;&#20102;&#20943;&#20302;&#36827;&#20837;&#30340;&#38376;&#27099;&#12290;&#20351;&#39033;&#30446;&#23545;&#37027;&#20123;&#21518;&#26469;&#32773;&#26377;&#21560;&#24341;&#21147;&#24847;&#21619;&#30528;&#32534;&#20889;&#29992;&#25143;&#21644;&#24320;&#21457;&#32773;&#25991;&#26723;&#65292;&#24314;&#31435;&#20026;&#26032;&#26469;&#32773;&#25552;&#20379;&#20449;&#24687;&#30340;&#32593;&#31449;&#65292;&#23613;&#21487;&#33021;&#33258;&#21160;&#21270;&#36719;&#20214;&#30340;&#32534;&#35793;&#21644;&#23433;&#35013;&#24037;&#20316;&#65292;&#20197;&#21450;&#20854;&#20182;&#12290;&#24456;&#19981;&#24184;&#65292;&#24456;&#22810;&#31243;&#24207;&#21592;&#35748;&#20026;&#19982;&#32534;&#30721;&#30456;&#27604;&#65292;&#36825;&#20123;&#24037;&#20316;&#37117;&#26159;&#27425;&#35201;&#30340;&#12290;&#23548;&#33268;&#36825;&#31181;&#24773;&#20917;&#30340;&#21407;&#22240;&#26377;&#24456;&#22810;&#12290;&#39318;&#20808;&#65292;&#20182;&#20204;&#24863;&#35273;&#36825;&#20123;&#37117;&#26159;&#38468;&#21152;&#20316;&#19994;&#65292;&#22240;&#20026;&#23545;&#29087;&#24713;&#39033;&#30446;&#30340;&#36825;&#37096;&#20998;&#23569;&#25968;&#20154;&#26469;&#35828;&#65292;&#23427;&#30340;&#30410;&#22788;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#65292;&#21453;&#20043;&#20134;&#28982;&#12290;&#27605;&#31455;&#36825;&#20123;&#32534;&#20889;&#20195;&#30721;&#30340;&#20154;&#24182;&#19981;&#30495;&#38656;&#35201;&#25171;&#21253;&#12290;&#20182;&#20204;&#30693;&#36947;&#22914;&#20309;&#23433;&#35013;&#65292;&#31649;&#29702;&#21644;&#20351;&#29992;&#36825;&#20123;&#36719;&#20214;&#65292;&#22240;&#20026;&#20195;&#30721;&#23601;&#26159;&#20182;&#20204;&#32534;&#20889;&#30340;&#12290;&#20854;&#27425;&#65292;&#23637;&#31034;&#21644;&#25171;&#21253;&#25152;&#38656;&#35201;&#30340;&#25216;&#26415;&#36890;&#24120;&#21644;&#20889;&#20195;&#30721;&#23436;&#20840;&#19981;&#21516;&#12290;&#20154;&#20204;&#24635;&#26159;&#20542;&#21521;&#20110;&#19987;&#27880;&#33258;&#24049;&#25152;&#25797;&#38271;&#30340;&#65292;&#21363;&#20351;&#21478;&#22806;&#30340;&#24037;&#20316;&#33021;&#23545;&#25972;&#20010;&#39033;&#30446;&#36215;&#21040;&#20107;&#21322;&#21151;&#20493;&#30340;&#20316;&#29992;&#12290; <a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#23558;&#35814;&#32454;&#35752;&#35770;&#23637;&#31034;&#21644;&#25171;&#21253;&#65292;&#24182;&#19988;&#35299;&#37322;&#20174;&#39033;&#30446;&#30340;&#19968;&#24320;&#22987;&#23601;&#30830;&#23450;&#36825;&#20123;&#24037;&#20316;&#30340;&#20248;&#20808;&#22320;&#20301;&#30340;&#37325;&#35201;&#24615;&#12290;</p><p>&#25509;&#19979;&#26469;&#30340;&#19968;&#20010;&#35884;&#35823;&#26159;&#35748;&#20026;&#24320;&#28304;&#20960;&#20046;&#25110;&#23436;&#20840;&#19981;&#38656;&#35201;&#39033;&#30446;&#31649;&#29702;&#65292;&#25110;&#32773;&#29031;&#25644;&#21830;&#19994;&#24320;&#21457;&#30340;&#37027;&#19968;&#22871;&#31649;&#29702;&#27169;&#24335;&#20063;&#33021;&#22312;&#24320;&#28304;&#20013;&#20570;&#24471;&#24456;&#22909;&#12290;&#22312;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#20013;&#65292;&#31649;&#29702;&#24635;&#26159;&#19981;&#36215;&#30524;&#30340;&#65292;&#20294;&#22312;&#25104;&#21151;&#30340;&#39033;&#30446;&#20013;&#65292;&#23427;&#36890;&#24120;&#22312;&#24149;&#21518;&#36215;&#21040;&#25512;&#21160;&#30340;&#20316;&#29992;&#12290;&#19968;&#20010;&#31616;&#21333;&#30340;&#24515;&#29702;&#35797;&#39564;&#23601;&#36275;&#22815;&#26174;&#31034;&#20854;&#21407;&#22240;&#12290;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#30001;&#26469;&#33258;&#22235;&#38754;&#20843;&#26041;&#30340;&#31243;&#24207;&#21592;&#32452;&#25104;&#8212;&#19968;&#32676;&#33261;&#21517;&#26157;&#33879;&#30340;&#33258;&#30001;&#29420;&#31435;&#24605;&#24819;&#32773;&#8212;&#20182;&#20204;&#20013;&#30340;&#22823;&#37096;&#20998;&#20154;&#20174;&#26469;&#27809;&#26377;&#20114;&#30456;&#35265;&#36807;&#38754;&#65292;&#20026;&#36825;&#20010;&#39033;&#30446;&#24037;&#20316;&#21482;&#26159;&#20986;&#20110;&#20182;&#20204;&#30340;&#20010;&#20154;&#30446;&#26631;&#12290;&#24515;&#29702;&#35797;&#39564;&#33021;&#24456;&#31616;&#21333;&#22320;&#39044;&#27979;&#22914;&#26524;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#31649;&#29702;&#65292;&#22312;&#36825;&#26679;&#19968;&#20010;&#22242;&#20307;&#20013;&#20250;&#21457;&#29983;&#20160;&#20040;&#12290;&#38500;&#38750;&#21457;&#29983;&#22855;&#36857;&#65292;&#21542;&#21017;&#20182;&#20204;&#24456;&#24555;&#23601;&#20250;&#22235;&#20998;&#20116;&#35010;&#12290;&#20107;&#24773;&#19981;&#20250;&#22914;&#25105;&#20204;&#24076;&#26395;&#30340;&#37027;&#26679;&#33258;&#24049;&#36816;&#36716;&#12290;&#31649;&#29702;&#20598;&#23572;&#20250;&#30456;&#24403;&#27963;&#36291;&#65292;&#20294;&#26159;&#22823;&#37096;&#20998;&#26102;&#20505;&#26159;&#38750;&#27491;&#24335;&#30340;&#65292;&#24494;&#22937;&#30340;&#65292;&#20302;&#35843;&#30340;&#12290;&#21482;&#26377;&#19968;&#20214;&#20107;&#24773;&#33021;&#25226;&#24320;&#21457;&#32773;&#22242;&#32467;&#22312;&#19968;&#36215;&#65292;&#23601;&#26159;&#20182;&#20204;&#30456;&#20449;&#22242;&#38431;&#21512;&#20316;&#27604;&#21333;&#24178;&#33021;&#20570;&#24471;&#26356;&#22810;&#12290;&#22240;&#27492;&#26368;&#37325;&#35201;&#30340;&#31649;&#29702;&#30446;&#26631;&#26159;&#30830;&#20445;&#20182;&#20204;&#32487;&#32493;&#30456;&#20449;&#36825;&#19968;&#28857;&#65292;&#20570;&#21040;&#36825;&#28857;&#38656;&#35201;&#35774;&#23450;&#20132;&#27969;&#30340;&#26631;&#20934;&#65292;&#38656;&#35201;&#35753;&#33021;&#24178;&#30340;&#24320;&#21457;&#32773;&#19981;&#20250;&#22240;&#20026;&#20010;&#24615;&#32780;&#21463;&#21040;&#25490;&#26021;&#65292;&#24635;&#20043;&#35201;&#20351;&#39033;&#30446;&#25104;&#20026;&#24320;&#21457;&#32773;&#30340;&#30041;&#24651;&#20043;&#22320;&#12290;&#25105;&#20204;&#23558;&#22312;&#21518;&#38754;&#35752;&#35770;&#36825;&#20123;&#24037;&#20316;&#38656;&#35201;&#30340;&#20855;&#20307;&#25216;&#26415;&#12290;</p><p>&#26368;&#21518;&#36824;&#26377;&#19968;&#31181;&#31867;&#22411;&#30340;&#38382;&#39064;&#20063;&#35768;&#25105;&#20204;&#21487;&#20197;&#31216;&#20043;&#20026;&#8220;&#25991;&#21270;&#24341;&#23548;&#22833;&#36133;&#8221;&#12290;&#21313;&#24180;&#20043;&#21069;&#65292;&#29978;&#33267;&#20116;&#24180;&#20043;&#21069;&#65292;&#35848;&#35770;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#30340;&#25972;&#20307;&#25991;&#21270;&#37117;&#36824;&#20026;&#26102;&#36807;&#26089;&#65292;&#20294;&#29616;&#22312;&#19981;&#26159;&#20102;&#12290;&#19968;&#31181;&#28165;&#26224;&#30340;&#25991;&#21270;&#27491;&#22312;&#24930;&#24930;&#28014;&#29616;&#65292;&#34429;&#28982;&#23427;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;&#8212;&#22914;&#21516;&#24456;&#22810;&#22320;&#22495;&#32422;&#26463;&#30340;&#25991;&#21270;&#65292;&#26131;&#20110;&#20135;&#29983;&#20869;&#22312;&#30340;&#24322;&#35758;&#21644;&#27966;&#21035;&#8212;&#20294;&#23427;&#26377;&#19968;&#20010;&#22522;&#26412;&#30340;&#19968;&#33268;&#30340;&#26680;&#24515;&#12290;&#22823;&#37096;&#20998;&#25104;&#21151;&#30340;&#24320;&#28304;&#39033;&#30446;&#23637;&#31034;&#20102;&#36825;&#20010;&#26680;&#24515;&#20013;&#30340;&#37096;&#20998;&#25110;&#20840;&#37096;&#29305;&#36136;&#12290;&#20182;&#20204;&#22870;&#21169;&#31526;&#21512;&#36825;&#31181;&#25991;&#21270;&#30340;&#34892;&#20026;&#65292;&#24809;&#32602;&#30456;&#21453;&#30340;&#65307;&#20182;&#20204;&#21019;&#36896;&#20102;&#19968;&#31181;&#40723;&#21169;&#35745;&#21010;&#22806;&#30340;&#21442;&#19982;&#27675;&#22260;&#65292;&#29978;&#33267;&#19981;&#24796;&#20013;&#24515;&#21327;&#35843;&#26102;&#38388;&#30340;&#20195;&#20215;&#65307;&#20182;&#20204;&#23545;&#31895;&#37326;&#21644;&#31036;&#35980;&#30340;&#27010;&#24565;&#19982;&#27969;&#34892;&#35266;&#24565;&#26377;&#26412;&#36136;&#19978;&#30340;&#21306;&#21035;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#38271;&#26399;&#30340;&#21442;&#19982;&#24050;&#32463;&#20869;&#21270;&#20102;&#36825;&#20123;&#26631;&#20934;&#65292;&#25152;&#20197;&#20182;&#20204;&#33021;&#22815;&#23545;&#23558;&#35201;&#21457;&#29983;&#30340;&#20030;&#21160;&#33021;&#22823;&#20307;&#19978;&#21462;&#24471;&#20849;&#35782;&#12290;&#22833;&#36133;&#30340;&#39033;&#30446;&#36890;&#24120;&#26174;&#33879;&#30340;&#32972;&#31163;&#20102;&#36825;&#20010;&#26680;&#24515;&#65292;&#23613;&#31649;&#24182;&#38750;&#26412;&#24847;&#65292;&#20294;&#36890;&#24120;&#26159;&#22240;&#20026;&#27809;&#26377;&#23545;&#24314;&#31435;&#21512;&#29702;&#40664;&#35748;&#34892;&#20026;&#26041;&#24335;&#36798;&#25104;&#20849;&#35782;&#12290;&#36825;&#24847;&#21619;&#30528;&#19968;&#26086;&#38382;&#39064;&#20986;&#29616;&#65292;&#30001;&#20110;&#21442;&#19982;&#32773;&#32570;&#20047;&#36890;&#36807;&#24357;&#34917;&#20998;&#27495;&#32780;&#23545;&#38382;&#39064;&#20570;&#20986;&#21453;&#39304;&#30340;&#29616;&#25104;&#25991;&#21270;&#20648;&#22791;&#65292;&#24418;&#21183;&#20250;&#36805;&#36895;&#24694;&#21270;&#12290;</p><p>&#27492;&#20070;&#26159;&#19968;&#26412;&#23454;&#29992;&#30340;&#25351;&#21335;&#65292;&#32780;&#19981;&#26159;&#19968;&#31687;&#20154;&#31867;&#23398;&#35770;&#25991;&#25110;&#26159;&#21490;&#20070;&#12290;&#28982;&#32780;&#20102;&#35299;&#20170;&#22825;&#30340;&#33258;&#30001;&#36719;&#20214;&#25991;&#21270;&#30340;&#36215;&#28304;&#23545;&#20219;&#20309;&#19968;&#20010;&#23454;&#38469;&#30340;&#24314;&#35758;&#37117;&#26159;&#24517;&#35201;&#30340;&#22522;&#30784;&#12290;&#19968;&#20010;&#29702;&#35299;&#36825;&#31181;&#25991;&#21270;&#30340;&#20154;&#33021;&#22312;&#24320;&#28304;&#19990;&#30028;&#20219;&#24847;&#39536;&#39563;&#65292;&#21363;&#20351;&#36935;&#21040;&#24456;&#22810;&#30340;&#21508;&#22320;&#39118;&#20439;&#21644;&#26041;&#35328;&#65292;&#20173;&#28982;&#21487;&#20197;&#33258;&#20449;&#21644;&#26377;&#25928;&#22320;&#21442;&#19982;&#12290;&#30456;&#21453;&#65292;&#19968;&#20010;&#27809;&#33021;&#24456;&#22909;&#29702;&#35299;&#36825;&#31181;&#25991;&#21270;&#30340;&#20154;&#23558;&#20250;&#22312;&#32452;&#32455;&#25110;&#26159;&#21442;&#19982;&#19968;&#20010;&#39033;&#30446;&#30340;&#36807;&#31243;&#20013;&#22788;&#22788;&#36935;&#21040;&#22256;&#38590;&#21644;&#24847;&#22806;&#12290;&#30001;&#20110;&#33258;&#30001;&#36719;&#20214;&#30340;&#24320;&#21457;&#20154;&#21592;&#30340;&#25968;&#37327;&#20173;&#28982;&#22312;&#39134;&#36895;&#22686;&#38271;&#65292;&#20854;&#20013;&#26377;&#24456;&#22810;&#20154;&#23646;&#20110;&#21518;&#19968;&#31181;&#24773;&#20917;&#8212;&#36825;&#22810;&#21322;&#26159;&#19968;&#31181;&#26032;&#36817;&#21152;&#20837;&#30340;&#25991;&#21270;&#65292;&#24182;&#19988;&#20250;&#25345;&#32493;&#19968;&#27573;&#26102;&#38388;&#12290;&#22914;&#26524;&#20320;&#33258;&#35748;&#20026;&#26159;&#20854;&#20013;&#30340;&#19968;&#21592;&#65292;&#19979;&#19968;&#33410;&#20026;&#20320;&#22312;&#20197;&#21518;&#23558;&#22312;&#26412;&#20070;&#25110;&#26159;&#20114;&#32852;&#32593;&#19978;&#36935;&#21040;&#30340;&#35752;&#35770;&#25552;&#20379;&#20102;&#32972;&#26223;&#26448;&#26009;&#12290;&#65288;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20320;&#24050;&#32463;&#22312;&#24320;&#28304;&#20013;&#24037;&#20316;&#20102;&#19968;&#27573;&#26102;&#38388;&#65292;&#20320;&#20063;&#35768;&#26089;&#24050;&#20102;&#35299;&#20102;&#36825;&#27573;&#21382;&#21490;&#65292;&#20320;&#21487;&#20197;&#36873;&#25321;&#36339;&#36807;&#36825;&#19968;&#33410;&#12290;&#65289;</p></div><div class="sect1" title="&#21382;&#21490;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>&#21382;&#21490;</h2></div></div></div><p>&#36719;&#20214;&#20998;&#20139;&#33258;&#20174;&#36719;&#20214;&#35806;&#29983;&#30340;&#37027;&#19968;&#22825;&#36215;&#23601;&#20986;&#29616;&#20102;&#12290;&#22312;&#35745;&#31639;&#26426;&#24037;&#19994;&#30340;&#26089;&#26399;&#65292;&#21378;&#21830;&#35748;&#20026;&#31454;&#20105;&#30340;&#20248;&#21183;&#22312;&#20110;&#23545;&#30828;&#20214;&#30340;&#21019;&#26032;&#65292;&#22240;&#27492;&#24182;&#19981;&#22826;&#35748;&#30495;&#25226;&#36719;&#20214;&#24403;&#25104;&#21830;&#19994;&#36164;&#20135;&#30475;&#24453;&#12290;&#36825;&#20123;&#26089;&#26399;&#26426;&#22120;&#29992;&#25143;&#35768;&#22810;&#37117;&#26159;&#31185;&#23398;&#23478;&#25110;&#26159;&#25216;&#26415;&#20154;&#21592;&#65292;&#20182;&#20204;&#26377;&#33021;&#21147;&#33258;&#24049;&#20462;&#25913;&#21644;&#25193;&#23637;&#38543;&#26426;&#38468;&#36865;&#30340;&#36719;&#20214;&#12290;&#26377;&#26102;&#29992;&#25143;&#19981;&#20165;&#23558;&#34917;&#19969;&#21453;&#39304;&#32473;&#21378;&#21830;&#65292;&#32780;&#19988;&#20998;&#21457;&#32473;&#30456;&#20284;&#26426;&#22120;&#30340;&#20854;&#20182;&#29992;&#25143;&#12290;&#21378;&#21830;&#32463;&#24120;&#20801;&#35768;&#29978;&#33267;&#40723;&#21169;&#36825;&#20040;&#20570;&#65306;&#22312;&#20182;&#20204;&#30524;&#37324;&#65292;&#26080;&#35770;&#26159;&#21738;&#19968;&#31181;&#28192;&#36947;&#65292;&#23545;&#36719;&#20214;&#30340;&#25913;&#36827;&#37117;&#20351;&#24471;&#26426;&#22120;&#23545;&#20854;&#20182;&#30340;&#28508;&#22312;&#28040;&#36153;&#32773;&#26356;&#26377;&#21560;&#24341;&#21147;&#12290;</p><p>&#34429;&#28982;&#20170;&#22825;&#30340;&#33258;&#30001;&#36719;&#20214;&#25991;&#21270;&#22312;&#24456;&#22810;&#26041;&#38754;&#37117;&#21644;&#26089;&#26399;&#30456;&#20284;&#65292;&#20294;&#26159;&#26377;&#20004;&#28857;&#37325;&#35201;&#30340;&#19981;&#21516;&#12290;&#39318;&#20808;&#65292;&#24403;&#26102;&#20960;&#20046;&#27809;&#26377;&#30828;&#20214;&#30340;&#26631;&#20934;&#8212;&#37027;&#26159;&#19968;&#20010;&#35745;&#31639;&#26426;&#35774;&#35745;&#21019;&#26032;&#30340;&#40644;&#37329;&#26102;&#20195;&#65292;&#20294;&#26159;&#32321;&#22810;&#30340;&#35745;&#31639;&#26426;&#26550;&#26500;&#20063;&#24847;&#21619;&#30528;&#25152;&#26377;&#30340;&#20107;&#24773;&#37117;&#26080;&#27861;&#21516;&#20854;&#20182;&#30340;&#20860;&#36890;&#12290;&#22240;&#27492;&#65292;&#20026;&#19968;&#21488;&#26426;&#22120;&#32534;&#20889;&#30340;&#36719;&#20214;&#19968;&#33324;&#26080;&#27861;&#22312;&#21478;&#19968;&#21488;&#19978;&#24037;&#20316;&#12290;&#22312;&#19968;&#31181;&#29305;&#23450;&#30340;&#26550;&#26500;&#25110;&#26159;&#26550;&#26500;&#26063;&#19978;&#31243;&#24207;&#21592;&#38656;&#35201;&#19987;&#38376;&#30340;&#30693;&#35782;&#65288;&#20170;&#22825;&#31243;&#24207;&#21592;&#26356;&#22810;&#30340;&#26159;&#23398;&#20064;&#19968;&#31181;&#32534;&#31243;&#35821;&#35328;&#25110;&#26159;&#35821;&#35328;&#31867;&#22411;&#30340;&#19987;&#38376;&#30693;&#35782;&#65292;&#20182;&#20204;&#23545;&#20182;&#20204;&#30340;&#19987;&#19994;&#30693;&#35782;&#33021;&#31227;&#26893;&#20219;&#20309;&#19968;&#21488;&#36935;&#21040;&#30340;&#26426;&#22120;&#19978;&#38750;&#24120;&#33258;&#20449;&#65289;&#12290;&#22240;&#20026;&#20010;&#20154;&#30340;&#19987;&#38376;&#30693;&#35782;&#24635;&#26159;&#38024;&#23545;&#19968;&#31181;&#29305;&#23450;&#31867;&#22411;&#30340;&#35745;&#31639;&#26426;&#65292;&#36825;&#20123;&#19987;&#38376;&#30693;&#35782;&#30340;&#31215;&#32047;&#33021;&#35753;&#35745;&#31639;&#26426;&#23545;&#20182;&#20204;&#20197;&#21450;&#21516;&#20107;&#21464;&#24471;&#36234;&#26469;&#36234;&#26377;&#36259;&#12290;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#21378;&#21830;&#23545;&#35753;&#29305;&#23450;&#26426;&#22120;&#30340;&#20195;&#30721;&#21644;&#30693;&#35782;&#23613;&#21487;&#33021;&#24191;&#30340;&#24471;&#21040;&#20256;&#25773;&#24863;&#20852;&#36259;&#30340;&#21407;&#22240;&#12290;</p><p>&#20854;&#27425;&#65292;&#24403;&#26102;&#27809;&#26377;&#20114;&#32852;&#32593;&#12290;&#34429;&#28982;&#24403;&#26102;&#23545;&#20998;&#20139;&#30340;&#27861;&#24459;&#32422;&#26463;&#27604;&#20170;&#22825;&#23569;&#65292;&#20294;&#21364;&#26377;&#26356;&#22810;&#30340;&#25216;&#26415;&#32422;&#26463;&#65306;&#20063;&#23601;&#26159;&#35828;&#65292;&#21644;&#35828;&#35805;&#30456;&#27604;&#65292;&#25226;&#25968;&#25454;&#20174;&#19968;&#20010;&#22320;&#26041;&#31227;&#21040;&#21478;&#19968;&#20010;&#22320;&#26041;&#26159;&#31528;&#37325;&#19981;&#20415;&#30340;&#12290;&#22312;&#19968;&#20123;&#20844;&#21496;&#21644;&#23454;&#39564;&#23460;&#37324;&#21592;&#24037;&#20043;&#38388;&#65292;&#21487;&#20197;&#36890;&#36807;&#19968;&#20123;&#19981;&#38169;&#30340;&#23567;&#22411;&#30340;&#23616;&#22495;&#32593;&#20849;&#20139;&#20449;&#24687;&#12290;&#20294;&#24403;&#19968;&#20010;&#20154;&#24819;&#21516;&#19981;&#38480;&#22320;&#28857;&#30340;&#25152;&#26377;&#20154;&#20998;&#20139;&#26102;&#65292;&#38382;&#39064;&#20381;&#28982;&#23384;&#22312;&#12290;&#20811;&#26381;&#36825;&#20123;&#38382;&#39064;&#30340;&#36884;&#24452;<span class="emphasis"><em>&#26377;</em></span>&#24456;&#22810;&#12290;&#26377;&#26102;&#29420;&#31435;&#30340;&#22242;&#20307;&#20043;&#38388;&#20250;&#20114;&#30456;&#32852;&#31995;&#65292;&#36890;&#36807;&#37038;&#23616;&#23492;&#36865;&#30913;&#30424;&#25110;&#26159;&#30913;&#24102;&#65292;&#26377;&#26102;&#21378;&#21830;&#25198;&#28436;&#20102;&#34917;&#19969;&#30340;&#20013;&#24515;&#24773;&#25253;&#20132;&#25442;&#25152;&#30340;&#35282;&#33394;&#12290;&#21378;&#21830;&#36824;&#20250;&#24110;&#21161;&#22312;&#22823;&#23398;&#37324;&#30340;&#26089;&#26399;&#35745;&#31639;&#26426;&#24320;&#21457;&#32773;&#65292;&#37027;&#37324;&#30340;&#27668;&#27675;&#26159;&#40723;&#21169;&#30693;&#35782;&#20256;&#25773;&#30340;&#12290;&#20294;&#26159;&#25968;&#25454;&#20256;&#36755;&#25152;&#24517;&#39035;&#30340;&#29289;&#29702;&#23186;&#20307;&#24847;&#21619;&#30528;&#20998;&#20139;&#24635;&#20250;&#36935;&#21040;&#38459;&#21147;&#65292;&#21644;&#65288;&#23454;&#38469;&#19978;&#30340;&#25110;&#26159;&#32452;&#32455;&#19978;&#30340;&#65289;&#36317;&#31163;&#25104;&#27491;&#27604;&#30340;&#38459;&#21147;&#12290;&#29616;&#22312;&#36825;&#31181;&#24191;&#27867;&#30340;&#65292;&#20960;&#20046;&#27809;&#26377;&#38459;&#21147;&#30340;&#20998;&#20139;&#65292;&#22312;&#37027;&#26102;&#36824;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290;</p><div class="sect2" title="&#31169;&#26377;&#36719;&#20214;&#21644;&#33258;&#30001;&#36719;&#20214;&#30340;&#20852;&#36215;"><div class="titlepage"><div><div><h3 class="title"><a name="propertization"></a>&#31169;&#26377;&#36719;&#20214;&#21644;&#33258;&#30001;&#36719;&#20214;&#30340;&#20852;&#36215;</h3></div></div></div><p>&#38543;&#30528;&#24037;&#19994;&#30340;&#25104;&#29087;&#65292;&#25509;&#36830;&#21457;&#29983;&#20102;&#19968;&#31995;&#21015;&#30456;&#20851;&#30340;&#21464;&#21270;&#12290;&#20247;&#22810;&#30828;&#20214;&#35774;&#35745;&#20013;&#30340;&#36194;&#23478;&#36880;&#28176;&#28165;&#26224;&#36215;&#26469;&#8212;&#26377;&#25216;&#26415;&#20248;&#21183;&#30340;&#36194;&#23478;&#65292;&#26377;&#34892;&#38144;&#20248;&#21183;&#30340;&#36194;&#23478;&#65292;&#25110;&#26159;&#20004;&#32773;&#32467;&#21512;&#30340;&#36194;&#23478;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#34987;&#31216;&#20026;&#8220;&#39640;&#32423;&#8221;&#35821;&#35328;&#30340;&#32534;&#31243;&#35821;&#35328;&#30340;&#21457;&#23637;&#24847;&#21619;&#30528;&#19968;&#20010;&#29992;&#26576;&#31181;&#35821;&#35328;&#20889;&#25104;&#30340;&#31243;&#24207;&#33021;&#22815;&#36716;&#31227;&#21040;&#65288;&#8220;&#32534;&#35793;&#8221;&#65289;&#21478;&#19968;&#31181;&#31867;&#22411;&#30340;&#35745;&#31639;&#26426;&#19978;&#36816;&#34892;&#12290;&#30828;&#20214;&#21378;&#21830;&#19981;&#20250;&#24573;&#35270;&#36825;&#20854;&#20013;&#30340;&#21547;&#20041;&#65306;&#29616;&#22312;&#23458;&#25143;&#26080;&#39035;&#20877;&#25226;&#33258;&#24049;&#25414;&#32465;&#22312;&#19968;&#31181;&#29305;&#23450;&#30340;&#35745;&#31639;&#26426;&#26550;&#26500;&#19978;&#23601;&#21487;&#20197;&#24320;&#23637;&#19968;&#20010;&#22823;&#22411;&#30340;&#36719;&#20214;&#24037;&#31243;&#39033;&#30446;&#12290;&#38543;&#30528;&#21508;&#31867;&#35745;&#31639;&#26426;&#30340;&#24615;&#33021;&#24046;&#24322;&#26085;&#30410;&#21464;&#23567;&#65292;&#20197;&#21450;&#20302;&#25928;&#29575;&#35774;&#35745;&#30340;&#28040;&#22833;&#65292;&#30828;&#20214;&#25104;&#20102;&#21378;&#21830;&#20026;&#26410;&#26469;&#21033;&#28070;&#29575;&#19979;&#38477;&#30340;&#21807;&#19968;&#25351;&#26395;&#12290;&#21407;&#22987;&#30340;&#35745;&#31639;&#33021;&#21147;&#25104;&#20102;&#19968;&#31181;&#21487;&#26367;&#20195;&#30340;&#20135;&#21697;&#65292;&#32780;&#36719;&#20214;&#25104;&#20026;&#24046;&#24322;&#21270;&#20248;&#21183;&#12290;&#38144;&#21806;&#36719;&#20214;&#25110;&#33267;&#23569;&#23558;&#23427;&#35270;&#20026;&#30828;&#20214;&#38144;&#21806;&#19981;&#21487;&#20998;&#21106;&#30340;&#19968;&#37096;&#20998;&#65292;&#30475;&#36215;&#26469;&#26159;&#19968;&#31181;&#19981;&#38169;&#30340;&#31574;&#30053;&#12290;</p><p>&#36825;&#24847;&#21619;&#30528;&#21378;&#21830;&#24517;&#39035;&#24320;&#22987;&#26356;&#20005;&#26684;&#22320;&#22312;&#20182;&#20204;&#30340;&#20195;&#30721;&#19978;&#24378;&#21046;&#25191;&#34892;&#29256;&#26435;&#12290;&#22914;&#26524;&#29992;&#25143;&#20043;&#38388;&#32487;&#32493;&#31616;&#21333;&#22320;&#20998;&#20139;&#21644;&#20462;&#25913;&#20195;&#30721;&#65292;&#20182;&#20204;&#21487;&#33021;&#20250;&#29420;&#31435;&#23436;&#25104;&#19968;&#20123;&#25913;&#36827;&#65292;&#29616;&#22312;&#34987;&#20379;&#24212;&#21830;&#24403;&#25104;&#8220;&#38468;&#21152;&#20215;&#20540;&#8221;&#29992;&#26469;&#38144;&#21806;&#12290;&#26356;&#31967;&#30340;&#26159;&#65292;&#20998;&#20139;&#20195;&#30721;&#21487;&#20197;&#33853;&#20837;&#31454;&#20105;&#23545;&#25163;&#30340;&#25163;&#37324;&#12290;&#35773;&#21050;&#30340;&#26159;&#65292;&#36825;&#19968;&#20999;&#37117;&#21457;&#29983;&#22312;&#20114;&#32852;&#32593;&#21363;&#23558;&#30772;&#22771;&#32780;&#20986;&#20043;&#26102;&#12290;&#23601;&#22312;&#26080;&#38556;&#30861;&#30340;&#36719;&#20214;&#20998;&#20139;&#22312;&#25216;&#26415;&#26159;&#32456;&#20110;&#25104;&#20026;&#21487;&#33021;&#26102;&#65292;&#35745;&#31639;&#26426;&#34892;&#19994;&#20869;&#21457;&#29983;&#30340;&#21464;&#21270;&#21017;&#20351;&#23427;&#22312;&#32463;&#27982;&#19978;&#26080;&#27861;&#21463;&#21040;&#27426;&#36814;&#65292;&#33267;&#23569;&#35745;&#31639;&#26426;&#20844;&#21496;&#30340;&#35266;&#28857;&#26159;&#22914;&#27492;&#12290;&#20379;&#24212;&#21830;&#25163;&#27573;&#24378;&#30828;&#65292;&#35201;&#20040;&#25298;&#32477;&#23458;&#25143;&#35775;&#38382;&#33258;&#24049;&#26426;&#22120;&#19978;&#30340;&#28304;&#20195;&#30721;&#65292;&#35201;&#20040;&#26159;&#36890;&#36807;&#20445;&#23494;&#21327;&#35758;&#20351;&#26041;&#20415;&#30340;&#20849;&#20139;&#25104;&#20026;&#19981;&#21487;&#33021;&#12290;</p><div class="sect3" title="&#26377;&#24847;&#35782;&#30340;&#21453;&#25239;"><div class="titlepage"><div><div><h4 class="title"><a name="history-conscious-resistance"></a>&#26377;&#24847;&#35782;&#30340;&#21453;&#25239;</h4></div></div></div><p>&#34429;&#28982;&#26080;&#38556;&#30861;&#20195;&#30721;&#20998;&#20139;&#30340;&#19990;&#30028;&#27491;&#22312;&#24930;&#24930;&#20939;&#38646;&#65292;&#20294;&#33267;&#23569;&#26377;&#19968;&#21517;&#31243;&#24207;&#21592;&#30340;&#24515;&#20013;&#20445;&#25345;&#30528;&#28165;&#37266;&#12290;&#29702;&#26597;&#24503;·&#26031;&#22612;&#23571;&#26364;&#65288;Richard Stallman&#65289;&#22312;70&#24180;&#20195;&#21644;80&#24180;&#20195;&#26089;&#26399;&#19968;&#30452;&#20026;&#40635;&#30465;&#29702;&#24037;&#23398;&#38498;&#30340;&#20154;&#24037;&#26234;&#33021;&#23454;&#39564;&#23460;&#24037;&#20316;&#65292;&#37027;&#37324;&#26159;&#20195;&#30721;&#20998;&#20139;&#40644;&#37329;&#26102;&#20195;&#30340;&#40644;&#37329;&#22307;&#22320;&#12290;&#20154;&#24037;&#26234;&#33021;&#23454;&#39564;&#23460;&#26377;&#24456;&#24378;&#30340;&#8220;&#40657;&#23458;&#31934;&#31070;&#8221;&#65292;<sup>[<a name="idp154" href="#ftn.idp154" class="footnote">3</a>]</sup>&#37027;&#37324;&#30340;&#20154;&#23545;&#20998;&#20139;&#20026;&#31995;&#32479;&#20570;&#20986;&#30340;&#20219;&#20309;&#25913;&#36827;&#26377;&#29378;&#28909;&#30340;&#29233;&#22909;&#12290;&#27491;&#22914;&#26031;&#22612;&#23571;&#26364;&#21518;&#26469;&#20889;&#21040;&#30340;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#25105;&#20204;&#27809;&#26377;&#25226;&#25105;&#20204;&#30340;&#36719;&#20214;&#31216;&#20026;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#65292;&#22240;&#20026;&#37027;&#26102;&#36825;&#20010;&#26415;&#35821;&#36824;&#19981;&#23384;&#22312;&#65292;&#20294;&#23427;&#30830;&#23454;&#26159;&#12290;&#26080;&#35770;&#22806;&#38754;&#30340;&#22823;&#23398;&#25110;&#26159;&#20844;&#21496;&#26469;&#30340;&#20154;&#26469;&#32034;&#35201;&#31243;&#24207;&#65292;&#25105;&#20204;&#37117;&#24456;&#39640;&#20852;&#36825;&#20040;&#20570;&#12290;&#22914;&#26524;&#20320;&#30475;&#21040;&#22312;&#29992;&#30340;&#19968;&#20010;&#23569;&#35265;&#36824;&#26377;&#36259;&#30340;&#31243;&#24207;&#65292;&#20320;&#24635;&#21487;&#20197;&#35201;&#27714;&#30475;&#28304;&#20195;&#30721;&#65292;&#25152;&#20197;&#20320;&#33021;&#35835;&#23427;&#65292;&#20462;&#25913;&#23427;&#65292;&#25110;&#32773;&#29992;&#25286;&#21462;&#37096;&#20998;&#20889;&#19968;&#20010;&#26032;&#31243;&#24207;&#12290; </em></span></p><p>&#65288;&#26469;&#33258;<span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.html" target="_top">http://www.gnu.org/gnu/thegnuproject.html</a></strong></span>&#65289;</p></blockquote></div><p>1980&#24180;&#20043;&#21518;&#19981;&#20037;&#24037;&#19994;&#30028;&#21457;&#29983;&#30340;&#21464;&#21270;&#26368;&#32456;&#24433;&#21709;&#21040;&#20102;&#20154;&#24037;&#26234;&#33021;&#23454;&#39564;&#23460;&#65292;&#26031;&#22612;&#23571;&#26364;&#21608;&#22260;&#20234;&#30008;&#22253;&#24335;&#30340;&#31038;&#21306;&#22349;&#22604;&#20102;&#12290;&#19968;&#23478;&#21019;&#19994;&#20844;&#21496;&#25366;&#36208;&#20102;&#24456;&#22810;&#23454;&#39564;&#23460;&#30340;&#31243;&#24207;&#21592;&#21435;&#24320;&#21457;&#19968;&#20010;&#25805;&#20316;&#31995;&#32479;&#65292;&#36825;&#20010;&#31995;&#32479;&#21516;&#23454;&#39564;&#23460;&#27491;&#22312;&#24320;&#21457;&#30340;&#38750;&#24120;&#30456;&#20284;&#65292;&#20294;&#20351;&#29992;&#20102;&#29420;&#21344;&#35768;&#21487;&#35777;&#12290;&#19982;&#27492;&#21516;&#26102;&#65292;&#20154;&#24037;&#26234;&#33021;&#23454;&#39564;&#23460;&#36141;&#20080;&#20102;&#24102;&#26377;&#31169;&#26377;&#25805;&#20316;&#31995;&#32479;&#30340;&#26032;&#35774;&#22791;&#12290;</p><p>&#26031;&#22612;&#23571;&#26364;&#35265;&#19968;&#21494;&#33853;&#32780;&#30693;&#31179;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#37027;&#20010;&#26102;&#20195;&#30340;&#29616;&#20195;&#21270;&#35745;&#31639;&#26426;&#65292;&#27604;&#22914;VAX&#25110;68020&#37117;&#26377;&#33258;&#24049;&#30340;&#25805;&#20316;&#31995;&#32479;&#65292;&#20294;&#37117;&#19981;&#26159;&#33258;&#30001;&#36719;&#20214;&#65306;&#20026;&#20102;&#24471;&#21040;&#19968;&#20221;&#33021;&#36816;&#34892;&#30340;&#25335;&#36125;&#65292;&#20320;&#29978;&#33267;&#24471;&#31614;&#32626;&#19968;&#20221;&#20445;&#23494;&#21327;&#35758;&#12290;</em></span> </p><p><span class="emphasis"><em>&#36825;&#23601;&#26159;&#35828;&#20351;&#29992;&#19968;&#21488;&#35745;&#31639;&#26426;&#30340;&#31532;&#19968;&#27493;&#26159;&#25215;&#35834;&#19981;&#24110;&#20320;&#30340;&#37051;&#23621;&#12290;&#19968;&#20010;&#20114;&#21161;&#30340;&#31038;&#21306;&#26159;&#34987;&#31105;&#27490;&#30340;&#12290;&#31169;&#26377;&#36719;&#20214;&#30340;&#25317;&#26377;&#32773;&#23450;&#19979;&#20102;&#35268;&#30697;&#65292;&#8220;&#22914;&#26524;&#20320;&#21644;&#20320;&#30340;&#37051;&#23621;&#20998;&#20139;&#20102;&#65292;&#20320;&#23601;&#26159;&#24378;&#30423;&#12290;&#22914;&#26524;&#20320;&#24819;&#35201;&#25913;&#21464;&#65292;&#26469;&#31048;&#27714;&#25105;&#20204;&#20570;&#21543;&#12290;&#8221;</em></span> </p></blockquote></div><p>&#27492;&#26102;&#65292;&#20182;&#24615;&#26684;&#20013;&#30340;&#24618;&#20731;&#33804;&#21160;&#20102;&#65292;&#20182;&#20915;&#23450;&#21453;&#25239;&#36825;&#31181;&#36235;&#21183;&#12290;&#20182;&#26082;&#19981;&#24819;&#32487;&#32493;&#30041;&#22312;&#20154;&#21435;&#27004;&#31354;&#30340;&#20154;&#24037;&#26234;&#33021;&#23454;&#39564;&#23460;&#65292;&#20063;&#19981;&#24819;&#22312;&#19968;&#23478;&#26032;&#20844;&#21496;&#37324;&#20889;&#20195;&#30721;&#65292;&#22240;&#20026;&#20182;&#20889;&#20986;&#30340;&#20195;&#30721;&#20250;&#34987;&#38145;&#22312;&#20445;&#23494;&#31665;&#37324;&#65292;&#26368;&#32456;&#20182;&#20174;&#23454;&#39564;&#23460;&#36766;&#32844;&#65292;&#38543;&#21518;&#21019;&#24314;&#20102;GNU&#39033;&#30446;&#21644;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#65288;FSF&#65289;&#12290;GNU<sup>[<a name="idp170" href="#ftn.idp170" class="footnote">4</a>]</sup>&#30340;&#30446;&#26631;&#26159;&#24320;&#21457;&#19968;&#20010;&#23436;&#20840;&#33258;&#30001;&#21644;&#24320;&#25918;&#30340;&#25805;&#20316;&#31995;&#32479;&#21644;&#37197;&#22871;&#30340;&#24212;&#29992;&#36719;&#20214;&#65292;&#23427;&#20204;&#30340;&#29992;&#25143;&#27704;&#36828;&#19981;&#20250;&#38459;&#27490;&#21435;&#30772;&#35299;&#25110;&#26159;&#20998;&#20139;&#23427;&#20204;&#30340;&#20462;&#25913;&#12290;&#26412;&#36136;&#19978;&#20182;&#26159;&#35201;&#37325;&#24314;&#20154;&#24037;&#23454;&#39564;&#23460;&#20869;&#34987;&#25703;&#27585;&#30340;&#37027;&#20123;&#19996;&#35199;&#65292;&#20294;&#26159;&#36825;&#19968;&#27425;&#26159;&#22312;&#20840;&#19990;&#30028;&#30340;&#35268;&#27169;&#19978;&#65292;&#24182;&#19988;&#36824;&#35201;&#36991;&#20813;&#23548;&#33268;&#20154;&#24037;&#23454;&#39564;&#23460;&#30340;&#25991;&#21270;&#34987;&#21160;&#25671;&#30772;&#35010;&#30340;&#37027;&#20123;&#24369;&#28857;&#12290;</p><p>&#38500;&#20102;&#26032;&#25805;&#20316;&#31995;&#32479;&#30340;&#24037;&#20316;&#65292;&#26031;&#22612;&#23571;&#26364;&#36824;&#35774;&#35745;&#20102;&#19968;&#22871;&#30830;&#20445;&#20182;&#30340;&#20195;&#30721;&#26080;&#38480;&#33258;&#30001;&#30340;&#29256;&#26435;&#35768;&#21487;&#35777;&#12290;GNU&#36890;&#29992;&#20844;&#20849;&#35768;&#21487;&#35777;&#65288;GPL&#65289;&#26159;&#27861;&#24459;&#21338;&#24328;&#20013;&#30340;&#22855;&#25307;&#65306;&#23427;&#22768;&#26126;&#20801;&#35768;&#26080;&#38480;&#21046;&#22320;&#22797;&#21046;&#21644;&#20462;&#25913;&#20195;&#30721;&#65292;&#21516;&#26102;&#25335;&#36125;&#21644;&#27966;&#29983;&#20135;&#29289;&#65288;&#21363;&#20462;&#25913;&#29256;&#26412;&#65289;&#24517;&#39035;&#22312;&#21407;&#22987;&#29256;&#26412;&#30340;&#30456;&#21516;&#35768;&#21487;&#35777;&#19979;&#21457;&#24067;&#65292;&#19981;&#24471;&#38468;&#21152;&#38480;&#21046;&#12290;&#23454;&#38469;&#19978;&#65292;&#23427;&#29992;&#29256;&#26435;&#27861;&#21435;&#36798;&#21040;&#19968;&#20010;&#21516;&#20256;&#32479;&#29256;&#26435;&#27861;&#30456;&#21453;&#30340;&#30446;&#30340;&#65306;&#21462;&#28040;&#23545;&#36719;&#20214;&#20998;&#21457;&#30340;&#38480;&#21046;&#65292;&#23427;&#38459;&#27490;<span class="emphasis"><em>&#20219;&#20309;&#20154;</em></span>&#65292;&#29978;&#33267;&#26159;&#20316;&#32773;&#26412;&#20154;&#23545;&#27492;&#30340;&#38480;&#21046;&#12290;&#23545;&#26031;&#22612;&#23571;&#26364;&#26469;&#35828;&#65292;&#36825;&#35201;&#27604;&#31616;&#21333;&#22320;&#25226;&#20182;&#30340;&#20195;&#30721;&#20998;&#21457;&#21040;&#20844;&#20849;&#39046;&#22495;&#22909;&#24471;&#22810;&#12290;&#22240;&#20026;&#22312;&#20844;&#20849;&#39046;&#22495;&#65292;&#19968;&#20221;&#23454;&#38469;&#30340;&#25335;&#36125;&#26377;&#21487;&#33021;&#34987;&#21253;&#21547;&#22312;&#19968;&#20010;&#31169;&#26377;&#31243;&#24207;&#20013;&#65288;&#36825;&#26679;&#30340;&#20107;&#24773;&#25105;&#20204;&#22312;&#20351;&#29992;&#23485;&#26494;&#30340;&#29256;&#26435;&#35768;&#21487;&#35777;&#30340;&#20195;&#30721;&#20013;&#21548;&#21040;&#24456;&#22810;&#20102;&#65289;&#12290;&#34429;&#28982;&#36825;&#31181;&#21253;&#21547;&#19981;&#20250;&#22312;&#20219;&#20309;&#26041;&#38754;&#20943;&#24369;&#21407;&#22987;&#20195;&#30721;&#30340;&#25345;&#32493;&#21487;&#29992;&#24615;&#65292;&#20294;&#23427;&#24847;&#21619;&#30528;&#26031;&#22612;&#23571;&#26364;&#30340;&#21162;&#21147;&#21487;&#33021;&#20250;&#24110;&#21161;&#25932;&#20154;&#8212;&#31169;&#26377;&#36719;&#20214;&#12290;GPL&#20026;&#33258;&#30001;&#36719;&#20214;&#25552;&#20379;&#20102;&#19968;&#22871;&#20445;&#25252;&#26426;&#21046;&#65292;&#22240;&#20026;&#23427;&#38459;&#27490;&#20102;&#38750;&#33258;&#30001;&#36719;&#20214;&#21033;&#29992;GPL&#35768;&#21487;&#35777;&#19979;&#20195;&#30721;&#30340;&#20248;&#21183;&#12290;GPL&#21516;&#20854;&#20182;&#33258;&#30001;&#36719;&#20214;&#35768;&#21487;&#35777;&#20851;&#31995;&#30340;&#35814;&#32454;&#35752;&#35770;&#22312;<a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#12290;</p><p>&#22312;&#24456;&#22810;&#31243;&#24207;&#21592;&#30340;&#24110;&#21161;&#19979;&#9472;&#9472;&#20854;&#20013;&#26377;&#20123;&#26159;&#35748;&#21516;&#26031;&#22612;&#23571;&#26364;&#30340;&#24605;&#24819;&#20307;&#31995;&#65292;&#26377;&#20123;&#21482;&#26159;&#20026;&#20102;&#33021;&#30475;&#21040;&#33258;&#30001;&#36719;&#20214;&#30340;&#20195;&#30721;&#9472;&#9472;GNU&#39033;&#30446;&#24320;&#22987;&#21457;&#24067;&#25805;&#20316;&#31995;&#32479;&#20013;&#26368;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#30340;&#33258;&#30001;&#26367;&#20195;&#21697;&#12290;&#22240;&#20026;&#35745;&#31639;&#26426;&#30828;&#20214;&#21644;&#36719;&#20214;&#24050;&#32463;&#39640;&#24230;&#30340;&#26631;&#20934;&#21270;&#20102;&#65292;&#20351;&#29992;GNU&#26367;&#20195;&#20854;&#20182;&#30340;&#38750;&#33258;&#30001;&#25805;&#20316;&#31995;&#32479;&#25104;&#20026;&#21487;&#33021;&#65292;&#35768;&#22810;&#20154;&#20063;&#36825;&#20040;&#20570;&#20102;&#12290;GNU&#25991;&#23383;&#32534;&#36753;&#22120;&#65288;Emacs&#65289;&#21644;C&#32534;&#35793;&#22120;&#65288;GCC&#65289;&#29305;&#21035;&#30340;&#25104;&#21151;&#65292;&#23427;&#20204;&#33719;&#24471;&#22823;&#37327;&#24544;&#23454;&#30340;&#25317;&#25252;&#32773;&#65292;&#36825;&#19981;&#26159;&#22240;&#20026;&#20854;&#29702;&#24819;&#20027;&#20041;&#30340;&#22522;&#30784;&#65292;&#32780;&#26159;&#22240;&#20026;&#20854;&#25216;&#26415;&#20215;&#20540;&#12290;&#32422;&#22312;1990&#24180;GNU&#24050;&#32463;&#29983;&#20135;&#20102;&#19968;&#20010;&#33258;&#30001;&#25805;&#20316;&#31995;&#32479;&#30340;&#22823;&#37096;&#20998;&#65292;&#38500;&#20102;&#20869;&#26680;&#8212;&#23454;&#38469;&#36127;&#36131;&#24341;&#23548;&#35745;&#31639;&#26426;&#12289;&#31649;&#29702;&#20869;&#23384;&#12289;&#30913;&#30424;&#21644;&#31995;&#32479;&#20854;&#20182;&#36164;&#28304;&#30340;&#37096;&#20998;&#12290;</p><p>&#19981;&#24184;&#30340;&#26159;&#65292;GNU&#39033;&#30446;&#36873;&#25321;&#30340;&#20869;&#26680;&#35774;&#35745;&#35201;&#27604;&#39044;&#24819;&#30340;&#26356;&#38590;&#23454;&#29616;&#12290;&#38543;&#21518;&#30340;&#24310;&#26399;&#20351;&#24471;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#27809;&#33021;&#21450;&#26102;&#22320;&#21457;&#24067;&#19968;&#20010;&#24443;&#24213;&#30340;&#33258;&#30001;&#25805;&#20316;&#31995;&#32479;&#12290;&#36825;&#32570;&#22833;&#30340;&#37096;&#20998;&#26368;&#32456;&#30001;&#19968;&#20010;&#33452;&#20848;&#30340;&#35745;&#31639;&#26426;&#31185;&#23398;&#31995;&#30340;&#22823;&#23398;&#29983;Linus Torvalds&#34917;&#23436;&#65292;&#22312;&#36941;&#24067;&#20840;&#19990;&#30028;&#30340;&#24535;&#24895;&#32773;&#30340;&#24110;&#21161;&#19979;&#20182;&#29992;&#26356;&#21152;&#20445;&#23432;&#30340;&#35774;&#35745;&#23436;&#25104;&#20102;&#19968;&#20010;&#33258;&#30001;&#20869;&#26680;&#12290;&#20182;&#23558;&#20854;&#21629;&#21517;&#20026;Linux&#65292;&#24403;&#25226;&#20869;&#26680;&#21516;GNU&#39033;&#30446;&#30340;&#29616;&#23384;&#36719;&#20214;&#32452;&#21512;&#22312;&#19968;&#36215;&#65292;&#32467;&#26524;&#23601;&#26159;&#19968;&#20010;&#23436;&#20840;&#33258;&#30001;&#30340;&#25805;&#20316;&#31995;&#32479;&#35806;&#29983;&#20102;&#12290;&#31532;&#19968;&#27425;&#65292;&#20320;&#19981;&#20877;&#38656;&#35201;&#20219;&#20309;&#30340;&#31169;&#26377;&#36719;&#20214;&#26469;&#21551;&#21160;&#21644;&#20351;&#29992;&#20320;&#30340;&#35745;&#31639;&#26426;&#12290;<sup>[<a name="idp177" href="#ftn.idp177" class="footnote">5</a>]</sup></p><p>&#36825;&#20010;&#25805;&#20316;&#31995;&#32479;&#19978;&#30340;&#24456;&#22810;&#36719;&#20214;&#37117;&#19981;&#26159;GNU&#39033;&#30446;&#30340;&#20135;&#29289;&#12290;&#23454;&#38469;&#19978;&#65292;GNU&#19981;&#26159;&#21807;&#19968;&#30340;&#24320;&#21457;&#33258;&#30001;&#25805;&#20316;&#31995;&#32479;&#30340;&#22242;&#20307;&#65288;&#20363;&#22914;&#65292;&#24403;&#26102;&#26368;&#32456;&#21457;&#23637;&#20026;NetBSD&#21644;FreeBSD&#30340;&#20195;&#30721;&#24050;&#32463;&#24320;&#22987;&#32534;&#20889;&#65289;&#12290;&#37325;&#35201;&#30340;&#19981;&#20165;&#20165;&#26159;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#20135;&#20986;&#30340;&#20195;&#30721;&#65292;&#32780;&#19988;&#26159;&#23427;&#20204;&#30340;&#25919;&#27835;&#20462;&#36766;&#12290;&#25226;&#33258;&#30001;&#36719;&#20214;&#24403;&#25104;&#19968;&#20010;&#30446;&#26631;&#32780;&#24182;&#38750;&#19968;&#31181;&#25163;&#27573;&#35752;&#35770;&#65292;&#35753;&#37027;&#20123;&#23545;&#27492;&#24182;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#25919;&#27835;&#24847;&#35782;&#30340;&#31243;&#24207;&#21592;&#20204;&#24456;&#20026;&#38590;&#12290;&#21363;&#20351;&#37027;&#20123;&#24182;&#19981;&#35748;&#21516;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#30340;&#31243;&#24207;&#21592;&#20063;&#19981;&#24471;&#19981;&#38754;&#23545;&#36825;&#20123;&#38382;&#39064;&#65292;&#21482;&#35201;&#20182;&#20204;&#22788;&#20110;&#19981;&#21516;&#30340;&#20301;&#32622;&#12290;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#36890;&#36807;&#22312;&#20182;&#20204;&#30340;&#20195;&#30721;&#19978;&#38468;&#24102;&#26377;&#20851;GPL&#21644;&#20854;&#20182;&#25991;&#23383;&#30340;&#20449;&#24687;&#65292;&#25104;&#21151;&#22320;&#25198;&#28436;&#20102;&#40723;&#21160;&#23478;&#30340;&#35282;&#33394;&#12290;&#38543;&#30528;&#20182;&#20204;&#30340;&#20195;&#30721;&#24191;&#27867;&#22320;&#34987;&#20998;&#21457;&#65292;&#24605;&#24819;&#20063;&#38543;&#20043;&#27969;&#20256;&#12290;</p></div><div class="sect3" title="&#24847;&#22806;&#30340;&#21453;&#25239;"><div class="titlepage"><div><div><h4 class="title"><a name="history-accidental-resistance"></a>&#24847;&#22806;&#30340;&#21453;&#25239;</h4></div></div></div><p>&#22312;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#30340;&#26089;&#26399;&#36824;&#21457;&#29983;&#20102;&#24456;&#22810;&#20854;&#20182;&#20107;&#24773;&#65292;&#20854;&#20013;&#24456;&#23569;&#26377;&#22914;&#26031;&#22612;&#23571;&#26364;&#30340;GNU&#39033;&#30446;&#33324;&#28165;&#26224;&#30340;&#24605;&#24819;&#20307;&#31995;&#12290;&#20854;&#20013;&#19968;&#20010;&#26368;&#37325;&#35201;&#30340;&#26159;<em class="firstterm">&#20271;&#20811;&#21033;&#36719;&#20214;&#21457;&#34892;&#29256;</em>&#65288;Berkeley Software Distribution&#65292;<em class="firstterm">BSD</em>&#65289;&#19968;&#20010;Unix&#25805;&#20316;&#31995;&#32479;&#30340;&#37325;&#26032;&#23454;&#29616;&#8212;&#36825;&#20010;&#39033;&#30446;&#21487;&#20197;&#19968;&#30452;&#36861;&#28335;&#21040;1970&#24180;&#20195;&#26202;&#26399;AT&amp;T&#20844;&#21496;&#20869;&#30001;&#21152;&#24030;&#22823;&#23398;&#20271;&#20811;&#21033;&#20998;&#26657;&#36127;&#36131;&#30340;&#19968;&#20010;&#26494;&#25955;&#30340;&#31169;&#26377;&#30740;&#31350;&#39033;&#30446;&#12290;BSD&#24182;&#27809;&#26377;&#20160;&#20040;&#35201;&#31243;&#24207;&#21592;&#20204;&#32852;&#21512;&#36215;&#26469;&#24182;&#19988;&#20849;&#21516;&#35748;&#21487;&#30340;&#25919;&#27835;&#20449;&#26465;&#65292;&#20182;&#20204;&#36890;&#36807;&#39640;&#24230;&#20998;&#25955;&#22320;&#24320;&#21457;&#26041;&#24335;&#20174;&#38646;&#24320;&#22987;&#37325;&#20889;&#20102;Unix&#21629;&#20196;&#34892;&#24037;&#20855;&#21644;&#20195;&#30721;&#24211;&#65292;&#26368;&#32456;&#26159;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#26412;&#36523;&#65292;&#36825;&#19968;&#20999;&#30340;&#22823;&#37096;&#20998;&#37117;&#26159;&#30001;&#24535;&#24895;&#32773;&#23436;&#25104;&#30340;&#65292;&#29992;&#22825;&#25165;&#21644;&#28909;&#24773;<span class="emphasis"><em>&#23454;&#36341;</em></span>&#20102;&#36825;&#20010;&#20449;&#24565;&#12290;BSD&#39033;&#30446;&#25104;&#20102;&#38750;&#24847;&#35782;&#24418;&#24577;&#30340;&#33258;&#30001;&#36719;&#20214;&#24320;&#21457;&#30340;&#20027;&#35201;&#20363;&#23376;&#65292;&#24182;&#19988;&#20182;&#20204;&#20026;&#37027;&#20123;&#22312;&#24320;&#28304;&#19990;&#30028;&#32487;&#32493;&#20445;&#25345;&#27963;&#21160;&#30340;&#24320;&#21457;&#32773;&#25552;&#20379;&#20102;&#35757;&#32451;&#22330;&#22320;&#12290;</p><p>&#21478;&#19968;&#20010;&#21512;&#20316;&#24320;&#21457;&#30340;&#37325;&#38215;&#26159;<em class="firstterm">X Window 
System</em>&#65292;&#19968;&#20010;&#30001;MIT&#32852;&#21512;&#20854;&#20182;&#26377;&#20852;&#36259;&#20026;&#23458;&#25143;&#25552;&#20379;&#31383;&#21475;&#31995;&#32479;&#30340;&#30828;&#20214;&#21378;&#21830;&#22312;80&#24180;&#20195;&#20013;&#26399;&#24320;&#21457;&#30340;&#33258;&#30001;&#30340;&#32593;&#32476;&#36879;&#26126;&#30340;&#22270;&#24418;&#35745;&#31639;&#29615;&#22659;&#12290;&#21644;&#31169;&#26377;&#36719;&#20214;&#24688;&#24688;&#30456;&#21453;&#65292;X&#35768;&#21487;&#35777;&#25925;&#24847;&#20801;&#35768;&#22312;&#33258;&#30001;&#26680;&#24515;&#20043;&#19978;&#24314;&#31435;&#31169;&#26377;&#25193;&#23637;&#8212;&#27599;&#19968;&#20010;&#25104;&#21592;&#37117;&#38656;&#35201;&#26426;&#20250;&#21152;&#24378;&#40664;&#35748;&#30340;X&#21457;&#24067;&#65292;&#36825;&#26679;&#23601;&#20250;&#33719;&#24471;&#20102;&#36229;&#36234;&#20854;&#20182;&#25104;&#21592;&#30340;&#31454;&#20105;&#20248;&#21183;&#12290;X Windows<sup>[<a name="idp189" href="#ftn.idp189" class="footnote">6</a>]</sup>&#33258;&#36523;&#26159;&#33258;&#30001;&#36719;&#20214;&#65292;&#20294;&#20854;&#20027;&#35201;&#30446;&#30340;&#26159;&#20026;&#20102;&#24179;&#34913;&#21830;&#19994;&#21033;&#30410;&#31454;&#20105;&#20013;&#30340;&#24046;&#36317;&#65292;&#23545;&#32456;&#32467;&#31169;&#26377;&#36719;&#20214;&#30340;&#32479;&#27835;&#27809;&#26377;&#19997;&#27627;&#30340;&#35785;&#27714;&#12290;&#36824;&#26377;&#19968;&#20010;&#26089;&#20110;GNU&#39033;&#30446;&#24456;&#22810;&#24180;&#30340;&#20363;&#23376;&#26159;TeX&#65292;Donald Knuth&#30340;&#33258;&#30001;&#25490;&#29256;&#31995;&#32479;&#12290;&#20182;&#20351;&#29992;&#30340;&#35768;&#21487;&#35777;&#20801;&#35768;&#20219;&#20309;&#20154;&#20462;&#25913;&#21644;&#20998;&#21457;&#20195;&#30721;&#65292;&#20294;&#22914;&#26524;&#26410;&#33021;&#36890;&#36807;&#19968;&#20010;&#38750;&#24120;&#20005;&#26684;&#30340;&#20860;&#23481;&#24615;&#27979;&#35797;&#65292;&#21017;&#19981;&#20801;&#35768;&#20896;&#20197;"TeX"&#30340;&#21517;&#31216;&#65288;&#36825;&#26159;&#33258;&#30001;&#35768;&#21487;&#35777;&#30340;&#8220;&#21830;&#26631;&#20445;&#25252;&#8221;&#30340;&#19968;&#20010;&#20363;&#23376;&#65292;&#26356;&#22810;&#30340;&#35752;&#35770;&#22312;<a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#65289;&#12290;Knuth&#24182;&#38750;&#23545;&#36719;&#20214;&#24212;&#35813;&#26159;&#33258;&#30001;&#36824;&#26159;&#31169;&#26377;&#30340;&#38382;&#39064;&#26377;&#20160;&#20040;&#24847;&#35265;&#25110;&#26159;&#20854;&#20182;&#35832;&#22914;&#27492;&#31867;&#30340;&#30446;&#30340;&#65292;&#20182;&#38656;&#35201;&#19968;&#20010;&#26356;&#22909;&#30340;&#25490;&#29256;&#31995;&#32479;&#26159;&#20026;&#20102;&#23436;&#25104;&#20182;<span class="emphasis"><em>&#30495;&#27491;&#30340;</em></span>&#30446;&#26631;&#8212;&#19968;&#26412;&#35745;&#31639;&#26426;&#32534;&#31243;&#30340;&#20070;&#8212;&#24403;&#20070;&#23436;&#25104;&#20102;&#65292;&#27809;&#26377;&#29702;&#30001;&#19981;&#25226;&#20182;&#30340;&#31995;&#32479;&#20844;&#20043;&#20110;&#20247;&#12290;</p></div><p>&#34429;&#28982;&#27809;&#26377;&#21015;&#20986;&#27599;&#19968;&#20010;&#39033;&#30446;&#21644;&#27599;&#31181;&#35768;&#21487;&#35777;&#65292;&#20294;&#36824;&#26159;&#21487;&#20197;&#30830;&#20449;&#65292;&#22312;1980&#24180;&#20195;&#26411;&#65292;&#20986;&#29616;&#20102;&#35768;&#22810;&#22522;&#20110;&#21508;&#31867;&#35768;&#21487;&#35777;&#30340;&#39033;&#30446;&#12290;&#35768;&#21487;&#35777;&#30340;&#22810;&#26679;&#24615;&#21453;&#26144;&#20102;&#21160;&#26426;&#30340;&#22810;&#26679;&#24615;&#12290;&#21363;&#20351;&#26159;&#19968;&#20123;&#36873;&#25321;GNU GPL&#30340;&#31243;&#24207;&#21592;&#20063;&#27809;&#26377;&#21644;GNU&#39033;&#30446;&#21516;&#26679;&#24378;&#28872;&#30340;&#24847;&#35782;&#24418;&#24577;&#21160;&#26426;&#12290;&#23613;&#31649;&#20182;&#20204;&#24456;&#20139;&#21463;&#20026;&#33258;&#30001;&#36719;&#20214;&#24037;&#20316;&#65292;&#20294;&#26159;&#35768;&#22810;&#24320;&#21457;&#32773;&#24182;&#19981;&#25226;&#31169;&#26377;&#36719;&#20214;&#35270;&#20316;&#31038;&#20250;&#24694;&#39764;&#12290;&#30830;&#23454;&#26377;&#20123;&#20154;&#26159;&#21463;&#21040;&#36947;&#24503;&#20914;&#21160;&#30340;&#39537;&#20351;&#35201;&#21435;&#28040;&#28781;&#8220;&#22244;&#31215;&#36719;&#20214;&#8221;&#65288;&#26031;&#22612;&#23571;&#26364;&#23545;&#38750;&#33258;&#30001;&#36719;&#20214;&#30340;&#31216;&#21628;&#65289;&#30340;&#19990;&#30028;&#65292;&#20294;&#20854;&#20182;&#20154;&#26356;&#22810;&#30340;&#26159;&#20986;&#20110;&#23545;&#25216;&#26415;&#30340;&#29378;&#28909;&#65292;&#25110;&#23545;&#33021;&#21644;&#24535;&#21516;&#36947;&#21512;&#32773;&#21512;&#20316;&#24863;&#21040;&#24841;&#24742;&#65292;&#29978;&#33267;&#31616;&#21333;&#22320;&#20986;&#20110;&#20154;&#31867;&#23545;&#33635;&#32768;&#30340;&#28212;&#26395;&#12290;&#22823;&#20307;&#19978;&#35828;&#65292;&#36825;&#20123;&#19981;&#21516;&#30340;&#21160;&#26426;&#24182;&#27809;&#26377;&#36896;&#25104;&#20914;&#31361;&#12290;&#37096;&#20998;&#21407;&#22240;&#26159;&#21644;&#20854;&#20182;&#30340;&#21019;&#36896;&#24615;&#27963;&#21160;&#22914;&#25955;&#25991;&#21644;&#35270;&#35273;&#33402;&#26415;&#19981;&#21516;&#65292;&#36719;&#20214;&#24517;&#39035;&#36890;&#36807;&#21322;&#23458;&#35266;&#27979;&#35797;&#25165;&#33021;&#25104;&#21151;&#65306;&#23427;&#24517;&#39035;&#33021;&#36816;&#34892;&#65292;&#21435;&#38500;&#32477;&#22823;&#37096;&#20998;&#30340;bug&#12290;&#36825;&#33258;&#21160;&#22320;&#32473;&#20102;&#19968;&#20010;&#39033;&#30446;&#30340;&#20840;&#37096;&#21442;&#19982;&#32773;&#19968;&#20010;&#20849;&#21516;&#30340;&#32972;&#26223;&#65292;&#19968;&#20010;&#29702;&#30001;&#65292;&#19968;&#20010;&#26080;&#38656;&#20026;&#38500;&#20102;&#25216;&#26415;&#20197;&#22806;&#30340;&#38382;&#39064;&#25285;&#24515;&#30340;&#21327;&#21516;&#24037;&#20316;&#30340;&#26694;&#26550;&#12290;</p><p>&#24320;&#21457;&#32773;&#20204;&#36824;&#26377;&#21478;&#19968;&#20010;&#22242;&#32467;&#20114;&#21161;&#30340;&#21407;&#22240;&#65306;&#33258;&#30001;&#36719;&#20214;&#19990;&#30028;&#29983;&#20135;&#20102;&#24456;&#22810;&#36136;&#37327;&#38750;&#24120;&#39640;&#30340;&#20195;&#30721;&#12290;&#35201;&#20040;&#26159;&#20196;&#26368;&#25509;&#36817;&#30340;&#38750;&#33258;&#30001;&#23545;&#25163;&#37117;&#26395;&#23576;&#33707;&#21450;&#65292;&#35201;&#20040;&#26159;&#21487;&#20197;&#21305;&#25932;&#65292;&#25110;&#33267;&#23569;&#20215;&#24265;&#29289;&#32654;&#12290;&#34429;&#28982;&#20063;&#35768;&#20250;&#26377;&#19968;&#20123;&#20154;&#26159;&#20986;&#20110;&#20005;&#26684;&#30340;&#24847;&#35782;&#24418;&#24577;&#30340;&#32972;&#26223;&#25165;&#20351;&#29992;&#33258;&#30001;&#36719;&#20214;&#65292;&#20294;&#32477;&#22823;&#37096;&#20998;&#20154;&#26159;&#22240;&#20026;&#23427;&#26356;&#20986;&#33394;&#25165;&#20351;&#29992;&#33258;&#30001;&#36719;&#20214;&#30340;&#12290;&#22312;&#36825;&#20123;&#20154;&#20013;&#65292;&#24635;&#26377;&#19968;&#23450;&#27604;&#20363;&#30340;&#20154;&#20048;&#24847;&#23558;&#33258;&#24049;&#30340;&#26102;&#38388;&#21644;&#25216;&#26415;&#36129;&#29486;&#20986;&#26469;&#24110;&#21161;&#32500;&#25252;&#21644;&#25913;&#36827;&#36719;&#20214;&#12290;</p><p>&#36825;&#31181;&#20135;&#20986;&#20248;&#31168;&#20195;&#30721;&#30340;&#36235;&#21183;&#24182;&#38750;&#26159;&#26222;&#36941;&#30340;&#65292;&#20294;&#22312;&#20840;&#29699;&#30340;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20986;&#29616;&#30340;&#39057;&#29575;&#36234;&#26469;&#36234;&#39640;&#12290;&#36825;&#24341;&#36215;&#39640;&#24230;&#20381;&#36182;&#36719;&#20214;&#36136;&#37327;&#30340;&#21830;&#19994;&#20844;&#21496;&#30340;&#20851;&#27880;&#12290;&#20854;&#20013;&#30340;&#35768;&#22810;&#21457;&#35273;&#20182;&#20204;&#20854;&#23454;&#26089;&#24050;&#32463;&#22312;&#26085;&#24120;&#30340;&#25805;&#20316;&#20013;&#20351;&#29992;&#33258;&#30001;&#36719;&#20214;&#65292;&#21482;&#26159;&#24182;&#27809;&#26377;&#24847;&#35782;&#21040;&#65288;&#31649;&#29702;&#23618;&#24182;&#19981;&#24635;&#26159;&#33021;&#24847;&#35782;&#21040;IT&#37096;&#38376;&#20570;&#30340;&#27599;&#20214;&#20107;&#65289;&#12290;&#20844;&#21496;&#24320;&#22987;&#22312;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#25198;&#28436;&#36234;&#26469;&#27963;&#36291;&#21644;&#20844;&#24320;&#30340;&#35282;&#33394;&#65292;&#20182;&#20204;&#21521;&#33258;&#30001;&#36719;&#20214;&#30340;&#21457;&#23637;&#25424;&#21161;&#26102;&#38388;&#21644;&#35774;&#22791;&#65292;&#26377;&#26102;&#29978;&#33267;&#26159;&#30452;&#25509;&#30340;&#36164;&#21161;&#12290;&#22312;&#26368;&#22909;&#30340;&#24773;&#24418;&#19979;&#65292;&#36825;&#20123;&#25237;&#36164;&#33021;&#33719;&#24471;&#25968;&#20493;&#30340;&#22238;&#25253;&#12290;&#36825;&#20123;&#36190;&#21161;&#21830;&#21482;&#38656;&#35201;&#20026;&#23569;&#25968;&#20840;&#32844;&#25237;&#20837;&#30340;&#19987;&#23478;&#32423;&#31243;&#24207;&#21592;&#25903;&#20184;&#24037;&#36164;&#65292;&#33719;&#24471;&#30340;&#22238;&#25253;&#21364;&#21253;&#25324;&#20102;&#26080;&#20607;&#30340;&#24535;&#24895;&#32773;&#21644;&#39046;&#21462;&#20854;&#20182;&#20844;&#21496;&#34218;&#27700;&#30340;&#31243;&#24207;&#21592;&#30340;<span class="emphasis"><em>&#20840;&#37096;</em></span>&#24037;&#20316;&#25104;&#26524;&#12290;</p></div><div class="sect2" title="&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;"><div class="titlepage"><div><div><h3 class="title"><a name="free-vs-open-source"></a>&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;</h3></div></div></div><p>&#38543;&#30528;&#21830;&#19994;&#19990;&#30028;&#36234;&#26469;&#36234;&#22810;&#30340;&#20851;&#27880;&#33258;&#30001;&#36719;&#20214;&#65292;&#31243;&#24207;&#21592;&#20204;&#38754;&#20020;&#26032;&#20986;&#29616;&#30340;&#38382;&#39064;&#12290;&#39318;&#20808;&#26159;&#21333;&#35789;&#8220;&#33258;&#30001;&#8221;&#26412;&#36523;&#12290;&#31532;&#19968;&#27425;&#21548;&#35828;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#65288;free software&#65292;&#22312;&#33521;&#35821;&#20013;free&#26082;&#26377;&#33258;&#30001;&#30340;&#24847;&#24605;&#65292;&#20063;&#26377;&#20813;&#36153;&#30340;&#24847;&#24605;&#65289;&#36825;&#20010;&#35789;&#30340;&#26102;&#20505;&#65292;&#35768;&#22810;&#20154;&#37117;&#38169;&#25226;&#23427;&#29702;&#35299;&#25104;&#8220;&#20813;&#36153;&#36719;&#20214;&#8221;&#12290;&#30830;&#23454;&#22823;&#37096;&#20998;&#30340;&#33258;&#30001;&#36719;&#20214;&#37117;&#26159;&#20813;&#36153;&#30340;&#65292;<sup>[<a name="idp200" href="#ftn.idp200" class="footnote">7</a>]</sup>
&#20294;&#19981;&#26159;&#25152;&#26377;&#30340;&#20813;&#36153;&#36719;&#20214;&#37117;&#26159;&#33258;&#30001;&#30340;&#12290;&#20363;&#22914;&#22312;1990&#24180;&#20195;&#30340;&#27983;&#35272;&#22120;&#22823;&#25112;&#20013;&#65292;&#20026;&#20102;&#25250;&#21344;&#24066;&#22330;&#20221;&#39069;&#65292;&#32593;&#26223;&#21644;&#24494;&#36719;&#37117;&#26080;&#20607;&#22320;&#21457;&#24067;&#20182;&#20204;&#30340;&#32593;&#32476;&#27983;&#35272;&#22120;&#12290;&#36825;&#20123;&#27983;&#35272;&#22120;&#37117;&#19981;&#26159;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#12290;&#20320;&#26080;&#27861;&#24471;&#21040;&#28304;&#20195;&#30721;&#65292;&#21363;&#20351;&#24471;&#21040;&#20102;&#20063;&#27809;&#26377;&#26435;&#21033;&#20462;&#25913;&#21644;&#20877;&#21457;&#24067;&#12290;<sup>[<a name="idp202" href="#ftn.idp202" class="footnote">8</a>]</sup>&#20320;&#21807;&#19968;&#33021;&#20570;&#30340;&#26159;&#19979;&#36733;&#19968;&#20010;&#36816;&#34892;&#25991;&#20214;&#65292;&#28982;&#21518;&#36816;&#34892;&#12290;&#36825;&#20123;&#27983;&#35272;&#22120;&#30340;&#33258;&#30001;&#19981;&#20250;&#27604;&#20174;&#21830;&#24215;&#37324;&#36141;&#20080;&#30340;&#30418;&#35013;&#36719;&#20214;&#26356;&#22810;&#65307;&#23427;&#20204;&#21482;&#26159;&#26377;&#36739;&#20302;&#30340;&#20215;&#26684;&#12290;</p><p>&#22260;&#32469;&#33258;&#30001;&#19968;&#35789;&#21457;&#29983;&#30340;&#28151;&#20081;&#65292;&#24456;&#19981;&#24184;&#22320;&#23436;&#20840;&#26159;&#30001;&#20110;&#33521;&#35821;&#26412;&#36523;&#30340;&#22810;&#20041;&#24615;&#36896;&#25104;&#30340;&#12290;&#22823;&#37096;&#20998;&#30340;&#20854;&#20182;&#35821;&#31181;&#23545;&#8220;&#20813;&#36153;&#8221;&#21644;&#8220;&#33258;&#30001;&#8221;&#26126;&#30830;&#22320;&#21306;&#21035;&#23545;&#24453;&#65288;&#20363;&#22914;&#22312;&#32599;&#26364;&#26031;&#35821;&#20013;<span class="emphasis"><em>gratis</em></span>&#21644;<span class="emphasis"><em>libre</em></span>&#30340;&#24046;&#21035;&#23545;&#21548;&#20247;&#32780;&#35328;&#26159;&#19968;&#28165;&#20108;&#26970;&#30340;&#65289;&#12290;&#20294;&#33521;&#35821;&#26159;&#20114;&#32852;&#32593;&#20107;&#23454;&#19978;&#30340;&#26725;&#26753;&#35821;&#35328;&#65292;&#25152;&#20197;&#19968;&#20010;&#33521;&#35821;&#30340;&#38382;&#39064;&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#26469;&#35828;&#21363;&#26159;&#27599;&#20010;&#20154;&#30340;&#38382;&#39064;&#12290;&#22260;&#32469;&#33258;&#30001;&#19968;&#35789;&#30340;&#35823;&#35299;&#26159;&#22914;&#27492;&#20043;&#24191;&#65292;&#20197;&#33267;&#20110;&#26368;&#32456;&#33258;&#30001;&#36719;&#20214;&#31243;&#24207;&#21592;&#20204;&#21457;&#26126;&#20102;&#19968;&#20010;&#20844;&#24335;&#26469;&#24212;&#23545;&#65306;&#8220;It's <span class="emphasis"><em>free</em></span> as in
<span class="emphasis"><em>freedom</em></span>&#8212;think <span class="emphasis"><em>free
speech</em></span>, not <span class="emphasis"><em>free beer</em></span>&#12290;&#8221;&#20294;&#19968;&#36941;&#21448;&#19968;&#36941;&#30340;&#35299;&#37322;&#36824;&#26159;&#35753;&#20154;&#21388;&#20518;&#12290;&#35768;&#22810;&#31243;&#24207;&#21592;&#35748;&#20026;&#65292;&#21363;&#20351;&#21152;&#20197;&#35299;&#37322;&#65292;&#23545;&#33258;&#30001;&#30340;&#23696;&#20041;&#27491;&#22312;&#38459;&#30861;&#20844;&#20247;&#23545;&#36825;&#31181;&#36719;&#20214;&#30340;&#29702;&#35299;&#12290;</p><p>&#20294;&#23454;&#38469;&#30340;&#38382;&#39064;&#26356;&#22797;&#26434;&#12290;free&#19968;&#35789;&#25215;&#36733;&#20102;&#19968;&#20010;&#26080;&#21487;&#36991;&#20813;&#30340;&#36947;&#24503;&#20869;&#28085;&#65306;&#22914;&#26524;&#33258;&#30001;&#26159;&#23427;&#33258;&#36523;&#30340;&#26368;&#32456;&#30446;&#26631;&#65292;&#23427;&#21516;&#33258;&#30001;&#36719;&#20214;&#26159;&#21542;&#34987;&#26356;&#22810;&#20154;&#25509;&#21463;&#65292;&#26159;&#21542;&#33021;&#20174;&#21830;&#19994;&#20013;&#36186;&#21462;&#26356;&#22810;&#30340;&#21033;&#30410;&#26080;&#20851;&#12290;&#36825;&#20010;&#21160;&#26426;&#21807;&#19968;&#30340;&#20809;&#26126;&#38754;&#20174;&#26681;&#26412;&#19978;&#35828;&#26082;&#19981;&#26159;&#25216;&#26415;&#20063;&#19981;&#26159;&#21830;&#19994;&#65292;&#32780;&#26159;&#36947;&#20041;&#12290;&#27492;&#22806;&#65292;&#8220;free as in freedom&#8221;&#30340;&#23450;&#20301;&#20063;&#36843;&#20351;&#37027;&#20123;&#26082;&#24819;&#22312;&#29983;&#24847;&#30340;&#26576;&#19968;&#26041;&#38754;&#25903;&#25345;&#23454;&#29992;&#30340;&#33258;&#30001;&#31243;&#24207;&#65292;&#32780;&#21478;&#19968;&#26041;&#38754;&#21448;&#32487;&#32493;&#25512;&#38144;&#31169;&#26377;&#36719;&#20214;&#30340;&#20844;&#21496;&#38519;&#20837;&#21069;&#21518;&#30683;&#30462;&#30340;&#22659;&#22320;&#12290;</p><p>&#26412;&#24050;&#38519;&#20837;&#36523;&#20221;&#21361;&#26426;&#30340;&#31038;&#21306;&#21448;&#36814;&#26469;&#20102;&#36825;&#20123;&#22256;&#22659;&#12290;&#22914;&#26524;&#35828;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#26377;&#19968;&#20010;&#24635;&#20307;&#30446;&#26631;&#30340;&#35805;&#65292;&#37027;&#20123;&#23454;&#38469;&#19978;&#20889;&#33258;&#30001;&#36719;&#20214;&#30340;&#31243;&#24207;&#21592;&#20204;&#24182;&#19981;&#37117;&#20026;&#20102;&#21516;&#19968;&#20010;&#30446;&#26631;&#32780;&#24037;&#20316;&#12290;&#29978;&#33267;&#20110;&#20174;&#19968;&#20010;&#26497;&#31471;&#36208;&#21521;&#21478;&#22806;&#19968;&#20010;&#26497;&#31471;&#30340;&#35266;&#28857;&#20250;&#24341;&#36215;&#35823;&#35299;&#65292;&#22240;&#20026;&#25105;&#20204;&#20250;&#38169;&#35823;&#22320;&#20197;&#20026;&#21482;&#26377;&#20004;&#31181;&#26497;&#31471;&#30340;&#35266;&#28857;&#65292;&#32780;&#23454;&#38469;&#19978;&#23384;&#22312;&#30528;&#22810;&#23618;&#27425;&#30340;&#30475;&#27861;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#25105;&#20204;&#24573;&#30053;&#20854;&#38388;&#30340;&#32454;&#24494;&#24046;&#21035;&#65292;&#20182;&#20204;&#37117;&#21487;&#20197;&#34987;&#24402;&#20837;&#20004;&#31867;&#20449;&#24565;&#12290;&#19968;&#20010;&#22242;&#20307;&#36861;&#38543;&#26031;&#22612;&#23571;&#26364;&#30340;&#35266;&#28857;&#65292;&#35748;&#20026;&#20849;&#20139;&#21644;&#20462;&#25913;&#30340;&#33258;&#30001;&#26159;&#26368;&#35201;&#30340;&#20107;&#65292;&#22240;&#27492;&#22914;&#26524;&#20320;&#19981;&#20877;&#35848;&#35770;&#33258;&#30001;&#65292;&#20320;&#23601;&#24573;&#30053;&#20102;&#26680;&#24515;&#38382;&#39064;&#12290;&#21478;&#19968;&#20123;&#20154;&#35748;&#20026;&#36719;&#20214;&#26412;&#36523;&#25165;&#26159;&#26368;&#37325;&#35201;&#30340;&#22240;&#32032;&#65292;&#24182;&#19988;&#23545;&#20844;&#24320;&#22320;&#23459;&#24067;&#31169;&#26377;&#36719;&#20214;&#26412;&#36136;&#19978;&#26159;&#22351;&#30340;&#32780;&#24863;&#21040;&#19981;&#33298;&#26381;&#12290;&#37096;&#20998;&#30340;&#65292;&#20294;&#38750;&#20840;&#37096;&#33258;&#30001;&#36719;&#20214;&#31243;&#24207;&#21592;&#30456;&#20449;&#20316;&#32773;&#65288;&#25110;&#26159;&#38599;&#20027;&#65292;&#22914;&#26524;&#26159;&#26377;&#20607;&#24037;&#20316;&#65289;<span class="emphasis"><em>&#24212;&#35813;</em></span>&#26377;&#26435;&#21033;&#25511;&#21046;&#20998;&#21457;&#30340;&#26465;&#27454;&#65292;&#36873;&#25321;&#20309;&#31181;&#26465;&#27454;&#19981;&#24212;&#35813;&#21463;&#21040;&#36947;&#24503;&#30340;&#23457;&#38382;&#12290;</p><p>&#22312;&#24456;&#38271;&#26102;&#38388;&#37324;&#36825;&#20123;&#20998;&#27495;&#24182;&#19981;&#38656;&#35201;&#35748;&#30495;&#23545;&#24453;&#65292;&#20294;&#33258;&#30001;&#36719;&#20214;&#22312;&#21830;&#19994;&#19990;&#30028;&#37324;&#30340;&#24555;&#36895;&#25104;&#21151;&#20351;&#24471;&#36825;&#20123;&#38382;&#39064;&#26080;&#27861;&#20877;&#22238;&#36991;&#12290;1998&#24180;&#19968;&#32676;&#31243;&#24207;&#21592;&#32467;&#25104;&#19968;&#20010;&#22242;&#20307;&#65292;&#20063;&#23601;&#26159;&#21518;&#26469;&#30340;&#24320;&#28304;&#20419;&#36827;&#20250;&#65288;Open Source Initiative&#65292;OSI&#65289;<sup>[<a name="idp217" href="#ftn.idp217" class="footnote">9</a>]</sup>&#21019;&#36896;&#20102;&#24320;&#28304;&#19968;&#35789;&#26469;&#26367;&#20195;&#8220;&#33258;&#30001;&#8221;&#12290;OSI&#35748;&#20026;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#19981;&#20165;&#26377;&#28508;&#22312;&#30340;&#23696;&#20041;&#65292;&#32780;&#19988;&#8220;&#33258;&#30001;&#8221;&#19968;&#35789;&#26412;&#36523;&#23601;&#26159;&#19968;&#31995;&#21015;&#38382;&#39064;&#30340;&#26681;&#28304;&#12290;&#36816;&#21160;&#26412;&#36523;&#38656;&#35201;&#19968;&#20010;&#22312;&#21830;&#19994;&#19990;&#30028;&#37324;&#30340;&#33829;&#38144;&#31243;&#24207;&#65292;&#32780;&#35848;&#35770;&#36947;&#24503;&#21644;&#31038;&#20250;&#20844;&#30410;&#22312;&#20844;&#21496;&#33891;&#20107;&#20250;&#37324;&#26159;&#19981;&#21463;&#27426;&#36814;&#30340;&#12290;&#29992;&#20182;&#20204;&#33258;&#24049;&#30340;&#35805;&#35828;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#24320;&#28304;&#23459;&#35328;&#26159;&#33258;&#30001;&#36719;&#20214;&#30340;&#19968;&#20010;&#33829;&#38144;&#31243;&#24207;&#12290;&#29992;&#21153;&#23454;&#30340;&#22522;&#30784;&#25512;&#21160;&#33258;&#30001;&#36719;&#20214;&#36828;&#27604;&#24951;&#24936;&#28608;&#26114;&#22823;&#35848;&#29702;&#24819;&#26377;&#29992;&#24471;&#22810;&#12290;&#25104;&#21151;&#30340;&#26412;&#36136;&#27809;&#26377;&#21464;&#65292;&#22833;&#36133;&#30340;&#35937;&#24449;&#21644;&#30475;&#27861;&#24050;&#32463;&#21464;&#20102;&#12290; ...</em></span></p><p><span class="emphasis"><em>&#38656;&#35201;&#21578;&#30693;&#22823;&#22810;&#25968;&#25216;&#26415;&#20154;&#30340;&#19981;&#26159;&#24320;&#28304;&#30340;&#27010;&#24565;&#65292;&#32780;&#26159;&#21517;&#23383;&#12290;&#20026;&#20160;&#20040;&#25105;&#20204;&#19981;&#20877;&#20687;&#20174;&#21069;&#37027;&#26679;&#31216;&#20043;&#20026;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#21602;&#65311;</em></span></p><p><span class="emphasis"><em>&#19968;&#20010;&#30452;&#25509;&#30340;&#21407;&#22240;&#26159;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#19968;&#35789;&#23481;&#26131;&#20197;&#19968;&#31181;&#23548;&#33268;&#20914;&#31361;&#30340;&#26041;&#24335;&#34987;&#35823;&#35299;&#12290; ...</em></span></p><p><span class="emphasis"><em>&#20294;&#30495;&#27491;&#26356;&#21517;&#30340;&#21407;&#22240;&#26159;&#33829;&#38144;&#19978;&#30340;&#12290;&#25105;&#20204;&#29616;&#22312;&#24819;&#25171;&#20837;&#21830;&#19994;&#19990;&#30028;&#12290;&#25105;&#20204;&#26377;&#25104;&#21151;&#30340;&#20135;&#21697;&#65292;&#20294;&#22312;&#36807;&#21435;&#25105;&#20204;&#30340;&#23450;&#20301;&#26159;&#21487;&#24597;&#30340;&#12290;&#33258;&#30001;&#36719;&#20214;&#19968;&#35789;&#34987;&#21830;&#20154;&#20204;&#35823;&#35299;&#20102;&#65292;&#20182;&#20204;&#25226;&#36825;&#31181;&#25551;&#36848;&#29702;&#35299;&#25104;&#21453;&#21830;&#19994;&#20027;&#20041;&#65292;&#29978;&#33267;&#26356;&#31967;&#65292;&#36156;&#12290;</em></span></p><p><span class="emphasis"><em>&#20027;&#27969;&#20844;&#21496;&#30340;CEO&#21644;CTO&#20204;&#32477;&#19981;&#20250;&#20080;"&#33258;&#30001;&#36719;&#20214;"&#12290;&#20294;&#22914;&#26524;&#25105;&#20204;&#20445;&#25345;&#38750;&#24120;&#30456;&#20284;&#30340;&#20256;&#32479;&#65292;&#20154;&#36824;&#26159;&#37027;&#20123;&#65292;&#30456;&#21516;&#30340;&#33258;&#30001;&#36719;&#20214;&#35768;&#21487;&#35777;&#65292;&#21482;&#26159;&#25442;&#20102;&#19968;&#20010;&#8220;&#24320;&#28304;&#8221;&#26631;&#31614;&#30340;&#35805;&#65311;&#20182;&#20204;&#20250;&#20080;&#12290;</em></span></p><p><span class="emphasis"><em>&#19968;&#20123;&#40657;&#23458;&#35273;&#24471;&#36825;&#24456;&#38590;&#30456;&#20449;&#65292;&#20294;&#37027;&#26159;&#22240;&#20026;&#20182;&#20204;&#30340;&#25216;&#26415;&#21270;&#24605;&#32500;&#24050;&#32463;&#20725;&#21270;&#65292;&#34987;&#26465;&#27454;&#25152;&#26463;&#32538;&#65292;&#19981;&#33021;&#29702;&#35299;&#24403;&#20320;&#25512;&#38144;&#26576;&#26679;&#19996;&#35199;&#26102;&#24418;&#35937;&#26377;&#22810;&#37325;&#35201;&#12290;</em></span></p><p><span class="emphasis"><em>&#20570;&#33829;&#38144;&#26102;&#65292;&#22806;&#34920;&#26159;&#24456;&#29616;&#23454;&#30340;&#38382;&#39064;&#12290;&#25105;&#20204;&#25171;&#31639;&#29992;&#20160;&#20040;&#26679;&#30340;&#24418;&#35937;&#26469;&#28040;&#38500;&#21516;&#20844;&#21496;&#25171;&#20132;&#36947;&#30340;&#38556;&#30861;&#65292;&#21644;&#25105;&#20204;&#30340;&#34892;&#20026;&#65292;&#25105;&#20204;&#30340;&#20449;&#24565;&#65292;&#25105;&#20204;&#30340;&#36719;&#20214;&#21516;&#26679;&#37325;&#35201;&#12290;</em></span></p><p>&#65288;&#26469;&#33258;<span class="bold"><strong><a class="ulink" href="http://opensource.feratech.com/advocacy/faq.php" target="_top">http://opensource.feratech.com/advocacy/faq.php</a></strong></span>&#21644;<span class="bold"><strong><a class="ulink" href="http://opensource.feratech.com/advocacy/case_for_hackers.php#marketing" target="_top">http://opensource.feratech.com/advocacy/case_for_hackers.php#marketing</a></strong></span>&#65289;</p></blockquote></div><p>&#36890;&#36807;&#19978;&#38754;&#30340;&#25991;&#23383;&#25105;&#20204;&#21487;&#20197;&#19968;&#31397;&#20105;&#35770;&#30340;&#20912;&#23665;&#19968;&#35282;&#12290;&#23427;&#25552;&#21040;&#20102;&#8220;&#25105;&#20204;&#30340;&#20449;&#24565;&#8221;&#65292;&#20294;&#26159;&#24039;&#22937;&#22320;&#22238;&#36991;&#20102;&#36825;&#20123;&#20449;&#24565;&#21040;&#24213;&#26159;&#20160;&#20040;&#12290;&#23545;&#26377;&#20123;&#20154;&#21602;&#65292;&#36825;&#31181;&#20449;&#24565;&#20063;&#35768;&#26159;&#35748;&#20026;&#24320;&#25918;&#30340;&#24320;&#21457;&#36807;&#31243;&#23558;&#20135;&#20986;&#26356;&#22909;&#30340;&#20195;&#30721;&#65292;&#23545;&#20854;&#20182;&#20154;&#20063;&#35768;&#26159;&#35748;&#20026;&#25152;&#26377;&#30340;&#20449;&#24687;&#37117;&#24212;&#35813;&#20849;&#20139;&#12290;&#20182;&#20204;&#29992;&#21040;&#20102;&#8220;&#36156;&#8221;&#19968;&#35789;&#65288;&#25454;&#25512;&#27979;&#26159;&#65289;&#24433;&#23556;&#38750;&#27861;&#30340;&#22797;&#21046;&#8212;&#35768;&#22810;&#20154;&#21453;&#23545;&#36825;&#19968;&#28857;&#65292;&#35748;&#20026;&#22914;&#26524;&#21407;&#25345;&#26377;&#20154;&#38543;&#21518;&#20173;&#28982;&#20445;&#30041;&#21407;&#20214;&#23601;&#19981;&#33021;&#35270;&#20316;&#36156;&#12290;&#36825;&#37324;&#26377;&#19968;&#20010;&#26126;&#26174;&#30340;&#26263;&#31034;&#35828;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#34987;&#38169;&#35823;&#22320;&#21010;&#20837;&#20102;&#21453;&#21830;&#19994;&#20027;&#20041;&#65292;&#20294;&#23427;&#23567;&#24515;&#32764;&#32764;&#22320;&#22238;&#36991;&#20102;&#36825;&#31181;&#24402;&#31867;&#26159;&#21542;&#26377;&#29616;&#23454;&#20381;&#25454;&#30340;&#38382;&#39064;&#12290;</p><p>&#20854;&#20013;&#27809;&#26377;&#19968;&#26465;&#21487;&#20197;&#35828;&#26126;OSI&#30340;&#32593;&#31449;&#26159;&#33258;&#30456;&#30683;&#30462;&#25110;&#26159;&#35823;&#23548;&#30340;&#12290;&#30830;&#23454;&#27809;&#26377;&#12290;&#30456;&#21453;&#65292;&#36825;&#20010;&#20363;&#23376;&#34920;&#26126;&#20102;OSI&#25152;&#20027;&#24352;&#30340;&#65292;&#27491;&#26159;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#25152;&#32570;&#23569;&#30340;&#65292;&#20063;&#23601;&#26159;&#22909;&#30340;&#33829;&#38144;&#65292;&#27492;&#22788;&#30340;&#8220;&#22909;&#8221;&#25351;&#30340;&#26159;&#8220;&#33021;&#22312;&#21830;&#19994;&#19990;&#30028;&#29983;&#23384;&#8221;&#12290;&#24320;&#28304;&#23459;&#35328;&#32473;&#35768;&#22810;&#20154;&#24102;&#26469;&#20182;&#20204;&#19968;&#30452;&#23547;&#25214;&#30340;&#8212;&#19968;&#22871;&#23558;&#33258;&#30001;&#36719;&#20214;&#20316;&#20026;&#24320;&#21457;&#30340;&#26041;&#27861;&#35770;&#21644;&#21830;&#19994;&#31574;&#30053;&#32780;&#19981;&#26159;&#36947;&#24503;&#22307;&#25112;&#30340;&#35821;&#27719;&#12290;</p></div><p>&#24320;&#28304;&#20419;&#36827;&#20250;&#30340;&#20986;&#29616;&#25913;&#21464;&#20102;&#33258;&#30001;&#36719;&#20214;&#30340;&#38754;&#35980;&#12290;&#23427;&#23558;&#38271;&#20037;&#23384;&#22312;&#30340;&#30683;&#30462;&#25670;&#19978;&#20102;&#26700;&#38754;&#65292;&#36843;&#20351;&#36816;&#21160;&#25215;&#35748;&#19982;&#22806;&#37096;&#19968;&#26679;&#65292;&#20854;&#33258;&#36523;&#20869;&#37096;&#21516;&#26679;&#26377;&#27966;&#31995;&#26007;&#20105;&#12290;&#30001;&#20110;&#22823;&#37096;&#20998;&#30340;&#39033;&#30446;&#37117;&#21253;&#25324;&#20102;&#26469;&#33258;&#20004;&#20010;&#38453;&#33829;&#30340;&#31243;&#24207;&#21592;&#65292;&#21152;&#19978;&#19968;&#20123;&#24456;&#38590;&#26126;&#30830;&#24402;&#31867;&#30340;&#21442;&#19982;&#32773;&#65292;&#22914;&#20170;&#20108;&#32773;&#37117;&#24050;&#32463;&#25214;&#21040;&#20102;&#20849;&#21516;&#30340;&#22522;&#30784;&#12290;&#36825;&#19981;&#24847;&#21619;&#30528;&#20154;&#20204;&#20174;&#19981;&#35848;&#35770;&#36947;&#24503;&#21160;&#26426;&#8212;&#20363;&#22914;&#65292;&#26377;&#26102;&#20154;&#20204;&#20250;&#35752;&#35770;&#20256;&#32479;&#30340;&#8220;&#40657;&#23458;&#31934;&#31070;&#8221;&#30340;&#27969;&#22833;&#30340;&#38382;&#39064;&#12290;&#20294;&#26159;&#24456;&#23569;&#26377;&#33258;&#30001;&#36719;&#20214;/&#24320;&#28304;&#24320;&#21457;&#32773;&#22312;&#19968;&#20010;&#39033;&#30446;&#20013;&#20844;&#24320;&#22320;&#36136;&#30097;&#20182;&#20154;&#30340;&#22522;&#26412;&#21160;&#26426;&#12290;&#20316;&#20986;&#36129;&#29486;&#36828;&#27604;&#36129;&#29486;&#32773;&#26412;&#36523;&#37325;&#35201;&#12290;&#22914;&#26524;&#26377;&#20154;&#20195;&#30721;&#20889;&#30340;&#19981;&#38169;&#65292;&#20320;&#19981;&#20250;&#38382;&#20182;&#20204;&#21040;&#24213;&#26159;&#20986;&#20110;&#36947;&#24503;&#21407;&#22240;&#36824;&#26159;&#22240;&#20026;&#38599;&#20027;&#20184;&#32473;&#20182;&#20204;&#24037;&#36164;&#25110;&#26159;&#20026;&#20102;&#22312;&#25512;&#33616;&#20449;&#19978;&#28155;&#21152;&#30749;&#30721;&#65292;&#25110;&#20854;&#20182;&#20160;&#20040;&#21407;&#22240;&#12290;&#20320;&#20174;&#25216;&#26415;&#35282;&#24230;&#35780;&#20272;&#36129;&#29486;&#65292;&#20174;&#25216;&#26415;&#35282;&#24230;&#21453;&#39304;&#12290;&#29978;&#33267;Debian&#36825;&#26679;&#27627;&#19981;&#35763;&#35328;&#25919;&#27835;&#30340;&#32452;&#32455;&#65288;&#20182;&#20204;&#30340;&#30446;&#26631;&#26159;&#25552;&#20379;&#19968;&#20010;100%&#33258;&#30001;&#30340;&#25805;&#20316;&#29615;&#22659;&#65289;&#65292;&#20063;&#24050;&#32463;&#19981;&#20877;&#37027;&#20040;&#20005;&#26684;&#30340;&#23545;&#24453;&#38598;&#25104;&#38750;&#33258;&#30001;&#20195;&#30721;&#21644;&#21516;&#30446;&#26631;&#19981;&#19968;&#33268;&#30340;&#31243;&#24207;&#21592;&#20849;&#20107;&#20102;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp121" href="#idp121" class="para">2</a>] </sup>SourceForge.net&#65292;&#19968;&#20010;&#33879;&#21517;&#30340;&#20195;&#30721;&#23384;&#25918;&#31449;&#28857;&#65292;&#25130;&#33267;&#21040;2004&#24180;4&#26376;&#20013;&#26092;&#65292;&#24635;&#20849;&#26377;79225&#20010;&#39033;&#30446;&#27880;&#20876;&#12290;&#34429;&#28982;&#36825;&#21482;&#26159;&#36873;&#25321;&#20351;&#29992;SourceForge&#30340;&#39033;&#30446;&#25968;&#37327;&#65292;&#20294;&#24050;&#32463;&#38750;&#24120;&#25509;&#36817;&#20114;&#32852;&#32593;&#19978;&#20840;&#37096;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#25968;&#37327;&#20102;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp154" href="#idp154" class="para">3</a>] </sup>&#26031;&#22612;&#23571;&#26364;&#30340;&#8220;&#40657;&#23458;&#8221;&#25351;&#30340;&#26159;&#8220;&#21916;&#27426;&#31243;&#24207;&#24182;&#19988;&#21916;&#27426;&#29992;&#23427;&#28843;&#32768;&#32874;&#26126;&#30340;&#20154;&#8221;&#65292;&#19981;&#26159;&#36817;&#20123;&#24180;&#26469;&#30340;&#26032;&#21547;&#20041;&#8220;&#38750;&#27861;&#36827;&#20837;&#35745;&#31639;&#26426;&#30340;&#20154;&#12290;&#8221;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp170" href="#idp170" class="para">4</a>] </sup>&#8220;GNU's Not Unix&#8221;&#30340;&#32553;&#20889;&#65292;&#25193;&#23637;&#21518;&#30701;&#35821;&#20013;&#30340;GNU&#20854;&#23454;&#26159;&#21516;&#19968;&#24847;&#24605;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp177" href="#idp177" class="para">5</a>] </sup>&#20174;&#25216;&#26415;&#19978;&#26469;&#35828;Linux&#19981;&#26159;&#31532;&#19968;&#20010;&#12290;&#22312;Linux&#20043;&#21069;&#19981;&#20037;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#33021;&#22312;IBM&#20860;&#23481;&#26426;&#19978;&#36816;&#34892;&#30340;&#33258;&#30001;&#25805;&#20316;&#31995;&#32479;&#65292;386BSD&#12290;&#28982;&#32780;386BSD&#30340;&#21551;&#21160;&#21644;&#36816;&#34892;&#36824;&#19981;&#22826;&#31283;&#23450;&#12290;Linux&#30340;&#39134;&#36895;&#21457;&#23637;&#19981;&#20165;&#22240;&#20026;&#23427;&#26159;&#33258;&#30001;&#36719;&#20214;&#65292;&#32780;&#26159;&#22240;&#20026;&#23433;&#35013;&#20043;&#21518;&#20320;&#26377;&#26356;&#22823;&#30340;&#20960;&#29575;&#33021;&#21551;&#21160;&#35745;&#31639;&#26426; &#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp189" href="#idp189" class="para">6</a>] </sup>&#27491;&#24335;&#30340;&#31216;&#21628;&#26159;&#8220;X Windows System&#8221;&#65292;&#20294;&#23454;&#38469;&#20013;&#20154;&#20204;&#36890;&#24120;&#31216;&#20043;&#20026;&#8220;X Windows&#8221;&#65292;&#22240;&#20026;&#19977;&#20010;&#21333;&#35789;&#22826;&#32321;&#29712;&#20102;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp200" href="#idp200" class="para">7</a>] </sup>&#21457;&#25918;&#33258;&#30001;&#36719;&#20214;&#30340;&#20154;&#21487;&#20197;&#25910;&#21462;&#19968;&#23450;&#30340;&#25335;&#36125;&#36153;&#29992;&#65292;&#20294;&#26159;&#30001;&#20110;&#20182;&#26080;&#27861;&#38459;&#27490;&#21463;&#39046;&#32773;&#21435;&#20813;&#36153;&#22320;&#20877;&#21457;&#25918;&#65292;&#20215;&#26684;&#36824;&#26159;&#20250;&#24456;&#24555;&#25509;&#36817;&#20110;&#38646;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp202" href="#idp202" class="para">8</a>] </sup>&#32593;&#26223;Navigator&#27983;&#35272;&#22120;&#30340;&#28304;&#20195;&#30721;&#26368;&#32456;<span class="emphasis"><em>&#22312;</em></span>1998&#24180;&#22312;&#19968;&#20010;&#24320;&#28304;&#35768;&#21487;&#35777;&#19979;&#21457;&#24067;&#65292;&#25104;&#20026;&#21518;&#26469;&#30340;Mozilla&#32593;&#32476;&#27983;&#35272;&#22120;&#30340;&#22522;&#30784;&#12290;&#21442;&#35265;<a class="ulink" href="http://www.mozilla.org/" target="_top">http://www.mozilla.org/</a>&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp217" href="#idp217" class="para">9</a>] </sup>OSI&#30340;&#20027;&#39029;<a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="disclaimer.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="today.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20813;&#36131;&#22768;&#26126; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#29616;&#29366;</td></tr></table></div></body></html>
