<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="prev" href="bug-tracker.html" title="Bug&#36319;&#36394;"><link rel="next" href="rss.html" title="RSS&#20379;&#31295;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-tracker.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th><td width="20%" align="right"> <a accesskey="n" href="rss.html">Next</a></td></tr></table><hr></div><div class="sect1" title="IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="irc"></a>IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;</h2></div></div></div><p>&#35768;&#22810;&#39033;&#30446;&#20351;&#29992;<em class="firstterm">&#20114;&#32852;&#32593;&#22810;&#32447;&#20132;&#35848;</em>&#65288;<em class="firstterm">IRC</em>&#65289;&#25552;&#20379;&#23454;&#26102;&#32842;&#22825;&#23460;&#65292;&#20316;&#20026;&#29992;&#25143;&#21644;&#24320;&#21457;&#32773;&#20114;&#30456;&#25552;&#38382;&#24182;&#24471;&#21040;&#21450;&#26102;&#31572;&#22797;&#30340;&#35752;&#35770;&#22330;&#25152;&#12290;&#21363;&#20351;&#20320;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#22312;&#20320;&#30340;&#26381;&#21153;&#22120;&#36816;&#34892;IRC&#26381;&#21153;&#22120;&#26102;&#65292;&#20063;&#19981;&#24517;&#20026;&#27492;&#20107;&#40635;&#28902;&#12290;&#32780;&#24212;&#35813;&#35937;&#20854;&#20182;&#20154;&#19968;&#26679;&#65306;&#22312;Freenode&#65288;<a class="ulink" href="http://freenode.net/" target="_top">http://freenode.net/</a>&#65289;&#36816;&#34892;&#20320;&#30340;IRC&#39057;&#36947;&#12290;Freenode&#32473;&#20102;&#20320;&#36275;&#22815;&#30340;&#26435;&#21033;&#26469;&#31649;&#29702;&#20320;&#39033;&#30446;&#30340;IRC&#39057;&#36947;&#65292;<sup>[<a name="idp1285" href="#ftn.idp1285" class="footnote">17</a>]</sup>&#21487;&#20197;&#35753;&#20320;&#25670;&#33073;&#32500;&#25252;IRC&#26381;&#21153;&#22120;&#36825;&#31867;&#26080;&#24847;&#20041;&#30340;&#40635;&#28902;&#12290;</p><p>&#39318;&#20808;&#35201;&#36873;&#25321;&#19968;&#20010;&#39057;&#36947;&#21517;&#31216;&#12290;&#26368;&#26126;&#26174;&#30340;&#36873;&#25321;&#26159;&#20320;&#30340;&#39033;&#30446;&#21517;&#8212;&#22914;&#26524;&#22312;Freenode&#23384;&#22312;&#65292;&#23601;&#20351;&#29992;&#23427;&#12290;&#22914;&#26524;&#19981;&#23384;&#22312;&#65292;&#21487;&#20197;&#36873;&#25321;&#19968;&#20010;&#19982;&#39033;&#30446;&#21517;&#25509;&#36817;&#30340;&#21517;&#31216;&#65292;&#23613;&#21487;&#33021;&#30340;&#26131;&#20110;&#35760;&#24518;&#12290;&#22312;&#20320;&#30340;&#39033;&#30446;&#32593;&#31449;&#19978;&#23558;&#39057;&#36947;&#24191;&#32780;&#21578;&#20043;&#65292;&#36825;&#26679;&#26399;&#26395;&#24555;&#36895;&#25552;&#38382;&#30340;&#35775;&#38382;&#32773;&#21487;&#20197;&#31435;&#21051;&#30475;&#21040;&#23427;&#12290;&#20363;&#22914;&#65292;Subversion&#20027;&#39029;&#19978;&#26174;&#33879;&#25918;&#32622;&#30340;&#26041;&#26694;&#20013;&#25152;&#20986;&#29616;&#30340;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>If you're using Subversion, we recommend that you
    join the</em></span> <code class="literal">users@subversion.tigris.org</code>
    <span class="emphasis"><em>mailing list, and read the <a class="ulink" href="http://svnbook.red-bean.com/" target="_top">Subversion Book</a> and
    <a class="ulink" href="http://subversion.tigris.org/faq.html" target="_top">FAQ</a>.
    You can also ask questions on IRC at</em></span>
    <code class="literal">irc.freenode.net</code>
    <span class="emphasis"><em>channel</em></span> <code class="literal">#svn</code>.</p></blockquote></div><p>&#19968;&#20123;&#39033;&#30446;&#26377;&#22810;&#20010;&#39057;&#36947;&#65292;&#27599;&#20010;&#23376;&#20027;&#39064;&#19968;&#20010;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;&#39057;&#36947;&#20851;&#27880;&#23433;&#35013;&#38382;&#39064;&#65292;&#21478;&#19968;&#20010;&#26159;&#20351;&#29992;&#38382;&#39064;&#65292;&#36824;&#26377;&#19968;&#20010;&#26159;&#24320;&#21457;&#32842;&#22825;&#65292;&#31561;&#31561;&#12290; &#65288;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="growth.html" title="&#22788;&#29702;&#25104;&#38271;">the section called &#8220;&#22788;&#29702;&#25104;&#38271;&#8221;</a>&#35752;&#35770;&#20102;&#22914;&#20309;&#21010;&#20998;&#22810;&#20010;&#39057;&#36947;&#65289;&#12290;&#24403;&#20320;&#30340;&#39033;&#30446;&#36824;&#24180;&#36731;&#26102;&#65292;&#24212;&#35813;&#21482;&#26377;&#19968;&#20010;&#39057;&#36947;&#65292;&#25152;&#26377;&#20154;&#22312;&#19968;&#36215;&#35752;&#35770;&#12290;&#20043;&#21518;&#65292;&#38543;&#30528;&#29992;&#25143;&#21040;&#24320;&#21457;&#32773;&#27604;&#29575;&#22686;&#21152;&#65292;&#20063;&#23601;&#26377;&#24517;&#35201;&#20998;&#24320;&#21333;&#29420;&#30340;&#39057;&#36947;&#12290;</p><p>&#20154;&#20204;&#22914;&#20309;&#30693;&#36947;&#25152;&#26377;&#30340;&#24050;&#26377;&#39057;&#36947;&#65292;&#20197;&#21450;&#22312;&#21738;&#20010;&#39057;&#36947;&#35752;&#35770;&#65311;&#20182;&#20204;&#20309;&#26102;&#20132;&#35848;&#65292;&#22914;&#20309;&#30693;&#36947;&#24403;&#22320;&#30340;&#20064;&#24815;&#65311;</p><p>&#31572;&#26696;&#26159;&#36890;&#36807;&#35774;&#23450;<em class="firstterm">&#39057;&#36947;&#20027;&#39064;</em>&#21578;&#35785;&#20182;&#20204;&#12290;<sup>[<a name="idp1305" href="#ftn.idp1305" class="footnote">18</a>]</sup>&#39057;&#36947;&#20027;&#39064;&#26159;&#27599;&#20010;&#29992;&#25143;&#22312;&#36827;&#20837;&#39057;&#36947;&#26102;&#30475;&#21040;&#30340;&#19968;&#20123;&#20449;&#24687;&#12290;&#21487;&#20197;&#32473;&#27599;&#20010;&#26032;&#20154;&#19968;&#20221;&#24555;&#36895;&#25351;&#21335;&#65292;&#25351;&#20986;&#26356;&#36827;&#19968;&#27493;&#30340;&#20449;&#24687;&#12290;&#20363;&#22914;&#65306;</p><pre class="screen">
You are now talking on #svn

Topic for #svn is Forum for Subversion user questions, see also
http://subversion.tigris.org/. || Development discussion happens in
#svn-dev. || Please don't paste long transcripts here, instead use
a pastebin site like http://pastebin.ca/. || NEWS: Subversion 1.1.0
is released, see http://svn110.notlong.com/ for details.
</pre><p>&#20869;&#23481;&#24456;&#25212;&#35201;&#65292;&#20294;&#26159;&#23427;&#21578;&#35785;&#26032;&#20154;&#25152;&#24517;&#38656;&#30693;&#36947;&#30340;&#19996;&#35199;&#12290;&#23427;&#31934;&#30830;&#30340;&#35828;&#26126;&#39057;&#36947;&#30340;&#30446;&#30340;&#65292;&#25552;&#20379;&#20102;&#39033;&#30446;&#30340;&#20027;&#39029;&#65288;&#22914;&#26524;&#26576;&#20154;&#26159;&#28216;&#33633;&#36817;&#26469;&#65292;&#32780;&#24182;&#38750;&#20174;&#39033;&#30446;&#32593;&#39029;&#36807;&#26469;&#65289;&#65292;&#25552;&#21450;&#30456;&#20851;&#30340;&#39057;&#36947;&#65292;&#24182;&#32473;&#20986;&#19968;&#20123;&#25351;&#23548;&#12290;</p><div class="sidebar" title="&#31896;&#36148;&#31449;&#28857;"><a name="paste-sites"></a><div class="titlepage"><div><div><p class="title"><b>&#31896;&#36148;&#31449;&#28857;</b></p></div></div></div><p>&#19968;&#20010;IRC&#39057;&#36947;&#26159;&#19968;&#20010;&#20849;&#20139;&#31354;&#38388;&#65306;&#20219;&#20309;&#20154;&#21487;&#20197;&#30475;&#21040;&#27599;&#20010;&#20154;&#30340;&#35848;&#35805;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#26159;&#19968;&#20010;&#22909;&#20107;&#24773;&#65292;&#36825;&#20801;&#35768;&#20154;&#20204;&#22312;&#24863;&#21040;&#33021;&#20570;&#20986;&#36129;&#29486;&#26102;&#36339;&#20837;&#35848;&#35805;&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;&#35266;&#23519;&#23398;&#20064;&#12290;&#20294;&#22914;&#26524;&#26576;&#20154;&#24076;&#26395;&#19968;&#27425;&#25552;&#20379;&#19968;&#22823;&#27573;&#20449;&#24687;&#26102;&#65292;&#20363;&#22914;&#35843;&#35797;&#20250;&#35805;&#33050;&#26412;&#65292;&#22240;&#20026;&#20250;&#36755;&#20986;&#24456;&#22810;&#34892;&#65292;&#20250;&#25200;&#20081;&#20854;&#20182;&#20154;&#30340;&#23545;&#35805;&#12290;</p><p>&#35299;&#20915;&#21150;&#27861;&#26159;&#20351;&#29992;<em class="firstterm">pastebin</em>&#25110;<em class="firstterm">pastebot</em>&#31449;&#28857;&#12290;&#24403;&#21521;&#26576;&#20154;&#35201;&#27714;&#19968;&#22823;&#22359;&#25968;&#25454;&#26102;&#65292;&#21578;&#30693;&#20182;&#20204;&#19981;&#35201;&#31896;&#36148;&#21040;&#39057;&#36947;&#20013;&#65292;&#32780;&#26159;&#21435;&#65288;&#20363;&#22914;&#65289;<a class="ulink" href="http://pastebin.ca/" target="_top">http://pastebin.ca/</a>&#65292;&#23558;&#25968;&#25454;&#31896;&#21040;&#37027;&#37324;&#30340;&#34920;&#21333;&#20013;&#65292;&#24182;&#22312;IRC&#39057;&#36947;&#20013;&#21578;&#30693;&#32467;&#26524;&#30340;URL&#12290;&#20219;&#20309;&#20154;&#21487;&#20197;&#35775;&#38382;&#36825;&#20010;URL&#24182;&#23519;&#30475;&#25968;&#25454;&#12290;</p><p>&#29616;&#22312;&#26377;&#35768;&#22810;&#20813;&#36153;&#30340;&#31896;&#36148;&#31449;&#28857;&#65292;&#23436;&#25972;&#22320;&#20363;&#23376;&#22826;&#22810;&#20102;&#65292;&#36825;&#37324;&#26159;&#25105;&#26366;&#32463;&#29992;&#36807;&#30340;&#65306;<a class="ulink" href="http://www.nomorepasting.com/" target="_top">http://www.nomorepasting.com/</a>&#12289;
<a class="ulink" href="http://pastebin.ca/" target="_top">http://pastebin.ca/</a>&#12289;
<a class="ulink" href="http://nopaste.php.cd/" target="_top">http://nopaste.php.cd/</a>&#12289;
<a class="ulink" href="http://rafb.net/paste/" target="_top">http://rafb.net/paste/</a>&#12289;
<a class="ulink" href="http://sourcepost.sytes.net/" target="_top">http://sourcepost.sytes.net/</a>&#12289;
<a class="ulink" href="http://extraball.sunsite.dk/notepad.php" target="_top">http://extraball.sunsite.dk/notepad.php</a>&#12289;
&#21644;
<a class="ulink" href="http://www.pastebin.com/" target="_top">http://www.pastebin.com/</a>&#12290;</p></div><div class="sect2" title="&#26426;&#22120;&#20154;&#65288;Bots&#65289;"><div class="titlepage"><div><div><h3 class="title"><a name="bots"></a>&#26426;&#22120;&#20154;&#65288;Bots&#65289;</h3></div></div></div><p>&#35768;&#22810;&#38754;&#21521;&#25216;&#26415;&#30340;IRC&#39057;&#36947;&#26377;&#19968;&#20010;&#38750;&#20154;&#30340;&#25104;&#21592;&#65292;&#21483;&#20570;<em class="firstterm">&#26426;&#22120;&#20154;&#65288;bot&#65289;</em>&#65292;&#23427;&#21487;&#20197;&#23545;&#29305;&#23450;&#30340;&#21629;&#20196;&#36820;&#22238;&#20449;&#24687;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#20010;&#26426;&#22120;&#20154;&#23601;&#20687;&#39057;&#36947;&#20013;&#30340;&#20854;&#23427;&#25104;&#21592;&#19968;&#26679;&#65292;&#21629;&#20196;&#26159;&#36890;&#36807;&#35848;&#35805;&#20256;&#36882;&#32473;&#30340;&#26426;&#22120;&#20154;&#12290;&#20363;&#22914;&#65306;</p><pre class="screen">
&lt;kfogel&gt; ayita: learn diff-cmd = http://subversion.tigris.org/faq.html#diff-cmd
&lt;ayita&gt;  Thanks!
</pre><p>&#36825;&#26159;&#21578;&#35785;&#26426;&#22120;&#20154;&#65288;&#20197;ayita&#30331;&#20837;&#20102;&#39057;&#36947;&#65289;&#35760;&#20303;&#20197;&#29305;&#23450;&#30340;URL&#22238;&#31572;&#8220;diff-cmd&#8221;&#30340;&#25552;&#38382;&#65292;&#29616;&#22312;&#20854;&#20182;&#29992;&#25143;&#21487;&#20197;&#21521;ayita&#35759;&#38382;&#65292;&#24182;&#33719;&#21462;diff-cmd&#30340;&#20449;&#24687;&#65306;</p><pre class="screen">
&lt;kfogel&gt; ayita: tell jrandom about diff-cmd
&lt;ayita&gt;  jrandom: http://subversion.tigris.org/faq.html#diff-cmd
</pre><p>&#36890;&#36807;&#36895;&#35760;&#27861;&#21487;&#20197;&#24471;&#21040;&#21516;&#26679;&#30340;&#32467;&#26524;&#65306;</p><pre class="screen">
&lt;kfogel&gt; !a jrandom diff-cmd
&lt;ayita&gt;  jrandom: http://subversion.tigris.org/faq.html#diff-cmd
</pre><p>&#20934;&#30830;&#30340;&#21629;&#20196;&#38598;&#21644;&#34892;&#20026;&#26041;&#24335;&#21508;&#19981;&#30456;&#21516;&#12290;&#20197;&#19978;&#30340;&#20363;&#23376;&#26469;&#33258;<code class="literal">ayita</code>&#65288;<a class="ulink" href="http://hix.nu/svn-public/alexis/trunk/" target="_top">http://hix.nu/svn-public/alexis/trunk/</a>&#65289;&#65292;&#36890;&#24120;&#22312;freenode&#30340;<code class="literal">#svn</code>&#36816;&#34892;&#30528;&#19968;&#20010;&#23454;&#20363;&#12290;&#20854;&#23427;&#26426;&#22120;&#20154;&#21253;&#25324;Dancer&#65288;<a class="ulink" href="http://dancer.sourceforge.net/" target="_top">http://dancer.sourceforge.net/</a>&#65289;&#21644;Supybot&#65288;<a class="ulink" href="http://supybot.com/" target="_top">http://supybot.com/</a>&#65289;&#12290;&#35831;&#27880;&#24847;&#65292;&#36816;&#34892;&#26426;&#22120;&#20154;&#26080;&#38656;&#26381;&#21153;&#22120;&#30340;&#26435;&#38480;&#12290;&#19968;&#20010;&#26426;&#22120;&#20154;&#23601;&#26159;&#19968;&#20010;&#23458;&#25143;&#31471;&#31243;&#24207;&#65307;&#20219;&#20309;&#20154;&#21487;&#20197;&#35774;&#32622;&#19968;&#20010;&#24182;&#30417;&#21548;&#29305;&#23450;&#30340;&#26381;&#21153;&#22120;/&#39057;&#36947;&#12290;</p><p>&#22914;&#26524;&#20320;&#30340;&#39057;&#36947;&#19968;&#27425;&#27425;&#30340;&#24471;&#21040;&#21516;&#26679;&#30340;&#38382;&#39064;&#65292;&#25105;&#24378;&#28872;&#25512;&#33616;&#20320;&#35774;&#32622;&#19968;&#20010;&#26426;&#22120;&#20154;&#12290;&#21482;&#26377;&#19968;&#23567;&#37096;&#20998;&#39057;&#36947;&#29992;&#25143;&#20250;&#33719;&#24471;&#38656;&#35201;&#22788;&#29702;&#26426;&#22120;&#20154;&#30340;&#19987;&#19994;&#25216;&#33021;&#65292;&#32780;&#36825;&#20123;&#29992;&#25143;&#20250;&#22238;&#31572;&#19981;&#25104;&#27604;&#20363;&#30340;&#22823;&#37096;&#20998;&#38382;&#39064;&#65292;&#22240;&#20026;&#26426;&#22120;&#20154;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#26377;&#25928;&#29575;&#30340;&#22238;&#22797;&#12290;</p></div><div class="sect2" title="&#24402;&#26723;IRC"><div class="titlepage"><div><div><h3 class="title"><a name="irc-archiving"></a>&#24402;&#26723;IRC</h3></div></div></div><p>&#23613;&#31649;&#21487;&#20197;&#23558;IRC&#39057;&#36947;&#21457;&#29983;&#30340;&#20219;&#20309;&#20107;&#24773;&#37117;&#24402;&#26723;&#65292;&#20294;&#36825;&#19981;&#26159;&#24517;&#35201;&#30340;&#12290;IRC&#23545;&#35805;&#21517;&#20041;&#19978;&#26159;&#20844;&#24320;&#30340;&#65292;&#20294;&#26159;&#35768;&#22810;&#29992;&#25143;&#35748;&#20026;&#36825;&#26159;&#38750;&#27491;&#24335;&#30340;&#65292;&#21322;&#31169;&#23494;&#30340;&#23545;&#35805;&#12290;&#29992;&#25143;&#20250;&#23545;&#35821;&#27861;&#19981;&#26159;&#24456;&#22312;&#24847;&#65292;&#32780;&#19988;&#32463;&#24120;&#20250;&#34920;&#36798;&#24847;&#35265;&#65288;&#20363;&#22914;&#65292;&#20851;&#20110;&#20854;&#23427;&#36719;&#20214;&#25110;&#20854;&#20182;&#31243;&#24207;&#21592;&#65289;&#65292;&#36825;&#20123;&#37117;&#19981;&#26159;&#20182;&#20204;&#24076;&#26395;&#27704;&#20037;&#20445;&#23384;&#24402;&#26723;&#30340;&#12290;</p><p>&#24403;&#28982;&#65292;&#26377;&#26102;&#20505;<span class="emphasis"><em>&#25688;&#35201;</em></span>&#24517;&#39035;&#33021;&#22815;&#20445;&#23384;&#12290;&#22823;&#22810;&#25968;IRC&#23458;&#25143;&#31471;&#21487;&#20197;&#22312;&#29992;&#25143;&#35201;&#27714;&#30340;&#24773;&#20917;&#19979;&#35760;&#24405;&#23545;&#35805;&#21040;&#19968;&#20010;&#25991;&#20214;&#65292;&#22914;&#26524;&#19981;&#33021;&#65292;&#20154;&#20204;&#20063;&#21487;&#20197;&#20165;&#20165;&#26159;&#23558;&#23545;&#21326;&#25335;&#36125;&#21644;&#31896;&#36148;&#21040;&#22266;&#23450;&#30340;&#35770;&#22363;&#65288;&#32463;&#24120;&#26159;bug&#36319;&#36394;&#31995;&#32479;&#65289;&#20013;&#12290;&#20294;&#26159;&#19981;&#21152;&#21306;&#20998;&#30340;&#24402;&#26723;&#25152;&#26377;&#20869;&#23481;&#20250;&#35753;&#26576;&#20123;&#29992;&#25143;&#19981;&#24742;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#24402;&#26723;&#25152;&#26377;&#30340;&#20107;&#24773;&#65292;&#35831;&#30830;&#35748;&#20320;&#24050;&#32463;&#22312;&#39057;&#36947;&#20027;&#39064;&#26126;&#30830;&#35828;&#26126;&#65292;&#24182;&#32473;&#20986;&#20102;&#24402;&#26723;&#30340;URL&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1285" href="#idp1285" class="para">17</a>] </sup>&#27809;&#26377;&#35201;&#27714;&#25110;&#26399;&#26395;&#20320;&#33021;&#22815;&#20026;Freenode&#25424;&#29486;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#25110;&#20320;&#30340;&#39033;&#30446;&#33021;&#22815;&#36127;&#25285;&#65292;&#35831;&#32771;&#34385;&#36129;&#29486;&#19968;&#19979;&#12290;&#20182;&#20204;&#22312;&#32654;&#22269;&#26377;&#19968;&#20010;&#20813;&#31246;&#30340;&#24904;&#21892;&#22242;&#20307;&#65292;&#25552;&#20379;&#26377;&#20215;&#20540;&#30340;&#26381;&#21153;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp1305" href="#idp1305" class="para">18</a>] </sup>&#20351;&#29992;<code class="literal">/topic</code>&#21629;&#20196;&#35774;&#23450;&#39057;&#36947;&#20027;&#39064;&#12290;IRC&#39057;&#36947;&#20013;&#30340;&#25152;&#26377;&#30340;&#21629;&#20196;&#20197;&#8220;<code class="literal">/</code>&#8221;&#24320;&#22836;&#12290;&#22914;&#26524;&#20320;&#19981;&#29087;&#24713;IRC&#30340;&#20351;&#29992;&#21644;&#31649;&#29702;&#65292;&#21487;&#20197;&#30475;<a class="ulink" href="http://www.irchelp.org/" target="_top">http://www.irchelp.org/</a>&#65307;&#32780;<a class="ulink" href="http://www.irchelp.org/irchelp/irctutorial.html" target="_top">http://www.irchelp.org/irchelp/irctutorial.html</a>&#26159;&#19968;&#20221;&#23436;&#32654;&#30340;&#25945;&#31243;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-tracker.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="rss.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Bug&#36319;&#36394; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> RSS&#20379;&#31295;</td></tr></table></div></body></html>
