<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="forks.html" title="&#20998;&#21449;"><link rel="next" href="license-aspects.html" title="&#35768;&#21487;&#35777;&#30340;&#26041;&#38754;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="forks.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="license-aspects.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;"><div class="titlepage"><div><div><h2 class="title"><a name="legal"></a>Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="legal.html#licenses-terminology">&#26415;&#35821;</a></span></dt><dt><span class="sect1"><a href="license-aspects.html">&#35768;&#21487;&#35777;&#30340;&#26041;&#38754;</a></span></dt><dt><span class="sect1"><a href="license-compatibility.html">GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;</a></span></dt><dt><span class="sect1"><a href="license-choosing.html">&#36873;&#25321;&#19968;&#20010;&#35768;&#21487;&#35777;</a></span></dt><dd><dl><dt><span class="sect2"><a href="license-choosing.html#license-choosing-mit-x">MIT / X Window System License</a></span></dt><dt><span class="sect2"><a href="license-choosing.html#license-choosing-gpl">GNU General Public License</a></span></dt><dd><dl><dt><span class="sect3"><a href="license-choosing.html#is-the-gpl-free">GPL&#26159;&#33258;&#30001;&#36824;&#26159;&#19981;&#33258;&#30001;&#65311;</a></span></dt></dl></dd><dt><span class="sect2"><a href="license-choosing.html#license-bsd">&#37027;BSD&#35768;&#21487;&#35777;&#21602;&#65311;</a></span></dt></dl></dd><dt><span class="sect1"><a href="copyright-assignment.html">&#29256;&#26435;&#20998;&#37197;&#21644;&#25152;&#26377;&#26435;</a></span></dt><dd><dl><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-none">&#26080;&#20026;&#32780;&#27835;</a></span></dt><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-cla">&#36129;&#29486;&#32773;&#35768;&#21487;&#35777;&#21327;&#35758;</a></span></dt><dt><span class="sect2"><a href="copyright-assignment.html#copyright-assignment-transfer">&#29256;&#26435;&#36716;&#31227;</a></span></dt></dl></dd><dt><span class="sect1"><a href="dual-licensing.html">&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;</a></span></dt><dt><span class="sect1"><a href="patents.html">&#19987;&#21033;</a></span></dt><dt><span class="sect1"><a href="licensing-further-resources.html">&#28145;&#20837;&#36164;&#28304;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#21482;&#35201;&#26159;&#24320;&#28304;&#35768;&#21487;&#35777;&#65292;&#20320;&#36873;&#25321;&#30340;&#35768;&#21487;&#35777;&#21487;&#33021;&#19981;&#20250;&#26159;&#24433;&#21709;&#37319;&#29992;&#39033;&#30446;&#30340;&#20027;&#35201;&#22240;&#32032;&#12290;&#29992;&#25143;&#36890;&#24120;&#26681;&#25454;&#36136;&#37327;&#21644;&#29305;&#24615;&#36873;&#25321;&#36719;&#20214;&#65292;&#32780;&#19981;&#26159;&#35768;&#21487;&#35777;&#30340;&#32454;&#33410;&#12290;&#34429;&#28982;&#22914;&#27492;&#65292;&#20320;&#36824;&#26159;&#38656;&#35201;&#23545;&#33258;&#30001;&#36719;&#20214;&#35768;&#21487;&#38382;&#39064;&#26377;&#22522;&#26412;&#30340;&#20102;&#35299;&#65292;&#19968;&#26041;&#38754;&#30830;&#20445;&#39033;&#30446;&#30340;&#35768;&#21487;&#35777;&#19982;&#20854;&#30446;&#26631;&#19968;&#33268;&#65292;&#21478;&#19968;&#26041;&#38754;&#21487;&#20197;&#19982;&#20854;&#20182;&#20154;&#35752;&#35770;&#35768;&#21487;&#35777;&#20915;&#31574;&#12290;&#35831;&#27880;&#24847;&#65292;&#25105;&#19981;&#26159;&#24459;&#24072;&#65292;&#26412;&#31456;&#30340;&#20869;&#23481;&#19981;&#24212;&#24403;&#20316;&#20026;&#27491;&#24335;&#30340;&#27861;&#24459;&#24314;&#35758;&#12290;&#23545;&#20110;&#27861;&#24459;&#20107;&#21153;&#65292;&#20320;&#38656;&#35201;&#38599;&#20323;&#19968;&#20010;&#24459;&#24072;&#25110;&#33258;&#24049;&#26159;&#24459;&#24072;&#12290;</p></div><div class="sect1" title="&#26415;&#35821;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="licenses-terminology"></a>&#26415;&#35821;</h2></div></div></div><p>&#22312;&#24320;&#28304;&#35768;&#21487;&#35777;&#30340;&#20219;&#20309;&#35752;&#35770;&#20013;&#65292;&#26368;&#26126;&#26174;&#30340;&#26159;&#39318;&#20808;&#35201;&#30475;&#21040;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#21333;&#35789;&#25351;&#30340;&#26159;&#21516;&#19968;&#20214;&#20107;&#65306;<em class="firstterm">&#33258;&#30001;&#36719;&#20214;</em>&#12289;<em class="firstterm">&#24320;&#28304;</em>&#12289;<em class="firstterm">FOSS</em>&#12289;<em class="firstterm">F/OSS</em>&#21644;<em class="firstterm">FLOSS</em>&#12290;&#39318;&#20808;&#20174;&#21015;&#20986;&#36825;&#20123;&#24320;&#22987;&#65292;&#28982;&#21518;&#24341;&#20986;&#19968;&#20123;&#20854;&#20182;&#30340;&#26415;&#35821;&#12290;</p><div class="variablelist"><dl><dt><span class="term"><em class="firstterm">&#33258;&#30001;&#36719;&#20214;</em></span></dt><dd><p>&#21487;&#20197;&#33258;&#30001;&#20998;&#20139;&#21644;&#20462;&#25913;&#30340;&#36719;&#20214;&#65292;&#21253;&#21547;&#28304;&#20195;&#30721;&#26684;&#24335;&#12290;&#35813;&#26415;&#35821;&#39318;&#20808;&#30001;Richard Stallman&#21019;&#36896;&#65292;&#20182;&#22312;GNUGeneral Public License (GPL)&#20013;&#32534;&#20889;&#20102;&#36825;&#20010;&#35789;&#65292;&#24182;&#21019;&#24314;&#20102;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#65288;<a class="ulink" href="http://www.fsf.org/" target="_top">http://www.fsf.org/</a>&#65289;&#26469;&#21457;&#25196;&#36825;&#20010;&#27010;&#24565;&#12290;</p><p>&#23613;&#31649;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#20960;&#20046;&#35206;&#30422;&#20102;&#20960;&#20046;&#8220;&#24320;&#28304;&#8221;&#36719;&#20214;&#30340;&#21516;&#19968;&#20010;&#33539;&#22260;&#65292;FSF&#36824;&#26159;&#20542;&#21521;&#20110;&#21069;&#19968;&#20010;&#26415;&#35821;&#65292;&#22240;&#20026;&#23427;&#24378;&#35843;&#20102;&#33258;&#30001;&#30340;&#29702;&#24565;&#65292;&#33258;&#30001;&#20998;&#21457;&#36719;&#20214;&#30340;&#27010;&#24565;&#20027;&#35201;&#26159;&#19968;&#31181;&#31038;&#20250;&#30340;&#32780;&#19981;&#26159;&#25216;&#26415;&#30340;&#36816;&#21160;&#12290;FSF&#25215;&#35748;&#36825;&#20010;&#26415;&#35821;&#30340;&#19981;&#26126;&#30830;&#24615;&#8212;&#23427;&#21487;&#20197;&#26159;&#8220;0&#36153;&#29992;&#8221;&#30340;&#8220;free&#8221;&#65292;&#32780;&#19981;&#26159;&#8220;&#33258;&#30001;&#8221;&#30340;&#8220;free&#8221;&#8212;&#20294;&#36824;&#26159;&#35748;&#20026;&#36825;&#26159;&#26368;&#22909;&#30340;&#26415;&#35821;&#65292;&#20854;&#20182;&#21487;&#33021;&#24615;&#22312;&#33521;&#35821;&#20013;&#36824;&#26159;&#26377;&#33258;&#24049;&#30340;&#28151;&#28102;&#12290;&#65288;&#22312;&#26412;&#20070;&#20013;&#65292;&#8220;free&#8221;&#21462;&#8220;&#33258;&#30001;&#8221;&#20043;&#24847;&#65292;&#32780;&#38750;&#8220;0&#36153;&#29992;&#8221;&#20043;&#24847;&#12290;&#65289;</p></dd><dt><span class="term"><em class="firstterm">&#24320;&#28304;&#36719;&#20214;</em></span></dt><dd><p>&#33258;&#30001;&#36719;&#20214;&#30340;&#21478;&#19968;&#20010;&#21517;&#23383;&#12290;&#20294;&#26159;&#19981;&#21516;&#30340;&#21517;&#23383;&#21453;&#26144;&#20102;&#37325;&#35201;&#30340;&#21746;&#23398;&#24046;&#24322;&#65306;&#24320;&#28304;&#20419;&#36827;&#20250;&#65288;Open Source Initiative <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>&#65289;&#21019;&#36896;&#20102;&#8220;&#24320;&#28304;&#36719;&#20214;&#8221;&#19968;&#35789;&#65292;&#20316;&#20026;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#30340;&#21487;&#26367;&#25442;&#35789;&#65292;&#20182;&#20204;&#35797;&#22270;&#36890;&#36807;&#20197;&#24320;&#21457;&#26041;&#27861;&#23398;&#32780;&#19981;&#26159;&#25919;&#27835;&#36816;&#21160;&#30340;&#26041;&#24335;&#36827;&#34892;&#23637;&#31034;&#65292;&#21162;&#21147;&#20351;&#27492;&#31867;&#36719;&#20214;&#25104;&#20026;&#20844;&#21496;&#26356;&#21487;&#21475;&#30340;&#36873;&#25321;&#12290;&#20182;&#20204;&#20063;&#26399;&#26395;&#28040;&#38500;&#21478;&#19968;&#20010;&#27745;&#28857;&#65306;&#20219;&#20309;&#8220;&#20813;&#36153;&#30340;&#8221;&#19968;&#23450;&#26159;&#20302;&#36136;&#37327;&#30340;&#12290;</p><p>&#25152;&#26377;&#30340;&#35768;&#21487;&#35777;&#26159;&#33258;&#30001;&#30340;&#21017;&#20063;&#26159;&#24320;&#28304;&#30340;&#65292;&#21453;&#20043;&#20134;&#28982;&#65288;&#38500;&#20102;&#23569;&#35768;&#30340;&#20363;&#22806;&#65289;&#65292;&#20154;&#20204;&#20542;&#21521;&#20110;&#36873;&#25321;&#19968;&#20010;&#24182;&#20445;&#25345;&#19981;&#21464;&#12290;&#27010;&#25324;&#35828;&#26469;&#65292;&#21916;&#27426;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#30340;&#26356;&#26377;&#21487;&#33021;&#21916;&#27426;&#22312;&#36825;&#20010;&#38382;&#39064;&#19978;&#20445;&#25345;&#19968;&#20010;&#21746;&#23398;&#25110;&#36947;&#24503;&#23039;&#24577;&#65292;&#32780;&#21916;&#27426;&#8220;&#24320;&#28304;&#8221;&#30340;&#21017;&#25110;&#35768;&#26159;&#19981;&#35748;&#20026;&#33258;&#30001;&#21313;&#20998;&#37325;&#35201;&#65292;&#20134;&#25110;&#32773;&#19981;&#24076;&#26395;&#26497;&#21147;&#23459;&#25196;&#20182;&#20204;&#25152;&#20570;&#30340;&#12290;&#20851;&#20110;&#36825;&#27425;&#20998;&#35010;&#30340;&#21382;&#21490;&#35831;&#30475;<span><a class="xref" href="introduction.html" title="Chapter 1. &#20171;&#32461;">Chapter 1, <i>&#20171;&#32461;</i></a>&#30340;</span><a class="xref" href="introduction.html#free-vs-open-source" title="&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;">the section called &#8220;&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;&#8221;</a>&#12290;</p><p>&#23545;&#20110;&#36825;&#20004;&#20010;&#26415;&#35821;&#65292;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#26377;&#19968;&#20010;&#38750;&#20961;&#30340;&#8212;&#23436;&#20840;&#19981;&#21487;&#21453;&#23545;&#30340;&#65292;&#20294;&#26159;&#24494;&#22937;&#32780;&#20844;&#24179;&#30340;&#8212;&#35299;&#37322;&#65292;&#20301;&#20110;<a class="ulink" href="http://www.fsf.org/licensing/essays/free-software-for-freedom.html" target="_top">http://www.fsf.org/licensing/essays/free-software-for-freedom.html</a>&#12290;&#24320;&#28304;&#36719;&#20214;&#30740;&#31350;&#38498;&#36890;&#36807;&#36825;&#20004;&#20010;&#39029;&#38754;&#20256;&#25773;&#65306;<a class="ulink" href="http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a>&#21644;<a class="ulink" href="http://www.opensource.org/advocacy/free-notfree.php" target="_top">http://www.opensource.org/advocacy/free-notfree.php</a>&#12290;</p></dd><dt><span class="term"><em class="firstterm">FOSS</em>,
                      <em class="firstterm">F/OSS</em>,
                      <em class="firstterm">FLOSS</em></span></dt><dd><p>&#24320;&#22987;&#26159;&#20004;&#20214;&#20107;&#65292;&#19981;&#20037;&#21518;&#23601;&#21464;&#25104;&#19977;&#20214;&#65292;&#36825;&#30830;&#23454;&#26159;&#33258;&#30001;&#36719;&#20214;&#20013;&#26415;&#35821;&#25152;&#21457;&#29983;&#30340;&#20107;&#24773;&#12290;&#23398;&#26415;&#19990;&#30028;&#25110;&#35768;&#26356;&#24076;&#26395;&#31934;&#30830;&#21644;&#20869;&#28085;&#65292;&#32780;&#19981;&#26159;&#20248;&#38597;&#65292;&#25152;&#20197;&#35774;&#32622;FOSS&#25110;&#26377;&#26102;F/OSS&#26469;&#20195;&#34920;&#8220;Free / Open Source Software&#8221;&#12290;&#21478;&#19968;&#20010;&#21464;&#31181;&#26159;FLOSS&#65292;&#20195;&#34920;&#20102;&#8220;Free / Libre Open Source Software&#8221;&#65288;<span class="foreignphrase"><em class="foreignphrase">libre</em></span>&#22312;&#35768;&#22810;&#35821;&#35328;&#20013;&#20063;&#26159;&#34987;&#20154;&#25152;&#29087;&#24713;&#30340;&#65292;&#24182;&#19988;&#27809;&#26377;&#8220;free&#8221;&#30340;&#27169;&#31946;&#21547;&#20041;&#65307;&#26356;&#22810;&#20449;&#24687;&#35831;&#35265;<a class="ulink" href="http://en.wikipedia.org/wiki/FLOSS" target="_top">http://en.wikipedia.org/wiki/FLOSS</a>&#65289;&#12290;</p><p>&#25152;&#26377;&#36825;&#20123;&#26415;&#35821;&#23454;&#36136;&#19978;&#26159;&#21516;&#19968;&#20214;&#20107;&#65306;&#20219;&#20309;&#20154;&#21487;&#20197;&#20462;&#25913;&#24182;&#20998;&#21457;&#30340;&#36719;&#20214;&#65292;&#26377;&#26102;&#8212;&#24182;&#19981;&#19968;&#30452;&#26159;&#8212;&#35201;&#27714;&#34893;&#29983;&#30340;&#20316;&#21697;&#24517;&#39035;&#25353;&#29031;&#21516;&#26679;&#30340;&#26465;&#27454;&#33258;&#30001;&#30340;&#20998;&#21457;&#12290;</p></dd><dt><span class="term"><em class="firstterm">DFSG-&#31526;&#21512;</em></span></dt><dd><p>&#31526;&#21512;Debian&#33258;&#30001;&#36719;&#20214;&#26041;&#38024;&#65288;<a class="ulink" href="http://www.debian.org/social_contract#guidelines" target="_top">http://www.debian.org/social_contract#guidelines</a>&#65289;&#12290;&#36825;&#26159;&#19968;&#20010;&#35768;&#21487;&#35777;&#26159;&#21542;&#20026;&#30495;&#30340;&#24320;&#28304;&#36719;&#20214;&#65288;free&#12289;<span class="foreignphrase"><em class="foreignphrase">libre</em></span>&#31561;&#31561;&#65289;&#30340;&#24191;&#27867;&#20351;&#29992;&#30340;&#27979;&#35797;&#12290;Debian&#39033;&#30446;&#30340;&#30446;&#26631;&#26159;&#32500;&#25252;&#25972;&#20010;&#33258;&#30001;&#36719;&#20214;&#25805;&#20316;&#31995;&#32479;&#65292;&#36825;&#26679;&#20154;&#20204;&#23433;&#35013;&#20043;&#21518;&#23601;&#26080;&#38656;&#25285;&#24515;&#33258;&#24049;&#26159;&#21542;&#26377;&#26435;&#38480;&#20462;&#25913;&#21644;&#20998;&#21457;&#31995;&#32479;&#30340;&#20219;&#24847;&#37096;&#20998;&#12290;Debian&#33258;&#30001;&#36719;&#20214;&#26041;&#38024;&#26159;&#36719;&#20214;&#21253;&#35768;&#21487;&#35777;&#36827;&#20837;Debian&#25152;&#24517;&#38656;&#36798;&#21040;&#30340;&#35201;&#27714;&#12290;&#22240;&#20026;Debian&#39033;&#30446;&#33457;&#36153;&#20102;&#22823;&#37327;&#26102;&#38388;&#32771;&#34385;&#22914;&#20309;&#26500;&#24314;&#36825;&#26679;&#19968;&#20010;&#27979;&#35797;&#65292;&#25152;&#20197;&#24471;&#20986;&#30340;&#26041;&#38024;&#34987;&#35777;&#26126;&#26159;&#38750;&#24120;&#20581;&#22766;&#65288;<a class="ulink" href="http://en.wikipedia.org/wiki/DFSG" target="_top">http://en.wikipedia.org/wiki/DFSG</a>&#65289;&#30340;&#65292;&#24182;&#19988;&#33267;&#23569;&#20197;&#25105;&#30475;&#26469;&#65292;&#26080;&#35770;&#26159;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#36824;&#26159;&#24320;&#28304;&#30740;&#31350;&#38498;&#37117;&#27809;&#26377;&#25552;&#20986;&#20005;&#37325;&#30340;&#21453;&#23545;&#12290;&#22914;&#26524;&#20320;&#30693;&#36947;&#19968;&#20010;&#35768;&#21487;&#35777;&#26159;DFSG-&#31526;&#21512;&#30340;&#65292;&#20320;&#23601;&#30693;&#36947;&#23427;&#20445;&#35777;&#20102;&#25903;&#25345;&#24320;&#28304;&#39033;&#30446;&#21160;&#24577;&#24615;&#30340;&#37325;&#35201;&#33258;&#30001;&#34892;&#65288;&#20363;&#22914;&#29978;&#33267;&#36829;&#32972;&#26368;&#21021;&#20316;&#32773;&#24847;&#24895;&#30340;&#21487;&#20998;&#21449;&#24615;&#65289;&#12290;&#26412;&#31456;&#35752;&#35770;&#30340;&#35768;&#21487;&#35777;&#37117;&#26159;DFSG-&#31526;&#21512;&#30340;&#12290;</p></dd><dt><span class="term"><em class="firstterm">OSI-&#30830;&#35748;</em></span></dt><dd><p>&#32463;&#30001;&#24320;&#28304;&#30740;&#31350;&#38498;&#30830;&#35748;&#12290;&#36825;&#26159;&#21478;&#22806;&#19968;&#20010;&#24191;&#27867;&#37319;&#29992;&#30340;&#30830;&#23450;&#35768;&#21487;&#35777;&#26159;&#21542;&#25191;&#34892;&#25152;&#26377;&#24517;&#35201;&#33258;&#30001;&#30340;&#27979;&#35797;&#12290;OSI&#23545;&#24320;&#28304;&#36719;&#20214;&#30340;&#23450;&#20041;&#22522;&#20110;Debian&#33258;&#30001;&#36719;&#20214;&#26041;&#38024;&#65292;&#21482;&#35201;&#31526;&#21512;&#20854;&#20013;&#19968;&#20010;&#23450;&#20041;&#23601;&#20960;&#20046;&#21487;&#20197;&#31526;&#21512;&#21478;&#19968;&#20010;&#23450;&#20041;&#12290;&#36825;&#20960;&#24180;&#26377;&#20102;&#19968;&#20123;&#20363;&#22806;&#65292;&#20294;&#26159;&#21482;&#21253;&#25324;niche licenses&#65292;&#19982;&#36825;&#37324;&#27627;&#26080;&#20851;&#31995;&#12290;&#19981;&#20687;Debian&#39033;&#30446;&#65292;OSI&#32500;&#25252;&#20102;&#19968;&#20010;&#25152;&#26377;&#24050;&#32463;&#32463;&#36807;&#30830;&#35748;&#30340;&#35768;&#21487;&#35777;&#21015;&#34920;&#65292;&#20301;&#20110;<a class="ulink" href="http://www.opensource.org/licenses/" target="_top">http://www.opensource.org/licenses/</a>&#65292;&#25152;&#20197;&#34987;&#8220;OSI-&#30830;&#35748;&#8221;&#26159;&#19968;&#20010;&#27627;&#19981;&#21547;&#31946;&#30340;&#29366;&#24577;&#65306;&#35768;&#21487;&#35777;&#26159;&#21542;&#22312;&#36825;&#20010;&#21015;&#34920;&#20013;&#12290;</p><p>&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#22312;<a class="ulink" href="http://www.fsf.org/licensing/licenses/license-list.html" target="_top">http://www.fsf.org/licensing/licenses/license-list.html</a>&#32500;&#25252;&#20102;&#19968;&#20010;&#35768;&#21487;&#35777;&#30340;&#21015;&#34920;&#12290;FSF&#19981;&#20165;&#20165;&#26681;&#25454;&#26159;&#21542;&#33258;&#30001;&#26469;&#20998;&#31867;&#35768;&#21487;&#35777;&#65292;&#32780;&#26159;&#26681;&#25454;&#20854;&#26159;&#21542;&#19982;GNU&#30340;GPL&#20860;&#23481;&#20998;&#31867;&#12290;GPL&#20860;&#23481;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#20027;&#39064;&#65292;&#23558;&#20250;&#22312;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="license-compatibility.html" title="GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;">the section called &#8220;GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;&#8221;</a>&#20171;&#32461;&#12290;</p></dd><dt><span class="term"><em class="firstterm">&#31169;&#26377;</em>,
                      <em class="firstterm">&#38381;&#28304;</em></span></dt><dd><p>&#8220;&#33258;&#30001;&#8221;&#25110;&#8220;&#24320;&#28304;&#8221;&#30340;&#23545;&#31435;&#38754;&#12290;&#36825;&#24847;&#21619;&#30528;&#36719;&#20214;&#25353;&#29031;&#20256;&#32479;&#30340;&#12289;&#22522;&#20110;&#25480;&#26435;&#30340;&#35768;&#21487;&#26465;&#27454;&#20998;&#21457;&#65292;&#29992;&#25143;&#38656;&#35201;&#20026;&#27599;&#19968;&#20221;&#25335;&#36125;&#25903;&#20184;&#65292;&#20134;&#25110;&#32773;&#25353;&#29031;&#20854;&#20182;&#36275;&#22815;&#38480;&#21046;&#24320;&#28304;&#21160;&#24577;&#24615;&#25805;&#20316;&#30340;&#26465;&#27454;&#20998;&#21457;&#12290;&#21363;&#20351;&#36719;&#20214;&#21487;&#20197;&#19981;&#25903;&#20184;&#30340;&#24773;&#20917;&#19979;&#20998;&#21457;&#20063;&#21487;&#20197;&#26159;&#31169;&#26377;&#36719;&#20214;&#65292;&#21482;&#35201;&#23427;&#30340;&#35768;&#21487;&#35777;&#31105;&#27490;&#33258;&#30001;&#20998;&#21457;&#21644;&#20462;&#25913;&#12290;</p><p>&#36890;&#24120;&#26469;&#35828;&#8220;&#31169;&#26377;&#8221;&#21644;&#8220;&#38381;&#28304;&#8221;&#26159;&#21516;&#20041;&#35789;&#12290;&#28982;&#32780;&#8220;&#38381;&#28304;&#8221;&#26377;&#29978;&#33267;&#30475;&#19981;&#21040;&#28304;&#20195;&#30721;&#30340;&#38468;&#21152;&#21547;&#20041;&#12290;&#22240;&#20026;&#22823;&#22810;&#25968;&#31169;&#26377;&#36719;&#20214;&#30475;&#19981;&#21040;&#28304;&#20195;&#30721;&#65292;&#25152;&#20197;&#36825;&#32463;&#24120;&#26159;&#19968;&#20010;&#27809;&#26377;&#24046;&#21035;&#30340;&#21306;&#21035;&#12290;&#28982;&#32780;&#65292;&#20598;&#28982;&#24773;&#20917;&#19979;&#65292;&#26377;&#19968;&#20123;&#20154;&#20250;&#20351;&#29992;&#20801;&#35768;&#20854;&#20182;&#20154;&#26597;&#30475;&#20195;&#30721;&#30340;&#35768;&#21487;&#35777;&#21457;&#24067;&#31169;&#26377;&#36719;&#20214;&#12290;&#20196;&#20154;&#28151;&#28102;&#30340;&#26159;&#65292;&#20182;&#20204;&#26377;&#26102;&#31216;&#20043;&#20026;&#8220;&#24320;&#28304;&#8221;&#25110;&#8220;&#36817;&#20284;&#24320;&#28304;&#8221;&#31561;&#31561;&#65292;&#20294;&#30830;&#23454;&#26159;&#35823;&#23548;&#12290;&#28304;&#20195;&#30721;&#30340;<span class="emphasis"><em>&#21487;&#35265;&#24615;</em></span>&#30830;&#23454;&#19981;&#26159;&#38382;&#39064;&#25152;&#22312;&#65307;&#37325;&#35201;&#30340;&#38382;&#39064;&#26159;&#20320;&#33021;&#23545;&#27492;&#20570;&#20160;&#20040;&#12290;&#22240;&#32780;&#65292;&#31169;&#26377;&#21644;&#38381;&#28304;&#30340;&#21306;&#21035;&#20960;&#20046;&#27627;&#19981;&#30456;&#20851;&#65292;&#20108;&#32773;&#21487;&#20197;&#34987;&#24403;&#20316;&#21516;&#20041;&#35789;&#12290;</p><p>&#26377;&#26102;&#20250;&#20351;&#29992;<em class="firstterm">&#21830;&#19994;</em>&#20316;&#20026;&#8220;&#31169;&#26377;&#8221;&#30340;&#21516;&#20041;&#35789;&#65292;&#20294;&#26159;&#20005;&#26684;&#35828;&#26469;&#65292;&#20108;&#32773;&#24182;&#19981;&#26159;&#19968;&#22238;&#20107;&#12290;&#33258;&#30001;&#36719;&#20214;&#20063;&#21487;&#20197;&#26159;&#21830;&#19994;&#36719;&#20214;&#12290;&#27605;&#31455;&#65292;&#33258;&#30001;&#36719;&#20214;&#21487;&#20197;&#20986;&#21806;&#65292;&#21482;&#35201;&#36141;&#20080;&#32773;&#27809;&#26377;&#34987;&#38480;&#21046;&#20026;&#31105;&#27490;&#25918;&#20986;&#20182;&#20204;&#33258;&#24049;&#30340;&#25335;&#36125;&#12290;&#22312;&#20854;&#20182;&#26041;&#38754;&#20063;&#21487;&#20197;&#26159;&#21830;&#19994;&#30340;&#65292;&#20363;&#22914;&#20986;&#21806;&#25903;&#25345;&#12289;&#26381;&#21153;&#21644;&#35748;&#35777;&#12290;&#29616;&#22312;&#26377;&#35768;&#22810;&#25968;&#30334;&#19975;&#32654;&#20803;&#30340;&#20844;&#21496;&#26159;&#24314;&#31435;&#22312;&#33258;&#30001;&#36719;&#20214;&#20043;&#19978;&#30340;&#65292;&#25152;&#26377;&#27809;&#26377;&#20160;&#20040;&#22266;&#26377;&#30340;&#21453;&#21830;&#19994;&#21644;&#21453;&#20844;&#21496;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;<span class="emphasis"><em>&#20854;</em></span>&#21453;&#31169;&#26377;&#21017;&#26159;&#26412;&#24615;&#65292;&#36825;&#26159;&#20854;&#21306;&#21035;&#19982;&#20256;&#32479;&#27599;&#25335;&#36125;&#35768;&#21487;&#35777;&#27169;&#22411;&#30340;&#20851;&#38190;&#26041;&#24335;&#12290;</p></dd><dt><span class="term"><em class="firstterm">&#20844;&#20849;&#22495;</em></span></dt><dd><p>&#27809;&#26377;&#29256;&#26435;&#25152;&#26377;&#32773;&#65292;&#20063;&#23601;&#26159;&#35828;&#27809;&#26377;&#20154;&#25317;&#26377;&#21487;&#20197;&#38480;&#21046;&#22797;&#21046;&#36825;&#20123;&#20316;&#21697;&#30340;&#26435;&#21033;&#12290;&#36827;&#20837;&#20844;&#20849;&#22495;&#20013;&#19982;&#27809;&#26377;&#20316;&#32773;&#24182;&#19981;&#30456;&#21516;&#12290;&#20219;&#20309;&#20107;&#29289;&#37117;&#26377;&#19968;&#20010;&#20316;&#32773;&#65292;&#21363;&#20351;&#26576;&#20010;&#20316;&#21697;&#30340;&#20316;&#32773;&#36873;&#25321;&#23558;&#20316;&#21697;&#25918;&#21040;&#20844;&#20849;&#22495;&#65292;&#36825;&#25913;&#21464;&#19981;&#20102;&#20182;&#20204;&#32534;&#20889;&#30340;&#20107;&#23454;&#12290;</p><p>&#24403;&#19968;&#20010;&#20316;&#21697;&#36827;&#20837;&#20844;&#20849;&#22495;&#65292;&#30001;&#20854;&#32452;&#25104;&#30340;&#26448;&#26009;&#21487;&#20197;&#21464;&#25104;&#26377;&#29256;&#26435;&#30340;&#20316;&#21697;&#65292;&#20043;&#21518;&#35813;&#26448;&#26009;&#30340;<span class="emphasis"><em>&#25335;&#36125;</em></span>&#19982;&#25972;&#20010;&#20316;&#21697;&#22788;&#20110;&#21516;&#19968;&#20010;&#29256;&#26435;&#19979;&#12290;&#20294;&#26159;&#36825;&#19981;&#20250;&#24433;&#21709;&#21407;&#22987;&#20316;&#21697;&#30340;&#23384;&#22312;&#24615;&#65292;&#23427;&#36824;&#26159;&#20250;&#20445;&#23384;&#22312;&#20844;&#20849;&#22495;&#12290;&#22240;&#32780;&#65292;&#22312;&#20844;&#20849;&#22495;&#21457;&#24067;&#19968;&#20123;&#19996;&#35199;&#20174;&#25216;&#26415;&#35762;&#23601;&#26159;&#26681;&#25454;&#22823;&#22810;&#25968;&#33258;&#30001;&#36719;&#20214;&#35748;&#35777;&#32452;&#32455;&#30340;&#26041;&#38024;&#65292;&#20351;&#20043;&#8220;&#33258;&#30001;&#8221;&#12290;&#28982;&#32780;&#65292;&#36890;&#24120;&#26377;&#35768;&#22810;&#21407;&#22240;&#20419;&#20351;&#25105;&#20204;&#20351;&#29992;&#19968;&#20123;&#35768;&#21487;&#35777;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#31616;&#21333;&#30340;&#21457;&#24067;&#21040;&#20844;&#20849;&#22495;&#65306;&#21363;&#20351;&#23545;&#20110;&#33258;&#30001;&#36719;&#20214;&#65292;&#29305;&#23450;&#30340;&#38480;&#21046;&#20063;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#65292;&#36825;&#19981;&#20165;&#20165;&#26159;&#23545;&#20110;&#29256;&#26435;&#30340;&#25152;&#26377;&#32773;&#65292;&#20063;&#26159;&#23545;&#20854;&#20182;&#25509;&#21463;&#32773;&#65292;&#19979;&#20010;&#23567;&#33410;&#20250;&#28548;&#28165;&#36825;&#20010;&#38382;&#39064;&#12290;</p></dd><dt><span class="term"><em class="firstterm">copyleft</em></span></dt><dd><p>&#20351;&#29992;&#29256;&#26435;&#27861;&#21462;&#24471;&#21453;&#23545;&#20256;&#32479;&#29256;&#26435;&#30340;&#32467;&#26524;&#30340;&#35768;&#21487;&#35777;&#12290;&#21462;&#20915;&#20110;&#20320;&#25152;&#38382;&#30340;&#20154;&#65292;&#36825;&#20010;&#35768;&#21487;&#35777;&#21487;&#33021;&#26159;&#20801;&#35768;&#36825;&#37324;&#35752;&#35770;&#30340;&#33258;&#30001;&#65292;&#20063;&#21487;&#33021;&#26159;&#26356;&#31364;&#19968;&#20123;&#65292;&#24182;&#38750;&#20801;&#35768;&#36825;&#20123;&#33258;&#30001;&#65292;&#32780;&#26159;&#36890;&#36807;&#22865;&#32422;&#20445;&#35777;&#24517;&#39035;&#22312;&#20316;&#21697;&#20013;&#23653;&#34892;&#33258;&#30001;&#65292;<span class="emphasis"><em>&#24378;&#21046;</em></span>&#23427;&#20204;&#30340;&#35768;&#21487;&#35777;&#12290;&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;&#25490;&#20182;&#30340;&#20351;&#29992;&#31532;&#20108;&#31181;&#23450;&#20041;&#65307;&#20854;&#20182;&#24773;&#20917;&#19979;&#21017;&#21482;&#26159;&#21254;&#24537;&#19978;&#39532;&#65306;&#35768;&#22810;&#20154;&#20687;FSF&#19968;&#26679;&#20351;&#29992;&#36825;&#20010;&#26415;&#35821;&#65292;&#20294;&#26159;&#20854;&#20182;&#20154;&#8212;&#21253;&#25324;&#37027;&#20123;&#20026;&#20027;&#27969;&#23186;&#20307;&#20889;&#20316;&#30340;&#20154;&#8212;&#20542;&#21521;&#20110;&#31532;&#19968;&#31181;&#23450;&#20041;&#12290;&#19981;&#22826;&#28165;&#26970;&#20351;&#29992;&#36825;&#20010;&#26415;&#35821;&#30340;&#20154;&#26159;&#21542;&#24847;&#35782;&#21040;&#20102;&#38656;&#35201;&#20570;&#19968;&#20123;&#21306;&#20998;&#12290;</p><p>&#19968;&#20010;&#26412;&#22320;&#30340;&#20363;&#23376;&#26356;&#21152;&#29421;&#31364;&#65292;&#19968;&#20010;&#26356;&#20005;&#26684;&#30340;&#23450;&#20041;&#26159;GNU GPL&#65292;&#24378;&#21046;&#25152;&#26377;&#34893;&#29983;&#30340;&#20316;&#21697;&#20063;&#24517;&#39035;&#20351;&#29992;GPL&#35768;&#21487;&#35777;&#65307;&#26356;&#22810;&#20449;&#24687;&#35831;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="license-compatibility.html" title="GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;">the section called &#8220;GPL&#21644;&#35768;&#21487;&#35777;&#20860;&#23481;&#24615;&#8221;</a>&#12290;</p></dd></dl></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="forks.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="license-aspects.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20998;&#21449; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#35768;&#21487;&#35777;&#30340;&#26041;&#38754;</td></tr></table></div></body></html>
