<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#38271;&#26399;&#38599;&#20323;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="next" href="appear-as-many.html" title="&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#38271;&#26399;&#38599;&#20323;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="money.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="appear-as-many.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#38271;&#26399;&#38599;&#20323;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="long-term-developers"></a>&#38271;&#26399;&#38599;&#20323;</h2></div></div></div><p>&#22914;&#26524;&#20320;&#27491;&#22312;&#31649;&#29702;&#24320;&#28304;&#39033;&#30446;&#20013;&#30340;&#31243;&#24207;&#21592;&#65292;&#35201;&#23613;&#37327;&#20445;&#25345;&#36275;&#22815;&#30340;&#26102;&#38388;&#65292;&#36825;&#26679;&#20182;&#20204;&#25165;&#33021;&#33719;&#24471;&#36275;&#22815;&#30340;&#25216;&#26415;&#21644;&#25919;&#27835;&#25216;&#33021;&#8212;&#26368;&#23569;&#20063;&#38656;&#35201;&#20960;&#24180;&#26102;&#38388;&#12290;&#24403;&#28982;&#65292;&#27809;&#26377;&#39033;&#30446;&#65292;&#26080;&#35770;&#26159;&#24320;&#28304;&#36824;&#26159;&#38381;&#28304;&#65292;&#37117;&#21487;&#20197;&#20174;&#36718;&#25442;&#31243;&#24207;&#21592;&#20013;&#33719;&#30410;&#12290;&#26032;&#26469;&#32773;&#25630;&#28165;&#26970;&#31373;&#38376;&#38656;&#35201;&#30340;&#26102;&#38388;&#22312;&#19981;&#21516;&#29615;&#22659;&#19979;&#21508;&#19981;&#30456;&#21516;&#12290;&#20294;&#26159;&#22312;&#24320;&#28304;&#39033;&#30446;&#20013;&#30340;&#20195;&#20215;&#26356;&#21152;&#24040;&#22823;&#65292;&#22240;&#20026;&#31163;&#24320;&#30340;&#24320;&#21457;&#32773;&#19981;&#20165;&#24102;&#36208;&#20102;&#20182;&#20204;&#30340;&#30693;&#35782;&#65292;&#20063;&#24102;&#36208;&#20102;&#31038;&#21306;&#20013;&#30340;&#20182;&#20204;&#30340;&#22320;&#20301;&#21644;&#20854;&#20013;&#24314;&#31435;&#30340;&#20154;&#38469;&#20851;&#31995;&#12290;</p><p>&#24320;&#21457;&#32773;&#24050;&#32463;&#31215;&#32047;&#30340;&#20449;&#35465;&#19981;&#33021;&#22815;&#20256;&#36882;&#12290;&#19968;&#20010;&#26032;&#26469;&#30340;&#24320;&#21457;&#32773;&#19981;&#33021;&#32487;&#25215;&#26469;&#33258;&#31163;&#24320;&#32773;&#30340;&#25552;&#20132;&#26435;&#38480;&#65288;&#21487;&#20197;&#26412;&#31456;&#21518;&#38754;&#30340;<a class="xref" href="money-vs-love.html" title="&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;">the section called &#8220;&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;&#8221;</a>&#65289;&#65292;&#22914;&#26524;&#26032;&#30340;&#24320;&#21457;&#32773;&#36824;&#27809;&#26377;&#25552;&#20132;&#26435;&#38480;&#65292;&#22312;&#33719;&#24471;&#36825;&#20010;&#26435;&#38480;&#20043;&#21069;&#23427;&#21482;&#33021;&#25552;&#20132;&#34917;&#19969;&#12290;&#20294;&#26159;&#25552;&#20132;&#26435;&#38480;&#21482;&#26159;&#25152;&#22833;&#21435;&#30340;&#24433;&#21709;&#20013;&#26368;&#23481;&#26131;&#24230;&#37327;&#30340;&#34920;&#29616;&#12290;&#19968;&#20010;&#38271;&#26399;&#30340;&#24320;&#21457;&#32773;&#20063;&#30693;&#36947;&#37038;&#20214;&#21015;&#34920;&#20013;&#25152;&#26377;&#20197;&#21069;&#36798;&#25104;&#21644;&#26410;&#36798;&#25104;&#19968;&#33268;&#30340;&#35752;&#35770;&#12290;&#19968;&#20010;&#26032;&#30340;&#24320;&#21457;&#32773;&#65292;&#27809;&#26377;&#36825;&#20123;&#23545;&#35805;&#30340;&#35760;&#24518;&#65292;&#20063;&#35768;&#20250;&#20877;&#27425;&#21457;&#36215;&#26576;&#20123;&#35752;&#35770;&#65292;&#36825;&#20250;&#25439;&#22833;&#22312;&#32452;&#32455;&#20013;&#30340;&#20449;&#35465;&#65307;&#20854;&#20182;&#20154;&#20250;&#22855;&#24618;&#20026;&#20160;&#20040;&#8220;&#20182;&#20204;&#20160;&#20040;&#20063;&#35760;&#19981;&#20303;&#65311;&#8221;&#26032;&#30340;&#24320;&#21457;&#32773;&#20063;&#23545;&#39033;&#30446;&#29305;&#24615;&#27809;&#26377;&#22826;&#22810;&#25919;&#27835;&#24863;&#35273;&#65292;&#25152;&#20197;&#20063;&#19981;&#33021;&#35937;&#32769;&#25163;&#19968;&#26679;&#36805;&#36895;&#21644;&#24179;&#28369;&#30340;&#24433;&#21709;&#24320;&#21457;&#26041;&#21521;&#12290;</p><p>&#36890;&#36807;&#25351;&#23548;&#22865;&#32422;&#30340;&#31243;&#24207;&#26469;&#35757;&#32451;&#26032;&#25163;&#12290;&#26032;&#30340;&#24320;&#21457;&#32773;&#31532;&#19968;&#22825;&#23601;&#21487;&#20197;&#19982;&#20844;&#20849;&#24320;&#21457;&#31038;&#21306;&#30452;&#25509;&#20132;&#27969;&#65292;&#20174;bug&#20462;&#27491;&#21644;&#28165;&#29702;&#20219;&#21153;&#24320;&#22987;&#65292;&#36825;&#26679;&#20182;&#20204;&#21487;&#20197;&#36880;&#28176;&#29087;&#24713;&#20195;&#30721;&#22522;&#24182;&#22312;&#31038;&#21306;&#33719;&#21462;&#22768;&#35465;&#65292;&#23613;&#31649;&#27492;&#26102;&#20182;&#20204;&#36824;&#19981;&#33021;&#22312;&#35774;&#35745;&#35752;&#35770;&#20013;&#36454;&#20986;&#28779;&#33457;&#12290;&#19968;&#20010;&#25110;&#22810;&#20010;&#26377;&#32463;&#39564;&#30340;&#24320;&#21457;&#32773;&#24212;&#24403;&#19968;&#30452;&#36127;&#36131;&#35299;&#24785;&#30340;&#20219;&#21153;&#65292;&#38405;&#35835;&#26032;&#25163;&#22312;&#24320;&#21457;&#21015;&#34920;&#20013;&#30340;&#27599;&#19968;&#31687;&#24086;&#23376;&#65292;&#21363;&#20351;&#26159;&#32463;&#39564;&#20016;&#23500;&#30340;&#24320;&#21457;&#32773;&#36890;&#24120;&#19981;&#20250;&#27880;&#24847;&#30340;&#20869;&#23481;&#12290;&#36825;&#21487;&#20197;&#24110;&#21161;&#22242;&#38431;&#22312;&#26032;&#25163;&#25601;&#27973;&#20043;&#21069;&#23450;&#20301;&#28508;&#22312;&#30340;&#26263;&#30977;&#12290;&#31169;&#19979;&#30340;&#24149;&#21518;&#40723;&#21169;&#21644;&#24544;&#21578;&#20063;&#20250;&#38750;&#24120;&#26377;&#30410;&#65292;&#29305;&#21035;&#26159;&#24403;&#26032;&#25163;&#19981;&#20064;&#24815;&#22823;&#37327;&#30340;&#20195;&#30721;&#24179;&#34892;&#21516;&#32423;&#35780;&#23457;&#30340;&#26102;&#20505;&#12290;</p><p>&#24403;CollabNet&#38599;&#20323;&#26032;&#30340;&#24320;&#21457;&#32773;&#20026;Subversion&#24037;&#20316;&#26102;&#65292;&#25105;&#20204;&#20250;&#22352;&#22312;&#19968;&#36215;&#20026;&#26032;&#20154;&#25214;&#19968;&#20123;&#25171;&#24320;&#30340;bug&#26469;&#32451;&#32451;&#25163;&#12290;&#25105;&#20204;&#20250;&#35752;&#35770;&#35299;&#20915;&#26041;&#26696;&#30340;&#25216;&#26415;&#35201;&#28857;&#65292;&#24182;&#35753;&#33267;&#23569;&#19968;&#20010;&#26377;&#32463;&#39564;&#30340;&#24320;&#21457;&#32773;&#26469;&#35780;&#23457;&#65288;&#20844;&#24320;&#30340;&#65289;&#26032;&#24320;&#21457;&#32773;&#30340;&#34917;&#19969;&#65288;&#20063;&#26159;&#20844;&#24320;&#30340;&#65289;&#12290;&#25105;&#20204;&#36890;&#24120;&#19981;&#20250;&#22312;&#20027;&#24320;&#21457;&#21015;&#34920;&#20844;&#24320;&#20043;&#21069;&#26597;&#30475;&#36825;&#20010;&#34917;&#19969;&#65292;&#34429;&#28982;&#65292;&#22914;&#26524;&#24773;&#20917;&#29305;&#27530;&#65292;&#25105;&#20204;&#21487;&#20197;&#22914;&#27492;&#12290;&#37325;&#35201;&#30340;&#26159;&#65292;&#26032;&#24320;&#21457;&#32773;&#32463;&#21382;&#20844;&#24320;&#35780;&#23457;&#30340;&#36807;&#31243;&#20013;&#65292;&#22312;&#29087;&#24713;&#20195;&#30721;&#22522;&#30340;&#21516;&#26102;&#65292;&#20063;&#38656;&#35201;&#20064;&#24815;&#20110;&#25509;&#21463;&#26469;&#33258;&#23436;&#20840;&#26159;&#38476;&#29983;&#20154;&#30340;&#25209;&#35780;&#12290;&#20294;&#26159;&#25105;&#20204;&#20250;&#35843;&#25972;&#26102;&#26426;&#65292;&#20445;&#35777;&#25105;&#20204;&#30340;&#35780;&#23457;&#20250;&#22312;&#34917;&#19969;&#21457;&#20986;&#20043;&#21518;&#31435;&#21051;&#20986;&#29616;&#12290;&#36825;&#26679;&#21015;&#34920;&#20013;&#20986;&#29616;&#30340;&#31532;&#19968;&#20010;&#35780;&#23457;&#23601;&#26159;&#25105;&#20204;&#30340;&#65292;&#36825;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#30830;&#31435;&#20854;&#20182;&#35780;&#23457;&#30340;&#22522;&#35843;&#12290;&#23427;&#20063;&#21487;&#20197;&#21152;&#24378;&#19968;&#20010;&#27010;&#24565;&#65292;&#20063;&#23601;&#26159;&#36825;&#20010;&#26032;&#20154;&#38656;&#35201;&#35748;&#30495;&#23545;&#24453;&#65306;&#22914;&#26524;&#20854;&#20182;&#20154;&#30475;&#21040;&#25105;&#20204;&#33457;&#26102;&#38388;&#25552;&#20379;&#35814;&#32454;&#30340;&#35780;&#23457;&#65292;&#24182;&#21253;&#21547;&#23436;&#25972;&#30340;&#35299;&#37322;&#21644;&#24402;&#26723;&#20013;&#21512;&#36866;&#30340;&#21442;&#32771;&#65292;&#20182;&#20204;&#20250;&#24847;&#35782;&#21040;&#27491;&#22312;&#36827;&#34892;&#19968;&#31181;&#22521;&#35757;&#65292;&#24182;&#24847;&#21619;&#30528;&#19968;&#20010;&#38271;&#26399;&#30340;&#25237;&#36164;&#12290;&#36825;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#23545;&#37027;&#20010;&#24320;&#21457;&#32773;&#20445;&#25345;&#27491;&#38754;&#30340;&#24577;&#24230;&#65292;&#33267;&#23569;&#20250;&#33457;&#36153;&#26356;&#22810;&#30340;&#26102;&#38388;&#22238;&#31572;&#38382;&#39064;&#21644;&#35780;&#23457;&#34917;&#19969;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="money.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="appear-as-many.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 5. &#37329;&#38065; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;</td></tr></table></div></body></html>
