<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#37038;&#20214;&#21015;&#34920;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="prev" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="next" href="vc.html" title="&#29256;&#26412;&#25511;&#21046;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#37038;&#20214;&#21015;&#34920;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="technical-infrastructure.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th><td width="20%" align="right"> <a accesskey="n" href="vc.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#37038;&#20214;&#21015;&#34920;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mailing-lists"></a>&#37038;&#20214;&#21015;&#34920;</h2></div></div></div><p>&#37038;&#20214;&#21015;&#34920;&#26377;&#22914;&#39033;&#30446;&#20132;&#27969;&#30340;&#38754;&#21253;&#21644;&#40644;&#27833;&#12290;&#22914;&#26524;&#29992;&#25143;&#22312;&#38500;&#20102;&#32593;&#39029;&#20043;&#22806;&#30340;&#22320;&#26041;&#27983;&#35272;&#65292;&#26368;&#26377;&#21487;&#33021;&#26159;&#39033;&#30446;&#30340;&#26576;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#12290;&#19981;&#36807;&#22312;&#20307;&#39564;&#37038;&#20214;&#21015;&#34920;&#26412;&#36523;&#20043;&#21069;&#65292;&#20182;&#20204;&#23558;&#25509;&#35302;&#37038;&#20214;&#21015;&#34920;&#30340;&#30028;&#38754;&#8212;&#20063;&#23601;&#26159;&#21152;&#20837;&#21015;&#34920;&#65288;&#8220;&#35746;&#38405;&#21040;&#8221;&#65289;&#30340;&#26426;&#21046;&#12290;&#30001;&#27492;&#24102;&#26469;&#20102;&#37038;&#20214;&#21015;&#34920;&#30340;#1&#27861;&#21017;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#19981;&#35201;&#35797;&#22270;&#25163;&#24037;&#31649;&#29702;&#37038;&#20214;&#21015;&#34920;&#8212;&#35753;&#36719;&#20214;&#26469;&#20570;&#12290;</em></span></p></blockquote></div><p>&#25918;&#24323;&#36825;&#19968;&#28857;&#20805;&#28385;&#35825;&#24785;&#65292;&#24320;&#22987;&#26102;&#23601;&#35774;&#32622;&#36719;&#20214;&#26469;&#31649;&#29702;&#37038;&#20214;&#21015;&#34920;&#30475;&#36215;&#26469;&#26377;&#20123;&#23567;&#39064;&#22823;&#20570;&#20102;&#12290;&#25163;&#21160;&#31649;&#29702;&#23567;&#22411;&#20302;&#27969;&#37327;&#30340;&#37038;&#20214;&#21015;&#34920;&#20284;&#20046;&#26159;&#29702;&#25152;&#24403;&#28982;&#30340;&#65306;&#20320;&#21482;&#38656;&#35774;&#32622;&#19968;&#20010;&#25351;&#21521;&#33258;&#24049;&#30340;&#35746;&#38405;&#22320;&#22336;&#65292;&#28982;&#21518;&#24403;&#26377;&#20154;&#21521;&#20854;&#21457;&#36865;&#37038;&#20214;&#65292;&#20320;&#25226;&#20182;&#20204;&#30340;&#37038;&#20214;&#22320;&#22336;&#21152;&#20837;&#65288;&#25110;&#26159;&#21024;&#38500;&#65289;&#19968;&#20010;&#20445;&#23384;&#20102;&#25152;&#26377;&#22320;&#22336;&#30340;&#25991;&#26412;&#25991;&#20214;&#20013;&#12290;&#36824;&#33021;&#27604;&#36825;&#26356;&#31616;&#21333;&#30340;&#21527;&#65311;</p><p>&#38382;&#39064;&#22312;&#20110;&#65292;&#20154;&#20204;&#25152;&#26399;&#26395;&#30340;&#22909;&#30340;&#21015;&#34920;&#31649;&#29702;&#24182;&#38750;&#26159;&#22914;&#27492;&#31616;&#21333;&#12290;&#23427;&#19981;&#20165;&#21482;&#26159;&#25353;&#29992;&#25143;&#30340;&#38656;&#27714;&#35746;&#38405;&#25110;&#26159;&#36864;&#35746;&#32780;&#24050;&#12290;&#36824;&#21253;&#25324;&#38450;&#27490;&#22403;&#22334;&#37038;&#20214;&#65292;&#25552;&#20379;&#21457;&#36865;&#37038;&#20214;&#21015;&#34920;&#25688;&#35201;&#32780;&#19981;&#26159;&#27599;&#26465;&#20449;&#24687;&#37117;&#21457;&#36865;&#30340;&#30340;&#24418;&#24335;&#65292;&#36890;&#36807;&#33258;&#21160;&#24212;&#31572;&#26426;&#25552;&#20379;&#26631;&#20934;&#21015;&#34920;&#21644;&#39033;&#30446;&#20449;&#24687;&#65292;&#20197;&#21450;&#35768;&#22810;&#20854;&#20182;&#20107;&#24773;&#12290;&#19968;&#20010;&#30001;&#20154;&#30417;&#25511;&#30340;&#35746;&#38405;&#22320;&#22336;&#21482;&#33021;&#25903;&#25345;&#26368;&#23567;&#25968;&#37327;&#30340;&#31616;&#38475;&#21151;&#33021;&#65292;&#32780;&#19988;&#22312;&#21487;&#38752;&#24615;&#21644;&#21453;&#24212;&#36895;&#24230;&#19978;&#20063;&#19981;&#22914;&#36719;&#20214;&#12290;</p><p>&#29616;&#20195;&#21270;&#30340;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#33267;&#23569;&#25552;&#20379;&#20102;&#20197;&#19979;&#36825;&#20123;&#29305;&#24615;&#65306;</p><div class="variablelist"><dl><dt><span class="term">&#21516;&#26102;&#36890;&#36807;&#37038;&#20214;&#21644;&#32593;&#39029;&#35746;&#38405;</span></dt><dd><p>&#24403;&#29992;&#25143;&#35746;&#38405;&#19968;&#20010;&#21015;&#34920;&#26102;&#65292;&#22905;&#24212;&#24403;&#33021;&#31435;&#21363;&#25910;&#21040;&#19968;&#26465;&#34920;&#31034;&#27426;&#36814;&#30340;&#22238;&#22797;&#65292;&#21578;&#30693;&#22905;&#35746;&#38405;&#20102;&#20160;&#20040;&#65292;&#19979;&#19968;&#27493;&#35813;&#22914;&#20309;&#20351;&#29992;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#65292;&#24182;&#19988;&#65288;&#20063;&#26159;&#26368;&#37325;&#35201;&#30340;&#65289;&#21578;&#30693;&#22914;&#20309;&#36864;&#35746;&#12290;&#24403;&#28982;&#65292;&#36825;&#20010;&#22238;&#22797;&#36824;&#24212;&#35813;&#33021;&#34987;&#23450;&#21046;&#22320;&#21152;&#20837;&#35832;&#22914;&#39033;&#30446;&#30340;&#31449;&#28857;&#65292;&#24120;&#35265;&#38382;&#39064;&#21644;&#22238;&#31572;&#31561;&#39033;&#30446;&#30340;&#29305;&#23450;&#20449;&#24687;&#12290;</p></dd><dt><span class="term">&#21487;&#36873;&#25321;&#25688;&#35201;&#25110;&#26159;&#27599;&#20010;&#20449;&#24687;&#21333;&#29420;&#21457;&#36865;&#30340;&#35746;&#38405;&#27169;&#24335;</span></dt><dd><p>&#36873;&#25321;&#25688;&#35201;&#27169;&#24335;&#65292;&#35746;&#38405;&#32773;&#27599;&#22825;&#20250;&#25910;&#21040;&#19968;&#23553;&#21253;&#21547;&#24403;&#22825;&#25152;&#26377;&#21015;&#34920;&#27963;&#21160;&#30340;&#37038;&#20214;&#12290;&#23545;&#37027;&#20123;&#24182;&#19981;&#32039;&#36319;&#21015;&#34920;&#65292;&#19981;&#20250;&#21442;&#19982;&#35752;&#35770;&#30340;&#29992;&#25143;&#65292;&#25688;&#35201;&#27169;&#24335;&#26356;&#21512;&#36866;&#20182;&#20204;&#65292;&#22240;&#20026;&#36825;&#20801;&#35768;&#20182;&#20204;&#22312;&#20219;&#20309;&#26102;&#21051;&#19968;&#27425;&#26816;&#32034;&#25152;&#26377;&#30340;&#20027;&#39064;&#65292;&#36991;&#20813;&#20102;&#38543;&#26426;&#26102;&#38388;&#21040;&#26469;&#37038;&#20214;&#30340;&#20998;&#31070;&#12290;</p></dd><dt><span class="term">&#23457;&#26680;&#29305;&#24615;</span></dt><dd><p>&#22312;&#37038;&#20214;&#21457;&#36865;&#21040;&#25972;&#20010;&#21015;&#34920;&#20043;&#21069;&#30340;&#8220;&#23457;&#26680;&#8221;&#26159;&#26816;&#26597;&#37038;&#20214;&#20197;&#30830;&#20445;&#65306;a) &#19981;&#26159;&#22403;&#22334;&#37038;&#20214;&#65292;&#20197;&#21450;b) &#31526;&#21512;&#20027;&#39064;&#12290;&#23457;&#26680;&#24517;&#39035;&#26377;&#20154;&#21442;&#19982;&#65292;&#20294;&#36719;&#20214;&#33021;&#24456;&#22823;&#31243;&#24230;&#30340;&#20351;&#20043;&#21464;&#24471;&#23481;&#26131;&#12290;&#21518;&#38754;&#36824;&#26377;&#20851;&#20110;&#23457;&#26680;&#30340;&#26356;&#22810;&#20869;&#23481;&#12290;</p></dd><dt><span class="term">&#31649;&#29702;&#30028;&#38754;</span></dt><dd><p>&#19981;&#31649;&#19968;&#20123;&#20854;&#20182;&#30340;&#20316;&#29992;&#65292;&#36825;&#20010;&#29305;&#24615;&#33267;&#23569;&#33021;&#35753;&#31649;&#29702;&#21592;&#36731;&#26494;&#22320;&#36827;&#20837;&#21015;&#34920;&#24182;&#21024;&#38500;&#19968;&#20010;&#24223;&#24323;&#30340;&#22320;&#22336;&#12290;&#24403;&#19968;&#20010;&#35746;&#38405;&#32773;&#30340;&#22320;&#22336;&#24320;&#22987;&#33258;&#21160;&#22320;&#23545;&#27599;&#19968;&#23553;&#21015;&#34920;&#37038;&#20214;&#21457;&#20986;&#8220;&#25105;&#24050;&#19981;&#22312;&#36825;&#20010;&#22320;&#22336;&#8221;&#30340;&#22238;&#22797;&#26102;&#65292;&#24773;&#20917;&#23601;&#21464;&#24471;&#38750;&#24120;&#32039;&#24613;&#20102;&#12290; &#65288;&#26377;&#20123;&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#29978;&#33267;&#33021;&#20381;&#38752;&#33258;&#36523;&#25429;&#33719;&#36825;&#31181;&#24773;&#20917;&#65292;&#24182;&#33258;&#21160;&#23436;&#25104;&#36864;&#35746;&#12290;&#65289;</p></dd><dt><span class="term">&#37038;&#20214;&#22836;&#22788;&#29702;</span></dt><dd><p>&#35768;&#22810;&#20154;&#22312;&#33258;&#24049;&#30340;&#30005;&#37038;&#23458;&#25143;&#31471;&#20013;&#35774;&#32622;&#20102;&#31934;&#23494;&#30340;&#36807;&#28388;&#21644;&#22238;&#22797;&#35268;&#21017;&#12290;&#20026;&#20102;&#21033;&#29992;&#36825;&#20123;&#20248;&#21183;&#65292;&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#33021;&#20026;&#36825;&#20123;&#20154;&#28155;&#21152;&#21644;&#22788;&#29702;&#26576;&#19968;&#31181;&#26631;&#20934;&#30340;&#37038;&#20214;&#22836;&#65288;&#26356;&#22810;&#35814;&#32454;&#20869;&#23481;&#21442;&#38405;&#19979;&#38754;&#65289;&#12290;</p></dd><dt><span class="term">&#24402;&#26723;</span></dt><dd><p>&#21457;&#24448;&#34987;&#31649;&#29702;&#21015;&#34920;&#30340;&#25152;&#26377;&#37038;&#20214;&#37117;&#20250;&#34987;&#20445;&#23384;&#65292;&#24182;&#19988;&#33021;&#22815;&#36890;&#36807;&#32593;&#39029;&#35775;&#38382;&#65307;&#26377;&#20123;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#20197;&#21487;&#25554;&#20837;&#30340;&#24418;&#24335;&#25552;&#20379;&#22806;&#37096;&#24402;&#26723;&#24037;&#20855;&#22914;MHonArc&#65288;<a class="ulink" href="http://www.mhonarc.org/" target="_top">http://www.mhonarc.org/</a>&#65289;&#30340;&#25509;&#21475;&#12290;&#23601;&#20687;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="growth.html#using-archives" title="&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;">the section called &#8220;&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;&#8221;</a>&#25152;&#35752;&#35770;&#30340;&#65292;&#24402;&#26723;&#24456;&#37325;&#35201;&#12290;</p></dd></dl></div><p>&#25152;&#26377;&#36825;&#20123;&#30340;&#35201;&#28857;&#26159;&#20026;&#20102;&#24378;&#35843;&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#26159;&#19968;&#20010;&#22797;&#26434;&#30340;&#38382;&#39064;&#65292;&#24050;&#32463;&#32791;&#36153;&#20102;&#35768;&#22810;&#24605;&#32771;&#65292;&#32780;&#19988;&#22823;&#22810;&#25968;&#24050;&#32463;&#34987;&#35299;&#20915;&#12290;&#20320;&#30830;&#23454;&#26080;&#39035;&#25104;&#20026;&#19968;&#20010;&#19987;&#23478;&#12290;&#20294;&#20320;&#24212;&#35813;&#30693;&#36947;&#65292;&#34429;&#28982;&#20854;&#20013;&#22823;&#37096;&#20998;&#24050;&#34987;&#35299;&#20915;&#65292;&#20294;&#24635;&#36824;&#26377;&#36827;&#27493;&#30340;&#31354;&#38388;&#65292;&#22312;&#36816;&#20316;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#36807;&#31243;&#20013;&#21015;&#34920;&#30340;&#31649;&#29702;&#23558;&#19968;&#27425;&#27425;&#22320;&#21344;&#25454;&#20320;&#30340;&#27880;&#24847;&#21147;&#12290;&#19979;&#38754;&#25105;&#20204;&#23558;&#22238;&#31572;&#20960;&#20010;&#26377;&#20851;&#37038;&#20214;&#21015;&#34920;&#37197;&#32622;&#30340;&#26368;&#24120;&#35265;&#38382;&#39064;&#12290;</p><div class="sect2" title="&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;"><div class="titlepage"><div><div><h3 class="title"><a name="spam-prevention"></a>&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;</h3></div></div></div><p>&#36825;&#20123;&#35805;&#20174;&#21160;&#31508;&#21040;&#20986;&#29256;&#30340;&#36825;&#27573;&#26102;&#38388;&#37324;&#65292;&#22240;&#29305;&#32593;&#19978;&#30340;&#22403;&#22334;&#37038;&#20214;&#38382;&#39064;&#24456;&#21487;&#33021;&#21448;&#20005;&#37325;&#20102;&#19968;&#20493;&#8212;&#25110;&#33267;&#23569;&#32473;&#20154;&#30340;&#24863;&#35273;&#26159;&#22914;&#27492;&#12290;&#26377;&#37027;&#20040;&#19968;&#27573;&#26102;&#38388;&#65292;&#23601;&#22312;&#19981;&#20037;&#20043;&#21069;&#65292;&#24403;&#26102;&#21487;&#20197;&#23436;&#20840;&#26080;&#39035;&#20219;&#20309;&#30340;&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;&#25514;&#23601;&#33021;&#36816;&#36716;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#12290;&#20598;&#23572;&#20250;&#26377;&#37027;&#20040;&#20960;&#23553;&#65292;&#21482;&#33021;&#26500;&#25104;&#23567;&#23567;&#30340;&#28902;&#24700;&#12290;&#22909;&#26085;&#23376;&#24050;&#32463;&#19968;&#21435;&#19981;&#22797;&#36820;&#20102;&#12290;&#29616;&#22312;&#22914;&#26524;&#37038;&#20214;&#21015;&#34920;&#27809;&#26377;&#22403;&#22334;&#38450;&#25252;&#25514;&#26045;&#65292;&#24456;&#24555;&#23601;&#20250;&#34987;&#20081;&#19971;&#20843;&#31967;&#30340;&#37038;&#20214;&#28153;&#27809;&#65292;&#20197;&#33267;&#20110;&#19981;&#21487;&#29992;&#12290;&#24517;&#39035;&#23454;&#26045;&#22403;&#22334;&#38450;&#25252;&#12290;</p><p>&#22403;&#22334;&#38450;&#25252;&#20998;&#20026;&#20004;&#31181;&#31867;&#22411;&#65306;&#38450;&#27490;&#22403;&#22334;&#37038;&#20214;&#20986;&#29616;&#22312;&#20320;&#30340;&#37038;&#20214;&#21015;&#34920;&#20013;&#65292;&#38450;&#27490;&#20320;&#30340;&#37038;&#20214;&#21015;&#34920;&#25104;&#20026;&#22403;&#22334;&#21046;&#36896;&#32773;&#22320;&#22336;&#25910;&#21106;&#26426;&#33719;&#21462;&#26032;&#37038;&#20214;&#22320;&#22336;&#30340;&#19968;&#20010;&#28304;&#12290;&#21069;&#32773;&#26356;&#37325;&#35201;&#65292;&#25152;&#20197;&#25105;&#20204;&#39318;&#20808;&#30740;&#31350;&#12290;</p><div class="sect3" title="&#36807;&#28388;&#37038;&#20214;"><div class="titlepage"><div><div><h4 class="title"><a name="spam-filtering"></a>&#36807;&#28388;&#37038;&#20214;</h4></div></div></div><p>&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;&#26377;&#19977;&#31181;&#26368;&#22522;&#26412;&#30340;&#25216;&#26415;&#65292;&#22823;&#37096;&#20998;&#30340;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#37117;&#20250;&#25552;&#20379;&#65292;&#26368;&#22909;&#33021;&#20018;&#32852;&#20351;&#29992;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p><span class="bold"><strong>&#21482;&#33258;&#21160;&#20801;&#35768;&#26469;&#33258;&#21015;&#34920;&#35746;&#38405;&#32773;&#30340;&#37038;&#20214;&#12290;</strong></span></p><p>&#21482;&#35201;&#20351;&#29992;&#23601;&#26377;&#25928;&#65292;&#22240;&#20026;&#36890;&#24120;&#21482;&#38656;&#35201;&#22312;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#30340;&#37197;&#32622;&#20013;&#20570;&#19968;&#28857;&#23567;&#23567;&#30340;&#25913;&#21160;&#65292;&#25152;&#20197;&#21482;&#38656;&#35201;&#24456;&#23569;&#30340;&#31649;&#29702;&#25237;&#20837;&#12290;&#20294;&#27880;&#24847;&#65292;&#37027;&#20123;&#19981;&#33021;&#33258;&#21160;&#35748;&#21487;&#30340;&#37038;&#20214;&#19981;&#33021;&#31616;&#21333;&#22320;&#38144;&#27585;&#20102;&#20107;&#12290;&#30456;&#21453;&#65292;&#24517;&#39035;&#20256;&#36882;&#32473;&#23457;&#26680;&#31243;&#24207;&#65292;&#26377;&#20004;&#20010;&#21407;&#22240;&#12290;&#39318;&#20808;&#20320;&#24076;&#26395;&#20801;&#35768;&#38750;&#35746;&#38405;&#32773;&#30340;&#37038;&#20214;&#12290;&#20165;&#20165;&#24819;&#38382;&#19968;&#20010;&#38382;&#39064;&#25110;&#26159;&#25552;&#20379;&#24314;&#35758;&#30340;&#20154;&#65292;&#19981;&#24212;&#35813;&#21482;&#20026;&#20102;&#21457;&#19968;&#23553;&#37038;&#20214;&#32780;&#38656;&#35201;&#35746;&#38405;&#25972;&#20010;&#21015;&#34920;&#12290;&#20854;&#27425;&#65292;&#26377;&#26102;&#29978;&#33267;&#35746;&#38405;&#32773;&#37117;&#26377;&#21487;&#33021;&#20174;&#38750;&#35746;&#38405;&#26102;&#29992;&#30340;&#22320;&#22336;&#21457;&#20986;&#19968;&#23553;&#37038;&#20214;&#12290;&#37038;&#20214;&#22320;&#22336;&#19981;&#26159;&#37492;&#21035;&#20154;&#30340;&#21487;&#38752;&#26041;&#27861;&#65292;&#23427;&#19981;&#35813;&#34987;&#22914;&#27492;&#23545;&#24453;&#12290;</p></li><li class="listitem"><p><span class="bold"><strong>&#36890;&#36807;&#22403;&#22334;&#36807;&#28388;&#36719;&#20214;&#36807;&#28388;&#37038;&#20214;&#12290;</strong></span></p><p>&#22914;&#26524;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#20801;&#35768;&#65288;&#22823;&#37096;&#20998;&#26159;&#65289;&#65292;&#20320;&#33021;&#29992;&#22403;&#22334;&#36807;&#28388;&#36719;&#20214;&#26469;&#33719;&#24471;&#36807;&#28388;&#21518;&#30340;&#37038;&#20214;&#12290;&#30001;&#20110;&#22312;&#22403;&#22334;&#21046;&#36896;&#32773;&#21644;&#36807;&#28388;&#22120;&#32534;&#20889;&#32773;&#20043;&#38388;&#36827;&#34892;&#30528;&#19968;&#22330;&#27704;&#19981;&#20572;&#24687;&#30340;&#20891;&#22791;&#31454;&#36187;&#65292;&#33258;&#21160;&#22403;&#22334;&#36807;&#28388;&#20174;&#26469;&#19981;&#26159;&#20063;&#27704;&#36828;&#19981;&#20250;&#26159;&#23436;&#32654;&#30340;&#12290;&#28982;&#32780;&#65292;&#23427;&#21487;&#20197;&#22823;&#22823;&#20943;&#23569;&#36827;&#20837;&#23457;&#26680;&#38431;&#21015;&#30340;&#37038;&#20214;&#25968;&#37327;&#65292;&#22240;&#20026;&#26356;&#38271;&#30340;&#21015;&#34920;&#38656;&#35201;&#26356;&#38271;&#30340;&#20154;&#24037;&#22788;&#29702;&#26102;&#38388;&#65292;&#19968;&#23450;&#31243;&#24230;&#30340;&#33258;&#21160;&#36807;&#28388;&#24635;&#26159;&#26377;&#30410;&#30340;&#12290;</p><p>&#36825;&#37324;&#27809;&#26377;&#31354;&#38388;&#26469;&#35814;&#32454;&#22320;&#20171;&#32461;&#22403;&#22334;&#36807;&#28388;&#30340;&#35774;&#32622;&#12290;&#20320;&#24212;&#35813;&#26597;&#38405;&#20320;&#30340;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#30340;&#25991;&#26723;&#65288;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="mailing-lists.html#mailing-list-software" title="&#36719;&#20214;">the section called &#8220;&#36719;&#20214;&#8221;</a>&#65289;&#23547;&#27714;&#31572;&#26696;&#12290;&#21015;&#34920;&#36719;&#20214;&#36890;&#24120;&#20250;&#26377;&#19968;&#20123;&#20869;&#32622;&#30340;&#22403;&#22334;&#38450;&#25252;&#21151;&#33021;&#65292;&#20294;&#20063;&#35768;&#20320;&#24819;&#35201;&#28155;&#21152;&#19968;&#20123;&#31532;&#19977;&#26041;&#30340;&#36807;&#28388;&#22120;&#12290;&#25512;&#33616;&#20004;&#20010;&#25105;&#26377;&#33391;&#22909;&#20307;&#39564;&#30340;&#36719;&#20214;&#65306;SpamAssassin
            (<a class="ulink" href="http://spamassassin.apache.org/" target="_top">http://spamassassin.apache.org/</a>)
            &#21644;SpamProbe
            (<a class="ulink" href="http://spamprobe.sourceforge.net/" target="_top">http://spamprobe.sourceforge.net/</a>)&#12290;&#36825;&#24182;&#38750;&#26159;&#23545;&#20247;&#22810;&#30340;&#20854;&#20182;&#24320;&#28304;&#22403;&#22334;&#36807;&#28388;&#22120;&#30340;&#19981;&#25964;&#65292;&#20854;&#20013;&#30340;&#19968;&#20123;&#26174;&#28982;&#20063;&#26159;&#38750;&#24120;&#22909;&#30340;&#12290;&#21482;&#26159;&#36825;&#20004;&#20010;&#26159;&#25105;&#26366;&#32463;&#20146;&#36523;&#20351;&#29992;&#36807;&#30340;&#65292;&#24182;&#19988;&#23427;&#20204;&#35753;&#25105;&#24456;&#28385;&#24847;&#12290;</p></li><li class="listitem"><p><span class="bold"><strong>&#23457;&#26680;&#12290;</strong></span></p><p>&#30001;&#20110;&#19981;&#26159;&#21015;&#34920;&#35746;&#38405;&#32773;&#30340;&#21407;&#22240;&#32780;&#26410;&#33021;&#33258;&#21160;&#35768;&#21487;&#30340;&#37038;&#20214;&#65292;&#23601;&#20250;&#26681;&#25454;&#35774;&#32622;&#36827;&#20837;&#22403;&#22334;&#36807;&#28388;&#36719;&#20214;&#65292;&#26368;&#21518;&#19968;&#20010;&#38454;&#27573;&#23558;&#26159;<em class="firstterm">&#23457;&#26680;</em>&#65306;&#37038;&#20214;&#23558;&#34987;&#21457;&#36865;&#21040;&#19968;&#20010;&#29305;&#27530;&#30340;&#22320;&#22336;&#65292;&#37027;&#37324;&#20250;&#26377;&#20154;&#26469;&#26816;&#26597;&#21644;&#20915;&#23450;&#26159;&#35768;&#21487;&#36824;&#26159;&#25298;&#32477;&#12290;</p><p>&#35768;&#21487;&#19968;&#20010;&#37038;&#20214;&#26377;&#20004;&#31181;&#24418;&#24335;&#65306;&#20320;&#21487;&#20197;&#21482;&#26159;&#36825;&#19968;&#27425;&#25509;&#21463;&#23427;&#65292;&#25110;&#20320;&#21487;&#20197;&#21578;&#35785;&#21015;&#34920;&#36719;&#20214;&#20026;&#36825;&#19968;&#23553;&#37038;&#20214;&#21516;&#19968;&#21457;&#36865;&#32773;&#20197;&#21518;&#30340;&#25152;&#26377;&#37038;&#20214;&#24320;&#32511;&#28783;&#12290;&#20026;&#20102;&#20943;&#23569;&#20197;&#21518;&#30340;&#23457;&#26680;&#36127;&#25285;&#65292;&#20320;&#24456;&#21487;&#33021;&#20250;&#36873;&#25321;&#21518;&#32773;&#12290;&#20855;&#20307;&#22914;&#20309;&#35768;&#21487;&#22312;&#19981;&#21516;&#30340;&#31995;&#32479;&#20043;&#38388;&#26377;&#24456;&#22823;&#30340;&#24046;&#24322;&#65292;&#20294;&#26159;&#36890;&#24120;&#30340;&#24418;&#24335;&#26159;&#21521;&#19968;&#20010;&#29305;&#27530;&#30340;&#22320;&#22336;&#21457;&#36865;&#19968;&#26465;&#24102;&#26377;&#21629;&#20196;&#8220;accept&#8221;&#65288;&#20195;&#34920;&#36825;&#19968;&#27425;&#35768;&#21487;&#65289;&#25110;&#26159;&#8220;allow&#8221;&#65288;&#20801;&#35768;&#36825;&#27425;&#20197;&#21450;&#20197;&#21518;&#30340;&#37038;&#20214;&#65289;&#30340;&#22238;&#22797;&#12290;</p><p>&#25298;&#32477;&#36890;&#24120;&#21482;&#38656;&#31616;&#21333;&#30340;&#24573;&#30053;&#25152;&#23457;&#26680;&#30340;&#37038;&#20214;&#21363;&#21487;&#12290;&#22914;&#26524;&#21015;&#34920;&#36719;&#20214;&#27809;&#26377;&#25910;&#21040;&#30830;&#35748;&#26377;&#25928;&#30340;&#37038;&#20214;&#65292;&#23427;&#19981;&#20250;&#35753;&#37038;&#20214;&#36890;&#36807;&#24182;&#20986;&#29616;&#22312;&#21015;&#34920;&#19978;&#65292;&#25152;&#20197;&#31616;&#21333;&#22320;&#25172;&#25481;&#23457;&#26680;&#37038;&#20214;&#23601;&#33021;&#36798;&#21040;&#30446;&#30340;&#12290;&#26377;&#26102;&#20320;&#36824;&#26377;&#20854;&#20182;&#36873;&#25321;&#65292;&#36820;&#22238;&#8220;reject&#8221;&#25110;&#26159;&#8220;deny&#8221;&#21629;&#20196;&#26469;&#26460;&#32477;&#20197;&#21518;&#26469;&#33258;&#21516;&#19968;&#20010;&#21457;&#36865;&#32773;&#30340;&#37038;&#20214;&#36827;&#20837;&#23457;&#26680;&#31243;&#24207;&#12290;&#20294;&#36825;&#20040;&#20570;&#36890;&#24120;&#27809;&#20160;&#20040;&#24847;&#20041;&#65292;&#22240;&#20026;&#22823;&#37096;&#20998;&#38656;&#35201;&#23457;&#26680;&#22788;&#29702;&#30340;&#37117;&#26159;&#22403;&#22334;&#37038;&#20214;&#65292;&#32780;&#22403;&#22334;&#37038;&#20214;&#21046;&#36896;&#32773;&#19981;&#22826;&#20250;&#20174;&#21516;&#19968;&#20010;&#22320;&#22336;&#20004;&#27425;&#21457;&#20986;&#22403;&#22334;&#37038;&#20214;&#12290;</p></li></ol></div><p>&#30830;&#20445;&#23457;&#26680;<span class="emphasis"><em>&#21482;</em></span>&#34987;&#29992;&#22312;&#36807;&#28388;&#22403;&#22334;&#37038;&#20214;&#21644;&#26126;&#26174;&#26159;&#21644;&#20027;&#39064;&#26080;&#20851;&#30340;&#28040;&#24687;&#19978;&#65292;&#27604;&#22914;&#26377;&#26102;&#20250;&#26377;&#20154;&#24847;&#22806;&#22320;&#22312;&#19968;&#20010;&#38169;&#35823;&#30340;&#37038;&#20214;&#21015;&#34920;&#20013;&#21457;&#36865;&#20102;&#37038;&#20214;&#12290;&#23457;&#26680;&#31995;&#32479;&#36890;&#24120;&#32473;&#20320;&#19968;&#20010;&#30452;&#25509;&#21516;&#21457;&#36865;&#32773;&#32852;&#31995;&#30340;&#36884;&#24452;&#65292;&#20294;&#26159;&#19981;&#35201;&#29992;&#36825;&#31181;&#26041;&#24335;&#26469;&#22238;&#31572;&#23646;&#20110;&#37038;&#20214;&#21015;&#34920;&#26412;&#36523;&#30340;&#38382;&#39064;&#65292;&#21363;&#20351;&#37027;&#20123;&#31572;&#26696;&#23601;&#22312;&#20320;&#30340;&#22836;&#33041;&#20043;&#20013;&#12290;&#22914;&#26524;&#36825;&#20040;&#20570;&#20102;&#65292;&#23558;&#20250;&#21093;&#22842;&#39033;&#30446;&#31038;&#21306;&#20102;&#35299;&#20154;&#20204;&#27491;&#22312;&#38382;&#37027;&#20123;&#31867;&#22411;&#38382;&#39064;&#30340;&#20855;&#20307;&#24418;&#24335;&#65292;&#21093;&#22842;&#23427;&#20204;&#33258;&#24049;&#22238;&#31572;&#38382;&#39064;&#25110;&#32773;&#33719;&#24471;&#31572;&#26696;&#30340;&#26426;&#20250;&#12290;&#37038;&#20214;&#21015;&#34920;&#23457;&#26680;&#38500;&#20102;&#20005;&#26684;&#30830;&#20445;&#21015;&#34920;&#20013;&#27809;&#26377;&#22403;&#22334;&#21644;&#21516;&#20027;&#39064;&#26080;&#20851;&#30340;&#37038;&#20214;&#65292;&#27809;&#26377;&#20854;&#20182;&#20102;&#12290;</p></div><div class="sect3" title="&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;"><div class="titlepage"><div><div><h4 class="title"><a name="address-hiding"></a>&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;</h4></div></div></div><p>&#20026;&#20102;&#38450;&#27490;&#20320;&#30340;&#37038;&#20214;&#21015;&#34920;&#25104;&#20026;&#22403;&#22334;&#37038;&#20214;&#21457;&#36865;&#32773;&#30340;&#22320;&#22336;&#28304;&#65292;&#19968;&#20010;&#24120;&#35265;&#30340;&#25216;&#26415;&#26159;&#28151;&#28102;&#29992;&#25143;&#30340;&#37038;&#20214;&#22320;&#22336;&#65292;&#20363;&#22914;&#36890;&#36807;&#26367;&#25442;</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandom@somedomain.com</code></p></blockquote></div><p>&#20026;</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandom_AT_somedomain.com</code></p></blockquote></div><p>&#25110;</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandomNOSPAM@somedomain.com</code></p></blockquote></div><p>&#25110;&#19968;&#20123;&#31867;&#20284;&#30340;&#26126;&#26174;&#30340;&#65288;&#23545;&#20154;&#31867;&#26469;&#35828;&#65289;&#21152;&#23494;&#12290;&#22240;&#20026;&#22403;&#22334;&#37038;&#20214;&#22320;&#22336;&#25910;&#21106;&#22120;&#36890;&#24120;&#20250;&#36941;&#23547;&#32593;&#32476;&#8212;&#21253;&#25324;&#20320;&#30340;&#37038;&#20214;&#21015;&#34920;&#30340;&#32593;&#32476;&#24402;&#26723;&#8212;&#23427;&#20204;&#20250;&#26597;&#25214;&#21253;&#21547;&#8220;@&#8221;&#30340;&#23383;&#31526;&#20018;&#65292;&#23545;&#22320;&#22336;&#21152;&#23494;&#26159;&#20026;&#20102;&#35753;&#20154;&#20204;&#30340;&#37038;&#20214;&#22320;&#22336;&#23545;&#22403;&#22334;&#37038;&#20214;&#21457;&#36865;&#32773;&#26469;&#35828;&#19981;&#21487;&#35265;&#25110;&#19981;&#21487;&#29992;&#12290;&#36825;&#23545;&#38450;&#27490;&#22403;&#22334;&#37038;&#20214;&#21457;&#36865;&#32773;&#23558;&#37038;&#20214;&#30452;&#25509;&#21457;&#36865;&#21040;&#37038;&#20214;&#21015;&#34920;&#26412;&#36523;&#26080;&#29992;&#65292;&#20294;&#23427;&#21487;&#20197;&#38450;&#27490;&#30452;&#25509;&#21457;&#36865;&#21040;&#29992;&#25143;&#20010;&#20154;&#22320;&#22336;&#30340;&#22403;&#22334;&#37038;&#20214;&#30340;&#22686;&#21152;&#12290;</p><p>&#22320;&#22336;&#38544;&#34255;&#21487;&#33021;&#23384;&#22312;&#20105;&#35758;&#12290;&#35768;&#22810;&#20154;&#24456;&#21916;&#27426;&#65292;&#22914;&#26524;&#20320;&#30340;&#24402;&#26723;&#19981;&#33021;&#33258;&#21160;&#25903;&#25345;&#65292;&#20182;&#20204;&#20250;&#24456;&#24778;&#35766;&#12290;&#36824;&#26377;&#20123;&#20154;&#35748;&#20026;&#36825;&#26679;&#22826;&#19981;&#26041;&#20415;&#20102;&#65288;&#22240;&#20026;&#20154;&#20204;&#38656;&#35201;&#22312;&#20351;&#29992;&#20043;&#21069;&#36716;&#21270;&#22320;&#22336;&#65289;&#12290;&#26377;&#26102;&#20505;&#29992;&#25143;&#26029;&#23450;&#36825;&#26679;&#20570;&#19981;&#33021;&#20135;&#29983;&#39044;&#26399;&#30340;&#25928;&#26524;&#65292;&#22240;&#20026;&#25910;&#21106;&#22120;&#29702;&#35770;&#19978;&#21487;&#20197;&#24357;&#34917;&#20219;&#20309;&#19981;&#21464;&#30340;&#21152;&#23494;&#27169;&#24335;&#12290;&#28982;&#32780;&#65292;&#26377;&#19968;&#20010;&#23454;&#39564;&#35777;&#25454;&#21487;&#20197;&#35777;&#26126;&#22320;&#22336;&#38544;&#34255;<span class="emphasis"><em>&#26159;</em></span>&#26377;&#25928;&#30340;&#65292;&#35265;<a class="ulink" href="http://www.cdt.org/speech/spam/030319spamreport.shtml" target="_top">http://www.cdt.org/speech/spam/030319spamreport.shtml</a>&#12290;</p><p>&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#20026;&#27599;&#20010;&#35746;&#38405;&#32773;&#25552;&#20379;&#36873;&#25321;&#30340;&#26426;&#20250;&#65292;&#36890;&#36807;&#29305;&#21035;&#30340;yes/no&#22836;&#65292;&#25110;&#32773;&#36890;&#36807;&#35746;&#38405;&#32773;&#21015;&#34920;&#24080;&#25143;&#30340;&#21442;&#25968;&#36873;&#25321;&#35774;&#32622;&#12290;&#28982;&#32780;&#65292;&#25105;&#19981;&#30693;&#36947;&#26377;&#21738;&#20010;&#36719;&#20214;&#25552;&#20379;&#20102;&#27599;&#35746;&#38405;&#32773;&#25110;&#27599;&#37038;&#20214;&#30340;&#36873;&#39033;&#65292;&#22240;&#27492;&#29616;&#22312;&#21015;&#34920;&#31649;&#29702;&#21592;&#24517;&#39035;&#20026;&#25152;&#26377;&#20154;&#20316;&#20986;&#20915;&#23450;&#65288;&#20551;&#23450;&#24402;&#26723;&#31243;&#24207;&#24050;&#32463;&#25552;&#20379;&#20102;&#36825;&#20123;&#29305;&#24615;&#65292;&#23601;&#19981;&#23384;&#22312;&#36825;&#20010;&#38382;&#39064;&#20102;&#65289;&#12290;&#25105;&#20542;&#21521;&#20110;&#36866;&#24230;&#20351;&#29992;&#22320;&#22336;&#38544;&#34255;&#12290;&#19968;&#20123;&#20154;&#23545;&#20110;&#23558;&#33258;&#24049;&#30340;&#37038;&#20214;&#21457;&#24067;&#21040;&#32593;&#39029;&#19978;&#25110;&#20854;&#20182;&#25910;&#21106;&#22120;&#21487;&#33021;&#20250;&#25628;&#32034;&#30340;&#22320;&#26041;&#20250;&#38750;&#24120;&#23567;&#24515;&#65292;&#20182;&#20204;&#20250;&#22240;&#20026;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#26292;&#38706;&#23427;&#20204;&#20851;&#24515;&#30340;&#20869;&#23481;&#32780;&#24863;&#21040;&#22833;&#26395;&#65292;&#24402;&#26723;&#29992;&#25143;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;&#24102;&#26469;&#30340;&#19981;&#20415;&#26159;&#36731;&#24494;&#30340;&#65292;&#22240;&#20026;&#22914;&#26524;&#20320;&#24076;&#26395;&#32852;&#31995;&#26576;&#20010;&#20154;&#65292;&#23558;&#28151;&#28102;&#30340;&#37038;&#20214;&#22320;&#22336;&#24674;&#22797;&#38750;&#24120;&#23481;&#26131;&#12290;&#20294;&#26159;&#26368;&#21518;&#36824;&#26159;&#35201;&#29282;&#35760;&#65292;&#36825;&#26159;&#19968;&#22330;&#20891;&#22791;&#31454;&#36187;&#65306;&#22312;&#20320;&#38405;&#35835;&#21040;&#26412;&#25991;&#30340;&#20107;&#20197;&#21518;&#65292;&#25910;&#21106;&#22120;&#21487;&#33021;&#24050;&#32463;&#24471;&#21040;&#20102;&#36827;&#21270;&#65292;&#33021;&#22815;&#35782;&#21035;&#22823;&#22810;&#25968;&#24120;&#35265;&#30340;&#38544;&#34255;&#24418;&#24335;&#65292;&#25105;&#20204;&#21487;&#20197;&#24819;&#19968;&#20123;&#20854;&#20182;&#24418;&#24335;&#12290;</p></div></div><div class="sect2" title="&#36523;&#20221;&#21644;&#22836;&#31649;&#29702;"><div class="titlepage"><div><div><h3 class="title"><a name="header-management"></a>&#36523;&#20221;&#21644;&#22836;&#31649;&#29702;</h3></div></div></div><p>&#21015;&#34920;&#35746;&#38405;&#32773;&#32463;&#24120;&#24076;&#26395;&#23558;&#26469;&#33258;&#21015;&#34920;&#30340;&#37038;&#20214;&#23384;&#25918;&#21040;&#29305;&#23450;&#30340;&#30446;&#24405;&#65292;&#33021;&#22815;&#21644;&#20854;&#20182;&#37038;&#20214;&#21306;&#20998;&#24320;&#12290;&#20182;&#20204;&#30340;&#37038;&#20214;&#38405;&#35835;&#36719;&#20214;&#21487;&#20197;&#33258;&#21160;&#26816;&#26597;&#37038;&#20214;&#30340;<em class="firstterm">&#22836;</em>&#12290;&#36825;&#20010;&#22836;&#26159;&#22312;&#37038;&#20214;&#30340;&#39030;&#37096;&#65292;&#29992;&#26469;&#25351;&#26126;&#21457;&#36865;&#32773;&#12289;&#25509;&#25910;&#32773;&#12289;&#20027;&#39064;&#12289;&#26085;&#26399;&#21644;&#20854;&#20182;&#37038;&#20214;&#30456;&#20851;&#30340;&#19996;&#35199;&#12290;&#26576;&#20123;&#22836;&#26159;&#20247;&#25152;&#21608;&#30693;&#30340;&#65292;&#32780;&#19988;&#26159;&#24517;&#39035;&#26377;&#30340;&#65306;</p><pre class="screen">
From: ...
To: ...
Subject: ...
Date: ...
</pre><p>&#36824;&#26377;&#19968;&#20123;&#26159;&#21487;&#36873;&#30340;&#65292;&#23613;&#31649;&#20063;&#26159;&#26631;&#20934;&#30340;&#22836;&#12290;&#20363;&#22914;&#65292;&#37038;&#20214;&#19981;&#24517;&#26377;</p><pre class="screen">
Reply-to: sender@email.address.here
</pre><p>&#22836;&#65292;&#20294;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#37117;&#26377;&#65292;&#22240;&#20026;&#36825;&#21487;&#20197;&#20445;&#35777;&#25509;&#25910;&#32773;&#65288;&#24403;&#20316;&#32773;&#24517;&#39035;&#20174;&#19968;&#20010;&#19981;&#33021;&#25509;&#25910;&#37038;&#20214;&#30340;&#22320;&#22336;&#21457;&#36865;&#37038;&#20214;&#30340;&#26102;&#20505;&#36825;&#29305;&#21035;&#26377;&#29992;&#65289;&#33021;&#22815;&#32852;&#31995;&#21040;&#21407;&#20316;&#32773;&#12290;</p><p>&#19968;&#20123;&#37038;&#20214;&#38405;&#35835;&#36719;&#20214;&#25552;&#20379;&#20102;&#22522;&#20110;&#20027;&#39064;&#22836;&#27169;&#24335;&#30340;&#26131;&#29992;&#30028;&#38754;&#65292;&#21487;&#20197;&#29992;&#26469;&#36807;&#28388;&#37038;&#20214;&#12290;&#36825;&#23548;&#33268;&#20154;&#20204;&#20250;&#35201;&#27714;&#37038;&#20214;&#21015;&#34920;&#20026;&#25152;&#26377;&#30340;&#20027;&#39064;&#25552;&#20379;&#33258;&#21160;&#21069;&#32512;&#65292;&#25152;&#20197;&#20182;&#20204;&#21487;&#20197;&#35774;&#32622;&#30340;&#38405;&#35835;&#22120;&#26597;&#25214;&#21069;&#32512;&#24182;&#33258;&#21160;&#23558;&#25991;&#20214;&#24402;&#20837;&#27491;&#30830;&#30340;&#25991;&#20214;&#22841;&#12290;&#22914;&#26524;&#21407;&#26469;&#30340;&#20316;&#32773;&#26159;&#36825;&#26679;&#20889;&#65306;</p><pre class="screen">
Subject: Making the 2.5 release.
</pre><p>&#20294;&#26159;&#21015;&#34920;&#20013;&#26174;&#31034;&#30340;&#37038;&#20214;&#20250;&#26159;&#65306;</p><pre class="screen">
Subject: [discuss@lists.example.org] Making the 2.5 release.
</pre><p>&#23613;&#31649;&#22823;&#22810;&#25968;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#25552;&#20379;&#36825;&#20010;&#36873;&#39033;&#65292;&#20294;&#25105;&#24378;&#28872;&#21453;&#23545;&#24320;&#21551;&#36825;&#20010;&#21151;&#33021;&#12290;&#22240;&#20026;&#36825;&#20010;&#38382;&#39064;&#21487;&#20197;&#36890;&#36807;&#26356;&#33258;&#28982;&#30340;&#26041;&#24335;&#36731;&#26494;&#35299;&#20915;&#65292;&#32780;&#19988;&#20027;&#39064;&#23383;&#27573;&#28040;&#32791;&#30340;&#31354;&#38388;&#20063;&#22826;&#22810;&#20102;&#12290;&#26377;&#32463;&#39564;&#30340;&#37038;&#20214;&#21015;&#34920;&#29992;&#25143;&#36890;&#24120;&#20250;&#25195;&#35270;&#27599;&#22825;&#30340;&#21015;&#34920;&#37038;&#20214;&#30340;&#20027;&#39064;&#65292;&#28982;&#21518;&#20915;&#23450;&#38405;&#35835;&#21644;/&#25110;&#22238;&#22797;&#21738;&#20123;&#37038;&#20214;&#12290;&#20027;&#39064;&#20013;&#21069;&#32622;&#30340;&#21015;&#34920;&#21517;&#31216;&#20250;&#20351;&#24471;&#20027;&#39064;&#30340;&#27491;&#24335;&#20869;&#23481;&#33073;&#31163;&#23631;&#24149;&#65292;&#26080;&#27861;&#30475;&#21040;&#12290;&#36825;&#28151;&#28102;&#20102;&#20154;&#20204;&#36182;&#20197;&#20915;&#23450;&#26159;&#21542;&#25171;&#24320;&#37038;&#20214;&#30340;&#20449;&#24687;&#65292;&#20174;&#32780;&#20943;&#24369;&#20102;&#37038;&#20214;&#21015;&#34920;&#30340;&#25972;&#20307;&#21151;&#33021;&#12290;</p><p>&#25105;&#20204;&#19981;&#20250;&#22788;&#29702;&#20027;&#39064;&#22836;&#65292;&#32780;&#26159;&#35753;&#20320;&#30340;&#29992;&#25143;&#21033;&#29992;&#20854;&#20182;&#26631;&#20934;&#30340;&#22836;&#65292;&#20197;To&#22836;&#35828;&#36215;&#65292;&#21487;&#20197;&#29992;&#26469;&#35828;&#26126;&#37038;&#20214;&#21015;&#34920;&#21517;&#31216;&#65306;</p><pre class="screen">
To: &lt;discuss@lists.example.org&gt;
</pre><p>&#20219;&#20309;&#21487;&#20197;&#36807;&#28388;&#20027;&#39064;&#30340;&#37038;&#20214;&#38405;&#35835;&#22120;&#19968;&#23450;&#20063;&#33021;&#36731;&#26131;&#30340;&#22788;&#29702;To&#12290;</p><p>&#36824;&#26377;&#19968;&#20123;&#20854;&#23427;&#30340;&#37038;&#20214;&#21015;&#34920;&#26399;&#26395;&#30340;&#21487;&#36873;&#20294;&#26631;&#20934;&#30340;&#22836;&#12290;&#26681;&#25454;&#36825;&#20123;&#22836;&#36807;&#28388;&#27604;&#21033;&#29992;&#8220;To&#8221;&#25110;&#8220;Cc&#8221;&#22836;&#26356;&#21152;&#21487;&#38752;&#65307;&#22240;&#20026;&#36825;&#20123;&#22836;&#26159;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#26412;&#36523;&#20026;&#27599;&#20010;&#37038;&#20214;&#28155;&#21152;&#30340;&#65292;&#19968;&#20123;&#29992;&#25143;&#20250;&#20381;&#36182;&#20182;&#20204;&#30340;&#20986;&#29616;&#65306;</p><pre class="screen">
list-help: &lt;mailto:discuss-help@lists.example.org&gt;
list-unsubscribe: &lt;mailto:discuss-unsubscribe@lists.example.org&gt;
list-post: &lt;mailto:discuss@lists.example.org&gt;
Delivered-To: mailing list discuss@lists.example.org
Mailing-List: contact discuss-help@lists.example.org; run by ezmlm
</pre><p>&#32477;&#22823;&#37096;&#20998;&#26159;&#33258;&#35299;&#37322;&#30340;&#65292;&#26356;&#22810;&#35299;&#37322;&#21487;&#20197;&#30475;<a class="ulink" href="http://www.nisto.com/listspec/list-manager-intro.html" target="_top">http://www.nisto.com/listspec/list-manager-intro.html</a>&#65292;&#25110;&#32773;&#22914;&#26524;&#20320;&#35273;&#24471;&#19981;&#22815;&#35814;&#32454;&#65292;&#27491;&#24335;&#30340;&#35268;&#33539;&#21487;&#20197;&#30475;<a class="ulink" href="http://www.faqs.org/rfcs/rfc2369.html" target="_top">http://www.faqs.org/rfcs/rfc2369.html</a>&#12290;
</p><p>&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#21517;&#20026;&#8220;list&#8221;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#35831;&#27880;&#24847;&#36825;&#20123;&#22836;&#26159;&#22914;&#20309;&#26263;&#31034;&#30340;&#65292;&#28982;&#21518;&#20320;&#20063;&#26377;&#20102;&#31649;&#29702;&#22320;&#22336;&#8220;list-help&#8221;&#21644;&#8220;list-unsubscribe&#8221;&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#29992;&#26469;&#21152;&#20837;&#30340;&#8220;list-subscribe&#8221;&#21644;&#25509;&#35302;&#21015;&#34920;&#31649;&#29702;&#21592;&#30340;&#8220;list-owner&#8221;&#20063;&#38750;&#24120;&#24120;&#35265;&#12290;&#21462;&#20915;&#20110;&#20320;&#25152;&#20351;&#29992;&#30340;&#31649;&#29702;&#36719;&#20214;&#65292;&#20063;&#21487;&#33021;&#20250;&#35774;&#32622;&#19968;&#20123;&#20854;&#23427;&#30340;&#31649;&#29702;&#22320;&#22336;&#65307;&#25991;&#26723;&#24212;&#35813;&#20250;&#26377;&#35814;&#32454;&#20171;&#32461;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#27599;&#20010;&#26032;&#29992;&#25143;&#22312;&#35746;&#38405;&#26102;&#37117;&#20250;&#25910;&#21040;&#33258;&#21160;&#30340;&#8220;&#27426;&#36814;&#37038;&#20214;&#8221;&#65292;&#20854;&#20013;&#20250;&#23436;&#25972;&#35299;&#37322;&#25152;&#26377;&#30340;&#29305;&#21035;&#22320;&#22336;&#12290;&#20320;&#21487;&#33021;&#26377;&#36825;&#20010;&#27426;&#36814;&#37038;&#20214;&#30340;&#19968;&#20221;&#25335;&#36125;&#12290;&#22914;&#26524;&#20320;&#27809;&#26377;&#65292;&#21487;&#20197;&#38382;&#20854;&#20182;&#20154;&#33719;&#21462;&#19968;&#20221;&#25335;&#36125;&#65292;&#36825;&#26679;&#20320;&#23601;&#30693;&#36947;&#24403;&#20320;&#30340;&#29992;&#25143;&#21040;&#26469;&#26102;&#65292;&#20182;&#20204;&#20250;&#30475;&#21040;&#20160;&#20040;&#12290;&#25163;&#20013;&#26377;&#19968;&#20221;&#25335;&#36125;&#65292;&#20320;&#23601;&#21487;&#20197;&#22238;&#31572;&#37038;&#20214;&#21015;&#34920;&#21151;&#33021;&#30340;&#38382;&#39064;&#65292;&#26356;&#22909;&#19968;&#28857;&#65292;&#21487;&#20197;&#25918;&#32622;&#21040;&#32593;&#39029;&#19978;&#12290;&#36825;&#26679;&#24403;&#26377;&#20154;&#20002;&#22833;&#20102;&#33258;&#24049;&#30340;&#25351;&#23548;&#24182;&#35810;&#38382;&#8220;&#25105;&#22914;&#20309;&#20174;&#21015;&#34920;&#36864;&#35746;&#26102;&#65311;&#8221;&#65292;&#20320;&#23601;&#21487;&#20197;&#23558;URL&#21457;&#36865;&#20010;&#20182;&#12290;</p><p>&#19968;&#20123;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#20250;&#22312;&#27599;&#20010;&#37038;&#20214;&#30340;&#24213;&#37096;&#36861;&#21152;&#36864;&#35746;&#20449;&#24687;&#12290;&#22914;&#26524;&#26377;&#36825;&#20010;&#36873;&#39033;&#65292;&#35831;&#25171;&#24320;&#23427;&#12290;&#36825;&#26679;&#21482;&#20250;&#23548;&#33268;&#27599;&#20010;&#37038;&#20214;&#26377;&#19968;&#27573;&#39069;&#22806;&#30340;&#34892;&#65292;&#22312;&#19968;&#20010;&#26080;&#23475;&#30340;&#20301;&#32622;&#65292;&#21487;&#20197;&#24110;&#21161;&#20320;&#33410;&#30465;&#24456;&#22810;&#26102;&#38388;&#65292;&#20943;&#23569;&#20102;&#32473;&#20320;&#65292;&#25110;&#32773;&#26356;&#22351;&#30340;&#24773;&#20917;&#65292;&#32473;&#37038;&#20214;&#21015;&#34920;&#21457;&#37038;&#20214;&#35810;&#38382;&#22914;&#20309;&#36864;&#35746;&#30340;&#20154;&#25968;&#65281;</p></div><div class="sect2" title="&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;"><div class="titlepage"><div><div><h3 class="title"><a name="reply-to"></a>&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;</h3></div></div></div><p>&#22312;&#21069;&#38754;&#30340;<a class="xref" href="setting-tone.html#avoid-private-discussions" title="&#36991;&#20813;&#31169;&#19979;&#35752;&#35770;">the section called &#8220;&#36991;&#20813;&#31169;&#19979;&#35752;&#35770;&#8221;</a>&#65292;&#25105;&#24378;&#35843;&#20102;&#20445;&#25345;&#22312;&#20844;&#20849;&#35770;&#22363;&#35752;&#35770;&#30340;&#37325;&#35201;&#24615;&#65292;&#35848;&#35770;&#20102;&#22914;&#20309;&#38450;&#27490;&#31169;&#19979;&#37038;&#20214;&#35752;&#35770;&#30340;&#19968;&#20123;&#20027;&#21160;&#25514;&#26045;&#65292;&#38500;&#27492;&#20043;&#22806;&#65292;&#26412;&#31456;&#23558;&#20250;&#35752;&#35770;&#22914;&#20309;&#35774;&#32622;&#39033;&#30446;&#20132;&#27969;&#36719;&#20214;&#26469;&#26356;&#22909;&#30340;&#20570;&#36825;&#20214;&#20107;&#12290;&#22240;&#20026;&#22914;&#26524;&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#25552;&#20379;&#20102;&#19968;&#20010;&#26041;&#27861;&#26469;&#33258;&#21160;&#23548;&#33268;&#35752;&#35770;&#20445;&#25345;&#22312;&#21015;&#34920;&#20013;&#65292;&#20320;&#20250;&#35748;&#20026;&#24320;&#21551;&#36825;&#20010;&#21151;&#33021;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#36873;&#25321;&#12290;</p><p>&#22909;&#30340;&#65292;&#26377;&#26102;&#20505;&#20063;&#19981;&#26159;&#22914;&#27492;&#35748;&#20026;&#12290;&#23613;&#31649;&#26377;&#36825;&#20010;&#29305;&#24615;&#65292;&#20294;&#26159;&#23427;&#21364;&#26377;&#20005;&#37325;&#30340;Bug&#12290;&#38382;&#39064;&#26159;&#26080;&#35770;&#20320;&#26159;&#21542;&#22312;&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#20013;&#20351;&#29992;&#36825;&#20010;&#21151;&#33021;&#37117;&#20250;&#25104;&#20026;&#26368;&#28909;&#30340;&#36777;&#35770;&#8212;&#35802;&#28982;&#65292;&#36825;&#19981;&#22823;&#21487;&#33021;&#25104;&#20026;&#20320;&#22478;&#24066;&#37324;&#30340;&#26202;&#38388;&#26032;&#38395;&#37027;&#26679;&#30340;&#35770;&#25112;&#65292;&#20294;&#23427;&#20250;&#22312;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#19968;&#27425;&#27425;&#30340;&#29190;&#21457;&#12290;&#19979;&#38754;&#65292;&#25105;&#23558;&#25551;&#36848;&#36825;&#20010;&#29305;&#24615;&#65292;&#25552;&#20379;&#20004;&#26041;&#38754;&#30340;&#20027;&#35201;&#35770;&#28857;&#65292;&#25552;&#20986;&#25105;&#33021;&#20316;&#20986;&#30340;&#24314;&#35758;&#12290;</p><p>&#36825;&#20010;&#29305;&#24615;&#26412;&#36523;&#38750;&#24120;&#31616;&#21333;&#65306;&#22914;&#26524;&#20320;&#24895;&#24847;&#65292;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#21487;&#20197;&#22312;&#27599;&#20010;&#37038;&#20214;&#20013;&#33258;&#21160;&#35774;&#32622;&#36716;&#21521;&#21040;&#37038;&#20214;&#21015;&#34920;&#30340;Reply-to&#22836;&#12290;&#20063;&#23601;&#26159;&#26080;&#35770;&#21407;&#26469;&#30340;&#21457;&#36865;&#32773;&#35774;&#32622;&#20102;&#20160;&#20040;Reply-to&#22836;&#65288;&#25110;&#32773;&#20182;&#20204;&#27809;&#26377;&#35774;&#32622;&#65289;&#65292;&#24403;&#37038;&#20214;&#21015;&#34920;&#30340;&#35746;&#38405;&#32773;&#30475;&#21040;&#37038;&#20214;&#26102;&#65292;&#23427;&#30340;&#22836;&#23558;&#20250;&#21253;&#21547;&#21015;&#34920;&#22320;&#22336;&#65306;</p><pre class="screen">
Reply-to: discuss@lists.example.org
</pre><p>&#20174;&#34920;&#38754;&#19978;&#30475;&#38750;&#24120;&#22909;&#12290;&#22240;&#20026;&#23454;&#38469;&#19978;&#25152;&#26377;&#30340;&#37038;&#20214;&#38405;&#35835;&#36719;&#20214;&#20250;&#27880;&#24847;&#21040;Reply-to&#22836;&#65292;&#36825;&#26679;&#24403;&#20219;&#20309;&#20154;&#22238;&#22797;&#37038;&#20214;&#26102;&#65292;&#20182;&#20204;&#30340;&#22238;&#22797;&#37117;&#20250;&#33258;&#21160;&#26469;&#21040;&#25972;&#20010;&#21015;&#34920;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#37038;&#20214;&#30340;&#21457;&#36865;&#32773;&#12290;&#34429;&#28982;&#22238;&#22797;&#32773;&#20173;&#28982;&#21487;&#20197;&#25163;&#24037;&#20462;&#25913;&#22238;&#22797;&#30340;&#22320;&#22336;&#65292;&#20294;&#37325;&#35201;&#30340;&#26159;<span class="emphasis"><em>&#32570;&#30465;&#30340;</em></span>&#22238;&#22797;&#20250;&#25351;&#21521;&#21015;&#34920;&#12290;&#36825;&#26159;&#36890;&#36807;&#25216;&#26415;&#40723;&#21169;&#21327;&#20316;&#30340;&#23436;&#32654;&#23454;&#20363;&#12290;</p><p>&#19981;&#24184;&#30340;&#26159;&#65292;&#20063;&#26377;&#19968;&#20123;&#32570;&#28857;&#12290;&#39318;&#20808;&#26159;<em class="firstterm">&#25214;&#19981;&#21040;&#22238;&#23478;&#30340;&#36335;</em>&#38382;&#39064;&#65306;&#26377;&#26102;&#20505;&#21407;&#26469;&#30340;&#21457;&#36865;&#32773;&#20250;&#25226;&#8220;&#30495;&#27491;&#30340;&#8221;&#37038;&#20214;&#22320;&#22336;&#23384;&#25918;&#21040;Reply-to&#23383;&#27573;&#65292;&#36890;&#24120;&#26159;&#26576;&#31181;&#21407;&#22240;&#20182;&#20204;&#19981;&#33021;&#36890;&#36807;&#21457;&#36865;&#37038;&#20214;&#30340;&#22320;&#22336;&#25509;&#25910;&#37038;&#20214;&#12290;&#19968;&#30452;&#20174;&#21516;&#19968;&#20010;&#22320;&#22336;&#35835;&#21462;&#21644;&#21457;&#36865;&#30340;&#20154;&#20204;&#19981;&#20250;&#26377;&#36825;&#31181;&#38382;&#39064;&#65292;&#29978;&#33267;&#20250;&#24778;&#35766;&#26377;&#36825;&#31181;&#24773;&#20917;&#12290;&#20294;&#26159;&#23545;&#20110;&#26377;&#29305;&#21035;&#30340;&#37038;&#20214;&#35774;&#32622;&#65292;&#25110;&#32773;&#19981;&#33021;&#35774;&#32622;&#20182;&#20204;&#25152;&#30475;&#37038;&#20214;&#30340;From&#22320;&#22336;&#65288;&#25110;&#35768;&#22240;&#20026;&#20182;&#20204;&#22312;&#24037;&#20316;&#26102;&#21457;&#36865;&#65292;&#32780;&#19988;&#19981;&#33021;&#36890;&#36807;IT&#37096;&#38376;&#20462;&#25913;&#37197;&#32622;&#65289;&#26102;&#65292;&#20351;&#29992;Reply-to&#21487;&#33021;&#26159;&#20445;&#35777;&#22238;&#22797;&#33021;&#22815;&#25910;&#21040;&#30340;&#21807;&#19968;&#26041;&#27861; &#12290;&#24403;&#27492;&#31867;&#20154;&#22312;&#26410;&#35746;&#38405;&#30340;&#37038;&#20214;&#21015;&#34920;&#20013;&#21457;&#36865;&#37038;&#20214;&#26102;&#65292;&#22905;&#30340;Reply-to&#35774;&#32622;&#23601;&#25104;&#20026;&#20102;&#20851;&#38190;&#20449;&#24687;&#12290;&#22914;&#26524;&#21015;&#34920;&#36719;&#20214;&#35206;&#30422;&#20102;&#23427;&#65292;&#22905;&#21487;&#33021;&#23601;&#30475;&#19981;&#21040;&#22238;&#22797;&#20102;&#12290;</p><p>&#31532;&#20108;&#20010;&#21487;&#20197;&#39044;&#26399;&#30340;&#32570;&#28857;&#65292;&#20174;&#25105;&#30340;&#35266;&#28857;&#30475;&#26159;Reply-to&#22788;&#29702;&#26368;&#26377;&#21147;&#30340;&#21453;&#23545;&#35770;&#28857;&#12290;&#22823;&#22810;&#25968;&#26377;&#32463;&#39564;&#30340;&#37038;&#20214;&#29992;&#25143;&#20250;&#20064;&#24815;&#20110;&#20004;&#20010;&#22238;&#22797;&#30340;&#22522;&#26412;&#26041;&#27861;&#65306;<em class="firstterm">reply-to-all</em>&#21644;<em class="firstterm">reply-to-author</em>&#12290;&#25152;&#26377;&#29616;&#20195;&#30340;&#37038;&#20214;&#38405;&#35835;&#36719;&#20214;&#23545;&#20110;&#20004;&#20010;&#21160;&#20316;&#37117;&#26377;&#21333;&#29420;&#30340;&#25353;&#38190;&#12290;&#29992;&#25143;&#30693;&#36947;&#22914;&#26524;&#26159;&#22238;&#22797;&#21040;&#25152;&#26377;&#20154;&#65288;&#20063;&#21253;&#25324;&#21015;&#34920;&#65289;&#65292;&#20182;&#20204;&#20250;&#36873;&#25321;reply-to-all&#65292;&#22914;&#26524;&#26159;&#31169;&#19979;&#22238;&#22797;&#21040;&#20316;&#32773;&#65292;&#20182;&#20204;&#24212;&#35813;&#36873;&#25321;reply-to-author&#12290;&#23613;&#31649;&#20320;&#24076;&#26395;&#40723;&#21169;&#20154;&#20204;&#23613;&#21487;&#33021;&#22238;&#22797;&#21040;&#21015;&#34920;&#65292;&#20294;&#30830;&#23454;&#26377;&#24773;&#20917;&#22238;&#22797;&#32773;&#38656;&#35201;&#26377;&#26435;&#21033;&#31169;&#19979;&#22238;&#22797;&#8212;&#20363;&#22914;&#65292;&#20182;&#20204;&#24076;&#26395;&#21644;&#37038;&#20214;&#30340;&#21407;&#20316;&#32773;&#35828;&#19968;&#20123;&#26426;&#23494;&#30340;&#20107;&#24773;&#65292;&#21487;&#33021;&#19981;&#36866;&#21512;&#20986;&#29616;&#22312;&#20844;&#20849;&#21015;&#34920;&#20013;&#12290;</p><p>&#29616;&#22312;&#32771;&#34385;&#19968;&#19979;&#22914;&#26524;&#21015;&#34920;&#35206;&#30422;&#20102;&#21457;&#36865;&#32773;&#30340;Reply-to&#26102;&#20250;&#21457;&#29983;&#20160;&#20040;&#12290;&#22238;&#22797;&#32773;&#28857;reply-to-author&#65292;&#24076;&#26395;&#21521;&#21407;&#21457;&#36865;&#32773;&#31169;&#19979;&#21457;&#36865;&#19968;&#20010;&#37038;&#20214;&#12290;&#22240;&#20026;&#37027;&#26159;&#20182;&#25152;&#39044;&#26399;&#30340;&#34892;&#20026;&#65292;&#25152;&#20197;&#23601;&#21487;&#33021;&#19981;&#20250;&#23567;&#24515;&#26597;&#30475;&#26032;&#37038;&#20214;&#30340;&#25509;&#25910;&#22320;&#22336;&#12290;&#20182;&#32534;&#20889;&#20102;&#20182;&#30340;&#31169;&#20154;&#30340;&#12289;&#26426;&#23494;&#20449;&#24687;&#65292;&#21487;&#33021;&#20250;&#35828;&#19968;&#20123;&#23545;&#21015;&#34920;&#20013;&#30340;&#20154;&#26469;&#35828;&#24456;&#23604;&#23596;&#30340;&#20869;&#23481;&#65292;&#24182;&#28857;&#20987;&#21457;&#36865;&#38190;&#12290;&#20986;&#20046;&#24847;&#26009;&#30340;&#26159;&#65292;&#20960;&#20998;&#38047;&#20043;&#21518;&#20182;&#30340;&#20449;&#24687;&#20986;&#29616;<span class="emphasis"><em>&#37038;&#20214;&#21015;&#34920;&#20013;&#65281;</em></span>&#35802;&#28982;&#65292;&#20182;&#24212;&#35813;&#20180;&#32454;&#26597;&#30475;&#25509;&#25910;&#23383;&#27573;&#65292;&#23545;&#20110;Reply-to&#22836;&#19981;&#35201;&#26377;&#20219;&#20309;&#35774;&#24819;&#20540;&#12290;&#20294;&#26159;&#20316;&#32773;&#20960;&#20046;&#20250;&#32943;&#23450;&#23558;Reply-to&#35774;&#32622;&#20026;&#20182;&#20204;&#30340;&#20010;&#20154;&#22320;&#22336;&#65288;&#26356;&#30830;&#20999;&#22320;&#35828;&#65292;&#20182;&#20204;&#30340;&#36719;&#20214;&#20570;&#20102;&#35774;&#32622;&#65289;&#65292;&#35768;&#22810;&#36164;&#28145;&#30340;&#37038;&#20214;&#29992;&#25143;&#37117;&#20250;&#26399;&#26395;&#36825;&#26679;&#12290;&#23454;&#38469;&#19978;&#65292;&#22914;&#26524;&#19968;&#20010;&#20154;&#30452;&#25509;&#23558;Reply-to&#35774;&#32622;&#20026;&#20854;&#20182;&#22320;&#22336;&#65292;&#20182;&#36890;&#24120;&#20250;&#37038;&#20214;&#30340;&#27491;&#25991;&#25552;&#21450;&#36825;&#19968;&#28857;&#65292;&#36825;&#26679;&#20154;&#20204;&#23601;&#19981;&#20250;&#20026;&#22238;&#22797;&#25152;&#21457;&#29983;&#30340;&#20107;&#24773;&#24863;&#21040;&#24778;&#35766;&#20102;&#12290;</p><p>&#22240;&#20026;&#21487;&#33021;&#20986;&#29616;&#30340;&#20005;&#37325;&#21518;&#26524;&#65292;&#25105;&#30340;&#35266;&#28857;&#26159;&#20445;&#35777;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#20915;&#19981;&#35201;&#30896;Reply-to&#22836;&#12290;&#36825;&#26159;&#19968;&#20010;&#20351;&#29992;&#25216;&#26415;&#26469;&#40723;&#21169;&#21327;&#20316;&#30340;&#23454;&#20363;&#65292;&#20294;&#26159;&#23545;&#25105;&#26469;&#35828;&#26377;&#28508;&#22312;&#30340;&#21361;&#38505;&#21103;&#20316;&#29992;&#12290;&#28982;&#32780;&#65292;&#22312;&#35770;&#25112;&#30340;&#21478;&#19968;&#38754;&#20063;&#26377;&#24378;&#26377;&#21147;&#30340;&#35770;&#25454;&#12290;&#26080;&#35770;&#20320;&#36873;&#25321;&#20309;&#31181;&#26041;&#24335;&#65292;&#20320;&#37117;&#20250;&#22312;&#21015;&#34920;&#20013;&#30475;&#21040;&#26377;&#20154;&#38382;&#20320;&#20026;&#20160;&#20040;&#19981;&#36873;&#25321;&#21478;&#19968;&#31181;&#26041;&#24335;&#12290;&#22240;&#20026;&#20320;&#32943;&#23450;&#19981;&#24076;&#26395;&#36825;&#25104;&#20026;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#20027;&#35201;&#35752;&#35770;&#65292;&#25152;&#20197;&#26368;&#22909;&#20934;&#22791;&#22909;&#22238;&#24212;&#65292;&#35832;&#22914;&#27492;&#31867;&#32467;&#26463;&#35752;&#35770;&#32780;&#19981;&#26159;&#40723;&#21169;&#35752;&#35770;&#12290;&#35831;&#30830;&#35748;&#20320;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#22362;&#25345;&#35748;&#23450;&#20320;&#30340;&#20915;&#23450;&#65292;&#20063;&#23601;&#26159;&#26080;&#35770;&#26159;&#21738;&#20010;&#65292;&#23427;&#37117;&#24212;&#35813;&#26126;&#26174;&#26159;&#21807;&#19968;&#27491;&#30830;&#21644;&#26126;&#26234;&#30340;&#36873;&#25321;&#65288;&#21363;&#20351;&#20320;&#35748;&#20026;&#37027;&#26159;&#19968;&#20010;&#20107;&#23454;&#65289;&#12290;&#30456;&#21453;&#65292;&#25351;&#20986;&#36825;&#26159;&#19968;&#20010;&#32769;&#20105;&#35770;&#20102;&#65292;&#20004;&#26041;&#38754;&#37117;&#26377;&#22909;&#30340;&#35770;&#28857;&#65292;&#27809;&#26377;&#33021;&#22815;&#28385;&#36275;&#25152;&#26377;&#29992;&#25143;&#30340;&#36873;&#25321;&#65292;&#22240;&#32780;&#20320;&#21482;&#26159;&#20570;&#20986;&#20102;&#20320;&#33021;&#20570;&#20986;&#30340;&#26368;&#20339;&#20915;&#23450;&#12290;&#26377;&#31036;&#35980;&#30340;&#21578;&#30693;&#19981;&#35201;&#20877;&#28818;&#20919;&#39277;&#20102;&#65292;&#38500;&#38750;&#26377;&#19968;&#20123;&#29420;&#29305;&#30340;&#26032;&#20869;&#23481;&#65292;&#28982;&#21518;&#19981;&#24517;&#20877;&#21442;&#19982;&#35752;&#35770;&#24182;&#24076;&#26395;&#23427;&#33021;&#22815;&#33258;&#28982;&#27515;&#20129;&#12290;</p><p>&#26377;&#20123;&#20154;&#20250;&#24314;&#35758;&#24320;&#23637;&#19968;&#20010;&#25237;&#31080;&#12290;&#22914;&#26524;&#20320;&#24895;&#24847;&#20320;&#21487;&#20197;&#36825;&#26679;&#20570;&#65292;&#20294;&#26159;&#36825;&#20010;&#24773;&#20917;&#19979;&#25105;&#19981;&#35748;&#20026;&#36825;&#26159;&#19968;&#20010;&#28385;&#24847;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#23545;&#20110;&#26576;&#20010;&#20154;&#22240;&#20026;&#20986;&#20154;&#24847;&#26009;&#30340;&#34892;&#20026;&#27169;&#24335;&#30340;&#24809;&#32602;&#26159;&#24040;&#22823;&#30340;&#65288;&#19981;&#23567;&#24515;&#30340;&#23558;&#31169;&#26377;&#37038;&#20214;&#21457;&#36865;&#21040;&#20844;&#20849;&#21015;&#34920;&#65289;&#65292;&#32780;&#23545;&#20110;&#25152;&#26377;&#20854;&#20182;&#20154;&#30340;&#19981;&#20415;&#26159;&#30456;&#23545;&#36731;&#24494;&#30340;&#65288;&#20598;&#23572;&#38656;&#35201;&#25552;&#37266;&#26576;&#20154;&#22238;&#22797;&#21040;&#25972;&#20010;&#21015;&#34920;&#32780;&#19981;&#20165;&#20165;&#26159;&#20320;&#65289;&#65292;&#22810;&#25968;&#31080;&#26159;&#20160;&#20040;&#24182;&#19981;&#28165;&#26970;&#65292;&#21363;&#20351;&#33021;&#24471;&#21040;&#22810;&#25968;&#31080;&#65292;&#23569;&#25968;&#32773;&#24212;&#35813;&#25215;&#25285;&#36825;&#26679;&#30340;&#21361;&#38505;&#21527;&#65311;</p><p>&#36825;&#37324;&#25105;&#27809;&#26377;&#28041;&#21450;&#38382;&#39064;&#30340;&#25152;&#26377;&#26041;&#38754;&#65292;&#20165;&#20165;&#21253;&#21547;&#20102;&#30475;&#36215;&#26469;&#26368;&#37325;&#35201;&#30340;&#12290;&#23436;&#25972;&#30340;&#35752;&#35770;&#65292;&#35831;&#30475;&#36825;&#20004;&#31687;&#26435;&#23041;&#30340;&#25991;&#26723;&#65292;&#24403;&#20154;&#20204;&#36935;&#21040;&#20105;&#35770;&#26102;&#32463;&#24120;&#20250;&#24341;&#29992;&#23427;&#20204;&#65306;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>&#21247;&#21160;eply-to</strong></span>,
     <span class="emphasis"><em>by Chip Rosenthal</em></span></p><p><a class="ulink" href="http://www.unicom.com/pw/reply-to-harmful.html" target="_top">http://www.unicom.com/pw/reply-to-harmful.html</a></p></li><li class="listitem"><p><span class="bold"><strong>&#25226;Reply-to&#35774;&#32622;&#20026;&#21015;&#34920;&#22320;&#22336;</strong></span>,
     <span class="emphasis"><em>by Simon Hill</em></span></p><p><a class="ulink" href="http://www.metasystema.net/essays/reply-to.mhtml" target="_top">http://www.metasystema.net/essays/reply-to.mhtml</a></p></li></ul></div><p>

</p><p>&#26080;&#35770;&#20320;&#20559;&#29233;&#19978;&#38754;&#30340;&#21738;&#19968;&#26465;&#65292;&#25105;&#19981;&#35748;&#20026;&#27492;&#38382;&#39064;&#26377;&#25152;&#35859;&#30340;&#8220;&#27491;&#30830;&#8221;&#31572;&#26696;&#65292;&#20063;&#20250;&#24456;&#20048;&#24847;&#21442;&#19982;&#21040;<span class="emphasis"><em>&#35774;&#32622;</em></span>Reply-to&#30340;&#35768;&#22810;&#21015;&#34920;&#12290;&#26368;&#37325;&#35201;&#30340;&#20107;&#24773;&#26159;&#20320;&#23613;&#26089;&#30830;&#31435;&#19968;&#31181;&#26041;&#24335;&#65292;&#20043;&#21518;&#20877;&#20063;&#19981;&#35201;&#38519;&#20837;&#21040;&#20105;&#35770;&#20043;&#20013;&#12290;</p><div class="sect3" title="&#20004;&#20010;&#24187;&#24819;"><div class="titlepage"><div><div><h4 class="title"><a name="reply-fantasies"></a>&#20004;&#20010;&#24187;&#24819;</h4></div></div></div><p>&#23558;&#26469;&#26377;&#19968;&#22825;&#65292;&#26377;&#20123;&#32874;&#26126;&#20154;&#20250;&#22312;&#37038;&#20214;&#38405;&#35835;&#22120;&#23454;&#29616;&#19968;&#20010;<em class="firstterm">reply-to-list</em>&#38190;&#12290;&#23427;&#21487;&#20197;&#20351;&#29992;&#21069;&#38754;&#25552;&#21040;&#30340;&#19968;&#20123;&#33258;&#23450;&#20041;&#30340;&#21015;&#34920;&#22836;&#26469;&#25351;&#20986;&#37038;&#20214;&#21015;&#34920;&#30340;&#22320;&#22336;&#65292;&#28982;&#21518;&#20250;&#23558;&#22238;&#22797;&#20165;&#25351;&#21521;&#21040;&#37038;&#20214;&#21015;&#34920;&#65292;&#21516;&#26102;&#28040;&#38500;&#25152;&#26377;&#30340;&#20854;&#20182;&#25509;&#25910;&#22320;&#22336;&#65292;&#22240;&#27492;&#65292;&#26080;&#35770;&#22914;&#20309;&#22823;&#22810;&#25968;&#37117;&#26159;&#35746;&#38405;&#21015;&#34920;&#30340;&#22320;&#22336;&#12290;&#26368;&#32456;&#65292;&#20854;&#20182;&#37038;&#20214;&#38405;&#35835;&#22120;&#20063;&#20250;&#37319;&#29992;&#36825;&#20010;&#29305;&#24615;&#65292;&#25972;&#20010;&#20105;&#35770;&#20063;&#23601;&#21487;&#20197;&#20547;&#26071;&#24687;&#40723;&#20102;&#12290;&#65288;&#23454;&#38469;&#19978;&#65292;<a class="ulink" href="http://www.mutt.org/" target="_top">Mutt</a>&#37038;&#20214;&#38405;&#35835;&#22120;&#24050;&#32463;&#25552;&#20379;&#20102;&#36825;&#20010;&#29305;&#24615;&#12290;<sup>[<a name="idp853" href="#ftn.idp853" class="footnote">13</a>]</sup>&#65289;</p><p>&#19968;&#20010;&#26356;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#35753;&#27599;&#20010;&#35746;&#38405;&#32773;&#33258;&#24049;&#36873;&#25321;&#26159;&#21542;&#36827;&#34892;Reply-to&#22788;&#29702;&#12290;&#22914;&#26524;&#24076;&#26395;&#32463;&#36807;Reply-to&#22788;&#29702;&#65288;&#33258;&#24049;&#19982;&#20182;&#20154;&#30340;&#37038;&#20214;&#65289;&#65292;&#21487;&#20197;&#35201;&#27714;&#65292;&#32780;&#22914;&#26524;&#19981;&#24076;&#26395;&#65292;&#21017;&#21487;&#20197;&#35774;&#32622;&#20026;Reply-to&#19981;&#21464;&#12290;&#28982;&#32780;&#65292;&#25105;&#19981;&#30693;&#36947;&#26377;&#20219;&#20309;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#25552;&#20379;&#36825;&#20010;&#27599;&#35746;&#25143;&#22522;&#30784;&#30340;&#35774;&#32622;&#12290;&#25105;&#20204;&#36824;&#26159;&#21482;&#33021;&#20351;&#29992;&#20840;&#23616;&#35774;&#32622;&#12290;<sup>[<a name="idp857" href="#ftn.idp857" class="footnote">14</a>]</sup></p></div></div><div class="sect2" title="&#24402;&#26723;"><div class="titlepage"><div><div><h3 class="title"><a name="archiving"></a>&#24402;&#26723;</h3></div></div></div><p>&#36816;&#36716;&#21015;&#34920;&#30340;&#36719;&#20214;&#37117;&#26377;&#33258;&#24049;&#29305;&#23450;&#30340;&#35774;&#32622;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#30340;&#25216;&#26415;&#32454;&#33410;&#65292;&#36229;&#20986;&#20102;&#26412;&#20070;&#30340;&#33539;&#22260;&#12290;&#24403;&#36873;&#25321;&#24402;&#26723;&#26102;&#65292;&#35831;&#32771;&#34385;&#36825;&#20123;&#29305;&#24615;&#65306;</p><div class="variablelist"><dl><dt><span class="term">&#31435;&#21051;&#26356;&#26032;</span></dt><dd><p>&#20154;&#20204;&#32463;&#24120;&#20250;&#24341;&#29992;&#22312;&#19978;&#20010;&#23567;&#26102;&#25152;&#20570;&#30340;&#21457;&#24067;&#24402;&#26723;&#12290;&#22914;&#26524;&#21487;&#33021;&#65292;&#24402;&#26723;&#22120;&#24517;&#39035;&#33021;&#22815;&#31435;&#21051;&#24402;&#26723;&#27599;&#20010;&#21457;&#24067;&#65292;&#36825;&#26679;&#21457;&#24067;&#20986;&#29616;&#22312;&#37038;&#20214;&#21015;&#34920;&#26102;&#65292;&#23427;&#20063;&#23601;&#20986;&#29616;&#22312;&#20102;&#24402;&#26723;&#20013;&#12290;&#22914;&#26524;&#27809;&#26377;&#36825;&#20010;&#29305;&#24615;&#65292;&#33267;&#23569;&#24212;&#35813;&#23558;&#20854;&#35774;&#32622;&#20026;&#27599;&#23567;&#26102;&#26356;&#26032;&#19968;&#27425;&#12290; &#65288;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#19968;&#20123;&#24402;&#26723;&#22120;&#20250;&#27599;&#22812;&#26356;&#26032;&#65292;&#23545;&#20110;&#19968;&#20010;&#27963;&#36291;&#30340;&#37038;&#20214;&#21015;&#34920;&#36825;&#26377;&#28857;&#22826;&#28382;&#21518;&#20102;&#12290;&#65289;</p></dd><dt><span class="term">&#24341;&#29992;&#31283;&#23450;&#24615;</span></dt><dd><p>&#19968;&#26086;&#19968;&#20010;&#20449;&#24687;&#24050;&#32463;&#24402;&#26723;&#21040;&#29305;&#23450;URL&#65292;&#23427;&#24212;&#35813;&#22312;&#30456;&#21516;&#30340;&#21487;&#35775;&#38382;URL&#65292;&#24182;&#23613;&#21487;&#33021;&#30340;&#27704;&#36828;&#20445;&#25345;&#12290;&#21363;&#20351;&#24402;&#26723;&#37325;&#24314;&#65292;&#20174;&#22791;&#20221;&#20013;&#24674;&#22797;&#65292;&#25110;&#32773;&#20854;&#20182;&#20462;&#27491;&#65292;&#20219;&#20309;&#24050;&#32463;&#20844;&#24320;&#30340;URL&#24212;&#35813;&#20445;&#25345;&#30456;&#21516;&#12290;&#31283;&#23450;&#24341;&#29992;&#21487;&#20197;&#35753;Internet&#19978;&#30340;&#25628;&#32034;&#24341;&#25806;&#33021;&#22815;&#32034;&#24341;&#24402;&#26723;&#65292;&#21487;&#20197;&#26041;&#20415;&#29992;&#25143;&#26597;&#25214;&#31572;&#26696;&#12290;&#31283;&#23450;&#24341;&#29992;&#37325;&#35201;&#30340;&#21478;&#19968;&#20010;&#21407;&#22240;&#26159;&#22240;&#20026;&#37038;&#20214;&#21015;&#34920;&#32463;&#24120;&#20250;&#22312;Bug&#36319;&#36394;&#65288;&#21442;&#32771;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="bug-tracker.html" title="Bug&#36319;&#36394;">the section called &#8220;Bug&#36319;&#36394;&#8221;</a>&#65289;&#25110;&#20854;&#20182;&#39033;&#30446;&#30340;&#25991;&#26723;&#20013;&#34987;&#24341;&#29992;&#12290;</p><p>&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#37038;&#20214;&#21015;&#34920;&#24212;&#35813;&#33021;&#22815;&#21253;&#21547;&#19968;&#20010;&#20449;&#24687;&#24402;&#26723;&#30340;&#22320;&#22336;&#65292;&#25110;&#32773;&#33267;&#23569;&#22312;&#20998;&#21457;&#21040;&#25509;&#25910;&#32773;&#30340;&#20449;&#24687;&#22836;&#19978;&#26377;URL&#30340;&#20449;&#24687;&#29305;&#23450;&#30340;&#37096;&#20998;&#12290;&#36825;&#26679;&#20154;&#20204;&#23601;&#26377;&#20102;&#20449;&#24687;&#30340;&#25335;&#36125;&#65292;&#24050;&#32463;&#30693;&#36947;&#20102;&#24402;&#26723;&#30340;&#20301;&#32622;&#65292;&#32780;&#26080;&#39035;&#23454;&#38469;&#35775;&#38382;&#24402;&#26723;&#65292;&#36825;&#26679;&#20570;&#24456;&#26377;&#29992;&#65292;&#22240;&#20026;&#20219;&#20309;&#25805;&#20316;&#37117;&#38656;&#35201;&#33457;&#36153;&#32593;&#32476;&#27983;&#35272;&#22120;&#30340;&#26102;&#38388;&#12290;&#25105;&#19981;&#30693;&#36947;&#26159;&#21542;&#26377;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#23454;&#38469;&#25903;&#25345;&#36825;&#20010;&#29305;&#24615;&#65307;&#19981;&#24184;&#30340;&#26159;&#65292;&#25105;&#29992;&#36807;&#30340;&#37117;&#19981;&#34892;&#12290;&#28982;&#32780;&#65292;&#36825;&#26159;&#25105;&#35201;&#23547;&#25214;&#30340;&#65288;&#25110;&#32773;&#65292;&#22914;&#26524;&#20320;&#27491;&#22312;&#20889;&#37038;&#20214;&#21015;&#34920;&#36719;&#20214;&#65292;&#36825;&#24212;&#35813;&#26159;&#19968;&#20010;&#21487;&#20197;&#32771;&#34385;&#23454;&#29616;&#30340;&#29305;&#24615;&#65289;&#12290;</p></dd><dt><span class="term">&#22791;&#20221;</span></dt><dd><p>&#22914;&#20309;&#22791;&#20221;&#24402;&#26723;&#24517;&#39035;&#30456;&#24403;&#28165;&#26970;&#65292;&#32780;&#24674;&#22797;&#26041;&#27861;&#20063;&#19981;&#33021;&#22826;&#38590;&#12290;&#25442;&#19968;&#21477;&#35805;&#35828;&#65292;&#19981;&#35201;&#25226;&#24402;&#26723;&#22120;&#24403;&#20316;&#40657;&#30418;&#23376;&#12290;&#20320;&#65288;&#25110;&#32773;&#20320;&#39033;&#30446;&#20013;&#30340;&#26576;&#20010;&#20154;&#65289;&#24212;&#24403;&#30693;&#36947;&#20449;&#24687;&#23384;&#25918;&#22312;&#20160;&#20040;&#22320;&#26041;&#65292;&#20197;&#21450;&#22914;&#20309;&#22312;&#24517;&#35201;&#26102;&#20174;&#20449;&#24687;&#23384;&#25918;&#22788;&#37325;&#26032;&#29983;&#25104;&#24402;&#26723;&#39029;&#12290;&#36825;&#20123;&#24402;&#26723;&#26159;&#29645;&#36149;&#30340;&#25968;&#25454;&#8212;&#22833;&#21435;&#20102;&#23427;&#20204;&#65292;&#23601;&#20687;&#22833;&#21435;&#20102;&#39033;&#30446;&#38598;&#20307;&#35760;&#24518;&#20013;&#32654;&#22909;&#30340;&#19968;&#37096;&#20998;&#12290;</p></dd><dt><span class="term">&#32447;&#32034;&#25903;&#25345;</span></dt><dd><p>&#24212;&#35813;&#33021;&#22815;&#20174;&#20219;&#24847;&#21333;&#29420;&#30340;&#20449;&#24687;&#36827;&#20837;&#21407;&#26469;&#20449;&#24687;&#25152;&#24402;&#23646;&#30340;<em class="firstterm">&#32447;&#32034;</em>&#65288;&#19968;&#32452;&#20851;&#32852;&#30340;&#20449;&#24687;&#65289;&#65292;&#27599;&#20010;&#32447;&#32034;&#24517;&#39035;&#25317;&#26377;&#33258;&#24049;&#30340;URL&#65292;&#19982;&#32447;&#32034;&#20013;&#30340;&#20854;&#20182;&#20449;&#24687;&#21306;&#20998;&#24320;&#26469;&#12290;</p></dd><dt><span class="term">&#21487;&#25628;&#32034;&#24615;</span></dt><dd><p>&#19968;&#20010;&#19981;&#25903;&#25345;&#25628;&#32034;&#30340;&#24402;&#26723;&#22120;&#8212;&#38024;&#23545;&#20449;&#24687;&#20869;&#23481;&#12289;&#20197;&#21450;&#20316;&#32773;&#21644;&#20027;&#39064;&#8212;&#25509;&#36817;&#20110;&#26080;&#29992;&#12290;&#27880;&#24847;&#26576;&#20123;&#24402;&#26723;&#22120;&#21482;&#26159;&#23558;&#27492;&#24037;&#20316;&#20132;&#32473;&#20102;&#35832;&#22914;<a class="ulink" href="http://www.google.com/" target="_top">Google</a>&#30340;&#31532;&#19977;&#26041;&#25628;&#32034;&#24341;&#25806;&#12290;&#36825;&#26159;&#21487;&#20197;&#25509;&#21463;&#30340;&#65292;&#20294;&#26159;&#30452;&#25509;&#30340;&#25628;&#32034;&#25903;&#25345;&#36890;&#24120;&#20250;&#26356;&#21152;&#26131;&#20110;&#35843;&#25972;&#65292;&#20363;&#22914;&#25105;&#20204;&#21487;&#20197;&#25351;&#23450;&#25628;&#32034;&#21305;&#37197;&#30340;&#26159;&#20027;&#39064;&#34892;&#36824;&#26159;&#27491;&#25991;&#12290;</p></dd></dl></div><p>&#19978;&#38754;&#26159;&#19968;&#20010;&#25216;&#26415;&#26816;&#26597;&#21015;&#34920;&#65292;&#21487;&#20197;&#24110;&#21161;&#20320;&#35780;&#20272;&#21644;&#35774;&#32622;&#24402;&#26723;&#22120;&#65292;&#26412;&#31456;&#21518;&#38754;&#23558;&#35752;&#35770;&#22914;&#20309;&#35753;&#20154;&#20204;<span class="emphasis"><em>&#21033;&#29992;</em></span>&#24402;&#26723;&#22120;&#26469;&#20351;&#39033;&#30446;&#33719;&#30410;&#65292;&#29305;&#21035;&#26159;&#22312;<a class="xref" href="growth.html#using-archives" title="&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;">the section called &#8220;&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;&#8221;</a>&#12290;</p></div><div class="sect2" title="&#36719;&#20214;"><div class="titlepage"><div><div><h3 class="title"><a name="mailing-list-software"></a>&#36719;&#20214;</h3></div></div></div><p>&#36825;&#37324;&#26159;&#19968;&#20123;&#21487;&#20197;&#36827;&#34892;&#21015;&#34920;&#31649;&#29702;&#21644;&#24402;&#26723;&#30340;&#24320;&#28304;&#24037;&#20855;&#12290;&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#20027;&#26426;&#24050;&#32463;&#26377;&#40664;&#35748;&#30340;&#35774;&#32622;&#65292;&#20320;&#21487;&#33021;&#26080;&#27861;&#20915;&#23450;&#19968;&#20010;&#24037;&#20855;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;&#24517;&#39035;&#33258;&#24049;&#23433;&#35013;&#19968;&#20010;&#65292;&#36825;&#20123;&#26159;&#21487;&#20197;&#36873;&#25321;&#30340;&#12290;&#25105;&#23454;&#38469;&#20351;&#29992;&#36807;&#30340;&#21253;&#25324;ailman&#12289;Ezmlm&#12289;MHonArc&#21644;Hypermail&#65292;&#36825;&#24182;&#19981;&#26159;&#24847;&#21619;&#30528;&#20854;&#20182;&#24037;&#20855;&#19981;&#22909;&#65288;&#24403;&#28982;&#21487;&#33021;&#26377;&#20854;&#20182;&#19968;&#20123;&#24037;&#20855;&#21482;&#26159;&#25105;&#30896;&#24039;&#27809;&#26377;&#25214;&#21040;&#65292;&#25152;&#20197;&#19981;&#35201;&#25226;&#36825;&#24403;&#20316;&#23436;&#20840;&#30340;&#21015;&#34920;&#65289;&#12290;</p><p>&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#36719;&#20214;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Mailman</strong></span> &#8212; <a class="ulink" href="http://www.list.org/" target="_top">http://www.list.org/</a></p><p>&#65288;&#26377;&#20869;&#32622;&#30340;&#24402;&#26723;&#22120;&#65292;&#20197;&#21450;&#22806;&#25346;&#20854;&#20182;&#24402;&#26723;&#22120;&#30340;&#38057;&#23376;&#12290;&#65289;</p></li><li class="listitem"><p><span class="bold"><strong>SmartList</strong></span> &#8212; <a class="ulink" href="http://www.procmail.org/" target="_top">http://www.procmail.org/</a></p><p>&#65288;&#19987;&#38376;&#29992;&#20110;Procmail&#37038;&#20214;&#22788;&#29702;&#31995;&#32479;&#12290;&#65289;</p></li><li class="listitem"><p><span class="bold"><strong>Ecartis</strong></span> &#8212; <a class="ulink" href="http://www.ecartis.org/" target="_top">http://www.ecartis.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>ListProc</strong></span> &#8212; <a class="ulink" href="http://listproc.sourceforge.net/" target="_top">http://listproc.sourceforge.net/</a></p></li><li class="listitem"><p><span class="bold"><strong>Ezmlm</strong></span> &#8212; <a class="ulink" href="http://cr.yp.to/ezmlm.html" target="_top">http://cr.yp.to/ezmlm.html</a></p><p>&#65288;&#35774;&#35745;&#19982;<a class="ulink" href="http://cr.yp.to/qmail.html" target="_top">Qmail</a>&#37038;&#20214;&#25237;&#36882;&#31995;&#32479;&#21327;&#21516;&#24037;&#20316;&#12290;&#65289;</p></li><li class="listitem"><p><span class="bold"><strong>Dada</strong></span> &#8212; <a class="ulink" href="http://mojo.skazat.com/" target="_top">http://mojo.skazat.com/</a></p><p>&#65288;&#19981;&#31649;&#32593;&#31449;&#22240;&#20026;&#20160;&#20040;&#22855;&#24618;&#30340;&#24819;&#27861;&#24076;&#26395;&#25513;&#30422;&#36825;&#20010;&#20107;&#23454;&#65292;&#36825;&#30830;&#23454;&#26159;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#65292;&#20351;&#29992;GNU&#35768;&#21487;&#35777;&#21457;&#24067;&#65292;&#20063;&#26377;&#20869;&#32622;&#30340;&#24402;&#26723;&#22120;&#12290;&#65289;</p></li></ul></div><p>&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#36719;&#20214;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>MHonArc</strong></span> &#8212; <a class="ulink" href="http://www.mhonarc.org/" target="_top">http://www.mhonarc.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>Hypermail</strong></span> &#8212; <a class="ulink" href="http://www.hypermail.org/" target="_top">http://www.hypermail.org/</a></p></li><li class="listitem"><p><span class="bold"><strong>Lurker</strong></span> &#8212; <a class="ulink" href="http://sourceforge.net/projects/lurker/" target="_top">http://sourceforge.net/projects/lurker/</a></p></li><li class="listitem"><p><span class="bold"><strong>Procmail</strong></span> &#8212; <a class="ulink" href="http://www.procmail.org/" target="_top">http://www.procmail.org/</a></p><p>&#65288;SmartList&#30340;&#20276;&#20387;&#36719;&#20214;&#65292;&#20063;&#21487;&#20197;&#26159;&#36890;&#29992;&#30340;&#37038;&#20214;&#22788;&#29702;&#31995;&#32479;&#65292;&#24456;&#26174;&#28982;&#65292;&#34987;&#37197;&#32622;&#20026;&#24402;&#26723;&#22120;&#12290;&#65289;</p></li></ul></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp853" href="#idp853" class="para">13</a>] </sup>&#22312;&#26412;&#20070;&#20986;&#29616;&#21518;&#19981;&#20037;&#65292;<a class="ulink" href="http://www.michaelbernstein.com/" target="_top">Michael Bernstein</a>&#21578;&#35785;&#25105;&#65306;&#8220;&#20063;&#26377;&#19968;&#20123;Mutt&#20043;&#22806;&#30340;&#20854;&#20182;&#23458;&#25143;&#31471;&#23454;&#29616;&#20102;reply-to-list&#21151;&#33021;&#12290;&#20363;&#22914;&#65292;Evolution&#30340;&#19968;&#20010;&#24555;&#25463;&#38190;&#26377;&#36825;&#20010;&#21151;&#33021;&#65292;&#20294;&#19981;&#26159;&#19968;&#20010;&#25353;&#38062;&#65288;Ctrl+L&#65289;&#12290;&#8221;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp857" href="#idp857" class="para">14</a>] </sup>&#20889;&#21040;&#36825;&#37324;&#65292;&#25105;&#24050;&#32463;&#21457;&#29616;&#33267;&#23569;&#26377;&#19968;&#20010;&#21015;&#34920;&#31649;&#29702;&#31995;&#32479;&#25552;&#20379;&#20102;&#36825;&#20010;&#29305;&#24615;&#65306;<a class="ulink" href="http://siesta.unixbeard.net/" target="_top">Siesta</a>&#12290;&#35831;&#30475;&#36825;&#31687;&#30456;&#20851;&#30340;&#25991;&#31456;&#65306;<a class="ulink" href="http://www.perl.com/pub/a/2004/02/05/siesta.html" target="_top">http://www.perl.com/pub/a/2004/02/05/siesta.html</a></p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="technical-infrastructure.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="vc.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#29256;&#26412;&#25511;&#21046;</td></tr></table></div></body></html>
