<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="releases-and-daily-development.html" title="&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="next" href="share-management.html" title="&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="releases-and-daily-development.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="share-management.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><div class="titlepage"><div><div><h2 class="title"><a name="managing-volunteers"></a>Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="managing-volunteers.html#volunteers">&#20174;&#24535;&#24895;&#32773;&#20013;&#33719;&#21462;&#26368;&#22810;</a></span></dt><dd><dl><dt><span class="sect2"><a href="managing-volunteers.html#delegation">&#22996;&#27966;</a></span></dt><dd><dl><dt><span class="sect3"><a href="managing-volunteers.html#delegation-assignment">&#26126;&#30830;&#21306;&#20998;&#35843;&#26597;&#21644;&#25351;&#27966;</a></span></dt><dt><span class="sect3"><a href="managing-volunteers.html#delegation-followup">&#25351;&#27966;&#21518;&#35201;&#32487;&#32493;&#36319;&#36394;</a></span></dt><dt><span class="sect3"><a href="managing-volunteers.html#delegation-interest">&#36890;&#30693;&#24863;&#20852;&#36259;&#30340;&#20154;</a></span></dt></dl></dd><dt><span class="sect2"><a href="managing-volunteers.html#praise-and-criticism">&#36190;&#25196;&#21644;&#25209;&#35780;</a></span></dt><dt><span class="sect2"><a href="managing-volunteers.html#territoriality">&#38450;&#27490;&#21106;&#25454;</a></span></dt><dt><span class="sect2"><a href="managing-volunteers.html#automation">&#33258;&#21160;&#21270;&#29575;</a></span></dt><dd><dl><dt><span class="sect3"><a href="managing-volunteers.html#automated-testing">&#33258;&#21160;&#27979;&#35797;</a></span></dt></dl></dd><dt><span class="sect2"><a href="managing-volunteers.html#users-to-volunteers">&#23558;&#27599;&#20010;&#29992;&#25143;&#24403;&#20316;&#28508;&#22312;&#30340;&#24535;&#24895;&#32773;</a></span></dt></dl></dd><dt><span class="sect1"><a href="share-management.html">&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;</a></span></dt><dd><dl><dt><span class="sect2"><a href="share-management.html#patch-manager">&#34917;&#19969;&#31649;&#29702;&#21592;</a></span></dt><dt><span class="sect2"><a href="share-management.html#translation-manager">&#32763;&#35793;&#31649;&#29702;&#21592;</a></span></dt><dt><span class="sect2"><a href="share-management.html#documentation-manager">&#25991;&#26723;&#31649;&#29702;&#21592;</a></span></dt><dt><span class="sect2"><a href="share-management.html#issue-manager">&#38382;&#39064;&#31649;&#29702;&#21592;</a></span></dt><dt><span class="sect2"><a href="share-management.html#faq-manager">FAQ&#31649;&#29702;&#21592;</a></span></dt></dl></dd><dt><span class="sect1"><a href="transitions.html">&#36716;&#21270;</a></span></dt><dt><span class="sect1"><a href="committers.html">&#25552;&#20132;&#32773;</a></span></dt><dd><dl><dt><span class="sect2"><a href="committers.html#choosing-committers">&#36873;&#25321;&#25552;&#20132;&#32773;</a></span></dt><dt><span class="sect2"><a href="committers.html#revoking-committers">&#25910;&#22238;&#25552;&#20132;&#26435;&#38480;</a></span></dt><dt><span class="sect2"><a href="committers.html#partial-committers">&#37096;&#20998;&#25552;&#20132;&#26435;&#38480;</a></span></dt><dt><span class="sect2"><a href="committers.html#dormant-committers">&#20241;&#30496;&#25552;&#20132;&#32773;</a></span></dt><dt><span class="sect2"><a href="committers.html#commit-access-openness">&#36991;&#20813;&#31070;&#31192;</a></span></dt></dl></dd><dt><span class="sect1"><a href="credit.html">&#33635;&#35465;</a></span></dt><dt><span class="sect1"><a href="forks.html">&#20998;&#21449;</a></span></dt><dd><dl><dt><span class="sect2"><a href="forks.html#forks-handling">&#22788;&#29702;&#20998;&#21449;</a></span></dt><dt><span class="sect2"><a href="forks.html#forks-initiating">&#21021;&#22987;&#19968;&#20010;&#20998;&#21449;</a></span></dt></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#35753;&#20154;&#20204;&#35748;&#21487;&#39033;&#30446;&#25152;&#38656;&#35201;&#30340;&#65292;&#24182;&#19968;&#21516;&#21162;&#21147;&#23454;&#29616;&#65292;&#19981;&#20165;&#20165;&#38656;&#35201;&#21451;&#22909;&#30340;&#27675;&#22260;&#21644;&#36991;&#20813;&#26126;&#26174;&#30340;&#21151;&#33021;&#24322;&#24120;&#12290;&#38656;&#35201;&#26576;&#20010;&#20154;&#25110;&#19968;&#20123;&#20154;&#26377;&#24847;&#35782;&#30340;&#31649;&#29702;&#25152;&#26377;&#21442;&#19982;&#30340;&#20154;&#12290;&#31649;&#29702;&#24535;&#24895;&#32773;&#21487;&#33021;&#19981;&#20687;&#35745;&#31639;&#26426;&#32534;&#31243;&#20855;&#26377;&#21516;&#26679;&#30340;&#25216;&#26415;&#25216;&#24039;&#65292;&#20294;&#23427;&#26159;&#19968;&#31181;&#21487;&#20197;&#36890;&#36807;&#23398;&#20064;&#21644;&#23454;&#36341;&#25913;&#36827;&#30340;&#25216;&#33402;&#12290;</p><p>&#26412;&#31456;&#26159;&#31649;&#29702;&#24535;&#24895;&#32773;&#25216;&#26415;&#30340;&#25720;&#24425;&#34955;&#12290;&#21487;&#33021;&#25551;&#32472;&#30340;&#20998;&#37327;&#36828;&#37325;&#20110;&#20043;&#21069;&#30340;&#31456;&#33410;&#65292;&#20250;&#20197;Subversion&#39033;&#30446;&#20316;&#20026;&#26696;&#20363;&#30740;&#31350;&#65292;&#19968;&#26041;&#38754;&#22240;&#20026;&#25105;&#22312;&#36825;&#20010;&#39033;&#30446;&#24037;&#20316;&#65292;&#25152;&#26377;&#20027;&#35201;&#30340;&#36164;&#28304;&#23601;&#22312;&#25163;&#36793;&#65292;&#20063;&#22240;&#20026;&#30776;&#33258;&#23478;&#30340;&#29627;&#29827;&#24635;&#27604;&#30776;&#21035;&#20154;&#26356;&#33021;&#35753;&#20154;&#33021;&#25509;&#21463;&#21543;&#12290;&#20294;&#26159;&#25105;&#20063;&#30475;&#21040;&#35768;&#22810;&#20854;&#20182;&#30340;&#39033;&#30446;&#22240;&#20026;&#24212;&#29992;&#36825;&#20123;&#24314;&#35758;&#32780;&#33719;&#30410;&#65292;&#20197;&#21450;&#26410;&#33021;&#24212;&#29992;&#30340;&#21518;&#26524;&#65307;&#24403;&#22312;&#25919;&#27835;&#19978;&#36866;&#21512;&#32473;&#20986;&#36825;&#20123;&#39033;&#30446;&#30340;&#26696;&#20363;&#26102;&#65292;&#25105;&#23601;&#20250;&#36825;&#26679;&#20570;&#12290;</p><p>&#35828;&#21040;&#25919;&#27835;&#65292;&#36825;&#26159;&#22312;&#36817;&#36317;&#31163;&#35266;&#23519;&#20197;&#25243;&#24323;&#37027;&#20123;&#24694;&#27602;&#35821;&#35328;&#30340;&#22909;&#26102;&#26426;&#12290;&#35768;&#22810;&#24037;&#31243;&#24072;&#35748;&#20026;&#25919;&#27835;&#21482;&#26159;&#20854;&#20182;&#20154;&#21442;&#19982;&#30340;&#19996;&#35199;&#12290; &#8220;<span class="emphasis"><em>&#25105;&#21482;&#26159;</em></span>&#25552;&#20986;&#23545;&#20110;&#36825;&#20010;&#39033;&#30446;&#26368;&#22909;&#30340;&#36807;&#31243;&#65292;&#20294;&#26159;<span class="emphasis"><em>&#22905;</em></span>&#20986;&#20110;&#25919;&#27835;&#21407;&#22240;&#25552;&#20986;&#21453;&#23545;&#12290;&#8221;&#25105;&#30456;&#20449;&#25919;&#27835;&#65288;&#20197;&#21450;&#37027;&#20123;&#35748;&#20026;&#26159;&#25919;&#27835;&#30340;&#20107;&#24773;&#65289;&#30340;&#28798;&#38590;&#22312;&#24037;&#31243;&#24072;&#20013;&#29305;&#21035;&#24378;&#22823;&#65292;&#22240;&#20026;&#24037;&#31243;&#24072;&#24102;&#26469;&#30340;&#24605;&#24819;&#20013;&#24635;&#26377;&#20123;&#35299;&#20915;&#26041;&#26696;&#26159;&#23458;&#35266;&#30340;&#20248;&#20110;&#20854;&#20182;&#26041;&#26696;&#12290;&#22240;&#27492;&#65292;&#24403;&#26377;&#20154;&#34987;&#24605;&#32771;&#20043;&#22806;&#30340;&#26041;&#24335;&#28608;&#21457;&#8212;&#20363;&#22914;&#32500;&#25252;&#33258;&#24049;&#30340;&#24433;&#21709;&#65292;&#21066;&#24369;&#20854;&#20182;&#20154;&#30340;&#24433;&#21709;&#65292;&#33609;&#29575;&#30340;&#35752;&#20215;&#36824;&#20215;&#25110;&#36991;&#20813;&#20260;&#23475;&#26576;&#20154;&#30340;&#24773;&#32490;&#8212;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#21442;&#19982;&#32773;&#23601;&#20250;&#24863;&#21040;&#24700;&#24594;&#12290;&#24403;&#28982;&#65292;&#24403;&#20851;&#31995;&#21040;&#20182;&#20204;&#33258;&#24049;&#30340;&#20851;&#38190;&#21033;&#30410;&#26102;&#20182;&#20204;&#20063;&#24456;&#38590;&#36991;&#20813;&#36825;&#26679;&#20570;&#12290;</p><p>&#22914;&#26524;&#20320;&#35748;&#20026;&#8221;&#25919;&#27835;&#8220;&#26159;&#19968;&#21477;&#32942;&#33039;&#30340;&#35789;&#27719;&#65292;&#24076;&#26395;&#20320;&#30340;&#39033;&#30446;&#36828;&#31163;&#23427;&#65292;&#35831;&#25918;&#24323;&#21543;&#12290;&#24403;&#20154;&#20204;&#38656;&#35201;&#21512;&#20316;&#30340;&#31649;&#29702;&#20849;&#20139;&#36164;&#28304;&#26102;&#65292;&#25919;&#27835;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#12290;&#27599;&#20010;&#20154;&#22312;&#20316;&#20986;&#20915;&#31574;&#26102;&#65292;&#37117;&#20250;&#24456;&#33258;&#28982;&#30340;&#32771;&#34385;&#21040;&#20915;&#31574;&#30340;&#32467;&#26524;&#23545;&#33258;&#24049;&#22312;&#39033;&#30446;&#20013;&#24433;&#21709;&#21147;&#30340;&#24433;&#21709;&#12290;&#27605;&#31455;&#65292;&#22914;&#26524;&#20320;&#20687;&#20854;&#20182;&#31243;&#24207;&#21592;&#19968;&#26679;&#30456;&#20449;&#33258;&#24049;&#30340;&#21028;&#26029;&#21644;&#25216;&#33021;&#65292;&#37027;&#20040;&#26410;&#26469;&#24433;&#21709;&#21147;&#30340;&#38477;&#20302;&#20063;&#21487;&#20197;&#30475;&#20316;&#26159;&#25216;&#26415;&#30340;&#32467;&#26524;&#12290;&#21516;&#26679;&#30340;&#36828;&#31163;&#21487;&#20197;&#24212;&#29992;&#20110;&#20854;&#20182;&#30340;&#34892;&#20026;&#65292;&#20174;&#34920;&#38754;&#19978;&#30475;&#23601;&#26159;&#8221;&#32431;&#31929;&#30340;&#8220;&#25919;&#27835;&#12290;&#20107;&#23454;&#19978;&#65292;&#27809;&#26377;&#32431;&#31929;&#30340;&#25919;&#27835;&#65306;&#36825;&#26159;&#22240;&#20026;&#22914;&#26524;&#20154;&#20204;&#25226;&#25919;&#27835;&#20316;&#20026;&#39318;&#35201;&#32771;&#34385;&#30340;&#22240;&#32032;&#65292;&#21017;&#34892;&#21160;&#22312;&#23454;&#38469;&#19978;&#20250;&#26377;&#22810;&#37325;&#30340;&#21518;&#26524;&#12290;&#26368;&#32456;&#65292;&#25919;&#27835;&#21482;&#26159;&#20915;&#31574;&#25152;&#35201;&#32771;&#34385;&#30340;<span class="emphasis"><em>&#25152;&#26377;</em></span>&#21518;&#26524;&#30340;&#19968;&#31181;&#25215;&#35748;&#12290;&#22914;&#26524;&#26576;&#20010;&#20915;&#31574;&#30340;&#32467;&#26524;&#21487;&#20197;&#35753;&#32477;&#22823;&#22810;&#25968;&#21442;&#19982;&#32773;&#22312;&#25216;&#26415;&#19978;&#24863;&#21040;&#28385;&#24847;&#65292;&#20294;&#26159;&#20250;&#23548;&#33268;&#21147;&#37327;&#23545;&#27604;&#21457;&#29983;&#21464;&#21270;&#65292;&#20351;&#20851;&#38190;&#20154;&#29289;&#24863;&#35273;&#33258;&#24049;&#34987;&#23396;&#31435;&#65292;&#37027;&#20040;&#21518;&#32773;&#19982;&#21069;&#32773;&#21516;&#26679;&#37325;&#35201;&#12290;&#24573;&#30053;&#23427;&#24182;&#19981;&#26159;&#39640;&#23578;&#65292;&#21482;&#26159;&#30701;&#35270;&#12290;</p><p>&#23601;&#20687;&#20320;&#21518;&#38754;&#23558;&#35201;&#35835;&#21040;&#30340;&#24314;&#35758;&#65292;&#20197;&#21450;&#20320;&#33258;&#24049;&#24037;&#20316;&#30340;&#39033;&#30446;&#65292;&#35831;&#29282;&#35760;<span class="emphasis"><em>&#27809;&#26377;&#20154;</em></span>&#26159;&#39640;&#20110;&#25919;&#27835;&#30340;&#12290;&#23545;&#20110;&#39640;&#20110;&#25919;&#27835;&#30340;&#20225;&#22270;&#20165;&#20165;&#26159;&#19968;&#31181;&#29305;&#21035;&#30340;&#25919;&#27835;&#31574;&#30053;&#65292;&#26377;&#26102;&#38750;&#24120;&#26377;&#29992;&#65292;&#20294;&#24182;&#19981;&#29616;&#23454;&#12290;&#24403;&#26576;&#20154;&#26377;&#20998;&#27495;&#26102;&#25919;&#27835;&#24050;&#32463;&#20986;&#29616;&#65292;&#25104;&#21151;&#30340;&#39033;&#30446;&#33021;&#22815;&#23558;&#25919;&#27835;&#26426;&#21046;&#24314;&#35774;&#24615;&#30340;&#29992;&#20110;&#31649;&#29702;&#20998;&#27495;&#12290;</p></div><div class="sect1" title="&#20174;&#24535;&#24895;&#32773;&#20013;&#33719;&#21462;&#26368;&#22810;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="volunteers"></a>&#20174;&#24535;&#24895;&#32773;&#20013;&#33719;&#21462;&#26368;&#22810;</h2></div></div></div><p>&#24535;&#24895;&#32773;&#20026;&#20160;&#20040;&#35201;&#20026;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#24037;&#20316;&#65311;<sup>[<a name="idp2603" href="#ftn.idp2603" class="footnote">24</a>]</sup></p><p>&#24403;&#34987;&#35810;&#38382;&#26102;&#65292;&#35768;&#22810;&#20154;&#22768;&#31216;&#33258;&#24049;&#21482;&#26159;&#22240;&#20026;&#24076;&#26395;&#21046;&#20316;&#22909;&#36719;&#20214;&#65292;&#25110;&#24076;&#26395;&#33258;&#24049;&#20462;&#22797;&#25152;&#38656;&#35201;&#30340;bug&#12290;&#20294;&#26159;&#36825;&#20123;&#21407;&#22240;&#24182;&#19981;&#26159;&#23436;&#25972;&#30340;&#25925;&#20107;&#12290;&#27605;&#31455;&#65292;&#20320;&#33021;&#24819;&#35937;&#22914;&#26524;&#27809;&#26377;&#20154;&#27427;&#36175;&#20182;&#30340;&#24037;&#20316;&#25110;&#20542;&#21548;&#20182;&#30340;&#35752;&#35770;&#65292;&#36825;&#20010;&#24535;&#24895;&#32773;&#36824;&#20250;&#21574;&#22312;&#36825;&#20010;&#39033;&#30446;&#21527;&#65311;&#24403;&#28982;&#19981;&#20250;&#12290;&#24456;&#26126;&#26174;&#65292;&#20154;&#20204;&#22312;&#33258;&#30001;&#36719;&#20214;&#19978;&#33457;&#36153;&#26102;&#38388;&#30340;&#21407;&#22240;&#19981;&#20165;&#20165;&#26159;&#21333;&#32431;&#30340;&#23545;&#29983;&#20135;&#33391;&#22909;&#20195;&#30721;&#30340;&#28212;&#26395;&#12290;&#29702;&#35299;&#24535;&#24895;&#32773;&#30340;&#30495;&#23454;&#21160;&#26426;&#23558;&#20250;&#24110;&#21161;&#20320;&#33021;&#22815;&#21512;&#29702;&#30340;&#23433;&#25490;&#65292;&#20197;&#30830;&#20445;&#21560;&#24341;&#21644;&#20445;&#25345;&#20182;&#20204;&#12290;&#23545;&#29983;&#20135;&#20248;&#31168;&#36719;&#20214;&#30340;&#28212;&#26395;&#12289;&#22312;&#22797;&#26434;&#38382;&#39064;&#19978;&#33719;&#21462;&#30340;&#25361;&#25112;&#21644;&#23398;&#20064;&#20215;&#20540;&#20063;&#35768;&#37117;&#26159;&#21160;&#26426;&#12290;&#20294;&#26159;&#20154;&#20204;&#26377;&#19982;&#20854;&#20182;&#20154;&#19968;&#36215;&#24037;&#20316;&#30340;&#20869;&#22312;&#26399;&#26395;&#65292;&#24182;&#22312;&#21512;&#20316;&#27963;&#21160;&#20013;&#25552;&#20379;&#21644;&#33719;&#21462;&#23562;&#37325;&#12290;&#20174;&#20107;&#21512;&#20316;&#27963;&#21160;&#30340;&#22242;&#38431;&#24517;&#39035;&#36827;&#21270;&#20986;&#34892;&#20026;&#30340;&#26631;&#20934;&#65292;&#33021;&#22815;&#36890;&#36807;&#24110;&#21161;&#22242;&#38431;&#30340;&#27963;&#21160;&#33719;&#21462;&#24182;&#20445;&#25345;&#37027;&#31181;&#22320;&#20301;&#12290;</p><p>&#36825;&#20123;&#26631;&#20934;&#24182;&#19981;&#24635;&#33021;&#33258;&#24049;&#20986;&#29616;&#12290;&#20363;&#22914;&#65292;&#22312;&#19968;&#20123;&#39033;&#30446;&#20013;&#8212;&#36164;&#28145;&#30340;&#24320;&#28304;&#24320;&#21457;&#32773;&#21487;&#20197;&#20174;&#39030;&#32423;&#20154;&#21592;&#20013;&#21435;&#38500;&#20960;&#20010;&#20154;&#8212;&#20154;&#20204;&#26126;&#30830;&#30340;&#24863;&#35273;&#21040;&#26159;&#36890;&#36807;&#39057;&#32321;&#24182;&#35814;&#32454;&#30340;&#21457;&#24067;&#21462;&#24471;&#30340;&#36825;&#31181;&#22320;&#20301;&#12290;&#20182;&#20204;&#24182;&#19981;&#26159;&#20598;&#28982;&#24471;&#21040;&#36825;&#20010;&#32467;&#35770;&#65307;&#36825;&#26159;&#22240;&#20026;&#20182;&#20204;&#26366;&#32463;&#22240;&#36827;&#34892;&#38271;&#26102;&#38388;&#30340;&#65292;&#22797;&#26434;&#30340;&#36777;&#35770;&#20013;&#32780;&#24471;&#21040;&#23562;&#37325;&#30340;&#22238;&#25253;&#65292;&#21363;&#20351;&#23545;&#39033;&#30446;&#27809;&#26377;&#23454;&#38469;&#30340;&#24110;&#21161;&#12290;&#19979;&#38754;&#26159;&#19968;&#20123;&#21019;&#24314;&#27675;&#22260;&#30340;&#25216;&#26415;&#65292;&#21487;&#20197;&#35753;&#33719;&#21462;&#22320;&#20301;&#30340;&#27963;&#21160;&#19982;&#24314;&#35774;&#24615;&#27963;&#21160;&#19968;&#33268;&#36215;&#26469;&#12290;</p><div class="sect2" title="&#22996;&#27966;"><div class="titlepage"><div><div><h3 class="title"><a name="delegation"></a>&#22996;&#27966;</h3></div></div></div><p>&#22996;&#27966;&#24182;&#19981;&#20165;&#20165;&#26159;&#23558;&#24037;&#20316;&#20998;&#25955;&#30340;&#26041;&#27861;&#65307;&#23427;&#20063;&#26159;&#25919;&#27835;&#21644;&#31038;&#20250;&#24037;&#20855;&#12290;&#32771;&#34385;&#20320;&#35201;&#27714;&#26576;&#20154;&#20570;&#20160;&#20040;&#20107;&#24773;&#30340;&#25152;&#26377;&#25928;&#24212;&#12290;&#26368;&#26126;&#26174;&#30340;&#25928;&#24212;&#26159;&#22914;&#26524;&#20182;&#25509;&#21463;&#65292;&#23601;&#26159;&#20182;&#23436;&#25104;&#20219;&#21153;&#19981;&#26159;&#20320;&#12290;&#20294;&#26159;&#21478;&#19968;&#20010;&#25928;&#24212;&#21017;&#26159;&#20182;&#24847;&#35782;&#21040;&#20320;&#20449;&#20219;&#20182;&#33021;&#22815;&#22788;&#29702;&#36825;&#20010;&#20219;&#21153;&#12290;&#27492;&#22806;&#65292;&#22914;&#26524;&#20320;&#26159;&#22312;&#20844;&#20849;&#35770;&#22363;&#21457;&#36215;&#36825;&#26679;&#30340;&#35831;&#27714;&#65292;&#37027;&#20040;&#20182;&#20063;&#30693;&#36947;&#22242;&#38431;&#20013;&#30340;&#20854;&#20182;&#20154;&#20063;&#34920;&#26126;&#20102;&#23545;&#20182;&#30340;&#20449;&#20219;&#12290;&#20182;&#20063;&#33021;&#24863;&#21463;&#21040;&#38656;&#35201;&#25509;&#21463;&#19968;&#20123;&#21387;&#21147;&#65292;&#36825;&#24847;&#21619;&#30528;&#20320;&#35810;&#38382;&#26102;&#35201;&#20351;&#29992;&#19968;&#31181;&#20801;&#35768;&#20182;&#25298;&#32477;&#30340;&#26041;&#24335;&#65292;&#22914;&#26524;&#20182;&#30830;&#23454;&#19981;&#24819;&#20570;&#36825;&#20010;&#24037;&#20316;&#30340;&#35805;&#12290;&#22914;&#26524;&#36825;&#20010;&#20219;&#21153;&#38656;&#35201;&#22312;&#39033;&#30446;&#20013;&#21327;&#35843;&#65292;&#20320;&#36825;&#26679;&#20570;&#21487;&#20197;&#26377;&#25928;&#30340;&#25552;&#35758;&#20182;&#26356;&#28145;&#20837;&#30340;&#21442;&#19982;&#36827;&#26469;&#65292;&#24418;&#25104;&#20854;&#20182;&#26041;&#24335;&#26080;&#27861;&#24418;&#25104;&#30340;&#22865;&#32422;&#65292;&#32780;&#19988;&#20063;&#26377;&#21487;&#33021;&#25104;&#20026;&#39033;&#30446;&#26576;&#20010;&#23376;&#39046;&#22495;&#26435;&#23041;&#30340;&#36215;&#28304;&#12290;&#22686;&#21152;&#30340;&#21442;&#19982;&#25110;&#35768;&#20196;&#20154;&#30031;&#24807;&#65292;&#20063;&#25110;&#32773;&#20250;&#23548;&#33268;&#20182;&#20197;&#20854;&#20182;&#26041;&#24335;&#21442;&#19982;&#36827;&#26469;&#65292;&#20363;&#22914;&#23545;&#20110;&#25972;&#20307;&#25215;&#35834;&#30340;&#26356;&#22810;&#24863;&#35273;&#12290;</p><p>&#22240;&#20026;&#25152;&#26377;&#36825;&#20123;&#25928;&#24212;&#65292;&#25152;&#20197;&#21363;&#20351;&#20320;&#35748;&#20026;&#20320;&#21487;&#20197;&#23436;&#25104;&#30340;&#26356;&#22909;&#26356;&#24555;&#65292;&#35753;&#20854;&#20182;&#20154;&#26469;&#23436;&#25104;&#20063;&#24456;&#26377;&#24847;&#20041;&#12290;&#24403;&#28982;&#65292;&#20063;&#26377;&#19968;&#20010;&#20005;&#35880;&#30340;&#32463;&#27982;&#23398;&#25928;&#29575;&#20316;&#20026;&#35770;&#25454;&#65306;&#25110;&#35768;&#20320;&#33258;&#24049;&#23436;&#25104;&#30340;&#26426;&#20250;&#25104;&#26412;&#22826;&#39640;&#8212;&#22312;&#21516;&#19968;&#26102;&#38388;&#37324;&#20320;&#21487;&#20197;&#23436;&#25104;&#35768;&#22810;&#26356;&#37325;&#35201;&#30340;&#20107;&#24773;&#12290;&#20294;&#21363;&#20351;&#26426;&#20250;&#25104;&#26412;&#30340;&#35770;&#25454;&#24182;&#19981;&#36866;&#24212;&#65292;&#20320;<span class="emphasis"><em>&#36824;&#26159;</em></span>&#20250;&#24076;&#26395;&#20854;&#20182;&#20154;&#23436;&#25104;&#36825;&#20010;&#20219;&#21153;&#65292;&#22240;&#20026;&#20174;&#38271;&#26399;&#26469;&#30475;&#20320;&#24076;&#26395;&#20154;&#20204;&#26356;&#28145;&#20837;&#30340;&#21442;&#19982;&#21040;&#39033;&#30446;&#24403;&#20013;&#65292;&#21363;&#20351;&#19968;&#24320;&#22987;&#38656;&#35201;&#33457;&#36153;&#26356;&#22810;&#30340;&#26102;&#38388;&#20851;&#27880;&#20182;&#20204;&#12290;&#30456;&#21453;&#30340;&#25216;&#26415;&#20063;&#36866;&#24212;&#65306;&#22914;&#26524;&#20320;&#20598;&#28982;&#24535;&#24895;&#23436;&#25104;&#20854;&#20182;&#20154;&#19981;&#21916;&#27426;&#25110;&#27809;&#26102;&#38388;&#23436;&#25104;&#30340;&#24037;&#20316;&#65292;&#20320;&#20250;&#24471;&#21040;&#20182;&#30340;&#21451;&#22909;&#20851;&#31995;&#21644;&#23562;&#25964;&#12290;&#22996;&#27966;&#21644;&#20195;&#29702;&#24182;&#19981;&#20165;&#20165;&#26159;&#35201;&#23436;&#25104;&#21333;&#20010;&#20219;&#21153;&#65307;&#20182;&#20204;&#20063;&#26159;&#23558;&#20154;&#20204;&#24341;&#20837;&#21040;&#39033;&#30446;&#26680;&#24515;&#30340;&#26041;&#27861;&#12290;</p><div class="sect3" title="&#26126;&#30830;&#21306;&#20998;&#35843;&#26597;&#21644;&#25351;&#27966;"><div class="titlepage"><div><div><h4 class="title"><a name="delegation-assignment"></a>&#26126;&#30830;&#21306;&#20998;&#35843;&#26597;&#21644;&#25351;&#27966;</h4></div></div></div><p>&#26377;&#26102;&#21487;&#20197;&#24456;&#26126;&#30830;&#30340;&#26399;&#24453;&#26576;&#20154;&#20250;&#25509;&#21463;&#29305;&#23450;&#30340;&#20219;&#21153;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#26576;&#20154;&#32534;&#20889;&#30340;&#20195;&#30721;&#24102;&#26469;&#20102;bug&#65292;&#25110;&#32773;&#25552;&#20132;&#30340;&#20195;&#30721;&#26126;&#26174;&#26410;&#33021;&#31526;&#21512;&#39033;&#30446;&#30340;&#25351;&#23548;&#26041;&#38024;&#65292;&#37027;&#20040;&#30452;&#25509;&#25351;&#20986;&#38382;&#39064;&#65292;&#37027;&#20040;&#20043;&#21518;&#20320;&#21487;&#20197;&#35748;&#20026;&#20182;&#20250;&#23567;&#24515;&#36991;&#20813;&#27492;&#31867;&#38382;&#39064;&#12290;&#20294;&#26159;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#65292;&#27809;&#26377;&#26126;&#30830;&#30340;&#26041;&#27861;&#21487;&#20197;&#30830;&#20445;&#20320;&#33719;&#24471;&#26399;&#26395;&#30340;&#34892;&#21160;&#12290;&#36825;&#20010;&#20154;&#21487;&#20197;&#21548;&#20320;&#30340;&#65292;&#20063;&#21487;&#20197;&#19981;&#21548;&#12290;&#22240;&#20026;&#27809;&#26377;&#20154;&#21916;&#27426;&#34987;&#29087;&#35270;&#26080;&#30585;&#65292;&#20320;&#38656;&#35201;&#25935;&#24863;&#30340;&#23519;&#35273;&#21040;&#36825;&#20004;&#31181;&#24773;&#24418;&#30340;&#21306;&#21035;&#65292;&#24182;&#20197;&#27492;&#20026;&#20381;&#25454;&#35843;&#25972;&#20320;&#30340;&#35831;&#27714;&#12290;</p><p>&#20320;&#35753;&#26576;&#20154;&#20570;&#26576;&#20107;&#65292;&#22914;&#26524;&#20320;&#37319;&#29992;&#30340;&#26041;&#24335;&#35753;&#20154;&#24863;&#35273;&#36825;&#26159;&#20182;&#29702;&#25152;&#24403;&#28982;&#30340;&#36131;&#20219;&#65292;&#32780;&#23454;&#38469;&#19978;&#20182;&#24182;&#19981;&#26159;&#36825;&#20040;&#24819;&#30340;&#26102;&#65292;&#20960;&#20046;&#19968;&#23450;&#20250;&#31435;&#21051;&#35753;&#20182;&#20204;&#24863;&#21040;&#38750;&#24120;&#30340;&#21388;&#24694;&#12290;&#20363;&#22914;&#65292;&#20998;&#37197;&#30340;&#38382;&#39064;&#21487;&#33021;&#20250;&#24102;&#26469;&#24456;&#22810;&#35752;&#21388;&#30340;&#20107;&#12290;&#39033;&#30446;&#30340;&#21442;&#19982;&#32773;&#36890;&#24120;&#30693;&#36947;&#35841;&#26159;&#26576;&#20010;&#39046;&#22495;&#30340;&#19987;&#23478;&#65292;&#25152;&#20197;&#24403;&#20986;&#29616;&#20102;bug&#25253;&#21578;&#65292;&#36890;&#24120;&#20250;&#26377;&#22823;&#23478;&#37117;&#30693;&#36947;&#30340;&#19968;&#20004;&#20010;&#20154;&#21487;&#20197;&#31435;&#21051;&#24555;&#36895;&#30340;&#20462;&#27491;&#23427;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#20320;&#27809;&#26377;&#24471;&#21040;&#20808;&#21069;&#30340;&#35768;&#21487;&#23601;&#23558;&#38382;&#39064;&#20998;&#37197;&#32473;&#22905;&#65292;&#22905;&#20250;&#24863;&#35273;&#33258;&#24049;&#22788;&#20110;&#19968;&#20010;&#19981;&#33298;&#26381;&#30340;&#22320;&#20301;&#12290;&#22905;&#20250;&#24863;&#21463;&#21040;&#36825;&#31181;&#34987;&#26399;&#26395;&#30340;&#21387;&#21147;&#65292;&#32780;&#19988;&#24863;&#35273;&#22905;&#26159;&#30001;&#20110;&#20854;&#19987;&#19994;&#25216;&#33021;&#32780;&#34987;&#24809;&#32602;&#20102;&#12290;&#27605;&#31455;&#65292;&#33719;&#21462;&#25216;&#33021;&#30340;&#26041;&#27861;&#23601;&#26159;&#36890;&#36807;&#20462;&#27491;bug&#65292;&#25152;&#20197;&#26576;&#20154;&#20250;&#25509;&#21463;&#36825;&#20010;&#38382;&#39064;&#65281;&#65288;&#35831;&#27880;&#24847;&#65292;&#22312;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#20013;&#26681;&#25454;bug&#25253;&#21578;&#30340;&#20449;&#24687;&#33258;&#21160;&#20998;&#37197;&#30340;&#38382;&#39064;&#36890;&#24120;&#24182;&#19981;&#22826;&#20882;&#29359;&#65292;&#22240;&#20026;&#27599;&#20010;&#20154;&#30693;&#36947;&#20998;&#37197;&#26159;&#33258;&#21160;&#30340;&#36807;&#31243;&#65292;&#24182;&#19981;&#20195;&#34920;&#20154;&#20204;&#30340;&#39044;&#26399;&#12290;&#65289;</p><p>&#34429;&#28982;&#24212;&#35813;&#23613;&#21487;&#33021;&#23558;&#36127;&#25285;&#22343;&#21248;&#30340;&#20998;&#37197;&#65292;&#20294;&#26377;&#26102;&#20320;&#38656;&#35201;&#40723;&#21169;&#33021;&#22815;&#20197;&#26368;&#24555;&#36895;&#24230;&#20462;&#27491;bug&#30340; &#20154;&#12290;&#32771;&#34385;&#21040;&#20320;&#21487;&#33021;&#26080;&#27861;&#25215;&#21463;&#20026;&#27599;&#20010;&#36825;&#31181;&#20998;&#37197;&#36827;&#34892;&#36825;&#31181;&#20132;&#27969;&#30340;&#36127;&#25285;&#65288;&#8220;&#20320;&#24895;&#24847;&#30475;&#19968;&#19979;&#36825;&#20010;bug&#21527;&#65311;&#8221; &#8220;&#21487;&#20197;&#12290;&#8221; &#8220;&#22909;&#30340;&#65292;&#19968;&#20250;&#20799;&#21543;&#36825;&#20010;&#38382;&#39064;&#20998;&#37197;&#32473;&#20320;&#12290;&#8221; &#8220;&#22909;&#30340;&#12290;&#8221;&#65289;&#65292;&#20320;&#24212;&#24403;&#20197;&#35810;&#38382;&#30340;&#24418;&#24335;&#36827;&#34892;&#20998;&#37197;&#65292;&#19981;&#35201;&#20256;&#36882;&#20986;&#20219;&#20309;&#21387;&#21147;&#12290;&#20107;&#23454;&#19978;&#25152;&#26377;&#30340;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#37117;&#20801;&#35768;&#20026;&#20219;&#21153;&#20998;&#37197;&#30340;&#38382;&#39064;&#20316;&#20986;&#35780;&#35770;&#12290;&#22312;&#37027;&#20010;&#35780;&#35770;&#20013;&#65292;&#20320;&#21487;&#20197;&#36825;&#26679;&#35828;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#25226;&#36825;&#20010;&#20998;&#37197;&#32473;&#20320;&#65292;jrandom&#65292;&#22240;&#20026;&#20320;&#21487;&#33021;&#26159;&#26368;&#29087;&#24713;&#36825;&#20123;&#20195;&#30721;&#30340;&#12290;&#22914;&#26524;&#27809;&#26102;&#38388;&#65292;&#23613;&#31649;&#36386;&#22238;&#26469;&#12290;&#65288;&#22914;&#26524;&#20320;&#24819;&#22312;&#20197;&#21518;&#25509;&#21463;&#36825;&#20013;&#35831;&#27714;&#65292;&#35831;&#35753;&#25105;&#20204;&#30693;&#36947;&#12290;&#65289;</p></blockquote></div><p><span class="emphasis"><em>&#35831;&#27714;</em></span>&#23436;&#25104;&#24037;&#20316;&#19982;&#26576;&#20154;<span class="emphasis"><em>&#25509;&#21463;</em></span>&#24037;&#20316;&#26377;&#26126;&#26174;&#30340;&#21306;&#21035;&#12290;&#22312;&#36825;&#37324;&#35266;&#20247;&#19981;&#20165;&#20165;&#26159;&#34987;&#20998;&#37197;&#24037;&#20316;&#30340;&#65292;&#32780;&#26159;&#25152;&#26377;&#20154;&#65306;&#25972;&#20010;&#22242;&#38431;&#21487;&#20197;&#30475;&#21040;&#34987;&#23433;&#25490;&#24037;&#20316;&#30340;&#20154;&#30340;&#19987;&#19994;&#25216;&#33021;&#24471;&#21040;&#20102;&#20844;&#24320;&#30340;&#30830;&#35748;&#65292;&#20294;&#26159;&#36825;&#20123;&#20449;&#24687;&#20063;&#26126;&#30830;&#30340;&#34920;&#26126;&#20182;&#21487;&#20197;&#33258;&#30001;&#30340;&#25509;&#21463;&#25110;&#32773;&#25298;&#32477;&#36825;&#31181;&#36131;&#20219;&#12290;</p></div><div class="sect3" title="&#25351;&#27966;&#21518;&#35201;&#32487;&#32493;&#36319;&#36394;"><div class="titlepage"><div><div><h4 class="title"><a name="delegation-followup"></a>&#25351;&#27966;&#21518;&#35201;&#32487;&#32493;&#36319;&#36394;</h4></div></div></div><p>&#24403;&#20320;&#35201;&#27714;&#26576;&#20154;&#20570;&#19968;&#20123;&#20107;&#24773;&#26102;&#65292;&#35831;&#29282;&#35760;&#25152;&#20570;&#30340;&#65292;&#24182;&#26080;&#35770;&#22914;&#20309;&#35201;&#32487;&#32493;&#36319;&#36394;&#20182;&#12290;&#22823;&#22810;&#25968;&#35831;&#27714;&#26159;&#22312;&#20844;&#20849;&#35770;&#22363;&#20013;&#20570;&#20986;&#30340;&#65292;&#24418;&#24335;&#22823;&#20307;&#19978;&#31867;&#20284;&#8220;&#20320;&#33021;&#22788;&#29702;&#19968;&#19979;X&#21527;&#65311;&#25105;&#20204;&#21482;&#26159;&#35201;&#33719;&#30693;&#65307;&#22914;&#26524;&#20320;&#19981;&#34892;&#65292;&#37027;&#20040;&#27809;&#38382;&#39064;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#30693;&#36947;&#12290; &#8221;&#19981;&#19968;&#23450;&#20250;&#24471;&#21040;&#22238;&#24212;&#12290;&#22914;&#26524;&#20320;&#24471;&#21040;&#30340;&#22238;&#24212;&#26159;&#36127;&#38754;&#30340;&#65292;&#21017;&#29615;&#36335;&#21487;&#20197;&#20851;&#38381;&#8212;&#20320;&#38656;&#35201;&#23581;&#35797;&#20854;&#20182;&#30340;&#31574;&#30053;&#26469;&#22788;&#29702;X&#12290;&#22914;&#26524;&#26377;&#27491;&#38754;&#30340;&#22238;&#24212;&#65292;&#37027;&#23601;&#38656;&#35201;&#32487;&#32493;&#20851;&#27880;&#36825;&#20010;&#38382;&#39064;&#30340;&#36827;&#23637;&#65292;&#24182;&#20026;&#21487;&#35265;&#21644;&#19981;&#21487;&#35265;&#30340;&#36827;&#23637;&#20316;&#20986;&#35780;&#35770;&#65288;&#24403;&#30693;&#36947;&#20854;&#20182;&#20154;&#20250;&#27427;&#36175;&#20182;&#30340;&#20316;&#21697;&#26102;&#65292;&#27599;&#20010;&#20154;&#37117;&#20250;&#20570;&#30340;&#26356;&#22909;&#65289;&#12290;&#22914;&#26524;&#20960;&#22825;&#20869;&#27809;&#26377;&#22238;&#24212;&#65292;&#21487;&#20197;&#20877;&#27425;&#35810;&#38382;&#65292;&#25110;&#32773;&#21457;&#34920;&#25991;&#31456;&#35828;&#26126;&#20320;&#27809;&#26377;&#24471;&#21040;&#22238;&#24212;&#65292;&#24076;&#26395;&#25214;&#20854;&#20182;&#20154;&#20570;&#36825;&#20214;&#20107;&#12290;&#25110;&#32773;&#30452;&#25509;&#33258;&#24049;&#23436;&#25104;&#65292;&#20294;&#20063;&#35201;&#35828;&#26126;&#26368;&#21021;&#30340;&#35810;&#38382;&#26410;&#33021;&#33719;&#24471;&#22238;&#24212;&#12290;</p><p>&#20844;&#24320;&#25552;&#31034;&#32570;&#20047;&#22238;&#24212;&#30340;&#30446;&#30340;&#24182;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#35201;&#32670;&#36785;&#20219;&#20309;&#20154;&#65292;&#20320;&#30340;&#35780;&#35770;&#19968;&#23450;&#19981;&#35201;&#36896;&#25104;&#36825;&#31181;&#25928;&#26524;&#12290;&#30446;&#30340;&#20165;&#20165;&#26159;&#35828;&#26126;&#20320;&#36824;&#22312;&#36319;&#36394;&#33258;&#24049;&#24449;&#27714;&#30340;&#38382;&#39064;&#65292;&#32780;&#19988;&#20320;&#24050;&#32463;&#27880;&#24847;&#21040;&#20102;&#19968;&#20123;&#21453;&#24212;&#12290;&#36825;&#26679;&#20570;&#21487;&#20197;&#22686;&#22823;&#20154;&#20204;&#22312;&#19979;&#19968;&#27425;&#35828;&#21516;&#24847;&#30340;&#26426;&#20250;&#65292;&#22240;&#20026;&#20182;&#20204;&#20250;&#30693;&#36947;&#65288;&#21363;&#20351;&#21482;&#26159;&#26080;&#24847;&#30340;&#65289;&#20320;&#20250;&#27880;&#24847;&#21040;&#20182;&#20204;&#25152;&#20570;&#30340;&#20219;&#20309;&#24037;&#20316;&#65292;&#21253;&#25324;&#35768;&#22810;&#19981;&#22826;&#36215;&#30524;&#30340;&#65292;&#20154;&#20204;&#20250;&#24573;&#30053;&#30340;&#20107;&#20214;&#12290;</p></div><div class="sect3" title="&#36890;&#30693;&#24863;&#20852;&#36259;&#30340;&#20154;"><div class="titlepage"><div><div><h4 class="title"><a name="delegation-interest"></a>&#36890;&#30693;&#24863;&#20852;&#36259;&#30340;&#20154;</h4></div></div></div><p>&#21478;&#19968;&#20214;&#21487;&#20197;&#35753;&#20154;&#20204;&#39640;&#20852;&#30340;&#20107;&#24773;&#23601;&#26159;&#36890;&#30693;&#20182;&#20204;&#25152;&#24863;&#20852;&#36259;&#30340;&#20107;&#24773;&#8212;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#20320;&#27880;&#24847;&#21040;&#24182;&#35760;&#20303;&#26576;&#20154;&#30340;&#20010;&#24615;&#26041;&#38754;&#36234;&#22810;&#65292;&#20182;&#20250;&#36234;&#35273;&#24471;&#33298;&#36866;&#65292;&#20182;&#20063;&#23601;&#36234;&#20250;&#24076;&#26395;&#21442;&#19982;&#20320;&#30340;&#22242;&#38431;&#19968;&#36215;&#24037;&#20316;&#12290;</p><p>&#20363;&#22914;&#65292;&#22312;Subversion&#39033;&#30446;&#26377;&#19968;&#20010;&#38750;&#24120;&#26377;&#26126;&#26174;&#21306;&#21035;&#30340;&#21010;&#20998;&#65292;&#26399;&#26395;&#36798;&#21040;&#20915;&#23450;&#24615;&#30340;1.0&#21457;&#24067;&#30340;&#20154;&#65292;&#21644;&#37027;&#20123;&#20027;&#35201;&#24076;&#26395;&#28155;&#21152;&#26032;&#29305;&#24615;&#65292;&#24182;&#23436;&#25104;&#24863;&#20852;&#36259;&#30340;&#38382;&#39064;&#65292;&#20294;&#23545;1.0&#24182;&#19981;&#22826;&#20851;&#24515;&#30340;&#20154;&#12290;&#20004;&#32773;&#30340;&#22320;&#20301;&#30456;&#24403;&#65307;&#20182;&#20204;&#21482;&#26159;&#19981;&#21516;&#31867;&#22411;&#30340;&#24320;&#21457;&#32773;&#65292;&#37117;&#22312;&#39033;&#30446;&#20013;&#23436;&#25104;&#20102;&#22823;&#37327;&#24037;&#20316;&#12290;&#20294;&#26159;&#24456;&#24555;&#35748;&#35782;&#21040;&#25105;&#20204;&#32477;<span class="emphasis"><em>&#19981;&#33021;</em></span>&#20551;&#35774;&#25152;&#26377;&#30340;&#20154;&#37117;&#26159;&#30001;1.0&#21457;&#24067;&#30340;&#21916;&#24742;&#25152;&#39537;&#21160;&#30340;&#12290;&#30005;&#23376;&#23186;&#20171;&#21487;&#33021;&#24456;&#26377;&#36855;&#24785;&#24615;&#65306;&#22312;&#20320;&#24863;&#35273;&#21040;&#20849;&#21516;&#30446;&#26631;&#30340;&#27675;&#22260;&#20013;&#65292;&#23454;&#38469;&#19978;&#21482;&#26159;&#20320;&#19982;&#35848;&#36807;&#35805;&#30340;&#20154;&#26377;&#20849;&#21516;&#30340;&#30446;&#26631;&#65292;&#32780;&#20854;&#20182;&#20154;&#21017;&#26377;&#23436;&#20840;&#19981;&#21516;&#30340;&#20248;&#20808;&#32423;&#12290;</p><p>&#20320;&#23545;&#20154;&#20204;&#23545;&#20110;&#39033;&#30446;&#30340;&#26399;&#26395;&#20102;&#35299;&#36234;&#22810;&#65292;&#20320;&#23601;&#36234;&#33021;&#26377;&#25928;&#21457;&#20986;&#35831;&#27714;&#12290;&#21363;&#20351;&#20165;&#20165;&#26159;&#25551;&#36848;&#19968;&#19979;&#20182;&#20204;&#25152;&#26399;&#26395;&#30446;&#26631;&#30340;&#29702;&#35299;&#65292;&#29978;&#33267;&#19981;&#24517;&#21457;&#20986;&#20219;&#20309;&#30456;&#20851;&#30340;&#35831;&#27714;&#65292;&#20063;&#38750;&#24120;&#26377;&#29992;&#65292;&#36825;&#26679;&#21487;&#20197;&#30830;&#20445;&#25152;&#26377;&#20154;&#19981;&#20165;&#20165;&#26159;&#26080;&#24046;&#21035;&#32676;&#20247;&#20013;&#30340;&#31890;&#23376;&#12290;</p></div></div><div class="sect2" title="&#36190;&#25196;&#21644;&#25209;&#35780;"><div class="titlepage"><div><div><h3 class="title"><a name="praise-and-criticism"></a>&#36190;&#25196;&#21644;&#25209;&#35780;</h3></div></div></div><p>&#36190;&#25196;&#21644;&#25209;&#35780;&#24182;&#19981;&#30683;&#30462;&#65307;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#26159;&#31867;&#20284;&#30340;&#12290;&#37117;&#26159;&#20851;&#27880;&#30340;&#24418;&#24335;&#65292;&#36234;&#26159;&#26126;&#30830;&#23601;&#36234;&#26377;&#25928;&#12290;&#20108;&#32773;&#24517;&#39035;&#22312;&#29282;&#35760;&#23454;&#22312;&#30446;&#26631;&#30340;&#24773;&#20917;&#19979;&#23454;&#26045;&#12290;&#20004;&#32773;&#37117;&#26377;&#21487;&#33021;&#22240;&#20026;&#22840;&#22823;&#32780;&#21066;&#24369;&#65306;&#36190;&#25196;&#36807;&#22810;&#25110;&#22826;&#39057;&#32321;&#20250;&#20351;&#36190;&#25196;&#36140;&#20540;&#65307;&#23545;&#25209;&#35780;&#20063;&#26159;&#21516;&#26679;&#65292;&#23613;&#31649;&#22312;&#23454;&#36341;&#20013;&#65292;&#25209;&#35780;&#36890;&#24120;&#20250;&#26377;&#21453;&#20316;&#29992;&#65292;&#22240;&#32780;&#26356;&#21152;&#19981;&#23481;&#26131;&#36140;&#20540;&#12290;</p><p>&#19968;&#20010;&#37325;&#35201;&#30340;&#25216;&#26415;&#25991;&#21270;&#29305;&#24615;&#26159;&#23558;&#35814;&#32454;&#30340;&#65292;&#19981;&#24102;&#20559;&#35265;&#30340;&#25209;&#35780;&#24403;&#20316;&#19968;&#31181;&#36190;&#25196;&#65288;&#27491;&#22914;&#22312;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="communications.html#rudeness" title="&#35782;&#21035;&#26080;&#31036;">the section called &#8220;&#35782;&#21035;&#26080;&#31036;&#8221;</a>&#20013;&#25152;&#35752;&#35770;&#30340;&#65289;&#65292;&#22240;&#20026;&#36825;&#38544;&#21547;&#20102;&#25509;&#25910;&#32773;&#30340;&#24037;&#20316;&#20540;&#24471;&#33457;&#26102;&#38388;&#21435;&#20998;&#26512;&#12290;&#28982;&#32780;&#65292;&#20004;&#31181;&#26465;&#20214;&#8212;<span class="emphasis"><em>&#35814;&#32454;&#30340;</em></span>&#21644;<span class="emphasis"><em>&#19981;&#24102;&#20559;&#35265;&#30340;</em></span>&#8212;&#24517;&#39035;&#21516;&#26102;&#28385;&#36275;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#26576;&#20154;&#23545;&#20195;&#30721;&#20570;&#20102;&#20123;&#39532;&#34382;&#30340;&#20462;&#25913;&#65292;&#22914;&#26524;&#21482;&#26159;&#35828;&#8220;&#24456;&#39532;&#34382;&#8221;&#26159;&#27627;&#26080;&#29992;&#22788;&#65288;&#32780;&#19988;&#36890;&#24120;&#26159;&#26377;&#23475;&#30340;&#65289;&#30340;&#12290;&#39532;&#34382;&#26368;&#32456;&#26159;<span class="emphasis"><em>&#20154;</em></span>&#30340;&#19968;&#31181;&#29305;&#24615;&#65292;&#32780;&#19981;&#26159;&#20316;&#21697;&#30340;&#65292;&#24212;&#35813;&#23558;&#21453;&#24212;&#38598;&#20013;&#21040;&#20316;&#21697;&#19978;&#12290;&#26356;&#26377;&#25928;&#30340;&#26041;&#27861;&#26159;&#25551;&#36848;&#21464;&#26356;&#20013;&#25152;&#26377;&#38169;&#35823;&#30340;&#22320;&#26041;&#65292;&#24039;&#22937;&#32780;&#26080;&#24694;&#24847;&#12290;&#22914;&#26524;&#36825;&#26159;&#26576;&#20154;&#36830;&#32493;&#31532;3&#65292;&#25110;&#32773;&#31532;4&#27425;&#20316;&#20986;&#30095;&#24573;&#30340;&#20462;&#25913;&#65292;&#21017;&#21487;&#20197;&#20877;&#35828;&#19968;&#27425;&#36825;&#20123;&#20107;&#8212;&#19981;&#24517;&#21457;&#24594;&#8212;&#25209;&#35780;&#30340;&#26368;&#21518;&#65292;&#35201;&#28165;&#26970;&#30340;&#35828;&#26126;&#21516;&#26679;&#30340;&#27169;&#24335;&#26089;&#24050;&#32463;&#34987;&#27880;&#24847;&#21040;&#20102;&#12290;</p><p>&#22914;&#26524;&#26576;&#20154;&#23545;&#20110;&#25209;&#35780;&#19981;&#20570;&#20219;&#20309;&#25913;&#36827;&#65292;&#35299;&#20915;&#21150;&#27861;&#19981;&#24212;&#35813;&#26159;&#26356;&#22810;&#25110;&#26356;&#24378;&#30340;&#25209;&#35780;&#12290;&#23545;&#20110;&#22242;&#38431;&#26469;&#35828;&#65292;&#35299;&#20915;&#26041;&#27861;&#26159;&#23558;&#36825;&#20010;&#20154;&#20174;&#19981;&#33021;&#32988;&#20219;&#30340;&#20301;&#32622;&#21024;&#38500;&#65292;&#24182;&#23613;&#21487;&#33021;&#20351;&#29992;&#19968;&#31181;&#19981;&#20250;&#36896;&#25104;&#24773;&#32490;&#20260;&#23475;&#30340;&#26041;&#27861;&#65307;&#35265;<a class="xref" href="transitions.html" title="&#36716;&#21270;">the section called &#8220;&#36716;&#21270;&#8221;</a><span>&#26412;&#31456;&#21518;&#38754;&#30340;</span>&#20363;&#23376;&#12290;&#20294;&#23454;&#38469;&#19978;&#65292;&#36825;&#31181;&#24773;&#20917;&#36890;&#24120;&#24456;&#23569;&#21457;&#29983;&#12290;&#22823;&#22810;&#25968;&#20154;&#21487;&#20197;&#24456;&#22909;&#30340;&#22238;&#24212;&#25209;&#35780;&#65292;&#24403;&#28982;&#25209;&#35780;&#24517;&#39035;&#35201;&#29305;&#23450;&#65292;&#35814;&#32454;&#24182;&#26377;&#26126;&#30830;&#30340;&#65288;&#21363;&#20351;&#27809;&#26377;&#35828;&#20986;&#26469;&#65289;&#25913;&#36827;&#39044;&#26399;&#12290;</p><p>&#36190;&#25196;&#19981;&#20250;&#20260;&#23475;&#20219;&#20309;&#20154;&#30340;&#24863;&#24773;&#65292;&#20294;&#24182;&#19981;&#24847;&#21619;&#30528;&#20351;&#29992;&#26102;&#21487;&#20197;&#19981;&#20687;&#25209;&#35780;&#37027;&#26679;&#23567;&#24515;&#12290;&#36190;&#25196;&#26159;&#19968;&#31181;&#24037;&#20855;&#65306;&#22312;&#20351;&#29992;&#20043;&#21069;&#65292;&#35201;&#38382;&#33258;&#24049;<span class="emphasis"><em>&#20026;&#20160;&#20040;</em></span>&#20320;&#24076;&#26395;&#20351;&#29992;&#23427;&#12290;&#20316;&#20026;&#19968;&#26465;&#25106;&#24459;&#65292;&#19981;&#24212;&#35813;&#22240;&#20026;&#20154;&#20204;&#32463;&#24120;&#20570;&#30340;&#20107;&#24773;&#65292;&#25110;&#27491;&#24120;&#30340;&#21644;&#21442;&#19982;&#21040;&#22242;&#38431;&#20013;&#24212;&#24403;&#35201;&#20570;&#30340;&#34892;&#21160;&#36190;&#25196;&#20182;&#12290;&#22914;&#26524;&#20320;&#36825;&#26679;&#20570;&#65292;&#20272;&#35745;&#23601;&#20572;&#19981;&#19979;&#26469;&#20102;&#65306;&#20320;&#22240;&#20026;&#26222;&#36890;&#30340;&#20107;&#24773;&#32780;&#36190;&#25196;<span class="emphasis"><em>&#27599;&#20010;&#20154;</em></span>&#65311;&#27605;&#31455;&#65292;&#22914;&#26524;&#20320;&#28431;&#25481;&#20102;&#26576;&#20154;&#65292;&#20182;&#20204;&#20250;&#38382;&#20026;&#20160;&#20040;&#12290;&#22914;&#26524;&#33021;&#29645;&#24796;&#20320;&#30340;&#36190;&#25196;&#21644;&#24863;&#28608;&#20250;&#26356;&#22909;&#65292;&#35201;&#38024;&#23545;&#19981;&#23547;&#24120;&#25110;&#24847;&#26009;&#20043;&#22806;&#30340;&#21162;&#21147;&#65292;&#20197;&#40723;&#21169;&#27492;&#31867;&#21162;&#21147;&#20026;&#30446;&#30340;&#12290;&#24403;&#26576;&#20010;&#21442;&#19982;&#32773;&#27704;&#20037;&#30340;&#36827;&#20837;&#20102;&#26356;&#39640;&#29983;&#20135;&#21147;&#30340;&#29366;&#24577;&#65292;&#35201;&#26681;&#25454;&#27492;&#20154;&#35843;&#25972;&#36190;&#25196;&#30340;&#38400;&#20540;&#12290;&#23545;&#26222;&#36890;&#30340;&#34892;&#20026;&#36827;&#34892;&#21453;&#22797;&#30340;&#36190;&#25196;&#20250;&#21464;&#24471;&#27627;&#26080;&#24847;&#20041;&#12290;&#30456;&#21453;&#65292;&#36825;&#20010;&#20154;&#20063;&#24212;&#35813;&#24863;&#35273;&#21040;&#33258;&#24049;&#36739;&#39640;&#30340;&#29983;&#20135;&#21147;&#27700;&#24179;&#24050;&#32463;&#26159;&#27491;&#24120;&#21644;&#33258;&#28982;&#30340;&#65292;&#21482;&#26377;&#36229;&#20986;&#36825;&#20010;&#33539;&#22260;&#30340;&#25165;&#20250;&#34987;&#29305;&#21035;&#20851;&#27880;&#12290;</p><p>&#24403;&#28982;&#65292;&#36825;&#24182;&#19981;&#26159;&#35828;&#19981;&#24212;&#35813;&#24863;&#35874;&#26576;&#20154;&#30340;&#36129;&#29486;&#12290;&#20294;&#26159;&#35831;&#29282;&#35760;&#65292;&#22914;&#26524;&#39033;&#30446;&#35774;&#32622;&#27491;&#30830;&#65292;&#36825;&#20010;&#20154;&#20570;&#30340;&#20219;&#20309;&#20107;&#24773;&#37117;&#20250;&#30475;&#21040;&#65292;&#25152;&#20197;&#36825;&#20010;&#22242;&#38431;&#20250;&#30693;&#36947;&#65288;&#36825;&#20010;&#20154;&#20063;&#20250;&#30693;&#36947;&#22242;&#38431;&#20013;&#30340;&#20854;&#20182;&#20154;&#25152;&#30693;&#36947;&#30340;&#65289;&#25152;&#26377;&#22905;&#25152;&#20570;&#30340;&#12290;&#38500;&#20102;&#30452;&#25509;&#30340;&#36190;&#25196;&#65292;&#25105;&#20204;&#20063;&#26377;&#20854;&#20182;&#30340;&#26041;&#27861;&#24863;&#35874;&#26576;&#20154;&#30340;&#24037;&#20316;&#12290;&#20320;&#20063;&#21487;&#20197;&#37319;&#29992;&#26354;&#25240;&#25112;&#26415;&#65292;&#22312;&#35752;&#35770;&#30456;&#20851;&#20027;&#39064;&#26102;&#65292;&#22905;&#24050;&#32463;&#32473;&#23450;&#39046;&#22495;&#20570;&#20102;&#35768;&#22810;&#24037;&#20316;&#65292;&#25104;&#20026;&#20102;&#39046;&#22495;&#19987;&#23478;&#65307;&#20320;&#21487;&#20197;&#20844;&#24320;&#30340;&#21521;&#22905;&#21672;&#35810;&#20195;&#30721;&#30340;&#38382;&#39064;&#65307;&#25110;&#32773;&#26356;&#26377;&#25928;&#30340;&#65292;&#20320;&#21487;&#20197;&#22823;&#24352;&#26071;&#40723;&#30340;&#36827;&#19968;&#27493;&#21033;&#29992;&#22905;&#30340;&#24037;&#20316;&#65292;&#36825;&#26679;&#22905;&#23601;&#20250;&#20026;&#21035;&#20154;&#20381;&#36182;&#20110;&#22905;&#30340;&#24037;&#20316;&#32467;&#26524;&#32780;&#24863;&#21040;&#33298;&#26381;&#12290;&#36890;&#24120;&#19981;&#24517;&#22312;&#36825;&#20123;&#38382;&#39064;&#19978;&#31934;&#25171;&#32454;&#31639;&#12290;&#37027;&#20123;&#26377;&#35268;&#24459;&#30340;&#20026;&#39033;&#30446;&#20316;&#20986;&#36129;&#29486;&#30340;&#20154;&#30693;&#36947;&#33258;&#24049;&#20250;&#33258;&#28982;&#30340;&#24471;&#21040;&#26377;&#24433;&#21709;&#30340;&#22320;&#20301;&#12290;&#36890;&#24120;&#27809;&#26377;&#24517;&#35201;&#20026;&#27492;&#37319;&#21462;&#26126;&#30830;&#30340;&#27493;&#39588;&#65292;&#38500;&#38750;&#20320;&#24863;&#35273;&#21040;&#26080;&#35770;&#20986;&#20110;&#20160;&#20040;&#21407;&#22240;&#65292;&#36129;&#29486;&#32773;&#37117;&#26080;&#27861;&#24471;&#21040;&#27491;&#30830;&#30340;&#35780;&#20215;&#26102;&#12290;</p></div><div class="sect2" title="&#38450;&#27490;&#21106;&#25454;"><div class="titlepage"><div><div><h3 class="title"><a name="territoriality"></a>&#38450;&#27490;&#21106;&#25454;</h3></div></div></div><p>&#35831;&#30041;&#24847;&#37027;&#20123;&#35797;&#22270;&#22312;&#39033;&#30446;&#20013;&#29420;&#21344;&#26576;&#19968;&#39046;&#22495;&#65292;&#25110;&#24076;&#26395;&#23436;&#25104;&#26576;&#19968;&#39046;&#22495;&#25152;&#26377;&#24037;&#20316;&#30340;&#21442;&#19982;&#32773;&#12290;&#27492;&#31867;&#34892;&#20026;&#24050;&#24320;&#22987;&#30475;&#36215;&#26469;&#24456;&#20581;&#24247;&#12290;&#27605;&#31455;&#65292;&#22312;&#34920;&#38754;&#19978;&#20284;&#20046;&#26159;&#26576;&#20154;&#22312;&#32937;&#36127;&#26356;&#22810;&#30340;&#36131;&#20219;&#65292;&#24182;&#23637;&#31034;&#22312;&#29305;&#23450;&#39046;&#22495;&#22686;&#38271;&#30340;&#27963;&#21160;&#12290;&#20294;&#20174;&#38271;&#26399;&#26469;&#30475;&#65292;&#21017;&#24182;&#27809;&#26377;&#24314;&#35774;&#24615;&#12290;&#24403;&#20154;&#20204;&#24863;&#35273;&#21040;&#8220;&#31105;&#27490;&#20837;&#20869;&#8221;&#30340;&#26631;&#24535;&#26102;&#65292;&#20182;&#20204;&#23601;&#20250;&#31163;&#24320;&#12290;&#36825;&#31181;&#32467;&#26524;&#20250;&#20943;&#23569;&#36825;&#20010;&#39046;&#22495;&#30340;&#26816;&#26597;&#65292;&#20250;&#20351;&#20043;&#26356;&#21152;&#33030;&#24369;&#65292;&#22240;&#20026;&#23396;&#21333;&#30340;&#24320;&#21457;&#32773;&#25104;&#20026;&#22833;&#36133;&#30340;&#21333;&#29420;&#19968;&#28857;&#12290;&#26356;&#20005;&#37325;&#30340;&#65292;&#23427;&#20250;&#21066;&#24369;&#39033;&#30446;&#30340;&#21512;&#20316;&#65292;&#24179;&#31561;&#31934;&#31070;&#12290;&#29702;&#35770;&#19978;&#24212;&#35813;&#27426;&#36814;&#20219;&#20309;&#24320;&#21457;&#32773;&#22312;&#20219;&#20309;&#26102;&#38388;&#24110;&#21161;&#23436;&#25104;&#20219;&#20309;&#20219;&#21153;&#12290;&#24403;&#28982;&#65292;&#22312;&#23454;&#36341;&#20013;&#20250;&#26377;&#20123;&#19981;&#21516;&#65306;&#20154;&#20204;&#22312;&#19981;&#21516;&#39046;&#22495;&#30340;&#24433;&#21709;&#24635;&#26377;&#24046;&#21035;&#65292;&#38750;&#19987;&#23478;&#36890;&#24120;&#19982;&#39033;&#30446;&#29305;&#23450;&#39046;&#22495;&#30340;&#19987;&#23478;&#19981;&#21516;&#12290;&#20294;&#20851;&#38190;&#26159;&#36825;&#37117;&#26159;&#33258;&#24895;&#30340;&#65306;&#38750;&#27491;&#24335;&#30340;&#26435;&#23041;&#26159;&#26681;&#25454;&#31454;&#20105;&#24615;&#21644;&#35777;&#26126;&#30340;&#21028;&#26029;&#33021;&#21147;&#36171;&#20104;&#30340;&#65292;&#32780;&#19981;&#21487;&#20197;&#20027;&#21160;&#30340;<span class="emphasis"><em>&#33719;&#21462;&#21040;</em></span>&#12290;&#21363;&#20351;&#26576;&#20154;&#26399;&#26395;&#30340;&#26435;&#23041;&#26159;&#33021;&#22815;&#32988;&#20219;&#30340;&#65292;&#20173;&#28982;&#38656;&#35201;&#22905;&#38750;&#27491;&#24335;&#30340;&#20445;&#25345;&#26435;&#23041;&#65292;&#36890;&#36807;&#22242;&#38431;&#30340;&#20849;&#35782;&#21644;&#37027;&#31181;&#27704;&#36828;&#19981;&#20250;&#23558;&#20854;&#20182;&#20154;&#25490;&#38500;&#22312;&#35813;&#39046;&#22495;&#20043;&#22806;&#30340;&#26435;&#23041;&#12290;</p><p>&#24403;&#28982;&#65292;&#22240;&#20026;&#25216;&#26415;&#21407;&#22240;&#21453;&#23545;&#25110;&#32534;&#36753;&#26576;&#20154;&#30340;&#24037;&#20316;&#21017;&#26159;&#23436;&#20840;&#21478;&#22806;&#19968;&#22238;&#20107;&#12290;&#20915;&#31574;&#22240;&#32032;&#26159;&#24037;&#20316;&#30340;&#20869;&#23481;&#65292;&#32780;&#19981;&#24212;&#35813;&#26159;&#35841;&#24688;&#22909;&#26159;&#23432;&#38376;&#20154;&#12290;&#20063;&#35768;&#20063;&#26159;&#21516;&#19968;&#20010;&#20154;&#23436;&#25104;&#24688;&#22909;&#23436;&#25104;&#20102;&#26368;&#22810;&#30340;&#24037;&#20316;&#65292;&#20294;&#21482;&#35201;&#20182;&#27809;&#26377;&#38459;&#27490;&#20854;&#20182;&#20154;&#23436;&#25104;&#36825;&#20010;&#24037;&#20316;&#65292;&#23601;&#27809;&#26377;&#38382;&#39064;&#12290;</p><p>&#20026;&#20102;&#23545;&#25239;&#22320;&#26041;&#20027;&#20041;&#30340;&#33804;&#33469;&#65292;&#35768;&#22810;&#39033;&#30446;&#37319;&#29992;&#31105;&#27490;&#22312;&#28304;&#20195;&#30721;&#25991;&#20214;&#20013;&#21253;&#21547;&#20316;&#32773;&#21517;&#25110;&#32500;&#25252;&#32773;&#31614;&#21517;&#30340;&#26041;&#27861;&#12290;&#25105;&#23436;&#20840;&#35748;&#21487;&#36825;&#31181;&#23454;&#36341;&#65306;&#25105;&#20204;&#22312;Subversion&#39033;&#30446;&#20013;&#20063;&#36981;&#24490;&#36825;&#20010;&#26041;&#27861;&#65292;&#36825;&#20063;&#31639;&#26159;Apache&#22522;&#37329;&#20250;&#30340;&#19968;&#31181;&#27491;&#24335;&#25919;&#31574;&#12290;ASF&#25104;&#21592;Sander Striker&#26159;&#36825;&#26679;&#20570;&#30340;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#22312;Apache&#36719;&#20214;&#22522;&#37329;&#20250;&#20013;&#25105;&#20204;&#19981;&#40723;&#21169;&#22312;&#28304;&#20195;&#30721;&#20013;&#20351;&#29992;&#20316;&#32773;&#26631;&#31614;&#12290;&#38500;&#20102;&#27861;&#24459;&#20998;&#27495;&#20197;&#22806;&#65292;&#36824;&#26377;&#22810;&#26041;&#38754;&#30340;&#21407;&#22240;&#12290;&#21327;&#20316;&#24320;&#21457;&#26159;&#20197;&#19968;&#20010;&#22242;&#38431;&#19968;&#36215;&#24037;&#20316;&#65292;&#23558;&#25972;&#20010;&#39033;&#30446;&#30475;&#20316;&#19968;&#20010;&#22242;&#38431;&#12290;&#32473;&#20104;&#20449;&#35465;&#38750;&#24120;&#22909;&#65292;&#24517;&#39035;&#26377;&#20154;&#36825;&#20040;&#20570;&#65292;&#20294;&#26159;&#24517;&#39035;&#20351;&#29992;&#19981;&#20250;&#20801;&#35768;&#38169;&#35823;&#24402;&#22240;&#30340;&#26041;&#24335;&#65292;&#21363;&#20351;&#26159;&#36890;&#36807;&#26263;&#31034;&#30340;&#26041;&#24335;&#12290;&#20309;&#26102;&#28155;&#21152;&#25110;&#21024;&#38500;&#20316;&#32773;&#26631;&#31614;&#27809;&#26377;&#26126;&#30830;&#30340;&#26631;&#20934;&#12290;&#22312;&#20320;&#20462;&#25913;&#27880;&#37322;&#21518;&#28155;&#21152;&#20320;&#30340;&#21517;&#23383;&#65311;&#25110;&#32773;&#26159;&#28155;&#21152;&#20102;&#19968;&#34892;&#30340;&#20462;&#27491;&#65311;&#22312;&#20320;&#37325;&#26500;&#20102;&#20195;&#30721;&#65292;&#25913;&#21464;&#20102;95%&#26102;&#23601;&#21487;&#20197;&#21024;&#38500;&#20854;&#20182;&#20316;&#32773;&#30340;&#26631;&#31614;&#65311;&#24403;&#20154;&#20204;&#21435;&#25509;&#35302;&#27599;&#19968;&#20010;&#25991;&#20214;&#65292;&#20462;&#25913;&#36275;&#22815;&#22810;&#30340;&#20869;&#23481;&#20197;&#36798;&#21040;&#21517;&#23383;&#26631;&#31614;&#30340;&#38480;&#39069;&#65292;&#36825;&#26679;&#20182;&#20204;&#30340;&#21517;&#23383;&#23601;&#20250;&#20986;&#29616;&#22312;&#27599;&#20010;&#22320;&#26041;&#26102;&#65292;&#20320;&#20250;&#24590;&#20040;&#20570;&#65311;</em></span></p><p><span class="emphasis"><em>&#25552;&#20379;&#20449;&#35465;&#21487;&#20197;&#26377;&#26356;&#22909;&#30340;&#21150;&#27861;&#65292;&#25105;&#20204;&#25512;&#33616;&#36825;&#20123;&#12290;&#20174;&#25216;&#26415;&#35266;&#28857;&#19978;&#35762;&#65292;&#20316;&#32773;&#26631;&#31614;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#65307;&#22914;&#26524;&#20320;&#24076;&#26395;&#30693;&#36947;&#21738;&#20010;&#20154;&#20889;&#20102;&#26576;&#27573;&#20195;&#30721;&#65292;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#21487;&#20197;&#25552;&#20379;&#12290;&#20316;&#32773;&#26631;&#31614;&#20063;&#32463;&#24120;&#22833;&#21435;&#26102;&#25928;&#24615;&#12290;&#20320;&#24076;&#26395;&#34987;&#31169;&#19979;&#21672;&#35810;5&#24180;&#21069;&#32534;&#20889;&#65292;&#32780;&#19988;&#24050;&#32463;&#24076;&#26395;&#36951;&#24536;&#30340;&#20195;&#30721;&#65311;</em></span></p></blockquote></div><p>&#36719;&#20214;&#39033;&#30446;&#30340;&#28304;&#20195;&#30721;&#25991;&#20214;&#26102;&#36523;&#20221;&#30340;&#26680;&#24515;&#12290;&#24517;&#39035;&#35201;&#21453;&#26144;&#25972;&#20010;&#24320;&#21457;&#31038;&#21306;&#20026;&#27492;&#36127;&#36131;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#31616;&#21333;&#30340;&#21508;&#33258;&#30340;&#23553;&#22320;&#12290;</p><p>&#20154;&#20204;&#26377;&#26102;&#20250;&#20026;&#28304;&#20195;&#30721;&#20013;&#20316;&#32773;&#25110;&#32500;&#25252;&#32773;&#26631;&#31614;&#30340;&#39118;&#26684;&#32780;&#20105;&#35770;&#65292;&#20182;&#20204;&#35748;&#20026;&#36825;&#20123;&#19996;&#35199;&#26159;&#25152;&#20570;&#24037;&#20316;&#30340;&#21487;&#35265;&#20449;&#35465;&#12290;&#36825;&#31181;&#35770;&#28857;&#26377;&#20004;&#20010;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#19981;&#21487;&#36991;&#20813;&#30340;&#35201;&#38754;&#23545;&#22810;&#23569;&#24037;&#20316;&#37327;&#25165;&#21487;&#20197;&#36827;&#20837;&#36825;&#20010;&#21015;&#34920;&#30340;&#23604;&#23596;&#38382;&#39064;&#12290;&#20854;&#27425;&#65292;&#36825;&#26679;&#20250;&#23558;&#20449;&#35465;&#30340;&#38382;&#39064;&#19982;&#26435;&#23041;&#21512;&#24182;&#20102;&#65306;&#36807;&#21435;&#26366;&#32463;&#23436;&#25104;&#20102;&#24037;&#20316;&#24182;&#19981;&#24847;&#21619;&#30528;&#23545;&#20110;&#26366;&#32463;&#24037;&#20316;&#21306;&#22495;&#30340;&#25152;&#26377;&#26435;&#65292;&#20294;&#26159;&#22914;&#26524;&#21333;&#20010;&#20154;&#30340;&#21517;&#23383;&#20986;&#29616;&#22312;&#28304;&#25991;&#20214;&#30340;&#39030;&#37096;&#65292;&#24819;&#36991;&#20813;&#36825;&#31181;&#26263;&#31034;&#23601;&#21464;&#24471;&#20960;&#20046;&#19981;&#21487;&#33021;&#12290;&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#65292;&#20449;&#35465;&#20449;&#24687;&#37117;&#21487;&#20197;&#20174;&#29256;&#26412;&#25511;&#21046;&#26085;&#24535;&#21644;&#20854;&#20182;&#35832;&#22914;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#31561;&#22806;&#24102;&#26426;&#21046;&#20013;&#33719;&#21462;&#65292;&#25152;&#20197;&#22312;&#28304;&#20195;&#30721;&#25991;&#20214;&#20013;&#31105;&#27490;&#20854;&#20986;&#29616;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#20449;&#24687;&#12290;<sup>[<a name="idp2665" href="#ftn.idp2665" class="footnote">25</a>]</sup></p><p>&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#31105;&#27490;&#22312;&#28304;&#20195;&#30721;&#25991;&#20214;&#20013;&#21253;&#21547;&#22995;&#21517;&#65292;&#35831;&#21153;&#24517;&#19981;&#35201;&#36807;&#20998;&#25191;&#30528;&#12290;&#20363;&#22914;&#65292;&#35768;&#22810;&#39033;&#30446;&#20250;&#26377;&#19968;&#20010;&#20445;&#23384;&#23567;&#24037;&#20855;&#21644;&#36741;&#21161;&#33050;&#26412;&#30340;<code class="filename">contrib/</code>&#21306;&#22495;&#65292;&#36890;&#24120;&#30001;&#19982;&#26412;&#39033;&#30446;&#19981;&#30456;&#20851;&#30340;&#20154;&#32534;&#20889;&#12290;&#36825;&#20123;&#25991;&#20214;&#21487;&#20197;&#21253;&#21547;&#20316;&#32773;&#22995;&#21517;&#65292;&#22240;&#20026;&#20182;&#20204;&#23436;&#20840;&#19981;&#26159;&#30001;&#39033;&#30446;&#32500;&#25252;&#30340;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#36129;&#29486;&#30340;&#24037;&#20855;&#34987;&#39033;&#30446;&#30340;&#20854;&#20182;&#20154;&#20462;&#25913;&#20102;&#65292;&#26368;&#32456;&#20320;&#24076;&#26395;&#23558;&#20854;&#20174;&#23396;&#31435;&#30340;&#20301;&#32622;&#31227;&#20986;&#65292;&#22914;&#26524;&#21407;&#22987;&#20316;&#32773;&#35768;&#21487;&#65292;&#23601;&#21487;&#20197;&#21024;&#38500;&#20316;&#32773;&#21517;&#31216;&#65292;&#36825;&#26679;&#20195;&#30721;&#23601;&#20687;&#20854;&#20182;&#31038;&#21306;&#32500;&#25252;&#30340;&#36164;&#28304;&#19968;&#26679;&#20102;&#12290;&#22914;&#26524;&#20316;&#32773;&#23545;&#27492;&#26377;&#20123;&#25935;&#24863;&#65292;&#25240;&#34935;&#30340;&#26041;&#26696;&#20063;&#26159;&#21487;&#20197;&#25509;&#21463;&#30340;&#65292;&#20363;&#22914;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><pre class="programlisting">
# indexclean.py: &#20174;Scanley&#32034;&#24341;&#21024;&#38500;&#26087;&#25968;&#25454;&#12290;
#
# &#21407;&#22987;&#20316;&#32773;: K. Maru &lt;kobayashi@yetanotheremailservice.com&gt;
# &#29616;&#22312;&#32500;&#25252;&#32773;: Scanley&#39033;&#30446;&#32452;&lt;http://www.scanley.org/&gt;
#                    &#21644;K. Maru&#12290;
# 
# ...
</pre></blockquote></div><p>&#20294;&#26159;&#26368;&#22909;&#36991;&#20813;&#27492;&#31867;&#25240;&#34935;&#65292;&#22914;&#26524;&#21487;&#33021;&#65292;&#22823;&#22810;&#25968;&#20316;&#32773;&#20250;&#34987;&#35828;&#26381;&#65292;&#22240;&#20026;&#20182;&#20204;&#37117;&#20250;&#20048;&#20110;&#33258;&#24049;&#30340;&#36129;&#29486;&#26356;&#32039;&#23494;&#30340;&#25104;&#20026;&#39033;&#30446;&#30340;&#19968;&#37096;&#20998;&#12290;</p><p>&#37325;&#35201;&#30340;&#26159;&#35831;&#29282;&#35760;&#39033;&#30446;&#30340;&#26680;&#24515;&#21644;&#22806;&#22260;&#26159;&#19968;&#20010;&#36830;&#32493;&#20307;&#12290;&#39033;&#30446;&#30340;&#20027;&#35201;&#28304;&#20195;&#30721;&#25991;&#20214;&#26174;&#28982;&#26159;&#26680;&#24515;&#37096;&#20998;&#65292;&#20250;&#34987;&#35748;&#20026;&#24212;&#24403;&#26159;&#30001;&#31038;&#21306;&#32500;&#25252;&#30340;&#12290;&#22312;&#21478;&#19968;&#26041;&#38754;&#65292;&#20249;&#20276;&#24037;&#20855;&#25110;&#19968;&#20123;&#25991;&#26723;&#21017;&#21487;&#33021;&#26159;&#21333;&#29420;&#26576;&#20010;&#20154;&#30340;&#20316;&#21697;&#65292;&#22987;&#32456;&#29420;&#33258;&#32500;&#25252;&#65292;&#21363;&#20351;&#36825;&#20123;&#20316;&#21697;&#26159;&#19982;&#39033;&#30446;&#20851;&#32852;&#65292;&#29978;&#33267;&#26159;&#19982;&#39033;&#30446;&#19968;&#36215;&#20998;&#21457;&#30340;&#12290;&#27809;&#26377;&#24517;&#35201;&#24212;&#29992;&#19968;&#20010;&#36866;&#29992;&#20110;&#25152;&#26377;&#25991;&#20214;&#30340;&#35268;&#21017;&#65292;&#21482;&#35201;&#22362;&#25345;&#31038;&#21306;&#32500;&#25252;&#30340;&#36164;&#28304;&#19981;&#20801;&#35768;&#25104;&#20026;&#20010;&#20154;&#39046;&#22303;&#30340;&#21407;&#29702;&#23601;&#21487;&#20197;&#20102;&#12290;</p></div><div class="sect2" title="&#33258;&#21160;&#21270;&#29575;"><div class="titlepage"><div><div><h3 class="title"><a name="automation"></a>&#33258;&#21160;&#21270;&#29575;</h3></div></div></div><p>&#21162;&#21147;&#19981;&#35753;&#20154;&#20570;&#26426;&#22120;&#21487;&#20197;&#20570;&#30340;&#20107;&#24773;&#12290;&#20316;&#20026;&#19968;&#31181;&#32463;&#39564;&#27861;&#21017;&#65292;&#23558;&#19968;&#39033;&#24037;&#20316;&#33258;&#21160;&#21270;&#33457;&#36153;&#30340;&#24037;&#20316;&#37327;&#21363;&#20351;&#21313;&#20493;&#20110;&#25163;&#24037;&#25191;&#34892;&#20063;&#26159;&#20540;&#24471;&#30340;&#12290;&#23545;&#20110;&#38750;&#24120;&#39057;&#32321;&#25110;&#22797;&#26434;&#30340;&#20219;&#21153;&#65292;&#36825;&#20010;&#27604;&#29575;&#21487;&#20197;&#36731;&#26494;&#30340;&#36798;&#21040;20&#20493;&#25110;&#26356;&#39640;&#12290;</p><p>&#23558;&#33258;&#24049;&#24819;&#35937;&#20026;&#8220;&#39033;&#30446;&#31649;&#29702;&#21592;&#8221;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#24320;&#21457;&#32773;&#65292;&#21487;&#33021;&#26159;&#19968;&#20010;&#26377;&#25928;&#30340;&#24577;&#24230;&#12290;&#26377;&#26102;&#65292;&#21333;&#20010;&#24320;&#21457;&#32773;&#20250;&#36807;&#20110;&#27785;&#28346;&#20110;&#36739;&#24213;&#23618;&#27425;&#30340;&#24037;&#20316;&#65292;&#32780;&#26080;&#27861;&#30475;&#21040;&#20840;&#23616;&#22270;&#24182;&#24847;&#35782;&#21040;&#27599;&#20010;&#20154;&#37117;&#22312;&#25163;&#24037;&#25191;&#34892;&#33258;&#21160;&#21270;&#20219;&#21153;&#19978;&#28010;&#36153;&#20102;&#22823;&#37327;&#31934;&#21147;&#12290;&#21363;&#20351;&#37027;&#20123;&#24847;&#35782;&#21040;&#30340;&#20154;&#20063;&#21487;&#33021;&#19981;&#20250;&#33457;&#26102;&#38388;&#35299;&#20915;&#38382;&#39064;&#65306;&#22240;&#20026;&#27599;&#20010;&#20010;&#20307;&#37117;&#19981;&#20250;&#24863;&#35273;&#27492;&#31867;&#20219;&#21153;&#26159;&#19968;&#20010;&#24040;&#22823;&#30340;&#36127;&#25285;&#65292;&#27809;&#26377;&#20154;&#24050;&#32463;&#21388;&#28902;&#21040;&#35201;&#20026;&#27492;&#20570;&#20123;&#20160;&#20040;&#12290;&#20351;&#33258;&#21160;&#21270;&#22914;&#27492;&#24341;&#20154;&#27880;&#30446;&#30340;&#26159;&#27599;&#20010;&#24456;&#23567;&#30340;&#36127;&#25285;&#38656;&#35201;&#20056;&#19978;&#27599;&#20010;&#24320;&#21457;&#32773;&#25191;&#34892;&#30340;&#27425;&#25968;&#65292;&#28982;&#21518;&#36824;&#35201;&#20056;&#19978;&#24320;&#21457;&#32773;&#30340;<span class="emphasis"><em>&#25968;&#37327;</em></span>&#12290;</p><p>&#36825;&#37324;&#65292;&#25105;&#24191;&#27867;&#30340;&#20351;&#29992;&#30340;&#26415;&#35821;&#8220;&#33258;&#21160;&#21270;&#8221;&#65292;&#24182;&#19981;&#20165;&#20165;&#26159;&#37325;&#22797;&#27599;&#27425;&#21482;&#38656;&#35201;&#20462;&#25913;1&#21040;2&#20010;&#21464;&#37327;&#30340;&#21160;&#20316;&#65292;&#32780;&#19988;&#21253;&#25324;&#20219;&#20309;&#36741;&#21161;&#20154;&#20204;&#30340;&#25216;&#26415;&#22522;&#30784;&#26550;&#26500;&#12290;&#26368;&#20302;&#26631;&#20934;&#30340;&#33258;&#21160;&#21270;&#38656;&#35201;&#25353;&#29031;<a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#20013;&#25551;&#36848;&#30340;&#26041;&#24335;&#36816;&#34892;&#19968;&#20010;&#29616;&#22312;&#30340;&#39033;&#30446;&#65292;&#20294;&#26159;&#27599;&#20010;&#39033;&#30446;&#20063;&#37117;&#26377;&#33258;&#24049;&#30340;&#29305;&#27530;&#38382;&#39064;&#12290;&#20363;&#22914;&#65292;&#19968;&#32452;&#32534;&#20889;&#25991;&#26723;&#30340;&#20154;&#20250;&#24076;&#26395;&#26377;&#19968;&#20010;&#32593;&#31449;&#33021;&#22815;&#22312;&#20219;&#20309;&#26102;&#38388;&#37117;&#26174;&#31034;&#26368;&#26032;&#29256;&#26412;&#30340;&#25991;&#26723;&#12290;&#22240;&#20026;&#25991;&#26723;&#36890;&#24120;&#30001;&#22914;XML&#30340;&#26631;&#35760;&#35821;&#35328;&#32534;&#20889;&#65292;&#20250;&#26377;&#19968;&#20010;&#32534;&#35793;&#27493;&#39588;&#65292;&#36890;&#24120;&#38750;&#24120;&#22797;&#26434;&#65292;&#21253;&#25324;&#21019;&#24314;&#21487;&#26174;&#31034;&#25110;&#21487;&#19979;&#36733;&#30340;&#25991;&#26723;&#12290;&#32452;&#32455;&#36825;&#31181;&#20250;&#22312;&#27599;&#27425;&#25552;&#20132;&#26102;&#36827;&#34892;&#27492;&#31867;&#32534;&#35793;&#30340;&#32593;&#31449;&#21487;&#33021;&#20250;&#26377;&#28857;&#22797;&#26434;&#21644;&#33457;&#36153;&#26102;&#38388;&#8212;&#20294;&#26159;&#36825;&#26679;&#24456;&#20540;&#24471;&#65292;&#21363;&#20351;&#36825;&#35201;&#33457;&#36153;&#20320;&#19968;&#22825;&#25110;&#26356;&#22810;&#30340;&#26102;&#38388;&#12290;&#25317;&#26377;&#26368;&#26032;&#32593;&#39029;&#30340;&#25972;&#20307;&#25910;&#30410;&#26159;&#24040;&#22823;&#30340;&#65292;&#21363;&#20351;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#30340;&#20195;&#20215;&#20165;&#20165;&#26159;&#27599;&#20010;&#24320;&#21457;&#32773;&#38656;&#35201;&#27599;&#27425;&#22810;&#19968;&#20123;&#24456;&#23567;&#30340;&#28902;&#24700;&#12290;</p><p>&#36827;&#34892;&#36825;&#31181;&#27493;&#39588;&#19981;&#20165;&#20165;&#21487;&#20197;&#28040;&#38500;&#26102;&#38388;&#30340;&#28010;&#36153;&#65292;&#20063;&#21487;&#20197;&#30830;&#20445;&#28040;&#38500;&#22312;&#25191;&#34892;&#25163;&#24037;&#25805;&#20316;&#26102;&#27493;&#39588;&#20986;&#38169;&#65288;&#19981;&#21487;&#36991;&#20813;&#30340;&#20250;&#21457;&#29983;&#65289;&#26102;&#30340;&#30171;&#33510;&#21644;&#27822;&#20007;&#12290;&#22810;&#27493;&#30340;&#65292;&#30830;&#23450;&#30340;&#25805;&#20316;&#24688;&#22909;&#26159;&#21457;&#26126;&#35745;&#31639;&#26426;&#30340;&#30446;&#30340;&#65307;&#23558;&#20154;&#20204;&#25327;&#25937;&#20986;&#26469;&#21487;&#20197;&#20570;&#26356;&#26377;&#24847;&#20041;&#30340;&#20107;&#24773;&#12290;</p><div class="sect3" title="&#33258;&#21160;&#27979;&#35797;"><div class="titlepage"><div><div><h4 class="title"><a name="automated-testing"></a>&#33258;&#21160;&#27979;&#35797;</h4></div></div></div><p>&#33258;&#21160;&#27979;&#35797;&#23545;&#20219;&#20309;&#36719;&#20214;&#39033;&#30446;&#37117;&#26377;&#29992;&#65292;&#29305;&#21035;&#26159;&#24320;&#28304;&#36719;&#20214;&#39033;&#30446;&#65292;&#22240;&#20026;&#33258;&#21160;&#27979;&#35797;&#65288;&#29305;&#21035;&#26159;&#22238;&#24402;&#27979;&#35797;&#65289;&#21487;&#20197;&#35753;&#24320;&#21457;&#32773;&#33298;&#26381;&#30340;&#20462;&#25913;&#33258;&#24049;&#19981;&#29087;&#24713;&#30340;&#20195;&#30721;&#65292;&#22240;&#32780;&#40723;&#21169;&#20102;&#25506;&#32034;&#24615;&#30340;&#24320;&#21457;&#12290;&#22240;&#20026;&#25163;&#24037;&#26816;&#27979;&#25439;&#22351;&#26159;&#36825;&#26679;&#22256;&#38590;&#8212;&#38656;&#35201;&#20174;&#26412;&#36136;&#19978;&#29468;&#27979;&#21487;&#33021;&#25439;&#22351;&#30340;&#20107;&#24773;&#65292;&#32780;&#19988;&#24517;&#39035;&#23581;&#35797;&#22810;&#31181;&#23454;&#39564;&#35777;&#26126;&#20854;&#27809;&#26377;&#25439;&#22351;&#8212;&#36890;&#36807;&#33258;&#21160;&#21270;&#26041;&#27861;&#26816;&#27979;&#36825;&#31181;&#25439;&#22351;&#20026;&#39033;&#30446;&#33410;&#30465;&#20102;<span class="emphasis"><em>&#22823;&#37327;</em></span>&#26102;&#38388;&#12290;&#23427;&#20063;&#21487;&#20197;&#35753;&#20154;&#20204;&#21487;&#20197;&#26356;&#25918;&#26494;&#30340;&#22823;&#24133;&#24230;&#37325;&#26500;&#20195;&#30721;&#65292;&#20174;&#32780;&#23545;&#36719;&#20214;&#30340;&#38271;&#26399;&#21487;&#32500;&#25252;&#24615;&#36129;&#29486;&#33391;&#22810;&#12290;</p><div class="sidebar" title="&#22238;&#24402;&#27979;&#35797;"><a name="regression-testing"></a><div class="titlepage"><div><div><p class="title"><b>&#22238;&#24402;&#27979;&#35797;</b></p></div></div></div><p><em class="firstterm">&#22238;&#24402;&#27979;&#35797;</em>&#25351;&#30340;&#26159;&#21028;&#26029;&#24050;&#20462;&#27491;bug&#26159;&#21542;&#37325;&#26032;&#20986;&#29616;&#30340;&#27979;&#35797;&#12290;&#22238;&#24402;&#27979;&#35797;&#30340;&#30446;&#30340;&#26159;&#20943;&#23569;&#20195;&#30721;&#21464;&#26356;&#20197;&#19981;&#21487;&#39044;&#26009;&#30340;&#26041;&#24335;&#30772;&#22351;&#36719;&#20214;&#30340;&#26426;&#20250;&#12290;&#38543;&#30528;&#36719;&#20214;&#39033;&#30446;&#30340;&#22686;&#22823;&#21644;&#22797;&#26434;&#65292;&#36825;&#31181;&#19981;&#21487;&#39044;&#26009;&#30340;&#21103;&#20316;&#29992;&#20250;&#24613;&#21095;&#22686;&#38271;&#12290;&#22909;&#30340;&#35774;&#35745;&#21487;&#20197;&#20943;&#23569;&#38543;&#30528;&#21464;&#26356;&#22686;&#38271;&#24102;&#26469;&#30340;&#36825;&#31181;&#27604;&#29575;&#65292;&#20294;&#26159;&#19981;&#33021;&#23436;&#20840;&#28040;&#38500;&#36825;&#31181;&#38382;&#39064;&#12290;</p><p>&#32467;&#26524;&#23601;&#26159;&#35768;&#22810;&#39033;&#30446;&#37117;&#26377;&#20102;&#19968;&#20010;<em class="firstterm">&#27979;&#35797;&#22871;</em>&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#21487;&#20197;&#25353;&#29031;&#36807;&#21435;&#27169;&#20223;bug&#21457;&#29983;&#30340;&#26041;&#24335;&#36827;&#34892;&#35843;&#29992;&#30340;&#31243;&#24207;&#12290;&#22914;&#26524;&#27979;&#35797;&#22871;&#25104;&#21151;&#30340;&#20351;&#26576;&#20010;bug&#20986;&#29616;&#65292;&#36825;&#34987;&#31216;&#20316;<em class="firstterm">&#22238;&#24402;</em>&#65292;&#24847;&#21619;&#30528;&#26576;&#20154;&#30340;&#21464;&#26356;&#24847;&#22806;&#30340;&#23558;&#20197;&#21069;&#20462;&#27491;&#30340;bug&#21448;&#20462;&#27491;&#22238;&#26469;&#20102;&#12290;</p><p>&#35831;&#30475;<a class="ulink" href="http://en.wikipedia.org/wiki/Regression_testing" target="_top">http://en.wikipedia.org/wiki/Regression_testing</a>&#12290;</p></div><p>&#22238;&#24402;&#27979;&#35797;&#24182;&#19981;&#26159;&#19975;&#33021;&#33647;&#12290;&#39318;&#20808;&#65292;&#23427;&#38750;&#24120;&#36866;&#20110;&#25209;&#37327;&#26679;&#24335;&#30028;&#38754;&#30340;&#31243;&#24207;&#12290;&#23545;&#20110;&#20027;&#35201;&#20351;&#29992;&#22270;&#24418;&#29992;&#25143;&#30028;&#38754;&#25805;&#20316;&#30340;&#36719;&#20214;&#24456;&#38590;&#31243;&#24207;&#21270;&#39537;&#21160;&#12290;&#22238;&#24402;&#27979;&#35797;&#30340;&#21478;&#19968;&#20010;&#38382;&#39064;&#26159;&#27979;&#35797;&#22871;&#26694;&#26550;&#26412;&#36523;&#21487;&#33021;&#38750;&#24120;&#22797;&#26434;&#65292;&#33258;&#24049;&#26377;&#19968;&#23450;&#30340;&#23398;&#20064;&#26354;&#32447;&#21644;&#32500;&#25252;&#36127;&#25285;&#12290;&#20943;&#23569;&#36825;&#31181;&#22797;&#26434;&#24615;&#26159;&#20320;&#21487;&#20197;&#20570;&#30340;&#19968;&#20214;&#38750;&#24120;&#26377;&#29992;&#30340;&#20107;&#65292;&#21363;&#20351;&#36825;&#38656;&#35201;&#33457;&#36153;&#30456;&#24403;&#22810;&#30340;&#26102;&#38388;&#12290;&#23558;&#26032;&#27979;&#35797;&#28155;&#21152;&#21040;&#27979;&#35797;&#22871;&#36234;&#31616;&#21333;&#65292;&#23601;&#20250;&#26377;&#36234;&#22810;&#30340;&#24320;&#21457;&#32773;&#36825;&#26679;&#20570;&#65292;&#21457;&#24067;&#20013;&#28431;&#32593;&#30340;bug&#20063;&#23601;&#20250;&#36234;&#23569;&#12290;&#22312;&#20351;&#27979;&#35797;&#26356;&#31616;&#21333;&#19978;&#30340;&#21162;&#21147;&#23558;&#20250;&#22312;&#39033;&#30446;&#30340;&#29983;&#21629;&#21608;&#26399;&#20013;&#24471;&#21040;&#25104;&#20493;&#30340;&#22238;&#25253;&#12290;</p><p>&#35768;&#22810;&#39033;&#30446;&#26377;&#19968;&#20010;<em class="firstterm">&#8220;&#19981;&#35201;&#30772;&#22351;&#26500;&#24314;&#65281;&#8221;</em>&#30340;&#35268;&#21017;&#65292;&#24847;&#24605;&#26159;&#65306;&#19981;&#35201;&#25552;&#20132;&#20250;&#20351;&#36719;&#20214;&#19981;&#33021;&#32534;&#35793;&#25110;&#36816;&#34892;&#30340;&#21464;&#26356;&#12290;&#25104;&#20026;&#30772;&#22351;&#26500;&#24314;&#30340;&#20154;&#36890;&#24120;&#20250;&#23548;&#33268;&#28201;&#21644;&#30340;&#31384;&#36843;&#21644;&#21462;&#31505;&#12290;&#25317;&#26377;&#22238;&#24402;&#27979;&#35797;&#22871;&#30340;&#39033;&#30446;&#36890;&#24120;&#26377;&#19968;&#20010;&#25512;&#35770;&#30340;&#35268;&#21017;&#65306;&#19981;&#35201;&#25552;&#20132;&#20250;&#23548;&#33268;&#27979;&#35797;&#22833;&#36133;&#30340;&#20219;&#20309;&#21464;&#26356;&#12290;&#22914;&#26524;&#25972;&#20010;&#27979;&#35797;&#22871;&#20250;&#33258;&#21160;&#27599;&#22812;&#36816;&#34892;&#65292;&#38543;&#30528;&#32467;&#26524;&#21457;&#36865;&#21040;&#24320;&#21457;&#21015;&#34920;&#25110;&#19987;&#38376;&#30340;&#27979;&#35797;&#22871;&#21015;&#34920;&#65292;&#36825;&#31867;&#22833;&#36133;&#21487;&#20197;&#36731;&#26494;&#23450;&#20301;&#65307;&#36825;&#26159;&#33258;&#21160;&#21270;&#20215;&#20540;&#25152;&#22312;&#30340;&#21478;&#19968;&#20010;&#23454;&#20363;&#12290;</p><p>&#22823;&#22810;&#25968;&#24535;&#24895;&#24320;&#21457;&#32773;&#20250;&#24895;&#24847;&#29992;&#39069;&#22806;&#30340;&#26102;&#38388;&#32534;&#20889;&#22238;&#24402;&#27979;&#35797;&#65292;&#21482;&#35201;&#27979;&#35797;&#31995;&#32479;&#26159;&#21487;&#29702;&#35299;&#30340;&#24182;&#26131;&#20110;&#20351;&#29992;&#12290;&#21464;&#26356;&#25645;&#37197;&#27979;&#35797;&#21487;&#20197;&#29702;&#35299;&#20026;&#19968;&#31181;&#36131;&#20219;&#65292;&#20063;&#26159;&#21327;&#20316;&#30340;&#19968;&#31181;&#31616;&#21333;&#30340;&#26426;&#20250;&#65306;&#36890;&#24120;&#35201;&#30001;&#20004;&#20010;&#24320;&#21457;&#32773;&#20998;&#25285;bug&#20462;&#27491;&#30340;&#24037;&#20316;&#65292;&#20854;&#20013;&#19968;&#20010;&#32534;&#20889;&#20462;&#27491;&#26412;&#36523;&#65292;&#21478;&#22806;&#19968;&#20010;&#32534;&#20889;&#27979;&#35797;&#12290;&#21518;&#19968;&#20010;&#24320;&#21457;&#32773;&#36890;&#24120;&#35201;&#20197;&#26356;&#22810;&#30340;&#24037;&#20316;&#32467;&#26463;&#20219;&#21153;&#65292;&#22240;&#20026;&#32534;&#20889;&#27979;&#35797;&#24182;&#27809;&#26377;&#23454;&#38469;&#30340;&#20462;&#27491;&#37027;&#26679;&#35753;&#20154;&#24841;&#24742;&#65292;&#27979;&#35797;&#22871;&#19981;&#24212;&#24403;&#20351;&#27979;&#35797;&#20307;&#39564;&#36229;&#20986;&#26412;&#26469;&#24212;&#26377;&#30340;&#30171;&#33510;&#12290;</p><p>&#19968;&#20123;&#39033;&#30446;&#36208;&#30340;&#26356;&#36828;&#65292;<span class="emphasis"><em>&#27599;&#20010;</em></span>bug&#20462;&#27491;&#25110;&#26032;&#29305;&#24615;&#37117;&#35201;&#20276;&#38543;&#26032;&#30340;&#27979;&#35797;&#12290;&#36825;&#26159;&#21542;&#26159;&#20010;&#22909;&#20027;&#24847;&#21462;&#20915;&#20110;&#35768;&#22810;&#22240;&#32032;&#65306;&#36719;&#20214;&#30340;&#29305;&#24615;&#65292;&#24320;&#21457;&#22242;&#38431;&#30340;&#32452;&#25104;&#21644;&#32534;&#20889;&#26032;&#27979;&#35797;&#30340;&#38590;&#24230;&#12290;CVS&#65288;<a class="ulink" href="http://www.cvshome.org/" target="_top">http://www.cvshome.org/</a>&#65289;&#22242;&#38431;&#19968;&#30452;&#26377;&#36825;&#26679;&#19968;&#20010;&#35268;&#21017;&#12290;&#22312;&#29702;&#35770;&#19978;&#36825;&#26159;&#19968;&#20010;&#22909;&#25919;&#31574;&#65292;&#22240;&#20026;CVS&#26159;&#29256;&#26412;&#25511;&#21046;&#36719;&#20214;&#65292;&#25152;&#20197;&#38750;&#24120;&#24076;&#26395;&#35268;&#36991;&#22788;&#29702;&#25110;&#35823;&#22788;&#29702;&#29992;&#25143;&#25968;&#25454;&#21487;&#33021;&#24615;&#30340;&#39118;&#38505;&#12290;&#38382;&#39064;&#26159;&#22312;&#23454;&#36341;&#20013;CVS&#30340;&#22238;&#24402;&#27979;&#35797;&#22871;&#26159;&#19968;&#20010;&#21333;&#29420;&#30340;&#24040;&#22823;shell&#33050;&#26412;&#65288;&#22909;&#31505;&#30340;&#26159;&#21483;&#20570;<code class="filename">sanity.sh</code>&#65289;&#65292;&#38590;&#20110;&#38405;&#35835;&#65292;&#20063;&#38590;&#20110;&#20462;&#25913;&#25110;&#25193;&#23637;&#12290;&#22686;&#21152;&#26032;&#27979;&#35797;&#30340;&#38590;&#24230;&#65292;&#20197;&#21450;&#23545;&#20110;&#26032;&#22686;&#34917;&#19969;&#24517;&#39035;&#21253;&#21547;&#27979;&#35797;&#30340;&#35201;&#27714;&#65292;&#20915;&#23450;&#20102;CVS&#26377;&#25928;&#30340;&#38459;&#30861;&#20102;&#34917;&#19969;&#12290;&#24403;&#25105;&#22312;CVS&#19978;&#24037;&#20316;&#26102;&#65292;&#25105;&#35265;&#36807;&#26377;&#20154;&#30528;&#25163;&#65292;&#29978;&#33267;&#23436;&#25104;&#20102;&#19968;&#20010;CVS&#33258;&#24049;&#20195;&#30721;&#30340;&#34917;&#19969;&#65292;&#20294;&#26159;&#24403;&#34987;&#21578;&#30693;&#38656;&#35201;&#22312;<code class="filename">sanity.sh</code>&#22686;&#21152;&#26032;&#27979;&#35797;&#26102;&#21017;&#25918;&#24323;&#20102;&#12290;</p><p>&#32534;&#20889;&#26032;&#30340;&#22238;&#24402;&#27979;&#35797;&#27604;&#20462;&#27491;&#21407;&#26469;&#30340;bug&#33457;&#36153;&#26356;&#22810;&#30340;&#26102;&#38388;&#38750;&#24120;&#27491;&#24120;&#12290;&#20294;&#26159;CVS&#23558;&#36825;&#31181;&#29616;&#35937;&#21457;&#25381;&#21040;&#20102;&#26497;&#33268;&#65306;&#19968;&#20010;&#20154;&#38656;&#35201;&#33457;&#36153;&#25968;&#23567;&#26102;&#25165;&#33021;&#27491;&#30830;&#30340;&#35774;&#35745;&#33258;&#24049;&#30340;&#27979;&#35797;&#65292;&#20294;&#20173;&#28982;&#24471;&#21040;&#38169;&#35823;&#30340;&#32467;&#26524;&#65292;&#22240;&#20026;&#20462;&#25913;&#36825;&#26679;&#19968;&#20010;35000&#34892;&#30340;Bourne shell&#33050;&#26412;&#26377;&#22826;&#22810;&#19981;&#21487;&#39044;&#27979;&#30340;&#22797;&#26434;&#24773;&#20917;&#12290;&#21363;&#20351;&#26159;&#38271;&#26399;&#30340;CVS&#24320;&#21457;&#32773;&#20063;&#20250;&#20026;&#22686;&#21152;&#26032;&#27979;&#35797;&#32780;&#24863;&#21040;&#37057;&#38391;&#12290;</p><p>&#36825;&#31181;&#24773;&#20917;&#28304;&#20110;&#25105;&#20204;&#23545;&#20110;&#33258;&#21160;&#21270;&#27604;&#29575;&#32771;&#34385;&#30340;&#22833;&#36133;&#12290;&#36716;&#25442;&#21040;&#19968;&#20010;&#30495;&#27491;&#30340;&#27979;&#35797;&#26694;&#26550;&#8212;&#26080;&#35770;&#26159;&#33258;&#23450;&#20041;&#30340;&#36824;&#26159;&#25104;&#21697;&#30340;&#8212;&#37117;&#20250;&#25104;&#20026;&#19968;&#31181;&#20027;&#35201;&#30340;&#21160;&#21147;&#12290;<sup>[<a name="idp2708" href="#ftn.idp2708" class="footnote">26</a>]</sup>&#38543;&#30528;&#26102;&#38388;&#30340;&#25512;&#31227;&#65292;&#36825;&#31181;&#24573;&#35270;&#32473;&#39033;&#30446;&#24102;&#26469;&#26356;&#22810;&#30340;&#20195;&#20215;&#12290;&#26377;&#22810;&#23569;bug&#20462;&#27491;&#21644;&#26032;&#29305;&#24615;<span class="emphasis"><em>&#26410;&#33021;</em></span>&#36827;&#20837;&#29616;&#22312;&#30340;CVS&#65292;&#20165;&#20165;&#22240;&#20026;&#36825;&#23604;&#23596;&#30340;&#27979;&#35797;&#22871;&#30340;&#38459;&#30861;&#65311;&#25105;&#20204;&#19981;&#30693;&#36947;&#31934;&#30830;&#30340;&#25968;&#37327;&#65292;&#20294;&#26159;&#19968;&#23450;&#36828;&#22823;&#20110;&#24320;&#21457;&#32773;&#20026;&#20102;&#24320;&#21457;&#26032;&#27979;&#35797;&#31995;&#32479;&#65288;&#25110;&#38598;&#25104;&#19968;&#20010;&#25104;&#21697;&#30340;&#31995;&#32479;&#65289;&#32780;&#20250;&#25918;&#24323;&#30340;bug&#20462;&#27491;&#25110;&#26032;&#29305;&#24615;&#25968;&#37327;&#12290;&#36825;&#20010;&#20219;&#21153;&#21482;&#20250;&#32791;&#36153;&#26377;&#38480;&#30340;&#26102;&#38388;&#65292;&#20294;&#22914;&#26524;&#26080;&#21160;&#20110;&#34935;&#65292;&#21017;&#20351;&#29992;&#29616;&#26377;&#27979;&#35797;&#22871;&#30340;&#24809;&#32602;&#23558;&#20250;&#27704;&#36828;&#25345;&#32493;&#19979;&#21435;&#12290;</p><p>&#37325;&#28857;&#19981;&#22312;&#20110;&#24378;&#21046;&#32534;&#20889;&#27979;&#35797;&#26159;&#38169;&#35823;&#30340;&#65292;&#20063;&#19981;&#26159;&#35828;&#32534;&#20889;Bourne shell&#33050;&#26412;&#30340;&#27979;&#35797;&#31995;&#32479;&#24517;&#28982;&#26159;&#19981;&#22909;&#30340;&#12290;&#23427;&#21487;&#33021;&#24037;&#20316;&#30340;&#24456;&#22909;&#65292;&#36825;&#21462;&#20915;&#20110;&#20320;&#30340;&#35774;&#35745;&#21644;&#27979;&#35797;&#30340;&#38656;&#35201;&#12290;&#37325;&#28857;&#20165;&#20165;&#26159;&#35828;&#24403;&#27979;&#35797;&#31995;&#32479;&#25104;&#20026;&#24320;&#21457;&#30340;&#26126;&#26174;&#38556;&#30861;&#26102;&#65292;&#24517;&#39035;&#35201;&#26377;&#34892;&#21160;&#12290;&#21516;&#26679;&#30340;&#36947;&#29702;&#36866;&#29992;&#20110;&#25152;&#26377;&#25104;&#20026;&#38556;&#30861;&#25110;&#29942;&#39048;&#30340;&#24120;&#35268;&#36807;&#31243;&#12290;</p></div></div><div class="sect2" title="&#23558;&#27599;&#20010;&#29992;&#25143;&#24403;&#20316;&#28508;&#22312;&#30340;&#24535;&#24895;&#32773;"><div class="titlepage"><div><div><h3 class="title"><a name="users-to-volunteers"></a>&#23558;&#27599;&#20010;&#29992;&#25143;&#24403;&#20316;&#28508;&#22312;&#30340;&#24535;&#24895;&#32773;</h3></div></div></div><p>&#19982;&#29992;&#25143;&#30340;&#27599;&#27425;&#20132;&#27969;&#37117;&#26159;&#21457;&#23637;&#26032;&#24535;&#24895;&#32773;&#30340;&#22909;&#26426;&#20250;&#12290;&#24403;&#19968;&#20010;&#29992;&#25143;&#33457;&#26102;&#38388;&#22312;&#39033;&#30446;&#37038;&#20214;&#21015;&#34920;&#19978;&#21457;&#34920;&#25991;&#31456;&#25110;&#25253;&#21578;bug&#26102;&#65292;&#20182;&#24050;&#32463;&#35748;&#20026;&#33258;&#24049;&#27604;&#22823;&#22810;&#25968;&#29992;&#25143;&#65288;&#37027;&#20123;&#39033;&#30446;&#27704;&#36828;&#21548;&#19981;&#21040;&#22238;&#38899;&#30340;&#20154;&#65289;&#26377;&#26356;&#22823;&#21442;&#19982;&#30340;&#21487;&#33021;&#12290;&#32039;&#36319;&#36825;&#31181;&#28508;&#21147;&#65306;&#22914;&#26524;&#20182;&#25551;&#36848;&#20102;&#19968;&#20010;bug&#65292;&#24863;&#35874;&#20182;&#30340;&#25253;&#21578;&#65292;&#24182;&#35810;&#38382;&#20182;&#26159;&#21542;&#26377;&#20852;&#36259;&#33258;&#24049;&#20462;&#27491;&#23427;&#12290;&#22914;&#26524;&#20182;&#35828;FAQ&#20013;&#28431;&#25481;&#20102;&#19968;&#39033;&#37325;&#35201;&#38382;&#39064;&#65292;&#25110;&#32773;&#31243;&#24207;&#30340;&#25991;&#26723;&#26377;&#20123;&#19981;&#36275;&#65292;&#35831;&#22374;&#29575;&#30340;&#25215;&#35748;&#38382;&#39064;&#65288;&#20551;&#23450;&#30830;&#23454;&#23384;&#22312;&#65289;&#65292;&#24182;&#35810;&#38382;&#20182;&#26159;&#21542;&#26377;&#20852;&#36259;&#33258;&#24049;&#32534;&#20889;&#36951;&#22833;&#30340;&#26448;&#26009;&#12290;&#24456;&#33258;&#28982;&#65292;&#22823;&#22810;&#25968;&#26102;&#20505;&#36825;&#20010;&#29992;&#25143;&#19981;&#20250;&#21516;&#24847;&#12290;&#20294;&#26159;&#22810;&#38382;&#19968;&#21477;&#20063;&#19981;&#32047;&#65292;&#32780;&#19988;&#21482;&#35201;&#20320;&#27599;&#27425;&#37117;&#36825;&#20040;&#38382;&#65292;&#20063;&#20250;&#25552;&#37266;&#35770;&#22363;&#20013;&#30340;&#20854;&#20182;&#21548;&#20247;&#21442;&#19982;&#21040;&#39033;&#30446;&#24403;&#20013;&#26159;&#27599;&#20010;&#20154;&#37117;&#21487;&#20197;&#20570;&#30340;&#12290;</p><p>&#19981;&#35201;&#23558;&#20320;&#30340;&#30446;&#26631;&#38480;&#21046;&#22312;&#26032;&#24320;&#21457;&#32773;&#21644;&#25991;&#26723;&#32534;&#20889;&#32773;&#19978;&#12290;&#20363;&#22914;&#20174;&#38271;&#26399;&#26469;&#30475;&#65292;&#21363;&#20351;&#35757;&#32451;&#20154;&#20204;&#32534;&#20889;&#20248;&#31168;&#30340;bug&#25253;&#21578;&#20063;&#26159;&#20540;&#24471;&#30340;&#65292;&#22914;&#26524;&#20320;&#27809;&#26377;&#22312;&#27599;&#20010;&#20154;&#36523;&#19978;&#33457;&#36153;<span class="emphasis"><em>&#22826;</em></span>&#22810;&#26102;&#38388;&#65292;&#32780;&#19988;&#22914;&#26524;&#22312;&#23558;&#26469;&#32487;&#32493;&#25552;&#20132;&#26356;&#22810;&#30340;bug&#8212;&#22914;&#26524;&#31532;&#19968;&#27425;&#25253;&#21578;&#26102;&#33021;&#33719;&#24471;&#24314;&#35774;&#24615;&#30340;&#20114;&#21160;&#65292;&#20197;&#21518;&#26356;&#26377;&#21487;&#33021;&#36825;&#20040;&#20570;&#12290;&#24314;&#35774;&#24615;&#30340;&#20114;&#21160;&#19981;&#24517;&#26159;&#23545;&#20110;bug&#30340;&#20462;&#27491;&#65292;&#23613;&#31649;&#37027;&#26679;&#26159;&#29702;&#24819;&#30340;&#65307;&#23427;&#21487;&#20197;&#20165;&#20165;&#26159;&#19968;&#31181;&#35201;&#27714;&#26356;&#22810;&#20449;&#24687;&#30340;&#24691;&#35831;&#65292;&#25110;&#20165;&#20165;&#26159;&#37027;&#31181;&#34892;&#20026;<span class="emphasis"><em>&#26159;</em></span>bug&#30340;&#30830;&#35748;&#12290;&#20154;&#20204;&#24076;&#26395;&#34987;&#20542;&#21548;&#12290;&#20854;&#27425;&#65292;&#20182;&#20204;&#24076;&#26395;&#33258;&#24049;&#30340;bug&#34987;&#20462;&#27491;&#12290;&#20320;&#21487;&#33021;&#26080;&#27861;&#19968;&#30452;&#21450;&#26102;&#30340;&#32473;&#20104;&#21518;&#32773;&#65292;&#20294;&#20320;&#65288;&#25110;&#32773;&#35828;&#25972;&#20010;&#22242;&#38431;&#65289;&#21487;&#20197;&#32473;&#20182;&#20204;&#21069;&#32773;&#12290;</p><p>&#19968;&#20010;&#25512;&#35770;&#23601;&#26159;&#24320;&#21457;&#32773;&#19981;&#33021;&#21521;&#20986;&#20110;&#22909;&#24847;&#25552;&#20986;&#21547;&#31946;bug&#25253;&#21578;&#30340;&#20154;&#20204;&#34920;&#29616;&#20986;&#24868;&#24594;&#12290;&#36825;&#26159;&#25105;&#20010;&#20154;&#24456;&#27668;&#24700;&#30340;&#20107;&#24773;&#12290;&#25105;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#24320;&#28304;&#37038;&#20214;&#21015;&#34920;&#20013;&#30475;&#21040;&#35768;&#22810;&#24320;&#21457;&#32773;&#19968;&#30452;&#36825;&#26679;&#20570;&#65292;&#21361;&#23475;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#12290;&#19968;&#20123;&#20498;&#38665;&#30340;&#26032;&#25163;&#20250;&#21457;&#24067;&#26080;&#29992;&#30340;&#25253;&#21578;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#21992;&#65292;&#25105;&#27809;&#27861;&#36816;&#34892;Scanley&#12290;&#27599;&#24403;&#25105;&#21551;&#21160;&#23427;&#65292;&#23601;&#20250;&#25253;&#38169;&#12290;&#26377;&#20154;&#36935;&#21040;&#36807;&#36825;&#20010;&#38382;&#39064;&#21527;&#65311;</p></blockquote></div><p>&#19968;&#20123;&#24320;&#21457;&#32773;&#8212;&#21487;&#33021;&#24050;&#32463;&#36935;&#21040;&#27492;&#31867;&#25253;&#21578;&#20960;&#21315;&#27425;&#20102;&#65292;&#20294;&#19997;&#27627;&#19981;&#32771;&#34385;&#36825;&#20010;&#26032;&#25163;&#20174;&#26410;&#36935;&#21040;&#36807;&#8212;&#20250;&#36825;&#26679;&#22238;&#22797;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#36825;&#20040;&#28857;&#20449;&#24687;&#25105;&#20204;&#33021;&#24590;&#20040;&#20570;&#65311;&#22825;&#21584;&#12290;&#35831;&#32473;&#28857;&#32454;&#33410;&#65292;&#20363;&#22914;Scanley&#30340;&#29256;&#26412;&#12289;&#20320;&#30340;&#25805;&#20316;&#31995;&#32479;&#21644;&#38169;&#35823;&#20449;&#24687;&#12290;</p></blockquote></div><p>&#24320;&#21457;&#32773;&#26080;&#27861;&#20174;&#29992;&#25143;&#30340;&#35282;&#24230;&#30475;&#24453;&#20107;&#29289;&#65292;&#20063;&#26410;&#33021;&#32771;&#34385;&#21040;&#36825;&#31181;&#21453;&#24212;&#23545;&#20110;&#35266;&#30475;&#36825;&#31181;&#20132;&#20114;&#30340;<span class="emphasis"><em>&#20854;&#20182;</em></span>&#20154;&#30340;&#25928;&#26524;&#12290;&#24456;&#33258;&#28982;&#65292;&#23545;&#20110;&#27809;&#26377;&#32534;&#31243;&#32463;&#39564;&#30340;&#29992;&#25143;&#65292;&#20043;&#21069;&#27809;&#26377;&#25253;&#21578;bug&#30340;&#32463;&#39564;&#65292;&#24403;&#28982;&#19981;&#30693;&#36947;&#22914;&#20309;&#32534;&#20889;bug&#25253;&#21578;&#12290;&#23545;&#20110;&#36825;&#31181;&#20154;&#35813;&#24590;&#26679;&#27491;&#30830;&#22788;&#29702;&#21602;&#65311;&#25945;&#32946;&#20182;&#20204;&#65281;&#35201;&#20351;&#29992;&#20250;&#20419;&#20351;&#20182;&#20204;&#22238;&#26469;&#33719;&#21462;&#26356;&#22810;&#20449;&#24687;&#30340;&#26041;&#24335;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#24456;&#36951;&#25022;&#20320;&#36935;&#21040;&#20102;&#22256;&#38590;&#12290;&#25105;&#20204;&#38656;&#35201;&#26356;&#22810;&#20449;&#24687;&#25165;&#33021;&#25214;&#20986;&#21457;&#29983;&#30340;&#38382;&#39064;&#12290;&#35831;&#21578;&#35785;&#25105;&#20204;Scanley&#30340;&#29256;&#26412;&#65292;&#24744;&#30340;&#25805;&#20316;&#31995;&#32479;&#21644;&#38169;&#35823;&#30340;&#31934;&#30830;&#25991;&#26412;&#12290;&#26368;&#22909;&#33021;&#25552;&#20379;&#19968;&#20221;&#20320;&#25152;&#36816;&#34892;&#21629;&#20196;&#30340;&#33050;&#26412;&#65292;&#20197;&#21450;&#23545;&#24212;&#30340;&#36755;&#20986;&#12290;&#26356;&#22810;&#20449;&#24687;&#35831;&#30475;http://www.scanley.org/how_to_report_a_bug.html&#12290;</p></blockquote></div><p>&#36825;&#31181;&#20174;&#29992;&#25143;&#37027;&#37324;&#27048;&#21462;&#20449;&#24687;&#30340;&#21709;&#24212;&#26041;&#27861;&#36828;&#35848;&#19981;&#19978;&#26377;&#25928;&#29575;&#65292;&#22240;&#20026;&#23427;&#26159;&#20174;&#29992;&#25143;&#30340;&#35282;&#24230;&#32534;&#20889;&#30340;&#12290;&#39318;&#20808;&#65292;&#23427;&#23637;&#31034;&#20102;&#21516;&#24773;&#65306;<span class="emphasis"><em>&#20320;&#36935;&#21040;&#20102;&#38382;&#39064;&#65307;&#25105;&#20204;&#20063;&#24863;&#21040;&#30171;</em></span>&#12290;&#65288;&#21363;&#20351;&#22312;bug&#25253;&#21578;&#22238;&#24212;&#20013;&#20063;&#19981;&#26159;&#24517;&#39035;&#30340;&#65307;&#36825;&#21462;&#20915;&#20110;&#38382;&#39064;&#30340;&#20005;&#37325;&#31243;&#24230;&#20197;&#21450;&#24863;&#35273;&#21040;&#30340;&#29992;&#25143;&#30340;&#20260;&#24515;&#31243;&#24230;&#12290;&#65289;&#20854;&#27425;&#65292;&#27809;&#26377;&#23545;&#22905;&#19981;&#30693;&#22914;&#20309;&#25253;&#21578;bug&#34920;&#31034;&#36731;&#35270;&#65292;&#32780;&#26159;&#21578;&#35785;&#22905;&#22914;&#20309;&#65292;&#20197;&#21450;&#24590;&#26679;&#30340;&#35814;&#32454;&#31243;&#24230;&#25165;&#20250;&#23454;&#38469;&#26377;&#25928;&#8212;&#20363;&#22914;&#65292;&#35768;&#22810;&#29992;&#25143;&#24182;&#19981;&#29702;&#35299;&#8220;&#35831;&#32473;&#20123;&#32454;&#33410;&#8221;&#30340;&#24847;&#24605;&#26159;&#8220;&#23637;&#31034;&#38169;&#35823;&#30340;&#31934;&#30830;&#25991;&#26412;&#8221;&#65292;&#19981;&#35201;&#36951;&#28431;&#25110;&#21024;&#33410;&#12290;&#24403;&#20320;&#31532;&#19968;&#27425;&#19982;&#36825;&#26679;&#19968;&#20010;&#29992;&#25143;&#24037;&#20316;&#26102;&#65292;&#20320;&#38656;&#35201;&#35828;&#26126;&#36825;&#20123;&#12290;&#26368;&#21518;&#65292;&#24212;&#35813;&#25552;&#20379;&#21040;&#26356;&#21152;&#35814;&#32454;&#21644;&#23436;&#25972;&#30340;&#25253;&#21578;bug&#25351;&#23548;&#30340;&#38142;&#25509;&#12290;&#22914;&#26524;&#20320;&#25104;&#21151;&#30340;&#35753;&#29992;&#25143;&#24863;&#35273;&#22312;&#20026;&#22905;&#32771;&#34385;&#65292;&#22905;&#36890;&#24120;&#20250;&#33457;&#26102;&#38388;&#38405;&#35835;&#35813;&#25991;&#26723;&#24182;&#25353;&#29031;&#20320;&#25152;&#35828;&#30340;&#21435;&#20570;&#12290;&#24403;&#28982;&#65292;&#36825;&#36890;&#24120;&#24847;&#21619;&#30528;&#20320;&#38656;&#35201;&#39044;&#20808;&#23601;&#20934;&#22791;&#22909;&#25991;&#26723;&#12290;&#24517;&#39035;&#35828;&#28165;&#26970;&#21738;&#31181;&#31867;&#22411;&#30340;&#20449;&#24687;&#26159;&#24320;&#21457;&#22242;&#38431;&#22312;&#27599;&#20010;bug&#25253;&#21578;&#20013;&#24076;&#26395;&#30475;&#21040;&#30340;&#12290;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#38656;&#35201;&#36890;&#36807;&#22238;&#24212;&#22810;&#20010;&#36825;&#26679;&#30340;&#29992;&#25143;&#65292;&#36880;&#28176;&#30340;&#26597;&#28431;&#34917;&#32570;&#65292;&#20351;&#20043;&#26356;&#22909;&#22320;&#20026;&#39033;&#30446;&#26381;&#21153;&#12290;</p><p>Subversion&#39033;&#30446;&#30340;bug&#25253;&#21578;&#25351;&#23548;&#21487;&#20197;&#35828;&#26159;&#36825;&#31867;&#24418;&#24335;&#30340;&#26631;&#20934;&#26696;&#20363;&#65288;&#35265;<a class="xref" href="bug-reporting.html" title="Appendix D. &#25253;&#21578;bug&#30340;&#26679;&#20363;&#25351;&#23548;">Appendix D, <i>&#25253;&#21578;bug&#30340;&#26679;&#20363;&#25351;&#23548;</i></a>&#65289;&#12290;&#35831;&#27880;&#24847;&#20182;&#20204;&#26159;&#22914;&#20309;&#20197;&#35831;&#27714;&#25552;&#20379;&#19968;&#20010;bug&#30340;&#34917;&#19969;&#25110;&#20462;&#27491;&#32467;&#26463;&#30340;&#12290;&#36825;&#19981;&#26159;&#22240;&#20026;&#36825;&#31181;&#35831;&#27714;&#23558;&#20250;&#23548;&#33268;&#26356;&#39640;&#30340;&#34917;&#19969;&#12290;&#25253;&#21578;&#29575;&#8212;&#22823;&#22810;&#25968;&#33021;&#22815;&#20462;&#27491;bug&#30340;&#29992;&#25143;&#37117;&#30693;&#36947;&#22914;&#26524;&#33021;&#25552;&#20379;&#34917;&#19969;&#20250;&#21463;&#21040;&#27426;&#36814;&#65292;&#26080;&#38656;&#21578;&#30693;&#20182;&#20204;&#12290;&#35831;&#27714;&#30340;&#30495;&#23454;&#30446;&#30340;&#26159;&#20026;&#20102;&#21521;&#25152;&#26377;&#35835;&#32773;&#65292;&#29305;&#21035;&#26159;&#21018;&#26469;&#21040;&#39033;&#30446;&#65292;&#25110;&#32773;&#21018;&#26469;&#21040;&#33258;&#30001;&#36719;&#20214;&#30340;&#20154;&#24378;&#35843;&#65292;&#36825;&#20010;&#39033;&#30446;&#26159;&#36890;&#36807;&#24535;&#24895;&#32773;&#30340;&#36129;&#29486;&#36816;&#33829;&#30340;&#12290;&#36825;&#26159;&#35768;&#22810;&#26032;&#29992;&#25143;&#36890;&#24120;&#19981;&#29087;&#24713;&#30340;&#19968;&#20010;&#20851;&#38190;&#28857;&#12290;&#19968;&#26086;&#20182;&#20204;&#24847;&#35782;&#21040;&#36825;&#19968;&#28857;&#65292;&#20182;&#20204;&#23601;&#26356;&#26377;&#21487;&#33021;&#22312;&#21457;&#29983;&#26102;&#24110;&#21161;&#23436;&#25104;&#20462;&#27491;&#65292;&#21363;&#20351;&#19981;&#33021;&#25552;&#20379;&#20195;&#30721;&#65292;&#20063;&#20250;&#25552;&#20379;&#26356;&#23436;&#25972;&#30340;&#37325;&#29616;&#27493;&#39588;&#65292;&#29978;&#33267;&#26159;&#20026;&#20854;&#20182;&#20154;&#21457;&#24067;&#30340;&#20869;&#23481;&#27979;&#35797;&#20462;&#27491;&#12290;&#30446;&#26631;&#26159;&#35753;&#27599;&#20010;&#29992;&#25143;&#35748;&#35782;&#21040;&#20182;&#20204;&#21644;&#20026;&#39033;&#30446;&#24037;&#20316;&#30340;&#20154;&#27809;&#26377;<span class="emphasis"><em>&#22825;&#29983;</em></span>&#30340;&#21306;&#21035;&#8212;&#38382;&#39064;&#21482;&#26159;&#20182;&#20204;&#33021;&#25237;&#20837;&#22810;&#23569;&#26102;&#38388;&#21644;&#21147;&#37327;&#65292;&#32780;&#19981;&#22312;&#20110;&#26159;&#35841;&#12290;</p><p>&#23545;&#20110;&#24868;&#24594;&#22238;&#24212;&#30340;&#21578;&#35819;&#19981;&#33021;&#36866;&#29992;&#20110;&#31895;&#26292;&#30340;&#29992;&#25143;&#12290;&#20598;&#23572;&#20250;&#26377;&#19968;&#20123;&#20154;&#20250;&#21457;&#36865;&#27627;&#26080;&#20449;&#24687;&#37327;&#30340;bug&#25253;&#21578;&#25110;&#25237;&#35785;&#65292;&#34920;&#29616;&#23545;&#39033;&#30446;&#26576;&#20123;&#22833;&#35823;&#30340;&#34065;&#35270;&#12290;&#36890;&#24120;&#27492;&#31867;&#20154;&#20250;&#22312;&#36731;&#34065;&#19982;&#35844;&#23194;&#20043;&#38388;&#36716;&#25442;&#65292;&#20363;&#22914;Subversion&#37038;&#20214;&#21015;&#34920;&#30340;&#36825;&#20010;&#20154;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#20026;&#20160;&#20040;&#20960;&#20046;6&#22825;&#20102;&#36824;&#27809;&#26377;Windows&#24179;&#21488;&#30340;&#20108;&#36827;&#21046;&#31243;&#24207;&#65311;&#65281;&#65311;&#27599;&#27425;&#37117;&#26159;&#21516;&#26679;&#30340;&#25925;&#20107;&#65292;&#30830;&#23454;&#35753;&#20154;&#28784;&#24515;&#12290;&#20026;&#20160;&#20040;&#36825;&#31867;&#24037;&#20316;&#23601;&#19981;&#33021;&#33258;&#21160;&#21270;&#65292;&#21487;&#20197;&#31435;&#21051;&#20986;&#29616;&#12290;&#65311;&#65311;&#24403;&#20320;&#21457;&#24067;&#8220;RC&#8221;&#26500;&#24314;&#26102;&#65292;&#25105;&#24819;&#20320;&#20204;&#30340;&#24847;&#24605;&#30340;&#26159;&#35753;&#29992;&#25143;&#27979;&#35797;&#26500;&#24314;&#65292;&#20294;&#26159;&#20320;&#20204;&#27809;&#20026;&#27492;&#20107;&#20570;&#20219;&#20309;&#20107;&#12290;&#22914;&#26524;&#20320;&#20204;&#27809;&#25552;&#20379;&#27979;&#35797;&#26041;&#27861;&#65292;&#21448;&#20309;&#24517;&#25630;&#19968;&#20010;&#28024;&#28070;&#26399;&#65311;&#65311;</p></blockquote></div><p>&#23545;&#20110;&#36825;&#31181;&#28608;&#21160;&#25991;&#31456;&#30340;&#26368;&#21021;&#22238;&#24212;&#26159;&#20196;&#20154;&#21507;&#24778;&#30340;&#20811;&#21046;&#65306;&#20154;&#20204;&#25351;&#20986;&#35813;&#39033;&#30446;&#26377;&#33258;&#24049;&#30340;&#21457;&#24067;&#25919;&#31574;&#65292;&#19981;&#20250;&#25552;&#20379;&#23448;&#26041;&#30340;&#20108;&#36827;&#21046;&#25991;&#20214;&#65292;&#24182;&#21578;&#35785;&#20182;&#22914;&#26524;&#35201;&#25913;&#21464;&#24700;&#20154;&#30340;&#31243;&#24230;&#65292;&#20182;&#24212;&#35813;&#24535;&#24895;&#33258;&#24049;&#32534;&#35793;&#20195;&#30721;&#65292;&#22914;&#26524;&#30495;&#30340;&#23545;&#20182;&#24456;&#37325;&#35201;&#30340;&#35805;&#12290;&#30456;&#20449;&#19982;&#21542;&#65292;&#36825;&#27573;&#35805;&#23646;&#20110;&#20182;&#30340;&#19979;&#19968;&#27425;&#21457;&#24067;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#39318;&#20808;&#65292;&#25105;&#35201;&#35828;&#25105;&#35748;&#20026;Subversion&#24456;&#24426;&#24717;&#65292;&#24456;&#24863;&#35874;&#27599;&#20010;&#21442;&#19982;&#32773;&#30340;&#21162;&#21147;&#12290;  [...]</p></blockquote></div><p>...&#28982;&#21518;&#20182;<span class="emphasis"><em>&#20877;&#27425;</em></span>&#32487;&#32493;&#20026;&#39033;&#30446;&#27809;&#26377;&#25552;&#20379;&#20108;&#36827;&#21046;&#65292;&#29616;&#22312;&#20173;&#28982;&#27809;&#26377;&#24535;&#24895;&#32773;&#20570;&#36825;&#20214;&#20107;&#32780;&#26021;&#36131;&#39033;&#30446;&#12290;&#20043;&#21518;&#65292;&#22823;&#32422;50&#20154;&#36339;&#20102;&#20986;&#26469;&#65292;&#25105;&#24517;&#39035;&#35828;&#25105;&#30830;&#23454;&#27880;&#24847;&#21040;&#36825;&#19968;&#28857;&#20102;&#12290;&#22312;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="setting-tone.html#prevent-rudeness" title="&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;">the section called &#8220;&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;&#8221;</a>&#25552;&#20986;&#30340;&#65292;&#38024;&#23545;&#31895;&#40065;&#34892;&#20026;&#30340;&#8220;&#38646;&#23481;&#24525;&#8221;&#25919;&#31574;&#65292;&#24050;&#32463;&#28508;&#31227;&#40664;&#21270;&#30340;&#24212;&#29992;&#21040;&#27599;&#20010;&#20154;&#30340;&#20132;&#20114;&#20013;&#12290;&#20294;&#26159;&#65292;&#24403;&#20154;&#20204;&#35748;&#28165;&#20182;&#19968;&#24320;&#22987;&#23601;&#35201;&#24403;&#19968;&#20010;&#21943;&#23376;&#26102;&#65292;&#27809;&#20154;&#33021;&#32473;&#20182;&#22909;&#33080;&#33394;&#12290;</p><p>&#24456;&#24184;&#36816;&#65292;&#36825;&#20123;&#24773;&#24418;&#38750;&#24120;&#32597;&#35265;&#65292;&#24456;&#23569;&#38656;&#35201;&#34987;&#39033;&#30446;&#29305;&#21035;&#20851;&#27880;&#65292;&#24182;&#25237;&#20837;&#21147;&#37327;&#21435;&#20445;&#25345;&#29992;&#25143;&#24314;&#35774;&#24615;&#30340;&#21644;&#26377;&#31036;&#35980;&#30340;&#20132;&#20114;&#12290;</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2603" href="#idp2603" class="para">24</a>] </sup>&#36825;&#20010;&#38382;&#39064;&#24050;&#32463;&#34987;&#35814;&#32454;&#30740;&#31350;&#65292;Karim Lakhani&#21644;Robert G. Wolf&#30340;&#19968;&#31687;&#35770;&#25991;&#26377;&#38750;&#24120;&#26377;&#36259;&#30340;&#32467;&#26524;&#65292;&#39064;&#30446;&#20026;<em class="citetitle">Why Hackers Do What They Do: Understanding
Motivation and Effort in Free/Open Source Software
Projects</em>&#12290;&#35265;<a class="ulink" href="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf" target="_top">http://freesoftware.mit.edu/papers/lakhaniwolf.pdf</a>&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp2665" href="#idp2665" class="para">25</a>] </sup>&#20294;&#26159;&#37038;&#20214;&#21015;&#34920;&#20013;&#38142;&#25509;&#20026;<a class="ulink" href="http://groups.google.com/group/sage-devel/browse_thread/thread/e207ce2206f0beee" target="_top">http://groups.google.com/group/sage-devel/browse_thread/thread/e207ce2206f0beee</a>&#30340;<em class="citetitle">&#8220;having authors names in .py files&#8221;</em>&#30340;&#36825;&#31687;&#25991;&#31456;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#25239;&#36777;&#65292;&#20316;&#32773;&#26159;William Stein&#12290;&#25105;&#35748;&#20026;&#20851;&#38190;&#22312;&#20110;&#35768;&#22810;&#20316;&#32773;&#26469;&#33258;&#19968;&#31181;&#23558;&#20449;&#35465;&#30452;&#25509;&#21462;&#33258;&#28304;&#20195;&#30721;&#35270;&#20026;&#26631;&#20934;&#24182;&#39640;&#24230;&#35780;&#20215;&#30340;&#25991;&#21270;&#12290;&#22312;&#37027;&#31181;&#29615;&#22659;&#20013;&#65292;&#21487;&#33021;&#26377;&#24517;&#35201;&#23558;&#20316;&#32773;&#30340;&#21517;&#23383;&#32622;&#20110;&#28304;&#20195;&#30721;&#20013;&#65292;&#24182;&#31934;&#30830;&#30340;&#25551;&#36848;&#27599;&#20010;&#20316;&#32773;&#30340;&#36129;&#29486;&#65292;&#22240;&#32780;&#22823;&#22810;&#25968;&#28508;&#22312;&#30340;&#36129;&#29486;&#32773;&#20250;&#24076;&#26395;&#26377;&#36825;&#31181;&#26679;&#24335;&#30340;&#25215;&#35748;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp2708" href="#idp2708" class="para">26</a>] </sup>&#35831;&#27880;&#24847;&#65292;&#27809;&#26377;&#24517;&#35201;&#23558;&#25152;&#26377;&#24050;&#23384;&#22312;&#30340;&#27979;&#35797;&#36716;&#21270;&#21040;&#26032;&#26694;&#26550;&#65307;&#20108;&#32773;&#21487;&#20197;&#21644;&#24179;&#20849;&#22788;&#65292;&#21482;&#38656;&#35201;&#36716;&#21270;&#38656;&#35201;&#25913;&#21464;&#30340;&#27979;&#35797;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="releases-and-daily-development.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="share-management.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;</td></tr></table></div></body></html>
