<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24066;&#22330;&#33829;&#38144;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="funding-non-programming.html" title="&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;"><link rel="next" href="communications.html" title="Chapter 6. &#20132;&#27969;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24066;&#22330;&#33829;&#38144;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="funding-non-programming.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="communications.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#24066;&#22330;&#33829;&#38144;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="marketing"></a>&#24066;&#22330;&#33829;&#38144;</h2></div></div></div><p>&#34429;&#28982;&#22823;&#22810;&#25968;&#24320;&#28304;&#24320;&#21457;&#32773;&#19981;&#24895;&#24847;&#25215;&#35748;&#65292;&#20294;&#24066;&#22330;&#25512;&#24191;&#30830;&#23454;&#26377;&#29992;&#12290;&#22909;&#30340;&#33829;&#38144;&#27963;&#21160;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#20026;&#24320;&#28304;&#20135;&#21697;&#21019;&#36896;&#33391;&#22909;&#30340;&#27675;&#22260;&#65292;&#21363;&#20351;&#27492;&#26102;&#39037;&#22266;&#30340;&#32534;&#30721;&#32773;&#22240;&#20026;&#19968;&#20123;&#26080;&#27861;&#35828;&#26126;&#30340;&#21407;&#22240;&#65292;&#23545;&#20110;&#36719;&#20214;&#36824;&#27809;&#26377;&#28165;&#26224;&#32943;&#23450;&#30340;&#24605;&#36335;&#12290;&#36825;&#37324;&#25105;&#19981;&#20250;&#35752;&#35770;&#19968;&#33324;&#24847;&#20041;&#30340;&#24066;&#22330;&#33829;&#38144;&#30340;&#20891;&#22791;&#31454;&#36187;&#21160;&#21147;&#23398;&#12290;&#25152;&#26377;&#21442;&#19982;&#21040;&#33258;&#30001;&#36719;&#20214;&#30340;&#20844;&#21496;&#26368;&#32456;&#37117;&#20250;&#21457;&#29616;&#33258;&#24049;&#38656;&#35201;&#32771;&#34385;&#22914;&#20309;&#33829;&#38144;&#33258;&#24049;&#12289;&#36719;&#20214;&#25110;&#20182;&#20204;&#19982;&#36719;&#20214;&#30340;&#20851;&#31995;&#12290;&#19979;&#38754;&#26159;&#22312;&#36827;&#34892;&#36825;&#31181;&#21162;&#21147;&#26102;&#22914;&#20309;&#36991;&#20813;&#33853;&#20837;&#38519;&#38449;&#30340;&#24314;&#35758;&#65307;&#35831;&#30475;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="publicity.html" title="&#20844;&#24320;&#24615;">the section called &#8220;&#20844;&#24320;&#24615;&#8221;</a>&#12290;</p><div class="sect2" title="&#35760;&#20303;&#20320;&#27491;&#22312;&#34987;&#27880;&#35270;&#30528;"><div class="titlepage"><div><div><h3 class="title"><a name="goldfish-bowl"></a>&#35760;&#20303;&#20320;&#27491;&#22312;&#34987;&#27880;&#35270;&#30528;</h3></div></div></div><p>&#20026;&#20102;&#35753;&#24535;&#24895;&#24320;&#21457;&#32773;&#31038;&#21306;&#19968;&#30452;&#31449;&#22312;&#20320;&#19968;&#36793;&#65292;<span class="emphasis"><em>&#38750;&#24120;</em></span>&#37325;&#35201;&#30340;&#19968;&#28857;&#26159;&#19981;&#35201;&#35828;&#20219;&#20309;&#19981;&#33021;&#30830;&#23450;&#27491;&#30830;&#30340;&#20107;&#24773;&#12290;&#20316;&#20986;&#20219;&#20309;&#22768;&#26126;&#21069;&#35201;&#20180;&#32454;&#23457;&#26680;&#65292;&#24182;&#35201;&#20026;&#20844;&#20247;&#25552;&#20379;&#29420;&#31435;&#26816;&#26597;&#35813;&#22768;&#26126;&#30340;&#26041;&#27861;&#12290;&#29420;&#31435;&#20107;&#23454;&#26816;&#26597;&#26159;&#24320;&#28304;&#39033;&#30446;&#30340;&#20027;&#35201;&#32452;&#25104;&#37096;&#20998;&#65292;&#23427;&#19981;&#20165;&#20165;&#36866;&#29992;&#20110;&#20195;&#30721;&#12290;</p><p>&#24456;&#33258;&#28982;&#65292;&#27809;&#26377;&#20154;&#20250;&#24314;&#35758;&#20844;&#21496;&#20316;&#20986;&#26410;&#39564;&#35777;&#30340;&#22768;&#26126;&#12290;&#20294;&#26159;&#22312;&#24320;&#28304;&#27963;&#21160;&#20013;&#65292;&#36890;&#24120;&#20250;&#26377;&#19981;&#21487;&#24605;&#35758;&#30340;&#22823;&#37327;&#25317;&#26377;&#19987;&#19994;&#25216;&#33021;&#30340;&#20154;&#21435;&#39564;&#35777;&#22768;&#26126;&#8212;&#36825;&#20123;&#20154;&#20063;&#37117;&#26377;&#39640;&#36895;&#30340;&#23485;&#24102;&#25509;&#20837;&#21644;&#36275;&#22815;&#30340;&#31038;&#20250;&#32852;&#31995;&#65292;&#21487;&#20197;&#29992;&#19968;&#31181;&#21361;&#38505;&#26041;&#27861;&#21457;&#24067;&#20182;&#20204;&#30340;&#21457;&#29616;&#65292;&#20182;&#20204;&#19968;&#23450;&#20250;&#36825;&#20040;&#24178;&#12290;&#24403;Global Megacorp&#21270;&#24037;&#30340;&#24037;&#21378;&#27745;&#26579;&#20102;&#27827;&#27969;&#65292;&#21482;&#26377;&#32463;&#36807;&#35757;&#32451;&#30340;&#31185;&#23398;&#23478;&#21487;&#20197;&#39564;&#35777;&#65292;&#20182;&#20204;&#20063;&#20250;&#21463;&#21040;Global Megacorp&#31185;&#23398;&#23478;&#30340;&#21453;&#39539;&#65292;&#35753;&#20844;&#20247;&#25235;&#32819;&#25376;&#33134;&#32780;&#19981;&#30693;&#22914;&#20309;&#32771;&#34385;&#12290;&#32780;&#21478;&#19968;&#26041;&#38754;&#65292;&#20320;&#22312;&#24320;&#28304;&#19990;&#30028;&#20013;&#30340;&#34892;&#20026;&#19981;&#20165;&#26159;&#21487;&#35265;&#30340;&#21644;&#21487;&#35760;&#24405;&#30340;&#65307;&#20063;&#24456;&#23481;&#26131;&#34987;&#35768;&#22810;&#20154;&#29420;&#31435;&#30340;&#26816;&#26597;&#65292;&#24471;&#20986;&#20182;&#20204;&#33258;&#24049;&#30340;&#32467;&#35770;&#65292;&#24182;&#21475;&#22836;&#20256;&#25773;&#36825;&#20123;&#32467;&#35770;&#12290;&#36825;&#31181;&#20132;&#27969;&#32593;&#32476;&#19968;&#30452;&#37117;&#22312;&#65307;&#37027;&#26159;&#24320;&#28304;&#25805;&#20316;&#30340;&#26412;&#36136;&#65292;&#20182;&#20204;&#21487;&#20197;&#29992;&#26469;&#20256;&#25773;&#20219;&#20309;&#20449;&#24687;&#12290;&#22914;&#26524;&#19981;&#26159;&#19981;&#21487;&#33021;&#65292;&#21453;&#39539;&#36890;&#24120;&#24456;&#22256;&#38590;&#65292;&#29305;&#21035;&#26159;&#24403;&#26576;&#20154;&#25152;&#35828;&#30340;&#26159;&#27491;&#30830;&#30340;&#12290;</p><p>&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#20204;&#30830;&#23454;&#36825;&#20040;&#20570;&#20102;&#65292;&#21487;&#20197;&#31216;&#20320;&#30340;&#32452;&#32455;&#8220;&#36164;&#21161;&#20102;&#39033;&#30446;X&#8221;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#22823;&#22810;&#25968;&#20195;&#30721;&#26159;&#22806;&#20154;&#20889;&#30340;&#65292;&#19981;&#35201;&#31216;&#33258;&#24049;&#20026;&#8220;X&#30340;&#21046;&#36896;&#32773;&#8221;&#12290;&#30456;&#21453;&#22320;&#65292;&#22914;&#26524;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#30475;&#21040;&#29256;&#26412;&#24211;&#21482;&#26377;&#23569;&#37327;&#20195;&#30721;&#21464;&#26356;&#26469;&#33258;&#20110;&#32452;&#32455;&#20043;&#22806;&#65292;&#19981;&#35201;&#22768;&#26126;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#28145;&#20837;&#21442;&#19982;&#30340;&#24320;&#21457;&#32773;&#31038;&#21306;&#12290;</p><p>&#19981;&#20037;&#20043;&#21069;&#65292;&#25105;&#30475;&#21040;&#19968;&#20010;&#30693;&#21517;&#35745;&#31639;&#26426;&#20844;&#21496;&#30340;&#19968;&#27425;&#22768;&#26126;&#65292;&#35828;&#26126;&#20182;&#20204;&#20197;&#24320;&#28304;&#35768;&#21487;&#35777;&#21457;&#24067;&#20102;&#19968;&#20010;&#37325;&#35201;&#30340;&#36719;&#20214;&#21253;&#12290;&#24403;&#26368;&#21021;&#30340;&#22768;&#26126;&#21457;&#20986;&#20043;&#21518;&#65292;&#25105;&#30475;&#20102;&#19968;&#19979;&#20182;&#20204;&#30340;&#20844;&#20849;&#29256;&#26412;&#25511;&#21046;&#29256;&#26412;&#24211;&#65292;&#21457;&#29616;&#20854;&#20013;&#21482;&#26377;&#19977;&#27425;&#20462;&#35746;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#20182;&#20204;&#21482;&#26159;&#20570;&#20102;&#19968;&#27425;&#20195;&#30721;&#30340;&#21021;&#22987;&#21270;&#23548;&#20837;&#65292;&#20043;&#21518;&#27809;&#20570;&#20160;&#20040;&#20107;&#24773;&#12290;&#27492;&#20107;&#26412;&#36523;&#27809;&#26377;&#20160;&#20040;&#22909;&#25285;&#24515;&#30340;&#8212;&#27605;&#31455;&#65292;&#20182;&#20204;&#21482;&#26159;&#20570;&#20102;&#22768;&#26126;&#12290;&#27809;&#26377;&#29702;&#30001;&#26399;&#24453;&#20250;&#31435;&#21051;&#21457;&#29983;&#22823;&#37327;&#24320;&#21457;&#27963;&#21160;&#12290;</p><p>&#19981;&#20037;&#20043;&#21518;&#65292;&#20182;&#20204;&#20316;&#20986;&#21478;&#19968;&#27425;&#22768;&#26126;&#12290;&#19979;&#38754;&#26159;&#23558;&#21517;&#31216;&#21644;&#25968;&#23383;&#26367;&#25442;&#21518;&#22768;&#26126;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#25105;&#20204;&#24456;&#39640;&#20852;&#30340;&#23459;&#24067;&#32463;&#36807;Singer&#31038;&#21306;&#20005;&#26684;&#30340;&#27979;&#35797;&#65292;Linux&#21644;Windows&#29256;&#26412;&#30340;Singer 5&#24050;&#32463;&#20570;&#22909;&#29983;&#20135;&#20351;&#29992;&#30340;&#20934;&#22791;&#12290;</em></span></p></blockquote></div><p>&#24456;&#24819;&#30693;&#36947;&#26159;&#20160;&#20040;&#31038;&#21306;&#36827;&#34892;&#30340;&#8220;&#20005;&#26684;&#27979;&#35797;&#8221;&#65292;&#25105;&#22238;&#21040;&#29256;&#26412;&#24211;&#21435;&#30475;&#26368;&#36817;&#30340;&#21464;&#26356;&#21382;&#21490;&#12290;&#39033;&#30446;&#36824;&#22312;&#20462;&#35746;3&#65292;&#24456;&#26126;&#26174;&#65292;&#20182;&#20204;&#27809;&#26377;&#21457;&#29616;<span class="emphasis"><em>&#20219;&#20309;&#19968;&#20010;</em></span>&#20540;&#24471;&#22312;&#21457;&#24067;&#21069;&#20462;&#35746;&#30340;bug&#12290;&#32771;&#34385;&#21040;&#31038;&#21306;&#27979;&#35797;&#19968;&#23450;&#26159;&#35760;&#24405;&#21040;&#20102;&#20854;&#20182;&#22320;&#26041;&#65292;&#25509;&#30528;&#25105;&#26816;&#26597;&#20102;bug&#36319;&#36394;&#31995;&#32479;&#12290;&#21457;&#29616;&#21018;&#22909;&#26377;6&#20010;&#24320;&#25918;&#30340;&#38382;&#39064;&#65292;&#20854;&#20013;&#22235;&#20010;&#24050;&#32463;&#25171;&#24320;&#20102;&#20960;&#20010;&#26376;&#12290;</p><p>&#24403;&#28982;&#65292;&#36825;&#26159;&#20062;&#19984;&#30340;&#20449;&#20208;&#65288;&#19981;&#21487;&#20449;&#65289;&#12290;&#24403;&#27979;&#35797;&#32773;&#22312;&#19968;&#20010;&#22823;&#22411;&#21644;&#22797;&#26434;&#30340;&#36719;&#20214;&#19978;&#35748;&#30495;&#25512;&#25970;&#19968;&#27573;&#26102;&#38388;&#65292;&#20182;&#20204;&#19968;&#23450;&#20250;&#21457;&#29616;bug&#12290;&#21363;&#20351;bug&#30340;&#20462;&#27491;&#19981;&#20250;&#36827;&#20837;&#21363;&#23558;&#21040;&#26469;&#30340;&#29256;&#26412;&#65292;&#20154;&#20204;&#36824;&#26159;&#24076;&#26395;&#26377;&#19968;&#20123;&#29256;&#26412;&#25511;&#21046;&#27963;&#21160;&#20250;&#20316;&#20026;&#27979;&#35797;&#36807;&#31243;&#30340;&#32467;&#26524;&#20986;&#29616;&#65292;&#25110;&#33267;&#23569;&#26159;&#19968;&#20123;&#26032;&#30340;&#38382;&#39064;&#12290;&#24456;&#26174;&#28982;&#65292;&#22312;&#24320;&#28304;&#35768;&#21487;&#35777;&#22768;&#26126;&#21644;&#31532;&#19968;&#27425;&#24320;&#28304;&#21457;&#24067;&#22768;&#26126;&#20043;&#38388;&#27809;&#26377;&#21457;&#29983;&#20219;&#20309;&#20107;&#24773;&#12290;</p><p>&#37325;&#28857;&#19981;&#26159;&#35828;&#36825;&#20010;&#20844;&#21496;&#22312;&#31038;&#21306;&#27979;&#35797;&#38382;&#39064;&#19978;&#35828;&#20102;&#35854;&#12290;&#25105;&#19981;&#30693;&#36947;&#20182;&#20204;&#21040;&#24213;&#20570;&#20102;&#27809;&#26377;&#12290;&#20294;&#26159;&#20182;&#20204;&#24456;&#26126;&#26174;<span class="emphasis"><em>&#20687;</em></span>&#26159;&#22312;&#27450;&#39575;&#12290;&#22240;&#20026;&#65292;&#26080;&#35770;&#26159;&#29256;&#26412;&#25511;&#21046;&#29256;&#26412;&#24211;&#36824;&#26159;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#65292;&#37117;&#27809;&#26377;&#20219;&#20309;&#36857;&#35937;&#26469;&#35828;&#26126;&#25152;&#35859;&#30340;&#20005;&#26684;&#27979;&#35797;&#26366;&#32463;&#21457;&#29983;&#36807;&#65292;&#36825;&#20010;&#20844;&#21496;&#35201;&#20040;&#19981;&#35201;&#36807;&#26089;&#30340;&#22768;&#26126;&#65292;&#35201;&#20040;&#25552;&#20379;&#19968;&#20123;&#27979;&#35797;&#32467;&#26524;&#30340;&#26126;&#30830;&#38142;&#25509;&#65288;&#8220;&#25105;&#20204;&#21457;&#29616;&#20102;278&#20010;bug&#65307;&#28857;&#20987;&#27492;&#22788;&#30475;&#35814;&#32454;&#20869;&#23481;&#8221;&#65289;&#12290;&#21518;&#19968;&#31181;&#26041;&#27861;&#21487;&#20197;&#35753;&#20219;&#20309;&#20154;&#36805;&#36895;&#25484;&#25569;&#31038;&#21306;&#27963;&#21160;&#30340;&#32423;&#21035;&#12290;&#23601;&#20687;&#21069;&#38754;&#35828;&#30340;&#65292;&#25105;&#21482;&#26377;&#20102;&#20960;&#20998;&#38047;&#23601;&#30830;&#23450;&#20102;&#36825;&#20010;&#31038;&#21306;&#27979;&#35797;&#30340;&#30495;&#30456;&#65292;&#23427;&#27809;&#26377;&#22312;&#20219;&#20309;&#24120;&#35265;&#30340;&#22320;&#26041;&#30041;&#19979;&#30165;&#36857;&#12290;&#37027;&#26679;&#19981;&#20250;&#33457;&#36153;&#22826;&#22810;&#21147;&#27668;&#65292;&#25105;&#30830;&#20449;&#25105;&#19981;&#26159;&#21807;&#19968;&#20445;&#25345;&#30097;&#24785;&#30340;&#20154;&#12290;</p><p>&#24403;&#28982;&#65292;&#36879;&#26126;&#24615;&#21644;&#21487;&#39564;&#35777;&#24615;&#20063;&#26159;&#20934;&#30830;&#20449;&#29992;&#30340;&#37325;&#35201;&#37096;&#20998;&#12290;&#20851;&#20110;&#36825;&#20123;&#20869;&#23481;&#21487;&#20197;&#30475;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="credit.html" title="&#33635;&#35465;">the section called &#8220;&#33635;&#35465;&#8221;</a>&#12290;</p></div><div class="sect2" title="&#19981;&#35201;&#30171;&#20987;&#31454;&#20105;&#24320;&#28304;&#20135;&#21697;"><div class="titlepage"><div><div><h3 class="title"><a name="competing-products"></a>&#19981;&#35201;&#30171;&#20987;&#31454;&#20105;&#24320;&#28304;&#20135;&#21697;</h3></div></div></div><p>&#35201;&#24525;&#20303;&#19981;&#35201;&#21457;&#34920;&#20851;&#20110;&#31454;&#20105;&#24320;&#28304;&#36719;&#20214;&#30340;&#36127;&#38754;&#24847;&#35265;&#12290;&#21487;&#20197;&#20570;&#30340;&#26159;&#25552;&#20379;&#36127;&#38754;&#30340;<span class="emphasis"><em>&#20107;&#23454;</em></span>&#8212;&#20063;&#23601;&#26159;&#36890;&#24120;&#22312;&#19968;&#20123;&#22909;&#30340;&#27604;&#36739;&#22270;&#34920;&#19978;&#21487;&#20197;&#36731;&#26131;&#30830;&#23450;&#30340;&#26029;&#35328;&#12290;&#20294;&#26159;&#26368;&#22909;&#36991;&#20813;&#19981;&#22826;&#20005;&#26684;&#30340;&#26412;&#24615;&#30340;&#36127;&#38754;&#29305;&#24449;&#65292;&#26377;&#20004;&#20010;&#21407;&#22240;&#12290;&#39318;&#20808;&#65292;&#36825;&#26679;&#20250;&#28857;&#29123;&#35770;&#25112;&#32780;&#33073;&#31163;&#26377;&#24314;&#35774;&#24847;&#20041;&#30340;&#35752;&#35770;&#12290;&#20854;&#27425;&#65292;&#26356;&#37325;&#35201;&#30340;&#65292;&#22312;<span class="emphasis"><em>&#20320;&#30340;</em></span>&#39033;&#30446;&#30340;&#19968;&#20123;&#24535;&#24895;&#24320;&#21457;&#32773;&#20250;&#36716;&#21521;&#20026;&#31454;&#20105;&#39033;&#30446;&#24037;&#20316;&#12290;&#24320;&#22987;&#24182;&#19981;&#26159;&#24456;&#26126;&#26174;&#65306;&#39033;&#30446;&#37117;&#22312;&#21516;&#19968;&#20010;&#39046;&#22495;&#65288;&#36825;&#20063;&#26159;&#20026;&#20160;&#20040;&#20182;&#20204;&#20250;&#31454;&#20105;&#65289;&#65292;&#25317;&#26377;&#19987;&#19994;&#25216;&#33021;&#30340;&#24320;&#21457;&#32773;&#20250;&#22312;&#20219;&#20309;&#21487;&#20197;&#21457;&#25381;&#19987;&#19994;&#25165;&#33021;&#30340;&#22320;&#26041;&#20316;&#20986;&#36129;&#29486;&#12290;&#21363;&#20351;&#27809;&#26377;&#30452;&#25509;&#30340;&#24320;&#21457;&#32773;&#37325;&#21472;&#65292;&#20063;&#24456;&#21487;&#33021;&#20320;&#30340;&#39033;&#30446;&#30340;&#24320;&#21457;&#32773;&#20250;&#19982;&#20851;&#32852;&#39033;&#30446;&#30340;&#24320;&#21457;&#32773;&#30456;&#35782;&#12290;&#20182;&#20204;&#32500;&#25252;&#24314;&#35774;&#24615;&#30340;&#20010;&#20154;&#20851;&#31995;&#30340;&#33021;&#21147;&#20250;&#34987;&#36127;&#38754;&#33829;&#38144;&#20449;&#24687;&#25152;&#26463;&#32538;&#12290;</p><p>&#22312;&#24320;&#28304;&#19990;&#30028;&#20013;&#65292;&#30171;&#27572;&#38381;&#28304;&#20135;&#21697;&#20013;&#30340;&#31454;&#20105;&#32773;&#26159;&#21487;&#20197;&#24191;&#27867;&#25509;&#21463;&#30340;&#65292;&#29305;&#21035;&#26159;&#22914;&#26524;&#36825;&#20123;&#20135;&#21697;&#26159;&#24494;&#36719;&#21046;&#36896;&#12290;&#20010;&#20154;&#26469;&#35762;&#65292;&#25105;&#20026;&#36825;&#31181;&#36235;&#21183;&#24863;&#21040;&#24754;&#21696;&#65288;&#34429;&#28982;&#22914;&#27492;&#65292;&#36825;&#31181;&#30452;&#25509;&#22522;&#20110;&#20107;&#23454;&#30340;&#27604;&#36739;&#27809;&#26377;&#20219;&#20309;&#38169;&#35823;&#65289;&#65292;&#19981;&#20165;&#20165;&#26159;&#22240;&#20026;&#36825;&#26679;&#24456;&#31895;&#40065;&#65292;&#20063;&#22240;&#20026;&#36825;&#26679;&#24456;&#21361;&#38505;&#65292;&#35753;&#19968;&#20010;&#39033;&#30446;&#24320;&#22987;&#30456;&#20449;&#23427;&#33258;&#24049;&#30340;&#22840;&#22840;&#20854;&#35848;&#65292;&#24182;&#24573;&#35270;&#31454;&#20105;&#32773;&#23454;&#38469;&#19978;&#21487;&#33021;&#26356;&#21152;&#20248;&#36234;&#30340;&#26041;&#24335;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#21487;&#20197;&#20180;&#32454;&#35266;&#23519;&#24066;&#22330;&#22768;&#26126;&#30340;&#25928;&#26524;&#65292;&#22240;&#20026;&#36825;&#20063;&#20250;&#21457;&#29983;&#22312;&#20320;&#33258;&#24049;&#30340;&#24320;&#21457;&#31038;&#21306;&#12290;&#20154;&#20204;&#21487;&#33021;&#22240;&#20026;&#24066;&#22330;&#32654;&#20803;&#30340;&#25903;&#25345;&#32780;&#20007;&#22833;&#23458;&#35266;&#24615;&#65292;&#26080;&#27861;&#30475;&#28165;&#33258;&#24049;&#36719;&#20214;&#30340;&#30495;&#27491;&#21147;&#37327;&#21644;&#24369;&#28857;&#12290;&#19968;&#20010;&#24456;&#21487;&#33021;&#20986;&#29616;&#30340;&#24773;&#24418;&#65292;&#26576;&#20010;&#20844;&#21496;&#30340;&#24320;&#21457;&#32773;&#20250;&#20844;&#24320;&#23637;&#31034;&#33258;&#24049;&#23545;&#20110;&#26576;&#20010;&#24066;&#22330;&#22768;&#26126;&#30340;&#26080;&#36764;&#65292;&#29978;&#33267;&#26159;&#30452;&#25509;&#22312;&#20844;&#20849;&#35770;&#22363;&#12290;&#24456;&#26126;&#26174;&#65292;&#20182;&#20204;&#19981;&#24212;&#24403;&#30452;&#25509;&#36339;&#20986;&#26469;&#21542;&#20915;&#24066;&#22330;&#33829;&#38144;&#20449;&#24687;&#65288;&#38500;&#38750;&#23427;&#20107;&#23454;&#19978;&#26159;&#38169;&#35823;&#30340;&#65292;&#23613;&#31649;&#20154;&#20204;&#24076;&#26395;&#27492;&#31867;&#20107;&#24773;&#33021;&#22815;&#23613;&#26089;&#34987;&#25429;&#33719;&#65289;&#12290;&#20294;&#26159;&#20182;&#20204;&#21487;&#33021;&#20250;&#19968;&#27425;&#27425;&#30340;&#21462;&#31505;&#36825;&#31181;&#34892;&#20026;&#65292;&#36825;&#20063;&#26159;&#23558;&#24320;&#21457;&#31038;&#21306;&#30340;&#20854;&#20313;&#37096;&#20998;&#24102;&#22238;&#22320;&#29699;&#30340;&#19968;&#20010;&#26041;&#27861;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="funding-non-programming.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="communications.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 6. &#20132;&#27969;</td></tr></table></div></body></html>
