<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 5. &#37329;&#38065;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="written-rules.html" title="&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;"><link rel="next" href="long-term-developers.html" title="&#38271;&#26399;&#38599;&#20323;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 5. &#37329;&#38065;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="written-rules.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="long-term-developers.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 5. &#37329;&#38065;"><div class="titlepage"><div><div><h2 class="title"><a name="money"></a>Chapter 5. &#37329;&#38065;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="money.html#types-of-involvement">&#21442;&#19982;&#30340;&#31867;&#22411;</a></span></dt><dt><span class="sect1"><a href="long-term-developers.html">&#38271;&#26399;&#38599;&#20323;</a></span></dt><dt><span class="sect1"><a href="appear-as-many.html">&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;</a></span></dt><dt><span class="sect1"><a href="open-motives.html">&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;</a></span></dt><dt><span class="sect1"><a href="money-vs-love.html">&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;</a></span></dt><dt><span class="sect1"><a href="contracting.html">&#22865;&#32422;</a></span></dt><dd><dl><dt><span class="sect2"><a href="contracting.html#community-review-acceptance">&#35780;&#23457;&#21644;&#25509;&#21463;&#21464;&#26356;</a></span></dt><dd><dl><dt><span class="sect3"><a href="contracting.html#cvs-pserver">&#26696;&#20363;&#30740;&#31350;&#65306;CVS&#23494;&#30721;&#35748;&#35777;&#21327;&#35758;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="funding-non-programming.html">&#36164;&#21161;&#38750;&#32534;&#31243;&#27963;&#21160;</a></span></dt><dd><dl><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-qa">&#36136;&#37327;&#20445;&#35777;&#65288;&#20063;&#25104;&#20026;&#19987;&#19994;&#27979;&#35797;&#65289;</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-legal">&#27861;&#24459;&#24314;&#35758;&#21644;&#20445;&#25252;</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-documentation-usability">&#25991;&#26723;&#21644;&#21487;&#29992;&#24615;</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-hosting">&#25552;&#20379;&#20027;&#26426;/&#24102;&#23485;</a></span></dt></dl></dd><dt><span class="sect1"><a href="marketing.html">&#24066;&#22330;&#33829;&#38144;</a></span></dt><dd><dl><dt><span class="sect2"><a href="marketing.html#goldfish-bowl">&#35760;&#20303;&#20320;&#27491;&#22312;&#34987;&#27880;&#35270;&#30528;</a></span></dt><dt><span class="sect2"><a href="marketing.html#competing-products">&#19981;&#35201;&#30171;&#20987;&#31454;&#20105;&#24320;&#28304;&#20135;&#21697;</a></span></dt></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#26412;&#31456;&#20180;&#32454;&#26816;&#26597;&#20102;&#22914;&#20309;&#20026;&#33258;&#30001;&#36719;&#20214;&#29615;&#22659;&#24102;&#26469;&#36164;&#37329;&#12290;&#36825;&#19981;&#20165;&#20165;&#26159;&#22312;&#33258;&#30001;&#36719;&#20214;&#20013;&#34987;&#25903;&#20184;&#24037;&#36164;&#30340;&#24320;&#21457;&#32773;&#30340;&#30446;&#26631;&#65292;&#20063;&#26159;&#20182;&#20204;&#30340;&#32463;&#21382;&#65292;&#37027;&#20123;&#38656;&#35201;&#29702;&#35299;&#24320;&#21457;&#29615;&#22659;&#31038;&#20250;&#21160;&#24577;&#24615;&#30340;&#20154;&#30340;&#30446;&#26631;&#12290;&#22312;&#25509;&#19979;&#26469;&#30340;&#31456;&#33410;&#20013;&#65292;&#20551;&#23450;&#25910;&#20214;&#20154;&#65288;&#20320;&#65289;&#26159;&#34987;&#20184;&#36153;&#30340;&#24320;&#21457;&#32773;&#65292;&#25110;&#32773;&#26159;&#31649;&#29702;&#36825;&#31867;&#24320;&#21457;&#32773;&#30340;&#20154;&#12290;&#23545;&#20110;&#20108;&#32773;&#30340;&#24314;&#35758;&#22522;&#26412;&#30456;&#21516;&#65307;&#22914;&#26524;&#19981;&#21516;&#65292;&#26377;&#24847;&#30340;&#35835;&#32773;&#21487;&#20197;&#20174;&#19978;&#19979;&#25991;&#20013;&#20998;&#28165;&#12290;</p><p>&#23545;&#33258;&#30001;&#36719;&#20214;&#24320;&#21457;&#26469;&#35828;&#65292;&#20844;&#21496;&#25237;&#36164;&#24050;&#32463;&#19981;&#26159;&#19968;&#20010;&#26032;&#30340;&#29616;&#35937;&#12290;&#35768;&#22810;&#24320;&#21457;&#34987;&#38750;&#27491;&#24335;&#30340;&#36164;&#21161;&#12290;&#24403;&#19968;&#20010;&#31995;&#32479;&#31649;&#29702;&#21592;&#20889;&#20102;&#19968;&#20010;&#32593;&#32476;&#20998;&#26512;&#24037;&#20855;&#26469;&#36741;&#21161;&#22905;&#30340;&#24037;&#20316;&#65292;&#28982;&#21518;&#25226;&#23427;&#21457;&#24067;&#21040;&#32593;&#32476;&#65292;&#25509;&#21463;&#26469;&#33258;&#20854;&#20182;&#31995;&#32479;&#31649;&#29702;&#21592;&#30340;bug&#20462;&#27491;&#21644;&#29305;&#24615;&#36129;&#29486;&#65292;&#36825;&#23601;&#20135;&#29983;&#20102;&#19968;&#31181;&#38750;&#27491;&#24335;&#30340;&#21512;&#20316;&#32452;&#32455;&#12290;&#36825;&#20010;&#21512;&#20316;&#32452;&#32455;&#30340;&#36164;&#37329;&#26469;&#33258;&#31995;&#32479;&#31649;&#29702;&#21592;&#30340;&#34218;&#27700;&#65292;&#32780;&#23427;&#30340;&#21150;&#20844;&#23460;&#31354;&#38388;&#21644;&#32593;&#32476;&#24102;&#23485;&#26159;&#25424;&#21161;&#30340;&#65292;&#23613;&#31649;&#26159;&#36890;&#36807;&#20854;&#25152;&#24037;&#20316;&#30340;&#40664;&#40664;&#26080;&#38395;&#30340;&#32452;&#32455;&#12290;&#36825;&#20010;&#32452;&#32455;&#20174;&#25237;&#36164;&#20013;&#33719;&#30410;&#65292;&#24403;&#28982;&#65292;&#23613;&#31649;&#24320;&#22987;&#26102;&#20182;&#20204;&#19981;&#20250;&#24847;&#35782;&#21040;&#36825;&#19968;&#28857;&#12290;</p><p>&#29616;&#22312;&#30340;&#19968;&#20123;&#21464;&#21270;&#26159;&#36825;&#31181;&#21147;&#37327;&#24050;&#32463;&#26356;&#21152;&#27491;&#24335;&#12290;&#20844;&#21496;&#24050;&#32463;&#35266;&#23519;&#21040;&#24320;&#28304;&#36719;&#20214;&#30340;&#22909;&#22788;&#65292;&#22312;&#20182;&#20204;&#33258;&#24049;&#30340;&#24320;&#21457;&#20013;&#30452;&#25509;&#21442;&#19982;&#20854;&#20013;&#12290;&#24320;&#21457;&#32773;&#20063;&#26356;&#33021;&#39044;&#26399;&#30495;&#27491;&#37325;&#35201;&#30340;&#39033;&#30446;&#33267;&#23569;&#33021;&#33719;&#21462;&#21040;&#25424;&#21161;&#65292;&#29978;&#33267;&#21487;&#33021;&#26159;&#38271;&#26399;&#30340;&#36190;&#21161;&#12290;&#32780;&#37329;&#38065;&#30340;&#20986;&#29616;&#24182;&#27809;&#26377;&#25913;&#21464;&#33258;&#30001;&#36719;&#20214;&#24320;&#21457;&#30340;&#22522;&#26412;&#21160;&#21147;&#23398;&#65292;&#23427;&#24050;&#32463;&#26497;&#22823;&#22320;&#25913;&#21464;&#20102;&#21457;&#29983;&#20107;&#24773;&#30340;&#33539;&#22260;&#65292;&#26080;&#35770;&#26159;&#20174;&#24320;&#21457;&#32773;&#30340;&#25968;&#37327;&#26469;&#35828;&#65292;&#36824;&#26159;&#27599;&#20010;&#24320;&#21457;&#32773;&#36129;&#29486;&#30340;&#26102;&#38388;&#12290;&#23545;&#20110;&#39033;&#30446;&#30340;&#32452;&#32455;&#65292;&#20197;&#21450;&#21442;&#19982;&#32773;&#30340;&#20132;&#20114;&#20063;&#26377;&#24433;&#21709;&#12290;&#36825;&#20010;&#38382;&#39064;&#19981;&#20165;&#20851;&#20110;&#37329;&#38065;&#22914;&#20309;&#33457;&#36153;&#65292;&#20063;&#20851;&#20110;&#22914;&#20309;&#27979;&#37327;&#25237;&#36164;&#22238;&#25253;&#12290;&#20182;&#20204;&#20063;&#20851;&#20110;&#31649;&#29702;&#21644;&#36807;&#31243;&#65306;&#20844;&#21496;&#23618;&#32423;&#25351;&#25381;&#32467;&#26500;&#21644;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#21322;&#38598;&#20013;&#30340;&#24535;&#24895;&#32773;&#31038;&#21306;&#33021;&#22815;&#20197;&#30456;&#36817;&#30340;&#29983;&#20135;&#29575;&#24037;&#20316;&#65311;&#20182;&#20204;&#35748;&#21487;&#8220;&#29983;&#20135;&#29575;&#8221;&#30340;&#21547;&#20041;&#65311;</p><p>&#36130;&#25919;&#25903;&#25345;&#36890;&#24120;&#20250;&#21463;&#21040;&#24320;&#28304;&#24320;&#21457;&#31038;&#21306;&#30340;&#27426;&#36814;&#12290;&#23427;&#21487;&#20197;&#20943;&#23569;&#39033;&#30446;&#38754;&#23545;&#28151;&#20081;&#21183;&#21147;&#30340;&#24369;&#28857;&#65292;&#36825;&#19968;&#28857;&#32463;&#24120;&#35753;&#39033;&#30446;&#22312;&#36215;&#39134;&#20043;&#21069;&#23601;&#34987;&#28165;&#38500;&#65292;&#22240;&#27492;&#23427;&#21487;&#20197;&#35753;&#20154;&#20204;&#26356;&#24076;&#26395;&#32473;&#36719;&#20214;&#19968;&#20010;&#26426;&#20250;&#8212;&#20182;&#20204;&#24863;&#21040;&#27491;&#22312;&#19968;&#39033;&#33267;&#23569;&#20250;&#20877;&#24178;6&#20010;&#26376;&#30340;&#24037;&#20316;&#19978;&#33457;&#36153;&#26102;&#38388;&#12290;&#27605;&#31455;&#65292;&#21487;&#38752;&#24615;&#20174;&#26469;&#37117;&#26159;&#26368;&#26377;&#24863;&#26579;&#21147;&#30340;&#22240;&#32032;&#12290;&#20551;&#23450;IBM&#25903;&#25345;&#20102;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#26102;&#65292;&#20154;&#20204;&#23601;&#20250;&#26356;&#23481;&#26131;&#35774;&#24819;&#36825;&#20010;&#39033;&#30446;&#19981;&#20250;&#22833;&#36133;&#65292;&#32780;&#20182;&#20204;&#30340;&#22240;&#27492;&#25152;&#33258;&#21457;&#30340;&#25237;&#20837;&#21453;&#32780;&#20250;&#21435;&#23454;&#29616;&#36825;&#20010;&#20250;&#25104;&#20026;&#20107;&#23454;&#30340;&#39044;&#35328;&#12290;</p><p>&#28982;&#32780;&#65292;&#36164;&#37329;&#20063;&#20250;&#24102;&#26469;&#25511;&#21046;&#30340;&#24863;&#35273;&#12290;&#22914;&#26524;&#22788;&#29702;&#19981;&#22909;&#65292;&#37329;&#38065;&#20250;&#35753;&#39033;&#30446;&#20998;&#35010;&#20026;&#22280;&#20869;&#21644;&#22280;&#22806;&#24320;&#21457;&#32773;&#12290;&#22914;&#26524;&#26410;&#20184;&#37228;&#30340;&#24535;&#24895;&#32773;&#24863;&#21040;&#35774;&#35745;&#20915;&#31574;&#25110;&#29305;&#24615;&#28155;&#21152;&#20165;&#20165;&#26159;&#30001;&#20986;&#20215;&#26368;&#39640;&#32773;&#20915;&#23450;&#30340;&#65292;&#20182;&#20204;&#20250;&#36716;&#32780;&#25237;&#21521;&#37027;&#20123;&#24863;&#35273;&#26356;&#20687;&#26159;&#30001;&#30693;&#35782;&#31934;&#33521;&#31649;&#29702;&#30340;&#65292;&#19981;&#35937;&#26159;&#20026;&#20102;&#26576;&#20010;&#20182;&#20154;&#21033;&#30410;&#36827;&#34892;&#26410;&#20184;&#37228;&#21171;&#21160;&#30340;&#39033;&#30446;&#12290;&#20182;&#20204;&#32477;&#19981;&#20250;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#20844;&#24320;&#25265;&#24616;&#12290;&#30456;&#21453;&#65292;&#38543;&#30528;&#24535;&#24895;&#32773;&#36880;&#28176;&#19981;&#20877;&#21162;&#21147;&#34987;&#37325;&#35270;&#65292;&#26469;&#33258;&#22806;&#37096;&#30340;&#22768;&#38899;&#20063;&#20250;&#36234;&#26469;&#36234;&#23569;&#12290;&#23567;&#35268;&#27169;&#27963;&#21160;&#30340;&#21557;&#38393;&#36824;&#20250;&#32487;&#32493;&#65292;&#20250;&#20197;bug&#25253;&#21578;&#21644;&#20598;&#23572;&#30340;&#23567;&#20462;&#35746;&#24418;&#24335;&#20986;&#29616;&#12290;&#20294;&#26159;&#20877;&#20063;&#19981;&#20250;&#26377;&#20219;&#20309;&#22823;&#35268;&#27169;&#30340;&#20195;&#30721;&#36129;&#29486;&#21644;&#26469;&#33258;&#22806;&#37096;&#30340;&#35774;&#35745;&#35752;&#35770;&#21442;&#19982;&#12290;&#20154;&#20204;&#24847;&#35782;&#21040;&#20182;&#20204;&#26159;&#22914;&#20309;&#34987;&#26399;&#26395;&#30340;&#65292;&#32780;&#19988;&#20063;&#20250;&#25353;&#29031;&#36825;&#20010;&#39044;&#26399;&#34892;&#20107;&#12290;</p><p>&#23613;&#31649;&#38656;&#35201;&#23567;&#24515;&#30340;&#20351;&#29992;&#37329;&#38065;&#65292;&#24182;&#19981;&#24847;&#21619;&#30528;&#19981;&#33021;&#36141;&#20080;&#24433;&#21709;&#21147;&#12290;&#22823;&#22810;&#26159;&#21487;&#20197;&#30340;&#12290;&#25216;&#24039;&#26159;&#19981;&#33021;&#30452;&#25509;&#36141;&#20080;&#24433;&#21709;&#21147;&#12290;&#22312;&#19968;&#20010;&#30452;&#25509;&#30340;&#21830;&#19994;&#20132;&#26131;&#20013;&#65292;&#20320;&#20351;&#29992;&#37329;&#38065;&#20132;&#25442;&#20320;&#25152;&#38656;&#35201;&#30340;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#28155;&#21152;&#19968;&#20010;&#29305;&#24615;&#65292;&#20320;&#31614;&#32626;&#19968;&#20010;&#21327;&#35758;&#65292;&#20026;&#27492;&#20184;&#27454;&#65292;&#28982;&#21518;&#23427;&#23601;&#20250;&#34987;&#23454;&#29616;&#12290;&#22312;&#24320;&#28304;&#39033;&#30446;&#65292;&#19981;&#20250;&#22914;&#27492;&#31616;&#21333;&#12290;&#20320;&#21487;&#20197;&#19982;&#26576;&#20123;&#24320;&#21457;&#32773;&#31614;&#32626;&#21327;&#35758;&#65292;&#20294;&#26159;&#20182;&#20204;&#38656;&#35201;&#27450;&#39575;&#33258;&#24049;&#8212;&#21644;&#20320;&#8212;&#22914;&#26524;&#20182;&#20204;&#20445;&#35777;&#20320;&#20184;&#36153;&#30340;&#24037;&#20316;&#20250;&#34987;&#24320;&#21457;&#31038;&#21306;&#25509;&#21463;&#65292;&#20165;&#20165;&#22240;&#20026;&#20320;&#20026;&#27492;&#20184;&#20102;&#36153;&#12290;&#36825;&#20010;&#24037;&#20316;&#21482;&#24212;&#35813;&#26681;&#25454;&#20107;&#23454;&#65292;&#20197;&#21450;&#19982;&#31038;&#21306;&#23545;&#20110;&#27492;&#36719;&#20214;&#30340;&#38271;&#36828;&#35268;&#21010;&#30340;&#31526;&#21512;&#31243;&#24230;&#26469;&#23436;&#25104;&#12290;&#20320;&#21487;&#20197;&#23545;&#36825;&#20010;&#38271;&#36828;&#35268;&#21010;&#21457;&#34920;&#24847;&#35265;&#65292;&#20294;&#20320;&#19981;&#24212;&#35813;&#26159;&#21807;&#19968;&#30340;&#22768;&#38899;&#12290;</p><p>&#25152;&#20197;&#37329;&#38065;&#19981;&#33021;&#36141;&#20080;&#24433;&#21709;&#21147;&#65292;&#20294;&#26159;&#21487;&#20197;&#36141;&#20080;<span class="emphasis"><em>&#23548;&#33268;</em></span>&#24433;&#21709;&#21147;&#30340;&#19996;&#35199;&#12290;&#26368;&#26126;&#26174;&#30340;&#20363;&#23376;&#26159;&#31243;&#24207;&#21592;&#12290;&#22914;&#26524;&#38599;&#20323;&#20102;&#22909;&#30340;&#31243;&#24207;&#21592;&#65292;&#20182;&#20204;&#36887;&#30041;&#20102;&#36275;&#22815;&#38271;&#30340;&#26102;&#38388;&#65292;&#20197;&#33719;&#21462;&#31038;&#21306;&#20013;&#30340;&#36719;&#20214;&#32463;&#39564;&#21644;&#20449;&#35465;&#65292;&#37027;&#20040;&#20182;&#20204;&#23601;&#21487;&#20197;&#20351;&#29992;&#20854;&#20182;&#25104;&#21592;&#19968;&#26679;&#30340;&#26041;&#24335;&#24433;&#21709;&#39033;&#30446;&#12290;&#20182;&#20204;&#20250;&#26377;&#19968;&#20010;&#25237;&#31080;&#65292;&#25110;&#32773;&#22914;&#26524;&#20154;&#25968;&#22826;&#22810;&#65292;&#20182;&#20204;&#20250;&#26377;&#25237;&#31080;&#38598;&#22242;&#12290;&#22914;&#26524;&#20182;&#20204;&#22312;&#39033;&#30446;&#20013;&#21463;&#21040;&#23562;&#37325;&#65292;&#20182;&#20204;&#20250;&#26377;&#36229;&#36234;&#25237;&#31080;&#30340;&#24433;&#21709;&#21147;&#12290;&#34987;&#25903;&#20184;&#30340;&#24320;&#21457;&#32773;&#27809;&#26377;&#24517;&#35201;&#25513;&#30422;&#20182;&#20204;&#30340;&#21160;&#26426;&#12290;&#27605;&#31455;&#65292;&#27599;&#20010;&#24076;&#26395;&#20462;&#25913;&#36719;&#20214;&#30340;&#20154;&#37117;&#26377;&#33258;&#24049;&#30340;&#30446;&#30340;&#12290;&#20320;&#20844;&#21496;&#30340;&#21407;&#22240;&#24182;&#19981;&#27604;&#20854;&#20182;&#20154;&#30340;&#32570;&#20047;&#36947;&#29702;&#12290;&#21482;&#26159;&#32473;&#19982;&#20844;&#21496;&#30446;&#26631;&#30340;&#30749;&#30721;&#21462;&#20915;&#20110;&#20195;&#29702;&#20154;&#22312;&#39033;&#30446;&#20013;&#30340;&#29366;&#24577;&#65292;&#32780;&#19981;&#26159;&#20844;&#21496;&#30340;&#35268;&#27169;&#12289;&#39044;&#31639;&#25110;&#21830;&#19994;&#35745;&#21010;&#12290;</p></div><div class="sect1" title="&#21442;&#19982;&#30340;&#31867;&#22411;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="types-of-involvement"></a>&#21442;&#19982;&#30340;&#31867;&#22411;</h2></div></div></div><p>&#24320;&#28304;&#39033;&#30446;&#34987;&#36164;&#21161;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#21407;&#22240;&#12290;&#36825;&#20010;&#21015;&#34920;&#20013;&#30340;&#26465;&#30446;&#24182;&#19981;&#20114;&#26021;&#65307;&#36890;&#24120;&#19968;&#20010;&#39033;&#30446;&#30340;&#36130;&#25919;&#25903;&#25345;&#20250;&#20986;&#33258;&#36825;&#37324;&#30340;&#22810;&#20010;&#65292;&#29978;&#33267;&#20840;&#37096;&#30340;&#21160;&#26426;&#65306;</p><div class="variablelist"><dl><dt><span class="term">&#20998;&#25285;&#36127;&#25285;</span></dt><dd><p>&#25317;&#26377;&#30456;&#20851;&#36719;&#20214;&#38656;&#35201;&#30340;&#19981;&#21516;&#32452;&#32455;&#32463;&#24120;&#20250;&#21457;&#29616;&#20182;&#20204;&#22312;&#37325;&#22797;&#25237;&#20837;&#65292;&#21253;&#25324;&#22312;&#20869;&#37096;&#37325;&#22797;&#32534;&#20889;&#31867;&#20284;&#30340;&#20195;&#30721;&#65292;&#20197;&#21450;&#20174;&#31169;&#26377;&#20379;&#36135;&#21830;&#36141;&#20080;&#31867;&#20284;&#30340;&#20135;&#21697;&#12290;&#24403;&#20182;&#20204;&#24847;&#35782;&#21040;&#20107;&#23454;&#30495;&#30456;&#21518;&#65292;&#36825;&#20123;&#32452;&#32455;&#20250;&#38598;&#20013;&#20182;&#20204;&#30340;&#36164;&#28304;&#65292;&#24182;&#21019;&#24314;&#65288;&#25110;&#21152;&#20837;&#65289;&#21040;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#65292;&#24182;&#20026;&#20182;&#20204;&#30340;&#38656;&#35201;&#35843;&#25972;&#12290;&#22909;&#22788;&#26159;&#26126;&#26174;&#30340;&#65306;&#24320;&#21457;&#30340;&#20195;&#20215;&#34987;&#20998;&#25285;&#20102;&#65292;&#32780;&#23545;&#25152;&#26377;&#20154;&#21033;&#30410;&#21017;&#22686;&#38271;&#20102;&#12290;&#23613;&#31649;&#36825;&#20010;&#22330;&#26223;&#20973;&#30452;&#35273;&#24212;&#35813;&#22823;&#22810;&#25968;&#26159;&#38750;&#30408;&#21033;&#32452;&#32455;&#25152;&#20570;&#30340;&#65292;&#20294;&#26159;&#21363;&#20351;&#23545;&#20110;&#30408;&#21033;&#31454;&#20105;&#32773;&#20063;&#20855;&#26377;&#25112;&#30053;&#24847;&#20041;&#12290;</p><p>&#20363;&#22914;&#65306;<a class="ulink" href="http://www.openadapter.org/" target="_top">http://www.openadapter.org/</a>&#21644;<a class="ulink" href="http://www.koha.org/" target="_top">http://www.koha.org/</a></p></dd><dt><span class="term">&#25552;&#39640;&#26381;&#21153;</span></dt><dd><p>&#24403;&#19968;&#20010;&#20844;&#21496;&#20986;&#21806;&#30340;&#26381;&#21153;&#20381;&#36182;&#20110;&#26576;&#20010;&#24320;&#28304;&#31243;&#24207;&#65292;&#25110;&#22240;&#20026;&#26576;&#20010;&#24320;&#28304;&#31243;&#24207;&#32780;&#26356;&#21152;&#20855;&#26377;&#21560;&#24341;&#21147;&#65292;&#24456;&#33258;&#28982;&#36825;&#20010;&#20844;&#21496;&#20250;&#26377;&#20852;&#36259;&#20445;&#35777;&#31243;&#24207;&#33021;&#22815;&#27963;&#36291;&#30340;&#32500;&#25252;&#30528;&#12290;</p><p>&#20363;&#22914;&#65306;<a class="ulink" href="http://www.collab.net/" target="_top">CollabNet</a>&#23545;&#20110;<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>&#30340;&#25903;&#25345;&#65288;&#20813;&#36131;&#22768;&#26126;&#65306;&#26159;&#25105;&#30340;&#26085;&#24120;&#24037;&#20316;&#65292;&#20294;&#26159;&#20063;&#26159;&#36825;&#20010;&#27169;&#22411;&#30340;&#23436;&#32654;&#23454;&#20363;&#65289;&#12290;</p></dd><dt><span class="term">&#25903;&#25345;&#30828;&#20214;&#38144;&#21806;</span></dt><dd><p>&#35745;&#31639;&#26426;&#21644;&#35745;&#31639;&#26426;&#32452;&#20214;&#30340;&#20215;&#20540;&#21644;&#20043;&#19978;&#30340;&#36719;&#20214;&#30452;&#25509;&#20851;&#32852;&#12290;&#30828;&#20214;&#38144;&#21806;&#21830;&#8212;&#19981;&#20165;&#26159;&#25972;&#26426;&#38144;&#21806;&#21830;&#65292;&#36824;&#21253;&#25324;&#22806;&#22260;&#35774;&#22791;&#21644;&#33455;&#29255;&#21046;&#36896;&#21830;&#8212;&#37117;&#21457;&#29616;&#35753;&#39640;&#36136;&#37327;&#30340;&#33258;&#30001;&#36719;&#20214;&#36816;&#34892;&#22312;&#20182;&#20204;&#30340;&#30828;&#20214;&#19978;&#23545;&#23458;&#25143;&#26469;&#35828;&#38750;&#24120;&#37325;&#35201;&#12290;</p></dd><dt><span class="term">&#26263;&#20013;&#21066;&#24369;&#31454;&#20105;&#32773;</span></dt><dd><p>&#26377;&#26102;&#20505;&#20844;&#21496;&#25903;&#25345;&#29305;&#23450;&#30340;&#24320;&#28304;&#39033;&#30446;&#20316;&#20026;&#23545;&#31454;&#20105;&#32773;&#20135;&#21697;&#30340;&#26263;&#20013;&#30772;&#22351;&#65292;&#26080;&#35770;&#31454;&#20105;&#20135;&#21697;&#26412;&#36523;&#26159;&#21542;&#24320;&#28304;&#12290;&#20105;&#22842;&#31454;&#20105;&#32773;&#30340;&#24066;&#22330;&#20221;&#39069;&#36890;&#24120;&#19981;&#26159;&#21442;&#19982;&#24320;&#28304;&#39033;&#30446;&#30340;&#21807;&#19968;&#21407;&#22240;&#65292;&#20294;&#21364;&#26159;&#19968;&#20010;&#22240;&#32032;&#12290;</p><p>&#20363;&#22914;&#65306;<a class="ulink" href="http://www.openoffice.org/" target="_top">http://www.openoffice.org/</a>&#65288;&#19981;&#65292;&#36825;&#19981;&#26159;OpenOffice&#23384;&#22312;&#30340;&#21807;&#19968;&#29702;&#30001;&#65292;&#20294;&#26159;&#36825;&#20010;&#36719;&#20214;&#33267;&#23569;&#37096;&#20998;&#30340;&#22238;&#24212;&#20102;&#24494;&#36719;&#30340;Office&#65289;&#12290;</p></dd><dt><span class="term">&#24066;&#22330;&#33829;&#38144;</span></dt><dd><p>&#35753;&#20320;&#30340;&#20844;&#21496;&#19982;&#27969;&#34892;&#30340;&#24320;&#28304;&#24212;&#29992;&#32852;&#31995;&#22312;&#19968;&#36215;&#65292;&#26159;&#31616;&#21333;&#32780;&#19988;&#22909;&#30340;&#21697;&#29260;&#31649;&#29702;&#12290;</p></dd><dt><span class="term">&#21452;&#37325;&#35768;&#21487;&#35777;</span></dt><dd><p><em class="firstterm">&#21452;&#37325;&#35768;&#21487;&#35777;</em>&#20250;&#20026;&#24076;&#26395;&#23558;&#36719;&#20214;&#20316;&#20026;&#33258;&#24049;&#31169;&#26377;&#36719;&#20214;&#30340;&#19968;&#37096;&#20998;&#36827;&#34892;&#38144;&#21806;&#30340;&#23458;&#25143;&#25552;&#20379;&#20256;&#32479;&#31169;&#26377;&#35768;&#21487;&#35777;&#65292;&#21516;&#26102;&#20026;&#24320;&#28304;&#33539;&#22260;&#20351;&#29992;&#30340;&#23458;&#25143;&#25552;&#20379;&#33258;&#30001;&#35768;&#21487;&#35777;&#65288;&#35265;<span><a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#30340;</span><a class="xref" href="dual-licensing.html" title="&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;">the section called &#8220;&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;&#8221;</a>&#65289;&#12290;&#22914;&#26524;&#24320;&#28304;&#24320;&#21457;&#32773;&#31038;&#21306;&#26159;&#27963;&#36291;&#30340;&#65292;&#36719;&#20214;&#21487;&#20197;&#24191;&#27867;&#39046;&#22495;&#33719;&#24471;&#35843;&#35797;&#21644;&#24320;&#21457;&#30340;&#22909;&#22788;&#65292;&#23613;&#31649;&#20844;&#21496;&#20173;&#28982;&#20445;&#25345;&#25903;&#25345;&#19968;&#20123;&#20840;&#32844;&#31243;&#24207;&#21592;&#30340;&#29305;&#35768;&#26435;&#12290;</p><p>&#20004;&#20010;&#33879;&#21517;&#30340;&#20363;&#23376;&#26159;<a class="ulink" href="http://www.mysql.com/" target="_top">MySQL</a>&#65292;&#30456;&#21516;&#21517;&#31216;&#25968;&#25454;&#24211;&#36719;&#20214;&#30340;&#21046;&#36896;&#21830;&#65292;&#20197;&#21450;<a class="ulink" href="http://www.sleepycat.com/" target="_top">Sleepycat</a>&#65292;&#25552;&#20379;Berkeley&#25968;&#25454;&#24211;&#30340;&#21457;&#24067;&#21644;&#25903;&#25345;&#12290;&#20182;&#20204;&#37117;&#26159;&#25968;&#25454;&#24211;&#20844;&#21496;&#24182;&#19981;&#26159;&#24039;&#21512;&#12290;&#25968;&#25454;&#24211;&#36719;&#20214;&#36890;&#24120;&#20250;&#38598;&#25104;&#21040;&#24212;&#29992;&#20013;&#65292;&#32780;&#19981;&#20250;&#30452;&#25509;&#20132;&#32473;&#29992;&#25143;&#65292;&#25152;&#20197;&#38750;&#24120;&#36866;&#21512;&#21452;&#37325;&#35768;&#21487;&#35777;&#27169;&#22411;&#12290;</p></dd><dt><span class="term">&#25424;&#36192;</span></dt><dd><p>&#19968;&#20010;&#24191;&#27867;&#20351;&#29992;&#30340;&#39033;&#30446;&#26377;&#26102;&#21487;&#20197;&#33719;&#24471;&#21487;&#35266;&#30340;&#25424;&#21161;&#65292;&#21253;&#25324;&#26469;&#33258;&#20010;&#20154;&#21644;&#32452;&#32455;&#30340;&#65292;&#21482;&#38656;&#35201;&#26377;&#19968;&#20010;&#22312;&#32447;&#30340;&#25424;&#36192;&#25353;&#38062;&#65292;&#25110;&#32773;&#26377;&#26102;&#36890;&#36807;&#38144;&#21806;&#35832;&#22914;&#21654;&#21857;&#26479;&#12289;&#20307;&#24676;&#21644;&#40736;&#26631;&#22443;&#20043;&#31867;&#30340;&#21697;&#29260;&#21830;&#21697;&#31561;&#31561;&#12290;&#23567;&#24515;&#19968;&#28857;&#65306;&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#25509;&#21463;&#25424;&#36192;&#65292;&#22312;&#24471;&#21040;<span class="emphasis"><em>&#20043;&#21069;</em></span>&#35201;&#35745;&#21010;&#22909;&#22914;&#20309;&#20351;&#29992;&#36825;&#20123;&#38065;&#65292;&#24182;&#22312;&#39033;&#30446;&#32593;&#31449;&#20013;&#27880;&#26126;&#12290;&#22312;&#23454;&#38469;&#33457;&#36153;&#20043;&#21069;&#20445;&#30041;&#65292;&#21487;&#20197;&#35753;&#20851;&#20110;&#22914;&#20309;&#20998;&#37197;&#38065;&#30340;&#35752;&#35770;&#21464;&#24471;&#21313;&#20998;&#39034;&#21033;&#65307;&#20294;&#19981;&#31649;&#24590;&#26679;&#65292;&#22914;&#26524;&#26377;&#26126;&#26174;&#30340;&#20998;&#27495;&#65292;&#26368;&#22909;&#25226;&#23427;&#25214;&#20986;&#26469;&#65292;&#36825;&#36824;&#26159;&#24456;&#23398;&#26415;&#30340;&#19996;&#35199;&#12290;</p></dd></dl></div><p>&#25237;&#36164;&#32773;&#30340;&#21830;&#19994;&#27169;&#22411;&#19981;&#26159;&#23427;&#19982;&#24320;&#28304;&#31038;&#21306;&#22914;&#20309;&#32852;&#31995;&#30340;&#21807;&#19968;&#22240;&#32032;&#12290;&#20108;&#32773;&#30340;&#21382;&#21490;&#20851;&#31995;&#20063;&#24456;&#37325;&#35201;&#65306;&#36825;&#20010;&#20844;&#21496;&#24320;&#22987;&#20102;&#36825;&#20010;&#39033;&#30446;&#65292;&#25110;&#32773;&#23427;&#32852;&#21512;&#20102;&#29616;&#26377;&#30340;&#24320;&#21457;&#21147;&#37327;&#65311;&#22312;&#36825;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#25237;&#36164;&#32773;&#37117;&#38656;&#35201;&#36194;&#24471;&#20449;&#35465;&#65292;&#20294;&#26159;&#65292;&#19981;&#20196;&#20154;&#24847;&#22806;&#65292;&#22312;&#21518;&#19968;&#31181;&#24773;&#20917;&#19979;&#38656;&#35201;&#30340;&#26356;&#22810;&#12290;&#32452;&#32455;&#38656;&#35201;&#23545;&#39033;&#30446;&#30340;&#26410;&#26469;&#26377;&#28165;&#26224;&#30340;&#30446;&#26631;&#12290;&#20844;&#21496;&#24076;&#26395;&#20445;&#25345;&#39046;&#23548;&#22320;&#20301;&#65292;&#25110;&#20165;&#20165;&#26159;&#25104;&#20026;&#31038;&#21306;&#30340;&#19968;&#20010;&#22768;&#38899;&#65292;&#20174;&#32780;&#33021;&#22815;&#24341;&#23548;&#32780;&#19981;&#24517;&#25511;&#21046;&#39033;&#30446;&#30340;&#26041;&#21521;&#65311;&#25110;&#32773;&#23427;&#21482;&#26159;&#24076;&#26395;&#26377;&#19968;&#20123;&#25552;&#20132;&#32773;&#65292;&#33021;&#22815;&#20462;&#22797;&#23458;&#25143;&#30340;bug&#24182;&#33021;&#22815;&#19981;&#36153;&#21561;&#28784;&#20043;&#21147;&#30340;&#23558;&#21464;&#26356;&#32622;&#20837;&#20844;&#20849;&#29256;&#26412;&#65311;</p><p>&#24403;&#20320;&#38405;&#35835;&#21518;&#38754;&#30340;&#25351;&#23548;&#26041;&#38024;&#26102;&#35201;&#30041;&#24847;&#36825;&#20123;&#38382;&#39064;&#12290;&#20182;&#20204;&#21487;&#20197;&#24212;&#29992;&#21040;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#30340;&#27492;&#31867;&#32452;&#32455;&#21442;&#19982;&#65292;&#20294;&#27599;&#20010;&#39033;&#30446;&#37117;&#26159;&#19968;&#20010;&#20154;&#31867;&#29615;&#22659;&#65292;&#22240;&#27492;&#27809;&#26377;&#23436;&#20840;&#30456;&#21516;&#30340;&#12290;&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#65292;&#20320;&#38656;&#35201;&#36319;&#30528;&#24863;&#35273;&#28436;&#22863;&#65292;&#20294;&#26159;&#36981;&#20174;&#36825;&#20123;&#21407;&#29702;&#20250;&#22686;&#22823;&#32467;&#26524;&#31526;&#21512;&#20320;&#24819;&#27861;&#30340;&#21487;&#33021;&#24615;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="written-rules.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="long-term-developers.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#38271;&#26399;&#38599;&#20323;</td></tr></table></div></body></html>
