<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="open-motives.html" title="&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;"><link rel="next" href="contracting.html" title="&#22865;&#32422;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="open-motives.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="contracting.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="money-vs-love"></a>&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;</h2></div></div></div><p>&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#26377;&#20184;&#36153;&#30340;&#24320;&#21457;&#32773;&#65292;&#19968;&#23450;&#35201;&#23613;&#26089;&#35774;&#32622;&#38065;&#21487;&#20197;&#36141;&#20080;&#20160;&#20040;&#19996;&#35199;&#30340;&#25351;&#23548;&#26041;&#38024;&#12290;&#36825;&#24182;&#19981;&#24847;&#21619;&#30528;&#20320;&#38656;&#35201;&#27599;&#22825;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#35828;&#26126;&#20004;&#27425;&#26469;&#37325;&#30003;&#20320;&#30340;&#39640;&#23578;&#21644;&#19981;&#33104;&#30340;&#26412;&#24615;&#12290;&#20320;&#21482;&#38656;&#35201;&#22312;&#24688;&#24403;&#30340;&#26102;&#26426;&#25918;&#26494;&#30001;&#38065;<span class="emphasis"><em>&#23548;&#33268;</em></span>&#30340;&#32039;&#24352;&#12290;&#20320;&#19981;&#38656;&#35201;&#20174;&#19968;&#24320;&#22987;&#23601;&#20551;&#35774;&#23384;&#22312;&#36825;&#31181;&#32039;&#24352;&#65307;&#20320;&#21482;&#38656;&#35201;&#35828;&#26126;&#26377;&#36825;&#31181;&#21487;&#33021;&#24615;&#12290;</p><p>&#19968;&#20010;&#23436;&#32654;&#30340;&#20363;&#23376;&#23601;&#26159;Subversion&#39033;&#30446;&#12290;<a class="ulink" href="http://www.collab.net/" target="_top">CollabNet</a>&#22312;2000&#24180;&#24320;&#22987;&#20102;Subversion&#65292;&#20174;&#19968;&#24320;&#22987;&#23427;&#20415;&#26159;&#39033;&#30446;&#20027;&#35201;&#30340;&#25237;&#36164;&#32773;&#65292;&#20026;&#22810;&#20010;&#24320;&#21457;&#32773;&#25552;&#20379;&#34218;&#27700;&#65288;&#20813;&#36131;&#22768;&#26126;&#65306;&#21253;&#25324;&#25105;&#65289;&#12290;&#39033;&#30446;&#24320;&#22987;&#21518;&#19981;&#20037;&#65292;&#25105;&#20204;&#38599;&#20323;&#20102;&#21478;&#19968;&#20010;&#24320;&#21457;&#32773;Mike Pilato&#65292;&#21442;&#19982;&#24320;&#21457;&#24037;&#20316;&#12290;&#27492;&#26102;&#65292;&#32534;&#30721;&#24037;&#20316;&#24050;&#32463;&#24320;&#22987;&#12290;&#23613;&#31649;Subversion&#36824;&#22788;&#20110;&#26089;&#26399;&#38454;&#27573;&#65292;&#20294;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#24320;&#21457;&#32773;&#31038;&#21306;&#21644;&#35768;&#22810;&#22522;&#26412;&#30340;&#35268;&#21017;&#12290;</p><p>Mike&#30340;&#21040;&#26469;&#31361;&#29616;&#20102;&#19968;&#20010;&#26377;&#36259;&#30340;&#38382;&#39064;&#12290;Subversion&#24050;&#32463;&#26377;&#20102;&#24320;&#21457;&#32773;&#22914;&#20309;&#33719;&#24471;&#25552;&#20132;&#26435;&#30340;&#25919;&#31574;&#12290;&#39318;&#20808;&#65292;&#20182;&#38656;&#35201;&#22312;&#24320;&#21457;&#37038;&#20214;&#21015;&#34920;&#20013;&#25552;&#20132;&#19968;&#20123;&#34917;&#19969;&#12290;&#24403;&#26377;&#20102;&#36275;&#22815;&#30340;&#34917;&#19969;&#21518;&#65292;&#20854;&#20182;&#25552;&#20132;&#32773;&#30475;&#21040;&#26032;&#36129;&#29486;&#32773;&#30693;&#36947;&#33258;&#24049;&#25152;&#20570;&#30340;&#20107;&#24773;&#65292;&#26576;&#20154;&#23601;&#20250;&#25552;&#35758;&#20182;&#30452;&#25509;&#25552;&#20132;&#65288;&#36825;&#20010;&#25552;&#35758;&#26159;&#31169;&#19979;&#30340;&#65292;&#23601;&#20687;<a class="xref" href="committers.html" title="&#25552;&#20132;&#32773;">the section called &#8220;&#25552;&#20132;&#32773;&#8221;</a>&#25152;&#25551;&#36848;&#30340;&#65289;&#12290;&#22914;&#26524;&#25552;&#20132;&#32773;&#20204;&#21516;&#24847;&#65292;&#20854;&#20013;&#30340;&#26576;&#20154;&#23601;&#20250;&#37038;&#20214;&#36890;&#30693;&#26032;&#30340;&#24320;&#21457;&#32773;&#65292;&#24182;&#20026;&#20182;&#35774;&#32622;&#30452;&#25509;&#25552;&#20132;&#35775;&#38382;&#39033;&#30446;&#29256;&#26412;&#24211;&#30340;&#26435;&#38480;&#12290;</p><p>CollabNet&#26159;&#19987;&#38376;&#20026;Subversion&#39033;&#30446;&#38599;&#20323;&#20102;Mike&#12290;&#20182;&#20204;&#24050;&#32463;&#23545;&#20182;&#36275;&#22815;&#20102;&#35299;&#65292;&#23545;&#20110;&#20182;&#30340;&#32534;&#30721;&#25216;&#24039;&#21644;&#22312;&#27492;&#39033;&#30446;&#25152;&#20316;&#30340;&#20934;&#22791;&#27627;&#26080;&#30097;&#38382;&#12290;&#27492;&#22806;&#65292;&#24535;&#24895;&#32773;&#24320;&#21457;&#32773;&#24050;&#32463;&#19982;CollabNet&#38599;&#21592;&#26377;&#20102;&#38750;&#24120;&#22909;&#30340;&#20851;&#31995;&#65292;&#30475;&#36215;&#26469;&#22914;&#26524;&#25105;&#20204;&#30452;&#25509;&#22312;&#38599;&#29992;Mike&#24403;&#22825;&#23601;&#36171;&#20104;&#20182;&#26435;&#38480;&#20063;&#19981;&#20250;&#26377;&#20160;&#20040;&#21453;&#23545;&#24847;&#35265;&#12290;&#20294;&#26159;&#25105;&#20204;&#30693;&#36947;&#25105;&#20204;&#27491;&#22312;&#35774;&#32622;&#19968;&#20010;&#20808;&#20363;&#12290;&#22914;&#26524;&#25105;&#20204;&#25353;&#21629;&#20196;&#32473;Mike&#25552;&#20132;&#26435;&#21033;&#65292;&#25105;&#20204;&#20250;&#35828;CollabNet&#26377;&#26435;&#26080;&#35270;&#39033;&#30446;&#30340;&#25351;&#23548;&#26041;&#38024;&#65292;&#21482;&#26159;&#22240;&#20026;&#23427;&#26159;&#20027;&#35201;&#30340;&#25237;&#36164;&#32773;&#12290;&#36825;&#31181;&#34892;&#20026;&#30340;&#23475;&#22788;&#26410;&#24517;&#31435;&#21051;&#26174;&#29616;&#20986;&#26469;&#65292;&#23427;&#20250;&#23548;&#33268;&#38750;&#20184;&#36153;&#24320;&#21457;&#32773;&#36880;&#28176;&#24863;&#21040;&#34987;&#21093;&#22842;&#20102;&#25237;&#31080;&#26435;&#12290;&#20854;&#20182;&#20154;&#33258;&#24049;&#36194;&#24471;&#20182;&#20204;&#30340;&#25552;&#20132;&#26435;&#21033;&#8212;&#32780;CollabNet&#21482;&#38656;&#35201;&#33457;&#38065;&#20080;&#12290;</p><p>&#25152;&#20197;Mike&#36190;&#25104;&#35937;&#20854;&#20182;&#24535;&#24895;&#24320;&#21457;&#32773;&#19968;&#26679;&#65292;&#22312;&#27809;&#26377;&#25552;&#20132;&#26435;&#38480;&#30340;&#24773;&#20917;&#19979;&#24320;&#22987;&#20102;&#22312;CollabNet&#30340;&#38599;&#20323;&#24037;&#20316;&#12290;&#20182;&#22312;&#20844;&#20849;&#21015;&#34920;&#20013;&#21457;&#24067;&#34917;&#19969;&#65292;&#22312;&#20854;&#20013;&#21487;&#33021;&#20250;&#21463;&#21040;&#65292;&#23454;&#38469;&#19978;&#20063;&#30830;&#23454;&#21463;&#21040;&#20102;&#25152;&#26377;&#20154;&#30340;&#35780;&#23457;&#12290;&#25105;&#20204;&#22312;&#21015;&#34920;&#20013;&#20063;&#35828;&#36807;&#25105;&#20204;&#26159;&#25925;&#24847;&#36825;&#26679;&#20570;&#30340;&#12290;&#32463;&#36807;Mike&#25968;&#21608;&#30340;&#25166;&#23454;&#27963;&#21160;&#65292;&#26576;&#20154;&#65288;&#25105;&#19981;&#35760;&#24471;&#26159;&#21542;&#26159;CollabNet&#24320;&#21457;&#32773;&#65289;&#25552;&#35758;&#32473;&#20182;&#25552;&#20132;&#26435;&#38480;&#65292;&#32780;&#20182;&#34987;&#25509;&#21463;&#20102;&#65292;&#24403;&#28982;&#65292;&#25105;&#20204;&#30693;&#36947;&#20182;&#20250;&#34987;&#25509;&#21463;&#12290;</p><p>&#37027;&#31181;&#31867;&#22411;&#30340;&#19968;&#33268;&#24615;&#20250;&#35753;&#20320;&#30830;&#20449;&#38065;&#19981;&#21487;&#20197;&#20080;&#21040;&#19968;&#20999;&#12290;&#36825;&#31181;&#30830;&#20449;&#26159;&#25216;&#26415;&#35752;&#35770;&#20013;&#29645;&#36149;&#30340;&#27969;&#36890;&#36135;&#24065;&#65306;&#21487;&#20197;&#20813;&#20110;&#20197;&#21518;&#35753;&#26576;&#20154;&#30340;&#21160;&#26426;&#34987;&#24576;&#30097;&#12290;&#22312;&#36777;&#35770;&#26368;&#28608;&#28872;&#26102;&#65292;&#20154;&#20204;&#26377;&#26102;&#20250;&#23547;&#25214;&#38750;&#25216;&#26415;&#30340;&#26041;&#24335;&#26469;&#36194;&#24471;&#25112;&#26007;&#12290;&#39033;&#30446;&#30340;&#20027;&#35201;&#25237;&#36164;&#32773;&#65292;&#22240;&#20026;&#28041;&#36275;&#36739;&#28145;&#24182;&#19988;&#26174;&#28982;&#20250;&#23545;&#39033;&#30446;&#37319;&#21462;&#30340;&#26041;&#21521;&#21313;&#20998;&#20851;&#27880;&#65292;&#20250;&#23637;&#31034;&#20986;&#27604;&#22823;&#22810;&#25968;&#20154;&#26356;&#24191;&#30340;&#30446;&#26631;&#12290;&#36890;&#36807;&#20174;&#19968;&#24320;&#22987;&#23601;&#19968;&#19997;&#19981;&#33503;&#30340;&#36981;&#23432;&#39033;&#30446;&#26041;&#38024;&#65292;&#25237;&#36164;&#32773;&#23601;&#21487;&#20197;&#33719;&#24471;&#21644;&#25152;&#26377;&#20154;&#19968;&#26679;&#30340;&#24433;&#21709;&#21147;&#12290;</p><p>&#65288;Danese Cooper&#30340;blog&#19978;<a class="ulink" href="http://blogs.sun.com/roller/page/DaneseCooper/20040916" target="_top">http://blogs.sun.com/roller/page/DaneseCooper/20040916</a>&#26377;&#20851;&#20110;&#25552;&#20132;&#26435;&#38480;&#30340;&#31867;&#20284;&#25925;&#20107;&#12290;Cooper&#26159;Sun
Microsystem&#30340;&#8220;&#24320;&#28304;Diva&#8221;&#8212;&#25105;&#30456;&#20449;&#36825;&#26159;&#22905;&#30340;&#23448;&#26041;&#22836;&#34900;&#8212;&#22312;&#22905;&#30340;blog&#20013;&#65292;&#22905;&#25551;&#36848;&#20102;Tomcat&#24320;&#21457;&#31038;&#21306;&#35753;Sun&#22312;&#25511;&#21046;&#25552;&#20132;&#26435;&#38480;&#26102;&#23545;Sun&#30340;&#20154;&#21592;&#21644;&#38750;Sun&#30340;&#20154;&#21592;&#19968;&#35270;&#21516;&#20161;&#12290;&#65289;</p><p>&#21019;&#22987;&#20154;&#23545;&#25152;&#26377;&#20154;&#20351;&#29992;&#30456;&#21516;&#35268;&#21017;&#30340;&#38656;&#35201;&#24847;&#21619;&#30528;&#24904;&#21892;&#29420;&#35009;&#32479;&#27835;&#27169;&#22411;&#65288;&#35265;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="social-infrastructure.html#benevolent-dictator" title="&#24904;&#21892;&#29420;&#35009;&#32773;">the section called &#8220;&#24904;&#21892;&#29420;&#35009;&#32773;&#8221;</a>&#65289;&#22312;&#25237;&#36164;&#38754;&#21069;&#26377;&#19968;&#28857;&#38590;&#20110;&#23454;&#26045;&#65292;&#29305;&#21035;&#26159;&#29420;&#35009;&#32773;&#20026;&#20027;&#35201;&#30340;&#25237;&#36164;&#26041;&#24037;&#20316;&#30340;&#24773;&#20917;&#12290;&#22240;&#20026;&#29420;&#35009;&#26377;&#19968;&#20123;&#35268;&#21017;&#65292;&#25237;&#36164;&#32773;&#24456;&#38590;&#35777;&#26126;&#36981;&#23432;&#20102;&#31038;&#21306;&#26631;&#20934;&#65292;&#21363;&#20351;&#20107;&#23454;&#22914;&#27492;&#12290;&#36825;&#30830;&#23454;&#19981;&#26159;&#19981;&#21487;&#33021;&#65307;&#21482;&#26159;&#38656;&#35201;&#39033;&#30446;&#39046;&#23548;&#32773;&#26082;&#33021;&#22815;&#20174;&#25237;&#36164;&#26041;&#20063;&#33021;&#22815;&#20174;&#22806;&#22260;&#24320;&#21457;&#32773;&#30340;&#35270;&#35282;&#30475;&#24453;&#20107;&#29289;&#65292;&#24182;&#20381;&#27492;&#34892;&#21160;&#12290;&#21363;&#20351;&#37027;&#26679;&#65292;&#20063;&#26368;&#22909;&#33021;&#22312;&#21518;&#21475;&#34955;&#26377;&#19968;&#20010;&#38750;&#29420;&#35009;&#31649;&#29702;&#30340;&#25552;&#35758;&#65292;&#20934;&#22791;&#22909;&#22312;&#31038;&#21306;&#30340;&#19981;&#28385;&#25193;&#25955;&#26102;&#25487;&#20986;&#26469;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="open-motives.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="contracting.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20844;&#24320;&#20320;&#30340;&#21160;&#26426; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#22865;&#32422;</td></tr></table></div></body></html>
