<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="money.html" title="Chapter 5. &#37329;&#38065;"><link rel="prev" href="appear-as-many.html" title="&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307;"><link rel="next" href="money-vs-love.html" title="&#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="appear-as-many.html">Prev</a> </td><th width="60%" align="center">Chapter 5. &#37329;&#38065;</th><td width="20%" align="right"> <a accesskey="n" href="money-vs-love.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="open-motives"></a>&#20844;&#24320;&#20320;&#30340;&#21160;&#26426;</h2></div></div></div><p>&#23613;&#21487;&#33021;&#20844;&#24320;&#20320;&#30340;&#32452;&#32455;&#30340;&#30446;&#26631;&#65292;&#19981;&#35201;&#22240;&#27492;&#32780;&#35753;&#21830;&#19994;&#31192;&#23494;&#22949;&#21327;&#12290;&#22914;&#26524;&#20320;&#24076;&#26395;&#39033;&#30446;&#33021;&#22815;&#33719;&#24471;&#26576;&#20010;&#29305;&#23450;&#30340;&#29305;&#24615;&#65292;&#20363;&#22914;&#20320;&#30340;&#23458;&#25143;&#35201;&#27714;&#36825;&#20010;&#29305;&#24615;&#65292;&#37027;&#20040;&#23601;&#24212;&#35813;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#22374;&#29575;&#30340;&#35828;&#20986;&#26469;&#12290;&#22914;&#26524;&#23458;&#25143;&#24076;&#26395;&#20445;&#25345;&#21311;&#21517;&#65292;&#23454;&#36341;&#20013;&#36825;&#31181;&#24773;&#20917;&#24456;&#22810;&#65292;&#33267;&#23569;&#35201;&#35810;&#38382;&#19968;&#19979;&#23458;&#25143;&#26159;&#21542;&#24895;&#24847;&#20197;&#26410;&#21629;&#21517;&#30340;&#26041;&#24335;&#20351;&#29992;&#20182;&#20204;&#30340;&#23454;&#20363;&#12290;&#24320;&#21457;&#31038;&#21306;&#23545;&#20110;&#20320;&#20026;&#20160;&#20040;&#36825;&#26679;&#20570;&#30340;<span class="emphasis"><em>&#21407;&#22240;</em></span>&#20102;&#35299;&#36234;&#22810;&#65292;&#23601;&#20250;&#23545;&#20320;&#25552;&#35758;&#30340;&#20107;&#24773;&#36234;&#24863;&#21040;&#33298;&#26381;&#12290;</p><p>&#36825;&#19982;&#30452;&#35273;&#32972;&#36947;&#32780;&#39536;&#8212;&#24471;&#21040;&#23481;&#26131;&#29993;&#25481;&#38590;&#8212;&#30693;&#35782;&#23601;&#26159;&#21147;&#37327;&#65292;&#20320;&#30340;&#30446;&#26631;&#21035;&#20154;&#30693;&#36947;&#30340;&#36234;&#22810;&#65292;&#20182;&#20204;&#23601;&#36234;&#26377;&#21487;&#33021;&#36229;&#36234;&#20320;&#30340;&#25511;&#21046;&#33021;&#21147;&#12290;&#20294;&#26159;&#37027;&#31181;&#30452;&#35273;&#22312;&#36825;&#37324;&#24182;&#27809;&#26377;&#38169;&#12290;&#36890;&#36807;&#20844;&#24320;&#25903;&#25345;&#36825;&#20010;&#29305;&#24615;&#65288;&#25110;&#26159;bug&#20462;&#27491;&#25110;&#20854;&#20182;&#20219;&#20309;&#19996;&#35199;&#65289;&#65292;&#20320;<span class="emphasis"><em>&#24050;&#32463;</em></span>&#20142;&#20986;&#20102;&#24213;&#29260;&#12290;&#29616;&#22312;&#21807;&#19968;&#30340;&#38382;&#39064;&#26159;&#20320;&#33021;&#21542;&#25104;&#21151;&#30340;&#24341;&#23548;&#31038;&#21306;&#26469;&#20998;&#20139;&#20320;&#30340;&#30446;&#26631;&#12290;&#22914;&#26524;&#20320;&#20165;&#20165;&#26159;&#34920;&#26126;&#20320;&#38656;&#35201;&#23427;&#65292;&#32780;&#19981;&#33021;&#25552;&#20379;&#20219;&#20309;&#34920;&#26126;&#21407;&#22240;&#30340;&#20999;&#23454;&#20363;&#23376;&#65292;&#20320;&#30340;&#35770;&#28857;&#23601;&#20250;&#24456;&#33030;&#24369;&#65292;&#32780;&#20154;&#20204;&#20250;&#24320;&#22987;&#29468;&#30097;&#20854;&#38544;&#34255;&#30340;&#21160;&#26426;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;&#33021;&#22815;&#25552;&#20379;&#29616;&#23454;&#30340;&#22330;&#26223;&#26469;&#23637;&#31034;&#20026;&#20160;&#20040;&#25552;&#35758;&#30340;&#29305;&#24615;&#26159;&#37325;&#35201;&#30340;&#65292;&#23601;&#21487;&#20197;&#26377;&#21147;&#30340;&#24433;&#21709;&#36777;&#35770;&#30340;&#25928;&#26524;&#12290;</p><p>&#20026;&#20102;&#30475;&#28165;&#26970;&#36825;&#26679;&#20570;&#20026;&#20160;&#20040;&#26377;&#25928;&#65292;&#32771;&#34385;&#21478;&#22806;&#19968;&#31181;&#36873;&#25321;&#12290;&#20851;&#20110;&#26032;&#29305;&#24615;&#25110;&#26032;&#26041;&#21521;&#30340;&#35752;&#35770;&#20250;&#38750;&#24120;&#32791;&#26102;&#21644;&#28902;&#20154;&#12290;&#20154;&#20204;&#25552;&#20986;&#30340;&#35770;&#28857;&#32463;&#24120;&#20250;&#21464;&#25104;&#8220;&#25105;&#20010;&#20154;&#24076;&#26395;X&#65292;&#8221;&#25110;&#26366;&#32463;&#27969;&#34892;&#30340;&#8220;&#26681;&#25454;&#25105;&#22810;&#24180;&#20316;&#20026;&#36719;&#20214;&#35774;&#35745;&#24072;&#30340;&#32463;&#39564;&#65292;&#23545;&#29992;&#25143;&#26469;&#35828;&#65292;X&#26159;&#26497;&#31471;&#37325;&#35201;&#30340;/&#19968;&#20010;&#26080;&#29992;&#30340;&#33457;&#36793;&#21151;&#33021;&#19981;&#20250;&#35753;&#20219;&#20309;&#20154;&#28385;&#24847;&#12290;&#8221;&#21487;&#20197;&#39044;&#26009;&#21040;&#65292;&#29616;&#23454;&#29992;&#20363;&#30340;&#32570;&#20047;&#19981;&#20165;&#19981;&#20250;&#32553;&#30701;&#25110;&#32531;&#21644;&#36825;&#31181;&#36777;&#35770;&#65292;&#32780;&#20250;&#25199;&#24471;&#31163;&#23454;&#38469;&#29992;&#25143;&#20307;&#39564;&#36234;&#26469;&#36234;&#36828;&#12290;&#22914;&#26524;&#27809;&#26377;&#19968;&#20123;&#22686;&#34917;&#30340;&#21147;&#37327;&#65292;&#37027;&#20040;&#26368;&#32456;&#30340;&#32467;&#26524;&#24456;&#21487;&#33021;&#38656;&#35201;&#30001;&#21475;&#25165;&#26368;&#22909;&#12289;&#22362;&#25345;&#26368;&#20037;&#25110;&#22320;&#20301;&#26368;&#39640;&#30340;&#20154;&#20915;&#23450;&#12290;</p><p>&#23545;&#20110;&#26377;&#35768;&#22810;&#23458;&#25143;&#25968;&#25454;&#30340;&#32452;&#32455;&#65292;&#20320;&#26377;&#26426;&#20250;&#25552;&#20379;&#36825;&#31181;&#22686;&#34917;&#30340;&#21147;&#37327;&#12290;&#20320;&#21487;&#20197;&#20316;&#20026;&#26080;&#27861;&#36798;&#21040;&#24320;&#21457;&#32773;&#31038;&#21306;&#30340;&#25968;&#25454;&#30340;&#20449;&#24687;&#31649;&#36947;&#12290;&#19981;&#24517;&#22240;&#20026;&#37027;&#20123;&#25903;&#25345;&#20320;&#24895;&#26395;&#30340;&#20449;&#24687;&#20107;&#23454;&#32780;&#24863;&#21040;&#31384;&#36843;&#12290;&#22823;&#22810;&#25968;&#24320;&#21457;&#32773;&#20010;&#20154;&#27809;&#26377;&#20182;&#20204;&#25152;&#20889;&#36719;&#20214;&#22914;&#20309;&#20351;&#29992;&#30340;&#24191;&#27867;&#32463;&#39564;&#12290;&#27599;&#20010;&#24320;&#21457;&#32773;&#37117;&#20250;&#25353;&#29031;&#33258;&#24049;&#30340;&#24618;&#24322;&#26041;&#24335;&#20351;&#29992;&#36719;&#20214;&#65307;&#21482;&#35201;&#26377;&#20854;&#20182;&#30340;&#20351;&#29992;&#27169;&#24335;&#65292;&#22905;&#23601;&#20250;&#20973;&#30452;&#35273;&#24182;&#33222;&#26029;&#20043;&#65292;&#32780;&#19988;&#20107;&#23454;&#19978;&#65292;&#22905;&#20204;&#30693;&#36947;&#36825;&#19968;&#28857;&#12290;&#36890;&#36807;&#25552;&#20379;&#21253;&#21547;&#21487;&#35266;&#29992;&#25143;&#25968;&#37327;&#30340;&#21487;&#20449;&#25968;&#25454;&#65292;&#20320;&#23601;&#35937;&#20026;&#25972;&#20010;&#20844;&#20849;&#24320;&#21457;&#31038;&#21306;&#25552;&#20379;&#20102;&#27687;&#27668;&#12290;&#21482;&#35201;&#20320;&#25552;&#20379;&#30340;&#20363;&#23376;&#26159;&#27491;&#30830;&#30340;&#65292;&#20182;&#20204;&#23601;&#20250;&#29378;&#28909;&#30340;&#27426;&#36814;&#23427;&#65292;&#23601;&#20250;&#25512;&#21160;&#20107;&#24773;&#24448;&#20320;&#24076;&#26395;&#30340;&#26041;&#21521;&#21457;&#23637;&#12290;</p><p>&#20851;&#38190;&#26159;&#25552;&#20379;&#27491;&#30830;&#30340;&#20363;&#23376;&#12290;&#19981;&#35201;&#22240;&#20026;&#20320;&#35201;&#24212;&#20184;&#22823;&#37327;&#38656;&#35201;&#26576;&#29305;&#24615;&#65288;&#25110;&#20197;&#20026;&#20182;&#20204;&#38656;&#35201;&#65289;&#30340;&#29992;&#25143;&#65292;&#23601;&#22362;&#20915;&#35201;&#27714;&#20320;&#30340;&#29305;&#24615;&#65292;&#20063;&#23601;&#26159;&#20320;&#30340;&#35299;&#20915;&#26041;&#26696;&#24517;&#39035;&#23454;&#29616;&#12290;&#30456;&#21453;&#65292;&#20320;&#24517;&#39035;&#23558;&#20320;&#26368;&#21021;&#30340;&#24086;&#23376;&#20851;&#27880;&#20110;&#38382;&#39064;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#29305;&#23450;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#35814;&#32454;&#25551;&#36848;&#20320;&#30340;&#23458;&#25143;&#36935;&#21040;&#38382;&#39064;&#30340;&#32454;&#33410;&#65292;&#23613;&#21487;&#33021;&#25552;&#20379;&#20320;&#24050;&#32463;&#23436;&#25104;&#30340;&#20998;&#26512;&#65292;&#20197;&#21450;&#20320;&#33021;&#24819;&#21040;&#30340;&#21487;&#34892;&#24615;&#26041;&#26696;&#12290;&#24403;&#20154;&#20204;&#24320;&#22987;&#32771;&#34385;&#19981;&#21516;&#26041;&#26696;&#30340;&#25928;&#26524;&#26102;&#65292;&#20320;&#21487;&#20197;&#32487;&#32493;&#36890;&#36807;&#25552;&#20379;&#25968;&#25454;&#26469;&#25903;&#25345;&#25110;&#21453;&#23545;&#22905;&#20204;&#30340;&#24847;&#35265;&#12290;&#20320;&#22312;&#24515;&#37324;&#21487;&#20197;&#26377;&#19968;&#20010;&#29305;&#23450;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#26159;&#19981;&#35201;&#22312;&#24320;&#22987;&#21333;&#29420;&#25552;&#20986;&#26469;&#20197;&#26399;&#26395;&#33719;&#24471;&#29305;&#27530;&#30340;&#32771;&#34385;&#12290;&#36825;&#19981;&#26159;&#27450;&#39575;&#65292;&#36825;&#21482;&#26159;&#26631;&#20934;&#30340;&#8220;&#35802;&#23454;&#20195;&#29702;&#20154;&#8221;&#30340;&#34892;&#20026;&#12290;&#27605;&#31455;&#65292;&#20320;&#30340;&#30495;&#27491;&#30446;&#26631;&#26159;&#35299;&#20915;&#38382;&#39064;&#65307;&#19968;&#20010;&#35299;&#20915;&#26041;&#26696;&#21482;&#26159;&#36798;&#21040;&#30446;&#26631;&#30340;&#19968;&#31181;&#26041;&#27861;&#12290;&#22914;&#26524;&#20320;&#36873;&#20013;&#30340;&#35299;&#20915;&#26041;&#26696;&#30830;&#23454;&#26356;&#22909;&#65292;&#20854;&#20182;&#24320;&#21457;&#32773;&#26368;&#32456;&#20250;&#35782;&#21035;&#20986;&#26469;&#8212;&#22905;&#20204;&#20250;&#20986;&#20110;&#33258;&#24895;&#30340;&#36319;&#36827;&#65292;&#32943;&#23450;&#27604;&#20320;&#36890;&#36807;&#23041;&#36924;&#22905;&#20204;&#23454;&#29616;&#26356;&#22909;&#12290; &#65288;&#24403;&#28982;&#65292;&#20063;&#26377;&#21487;&#33021;&#22905;&#20204;&#25214;&#21040;&#20102;&#26356;&#22909;&#30340;&#26041;&#26696;&#12290;&#65289;</p><p>&#36825;&#19981;&#26159;&#35828;&#20320;&#19981;&#33021;&#35828;&#20986;&#20320;&#30475;&#22909;&#26576;&#20010;&#26041;&#26696;&#12290;&#20294;&#26159;&#20320;&#24517;&#39035;&#32784;&#24515;&#30340;&#26597;&#30475;&#20320;&#25152;&#20570;&#30340;&#20998;&#26512;&#21453;&#22797;&#25104;&#20026;&#20844;&#20849;&#24320;&#21457;&#21015;&#34920;&#30340;&#20013;&#24515;&#12290;&#19981;&#35201;&#22312;&#21015;&#34920;&#20013;&#35828;&#8220;&#26159;&#30340;&#65292;&#25105;&#20204;&#35797;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#20294;&#26159;&#22240;&#20026;&#21407;&#22240;A&#12289;B&#21644;C&#65292;&#23427;&#26159;&#34892;&#19981;&#36890;&#30340;&#12290;&#24403;&#20320;&#24443;&#24213;&#20102;&#35299;&#23427;&#21518;&#65292;&#35299;&#20915;&#23427;&#30340;&#21807;&#19968;&#21150;&#27861;&#26159;...&#8221;&#38382;&#39064;&#19981;&#26159;&#23427;&#21548;&#36215;&#26469;&#24456;&#20658;&#24930;&#65292;&#32780;&#26159;&#35753;&#20154;&#35273;&#24471;&#20320;&#23545;&#27492;&#38382;&#39064;<span class="emphasis"><em>&#24050;&#32463;</em></span>&#30740;&#31350;&#20102;&#35768;&#22810;&#26410;&#30693;&#30340;&#65288;&#20294;&#26159;&#65292;&#20154;&#20204;&#20250;&#20551;&#35774;&#26377;&#24456;&#22810;&#65289;&#20998;&#26512;&#36164;&#28304;&#65292;&#21482;&#26159;&#19968;&#20999;&#37117;&#22312;&#38376;&#21518;&#38754;&#12290;&#23427;&#35753;&#20154;&#35273;&#25237;&#20837;&#30340;&#31934;&#21147;&#30333;&#36153;&#20102;&#65292;&#25110;&#35768;&#24050;&#32463;&#20570;&#20986;&#20102;&#20915;&#23450;&#65292;&#32780;&#20844;&#20247;&#37117;&#19981;&#26159;&#26377;&#21033;&#23475;&#20851;&#31995;&#30340;&#20154;&#65292;&#36825;&#26159;&#25307;&#33268;&#24616;&#24680;&#30340;&#22909;&#26041;&#27861;&#12290;</p><p>&#33258;&#28982;&#65292;<span class="emphasis"><em>&#20320;</em></span>&#30693;&#36947;&#20320;&#33258;&#24049;&#22312;&#26576;&#20010;&#38382;&#39064;&#19978;&#25152;&#25237;&#20837;&#30340;&#21147;&#37327;&#65292;&#32780;&#36825;&#20123;&#30693;&#35782;&#20174;&#26576;&#31181;&#24847;&#20041;&#19978;&#26469;&#35828;&#26159;&#19968;&#31181;&#21155;&#21183;&#12290;&#23427;&#35753;&#20320;&#30340;&#24320;&#21457;&#32773;&#22788;&#20110;&#21644;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#20854;&#20182;&#20154;&#20123;&#35768;&#19981;&#21516;&#30340;&#24515;&#29702;&#31354;&#38388;&#65292;&#20943;&#24369;&#20102;&#24320;&#21457;&#32773;&#20174;&#37027;&#20123;&#26222;&#36890;&#20154;&#30340;&#35270;&#35282;&#30475;&#24453;&#36825;&#20010;&#38382;&#39064;&#30340;&#33021;&#21147;&#65292;&#36825;&#20123;&#26222;&#36890;&#20154;&#27809;&#26377;&#20687;&#24320;&#21457;&#32773;&#37027;&#26679;&#32771;&#34385;&#36807;&#36825;&#20010;&#38382;&#39064;&#12290;&#20320;&#36234;&#26089;&#33021;&#22815;&#35753;&#25152;&#26377;&#20154;&#29992;&#19982;&#20320;&#30456;&#21516;&#30340;&#26415;&#35821;&#32771;&#34385;&#38382;&#39064;&#65292;&#36825;&#31181;&#24046;&#36317;&#23601;&#20250;&#36234;&#23567;&#12290;&#36825;&#31181;&#36923;&#36753;&#19981;&#20165;&#36866;&#20110;&#20010;&#20154;&#25216;&#26415;&#24773;&#24418;&#65292;&#32780;&#19988;&#36866;&#29992;&#20110;&#26356;&#24191;&#27867;&#30340;&#35753;&#20320;&#30340;&#30446;&#26631;&#23613;&#21487;&#33021;&#28165;&#26224;&#30340;&#25480;&#26435;&#12290;&#26410;&#30693;&#24635;&#27604;&#24050;&#30693;&#30340;&#26356;&#19981;&#31283;&#23450;&#12290;&#22914;&#26524;&#20154;&#20204;&#29702;&#35299;&#20102;&#20026;&#20160;&#20040;&#20320;&#24076;&#26395;&#20320;&#25152;&#24076;&#26395;&#30340;&#65292;&#21363;&#20351;&#20182;&#20204;&#19981;&#35748;&#21487;&#65292;&#22312;&#19982;&#20320;&#20132;&#35848;&#26102;&#20063;&#20250;&#24863;&#21040;&#33298;&#26381;&#20123;&#12290;&#22914;&#26524;&#20182;&#20204;&#19981;&#33021;&#25351;&#20986;&#20309;&#20107;&#35753;&#20182;&#20204;&#24868;&#24594;&#65292;&#20182;&#20204;&#20250;&#20551;&#23450;&#26368;&#22351;&#30340;&#24773;&#20917;&#65292;&#33267;&#23569;&#26377;&#26102;&#20505;&#12290;</p><p>&#20320;&#19981;&#33021;&#23459;&#20256;&#25152;&#26377;&#30340;&#20107;&#24773;&#65292;&#24403;&#28982;&#65292;&#20154;&#20204;&#20063;&#19981;&#20250;&#26399;&#26395;&#20320;&#22914;&#27492;&#12290;&#25152;&#26377;&#30340;&#32452;&#32455;&#37117;&#26377;&#31192;&#23494;&#65307;&#25110;&#35768;&#20250;&#22240;&#20026;&#21033;&#30410;&#65292;&#20294;&#26159;&#27809;&#26377;&#21033;&#30410;&#20063;&#20250;&#22914;&#27492;&#12290;&#22914;&#26524;&#20320;&#24517;&#39035;&#21457;&#36215;&#36825;&#26679;&#19968;&#20010;&#36807;&#31243;&#65292;&#32780;&#26080;&#27861;&#25581;&#31034;&#20219;&#20309;&#21407;&#22240;&#65292;&#37027;&#23601;&#25552;&#20379;&#20320;&#22312;&#36825;&#31181;&#19981;&#21033;&#26465;&#20214;&#19979;&#26368;&#22909;&#30340;&#35770;&#28857;&#65292;&#24182;&#25509;&#21463;&#20320;&#23558;&#19981;&#20250;&#22312;&#35752;&#35770;&#20013;&#33719;&#24471;&#20320;&#26399;&#26395;&#24433;&#21709;&#21147;&#30340;&#21518;&#26524;&#12290;&#36825;&#26159;&#35753;&#20320;&#19981;&#24517;&#20026;&#24320;&#21457;&#31038;&#21306;&#25903;&#20184;&#34218;&#27700;&#30340;&#19968;&#20010;&#25240;&#34935;&#25163;&#27573;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="appear-as-many.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="money-vs-love.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20316;&#20026;&#19968;&#20123;&#20010;&#20307;&#20986;&#29616;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;&#25972;&#20307; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#38065;&#19981;&#33021;&#35753;&#20320;&#21487;&#29233;</td></tr></table></div></body></html>
