<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#25171;&#21253;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="prev" href="stabilizing-a-release.html" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;"><link rel="next" href="testing-and-releasing.html" title="&#27979;&#35797;&#21644;&#21457;&#24067;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#25171;&#21253;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="stabilizing-a-release.html">Prev</a> </td><th width="60%" align="center">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th><td width="20%" align="right"> <a accesskey="n" href="testing-and-releasing.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#25171;&#21253;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="packaging"></a>&#25171;&#21253;</h2></div></div></div><p>&#20998;&#21457;&#33258;&#30001;&#36719;&#20214;&#30340;&#26631;&#20934;&#24418;&#24335;&#26159;&#28304;&#20195;&#30721;&#12290;&#26080;&#35770;&#36719;&#20214;&#26159;&#21542;&#20197;&#28304;&#20195;&#30721;&#30340;&#24418;&#24335;&#65288;&#20363;&#22914;&#35299;&#37322;&#24615;&#35821;&#35328;Perl&#12289;Python&#21644;PHP&#31561;&#31561;&#65289;&#36816;&#34892;&#65292;&#36824;&#26159;&#24517;&#39035;&#39318;&#20808;&#32534;&#35793;&#65288;&#20363;&#22914;C&#12289;C++&#21644;Java&#31561;&#65289;&#65292;&#36825;&#19968;&#28857;&#26159;&#27595;&#24248;&#32622;&#30097;&#30340;&#12290;&#36890;&#36807;&#32534;&#35793;&#22909;&#30340;&#36719;&#20214;&#65292;&#22823;&#22810;&#25968;&#29992;&#25143;&#21487;&#33021;&#26080;&#38656;&#33258;&#24049;&#32534;&#35793;&#28304;&#20195;&#30721;&#65292;&#32780;&#21482;&#38656;&#23433;&#35013;&#39044;&#20808;&#32534;&#35793;&#30340;&#20108;&#36827;&#21046;&#21253;&#65288;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="packaging.html#binary-packages" title="&#20108;&#36827;&#21046;&#21253;">the section called &#8220;&#20108;&#36827;&#21046;&#21253;&#8221;</a>&#65289;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#20108;&#36827;&#21046;&#21253;&#20381;&#28982;&#26469;&#33258;&#20027;&#28304;&#20195;&#30721;&#20998;&#21457;&#21253;&#12290;&#21407;&#22240;&#26159;&#28304;&#20195;&#30721;&#21253;&#26126;&#30830;&#23450;&#20041;&#20102;&#21457;&#24067;&#29256;&#26412;&#12290;&#24403;&#39033;&#30446;&#20998;&#21457;&#8220;Scanley 2.5.0&#8221;&#26102;&#65292;&#30495;&#27491;&#30340;&#21547;&#20041;&#26159;&#8220;&#28304;&#20195;&#30721;&#25991;&#20214;&#30340;&#30446;&#24405;&#26641;&#65292;&#24403;&#32534;&#35793;&#65288;&#22914;&#26524;&#38656;&#35201;&#65289;&#21644;&#23433;&#35013;&#21518;&#23558;&#20135;&#29983;Scanley 2.5.0&#8221;&#12290;</p><p>&#23545;&#20110;&#28304;&#20195;&#30721;&#21457;&#24067;&#30340;&#24335;&#26679;&#26377;&#19968;&#20010;&#30456;&#23545;&#20005;&#26684;&#30340;&#26631;&#20934;&#12290;&#21487;&#33021;&#20250;&#26377;&#19982;&#26631;&#20934;&#30340;&#20559;&#24046;&#20986;&#29616;&#65292;&#20294;&#26159;&#37027;&#21482;&#26159;&#20363;&#22806;&#65292;&#19981;&#26159;&#35268;&#21017;&#12290;&#38500;&#38750;&#26377;&#24378;&#26377;&#21147;&#30340;&#29702;&#30001;&#65292;&#21542;&#21017;&#20320;&#30340;&#39033;&#30446;&#20063;&#24212;&#35813;&#36981;&#23432;&#36825;&#20010;&#26631;&#20934;&#12290;</p><div class="sect2" title="&#26684;&#24335;"><div class="titlepage"><div><div><h3 class="title"><a name="packaging-format"></a>&#26684;&#24335;</h3></div></div></div><p>&#28304;&#20195;&#30721;&#24517;&#39035;&#20197;&#26631;&#20934;&#26684;&#24335;&#20256;&#36755;&#30446;&#24405;&#26641;&#12290;&#23545;&#20110;Unix&#21644;&#31867;Unix&#30340;&#25805;&#20316;&#31995;&#32479;&#65292;&#20064;&#24815;&#19978;&#26159;TAR&#26684;&#24335;&#65292;&#21387;&#32553;&#20026;<span class="command"><strong>compress</strong></span>&#12289; <span class="command"><strong>gzip</strong></span>&#12289;
<span class="command"><strong>bzip</strong></span>&#25110;<span class="command"><strong>bzip2</strong></span>&#12290;&#23545;&#20110;&#24494;&#36719;Windows&#65292;&#20998;&#21457;&#30446;&#24405;&#26641;&#30340;&#26631;&#20934;&#26041;&#27861;&#26159;<em class="firstterm">zip</em>&#26684;&#24335;&#65292;&#20063;&#26159;&#21387;&#32553;&#26684;&#24335;&#65292;&#25152;&#20197;&#19981;&#24517;&#20877;&#36827;&#19968;&#27493;&#21387;&#32553;&#24402;&#26723;&#25991;&#20214;&#12290;</p><div class="sidebar" title="TAR&#25991;&#20214;"><a name="packaging-tar"></a><div class="titlepage"><div><div><p class="title"><b>TAR&#25991;&#20214;</b></p></div></div></div><p><em class="firstterm">TAR</em>&#20195;&#34920;&#20102;&#8220;Tape ARchive&#8221;&#65292;&#22240;&#20026;tar&#26684;&#24335;&#29992;&#32447;&#24615;&#25968;&#25454;&#27969;&#34920;&#31034;&#20102;&#30446;&#24405;&#26641;&#65292;&#25152;&#20197;&#38750;&#24120;&#36866;&#20110;&#23558;&#30446;&#24405;&#20445;&#23384;&#21040;&#30913;&#24102;&#12290;&#36825;&#20010;&#29305;&#24615;&#20063;&#20351;&#20043;&#25104;&#20026;&#24050;&#21333;&#20010;&#25991;&#20214;&#20998;&#21457;&#30446;&#24405;&#26641;&#30340;&#26631;&#20934;&#12290;&#29983;&#25104;&#21387;&#32553;&#30340;tar&#25991;&#20214;&#65288;<em class="firstterm">tarballs</em>&#65289;&#20063;&#38750;&#24120;&#31616;&#21333;&#12290;&#22312;&#26576;&#20123;&#31995;&#32479;&#19978;&#65292;<span class="command"><strong>tar</strong></span>&#21629;&#20196;&#21487;&#20197;&#33258;&#24049;&#20135;&#29983;&#21387;&#32553;&#24402;&#26723;&#65307;&#22312;&#21478;&#22806;&#19968;&#20123;&#31995;&#32479;&#19978;&#65292;&#21017;&#38656;&#35201;&#20351;&#29992;&#21333;&#29420;&#30340;&#21387;&#32553;&#31243;&#24207;&#12290;</p></div></div><div class="sect2" title="&#21629;&#21517;&#21644;&#24067;&#23616;"><div class="titlepage"><div><div><h3 class="title"><a name="packaging-name-and-layout"></a>&#21629;&#21517;&#21644;&#24067;&#23616;</h3></div></div></div><p>&#25171;&#21253;&#30340;&#21517;&#31216;&#24517;&#39035;&#21253;&#21547;&#36719;&#20214;&#21517;&#31216;&#21644;&#21457;&#24067;&#29256;&#26412;&#21495;&#65292;&#28982;&#21518;&#26159;&#29305;&#23450;&#24402;&#26723;&#31867;&#22411;&#30340;&#26684;&#24335;&#21518;&#32512;&#21517;&#12290;&#20363;&#22914;Scanley 2.5.0&#22312;Unix&#19978;&#20351;&#29992;GNU Zip&#65288;gzip&#65289;&#21387;&#32553;&#30340;&#21253;&#31867;&#20284;&#65306;</p><div class="informalexample"><div class="literallayout"><p>scanley-2.5.0.tar.gz</p></div></div><p>&#25110;&#32773;&#26159;&#22312;Windows&#19978;&#20351;&#29992;zip&#21387;&#32553;&#65306;</p><div class="informalexample"><div class="literallayout"><p>scanley-2.5.0.zip</p></div></div><p>&#25152;&#26377;&#30340;&#36825;&#20123;&#24402;&#26723;&#35299;&#21387;&#21518;&#65292;&#37117;&#24212;&#35813;&#33021;&#22312;&#24403;&#21069;&#30446;&#24405;&#21019;&#24314;&#19968;&#20010;&#21517;&#20026;<code class="filename">scanley-2.5.0</code>&#30340;&#21333;&#29420;&#30446;&#24405;&#12290;&#36825;&#20010;&#26032;&#30446;&#24405;&#20013;&#65292;&#25152;&#26377;&#30340;&#28304;&#20195;&#30721;&#24212;&#35813;&#26159;&#22788;&#20110;&#20934;&#22791;&#22909;&#36827;&#34892;&#32534;&#35793;&#65288;&#22914;&#26524;&#38656;&#35201;&#32534;&#35793;&#65289;&#30340;&#24067;&#23616;&#12290;&#22312;&#26032;&#30446;&#24405;&#26641;&#30340;&#26368;&#19978;&#23618;&#65292;&#24212;&#35813;&#26377;&#19968;&#20010;<code class="filename">README</code>&#25991;&#20214;&#65292;&#35299;&#37322;&#20102;&#36719;&#20214;&#26159;&#20160;&#20040;&#65292;&#21457;&#24067;&#29256;&#26412;&#26159;&#21738;&#20010;&#65292;&#24182;&#32473;&#20986;&#20102;&#20854;&#20182;&#36164;&#28304;&#30340;&#25351;&#38024;&#65292;&#20363;&#22914;&#39033;&#30446;&#31449;&#28857;&#20197;&#21450;&#20854;&#20182;&#26377;&#29992;&#30340;&#25991;&#20214;&#31561;&#12290;<code class="filename">README</code>&#26049;&#36793;&#20063;&#24212;&#35813;&#26377;&#19968;&#20010;<code class="filename">INSTALL</code>&#65292;&#35828;&#26126;&#22312;&#25152;&#26377;&#25903;&#25345;&#30340;&#25805;&#20316;&#31995;&#32479;&#19978;&#26500;&#24314;&#21644;&#23433;&#35013;&#36719;&#20214;&#30340;&#26041;&#27861;&#12290;&#23601;&#20687;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="license-quickstart.html#license-quickstart-applying" title="&#22914;&#20309;&#20026;&#20320;&#30340;&#36719;&#20214;&#24212;&#29992;&#35768;&#21487;&#35777;">the section called &#8220;&#22914;&#20309;&#20026;&#20320;&#30340;&#36719;&#20214;&#24212;&#29992;&#35768;&#21487;&#35777;&#8221;</a>&#25152;&#35828;&#26126;&#30340;&#65292;&#24212;&#35813;&#26377;<code class="filename">COPYING</code>&#25110;<code class="filename">LICENSE</code>&#65292;&#35828;&#26126;&#36719;&#20214;&#20998;&#21457;&#30340;&#26465;&#27454;&#12290;</p><p>&#20063;&#24212;&#24403;&#26377;&#19968;&#20010;<code class="filename">CHANGES</code>&#25991;&#20214;&#65288;&#26377;&#26102;&#31216;&#20026;<code class="filename">NEWS</code>&#65289;&#65292;&#35299;&#37322;&#20102;&#21457;&#24067;&#29256;&#26412;&#30340;&#26032;&#21151;&#33021;&#12290;<code class="filename">CHANGES</code>&#25991;&#20214;&#25353;&#29031;&#36870;&#21521;&#30340;&#21382;&#21490;&#39034;&#24207;&#65292;&#27719;&#38598;&#20102;&#25152;&#26377;&#21457;&#24067;&#29256;&#26412;&#30340;&#21464;&#26356;&#21015;&#34920;&#65292;&#25152;&#20197;&#26368;&#26032;&#30340;&#21457;&#24067;&#20301;&#20110;&#25991;&#20214;&#26368;&#39030;&#37096;&#12290;&#23436;&#25104;&#36825;&#20010;&#21015;&#34920;&#36890;&#24120;&#26159;&#31283;&#23450;&#21457;&#24067;&#20998;&#25903;&#30340;&#26368;&#21518;&#19968;&#39033;&#24037;&#20316;&#65307;&#19968;&#20123;&#39033;&#30446;&#20250;&#38543;&#30528;&#24320;&#21457;&#21015;&#20986;&#25152;&#26377;&#30340;&#29255;&#27573;&#65292;&#32780;&#21478;&#22806;&#19968;&#20123;&#39033;&#30446;&#26356;&#20542;&#21521;&#20110;&#22312;&#26368;&#21518;&#38454;&#27573;&#65292;&#35753;&#26576;&#20154;&#26681;&#25454;&#29256;&#26412;&#25511;&#21046;&#26085;&#24535;&#32452;&#21512;&#20449;&#24687;&#19968;&#27425;&#23436;&#25104;&#12290;&#36825;&#20010;&#21015;&#34920;&#31867;&#20284;&#19979;&#38754;&#65306;</p><pre class="screen">
Version 2.5.0
(20 December 2004, from /branches/2.5.x)
http://svn.scanley.org/repos/svn/tags/2.5.0/

 New features, enhancements:
    * Added regular expression queries (issue #53)
    * Added support for UTF-8 and UTF-16 documents
    * Documentation translated into Polish, Russian, Malagasy
    * ...

 Bugfixes:
    * fixed reindexing bug (issue #945)
    * fixed some query bugs (issues #815, #1007, #1008)
    * ...
</pre><p>&#26681;&#25454;&#20855;&#20307;&#24773;&#20917;&#65292;&#36825;&#20010;&#21015;&#34920;&#21487;&#33021;&#20250;&#24456;&#38271;&#65292;&#20294;&#26159;&#19981;&#38656;&#35201;&#21253;&#21547;&#25152;&#26377;&#30340;&#23567;bug&#20462;&#27491;&#21644;&#29305;&#24615;&#25552;&#21319;&#12290;&#23427;&#30340;&#30446;&#30340;&#20165;&#20165;&#26159;&#32473;&#29992;&#25143;&#19968;&#20010;&#21360;&#35937;&#65292;&#36890;&#36807;&#21319;&#32423;&#21040;&#26368;&#26032;&#29256;&#26412;&#23558;&#20250;&#33719;&#24471;&#21738;&#20123;&#22909;&#22788;&#12290;&#23454;&#38469;&#19978;&#65292;&#20064;&#24815;&#19978;&#20250;&#23558;&#21464;&#26356;&#21015;&#34920;&#21253;&#21547;&#22312;&#22768;&#26126;&#37038;&#20214;&#65288;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="testing-and-releasing.html" title="&#27979;&#35797;&#21644;&#21457;&#24067;">the section called &#8220;&#27979;&#35797;&#21644;&#21457;&#24067;&#8221;</a>&#65289;&#20013;&#65292;&#25152;&#20197;&#22312;&#32534;&#20889;&#26102;&#35201;&#32771;&#34385;&#20320;&#30340;&#35835;&#32773;&#12290;</p><div class="sidebar" title="CHANGES&#36824;&#26159;ChangeLog"><a name="changelog"></a><div class="titlepage"><div><div><p class="title"><b>CHANGES&#36824;&#26159;ChangeLog</b></p></div></div></div><p>&#20256;&#32479;&#19978;&#65292;&#21517;&#20026;<em class="firstterm">ChangeLog</em>&#30340;&#25991;&#20214;&#20250;&#21015;&#20986;&#39033;&#30446;&#30340;&#27599;&#20010;&#21464;&#26356;&#8212;&#20063;&#23601;&#26159;&#25552;&#20132;&#21040;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#27599;&#20010;&#20462;&#35746;&#29256;&#26412;&#12290;ChangeLog&#25991;&#20214;&#26377;&#35768;&#22810;&#31181;&#26684;&#24335;&#65307;&#20855;&#20307;&#30340;&#26684;&#24335;&#24182;&#19981;&#37325;&#35201;&#65292;&#20294;&#37117;&#38656;&#35201;&#21253;&#21547;&#30456;&#21516;&#30340;&#20449;&#24687;&#65306;&#21464;&#26356;&#30340;&#26085;&#26399;&#12289;&#20316;&#32773;&#21644;&#31616;&#20171;&#65288;&#25110;&#20165;&#20165;&#26159;&#35813;&#21464;&#26356;&#30340;&#26085;&#24535;&#20449;&#24687;&#65289;&#12290;</p><p><code class="filename">CHANGES</code>&#25991;&#20214;&#26377;&#25152;&#19981;&#21516;&#12290;&#23613;&#31649;&#23427;&#20063;&#26159;&#21464;&#26356;&#30340;&#21015;&#34920;&#65292;&#20294;&#26159;&#20165;&#24212;&#35813;&#21253;&#21547;&#23545;&#29305;&#23450;&#35835;&#32773;&#27604;&#36739;&#37325;&#35201;&#30340;&#21464;&#26356;&#65292;&#32780;&#19988;&#20934;&#30830;&#26085;&#26399;&#21644;&#20316;&#32773;&#20043;&#31867;&#30340;&#20803;&#25968;&#25454;&#20063;&#21487;&#20197;&#30465;&#30053;&#12290;&#20026;&#20102;&#36991;&#20813;&#28151;&#28102;&#65292;&#19981;&#35201;&#20351;&#29992;&#21487;&#26367;&#25442;&#30340;&#26415;&#35821;&#12290;&#19968;&#20123;&#39033;&#30446;&#20351;&#29992;&#8220;NEWS&#8221;&#32780;&#19981;&#26159;&#8220;CHANGES&#8221;&#65292;&#23613;&#31649;&#36991;&#20813;&#20102;&#19982;&#8220;ChangeLog&#8221;&#28151;&#28102;&#30340;&#21487;&#33021;&#65292;&#20294;&#21364;&#26377;&#20123;&#29992;&#35789;&#19981;&#24403;&#65292;&#22240;&#20026;&#25991;&#20214;CHANGES&#20445;&#30041;&#20102;&#25152;&#26377;&#21457;&#24067;&#29256;&#26412;&#30340;&#21464;&#26356;&#20449;&#24687;&#65292;&#25152;&#20197;&#22312;&#26368;&#39030;&#37096;&#30340;&#26032;&#38395;&#20043;&#21518;&#26159;&#35768;&#22810;&#26087;&#38395;&#12290;</p><p>&#25991;&#20214;ChangeLog&#21487;&#33021;&#20250;&#28176;&#28176;&#28040;&#22833;&#12290;&#24403;CVS&#26159;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#21807;&#19968;&#36873;&#25321;&#26102;&#20351;&#29992;&#36825;&#20010;&#25991;&#20214;&#38750;&#24120;&#37325;&#35201;&#65292;&#22240;&#20026;&#21464;&#26356;&#25968;&#25454;&#24456;&#38590;&#20174;CVS&#20013;&#33719;&#21462;&#12290;&#28982;&#32780;&#65292;&#22312;&#35768;&#22810;&#29616;&#22312;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#65292;ChangeLog&#20013;&#20445;&#23384;&#30340;&#20449;&#24687;&#21487;&#20197;&#22312;&#20219;&#24847;&#26102;&#38388;&#20174;&#29256;&#26412;&#25511;&#21046;&#29256;&#26412;&#24211;&#20013;&#33719;&#21462;&#65292;&#25152;&#20197;&#20877;&#20351;&#29992;&#19968;&#20010;&#38745;&#24577;&#25991;&#20214;&#20445;&#23384;&#36825;&#20123;&#20449;&#24687;&#21464;&#24471;&#27627;&#26080;&#24847;&#20041;&#8212;&#23454;&#38469;&#19978;&#65292;&#19981;&#20165;&#20165;&#26159;&#27627;&#26080;&#24847;&#20041;&#65292;&#22240;&#20026;ChangeLog&#20165;&#20165;&#26159;&#37325;&#22797;&#29256;&#26412;&#24211;&#24050;&#32463;&#20445;&#23384;&#30340;&#26085;&#24535;&#20449;&#24687;&#12290;</p></div><p>&#30446;&#24405;&#26641;&#20013;&#28304;&#20195;&#30721;&#30340;&#24067;&#23616;&#19982;&#39033;&#30446;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26816;&#20986;&#30340;&#28304;&#20195;&#30721;&#30340;&#24067;&#23616;&#24212;&#24403;&#30456;&#21516;&#65292;&#25110;&#32773;&#23613;&#21487;&#33021;&#30340;&#36817;&#20284;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#20250;&#26377;&#20123;&#21306;&#21035;&#65292;&#20363;&#22914;&#22240;&#20026;&#21457;&#24067;&#21253;&#20250;&#21253;&#21547;&#19968;&#20123;&#29992;&#20110;&#37197;&#32622;&#21644;&#32534;&#35793;&#65288;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="packaging.html#packaging-build-install" title="&#32534;&#35793;&#21644;&#23433;&#35013;">the section called &#8220;&#32534;&#35793;&#21644;&#23433;&#35013;&#8221;</a>&#65289;&#30340;&#29983;&#25104;&#25991;&#20214;&#65292;&#25110;&#32773;&#22240;&#20026;&#23427;&#21253;&#21547;&#20102;&#38750;&#26412;&#39033;&#30446;&#32500;&#25252;&#30340;&#65292;&#32780;&#29992;&#25143;&#19968;&#33324;&#19981;&#20250;&#25317;&#26377;&#30340;&#31532;&#19977;&#26041;&#36719;&#20214;&#65292;&#12290;&#20294;&#26159;&#65292;&#21363;&#20351;&#21457;&#24067;&#30340;&#30446;&#24405;&#26641;&#19982;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#30340;&#24320;&#21457;&#30446;&#24405;&#26641;&#23436;&#20840;&#19968;&#33268;&#65292;&#21457;&#24067;&#21253;&#26412;&#36523;&#20063;&#19981;&#24212;&#24403;&#26159;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#65288;&#35265;<a class="xref" href="vc.html#vc-vocabulary-working-copy"><em class="firstterm">&#24037;&#20316;&#25335;&#36125;&#65288;working copy&#65289;</em></a>&#65289;&#12290;&#21457;&#24067;&#29256;&#26412;&#20195;&#34920;&#20102;&#19968;&#20010;&#38745;&#24577;&#21442;&#32771;&#28857;&#8212;&#28304;&#25991;&#20214;&#29305;&#23450;&#30340;&#65292;&#19981;&#21487;&#25913;&#21464;&#30340;&#37197;&#32622;&#12290;&#22914;&#26524;&#23427;&#26159;&#24037;&#20316;&#25335;&#36125;&#65292;&#23601;&#20250;&#23384;&#22312;&#29992;&#25143;&#19981;&#23567;&#24515;&#20316;&#20986;&#26356;&#26032;&#30340;&#39118;&#38505;&#65292;&#32780;&#29992;&#25143;&#36824;&#20250;&#20197;&#20026;&#20351;&#29992;&#30340;&#26159;&#21457;&#24067;&#29256;&#26412;&#65292;&#23613;&#31649;&#23454;&#38469;&#19978;&#24050;&#32463;&#26377;&#25152;&#19981;&#21516;&#12290;</p><p>&#35831;&#29282;&#35760;&#26080;&#35770;&#25171;&#21253;&#26041;&#24335;&#22914;&#20309;&#65292;&#36825;&#20010;&#21457;&#24067;&#21253;&#24212;&#35813;&#26159;&#19968;&#26679;&#30340;&#12290;&#36825;&#20010;&#21457;&#24067;&#29256;&#26412;&#8212;&#31934;&#30830;&#30340;&#24341;&#29992;&#20102;&#26576;&#20154;&#25152;&#35828;&#30340;&#8220;Scanley 2.5.0&#8221;&#8212;&#26159;zip&#25991;&#20214;&#25110;tarball&#35299;&#21387;&#32553;&#25152;&#21019;&#24314;&#30340;&#30446;&#24405;&#26641;&#12290;&#25152;&#20197;&#39033;&#30446;&#21487;&#20197;&#25552;&#20379;&#25152;&#26377;&#36825;&#20123;&#19979;&#36733;&#65306;</p><div class="informalexample"><div class="literallayout"><p>scanley-2.5.0.tar.bz2<br>
scanley-2.5.0.tar.gz<br>
scanley-2.5.0.zip</p></div></div><p>...&#20294;&#26159;&#36890;&#36807;&#35299;&#21387;&#20182;&#20204;&#21019;&#24314;&#30340;&#28304;&#20195;&#30721;&#26641;&#24517;&#39035;&#30456;&#21516;&#12290;&#28304;&#20195;&#30721;&#26641;&#26159;&#20998;&#21457;&#29289;&#65307;&#20855;&#20307;&#30340;&#24418;&#24335;&#21482;&#26159;&#20026;&#20102;&#26041;&#20415;&#20351;&#29992;&#12290;&#28304;&#20195;&#30721;&#21253;&#20063;&#21487;&#20197;&#26377;&#20123;&#35768;&#30340;&#24046;&#24322;&#65306;&#20363;&#22914;&#65292;&#22312;Windows&#21253;&#20013;&#65292;&#25991;&#26412;&#25991;&#20214;&#24517;&#39035;&#20197;CRLF&#20316;&#20026;&#34892;&#32467;&#26463;&#31526;&#65288;&#22238;&#36710;&#21644;&#25442;&#34892;&#65289;&#65292;&#32780;Unix&#21253;&#24212;&#35813;&#20351;&#29992;LF&#12290;&#19981;&#21516;&#25805;&#20316;&#31995;&#32479;&#19979;&#22914;&#26524;&#22240;&#20026;&#32534;&#35793;&#30340;&#21407;&#22240;&#38656;&#35201;&#26377;&#19981;&#21516;&#30340;&#24067;&#23616;&#65292;&#28304;&#21253;&#30340;&#24067;&#23616;&#20063;&#21487;&#20197;&#26377;&#25152;&#19981;&#21516;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#37117;&#26159;&#20123;&#26080;&#20851;&#32039;&#35201;&#30340;&#21464;&#24418;&#12290;&#21516;&#19968;&#21457;&#24067;&#29256;&#26412;&#19981;&#21516;&#21253;&#30340;&#22522;&#26412;&#28304;&#20195;&#30721;&#25991;&#20214;&#24517;&#39035;&#30456;&#21516;&#12290;</p><div class="sect3" title="&#22823;&#20889;&#36824;&#26159;&#19981;&#22823;&#20889;"><div class="titlepage"><div><div><h4 class="title"><a name="release-capitalization"></a>&#22823;&#20889;&#36824;&#26159;&#19981;&#22823;&#20889;</h4></div></div></div><p>&#24403;&#36890;&#36807;&#21517;&#31216;&#24341;&#29992;&#19968;&#20010;&#39033;&#30446;&#26102;&#65292;&#20154;&#20204;&#36890;&#24120;&#20250;&#20197;&#27491;&#24120;&#30340;&#21517;&#35789;&#36827;&#34892;&#22823;&#20889;&#65292;&#22914;&#26524;&#26159;&#32553;&#30053;&#35789;&#21017;&#20063;&#35201;&#22823;&#20889;&#65306;&#8221;MySQL5.0&#8220;&#65292;&#8221;Scanley2.5.0&#8220;&#31561;&#31561;&#12290;&#26159;&#21542;&#22312;&#21253;&#21517;&#19978;&#22823;&#20889;&#20063;&#21462;&#20915;&#20110;&#39033;&#30446;&#12290;&#20363;&#22914;&#65292;<code class="filename">Scanley-2.5.0.tar.gz</code>&#25110;<code class="filename">scanley-2.5.0.tar.gz</code>&#37117;&#21487;&#20197;&#65288;&#25105;&#20010;&#20154;&#20542;&#21521;&#20110;&#21518;&#32773;&#65292;&#22240;&#20026;&#25105;&#19981;&#21916;&#27426;&#35753;&#20154;&#21435;&#25353;shift&#38190;&#65292;&#19981;&#36807;&#24456;&#22810;&#39033;&#30446;&#20351;&#29992;&#26377;&#22823;&#20889;&#30340;&#21253;&#65289;&#12290;&#37325;&#35201;&#30340;&#26159;&#35299;&#21387;tarball&#24471;&#21040;&#30340;&#30446;&#24405;&#20351;&#29992;&#30456;&#21516;&#30340;&#22823;&#23567;&#20889;&#12290;&#19981;&#24212;&#35813;&#26377;&#20160;&#20040;&#24847;&#22806;&#65306;&#29992;&#25143;&#24635;&#26159;&#39044;&#35745;&#35299;&#21387;&#24471;&#21040;&#30340;&#30446;&#24405;&#20250;&#21644;&#21387;&#32553;&#21253;&#20351;&#29992;&#30456;&#21516;&#30340;&#21517;&#31216;&#12290;</p></div><div class="sect3" title="&#39044;&#21457;&#24067;"><div class="titlepage"><div><div><h4 class="title"><a name="release-prereleases"></a>&#39044;&#21457;&#24067;</h4></div></div></div><p>&#24403;&#21457;&#36865;&#39044;&#21457;&#24067;&#25110;&#20505;&#36873;&#21457;&#24067;&#26102;&#65292;&#21512;&#26684;&#32773;&#25104;&#20026;&#21457;&#24067;&#21495;&#30721;&#30340;&#19968;&#37096;&#20998;&#65292;&#25152;&#20197;&#22312;&#21253;&#30340;&#21517;&#31216;&#20013;&#35201;&#21253;&#21547;&#36825;&#20010;&#21517;&#23383;&#12290;&#20363;&#22914;&#65292;&#22312;&#20043;&#21069;<a class="xref" href="development-cycle.html#release-number-components" title="&#29256;&#26412;&#21495;&#32452;&#25104;&#37096;&#20998;">the section called &#8220;&#29256;&#26412;&#21495;&#32452;&#25104;&#37096;&#20998;&#8221;</a>&#25552;&#21040;&#30340;alpha&#21644;beta&#31995;&#21015;&#30340;&#21457;&#24067;&#21253;&#21517;&#31216;&#20026;&#65306;</p><div class="informalexample"><div class="literallayout"><p>scanley-2.3.0-alpha1.tar.gz<br>
scanley-2.3.0-alpha2.tar.gz<br>
scanley-2.3.0-beta1.tar.gz<br>
scanley-2.3.0-beta2.tar.gz<br>
scanley-2.3.0-beta3.tar.gz<br>
scanley-2.3.0.tar.gz</p></div></div><p>&#31532;&#19968;&#20010;&#35299;&#21387;&#21518;&#36827;&#20837;&#30446;&#24405;<code class="filename">scanley-2.3.0-alpha1</code>&#65292;&#31532;&#20108;&#20010;&#26159;<code class="filename">scanley-2.3.0-alpha2</code>&#65292;&#20197;&#27492;&#31867;&#25512;&#12290;</p></div></div><div class="sect2" title="&#32534;&#35793;&#21644;&#23433;&#35013;"><div class="titlepage"><div><div><h3 class="title"><a name="packaging-build-install"></a>&#32534;&#35793;&#21644;&#23433;&#35013;</h3></div></div></div><p>&#23545;&#20110;&#38656;&#35201;&#20174;&#28304;&#20195;&#30721;&#32534;&#35793;&#30340;&#23433;&#35013;&#30340;&#36719;&#20214;&#65292;&#26377;&#35768;&#22810;&#32463;&#39564;&#20016;&#23500;&#30340;&#29992;&#25143;&#24076;&#26395;&#33021;&#22815;&#36981;&#24490;&#30340;&#26631;&#20934;&#27493;&#39588;&#12290;&#20363;&#22914;&#65292;&#20197;C&#12289;C++&#25110;&#29305;&#23450;&#20854;&#20182;&#32534;&#35793;&#35821;&#35328;&#32534;&#20889;&#30340;&#31243;&#24207;&#65292;&#22312;&#31867;Unix&#31995;&#32479;&#19979;&#30340;&#26631;&#20934;&#26159;&#36755;&#20837;&#65306;</p><pre class="screen">
   $ ./configure
   $ make
   # make install
</pre><p>&#31532;&#19968;&#20010;&#21629;&#20196;&#33258;&#21160;&#26816;&#27979;&#26500;&#24314;&#36807;&#31243;&#20013;&#38656;&#35201;&#30340;&#29615;&#22659;&#65292;&#31532;&#20108;&#20010;&#21629;&#20196;&#22312;&#21407;&#22320;&#26500;&#24314;&#36719;&#20214;&#65288;&#20294;&#19981;&#23433;&#35013;&#65289;&#65292;&#26368;&#21518;&#19968;&#20010;&#21629;&#20196;&#26159;&#22312;&#31995;&#32479;&#19978;&#23433;&#35013;&#12290;&#21069;&#20004;&#20010;&#21629;&#20196;&#20316;&#20026;&#26222;&#36890;&#29992;&#25143;&#25191;&#34892;&#65292;&#32780;&#31532;&#19977;&#20010;&#20197;root&#29992;&#25143;&#12290;&#35774;&#32622;&#31995;&#32479;&#30340;&#35814;&#32454;&#20449;&#24687;&#21487;&#20197;&#30475;Vaughan&#12289;Elliston&#12289;Tromey&#21644;Taylor&#32534;&#20889;&#30340;&#20248;&#31168;&#22270;&#20070;<em class="citetitle">GNU Autoconf, Automake, and Libtool</em>&#12290;&#23427;&#20316;&#20026;New Riders&#30340;treeware&#21457;&#24067;&#65292;&#20869;&#23481;&#20063;&#21487;&#20197;&#22312;&#32593;&#19978;<a class="ulink" href="http://sources.redhat.com/autobook/" target="_top">http://sources.redhat.com/autobook/</a>&#20813;&#36153;&#24471;&#21040;&#12290;</p><p>&#36825;&#19981;&#26159;&#21807;&#19968;&#30340;&#26631;&#20934;&#65292;&#21482;&#26159;&#20256;&#25773;&#26368;&#24191;&#27867;&#30340;&#19968;&#20010;&#12290;Ant&#65288;<a class="ulink" href="http://ant.apache.org/" target="_top">http://ant.apache.org/</a>&#65289;&#26500;&#24314;&#31995;&#32479;&#20063;&#28176;&#28176;&#27969;&#34892;&#65292;&#29305;&#21035;&#26159;Java&#32534;&#20889;&#30340;&#39033;&#30446;&#65292;&#23427;&#25317;&#26377;&#33258;&#24049;&#30340;&#26500;&#24314;&#21644;&#23433;&#35013;&#30340;&#26631;&#20934;&#27493;&#39588;&#12290;&#21478;&#22806;&#65292;&#29305;&#23450;&#30340;&#32534;&#31243;&#35821;&#35328;&#65292;&#20363;&#22914;Perl&#21644;Python&#37117;&#26377;&#22823;&#22810;&#25968;&#20351;&#29992;&#36825;&#20123;&#35821;&#35328;&#25152;&#25512;&#33616;&#30340;&#30456;&#21516;&#26041;&#27861;&#65288;&#20363;&#22914;Perl&#27169;&#22359;&#20351;&#29992;&#21629;&#20196;<span class="command"><strong>perl Makefile.pl</strong></span>&#65289;&#12290;&#22914;&#26524;&#19981;&#26159;&#28165;&#26970;&#36866;&#24212;&#20110;&#39033;&#30446;&#30340;&#26631;&#20934;&#65292;&#21487;&#20197;&#35810;&#38382;&#36164;&#28145;&#30340;&#24320;&#21457;&#32773;&#65307;&#20320;&#21487;&#20197;&#23433;&#20840;&#30340;&#20551;&#23450;<span class="emphasis"><em>&#26576;&#20123;</em></span>&#26631;&#20934;&#26356;&#21152;&#21512;&#36866;&#65292;&#21363;&#20351;&#19968;&#24320;&#22987;&#24182;&#19981;&#28165;&#26970;&#26159;&#20160;&#20040;&#12290;</p><p>&#26080;&#35770;&#20320;&#30340;&#39033;&#30446;&#36866;&#21512;&#21738;&#20010;&#26631;&#20934;&#65292;&#21017;&#22914;&#38750;&#24517;&#35201;&#19968;&#23450;&#19981;&#33021;&#19982;&#20043;&#20559;&#31163;&#12290;&#26631;&#20934;&#23433;&#35013;&#36807;&#31243;&#23545;&#20110;&#35768;&#22810;&#31995;&#32479;&#31649;&#29702;&#21592;&#24050;&#32463;&#25104;&#20026;&#26465;&#20214;&#21453;&#23556;&#12290;&#22914;&#26524;&#22312;&#20320;&#30340;&#39033;&#30446;<code class="filename">INSTALL</code>&#25991;&#20214;&#20013;&#30475;&#21040;&#20102;&#29087;&#24713;&#30340;&#23454;&#26045;&#27493;&#39588;&#65292;&#20182;&#20204;&#23601;&#20250;&#35748;&#35782;&#21040;&#20320;&#30340;&#39033;&#30446;&#36981;&#23432;&#20102;&#19968;&#33324;&#30340;&#20064;&#24815;&#65292;&#20063;&#23601;&#20250;&#36731;&#26494;&#30340;&#23436;&#25104;&#20854;&#20182;&#30340;&#20107;&#24773;&#12290;&#21478;&#22806;&#65292;&#23601;&#20687;&#22312;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="getting-started.html#downloads" title="&#19979;&#36733;">the section called &#8220;&#19979;&#36733;&#8221;</a>&#20013;&#35752;&#35770;&#30340;&#65292;&#25317;&#26377;&#26631;&#20934;&#30340;&#26500;&#24314;&#31243;&#24207;&#21487;&#20197;&#35753;&#28508;&#22312;&#30340;&#24320;&#21457;&#32773;&#28385;&#24847;&#12290;</p><p>&#22312;Windows&#20013;&#65292;&#26500;&#24314;&#21644;&#23433;&#35013;&#30340;&#26631;&#20934;&#27604;&#36739;&#34180;&#24369;&#12290;&#23545;&#20110;&#38656;&#35201;&#32534;&#35793;&#30340;&#39033;&#30446;&#65292;&#36890;&#24120;&#35201;&#25552;&#20379;&#19968;&#20010;&#36866;&#29992;&#20110;&#26631;&#20934;&#24494;&#36719;&#24320;&#21457;&#29615;&#22659;&#65288;Developer Studio&#12289;Visual Studio&#12289;VS.NET&#21644;MSVC++&#31561;&#31561;&#65289;&#24037;&#20316;&#31354;&#38388;/&#39033;&#30446;&#27169;&#22411;&#30340;&#30446;&#24405;&#26641;&#12290;&#21462;&#20915;&#20110;&#39033;&#30446;&#30340;&#26412;&#24615;&#65292;&#21487;&#20197;&#36890;&#36807;Cygwin&#65288;<a class="ulink" href="http://www.cygwin.com/" target="_top">http://www.cygwin.com/</a>&#65289;&#29615;&#22659;&#25552;&#20379;&#31867;Unix&#30340;&#26500;&#24314;&#36873;&#39033;&#12290;&#24403;&#28982;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;&#30340;&#35821;&#35328;&#25110;&#32534;&#31243;&#26694;&#26550;&#20351;&#29992;&#33258;&#24049;&#30340;&#26500;&#24314;&#21644;&#23433;&#35013;&#20064;&#24815;&#8212;&#20363;&#22914;Perl&#25110;Python&#8212;&#20320;&#24212;&#24403;&#20351;&#29992;&#35813;&#26694;&#26550;&#26631;&#20934;&#30340;&#26041;&#27861;&#65292;&#26080;&#35770;&#26159;Windows&#12289;Unix&#12289;Mac OS X&#25110;&#20219;&#20309;&#20854;&#20182;&#25805;&#20316;&#31995;&#32479;&#12290;</p><p>&#35201;&#20048;&#20110;&#33457;&#36153;&#39069;&#22806;&#30340;&#31934;&#21147;&#35753;&#39033;&#30446;&#36981;&#23432;&#30456;&#20851;&#30340;&#26500;&#24314;&#25110;&#23433;&#35013;&#26631;&#20934;&#12290;&#26500;&#24314;&#21644;&#23433;&#35013;&#26159;&#20999;&#20837;&#28857;&#65306;&#22914;&#26524;&#19968;&#23450;&#38656;&#35201;&#65292;&#22312;&#36825;&#20043;&#21518;&#21487;&#20197;&#26356;&#21152;&#22256;&#38590;&#65292;&#20294;&#26159;&#22914;&#26524;&#29992;&#25143;&#25110;&#24320;&#21457;&#32773;&#19968;&#24320;&#22987;&#23601;&#38656;&#35201;&#20351;&#29992;&#24847;&#24819;&#19981;&#21040;&#30340;&#27493;&#39588;&#19982;&#36719;&#20214;&#36827;&#34892;&#20132;&#20114;&#21017;&#26159;&#19968;&#31181;&#32827;&#36785;&#12290;</p></div><div class="sect2" title="&#20108;&#36827;&#21046;&#21253;"><div class="titlepage"><div><div><h3 class="title"><a name="binary-packages"></a>&#20108;&#36827;&#21046;&#21253;</h3></div></div></div><p>&#23613;&#31649;&#27491;&#24335;&#21457;&#24067;&#26159;&#28304;&#20195;&#30721;&#21253;&#65292;&#22823;&#22810;&#25968;&#29992;&#25143;&#20250;&#20174;&#20108;&#36827;&#21046;&#21253;&#23433;&#35013;&#65292;&#21487;&#20197;&#36890;&#36807;&#20182;&#20204;&#25805;&#20316;&#31995;&#32479;&#30340;&#36719;&#20214;&#20998;&#21457;&#26426;&#21046;&#24471;&#21040;&#65292;&#20063;&#21487;&#20197;&#20174;&#39033;&#30446;&#31449;&#28857;&#25110;&#31532;&#19977;&#26041;&#25163;&#24037;&#33719;&#21462;&#12290;&#36825;&#37324;&#8220;&#20108;&#36827;&#21046;&#8221;&#24182;&#19981;&#19968;&#23450;&#26159;&#8220;&#24050;&#32534;&#35793;&#8221;&#65307;&#23427;&#20165;&#20165;&#24847;&#21619;&#30528;&#19968;&#31181;&#39044;&#37197;&#32622;&#24418;&#24335;&#30340;&#21253;&#65292;&#20801;&#35768;&#29992;&#25143;&#22312;&#33258;&#24049;&#30340;&#30005;&#33041;&#19978;&#26080;&#38656;&#25191;&#34892;&#19968;&#33324;&#30340;&#22522;&#20110;&#28304;&#20195;&#30721;&#30340;&#26500;&#24314;&#21644;&#23433;&#35013;&#31243;&#24207;&#65292;&#20415;&#21487;&#20197;&#36827;&#34892;&#23433;&#35013;&#12290;&#22312;RedHat GNU/Linux&#19978;&#65292;&#36825;&#26159;RPM&#31995;&#32479;&#65307;&#22312;Debian GNU/Linux&#19978;&#65292;&#21017;&#26159;&#65288;<code class="filename">.deb</code>&#65289;&#31995;&#32479;&#65307;&#22312;MS Windows&#65292;&#36890;&#24120;&#26159;<code class="literal">.MSI</code>&#25991;&#20214;&#25110;&#33258;&#23433;&#35013;&#30340;<code class="literal">.exe</code>&#25991;&#20214;&#12290;</p><p>&#26080;&#35770;&#36825;&#20123;&#20108;&#36827;&#21046;&#21253;&#26159;&#30001;&#39033;&#30446;&#30456;&#20851;&#30340;&#20154;&#32452;&#35013;&#65292;&#36824;&#26159;&#30001;&#20851;&#31995;&#36739;&#36828;&#30340;&#31532;&#19977;&#26041;&#32452;&#35013;&#65292;&#29992;&#25143;&#37117;&#20250;<span class="emphasis"><em>&#35748;&#20026;</em></span>&#20854;&#31561;&#21516;&#20110;&#39033;&#30446;&#30340;&#23448;&#26041;&#21457;&#24067;&#29256;&#26412;&#65292;&#20250;&#26681;&#25454;&#20108;&#36827;&#21046;&#21253;&#30340;&#34892;&#20026;&#22312;&#39033;&#30446;bug&#36319;&#36394;&#31995;&#32479;&#19978;&#21457;&#36215;&#38382;&#39064;&#12290;&#22240;&#27492;&#65292;&#39033;&#30446;&#33021;&#21542;&#20026;&#25171;&#21253;&#32773;&#25552;&#20379;&#26126;&#30830;&#30340;&#25351;&#23548;&#26041;&#38024;&#23601;&#38750;&#24120;&#26377;&#24847;&#20041;&#65292;&#24212;&#35813;&#19982;&#20182;&#20204;&#26356;&#32039;&#23494;&#30340;&#21512;&#20316;&#65292;&#35748;&#35782;&#21040;&#20182;&#20204;&#26159;&#21542;&#33021;&#22815;&#28165;&#26970;&#21644;&#20934;&#30830;&#30340;&#20135;&#29983;&#36719;&#20214;&#12290;</p><p>&#25171;&#21253;&#32773;&#38656;&#35201;&#30693;&#36947;&#30340;&#20027;&#35201;&#38382;&#39064;&#26159;&#26159;&#21542;&#24212;&#24403;&#19968;&#30452;&#26681;&#25454;&#23448;&#26041;&#28304;&#20195;&#30721;&#29256;&#26412;&#21457;&#24067;&#20182;&#20204;&#30340;&#20108;&#36827;&#21046;&#21253;&#12290;&#26377;&#26102;&#65292;&#25171;&#21253;&#32773;&#20250;&#21916;&#27426;&#33719;&#21462;&#29256;&#26412;&#24211;&#36739;&#26202;&#29256;&#26412;&#30340;&#20195;&#30721;&#65292;&#25110;&#32773;&#36873;&#25321;&#22312;&#21457;&#24067;&#21518;&#21253;&#21547;&#26576;&#20010;&#21464;&#26356;&#65292;&#20174;&#32780;&#20026;&#29992;&#25143;&#25552;&#20379;&#29305;&#23450;&#30340;bug&#20462;&#27491;&#25110;&#20854;&#20182;&#25913;&#36827;&#12290;&#25171;&#21253;&#32773;&#35748;&#20026;&#36890;&#36807;&#26368;&#26032;&#30340;&#20195;&#30721;&#65292;&#20182;&#26159;&#22312;&#20026;&#29992;&#25143;&#35851;&#21033;&#30410;&#65292;&#20294;&#23454;&#38469;&#19978;&#36825;&#26679;&#20250;&#23548;&#33268;&#35768;&#22810;&#28151;&#20081;&#12290;&#39033;&#30446;&#24050;&#32463;&#20934;&#22791;&#22909;&#20102;&#25509;&#21463;&#26576;&#20010;&#21457;&#24067;&#29256;&#26412;&#20197;&#21450;trunk&#21644;&#20998;&#25903;&#19978;&#65288;&#37027;&#20123;&#25925;&#24847;&#36816;&#34892;&#26368;&#21069;&#27839;&#20195;&#30721;&#30340;&#20154;&#21457;&#29616;&#30340;&#65289;&#30340;bug&#25253;&#21578;&#12290;&#24403;&#19968;&#20010;bug&#26469;&#33258;&#36825;&#20123;&#28304;&#65292;&#22238;&#24212;&#32773;&#36890;&#24120;&#21487;&#20197;&#33021;&#30830;&#35748;bug&#22312;&#35813;&#24555;&#29031;&#20986;&#29616;&#65292;&#32780;&#19988;&#24050;&#32463;&#34987;&#20462;&#27491;&#65292;&#29992;&#25143;&#21487;&#20197;&#21319;&#32423;&#25110;&#31561;&#24453;&#19979;&#20010;&#21457;&#24067;&#12290;&#22914;&#26524;&#26159;&#19968;&#20010;&#36824;&#26410;&#30693;&#30340;bug&#65292;&#25317;&#26377;&#31934;&#30830;&#30340;&#21457;&#24067;&#29256;&#26412;&#26102;&#65292;&#37325;&#29616;&#23601;&#20250;&#27604;&#36739;&#31616;&#21333;&#65292;&#22312;&#36319;&#36394;&#31995;&#32479;&#20013;&#20063;&#27604;&#36739;&#23481;&#26131;&#20998;&#31867;&#12290;</p><p>&#39033;&#30446;&#27809;&#26377;&#20934;&#22791;&#22909;&#26681;&#25454;&#26410;&#25351;&#26126;&#23186;&#20171;&#25110;&#28151;&#34880;&#30340;&#29256;&#26412;&#25509;&#21463;bug&#25253;&#21578;&#12290;&#27492;&#31867;bug&#24456;&#38590;&#37325;&#29616;&#65307;&#21478;&#22806;&#65292;&#22240;&#20026;&#26080;&#27861;&#39044;&#26399;&#19982;&#26469;&#33258;&#21457;&#24067;&#20043;&#21518;&#24320;&#21457;&#30340;&#23396;&#31435;&#21464;&#26356;&#36827;&#34892;&#20132;&#20114;&#30340;&#32467;&#26524;&#65292;&#25152;&#20197;&#20135;&#29983;&#30340;&#19981;&#27491;&#24120;&#20063;&#19981;&#24212;&#35813;&#25104;&#20026;&#23545;&#24320;&#21457;&#32773;&#36827;&#34892;&#35892;&#36131;&#29702;&#30001;&#12290;&#25105;&#26366;&#32463;&#38750;&#24120;&#27822;&#20007;&#30340;&#28010;&#36153;&#20102;&#35768;&#22810;&#26102;&#38388;&#65292;&#22240;&#20026;&#26576;&#20010;bug&#20284;&#20046;<span class="emphasis"><em>&#28040;&#22833;&#20102;</em></span>&#65292;&#32780;&#23454;&#38469;&#19978;&#24212;&#35813;&#20986;&#29616;&#65306;&#26576;&#20154;&#36816;&#34892;&#30340;&#26159;&#36731;&#24494;&#34917;&#19969;&#30340;&#29256;&#26412;&#65292;&#22522;&#20110;&#65288;&#20294;&#19981;&#30456;&#21516;&#65289;&#23448;&#26041;&#21457;&#24067;&#29256;&#26412;&#65292;&#24403;&#39044;&#26399;&#30340;bug&#27809;&#26377;&#20986;&#29616;&#26102;&#65292;&#27599;&#20010;&#20154;&#37117;&#20250;&#23581;&#35797;&#23547;&#25214;&#21407;&#22240;&#12290;</p><p>&#22312;&#26377;&#19968;&#20123;&#24773;&#20917;&#19979;&#65292;&#25171;&#21253;&#32773;&#20063;&#30830;&#23454;&#38656;&#35201;&#22312;&#21407;&#21457;&#24067;&#22522;&#30784;&#19978;&#20570;&#20986;&#19968;&#20123;&#20462;&#25913;&#12290;&#35201;&#40723;&#21169;&#25171;&#21253;&#32773;&#21521;&#39033;&#30446;&#24320;&#21457;&#32773;&#25552;&#20986;&#36825;&#20010;&#38382;&#39064;&#65292;&#24182;&#25551;&#36848;&#20182;&#20204;&#30340;&#26041;&#26696;&#12290;&#20182;&#20204;&#21487;&#33021;&#24471;&#21040;&#35768;&#21487;&#65292;&#21363;&#20351;&#22833;&#36133;&#65292;&#20063;&#33267;&#23569;&#20250;&#35753;&#39033;&#30446;&#30693;&#36947;&#20182;&#20204;&#30340;&#30446;&#30340;&#65292;&#39033;&#30446;&#20063;&#21487;&#20197;&#20851;&#27880;&#19968;&#20123;&#19981;&#23547;&#24120;&#30340;bug&#25253;&#21578;&#12290;&#24320;&#21457;&#32773;&#21487;&#20197;&#22312;&#39033;&#30446;&#31449;&#28857;&#19978;&#35774;&#32622;&#19968;&#20010;&#20813;&#36131;&#22768;&#26126;&#65292;&#24182;&#21578;&#30693;&#25152;&#26377;&#30340;&#25171;&#21253;&#32773;&#22312;&#21512;&#36866;&#30340;&#22320;&#26041;&#25918;&#32622;&#21516;&#26679;&#30340;&#19996;&#35199;&#65292;&#36825;&#26679;&#35813;&#20108;&#36827;&#21046;&#21253;&#30340;&#29992;&#25143;&#23601;&#21487;&#20197;&#30693;&#36947;&#20182;&#20204;&#33719;&#21462;&#30340;&#19996;&#35199;&#19982;&#39033;&#30446;&#23448;&#26041;&#21457;&#24067;&#24182;&#19981;&#23436;&#20840;&#30456;&#21516;&#12290;&#36825;&#31181;&#24773;&#24418;&#24182;&#27809;&#26377;&#20219;&#20309;&#25932;&#24847;&#65292;&#20294;&#19981;&#24184;&#30340;&#26159;&#32463;&#24120;&#20250;&#26377;&#36825;&#31181;&#32467;&#26524;&#12290;&#25171;&#21253;&#32773;&#19982;&#39033;&#30446;&#24320;&#21457;&#32773;&#26377;&#20123;&#19981;&#22826;&#19968;&#26679;&#30340;&#30446;&#26631;&#12290;&#25171;&#21253;&#32773;&#20027;&#35201;&#24076;&#26395;&#20026;&#29992;&#25143;&#25552;&#20379;&#26368;&#20339;&#30340;&#24320;&#31665;&#21363;&#29992;&#20307;&#39564;&#12290;&#24320;&#21457;&#32773;&#20063;&#24076;&#26395;&#22914;&#27492;&#65292;&#20294;&#20182;&#20204;&#20063;&#38656;&#35201;&#30830;&#20445;&#33258;&#24049;&#30693;&#36947;&#21035;&#20154;&#25152;&#29992;&#36719;&#20214;&#30340;&#29256;&#26412;&#65292;&#36825;&#26679;&#21487;&#20197;&#33719;&#21462;&#21040;&#19968;&#33268;&#30340;bug&#25253;&#21578;&#65292;&#24182;&#20316;&#20986;&#20860;&#23481;&#24615;&#30340;&#20445;&#35777;&#12290;&#26377;&#26102;&#36825;&#20123;&#30446;&#26631;&#20250;&#26377;&#20914;&#31361;&#12290;&#24403;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#26102;&#65292;&#38656;&#35201;&#29282;&#35760;&#39033;&#30446;&#26080;&#27861;&#25511;&#21046;&#25171;&#21253;&#32773;&#65292;&#20004;&#31181;&#26041;&#24335;&#37117;&#25215;&#25285;&#20102;&#21508;&#33258;&#30340;&#20041;&#21153;&#12290;&#35802;&#28982;&#39033;&#30446;&#36890;&#36807;&#20135;&#29983;&#36719;&#20214;&#20026;&#25171;&#21253;&#32773;&#25552;&#20379;&#20102;&#26381;&#21153;&#12290;&#20294;&#26159;&#25171;&#21253;&#32773;&#20063;&#26159;&#22312;&#20026;&#39033;&#30446;&#26381;&#21153;&#65292;&#36890;&#36807;&#25552;&#20379;&#36825;&#31181;&#21333;&#35843;&#30340;&#24037;&#20316;&#35753;&#36719;&#20214;&#26356;&#24191;&#27867;&#30340;&#20256;&#25773;&#12290;&#24403;&#28982;&#21487;&#20197;&#19981;&#35748;&#21487;&#25171;&#21253;&#32773;&#65292;&#20294;&#26159;&#19981;&#35201;&#36801;&#24594;&#20110;&#20182;&#20204;&#65307;&#21482;&#38656;&#35201;&#23613;&#33258;&#24049;&#30340;&#21487;&#33021;&#23558;&#24037;&#20316;&#20570;&#22909;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="stabilizing-a-release.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="testing-and-releasing.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#31283;&#23450;&#21457;&#24067;&#29256;&#26412; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#27979;&#35797;&#21644;&#21457;&#24067;</td></tr></table></div></body></html>
