<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#19987;&#21033;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;"><link rel="prev" href="dual-licensing.html" title="&#21452;&#35768;&#21487;&#35777;&#27169;&#24335;"><link rel="next" href="licensing-further-resources.html" title="&#28145;&#20837;&#36164;&#28304;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#19987;&#21033;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="dual-licensing.html">Prev</a> </td><th width="60%" align="center">Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</th><td width="20%" align="right"> <a accesskey="n" href="licensing-further-resources.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#19987;&#21033;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="patents"></a>&#19987;&#21033;</h2></div></div></div><p>&#36719;&#20214;&#19987;&#21033;&#29616;&#22312;&#26159;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#20013;&#30340;&#19968;&#20010;&#36991;&#38647;&#38024;&#38382;&#39064;&#65292;&#22240;&#20026;&#20182;&#20204;&#35774;&#32622;&#20102;&#33258;&#30001;&#36719;&#20214;&#26080;&#27861;&#38450;&#24481;&#30340;&#30495;&#27491;&#23041;&#32961;&#12290;&#29256;&#26435;&#21644;&#21830;&#26631;&#38382;&#39064;&#19968;&#30452;&#21487;&#20197;&#32469;&#24320;&#12290;&#22914;&#26524;&#20320;&#30340;&#37096;&#20998;&#20195;&#30721;&#30475;&#36215;&#26469;&#20405;&#23475;&#20102;&#26576;&#20154;&#30340;&#29256;&#26435;&#65292;&#20320;&#21482;&#38656;&#35201;&#37325;&#20889;&#35813;&#37096;&#20998;&#12290;&#22914;&#26524;&#26576;&#20154;&#25317;&#26377;&#20320;&#30340;&#39033;&#30446;&#21517;&#31216;&#30340;&#21830;&#26631;&#65292;&#26368;&#22351;&#20063;&#23601;&#26159;&#23558;&#39033;&#30446;&#25913;&#21517;&#12290;&#23613;&#31649;&#25913;&#21517;&#26159;&#19968;&#31181;&#26242;&#26102;&#30340;&#19981;&#20415;&#65292;&#20294;&#38271;&#26399;&#26469;&#35762;&#38382;&#39064;&#19981;&#22823;&#65292;&#22240;&#20026;&#20195;&#30721;&#20381;&#28982;&#21457;&#25381;&#30528;&#24212;&#26377;&#30340;&#20316;&#29992;&#12290;</p><p>&#20294;&#26159;&#19987;&#21033;&#21017;&#26159;&#38024;&#23545;&#23454;&#29616;&#29305;&#23450;&#24605;&#24819;&#30340;&#23436;&#20840;&#31105;&#20196;&#12290;&#26080;&#35770;&#35841;&#32534;&#20889;&#30340;&#20195;&#30721;&#65292;&#26080;&#35770;&#20351;&#29992;&#20102;&#20160;&#20040;&#32534;&#31243;&#35821;&#35328;&#12290;&#19968;&#26086;&#26576;&#20154;&#25351;&#25511;&#26576;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20405;&#23475;&#20102;&#19987;&#21033;&#65292;&#36825;&#20010;&#39033;&#30446;&#24517;&#39035;&#20572;&#27490;&#23454;&#29616;&#26576;&#20010;&#29305;&#23450;&#29305;&#24615;&#65292;&#25110;&#32773;&#38754;&#23545;&#26114;&#36149;&#21644;&#36153;&#26102;&#30340;&#27861;&#24459;&#35785;&#35772;&#12290;&#22240;&#20026;&#36825;&#31181;&#27861;&#24459;&#35785;&#35772;&#30340;&#25945;&#21766;&#32773;&#36890;&#24120;&#37117;&#26159;&#26377;&#22823;&#25226;&#38046;&#31080;&#30340;&#20844;&#21496;&#8212;&#25317;&#26377;&#25250;&#20808;&#33719;&#24471;&#19987;&#21033;&#30340;&#36164;&#28304;&#21644;&#20542;&#21521;&#8212;&#22823;&#22810;&#25968;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#19981;&#33021;&#36127;&#25285;&#21518;&#19968;&#31181;&#21487;&#33021;&#65292;&#21482;&#33021;&#31435;&#21051;&#35748;&#36755;&#65292;&#21363;&#20351;&#20182;&#20204;&#35748;&#20026;&#22312;&#27861;&#24237;&#19978;&#35813;&#19987;&#21033;&#24456;&#26377;&#21487;&#33021;&#26080;&#27861;&#24378;&#21046;&#25191;&#34892;&#12290;&#20026;&#20102;&#39044;&#20808;&#36991;&#20813;&#36825;&#31181;&#24773;&#24418;&#65292;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#24517;&#39035;&#38450;&#24481;&#24615;&#30340;&#24320;&#21457;&#32534;&#30721;&#65292;&#39044;&#20808;&#36991;&#20813;&#26377;&#19987;&#21033;&#30340;&#31639;&#27861;&#65292;&#21363;&#20351;&#30693;&#36947;&#37027;&#26159;&#38024;&#23545;&#26576;&#20010;&#32534;&#31243;&#38382;&#39064;&#30340;&#26368;&#20339;&#65292;&#29978;&#33267;&#26159;&#21807;&#19968;&#21487;&#29992;&#30340;&#26041;&#27861;&#12290;<sup>[<a name="idp3215" href="#ftn.idp3215" class="footnote">31</a>]</sup></p><p>&#27665;&#24847;&#35843;&#26597;&#21644;&#20854;&#20182;&#35777;&#25454;&#26174;&#31034;&#65292;&#19981;&#20165;&#20165;&#26159;&#24320;&#28304;&#31243;&#24207;&#21592;&#30340;&#32477;&#22823;&#22810;&#25968;&#65292;&#20063;&#21253;&#25324;<span class="emphasis"><em>&#22823;&#22810;&#25968;</em></span>&#31243;&#24207;&#21592;&#35748;&#20026;&#24212;&#24403;&#23436;&#20840;&#24223;&#27490;&#36719;&#20214;&#19987;&#21033;&#12290;<sup>[<a name="idp3219" href="#ftn.idp3219" class="footnote">32</a>]</sup>&#24320;&#28304;&#31243;&#24207;&#21592;&#23481;&#26131;&#23545;&#27492;&#26377;&#26356;&#24378;&#30340;&#24863;&#21463;&#65292;&#20063;&#35768;&#20250;&#25298;&#32477;&#22312;&#19982;&#36719;&#20214;&#19987;&#21033;&#30340;&#38598;&#21512;&#25110;&#24378;&#21046;&#36807;&#20110;&#25509;&#36817;&#30340;&#39033;&#30446;&#20013;&#24037;&#20316;&#12290;&#22914;&#26524;&#20320;&#30340;&#32452;&#32455;&#25910;&#38598;&#36719;&#20214;&#19987;&#21033;&#65292;&#35831;&#20197;&#20844;&#24320;&#21644;&#19981;&#21487;&#26356;&#25913;&#30340;&#26041;&#24335;&#26126;&#30830;&#65292;&#36825;&#20123;&#19987;&#21033;&#19981;&#20250;&#24378;&#21152;&#21040;&#24320;&#28304;&#39033;&#30446;&#19978;&#65292;&#20182;&#20204;&#20165;&#29992;&#20110;&#38450;&#24481;&#26576;&#20123;&#20854;&#20182;&#32452;&#32455;&#38024;&#23545;&#20320;&#30340;&#32452;&#32455;&#30340;&#20405;&#23475;&#20107;&#20214;&#12290;&#36825;&#19981;&#20165;&#20165;&#26159;&#20570;&#27491;&#30830;&#30340;&#20107;&#24773;&#65292;&#20063;&#20107;&#20851;&#24320;&#28304;&#20844;&#20849;&#20851;&#31995;&#12290;<sup>[<a name="idp3222" href="#ftn.idp3222" class="footnote">33</a>]</sup></p><p>&#19981;&#24184;&#30340;&#26159;&#65292;&#22240;&#38450;&#24481;&#30446;&#30340;&#25910;&#38598;&#19987;&#21033;&#26159;&#19968;&#39033;&#26377;&#29702;&#24615;&#30340;&#34892;&#21160;&#12290;&#24403;&#21069;&#30340;&#19987;&#21033;&#31995;&#32479;&#65292;&#33267;&#23569;&#22312;&#32654;&#22269;&#65292;&#26412;&#36136;&#19978;&#26159;&#19968;&#22330;&#20891;&#22791;&#31454;&#36187;&#65306;&#22914;&#26524;&#20320;&#30340;&#31454;&#20105;&#32773;&#33719;&#24471;&#20102;&#22823;&#37327;&#19987;&#21033;&#65292;&#37027;&#20040;&#20320;&#26368;&#22909;&#30340;&#38450;&#24481;&#26159;&#20063;&#33719;&#21462;&#22823;&#37327;&#19987;&#21033;&#65292;&#36825;&#26679;&#22914;&#26524;&#20320;&#36935;&#21040;&#20102;&#19987;&#21033;&#20405;&#23475;&#35785;&#35772;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#31867;&#20284;&#30340;&#23041;&#32961;&#8212;&#28982;&#21518;&#21452;&#26041;&#36890;&#24120;&#20250;&#22352;&#19979;&#26469;&#24182;&#21462;&#24471;&#36328;&#35768;&#21487;&#35777;&#20132;&#26131;&#65292;&#36825;&#26679;&#21452;&#26041;&#37117;&#26080;&#38656;&#25903;&#20184;&#36153;&#29992;&#65292;&#24403;&#28982;&#65292;&#19981;&#21253;&#25324;&#20182;&#20204;&#30340;&#30693;&#35782;&#20135;&#26435;&#24459;&#24072;&#12290;</p><p>&#28982;&#32780;&#65292;&#36719;&#20214;&#19987;&#21033;&#23545;&#20110;&#33258;&#30001;&#36719;&#20214;&#30340;&#21361;&#23475;&#19981;&#20165;&#20165;&#26159;&#23545;&#20195;&#30721;&#24320;&#21457;&#30340;&#23041;&#32961;&#12290;&#36719;&#20214;&#19987;&#21033;&#40723;&#21169;&#20102;&#22266;&#20214;&#35774;&#35745;&#24072;&#20013;&#30340;&#31169;&#23494;&#27668;&#27675;&#65292;&#20182;&#20204;&#29702;&#25152;&#24403;&#28982;&#30340;&#25285;&#24515;&#22914;&#26524;&#20844;&#24067;&#20182;&#20204;&#25509;&#21475;&#30340;&#32454;&#33410;&#65292;&#23601;&#26159;&#20026;&#20854;&#30340;&#31454;&#20105;&#23545;&#25163;&#25552;&#20379;&#20102;&#25216;&#26415;&#24110;&#21161;&#65292;&#20351;&#20182;&#20204;&#21487;&#20197;&#20351;&#29992;&#19987;&#21033;&#20405;&#23475;&#35785;&#35772;&#36827;&#34892;&#25171;&#20987;&#12290;&#36825;&#19981;&#20165;&#20165;&#26159;&#29702;&#35770;&#19978;&#30340;&#21361;&#38505;&#65292;&#20363;&#22914;&#65292;&#24456;&#26126;&#26174;&#22312;&#26174;&#21345;&#24037;&#19994;&#36825;&#23384;&#22312;&#20102;&#24456;&#38271;&#26102;&#38388;&#12290;&#35768;&#22810;&#26174;&#21345;&#21046;&#36896;&#21830;&#24456;&#19981;&#24773;&#24895;&#21457;&#24067;&#35814;&#32454;&#30340;&#21487;&#20197;&#20026;&#20182;&#20204;&#30340;&#26174;&#21345;&#20135;&#20986;&#39640;&#24615;&#33021;&#24320;&#28304;&#39537;&#21160;&#30340;&#32534;&#30721;&#35268;&#33539;&#65292;&#22240;&#32780;&#20351;&#33258;&#30001;&#25805;&#20316;&#31995;&#32479;&#26080;&#27861;&#21457;&#25381;&#36825;&#20123;&#26174;&#21345;&#30340;&#20840;&#37096;&#28508;&#21147;&#12290;&#20026;&#20160;&#20040;&#29983;&#20135;&#21830;&#36825;&#26679;&#20570;&#65311;&#36825;&#19982;&#20182;&#20204;<span class="emphasis"><em>&#21453;&#23545;</em></span>&#36719;&#20214;&#25903;&#25345;&#26080;&#20851;&#65307;&#27605;&#31455;&#65292;&#20860;&#23481;&#30340;&#25805;&#20316;&#31995;&#32479;&#36234;&#22810;&#65292;&#23601;&#20250;&#26377;&#36234;&#22810;&#30340;&#26174;&#21345;&#20986;&#21806;&#12290;&#20294;&#26159;&#37027;&#26679;&#20570;&#30340;&#32467;&#26524;&#65292;&#35774;&#35745;&#23460;&#30340;&#38376;&#21518;&#65292;&#36825;&#20123;&#21378;&#21830;&#20840;&#37096;&#36829;&#21453;&#20102;&#20182;&#20154;&#30340;&#19987;&#21033;&#65292;&#26377;&#26102;&#26159;&#24050;&#30693;&#65292;&#26377;&#20123;&#21017;&#32431;&#23646;&#24039;&#21512;&#12290;&#19987;&#21033;&#26159;&#22312;&#22914;&#27492;&#30340;&#19981;&#21487;&#39044;&#27979;&#21644;&#28459;&#26080;&#36793;&#38469;&#65292;&#27809;&#26377;&#21738;&#20010;&#26174;&#21345;&#21378;&#21830;&#21487;&#20197;&#30830;&#20449;&#23433;&#20840;&#65292;&#21363;&#20351;&#32463;&#36807;&#20102;&#19987;&#21033;&#25628;&#32034;&#12290;&#22240;&#32780;&#65292;&#21046;&#36896;&#21830;&#19981;&#25954;&#21457;&#24067;&#20182;&#20204;&#30340;&#25152;&#26377;&#25509;&#21475;&#35268;&#33539;&#65292;&#22240;&#20026;&#36825;&#26679;&#21487;&#20197;&#20351;&#20182;&#20204;&#30340;&#31454;&#20105;&#32773;&#21487;&#20197;&#36731;&#26131;&#30340;&#25351;&#20986;&#26159;&#21542;&#26377;&#19987;&#21033;&#21463;&#21040;&#20102;&#20405;&#23475;&#12290;&#65288;&#24403;&#28982;&#65292;&#36825;&#31181;&#24773;&#24418;&#30340;&#26412;&#24615;&#20915;&#23450;&#20102;&#19981;&#20250;&#20174;&#20027;&#35201;&#26469;&#28304;&#33719;&#24471;&#20070;&#38754;&#25215;&#35748;&#65307;&#25105;&#26159;&#36890;&#36807;&#20010;&#20154;&#20132;&#27969;&#33719;&#24471;&#36825;&#20123;&#20449;&#24687;&#12290; &#65289;</p><p>&#19968;&#20123;&#33258;&#30001;&#36719;&#20214;&#35768;&#21487;&#35777;&#26377;&#19968;&#20123;&#19982;&#36719;&#20214;&#19987;&#21033;&#26007;&#20105;&#65292;&#25110;&#33267;&#23569;&#19981;&#40723;&#21169;&#36719;&#20214;&#19987;&#21033;&#30340;&#26465;&#27454;&#12290;&#20363;&#22914;GNU GPL&#21253;&#21547;&#36825;&#20123;&#35821;&#35328;&#65306;</p><pre class="screen">
  7. &#33509;&#27861;&#38498;&#21028;&#20915;&#12289;&#19987;&#21033;&#20405;&#26435;&#20027;&#24352;&#25110;&#32773;&#20854;&#20182;&#20219;&#20309;&#29702;&#30001;&#65288;&#19981;&#38480;&#20110;&#19987;
&#21033;&#20105;&#35758;&#65289;&#30340;&#32467;&#26524;&#65292;&#20351;&#24471;&#21152;&#35832;&#20110;&#24744;&#30340;&#26465;&#20214;&#65288;&#26080;&#35770;&#26159;&#30001;&#27861;&#38498;&#21629;&#20196;
&#12289;&#21327;&#35758;&#20070;&#25110;&#20854;&#20182;&#26041;&#24335;&#36896;&#25104;&#65289;&#19982;&#26412;&#25480;&#26435;&#35268;&#23450;&#26377;&#25152;&#20914;&#31361;&#65292;&#20182;&#20204;&#24182;
&#19981;&#20813;&#38500;&#24744;&#23545;&#20110;&#26412;&#25480;&#26435;&#35268;&#23450;&#30340;&#36981;&#23432;&#12290;&#33509;&#24744;&#26080;&#27861;&#21516;&#26102;&#31526;&#21512;&#20381;&#26412;&#25480;
&#26435;&#25152;&#29983;&#20041;&#21153;&#21450;&#20854;&#20182;&#30456;&#20851;&#20041;&#21153;&#32780;&#36827;&#34892;&#21457;&#24067;&#65292;&#37027;&#20040;&#20854;&#32467;&#26524;&#20415;&#26159;&#24744;
&#19981;&#24471;&#21457;&#24067;&#35813;&#31243;&#24207;&#12290;&#20363;&#22914;&#65292;&#33509;&#19987;&#21033;&#25480;&#26435;&#19981;&#20801;&#35768;&#20854;&#20182;&#20154;&#30452;&#25509;&#25110;&#38388;
&#25509;&#21462;&#24471;&#22797;&#21046;&#29289;&#65292;&#36890;&#36807;&#24744;&#20197;&#20813;&#20184;&#26435;&#21033;&#37329;&#30340;&#26041;&#24335;&#20877;&#21457;&#24067;&#35813;&#31243;&#24207;&#65292;
&#24744;&#21807;&#19968;&#33021;&#21516;&#26102;&#28415;&#36275;&#35813;&#20041;&#21153;&#21450;&#26412;&#25480;&#26435;&#30340;&#26041;&#24335;&#23601;&#26159;&#24505;&#24213;&#36991;&#20813;&#36827;&#34892;
&#35813;&#31243;&#24207;&#30340;&#21457;&#24067;&#12290;

[...]

&#26412;&#26465;&#30340;&#30446;&#30340;&#24182;&#19981;&#22312;&#35825;&#20351;&#24744;&#20405;&#23475;&#19987;&#21033;&#25110;&#20854;&#20182;&#36001;&#20135;&#26435;&#30340;&#26435;&#21033;&#20027;&#24352;
&#65292;&#25110;&#23601;&#27492;&#31867;&#20027;&#24352;&#30340;&#26377;&#25928;&#24615;&#21152;&#20197;&#20105;&#25191;&#65307;&#26412;&#26465;&#30340;&#21807;&#19968;&#30446;&#30340;&#65292;&#26159;&#22312;
&#20445;&#38556;&#34249;&#30001;&#20844;&#20849;&#25480;&#26435;&#24815;&#20363;&#25152;&#25191;&#34892;&#33258;&#30001;&#36719;&#20214;&#21457;&#24067;&#31995;&#32479;&#30340;&#23436;&#25972;&#24615;&#12290;
&#35768;&#22810;&#20154;&#20449;&#36182;&#35813;&#31995;&#32479;&#19968;&#36143;&#20351;&#29992;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#32780;&#23545;&#32463;&#30001;&#27492;&#31995;&#32479;&#21457;
&#24067;&#30340;&#22823;&#37327;&#36719;&#20214;&#26377;&#30456;&#24403;&#22810;&#30340;&#36129;&#29486;&#65307;&#20316;&#32773;&#65295;&#36129;&#29486;&#32773;&#26377;&#26435;&#20915;&#23450;&#20182;&#25110;
&#22905;&#26159;&#21542;&#24076;&#26395;&#32463;&#30001;&#20854;&#20182;&#30340;&#31995;&#32479;&#21457;&#24067;&#36719;&#20214;&#65292;&#32780;&#34987;&#25480;&#26435;&#20154;&#21017;&#26080;&#35813;&#31181;
&#36873;&#25321;&#26435;&#12290;
</pre><p>Apache&#35768;&#21487;&#35777;&#65292;&#29256;&#26412;2.0&#65288;<a class="ulink" href="http://www.apache.org/licenses/LICENSE-2.0" target="_top">http://www.apache.org/licenses/LICENSE-2.0</a>&#65289;&#20063;&#21253;&#21547;&#20102;&#21453;&#19987;&#21033;&#30340;&#35201;&#27714;&#12290;&#39318;&#20808;&#65292;&#23427;&#35268;&#23450;&#22312;&#35813;&#35768;&#21487;&#35777;&#20998;&#21457;&#20195;&#30721;&#30340;&#20219;&#20309;&#20154;&#65292;&#38544;&#21547;&#21253;&#25324;&#20102;&#19968;&#20010;&#21487;&#33021;&#20182;&#20204;&#25345;&#26377;&#24182;&#21487;&#20197;&#24212;&#29992;&#20110;&#36825;&#20123;&#20195;&#30721;&#30340;&#19987;&#21033;&#30340;&#20813;&#19987;&#21033;&#36153;&#35768;&#21487;&#35777;&#12290;&#20854;&#27425;&#65292;&#26356;&#36132;&#26126;&#30340;&#65292;&#36890;&#36807;&#22312;&#20027;&#24352;&#20570;&#20986;&#26102;&#33258;&#21160;&#32456;&#27490;&#20182;&#20204;&#30340;&#38544;&#21547;&#19987;&#21033;&#35768;&#21487;&#35777;&#65292;&#23427;&#24809;&#32602;&#20102;&#20219;&#20309;&#23545;&#20195;&#30721;&#20027;&#24352;&#19987;&#21033;&#20405;&#23475;&#30340;&#20154;&#12290;</p><pre class="screen">
3.&#19987;&#21033;&#35768;&#21487;&#35777;&#30340;&#25480;&#20104;&#12290;

&#26681;&#25454;&#26412;&#35768;&#21487;&#35777;&#30340;&#26465;&#27454;&#65292;&#27599;&#20010;&#36129;&#29486;&#32773;&#25480;&#20104;&#29992;&#25143;&#27704;&#20037;&#24615;&#30340;&#12289;&#20840;&#29699;
&#24615;&#30340;&#12289;&#38750;&#19987;&#26377;&#24615;&#30340;&#12289;&#20813;&#36153;&#30340;&#12289;&#26080;&#29256;&#26435;&#36153;&#30340;&#12289;&#19981;&#21487;&#25764;&#38144;&#30340;(&#38500;&#22312;
&#26412;&#37096;&#20998;&#36827;&#34892;&#35828;&#26126;)&#19987;&#21033;&#35768;&#21487;&#35777;&#23545;&#20316;&#21697;&#36827;&#34892;&#21046;&#20316;&#12289;&#35753;&#20154;&#21046;&#20316;&#12289;&#20351;
&#29992;&#12289;&#25552;&#20379;&#38144;&#21806;&#12289;&#38144;&#21806;&#12289;&#36827;&#21475;&#21644;&#20854;&#23427;&#36716;&#35753;&#65292;&#19988;&#36825;&#26679;&#30340;&#35768;&#21487;&#35777;&#20165;
&#36866;&#29992;&#20110;&#22312;&#25152;&#36882;&#20132;&#20316;&#21697;&#30340;&#36129;&#29486;&#20013;&#22240;&#21487;&#30001;&#21333;&#19968;&#30340;&#25110;&#22810;&#20010;&#36825;&#26679;&#30340;&#36129;
&#29486;&#32773;&#25480;&#20104;&#32780;&#24517;&#39035;&#20405;&#29359;&#30340;&#30003;&#35831;&#19987;&#21033;&#12290;&#22914;&#26524;&#29992;&#25143;&#23545;&#20219;&#20309;&#23454;&#20307;&#38024;&#23545;
&#20316;&#21697;&#25110;&#20316;&#21697;&#20013;&#25152;&#28041;&#21450;&#36129;&#29486;&#25552;&#20986;&#22240;&#30452;&#25509;&#24615;&#25110;&#36129;&#29486;&#24615;&#19987;&#21033;&#20405;&#26435;&#32780;
&#25552;&#36215;&#19987;&#21033;&#27861;&#24459;&#35785;&#35772;(&#21253;&#25324;&#20132;&#20114;&#35785;&#35772;&#35831;&#27714;&#25110;&#21453;&#32034;&#36180;)&#65292;&#37027;&#20040;&#26681;&#25454;
&#26412;&#35768;&#21487;&#35777;&#65292;&#25480;&#20104;&#29992;&#25143;&#38024;&#23545;&#20316;&#21697;&#30340;&#20219;&#20309;&#19987;&#21033;&#35768;&#21487;&#35777;&#23558;&#22312;&#25552;&#36215;&#19978;
&#36848;&#35785;&#35772;&#20043;&#26085;&#36215;&#32456;&#27490;&#12290;


</pre><p>&#23613;&#31649;&#36825;&#24456;&#26377;&#29992;&#65292;&#19981;&#31649;&#26159;&#27861;&#24459;&#36824;&#26159;&#25919;&#27835;&#65292;&#20197;&#36825;&#31181;&#26041;&#24335;&#23558;&#19987;&#21033;&#38450;&#24481;&#26500;&#24314;&#21040;&#20102;&#33258;&#30001;&#36719;&#20214;&#35768;&#21487;&#35777;&#24403;&#20013;&#65292;&#20294;&#26368;&#32456;&#36825;&#20123;&#27493;&#39588;&#19981;&#36275;&#20197;&#24418;&#25104;&#23545;&#20110;&#33258;&#30001;&#36719;&#20214;&#30340;&#19987;&#21033;&#35785;&#35772;&#23041;&#32961;&#30340;&#23506;&#32709;&#25928;&#29992;&#12290;&#21482;&#26377;&#22269;&#38469;&#29256;&#26435;&#27861;&#30340;&#20027;&#26088;&#25110;&#35299;&#37322;&#21487;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#20851;&#20110;&#27492;&#38382;&#39064;&#30340;&#26356;&#22810;&#20449;&#24687;&#65292;&#20197;&#21450;&#30456;&#20851;&#30340;&#26007;&#20105;&#65292;&#35831;&#30475;<a class="ulink" href="http://www.nosoftwarepatents.com/" target="_top">http://www.nosoftwarepatents.com/</a>&#12290;&#32500;&#22522;&#30334;&#31185;&#25991;&#31456;<a class="ulink" href="http://en.wikipedia.org/wiki/Software_patent" target="_top">http://en.wikipedia.org/wiki/Software_patent</a>&#20063;&#26377;&#35768;&#22810;&#36719;&#20214;&#19987;&#21033;&#30340;&#26377;&#29992;&#20449;&#24687;&#12290;&#25105;&#20063;&#20889;&#36807;&#19968;&#31687;&#24635;&#32467;&#36719;&#20214;&#19987;&#21033;&#20105;&#35770;&#30340;blog&#65292;&#20301;&#20110;<a class="ulink" href="http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/" target="_top">http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/</a>&#12290;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp3215" href="#idp3215" class="para">31</a>] </sup>Sun Microsystems&#21644;IBM&#38024;&#23545;&#27492;&#38382;&#39064;&#20063;&#20570;&#20986;&#20102;&#23436;&#20840;&#30456;&#21453;&#30340;&#23039;&#24577;&#65292;&#20182;&#20204;&#35299;&#25918;&#20102;&#22823;&#37327;&#36719;&#20214;&#19987;&#21033;&#8212;&#20998;&#21035;&#20026;1600&#21644;500&#8212;&#29992;&#20110;&#33258;&#30001;&#36719;&#20214;&#31038;&#21306;&#12290;&#25105;&#19981;&#26159;&#19968;&#20010;&#24459;&#24072;&#65292;&#22240;&#32780;&#26080;&#27861;&#35780;&#20272;&#36825;&#20123;&#25480;&#20104;&#30340;&#30495;&#23454;&#21151;&#29992;&#65292;&#20294;&#26159;&#21363;&#20351;&#20840;&#37096;&#26159;&#37325;&#35201;&#30340;&#19987;&#21033;&#65292;&#32780;&#19988;&#25480;&#20104;&#30340;&#26465;&#27454;&#30830;&#23454;&#33021;&#22815;&#30495;&#27491;&#30340;&#33258;&#30001;&#29992;&#20110;&#24320;&#28304;&#39033;&#30446;&#30340;&#65292;&#36825;&#20063;&#20165;&#20165;&#26159;&#27815;&#28023;&#19968;&#31903;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp3219" href="#idp3219" class="para">32</a>] </sup>&#36825;&#37324;&#26377;&#19968;&#20010;&#30456;&#20851;&#30340;&#27665;&#24847;&#35843;&#26597;<a class="ulink" href="http://lpf.ai.mit.edu/Whatsnew/survey.html" target="_top">http://lpf.ai.mit.edu/Whatsnew/survey.html</a>&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp3222" href="#idp3222" class="para">33</a>] </sup>&#20363;&#22914;&#65292;RedHat&#20445;&#35777;&#23427;&#30340;&#19987;&#21033;&#23545;&#24320;&#28304;&#39033;&#30446;&#26159;&#23433;&#20840;&#30340;&#65292;&#35265;<a class="ulink" href="http://www.redhat.com/legal/patent_policy.html" target="_top">http://www.redhat.com/legal/patent_policy.html</a>&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="dual-licensing.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="legal.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="licensing-further-resources.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#21452;&#35768;&#21487;&#35777;&#27169;&#24335; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#28145;&#20837;&#36164;&#28304;</td></tr></table></div></body></html>
