<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21069;&#35328;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="next" href="audience.html" title="&#35841;&#24212;&#35813;&#35835;&#26412;&#20070;&#65311;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21069;&#35328;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="audience.html">Next</a></td></tr></table><hr></div><div class="preface" title="&#21069;&#35328;"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>&#21069;&#35328;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="preface.html#why">&#20026;&#20160;&#20040;&#20889;&#36825;&#26412;&#20070;&#65311;</a></span></dt><dt><span class="sect1"><a href="audience.html">&#35841;&#24212;&#35813;&#35835;&#26412;&#20070;&#65311;</a></span></dt><dt><span class="sect1"><a href="sources.html">&#36164;&#26009;&#26469;&#28304;</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">&#33268;&#35874;</a></span></dt><dd><dl><dt><span class="sect2"><a href="acknowledgments.html#acknowledgements-1st-ed">&#20889;&#32473;&#31532;&#19968;&#29256;(2005)</a></span></dt><dt><span class="sect2"><a href="acknowledgments.html#acknowledgements-2nd-ed">&#20889;&#32473;&#31532;&#20108;&#29256;(2017)</a></span></dt></dl></dd><dt><span class="sect1"><a href="disclaimer.html">&#20813;&#36131;&#22768;&#26126;</a></span></dt></dl></div><div class="sect1" title="&#20026;&#20160;&#20040;&#20889;&#36825;&#26412;&#20070;&#65311;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>&#20026;&#20160;&#20040;&#20889;&#36825;&#26412;&#20070;&#65311;</h2></div></div></div><p>&#22312;&#32858;&#20250;&#19978;&#65292;&#24403;&#25105;&#21578;&#35785;&#21035;&#20154;&#25105;&#20889;&#33258;&#30001;&#36719;&#20214;&#26102;&#65292;&#20154;&#20204;&#19981;&#20877;&#26159;&#19968;&#21103;&#33579;&#28982;&#30340;&#34920;&#24773;&#12290;&#20182;&#20204;&#20250;&#35828;&#65292;&#8220;&#21734;&#65292;&#24320;&#28304;&#36719;&#20214;&#8212;&#23601;&#20687;linux&#65311;&#8221;&#25105;&#20351;&#21170;&#22320;&#28857;&#22836;&#65306;"&#23545;&#65281;&#25105;&#23601;&#26159;&#20570;&#37027;&#20010;&#30340;&#12290;"&#19981;&#20877;&#34987;&#20937;&#22312;&#19968;&#36793;&#30340;&#24863;&#35273;&#30495;&#22909;&#12290;&#35201;&#22312;&#36807;&#21435;&#65292;&#19979;&#38754;&#30340;&#19968;&#20010;&#38382;&#39064;&#36890;&#24120;&#20250;&#26159;&#36825;&#20010;&#65306;&#8220;&#20320;&#38752;&#37027;&#20010;&#24590;&#20040;&#25379;&#38065;&#65311;&#8221;&#20026;&#20102;&#22238;&#31572;&#20182;&#20204;&#65292;&#25105;&#24517;&#39035;&#27010;&#36848;&#24320;&#28304;&#36719;&#20214;&#30340;&#32463;&#27982;&#23398;&#65306;&#26377;&#19968;&#20123;&#32452;&#32455;&#23545;&#26576;&#20010;&#29305;&#23450;&#36719;&#20214;&#30340;&#23384;&#22312;&#24863;&#20852;&#36259;&#65292;&#20294;&#20182;&#20204;&#19981;&#38656;&#35201;&#21334;&#25335;&#36125;&#65292;&#32780;&#26159;&#30830;&#20445;&#36825;&#20123;&#36719;&#20214;&#33021;&#22815;&#20813;&#36153;&#33719;&#24471;&#24182;&#19988;&#26377;&#20154;&#32500;&#25252;&#65292;&#33021;&#22815;&#20316;&#20026;&#24037;&#20855;&#32780;&#19981;&#26159;&#21830;&#21697;&#20351;&#29992;&#12290;</p><p>&#28982;&#32780;&#20043;&#21518;&#30340;&#38382;&#39064;&#19981;&#20877;&#24635;&#26159;&#21516;&#38065;&#26377;&#20851;&#12290;&#24320;&#28304;&#36719;&#20214;<sup>[<a name="idp9" href="#ftn.idp9" class="footnote">1</a>]</sup>&#30340;&#21830;&#19994;&#26696;&#20363;&#19981;&#20877;&#26159;&#22914;&#27492;&#31070;&#31192;&#65292;&#35768;&#22810;&#30340;&#38750;&#32534;&#31243;&#20154;&#22763;&#24050;&#32463;&#20102;&#35299;&#21040;&#8212;&#25110;&#33267;&#23569;&#19981;&#20877;&#24778;&#22855;&#8212;&#30830;&#23454;&#26377;&#19968;&#20123;&#20154;&#34987;&#38599;&#20323;&#20840;&#32844;&#20570;&#24320;&#28304;&#12290;&#20110;&#26159;&#65292;&#25105;&#36234;&#26469;&#36234;&#39057;&#32321;&#22320;&#34987;&#38382;&#21040;&#30340;&#31532;&#20108;&#20010;&#38382;&#39064;&#26159;&#65306;&#8220;<span class="emphasis"><em>&#37027;&#20040;&#65292;&#24320;&#28304;&#36719;&#20214;&#26159;&#24590;&#20040;&#36816;&#20316;&#30340;&#65311;</em></span>&#8221;</p><p>&#25105;&#25163;&#22836;&#27809;&#26377;&#29616;&#25104;&#30340;&#28385;&#24847;&#30340;&#31572;&#26696;&#65292;&#26356;&#22256;&#38590;&#20043;&#22788;&#22312;&#20110;&#24403;&#25105;&#35797;&#22270;&#32473;&#20986;&#19968;&#20010;&#26102;&#65292;&#25105;&#24847;&#35782;&#21040;&#23427;&#26159;&#19968;&#20010;&#22810;&#20040;&#22797;&#26434;&#30340;&#39064;&#30446;&#12290;&#36816;&#34892;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#23436;&#20840;&#19981;&#21516;&#20110;&#21830;&#19994;&#36816;&#20316;&#65288;&#24819;&#20687;&#19968;&#19979;&#24517;&#39035;&#26102;&#24120;&#21516;&#22823;&#37096;&#20998;&#20320;&#20174;&#26410;&#35851;&#38754;&#30340;&#24535;&#24895;&#32773;&#20204;&#21830;&#35752;&#20135;&#21697;&#30340;&#29305;&#24615;&#30340;&#24773;&#26223;&#65281; &#65289;&#12290;&#30001;&#20110;&#26576;&#20123;&#21407;&#22240;&#65292;&#20063;&#21644;&#20256;&#32479;&#30340;&#38750;&#30408;&#21033;&#32452;&#32455;&#19981;&#21516;&#65292;&#20063;&#19981;&#21516;&#20110;&#19968;&#20010;&#25919;&#24220;&#12290;&#19982;&#19978;&#36848;&#20107;&#29289;&#26377;&#35768;&#22810;&#30456;&#20284;&#24615;&#65292;&#20294;&#25105;&#28176;&#28176;&#24471;&#20986;&#20102;&#19968;&#20010;&#32467;&#35770;&#65292;&#33258;&#30001;&#36719;&#20214;&#26159;<span class="foreignphrase"><em class="foreignphrase">&#29420;&#19968;&#26080;&#20108;&#30340;</em></span>&#12290;&#26377;&#35768;&#22810;&#20107;&#24773;&#21487;&#20197;&#19982;&#20043;&#27604;&#36739;&#65292;&#20294;&#27809;&#26377;&#19968;&#20010;&#19982;&#20043;&#23436;&#20840;&#31561;&#21516;&#12290;&#23454;&#38469;&#19978;&#65292;&#21363;&#20351;&#23545;&#20110;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#21487;&#20197;&#8220;&#36816;&#34892;&#8221;&#30340;&#20551;&#35774;&#20063;&#26159;&#19968;&#31181;&#24341;&#30003;&#12290;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#33021;&#34987;<span class="emphasis"><em>&#24320;&#21551;</em></span>&#65292;&#24182;&#19988;&#20250;&#21463;&#21040;&#23545;&#27492;&#24863;&#20852;&#36259;&#30340;&#22242;&#20307;&#30340;&#24378;&#28872;&#24433;&#21709;&#65292;&#32780;&#19988;&#23427;&#30340;&#36164;&#20135;&#19981;&#23646;&#20110;&#20219;&#20309;&#19968;&#20010;&#20010;&#20154;&#25110;&#22242;&#20307;&#65292;&#20250;&#28304;&#28304;&#19981;&#26029;&#20174;&#26576;&#20123;&#22320;&#26041;&#20882;&#20986;&#23545;&#27492;&#24863;&#20852;&#36259;&#30340;&#20154;&#65292;&#25152;&#20197;&#23427;&#19981;&#20250;&#34987;&#8212;&#20219;&#20309;&#20154;&#8212;&#21333;&#26041;&#38754;&#22320;&#32456;&#27490;&#12290;&#27599;&#20010;&#20154;&#37117;&#26377;&#26080;&#38480;&#30340;&#26435;&#21033;&#65292;&#27599;&#20010;&#20154;&#21448;&#37117;&#27809;&#26377;&#26435;&#21033;&#12290;&#23427;&#24418;&#25104;&#20102;&#36825;&#26679;&#19968;&#31181;&#26377;&#36259;&#30340;&#21160;&#24577;&#24179;&#34913;&#12290;</p><p>&#36825;&#23601;&#26159;&#25105;&#35201;&#20889;&#27492;&#20070;&#30340;&#21407;&#22240;&#12290;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#24050;&#32463;&#36827;&#21270;&#20986;&#20102;&#19968;&#31181;&#29420;&#29305;&#30340;&#25991;&#21270;&#65292;&#19968;&#31181;&#20449;&#22857;&#20010;&#20154;&#33021;&#22815;&#35753;&#36719;&#20214;&#20570;&#20219;&#20309;&#20107;&#24773;&#12289;&#33258;&#30001;&#20026;&#20013;&#24515;&#20449;&#26465;&#30340;&#24605;&#24819;&#65292;&#36825;&#31181;&#33258;&#30001;&#30340;&#32467;&#26524;&#24182;&#19981;&#26159;&#35753;&#27599;&#20010;&#20154;&#23545;&#20195;&#30721;&#21508;&#34892;&#20854;&#20107;&#65292;&#32780;&#26159;&#26159;&#29378;&#28909;&#30340;&#21512;&#20316;&#12290;&#23454;&#38469;&#19978;&#65292;&#22312;&#21512;&#20316;&#20013;&#31454;&#20105;&#20063;&#26159;&#33258;&#30001;&#36719;&#20214;&#36816;&#21160;&#20013;&#26368;&#26377;&#20215;&#20540;&#30340;&#25216;&#24039;&#20043;&#19968;&#12290;&#31649;&#29702;&#36825;&#26679;&#30340;&#39033;&#30446;&#23601;&#26159;&#22788;&#29702;&#19968;&#22534;&#24222;&#22823;&#30340;&#21512;&#20316;&#20851;&#31995;&#65292;&#22312;&#36825;&#37324;&#20010;&#20154;&#33021;&#21147;&#19981;&#20165;&#26159;&#21644;&#20182;&#20154;&#19968;&#36215;&#24037;&#20316;&#65292;&#32780;&#19988;&#21253;&#25324;&#36890;&#36807;&#19968;&#26465;&#23853;&#26032;&#30340;&#21512;&#20316;&#26041;&#24335;&#23545;&#36719;&#20214;&#20570;&#20986;&#23454;&#38469;&#30340;&#36129;&#29486;&#12290;&#36825;&#26412;&#20070;&#35797;&#22270;&#25551;&#36848;&#23454;&#34892;&#36825;&#31181;&#26041;&#24335;&#25152;&#38656;&#35201;&#30340;&#25216;&#26415;&#12290;&#23427;&#19981;&#20250;&#21253;&#21547;&#20840;&#37096;&#65292;&#20294;&#21364;&#26159;&#37325;&#35201;&#30340;&#36215;&#27493;&#12290;</p><p>&#20248;&#31168;&#30340;&#33258;&#30001;&#36719;&#20214;&#26412;&#36523;&#23601;&#26159;&#26497;&#26377;&#20215;&#20540;&#30340;&#30446;&#26631;&#65292;&#25105;&#24076;&#26395;&#37027;&#20123;&#22312;&#26412;&#20070;&#20013;&#23547;&#25214;&#21019;&#36896;&#25104;&#21151;&#36719;&#20214;&#26041;&#27861;&#30340;&#35835;&#32773;&#33021;&#22815;&#24471;&#21040;&#28385;&#24847;&#30340;&#31572;&#26696;&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#25105;&#24819;&#20256;&#36798;&#37027;&#31181;&#32431;&#31929;&#30340;&#24555;&#20048;&#65292;&#26469;&#33258;&#21516;&#20805;&#28385;&#27963;&#21147;&#30340;&#24320;&#28304;&#36719;&#20214;&#24320;&#21457;&#22242;&#38431;&#30340;&#21512;&#20316;&#65292;&#26469;&#33258;&#36890;&#36807;&#24320;&#28304;&#36719;&#20214;&#25152;&#40723;&#21169;&#30340;&#30452;&#25509;&#26041;&#24335;&#19982;&#29992;&#25143;&#30340;&#20132;&#27969;&#12290;&#25104;&#20026;&#19968;&#20010;&#25104;&#21151;&#30340;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#19968;&#20998;&#23376;&#26159;<span class="emphasis"><em>&#26377;&#36259;&#30340;</em></span>&#65292;&#36825;&#25165;&#26159;&#39537;&#21160;&#25972;&#20010;&#31995;&#32479;&#36816;&#36716;&#30340;&#32456;&#26497;&#21160;&#21147;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp9" href="#idp9" class="para">1</a>] </sup>&#26415;&#35821;&#8220;&#24320;&#28304;&#8221;&#21644;&#8220;&#33258;&#30001;&#36719;&#20214;&#8221;&#22312;&#27492;&#22788;&#30340;&#19978;&#19979;&#25991;&#20013;&#26412;&#36136;&#19978;&#26159;&#21516;&#20041;&#35789;&#12290;&#26377;&#20851;&#20182;&#20204;&#30340;&#26356;&#22810;&#35752;&#35770;&#21442;&#35265;<a class="xref" href="introduction.html" title="Chapter 1. &#20171;&#32461;">Chapter 1, <i>&#20171;&#32461;</i></a>&#20013;&#30340;<a class="xref" href="introduction.html#free-vs-open-source" title="&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;">the section called &#8220;&#8220;&#33258;&#30001;&#8221;&#36824;&#26159;&#8220;&#24320;&#28304;&#8221;&#8221;</a>&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="audience.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#21046;&#36896;&#24320;&#28304;&#36719;&#20214; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#35841;&#24212;&#35813;&#35835;&#26412;&#20070;&#65311;</td></tr></table></div></body></html>
