<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20844;&#24320;&#24615;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="communications.html" title="Chapter 6. &#20132;&#27969;"><link rel="prev" href="bug-tracker-usage.html" title="Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805;"><link rel="next" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20844;&#24320;&#24615;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="bug-tracker-usage.html">Prev</a> </td><th width="60%" align="center">Chapter 6. &#20132;&#27969;</th><td width="20%" align="right"> <a accesskey="n" href="development-cycle.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20844;&#24320;&#24615;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="publicity"></a>&#20844;&#24320;&#24615;</h2></div></div></div><p>&#22312;&#33258;&#30001;&#36719;&#20214;&#20013;&#65292;&#22312;&#32431;&#20869;&#37096;&#35752;&#35770;&#21644;&#20844;&#24320;&#32852;&#31995;&#22768;&#26126;&#20043;&#38388;&#36890;&#24120;&#26377;&#19968;&#20010;&#30456;&#23545;&#24179;&#28369;&#30340;&#36830;&#25509;&#12290;&#36825;&#37096;&#20998;&#22240;&#20026;&#30446;&#26631;&#35835;&#32773;&#19968;&#30452;&#19981;&#26126;&#65306;&#22240;&#20026;&#22823;&#22810;&#25968;&#25991;&#31456;&#37117;&#26159;&#20844;&#24320;&#21487;&#35775;&#38382;&#30340;&#65292;&#39033;&#30446;&#26080;&#27861;&#25511;&#21046;&#25972;&#20010;&#19990;&#30028;&#23545;&#27492;&#30340;&#21360;&#35937;&#12290;&#26576;&#20154;&#8212;&#20551;&#35774;&#26159;<a class="ulink" href="http://slashdot.org/" target="_top">slashdot.org</a>&#30340;&#19968;&#20010;&#32534;&#36753;&#8212;&#21487;&#33021;&#20026;&#35851;&#31687;&#25991;&#31456;&#24102;&#26469;&#20960;&#30334;&#19975;&#30340;&#35835;&#32773;&#65292;&#32780;&#26412;&#26469;&#27809;&#20154;&#35748;&#20026;&#23427;&#20250;&#34987;&#39033;&#30446;&#20043;&#22806;&#30340;&#20154;&#30475;&#21040;&#12290;&#36825;&#23601;&#26159;&#24320;&#28304;&#39033;&#30446;&#29983;&#27963;&#30340;&#19990;&#30028;&#65292;&#20294;&#26159;&#22312;&#23454;&#36341;&#20013;&#65292;&#36825;&#31181;&#39118;&#38505;&#36890;&#24120;&#24456;&#23567;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#39033;&#30446;&#24076;&#26395;&#20844;&#24320;&#21270;&#30340;&#22768;&#26126;&#23601;&#20250;&#24471;&#21040;&#26368;&#22823;&#30340;&#20844;&#24320;&#21270;&#65292;&#21482;&#35201;&#20320;&#33021;&#29992;&#27491;&#30830;&#30340;&#26426;&#21046;&#25351;&#20986;&#20854;&#23545;&#22806;&#37096;&#19990;&#30028;&#30340;&#26032;&#38395;&#20215;&#20540;&#12290;</p><p>&#23545;&#20110;&#20027;&#35201;&#30340;&#22768;&#26126;&#65292;&#36890;&#24120;&#20250;&#26377;4&#25110;5&#20010;&#20027;&#35201;&#20998;&#21457;&#28192;&#36947;&#65292;&#25152;&#26377;&#30340;&#22768;&#26126;&#26368;&#22909;&#23613;&#21487;&#33021;&#21516;&#26102;&#21457;&#20986;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#20320;&#30340;&#39033;&#30446;&#20027;&#39029;&#21487;&#33021;&#26159;&#39033;&#30446;&#20013;&#34987;&#30475;&#24471;&#26368;&#22810;&#30340;&#39029;&#38754;&#12290;&#22914;&#26524;&#20320;&#30830;&#23454;&#26377;&#20027;&#22768;&#26126;&#65292;&#35831;&#22312;&#27492;&#25918;&#19968;&#20010;&#22840;&#24352;&#30340;&#24191;&#21578;&#12290;&#36825;&#20010;&#24191;&#21578;&#19968;&#23450;&#26159;&#19968;&#20010;&#31616;&#30701;&#30340;&#27010;&#35201;&#65292;&#21487;&#20197;&#38142;&#25509;&#21040;&#26377;&#26356;&#22810;&#20449;&#24687;&#30340;&#26032;&#38395;&#31295;&#12290;</p></li><li class="listitem"><p>&#21516;&#19968;&#26102;&#38388;&#65292;&#20320;&#30340;&#31449;&#28857;&#19968;&#23450;&#20063;&#35201;&#26377;&#19968;&#20010;&#8220;&#26032;&#38395;&#8221;&#25110;&#8220;&#26032;&#38395;&#21457;&#24067;&#8221;&#21306;&#65292;&#21487;&#20197;&#35814;&#32454;&#20889;&#26126;&#22768;&#26126;&#12290;&#26032;&#38395;&#31295;&#30340;&#37096;&#20998;&#30446;&#30340;&#26159;&#25552;&#20379;&#19968;&#20010;&#21333;&#29420;&#30340;&#26435;&#23041;&#8220;&#22768;&#26126;&#23545;&#35937;&#8221;&#65292;&#36825;&#26679;&#21035;&#30340;&#31449;&#28857;&#21487;&#20197;&#29992;&#26469;&#38142;&#25509;&#65292;&#25152;&#20197;&#35201;&#20197;&#27492;&#20026;&#20381;&#25454;&#30830;&#20445;&#20854;&#32467;&#26500;&#65306;&#35201;&#20040;&#27599;&#20010;&#21457;&#24067;&#19968;&#20010;&#32593;&#39029;&#65292;&#25110;&#27599;&#20010;&#26159;&#19968;&#20010;&#21338;&#23458;&#26465;&#30446;&#65292;&#35201;&#20040;&#20854;&#20182;&#31181;&#31867;&#21487;&#20197;&#34987;&#38142;&#25509;&#30340;&#23454;&#20307;&#65292;&#21516;&#26102;&#19982;&#21516;&#19968;&#21306;&#22495;&#30340;&#20854;&#20182;&#26032;&#38395;&#31295;&#21306;&#20998;&#24320;&#26469;&#12290;</p></li><li class="listitem"><p>&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#26377;RSS&#20379;&#31295;&#65288;&#35265;<a class="xref" href="rss.html" title="RSS&#20379;&#31295;">the section called &#8220;RSS&#20379;&#31295;&#8221;</a>&#65289;&#65292;&#35831;&#30830;&#20445;&#22768;&#26126;&#20063;&#20250;&#20986;&#29616;&#22312;&#36825;&#37324;&#12290;&#36825;&#20063;&#21487;&#33021;&#22312;&#20320;&#21019;&#24314;&#26032;&#38395;&#31295;&#26102;&#33258;&#21160;&#21457;&#29983;&#65292;&#21462;&#20915;&#20110;&#20320;&#26159;&#22914;&#20309;&#35774;&#32622;&#30340;&#31449;&#28857;&#12290;</p></li><li class="listitem"><p>&#22914;&#26524;&#22768;&#26126;&#26159;&#36719;&#20214;&#30340;&#26032;&#29256;&#26412;&#65292;&#35831;&#26356;&#26032;<a class="ulink" href="http://freshmeat.net/" target="_top">http://freshmeat.net/</a>&#20013;&#30340;&#39033;&#30446;&#26465;&#30446;&#65288;&#20851;&#20110;&#39318;&#27425;&#21019;&#24314;&#26465;&#30446;&#35831;&#30475;<a class="xref" href="announcing.html" title="&#36890;&#21578;">the section called &#8220;&#36890;&#21578;&#8221;</a>&#65289;&#12290;&#27599;&#24403;&#20320;&#26356;&#26032;Freshmeat&#26465;&#30446;&#26102;&#65292;&#35813;&#26465;&#30446;&#23601;&#20250;&#20986;&#29616;&#22312;Freshmeat&#24403;&#26085;&#30340;&#21464;&#26356;&#21015;&#34920;&#20013;&#12290;&#36825;&#20010;&#21464;&#26356;&#21015;&#34920;&#19981;&#20165;&#20165;&#20250;&#22312;Freshmeat&#26412;&#36523;&#26356;&#26032;&#65292;&#20063;&#20250;&#20986;&#29616;&#22312;&#35768;&#22810;&#34987;&#24456;&#22810;&#20154;&#20851;&#27880;&#30340;&#38376;&#25143;&#31449;&#28857;&#65288;&#21253;&#25324;<a class="ulink" href="http://slashdot.org" target="_top">http://slashdot.org</a>&#65289;&#19978;&#12290;Freshmeat&#20063;&#20250;&#36890;&#36807;&#20379;&#31295;&#25552;&#20379;&#30456;&#21516;&#30340;&#25968;&#25454;&#65292;&#25152;&#20197;&#21363;&#20351;&#37027;&#20123;&#27809;&#26377;&#35746;&#38405;&#20320;&#30340;&#39033;&#30446;&#20379;&#31295;&#30340;&#20154;&#65292;&#20063;&#20250;&#36890;&#36807;Freshmeat&#30475;&#21040;&#22768;&#26126;&#12290;</p></li><li class="listitem"><p>&#21521;&#20320;&#30340;&#39033;&#30446;&#22768;&#26126;&#37038;&#20214;&#21015;&#34920;&#21457;&#36865;&#19968;&#20010;&#37038;&#20214;&#12290;&#36825;&#20010;&#21015;&#34920;&#30340;&#21517;&#31216;&#24212;&#24403;&#26159;&#8220;announce&#8221;&#65292;&#20363;&#22914;<code class="literal">announce@yourprojectdomain.org</code>&#65292;&#22240;&#20026;&#29616;&#22312;&#36825;&#24050;&#32463;&#25104;&#20026;&#20102;&#26631;&#20934;&#30340;&#20064;&#24815;&#65292;&#32780;&#19988;&#21015;&#34920;&#30340;&#31649;&#29702;&#32773;&#19968;&#23450;&#35201;&#35828;&#26126;&#35813;&#21015;&#34920;&#30340;&#20869;&#23481;&#24456;&#23569;&#65292;&#20165;&#29992;&#20110;&#20027;&#35201;&#30340;&#39033;&#30446;&#22768;&#26126;&#12290;&#22823;&#22810;&#25968;&#27492;&#31867;&#22768;&#26126;&#37117;&#26159;&#20851;&#20110;&#36719;&#20214;&#30340;&#26032;&#29256;&#26412;&#65292;&#20294;&#26159;&#20598;&#23572;&#20063;&#20250;&#20854;&#20182;&#20107;&#20214;&#65292;&#20363;&#22914;<span>&#26412;&#31456;&#21518;&#38754;&#35828;&#30340;</span>&#21215;&#38598;&#36164;&#37329;&#28608;&#21169;&#65292;&#21457;&#29616;&#23433;&#20840;&#28431;&#27934;&#65288;&#35265;<a class="xref" href="publicity.html#security" title="&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;">the section called &#8220;&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;&#8221;</a>&#65289;&#65292;&#25110;&#32773;&#39033;&#30446;&#26041;&#21521;&#30340;&#37325;&#22823;&#36716;&#31227;&#65292;&#20063;&#20250;&#21457;&#24067;&#21040;&#36825;&#37324;&#12290;&#22240;&#20026;&#20869;&#23481;&#24456;&#23569;&#65292;&#21482;&#29992;&#20110;&#37325;&#22823;&#20107;&#20214;&#65292;&#25152;&#20197;<code class="literal">announce</code>&#21015;&#34920;&#36890;&#24120;&#26159;&#39033;&#30446;&#20013;&#35746;&#38405;&#26368;&#22810;&#30340;&#21015;&#34920;&#65288;&#24403;&#28982;&#65292;&#36825;&#24847;&#21619;&#30528;&#20320;&#19981;&#35201;&#28389;&#29992;&#23427;&#8212;&#21457;&#24067;&#20043;&#21069;&#19968;&#23450;&#35201;&#23567;&#24515;&#65289;&#12290;&#20026;&#20102;&#38450;&#27490;&#20854;&#20182;&#20154;&#65292;&#29978;&#33267;&#26159;&#22403;&#22334;&#37038;&#20214;&#21457;&#20986;&#22768;&#26126;&#65292;<code class="literal">announce</code>&#21015;&#34920;&#24212;&#35813;&#19968;&#30452;&#38656;&#35201;&#23457;&#26680;&#12290;</p></li></ol></div><p>&#35201;&#21147;&#20105;&#22312;&#25152;&#26377;&#30340;&#19977;&#20010;&#22320;&#26041;&#21516;&#26102;&#20316;&#20986;&#22768;&#26126;&#65292;&#36234;&#25509;&#36817;&#36234;&#22909;&#12290;&#20154;&#20204;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#30475;&#21040;&#22768;&#26126;&#65292;&#32780;&#22312;&#20027;&#39029;&#25110;&#26032;&#38395;&#21457;&#24067;&#21306;&#19978;&#27809;&#26377;&#23545;&#24212;&#30340;&#20869;&#23481;&#26102;&#23601;&#20250;&#24863;&#21040;&#22256;&#24785;&#12290;&#22914;&#26524;&#20320;&#33021;&#23558;&#21508;&#26041;&#38754;&#30340;&#65288;&#37038;&#20214;&#12289;&#32593;&#39029;&#31561;&#31561;&#65289;&#20462;&#25913;&#25490;&#38431;&#65292;&#24182;&#20381;&#27425;&#21457;&#20986;&#65292;&#20320;&#21487;&#20197;&#23558;&#36825;&#31181;&#26102;&#38388;&#24046;&#25511;&#21046;&#21040;&#26368;&#23567;&#12290;</p><p>&#23545;&#20110;&#19981;&#22826;&#37325;&#35201;&#30340;&#20107;&#20214;&#65292;&#20320;&#21487;&#20197;&#30465;&#30053;&#19978;&#38754;&#30340;&#26576;&#20010;&#21457;&#24067;&#20986;&#21475;&#12290;&#26681;&#25454;&#20107;&#20214;&#30340;&#37325;&#35201;&#31243;&#24230;&#65292;&#35813;&#20107;&#20214;&#36824;&#26159;&#20250;&#34987;&#22806;&#37096;&#19990;&#30028;&#27880;&#24847;&#21040;&#12290;&#20363;&#22914;&#65292;&#36719;&#20214;&#30340;&#19968;&#20010;&#26032;&#29256;&#26412;&#26159;&#20027;&#35201;&#20107;&#20214;&#65292;&#32780;&#35774;&#23450;&#19979;&#19968;&#27425;&#21457;&#24067;&#30340;&#26085;&#26399;&#65292;&#21363;&#20351;&#26377;&#20123;&#26032;&#38395;&#20215;&#20540;&#65292;&#20063;&#19981;&#20250;&#27604;&#21457;&#24067;&#26412;&#36523;&#26356;&#37325;&#35201;&#12290;&#35774;&#23450;&#26085;&#26399;&#20540;&#24471;&#25105;&#20204;&#22312;&#26085;&#24120;&#37038;&#20214;&#21015;&#34920;&#65288;&#32780;&#19981;&#26159;&#22768;&#26126;&#21015;&#34920;&#65289;&#20013;&#21457;&#19968;&#20010;&#37038;&#20214;&#65292;&#20197;&#21450;&#26356;&#26032;&#39033;&#30446;&#26102;&#38388;&#32447;&#25110;&#32593;&#39029;&#29366;&#24577;&#65292;&#20294;&#20165;&#27492;&#32780;&#24050;&#12290;</p><p>&#28982;&#32780;&#65292;&#20320;&#36824;&#26159;&#20250;&#22312;&#32593;&#19978;&#30340;&#20854;&#20182;&#22320;&#26041;&#30340;&#35752;&#35770;&#20013;&#30475;&#21040;&#26085;&#26399;&#12290;&#22312;&#20320;&#30340;&#21015;&#34920;&#20013;&#30340;&#28508;&#20239;&#32773;&#20165;&#20165;&#20250;&#21548;&#65292;&#32780;&#19981;&#20250;&#35828;&#20219;&#20309;&#20107;&#65292;&#24182;&#19981;&#19968;&#23450;&#22312;&#20854;&#20182;&#22320;&#26041;&#20063;&#26159;&#27785;&#40664;&#30340;&#12290;&#21475;&#30865;&#20250;&#36896;&#25104;&#24191;&#27867;&#30340;&#20256;&#25773;&#65307;&#20320;&#24517;&#39035;&#32771;&#34385;&#21040;&#36825;&#19968;&#28857;&#65292;&#20351;&#29992;&#36825;&#31181;&#26041;&#24335;&#26500;&#24314;&#26356;&#23567;&#30340;&#22768;&#26126;&#65292;&#40723;&#21169;&#20449;&#24687;&#20256;&#36882;&#30340;&#31934;&#30830;&#24615;&#12290;&#29305;&#21035;&#30340;&#65292;&#20320;&#26399;&#26395;&#24341;&#29992;&#25991;&#31456;&#19968;&#23450;&#35201;&#22312;&#26126;&#30830;&#30340;&#22312;&#24341;&#29992;&#37096;&#20998;&#20986;&#29616;&#65292;&#23601;&#20687;&#20320;&#22312;&#20889;&#27491;&#24335;&#30340;&#26032;&#38395;&#31295;&#12290;&#20363;&#22914;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#20165;&#20165;&#26159;&#36827;&#24230;&#26356;&#26032;&#65306;&#25105;&#20204;&#35745;&#21010;&#22312;2005&#24180;8&#26376;&#20013;&#26092;&#21457;&#24067;Scanley&#30340;2.0&#29256;&#26412;&#12290;&#20320;&#21487;&#20197;&#26816;&#26597;http://www.scanley.org/status.html&#30340;&#26356;&#26032;&#12290;&#26032;&#29305;&#24615;&#26159;&#27491;&#21017;&#34920;&#36798;&#24335;&#25628;&#32034;&#12290;</em></span></p><p><span class="emphasis"><em>&#20854;&#20182;&#29305;&#24615;&#21253;&#25324;&#65306; ...&#20063;&#20250;&#21253;&#21547;&#20854;&#20182;bug&#20462;&#27491;&#65292;&#21253;&#25324; ...</em></span></p></blockquote></div><p>&#31532;&#19968;&#27573;&#24456;&#31616;&#30701;&#65292;&#20165;&#25552;&#20379;&#20102;&#26368;&#37325;&#35201;&#30340;&#20449;&#24687;&#65288;&#21457;&#24067;&#26085;&#26399;&#21644;&#20027;&#35201;&#26032;&#29305;&#24615;&#65289;&#65292;&#20197;&#21450;&#35775;&#38382;&#36827;&#19968;&#27493;&#26032;&#38395;&#30340;URL&#12290;&#22914;&#26524;&#26576;&#20154;&#30340;&#23631;&#24149;&#20165;&#20986;&#29616;&#36825;&#20010;&#27573;&#33853;&#65292;&#20063;&#23436;&#25104;&#30340;&#36275;&#22815;&#22909;&#20102;&#12290;&#37038;&#20214;&#30340;&#20313;&#19979;&#37096;&#20998;&#21487;&#20197;&#30465;&#30053;&#65292;&#19981;&#20250;&#25439;&#22833;&#20869;&#23481;&#30340;&#35201;&#28857;&#12290;&#24403;&#28982;&#65292;&#26377;&#26102;&#20154;&#20204;&#20250;&#38142;&#25509;&#25972;&#20010;&#37038;&#20214;&#65292;&#20294;&#26159;&#26356;&#24120;&#35265;&#30340;&#65292;&#20182;&#20204;&#21482;&#20250;&#24341;&#29992;&#19968;&#23567;&#37096;&#20998;&#12290;&#20551;&#35774;&#21518;&#19968;&#31181;&#30340;&#21487;&#33021;&#24615;&#65292;&#20320;&#25152;&#20570;&#30340;&#20063;&#35753;&#20182;&#20204;&#30340;&#24037;&#20316;&#26356;&#23481;&#26131;&#65292;&#27492;&#22806;&#20063;&#22240;&#20026;&#25152;&#24341;&#29992;&#30340;&#20869;&#23481;&#33719;&#24471;&#20102;&#26356;&#22810;&#30340;&#24433;&#21709;&#21147;&#12290;</p><div class="sect2" title="&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;"><div class="titlepage"><div><div><h3 class="title"><a name="security"></a>&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;</h3></div></div></div><p>&#23433;&#20840;&#28431;&#27934;&#30340;&#22788;&#29702;&#19982;&#20854;&#20182;&#31867;&#22411;bug&#25253;&#21578;&#26377;&#25152;&#19981;&#21516;&#12290;&#22312;&#33258;&#30001;&#36719;&#20214;&#20013;&#65292;&#20844;&#24320;&#36879;&#26126;&#30340;&#24037;&#20316;&#26041;&#24335;&#36890;&#24120;&#20960;&#20046;&#26159;&#23447;&#25945;&#20449;&#26465;&#12290;&#21482;&#35201;&#20320;&#24895;&#24847;&#65292;&#26631;&#20934;bug&#22788;&#29702;&#36807;&#31243;&#30340;&#27599;&#20010;&#27493;&#39588;&#37117;&#26159;&#21487;&#35265;&#30340;&#65306;&#26368;&#21021;&#21040;&#26469;&#30340;&#25253;&#21578;&#65292;&#23454;&#29616;&#30830;&#35748;&#30340;&#35752;&#35770;&#20197;&#21450;&#26368;&#32456;&#30340;&#20462;&#27491;&#12290;</p><p>&#23433;&#20840;bug&#21017;&#26377;&#20123;&#19981;&#21516;&#12290;&#23427;&#20204;&#20250;&#21361;&#21450;&#29992;&#25143;&#25968;&#25454;&#65292;&#29978;&#33267;&#26159;&#29992;&#25143;&#30340;&#25972;&#20010;&#30005;&#33041;&#12290;&#22914;&#26524;&#20844;&#24320;&#35752;&#35770;&#36825;&#20010;&#38382;&#39064;&#65292;&#23601;&#26159;&#23558;&#20854;&#20844;&#31034;&#22825;&#19979;&#8212;&#21253;&#25324;&#37027;&#20123;&#20250;&#24694;&#24847;&#21033;&#29992;&#36825;&#20010;bug&#30340;&#20154;&#12290;&#29978;&#33267;&#20165;&#20165;&#26159;&#26377;&#25928;&#29575;&#30340;&#25552;&#20132;&#19968;&#20010;&#20462;&#27491;&#23459;&#24067;bug&#30340;&#23384;&#22312;&#65288;&#20250;&#26377;&#28508;&#22312;&#30340;&#25915;&#20987;&#32773;&#30475;&#21040;&#20844;&#24320;&#39033;&#30446;&#30340;&#25552;&#20132;&#26085;&#24535;&#65292;&#26377;&#31995;&#32479;&#30340;&#26597;&#25214;&#21464;&#26356;&#65292;&#20197;&#20415;&#22312;&#20197;&#21069;&#30340;&#20195;&#30721;&#20013;&#33719;&#21462;&#23433;&#20840;&#38382;&#39064;&#65289;&#12290;&#22823;&#22810;&#25968;&#24320;&#28304;&#39033;&#30446;&#37117;&#20026;&#20844;&#24320;&#24615;&#21644;&#31192;&#23494;&#24615;&#30340;&#20914;&#31361;&#20934;&#22791;&#20102;&#30456;&#21516;&#30340;&#22788;&#29702;&#27493;&#39588;&#65292;&#22522;&#20110;&#22914;&#19979;&#30340;&#22522;&#26412;&#25351;&#23548;&#26041;&#38024;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#22312;&#21457;&#29616;&#20462;&#27491;&#20043;&#21069;&#65292;&#19981;&#35201;&#20844;&#24320;&#35848;&#35770;bug&#65307;&#28982;&#21518;&#22312;&#23459;&#24067;bug&#30340;&#21516;&#26102;&#31435;&#21051;&#25552;&#20379;&#20462;&#27491;&#12290;</p></li><li class="listitem"><p>&#23613;&#21487;&#33021;&#36805;&#36895;&#30340;&#23436;&#25104;&#20462;&#27491;&#8212;&#29305;&#21035;&#26159;&#22914;&#26524;&#39033;&#30446;&#22806;&#30340;&#26576;&#20154;&#25253;&#21578;&#20102;&#36825;&#20010;bug&#65292;&#22240;&#27492;&#20320;&#30693;&#36947;&#33267;&#23569;&#26377;&#19968;&#20010;&#39033;&#30446;&#22806;&#30340;&#20154;&#33021;&#22815;&#30772;&#35299;&#36825;&#20010;&#28431;&#27934;&#26102;&#12290;</p></li></ol></div><p>&#22312;&#23454;&#36341;&#20013;&#65292;&#37027;&#20123;&#21407;&#29702;&#20250;&#23548;&#33268;&#19968;&#31995;&#21015;&#26631;&#20934;&#21270;&#30340;&#27493;&#39588;&#65292;&#23558;&#20250;&#22312;&#19979;&#38754;&#30340;&#23567;&#33410;&#25551;&#36848;&#12290;</p><div class="sect3" title="&#25509;&#25910;&#25253;&#21578;"><div class="titlepage"><div><div><h4 class="title"><a name="security-receiving"></a>&#25509;&#25910;&#25253;&#21578;</h4></div></div></div><p>&#24456;&#26126;&#26174;&#65292;&#20154;&#20204;&#38656;&#35201;&#20174;&#20219;&#20309;&#20154;&#37027;&#37324;&#25509;&#25910;&#23433;&#20840;&#25253;&#21578;&#30340;&#33021;&#21147;&#12290;&#20294;&#26159;&#19981;&#33021;&#29992;&#24120;&#35268;&#30340;bug&#25253;&#21578;&#22320;&#22336;&#65292;&#22240;&#20026;&#37027;&#26679;&#25152;&#26377;&#20154;&#37117;&#20250;&#30475;&#21040;&#12290;&#22240;&#27492;&#65292;&#21487;&#20197;&#35774;&#23450;&#19968;&#20010;&#25509;&#25910;&#23433;&#20840;bug&#25253;&#21578;&#30340;&#37038;&#20214;&#21015;&#34920;&#12290;&#36825;&#20010;&#37038;&#20214;&#21015;&#34920;&#19968;&#23450;&#19981;&#35201;&#26377;&#20844;&#20849;&#21487;&#35835;&#30340;&#24402;&#26723;&#65292;&#32780;&#19988;&#24517;&#39035;&#20005;&#26684;&#25511;&#21046;&#20854;&#35746;&#38405;&#26435;&#8212;&#21482;&#26377;&#38271;&#26399;&#21487;&#20449;&#30340;&#24320;&#21457;&#32773;&#21487;&#20197;&#22312;&#21015;&#34920;&#19978;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#20026;&#8220;&#21487;&#20449;&#30340;&#8221;&#20316;&#20986;&#27491;&#24335;&#30340;&#23450;&#20041;&#65292;&#21487;&#20197;&#35268;&#23450;&#20026;&#8220;&#25152;&#26377;&#25552;&#20132;&#36807;&#20004;&#24180;&#21450;&#20197;&#19978;&#30340;&#20154;&#8221;&#65292;&#25110;&#31867;&#20284;&#30340;&#65292;&#36991;&#20813;&#20559;&#34962;&#12290;&#36825;&#23558;&#20250;&#26159;&#22788;&#29702;&#23433;&#20840;bug&#30340;&#22242;&#38431;&#12290;</p><p>&#29702;&#24819;&#29366;&#24577;&#19979;&#65292;&#23433;&#20840;&#21015;&#34920;&#19981;&#24212;&#35813;&#26159;&#22403;&#22334;&#20445;&#25252;&#30340;&#25110;&#38656;&#35201;&#32463;&#36807;&#23457;&#26680;&#30340;&#65292;&#22240;&#20026;&#20320;&#19981;&#20250;&#24076;&#26395;&#20165;&#20165;&#22240;&#20026;&#22312;&#21608;&#26411;&#27809;&#26377;&#23457;&#26680;&#32773;&#32780;&#36896;&#25104;&#37325;&#35201;&#30340;&#25253;&#21578;&#34987;&#36807;&#28388;&#25481;&#25110;&#32773;&#34987;&#24310;&#36831;&#12290;&#22914;&#26524;&#20320;&#20351;&#29992;&#33258;&#21160;&#22403;&#22334;&#37038;&#20214;&#20445;&#25252;&#36719;&#20214;&#65292;&#21487;&#20197;&#23581;&#35797;&#20351;&#29992;&#36739;&#39640;&#30340;&#23481;&#24525;&#35774;&#32622;&#65307;&#20801;&#35768;&#37096;&#20998;&#22403;&#22334;&#37038;&#20214;&#36890;&#36807;&#24635;&#27604;&#28431;&#25481;&#19968;&#20010;&#25253;&#21578;&#35201;&#22909;&#12290;&#24403;&#28982;&#65292;&#20026;&#20102;&#21015;&#34920;&#30340;&#25928;&#29575;&#65292;&#20320;&#24212;&#24403;&#23558;&#21015;&#34920;&#30340;&#22320;&#22336;&#24191;&#32780;&#21578;&#20043;&#65307;&#20294;&#26159;&#22240;&#20026;&#23427;&#27809;&#26377;&#23457;&#26680;&#65292;&#25110;&#32773;&#21482;&#26377;&#36731;&#24494;&#30340;&#38450;&#22403;&#22334;&#35774;&#32622;&#65292;&#19968;&#23450;&#35201;&#30830;&#20445;&#35201;&#26377;&#37038;&#20214;&#22320;&#22336;&#38544;&#34255;&#30340;&#21464;&#21270;&#65292;&#23601;&#20687;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#20013;</span>&#30340;<a class="xref" href="mailing-lists.html#address-hiding" title="&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;">the section called &#8220;&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;&#8221;</a>&#25152;&#35828;&#30340;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;&#22320;&#22336;&#38544;&#34255;&#19981;&#38656;&#35201;&#23558;&#22320;&#22336;&#21464;&#30340;&#38590;&#20197;&#35782;&#21035;&#65307;&#20030;&#20010;&#20363;&#23376;&#65292;&#21487;&#20197;&#30475;<a class="ulink" href="http://subversion.tigris.org/security.html" target="_top">http://subversion.tigris.org/security.html</a>&#65292;&#20197;&#21450;&#35813;&#32593;&#39029;&#30340;HTML&#28304;&#20195;&#30721;&#12290;</p></div><div class="sect3" title="&#40664;&#40664;&#30340;&#24320;&#21457;&#20462;&#27491;"><div class="titlepage"><div><div><h4 class="title"><a name="security-finding-a-fix"></a>&#40664;&#40664;&#30340;&#24320;&#21457;&#20462;&#27491;</h4></div></div></div><p>&#24403;&#25509;&#25910;&#21040;&#25253;&#21578;&#26102;&#65292;&#22312;&#23433;&#20840;&#21015;&#34920;&#19978;&#35201;&#24590;&#20040;&#20570;&#65311;&#39318;&#35201;&#20219;&#21153;&#26159;&#35780;&#20272;&#38382;&#39064;&#30340;&#20005;&#37325;&#24615;&#21644;&#32039;&#24613;&#24615;&#12290;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#28431;&#27934;&#24456;&#20005;&#37325;&#21527;&#65311;&#23427;&#20250;&#36896;&#25104;&#20351;&#29992;&#35813;&#36719;&#20214;&#30340;&#35745;&#31639;&#26426;&#34987;&#24694;&#24847;&#25915;&#20987;&#25509;&#31649;&#21527;&#65311;&#25110;&#32773;&#35828;&#65292;&#26159;&#21542;&#20165;&#20165;&#20250;&#27844;&#28431;&#20182;&#20204;&#25991;&#20214;&#22823;&#23567;&#30340;&#20449;&#24687;&#21527;&#65311;</p></li><li class="listitem"><p>&#30772;&#35299;&#36825;&#20010;&#28431;&#27934;&#24456;&#31616;&#21333;&#21527;&#65311;&#25915;&#20987;&#21487;&#20197;&#33050;&#26412;&#21270;&#65292;&#36824;&#26159;&#38656;&#35201;&#29615;&#22659;&#30456;&#20851;&#30340;&#30693;&#35782;&#12289;&#26377;&#24847;&#35782;&#30340;&#29468;&#27979;&#29978;&#33267;&#36816;&#27668;&#65311;</p></li><li class="listitem"><p><span class="emphasis"><em>&#35841;</em></span>&#21521;&#20320;&#25253;&#21578;&#20102;&#36825;&#20010;&#38382;&#39064;&#65311;&#24403;&#28982;&#65292;&#36825;&#20010;&#38382;&#39064;&#30340;&#31572;&#26696;&#19981;&#20250;&#25913;&#21464;&#28431;&#27934;&#30340;&#26412;&#24615;&#65292;&#20294;&#20320;&#21487;&#20197;&#20197;&#27492;&#21028;&#26029;&#26377;&#22810;&#23569;&#20154;&#20102;&#35299;&#27492;&#20107;&#12290;&#22914;&#26524;&#25253;&#21578;&#26469;&#33258;&#20110;&#39033;&#30446;&#33258;&#24049;&#30340;&#24320;&#21457;&#32773;&#65292;&#20320;&#21487;&#20197;&#26494;&#19968;&#21475;&#27668;&#20102;&#65288;&#20063;&#23601;&#19968;&#21475;&#65289;&#65292;&#22240;&#20026;&#20320;&#21487;&#20197;&#30456;&#20449;&#20182;&#20204;&#19981;&#20250;&#21578;&#35785;&#21035;&#20154;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#26159;&#26469;&#33258;&#31867;&#20284;<code class="literal">anonymous14@globalhackerz.net</code>&#30340;&#37038;&#20214;&#65292;&#20320;&#26368;&#22909;&#31435;&#21363;&#34892;&#21160;&#12290;&#23613;&#31649;&#36825;&#20010;&#22909;&#20154;&#25552;&#37266;&#20102;&#20320;&#65292;&#20294;&#20320;&#26080;&#27861;&#30693;&#26195;&#22905;&#21578;&#35785;&#20102;&#22810;&#23569;&#20154;&#65292;&#25110;&#32773;&#22905;&#36824;&#20250;&#31561;&#22810;&#23569;&#26102;&#38388;&#21435;&#30772;&#35299;&#27491;&#24335;&#23433;&#35013;&#31995;&#32479;&#20013;&#30340;&#36825;&#20010;&#28431;&#27934;&#12290;</p></li></ol></div><p>&#35831;&#27880;&#24847;&#65292;&#25105;&#20204;&#36825;&#37324;&#35752;&#35770;&#30340;&#33539;&#22260;&#20165;&#20165;&#26159;<span class="emphasis"><em>&#32039;&#24613;</em></span>&#21644;<span class="emphasis"><em>&#26497;&#31471; &#32039;&#24613;</em></span>&#20043;&#38388;&#12290;&#21363;&#20351;&#25253;&#21578;&#26469;&#33258;&#20110;&#19968;&#20010;&#24050;&#30693;&#30340;&#12289;&#21451;&#22909;&#30340;&#26469;&#28304;&#65292;&#32593;&#19978;&#30340;&#20854;&#20182;&#20154;&#20063;&#21487;&#33021;&#26089;&#23601;&#21457;&#29616;&#20102;&#36825;&#20010;bug&#65292;&#21482;&#26159;&#27809;&#26377;&#25253;&#21578;&#12290;&#21807;&#19968;&#19981;&#32039;&#24613;&#30340;&#24773;&#20917;&#26159;&#65292;bug&#22312;&#26412;&#24615;&#19978;&#19981;&#20250;&#20005;&#37325;&#30340;&#24433;&#21709;&#23433;&#20840;&#12290;</p><p>&#21478;&#22806;&#65292;&#8220;<code class="literal">anonymous14@globalhackerz.net</code>&#8221;&#30340;&#20363;&#23376;&#24182;&#19981;&#21487;&#31505;&#12290;&#20320;&#21487;&#33021;&#30495;&#30340;&#20250;&#20174;&#38544;&#24418;&#36523;&#20221;&#30340;&#20154;&#37027;&#37324;&#24471;&#21040;bug&#25253;&#21578;&#65292;&#26681;&#25454;&#20182;&#20204;&#30340;&#35789;&#27719;&#21644;&#34892;&#20026;&#65292;&#20320;&#26080;&#27861;&#21028;&#26029;&#20182;&#20204;&#26159;&#21542;&#31449;&#22312;&#20320;&#19968;&#36793;&#12290;&#36825;&#27809;&#26377;&#20851;&#31995;&#65306;&#22914;&#26524;&#20182;&#20204;&#21521;&#20320;&#25253;&#21578;&#20102;&#23433;&#20840;&#28431;&#27934;&#65292;&#20182;&#20204;&#20250;&#35273;&#24471;&#29702;&#24212;&#24471;&#21040;&#22909;&#30340;&#22238;&#25253;&#65292;&#20320;&#24212;&#24403;&#21451;&#22909;&#30340;&#22238;&#24212;&#12290;&#24863;&#35874;&#20182;&#20204;&#30340;&#25253;&#21578;&#65292;&#32473;&#20182;&#20204;&#19968;&#20010;&#21457;&#24067;&#20462;&#27491;&#30340;&#26102;&#38388;&#25110;&#25130;&#27490;&#26102;&#38388;&#65292;&#24182;&#19982;&#20182;&#20204;&#20445;&#25345;&#32852;&#31995;&#12290;&#26377;&#26102;&#65292;&#20182;&#20204;&#20250;&#32473;<span class="emphasis"><em>&#20320;</em></span>&#19968;&#20010;&#26085;&#26399;&#8212;&#37027;&#26159;&#23558;&#22312;&#35813;&#26085;&#26399;&#20844;&#24067;bug&#30340;&#23041;&#32961;&#30340;&#26263;&#31034;&#65292;&#26080;&#35770;&#24403;&#26102;&#20320;&#26159;&#21542;&#24050;&#32463;&#20934;&#22791;&#22949;&#24403;&#12290;&#36825;&#30475;&#36215;&#26469;&#20687;&#26159;&#19968;&#31181;&#26435;&#21033;&#30340;&#27450;&#20940;&#28216;&#25103;&#65292;&#20294;&#26159;&#26356;&#20687;&#26159;&#19968;&#31181;&#39044;&#20808;&#30340;&#20813;&#30123;&#34892;&#21160;&#65292;&#22240;&#20026;&#20043;&#21069;&#26377;&#23545;&#35768;&#22810;&#20196;&#20154;&#22833;&#26395;&#30340;&#36831;&#38045;&#30340;&#36719;&#20214;&#21046;&#36896;&#32773;&#65292;&#27809;&#26377;&#23558;&#23433;&#20840;&#25253;&#21578;&#35748;&#30495;&#23545;&#24453;&#12290;&#26080;&#35770;&#22914;&#20309;&#65292;&#20320;&#19981;&#33021;&#23545;&#20182;&#35270;&#32780;&#19981;&#35265;&#65292;&#27605;&#31455;&#65292;&#22914;&#26524;bug&#24456;&#20005;&#37325;&#65292;&#20182;&#25317;&#26377;&#30340;&#30693;&#35782;&#20250;&#32473;&#20320;&#24102;&#26469;&#24456;&#22823;&#30340;&#40635;&#28902;&#12290;&#21451;&#22909;&#30340;&#23545;&#24453;&#36825;&#31181;&#25253;&#21578;&#32773;&#65292;&#24076;&#26395;&#20182;&#20204;&#20063;&#33021;&#25237;&#26691;&#25253;&#26446;&#12290;</p><p>&#21478;&#19968;&#20010;&#23433;&#20840;bug&#30340;&#24120;&#35265;&#25253;&#21578;&#32773;&#26159;&#23433;&#20840;&#19987;&#23478;&#65292;&#19968;&#20123;&#38271;&#26399;&#23457;&#26680;&#20195;&#30721;&#24182;&#38075;&#30740;&#36719;&#20214;&#28431;&#27934;&#30340;&#20154;&#12290;&#36825;&#20123;&#20154;&#36890;&#24120;&#31934;&#36890;&#20004;&#20010;&#39046;&#22495;&#8212;&#20182;&#20204;&#19981;&#20165;&#20250;&#25509;&#25910;&#65292;&#20063;&#20250;&#21457;&#36865;&#25253;&#21578;&#65292;&#21487;&#33021;&#27604;&#20320;&#39033;&#30446;&#30340;&#22823;&#22810;&#25968;&#24320;&#21457;&#32773;&#37117;&#22810;&#12290;&#20182;&#20204;&#20063;&#36890;&#24120;&#20250;&#20026;&#20462;&#27491;&#26576;&#20010;&#28431;&#27934;&#35774;&#23450;&#20844;&#24067;&#20110;&#20247;&#30340;&#25130;&#27490;&#26085;&#26399;&#12290;&#25130;&#27490;&#26085;&#26399;&#20063;&#35768;&#21487;&#20197;&#35752;&#20215;&#36824;&#20215;&#65292;&#20294;&#26159;&#36825;&#21462;&#20915;&#20110;&#25253;&#21578;&#32773;&#65307;&#25130;&#27490;&#26085;&#26399;&#24050;&#32463;&#25104;&#20026;&#23433;&#20840;&#19987;&#23478;&#21807;&#19968;&#35748;&#21487;&#21487;&#38752;&#26041;&#27861;&#65292;&#21487;&#20197;&#35753;&#32452;&#32455;&#36805;&#36895;&#30340;&#23450;&#20301;&#23433;&#20840;&#38382;&#39064;&#12290;&#25152;&#20197;&#65292;&#19981;&#35201;&#35748;&#20026;&#25130;&#27490;&#26085;&#26399;&#24456;&#37326;&#34542;&#65292;&#36825;&#26159;&#20037;&#32463;&#32771;&#39564;&#30340;&#20256;&#32479;&#65292;&#36825;&#26679;&#20570;&#26377;&#36275;&#22815;&#30340;&#29702;&#30001;&#12290;</p><p>&#24403;&#20320;&#30693;&#36947;&#20102;&#20005;&#37325;&#24615;&#21644;&#32039;&#24613;&#24615;&#65292;&#20320;&#23601;&#21487;&#20197;&#24320;&#22987;&#20462;&#27491;&#20102;&#12290;&#26377;&#26102;&#65292;&#38656;&#35201;&#22312;&#20248;&#38597;&#21644;&#36895;&#24230;&#20043;&#38388;&#20570;&#20986;&#26435;&#34913;&#65307;&#36825;&#20063;&#26159;&#20026;&#20160;&#20040;&#22312;&#24320;&#22987;&#21069;&#35201;&#39318;&#20808;&#30830;&#35748;&#32039;&#24613;&#24615;&#12290;&#24403;&#28982;&#65292;&#20063;&#35201;&#20445;&#35777;&#35752;&#35770;&#20165;&#38480;&#20110;&#23433;&#20840;&#21015;&#34920;&#29992;&#25143;&#65292;&#21407;&#22987;&#30340;&#25253;&#21578;&#32773;&#65288;&#22914;&#26524;&#22905;&#24076;&#26395;&#21152;&#20837;&#65289;&#65292;&#20197;&#21450;&#25152;&#26377;&#22240;&#25216;&#26415;&#21407;&#22240;&#24517;&#39035;&#21442;&#19982;&#30340;&#20154;&#20043;&#38388;&#12290;</p><p>&#19981;&#35201;&#25552;&#20132;&#20462;&#27491;&#21040;&#29256;&#26412;&#24211;&#12290;&#22312;&#20844;&#24320;&#20043;&#21069;&#65292;&#35831;&#19968;&#30452;&#29992;&#34917;&#19969;&#30340;&#24418;&#24335;&#12290;&#22914;&#26524;&#20320;&#20934;&#22791;&#25552;&#20132;&#65292;&#21363;&#20351;&#37319;&#29992;&#20102;&#26080;&#36764;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;&#20063;&#20250;&#35753;&#26576;&#20123;&#20154;&#27880;&#24847;&#21040;&#24182;&#29702;&#35299;&#27492;&#21464;&#26356;&#12290;&#20320;&#27704;&#36828;&#26080;&#27861;&#30693;&#36947;&#35841;&#22312;&#20851;&#27880;&#20320;&#30340;&#29256;&#26412;&#24211;&#65292;&#20197;&#21450;&#20182;&#20204;&#24863;&#20852;&#36259;&#30340;&#21407;&#22240;&#12290;&#20851;&#38381;&#25552;&#20132;&#37038;&#20214;&#21487;&#33021;&#20250;&#26377;&#20123;&#29992;&#65307;&#20294;&#26159;&#27605;&#31455;&#25552;&#20132;&#37038;&#20214;&#24207;&#21015;&#26412;&#36523;&#20250;&#35753;&#20154;&#36215;&#30097;&#65292;&#32780;&#19988;&#25968;&#25454;&#24050;&#32463;&#36827;&#20837;&#20102;&#29256;&#26412;&#24211;&#12290;&#21482;&#24212;&#35813;&#20197;&#34917;&#19969;&#30340;&#24418;&#24335;&#23436;&#25104;&#25152;&#26377;&#30340;&#24320;&#21457;&#65292;&#24182;&#20445;&#25345;&#34917;&#19969;&#22312;&#31169;&#23494;&#30340;&#22320;&#26041;&#65292;&#20063;&#21487;&#20197;&#26159;&#19968;&#20010;&#21333;&#29420;&#30340;&#29420;&#31435;&#29256;&#26412;&#24211;&#65292;&#21482;&#26377;&#30693;&#26195;&#27492;bug&#30340;&#20154;&#33021;&#22815;&#30693;&#36947;&#12290; &#65288;&#22914;&#26524;&#20320;&#20351;&#29992;&#20998;&#24067;&#24335;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#20363;&#22914;Arch&#25110;SVK&#65292;&#20320;&#21487;&#20197;&#22312;&#23436;&#20840;&#29256;&#26412;&#25511;&#21046;&#19979;&#23436;&#25104;&#36825;&#20010;&#24037;&#20316;&#65292;&#21482;&#38656;&#35201;&#20445;&#35777;&#22806;&#26469;&#32773;&#26080;&#27861;&#35775;&#38382;&#27492;&#29256;&#26412;&#24211;&#12290;&#65289;</p></div><div class="sect3" title="CAN/CVE&#21495;&#30721;"><div class="titlepage"><div><div><h4 class="title"><a name="security-cve"></a>CAN/CVE&#21495;&#30721;</h4></div></div></div><p>&#20320;&#25110;&#35768;&#30475;&#21040;&#36807;&#38543;&#23433;&#20840;&#38382;&#39064;&#20986;&#29616;&#30340;<em class="firstterm">CAN&#21495;&#30721;</em>&#25110;<em class="firstterm">CVE&#21495;&#30721;</em>&#12290;&#20363;&#22914;&#30475;&#36215;&#26469;&#31867;&#20284;&#8220;CAN-2004-0397&#8221;&#25110;&#8220;CVE-2002-0092&#8221;&#12290;</p><p>&#20004;&#31181;&#21495;&#30721;&#37117;&#20195;&#34920;&#20102;&#30456;&#21516;&#31867;&#22411;&#30340;&#23454;&#20307;&#65306;&#22312;<a class="ulink" href="http://cve.mitre.org/" target="_top">http://cve.mitre.org/</a>&#19978;&#32500;&#25252;&#30340;&#8220;&#24120;&#35265;&#28431;&#27934;&#21644;&#26333;&#20809;&#8221;&#21015;&#34920;&#20013;&#30340;&#19968;&#20010;&#26465;&#30446;&#12290;&#36825;&#20010;&#21015;&#34920;&#30340;&#30446;&#30340;&#20026;&#25152;&#26377;&#24050;&#30693;&#30340;&#23433;&#20840;&#38382;&#39064;&#25552;&#20379;&#26631;&#20934;&#21270;&#30340;&#21517;&#31216;&#65292;&#36825;&#26679;&#27599;&#20010;&#20154;&#37117;&#21487;&#20197;&#22312;&#35752;&#35770;&#26102;&#20351;&#29992;&#21807;&#19968;&#30340;&#26631;&#20934;&#21270;&#30340;&#21517;&#31216;&#65292;&#24182;&#25552;&#20379;&#19968;&#20010;&#21487;&#20197;&#26597;&#25214;&#26356;&#22810;&#20449;&#24687;&#30340;&#20013;&#24515;&#22320;&#28857;&#12290; &#8220;CAN&#8221;&#21644;&#8220;CVE&#8221;&#30340;&#21807;&#19968;&#21306;&#21035;&#26159;&#21069;&#32773;&#20195;&#34920;&#20102;&#20505;&#36873;&#26465;&#30446;&#65292;&#36824;&#26410;&#32463;CVE&#32534;&#36753;&#22996;&#21592;&#20250;&#35748;&#21487;&#65292;&#32780;&#21518;&#32773;&#21017;&#26159;&#32463;&#36807;&#35748;&#21487;&#30340;&#26465;&#30446;&#12290; &#28982;&#21518;&#65292;&#20004;&#31181;&#31867;&#22411;&#30340;&#26465;&#30446;&#37117;&#23545;&#20844;&#20247;&#21487;&#35265;&#65292;&#26465;&#30446;&#30340;&#32534;&#21495;&#19981;&#20250;&#38543;&#30528;&#35748;&#21487;&#32780;&#25913;&#21464;&#8212;&#20165;&#20165;&#26159;&#8220;CAN&#8221;&#21069;&#32512;&#26367;&#25442;&#25104;&#20102;&#8220;CVE&#8221;&#12290;</p><p>CAN/CVE&#26465;&#30446;&#26412;&#36523;&#24182;&#19981;&#21253;&#21547;bug&#30340;&#23436;&#25972;&#25551;&#36848;&#65292;&#20197;&#21450;&#22914;&#20309;&#38450;&#33539;&#30340;&#20449;&#24687;&#12290;&#30456;&#21453;&#65292;&#23427;&#21482;&#20250;&#21253;&#21547;&#19968;&#20010;&#31616;&#30701;&#30340;&#25688;&#35201;&#65292;&#28982;&#21518;&#26159;&#21040;&#21442;&#32771;&#21644;&#22806;&#37096;&#36164;&#28304;&#30340;&#21015;&#34920;&#65288;&#20363;&#22914;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#65289;&#65292;&#20154;&#20204;&#21487;&#20197;&#21435;&#26597;&#30475;&#35814;&#32454;&#20449;&#24687;&#12290;<a class="ulink" href="http://cve.mitre.org/" target="_top">http://cve.mitre.org/</a>&#30340;&#30495;&#27491;&#30446;&#30340;&#26159;&#25552;&#20379;&#19968;&#20010;&#32452;&#32455;&#33391;&#22909;&#30340;&#31354;&#38388;&#65292;&#27599;&#20010;&#28431;&#27934;&#37117;&#21487;&#20197;&#26377;&#19968;&#20010;&#21517;&#31216;&#20197;&#21450;&#33719;&#21462;&#26356;&#22810;&#20449;&#24687;&#30340;&#36884;&#24452;&#12290;&#19968;&#20010;&#26465;&#30446;&#30340;&#20363;&#23376;&#21487;&#20197;&#30475;<a class="ulink" href="http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092" target="_top">http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092</a>&#12290;&#35831;&#27880;&#24847;&#65292;&#24341;&#29992;&#21487;&#20197;&#38750;&#24120;&#30340;&#31616;&#27905;&#65292;&#20854;&#20013;&#30340;&#26469;&#28304;&#34920;&#29616;&#20026;&#31070;&#31192;&#30340;&#32553;&#20889;&#12290;&#36825;&#20123;&#32553;&#20889;&#30340;&#20851;&#38190;&#28857;&#21487;&#20197;&#30475;<a class="ulink" href="http://cve.mitre.org/data/refs/refkey.html" target="_top">http://cve.mitre.org/data/refs/refkey.html</a>&#12290;</p><p>&#22914;&#26524;&#20320;&#30340;&#28431;&#27934;&#36798;&#21040;&#20102;CVE&#30340;&#26631;&#20934;&#65292;&#20320;&#25110;&#35768;&#20250;&#24076;&#26395;&#24471;&#21040;&#19968;&#20010;CAN&#21495;&#30721;&#12290;&#36825;&#20010;&#36807;&#31243;&#26159;&#25925;&#24847;&#23553;&#38381;&#30340;&#65306;&#19968;&#33324;&#26469;&#35828;&#65292;&#20320;&#38656;&#35201;&#35748;&#35782;&#26576;&#20154;&#65292;&#25110;&#35748;&#35782;&#26576;&#20154;&#35748;&#35782;&#26576;&#20154;&#12290;&#36825;&#24182;&#19981;&#26159;&#34920;&#38754;&#19978;&#30340;&#37027;&#20040;&#30127;&#29378;&#12290;&#20026;&#20102;&#36991;&#20813;&#34987;&#20266;&#36896;&#30340;&#25110;&#32534;&#20889;&#31967;&#31957;&#30340;&#25552;&#20132;&#21387;&#22446;&#65292;CVE&#32534;&#36753;&#22996;&#21592;&#20250;&#21482;&#20174;&#24050;&#30693;&#21644;&#20449;&#20219;&#30340;&#26469;&#28304;&#33719;&#21462;&#25552;&#20132;&#12290;&#28982;&#32780;&#65292;&#20026;&#20102;&#33719;&#21462;&#20320;&#30340;&#28431;&#27934;&#21015;&#34920;&#65292;&#20320;&#38656;&#35201;&#20174;&#20320;&#30340;&#39033;&#30446;&#25214;&#19968;&#20010;CVE&#32534;&#36753;&#22996;&#21592;&#20250;&#35748;&#35782;&#30340;&#20154;&#12290;&#22312;&#20320;&#30340;&#24320;&#21457;&#32773;&#20013;&#35810;&#38382;&#19968;&#19979;&#26159;&#21542;&#35748;&#35782;&#26576;&#20154;&#20043;&#21069;&#26366;&#32463;&#23436;&#25104;&#36807;CAN&#36807;&#31243;&#65292;&#25110;&#30693;&#36947;&#26576;&#20154;&#20250;&#35748;&#35782;&#12290;&#36825;&#26679;&#20570;&#30340;&#22909;&#22788;&#26159;&#35813;&#38142;&#36335;&#19978;&#30340;&#26576;&#22788;&#65292;&#26576;&#20154;&#20250;&#30693;&#36947;&#36275;&#22815;&#30340;&#20449;&#24687;&#21578;&#35785;&#20320; a) &#26681;&#25454;MITRE&#30340;&#26631;&#20934;&#65292;&#23427;&#19981;&#20250;&#20316;&#20026;&#28431;&#27934;&#25110;&#26333;&#20809;&#65292;&#25152;&#20197;&#27809;&#26377;&#25552;&#20132;&#30340;&#24847;&#20041;&#65292;&#25110;&#32773; b) &#36825;&#20010;&#28431;&#27934;&#24050;&#32463;<span class="emphasis"><em>&#26377;&#20102;</em></span>CAN&#25110;CVE&#21495;&#30721;&#12290;&#21518;&#32773;&#21487;&#33021;&#26159;&#22240;&#20026;&#35813;bug&#24050;&#32463;&#22312;&#21478;&#19968;&#20010;&#23433;&#20840;&#24544;&#21578;&#21015;&#34920;&#19978;&#21457;&#24067;&#20102;&#65292;&#20363;&#22914;&#20301;&#20110;<a class="ulink" href="http://www.cert.org/" target="_top">http://www.cert.org/</a>&#25110;&#32773;&#20301;&#20110;<a class="ulink" href="http://www.securityfocus.com/" target="_top">http://www.securityfocus.com/</a>&#30340;BugTraq&#37038;&#20214;&#21015;&#34920;&#12290; &#65288;&#22914;&#26524;&#26159;&#22312;&#20320;&#30340;&#39033;&#30446;&#23545;&#27492;&#19968;&#26080;&#25152;&#30693;&#30340;&#24773;&#20917;&#19979;&#21457;&#29983;&#20102;&#36825;&#31181;&#24773;&#20917;&#65292;&#20320;&#19968;&#23450;&#20250;&#25285;&#24515;&#36824;&#26377;&#20160;&#20040;&#19981;&#30693;&#36947;&#30340;&#12290;&#65289;</p><p>&#22914;&#26524;&#20320;&#24050;&#32463;&#24471;&#21040;&#20102;CAN/CVE&#21495;&#30721;&#65292;&#20320;&#19968;&#23450;&#24076;&#26395;&#23613;&#26089;&#23558;&#20854;&#32435;&#20837;bug&#30740;&#31350;&#20013;&#26469;&#65292;&#36825;&#26679;&#20197;&#21518;&#30340;&#25152;&#26377;&#20132;&#27969;&#37117;&#21487;&#20197;&#24341;&#29992;&#36825;&#20010;&#21495;&#30721;&#12290;&#22312;&#20844;&#24067;&#20043;&#21069;&#65292;CAN&#26465;&#30446;&#20250;&#34987;&#31105;&#27490;&#35775;&#38382;&#65307;&#36825;&#20010;&#26465;&#30446;&#20250;&#20316;&#20026;&#21344;&#20301;&#31526;&#20445;&#25345;&#65288;&#36825;&#26679;&#23601;&#19981;&#20250;&#20002;&#22833;&#21517;&#31216;&#65289;&#65292;&#20294;&#19981;&#20250;&#25581;&#31034;&#20219;&#20309;&#28431;&#27934;&#20449;&#24687;&#65292;&#30452;&#21040;&#20320;&#23459;&#24067;&#27492;bug&#24182;&#20462;&#27491;&#20102;&#23427;&#12290;</p><p>&#20851;&#20110;CAN/CVE&#27969;&#31243;&#30340;&#26356;&#22810;&#20449;&#24687;&#21487;&#20197;&#26597;&#30475;<a class="ulink" href="http://cve.mitre.org/about/candidates.html" target="_top">http://cve.mitre.org/about/candidates.html</a>&#65292;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#20013;&#20351;&#29992;CAN/CVE&#21495;&#30721;&#30340;&#20363;&#23376;&#21487;&#20197;&#30475;<a class="ulink" href="http://www.debian.org/security/cve-compatibility" target="_top">http://www.debian.org/security/cve-compatibility</a>&#12290;</p></div><div class="sect3" title="&#39044;&#36890;&#30693;"><div class="titlepage"><div><div><h4 class="title"><a name="security-prenotification"></a>&#39044;&#36890;&#30693;</h4></div></div></div><p>&#19968;&#26086;&#20320;&#30340;&#23433;&#20840;&#21709;&#24212;&#22242;&#38431;&#65288;&#37027;&#20123;&#22312;&#23433;&#20840;&#37038;&#20214;&#21015;&#34920;&#19978;&#30340;&#24320;&#21457;&#32773;&#65292;&#25110;&#32773;&#37027;&#20123;&#20320;&#35748;&#20026;&#24212;&#35813;&#21152;&#20837;&#21040;&#35299;&#20915;&#29305;&#23450;&#25253;&#21578;&#30340;&#20154;&#65289;&#20934;&#22791;&#22909;&#20102;&#20462;&#27491;&#65292;&#20320;&#23601;&#35201;&#20915;&#23450;&#22914;&#20309;&#25551;&#36848;&#23427;&#12290;</p><p>&#22914;&#26524;&#20165;&#20165;&#26159;&#25552;&#20132;&#20320;&#20204;&#30340;&#20462;&#27491;&#21040;&#29256;&#26412;&#24211;&#65292;&#25110;&#32773;&#26159;&#21521;&#20840;&#19990;&#30028;&#23459;&#24067;&#65292;&#25152;&#26377;&#20351;&#29992;&#35813;&#36719;&#20214;&#30340;&#20154;&#23601;&#24517;&#39035;&#31435;&#21051;&#21319;&#32423;&#65292;&#21542;&#21017;&#23601;&#35201;&#32463;&#21463;&#34987;&#25915;&#20987;&#30340;&#39118;&#38505;&#12290;&#26377;&#26102;&#65292;&#26356;&#24212;&#35813;&#23545;&#26576;&#20123;&#29305;&#21035;&#37325;&#35201;&#30340;&#29992;&#25143;&#36827;&#34892;<em class="firstterm">&#39044;&#25552;&#37266;</em>&#12290;&#23545;&#20110;&#23458;&#25143;&#31471;/&#26381;&#21153;&#22120;&#36719;&#20214;&#36825;&#19968;&#28857;&#23588;&#20854;&#37325;&#35201;&#65292;&#22240;&#20026;&#20063;&#35768;&#26576;&#20123;&#29992;&#25143;&#30340;&#26381;&#21153;&#22120;&#26159;&#25915;&#20987;&#30340;&#35825;&#20154;&#30446;&#26631;&#12290;&#37027;&#20123;&#26381;&#21153;&#22120;&#30340;&#31649;&#29702;&#21592;&#20063;&#35768;&#20250;&#23545;&#25552;&#21069;&#19968;&#20004;&#22825;&#36827;&#34892;&#21319;&#32423;&#32780;&#24863;&#21040;&#24863;&#28608;&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#21487;&#20197;&#22312;&#30772;&#35299;&#20986;&#29616;&#22312;&#20844;&#20247;&#20043;&#21069;&#20570;&#22909;&#20445;&#25252;&#12290;</p><p>&#39044;&#25552;&#37266;&#30340;&#24847;&#24605;&#26159;&#22312;&#20844;&#24067;&#20043;&#21069;&#21521;&#37027;&#20123;&#31649;&#29702;&#21592;&#21457;&#36865;&#37038;&#20214;&#65292;&#21578;&#35785;&#20182;&#20204;&#36825;&#20123;&#28431;&#27934;&#20197;&#21450;&#22914;&#20309;&#20462;&#27491;&#12290;&#19968;&#23450;&#35201;&#30830;&#20445;&#21482;&#21521;&#20320;&#30456;&#20449;&#20250;&#20445;&#23432;&#31192;&#23494;&#30340;&#20154;&#21457;&#36865;&#39044;&#25552;&#37266;&#12290;&#20063;&#23601;&#26159;&#65292;&#25509;&#25910;&#39044;&#25552;&#37266;&#30340;&#36164;&#26684;&#21253;&#25324;&#20004;&#37325;&#24847;&#24605;&#65306;&#25509;&#25910;&#32773;&#19968;&#23450;&#26159;&#22312;&#36816;&#33829;&#19968;&#20010;&#22823;&#30340;&#65292;&#37325;&#35201;&#30340;&#26381;&#21153;&#22120;&#65292;&#24433;&#21709;&#37325;&#22823;&#65292;<span class="emphasis"><em>&#32780;&#19988;</em></span>&#36825;&#20123;&#25509;&#25910;&#32773;&#20063;&#19968;&#23450;&#19981;&#20250;&#22312;&#20844;&#24320;&#20043;&#21069;&#21040;&#22788;&#20081;&#35828;&#36825;&#20010;&#23433;&#20840;&#38382;&#39064;&#12290;</p><p>&#21521;&#27599;&#20010;&#25509;&#25910;&#32773;&#21333;&#29420;&#65288;&#27599;&#27425;&#19968;&#20010;&#65289;&#21457;&#36865;&#39044;&#25552;&#37266;&#37038;&#20214;&#12290;<span class="emphasis"><em>&#19981;&#35201;</em></span>&#19968;&#27425;&#21521;&#25972;&#20010;&#21015;&#34920;&#30340;&#25509;&#25910;&#32773;&#21457;&#36865;&#65292;&#22240;&#20026;&#20182;&#20204;&#20250;&#30475;&#21040;&#20854;&#20182;&#20154;&#30340;&#21517;&#23383;&#8212;&#37027;&#26679;&#24847;&#21619;&#30528;&#21578;&#35785;&#20102;&#27599;&#20010;&#25509;&#25910;&#32773;<span class="emphasis"><em>&#20182;&#20204;</em></span>&#30340;&#26381;&#21153;&#22120;&#26377;&#23433;&#20840;&#28431;&#27934;&#12290;&#23436;&#20840;&#36890;&#36807;&#26263;&#36865;&#65288;BCC&#65289;&#20063;&#19981;&#26159;&#22909;&#26041;&#27861;&#65292;&#22240;&#20026;&#26576;&#20123;&#31649;&#29702;&#21592;&#20351;&#29992;&#22403;&#22334;&#36807;&#28388;&#20250;&#23631;&#34109;&#25110;&#20943;&#23569;BCC&#37038;&#20214;&#30340;&#31561;&#32423;&#65292;&#22240;&#20026;&#29616;&#22312;&#26377;&#22826;&#22810;&#20351;&#29992;BCC&#21457;&#36865;&#30340;&#22403;&#22334;&#37038;&#20214;&#12290;</p><p>&#20197;&#19979;&#26159;&#19968;&#20010;&#39044;&#25552;&#37266;&#37038;&#20214;&#65306;</p><pre class="screen">
From: &#20320;&#30340;&#21517;&#23383;
To: admin@large-famous-server.com
Reply-to: &#20320;&#30340;&#21517;&#23383;&#65288;&#19981;&#35201;&#29992;&#23433;&#20840;&#21015;&#34920;&#22320;&#22336;&#65289;
Subject: &#37325;&#35201;Scanley&#28431;&#27934;&#25552;&#37266;&#12290;


&#36825;&#20010;&#37038;&#20214;&#26159;Scanley&#26381;&#21153;&#22120;&#23433;&#20840;&#35686;&#21578;&#30340;&#37325;&#35201;&#39044;&#25552;&#37266;&#12290;

&#19981;&#35201;&#21521;&#20219;&#20309;&#20154;&#36716;&#21457;&#26412;&#37038;&#20214;&#12290;&#20844;&#20849;&#22768;&#26126;&#23558;&#20250;&#22312;3&#26376;19&#26085;&#21457;&#24067;&#65292;&#25105;&#20204;&#24456;&#24076;&#26395;&#22312;&#27492;
&#20043;&#21069;&#33021;&#22815;&#20445;&#23494;&#27492;&#20449;&#24687;&#12290;

&#24744;&#25910;&#21040;&#27492;&#37038;&#20214;&#26159;&#22240;&#20026;&#65288;&#25105;&#20204;&#35748;&#20026;&#65289;&#24744;&#36816;&#34892;&#20102;Scanley&#26381;&#21153;&#22120;&#65292;&#24182;&#24076;&#26395;&#22312;19&#21495;&#20844;
&#24067;&#27492;&#23433;&#20840;&#28431;&#27934;&#20043;&#21069;&#20570;&#22909;&#34917;&#19969;&#12290;
&#21442;&#32771;&#65306;
===========

   CAN-2004-1771: Scanley&#26597;&#35810;&#22534;&#26632;&#28322;&#20986;&#28431;&#27934;&#65306;
==============

   &#22914;&#26524;&#26381;&#21153;&#22120;&#30340;locale&#35774;&#32622;&#37197;&#32622;&#38169;&#35823;&#65292;&#32780;&#19988;&#23458;&#25143;&#31471;&#21457;&#36865;&#20102;&#19981;&#21512;&#27861;&#30340;&#26597;&#35810;&#65292;&#20250;&#23548;
   &#33268;&#21487;&#20197;&#36816;&#34892;&#20219;&#20309;&#21629;&#20196;&#12290;

&#20005;&#37325;&#31243;&#24230;&#65306;
=========

   &#38750;&#24120;&#20005;&#37325;&#65292;&#21487;&#20197;&#23548;&#33268;&#26381;&#21153;&#22120;&#19978;&#20219;&#24847;&#20195;&#30721;&#30340;&#25191;&#34892;&#12290;

&#21608;&#36793;&#24037;&#20316;&#65306;
============

   &#22312;scanley.conf&#20013;&#23558;'natural-language-processing'&#36873;&#39033;&#35774;&#32622;&#20026;'off'&#65292;&#21487;&#20197;&#20851;&#38381;
   &#36825;&#20010;&#28431;&#27934;&#12290;

&#34917;&#19969;&#65306;
======

   &#20197;&#19979;&#34917;&#19969;&#36866;&#24212;&#20110;Scanley 3.0&#12289;3.1&#21644;3.2&#12290;

   &#19968;&#20010;&#26032;&#30340;&#20844;&#20849;&#29256;&#26412;&#65288;Scanley 3.2.1&#65289;&#23558;&#20250;&#22312;3&#26376;19&#26085;&#21457;&#24067;&#65292;&#21516;&#26102;&#35813;&#28431;&#27934;&#20063;&#20250;
   &#20844;&#24320;&#12290;&#20320;&#21487;&#20197;&#29616;&#22312;&#25171;&#34917;&#19969;&#65292;&#25110;&#32773;&#31561;&#24453;&#20844;&#24320;&#29256;&#26412;&#12290;3.2&#19982;3.2.1&#30340;&#21807;&#19968;&#21306;&#21035;&#23558;&#26159;&#27492;
   &#34917;&#19969;&#12290;

[...&#34917;&#19969;&#22312;&#36825;&#37324;...]
</pre><p>&#22914;&#26524;&#20320;&#26377;CAN&#21495;&#30721;&#65292;&#21363;&#20351;&#35813;&#20449;&#24687;&#20381;&#28982;&#26159;&#20445;&#23494;&#30340;&#65292;&#23427;&#30340;MITRE&#39029;&#38754;&#27809;&#26377;&#20219;&#20309;&#20869;&#23481;&#65292;&#20063;&#35831;&#22312;&#39044;&#25552;&#37266;&#20013;&#25552;&#20379;&#65288;&#19978;&#38754;&#20363;&#23376;&#20013;&#26174;&#31034;&#30340;&#65289;&#12290;&#21253;&#21547;CAN&#21495;&#30721;&#20801;&#35768;&#25509;&#25910;&#32773;&#21487;&#20197;&#30693;&#26195;&#33258;&#24049;&#34987;&#39044;&#25552;&#37266;&#30340;bug&#27491;&#26159;&#20182;&#20204;&#23558;&#26469;&#21487;&#33021;&#36890;&#36807;&#20844;&#20849;&#28192;&#36947;&#33719;&#30693;&#30340;bug&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#19981;&#24517;&#20026;&#26159;&#21542;&#35201;&#37319;&#21462;&#36827;&#19968;&#27493;&#30340;&#34892;&#21160;&#32780;&#24863;&#21040;&#25285;&#24515;&#65292;&#20851;&#38190;&#28857;&#23601;&#26159;CAN/CVE&#21495;&#30721;&#12290;</p></div><div class="sect3" title="&#20844;&#24320;&#20998;&#21457;&#20462;&#27491;"><div class="titlepage"><div><div><h4 class="title"><a name="security-announcing"></a>&#20844;&#24320;&#20998;&#21457;&#20462;&#27491;</h4></div></div></div><p>&#22788;&#29702;&#23433;&#20840;bug&#30340;&#26368;&#21518;&#19968;&#27493;&#26159;&#20844;&#24320;&#20998;&#21457;&#20462;&#35746;&#12290;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#23436;&#25972;&#30340;&#22768;&#26126;&#20013;&#65292;&#20320;&#38656;&#35201;&#25551;&#36848;&#35813;&#38382;&#39064;&#65292;&#22914;&#26524;&#26377;CAN/CVE&#21495;&#30721;&#65292;&#20063;&#35201;&#25552;&#20379;&#65292;&#25551;&#36848;&#24037;&#20316;&#30340;&#32972;&#26223;&#65292;&#20197;&#21450;&#22914;&#20309;&#27704;&#20037;&#20462;&#27491;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#8220;&#20462;&#27491;&#8221;&#24847;&#21619;&#30528;&#23558;&#36719;&#20214;&#21319;&#32423;&#21040;&#26032;&#29256;&#26412;&#65292;&#26377;&#26102;&#20063;&#21487;&#33021;&#26159;&#24212;&#29992;&#19968;&#20010;&#34917;&#19969;&#65292;&#29305;&#21035;&#26159;&#22914;&#26524;&#20320;&#30340;&#36719;&#20214;&#20197;&#28304;&#20195;&#30721;&#24418;&#24335;&#36816;&#34892;&#26102;&#12290;&#22914;&#26524;&#20320;&#35201;&#21457;&#24067;&#26032;&#29256;&#26412;&#65292;&#19968;&#23450;&#35201;&#30830;&#20445;&#26159;&#19982;&#29616;&#26377;&#30340;&#26576;&#20010;&#29256;&#26412;&#30340;&#21306;&#21035;&#23601;&#26159;&#23433;&#20840;&#34917;&#19969;&#12290;&#20351;&#29992;&#27492;&#26041;&#27861;&#65292;&#20445;&#23432;&#30340;&#31649;&#29702;&#21592;&#23601;&#21487;&#20197;&#20316;&#20986;&#21319;&#32423;&#65292;&#26080;&#38656;&#25285;&#24515;&#20250;&#24433;&#21709;&#20854;&#20182;&#30340;&#21151;&#33021;&#65307;&#20182;&#20204;&#20063;&#19981;&#24517;&#25285;&#24515;&#23558;&#26469;&#30340;&#21319;&#32423;&#65292;&#22240;&#20026;&#23433;&#20840;&#34917;&#19969;&#23558;&#20250;&#29702;&#25152;&#24403;&#28982;&#30340;&#20986;&#29616;&#22312;&#26410;&#26469;&#29256;&#26412;&#20013;&#12290;&#65288;&#20851;&#20110;&#21457;&#24067;&#30340;&#35814;&#32454;&#20449;&#24687;&#21487;&#20197;&#30475;<span><a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a>&#30340;</span><a class="xref" href="release-lines.html#security-releases" title="&#23433;&#20840;&#21457;&#24067;">the section called &#8220;&#23433;&#20840;&#21457;&#24067;&#8221;</a>&#12290;&#65289;</p><p>&#26080;&#35770;&#20844;&#24320;&#20462;&#27491;&#26159;&#21542;&#21253;&#21547;&#20102;&#26032;&#30340;&#29256;&#26412;&#65292;&#19981;&#35201;&#20687;&#21457;&#24067;&#26032;&#29256;&#26412;&#37027;&#26679;&#31895;&#31961;&#65306;&#22312;&#39033;&#30446;<code class="literal">&#22768;&#26126;</code>&#21015;&#34920;&#20013;&#21457;&#36865;&#19968;&#23553;&#37038;&#20214;&#65292;&#21457;&#24067;&#19968;&#20010;&#26032;&#30340;&#26032;&#38395;&#31295;&#65292;&#26356;&#26032;Freshmeat&#26465;&#30446;&#31561;&#31561;&#12290;&#20320;&#19981;&#24212;&#35813;&#22240;&#20026;&#39033;&#30446;&#30340;&#21517;&#35465;&#65292;&#32780;&#35797;&#22270;&#20943;&#24369;&#23433;&#20840;bug&#30340;&#23384;&#22312;&#24615;&#65292;&#20320;&#24212;&#24403;&#30830;&#31435;&#19982;&#23433;&#20840;&#22768;&#26126;&#38382;&#39064;&#30340;&#20005;&#37325;&#31243;&#24230;&#30456;&#21305;&#37197;&#30340;&#22522;&#35843;&#21644;&#31361;&#20986;&#31243;&#24230;&#12290;&#22914;&#26524;&#23433;&#20840;&#28431;&#27934;&#20165;&#20165;&#26159;&#36731;&#24494;&#30340;&#20449;&#24687;&#26292;&#38706;&#65292;&#32780;&#19981;&#20250;&#23548;&#33268;&#29992;&#25143;&#25915;&#20811;&#25972;&#20010;&#35745;&#31639;&#26426;&#65292;&#26080;&#38656;&#22823;&#24778;&#23567;&#24618;&#12290;&#20320;&#29978;&#33267;&#20250;&#35273;&#24471;&#26080;&#38656;&#20026;&#27492;&#20998;&#25955;<code class="literal">&#22768;&#26126;</code>&#21015;&#34920;&#30340;&#27880;&#24847;&#21147;&#12290;&#27605;&#31455;&#65292;&#22914;&#26524;&#39033;&#30446;&#27599;&#27425;&#37117;&#21898;&#29436;&#26469;&#20102;&#65292;&#29992;&#25143;&#20250;&#35823;&#20197;&#20026;&#36719;&#20214;&#24456;&#19981;&#23433;&#20840;&#65292;&#32780;&#19988;&#20250;&#22312;&#30495;&#30340;&#26377;&#22823;&#38382;&#39064;&#35201;&#23459;&#24067;&#26102;&#19981;&#30456;&#20449;&#20320;&#12290;&#20851;&#20110;&#21028;&#26029;&#20005;&#37325;&#24615;&#30340;&#26356;&#22909;&#30340;&#20171;&#32461;&#21487;&#20197;&#30475;<a class="ulink" href="http://cve.mitre.org/about/terminology.html" target="_top">http://cve.mitre.org/about/terminology.html</a>&#12290;</p><p>&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#20320;&#23545;&#22914;&#20309;&#22788;&#29702;&#23433;&#20840;&#38382;&#39064;&#24182;&#19981;&#30830;&#23450;&#65292;&#21487;&#20197;&#25214;&#26576;&#20010;&#26356;&#26377;&#32463;&#39564;&#30340;&#20154;&#35752;&#35770;&#19968;&#19979;&#12290;&#35780;&#20272;&#21644;&#22788;&#29702;&#28431;&#27934;&#26356;&#20687;&#26159;&#19968;&#31181;&#23398;&#20064;&#24471;&#21040;&#30340;&#25216;&#24039;&#65292;&#19968;&#24320;&#22987;&#24456;&#23481;&#26131;&#35823;&#20837;&#27495;&#36884;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="bug-tracker-usage.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="communications.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="development-cycle.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26080;&#23545;&#35805; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</td></tr></table></div></body></html>
