<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="prev" href="testing-and-releasing.html" title="&#27979;&#35797;&#21644;&#21457;&#24067;"><link rel="next" href="releases-and-daily-development.html" title="&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="testing-and-releasing.html">Prev</a> </td><th width="60%" align="center">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th><td width="20%" align="right"> <a accesskey="n" href="releases-and-daily-development.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-lines"></a>&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;</h2></div></div></div><p>&#22823;&#22810;&#25968;&#25104;&#29087;&#30340;&#39033;&#30446;&#37117;&#24179;&#34892;&#30340;&#32500;&#25252;&#22810;&#20010;&#21457;&#24067;&#32447;&#12290;&#20363;&#22914;&#65292;1.0.0&#21457;&#24067;&#21518;&#65292;&#35813;&#21457;&#24067;&#32447;&#20250;&#32487;&#32493;&#24494;&#23567;&#21457;&#24067;1.0.1&#65292;1.0.2&#31561;&#31561;&#65292;&#30452;&#21040;&#39033;&#30446;&#26126;&#30830;&#30340;&#20915;&#23450;&#32456;&#27490;&#36825;&#26465;&#32447;&#12290;&#35831;&#27880;&#24847;&#65292;&#20165;&#20165;&#22240;&#20026;&#21457;&#24067;&#20102;1.1.0&#19981;&#36275;&#20197;&#32456;&#27490;1.0.x&#32447;&#12290;&#20363;&#22914;&#65292;&#19968;&#20123;&#29992;&#25143;&#20250;&#21046;&#23450;&#26576;&#31867;&#25919;&#31574;&#65292;&#27704;&#36828;&#19981;&#21319;&#32423;&#21040;&#36739;&#26032;&#30340;&#27425;&#35201;&#25110;&#20027;&#35201;&#29256;&#26412;&#30340;&#31532;&#19968;&#20010;&#21457;&#24067;&#8212;&#20182;&#20204;&#24076;&#26395;&#20854;&#20182;&#20154;&#33021;&#23558;bug&#35797;&#39564;&#20986;&#26469;&#65292;&#20363;&#22914;1.1.0&#65292;&#37027;&#20040;&#23601;&#31561;&#24453;1.1.1&#12290;&#36825;&#19981;&#19968;&#23450;&#26159;&#33258;&#31169;&#65288;&#35831;&#29282;&#35760;&#65292;&#20182;&#20204;&#20063;&#25918;&#24323;&#20102;bug&#20462;&#27491;&#21644;&#26032;&#29305;&#24615;&#65289;&#65307;&#20165;&#20165;&#26159;&#20986;&#20110;&#26576;&#20123;&#21407;&#22240;&#65292;&#20182;&#20204;&#24517;&#39035;&#22312;&#21319;&#32423;&#19978;&#38750;&#24120;&#23567;&#24515;&#12290;&#22240;&#27492;&#65292;&#20551;&#35774;&#39033;&#30446;&#22312;&#21457;&#24067;1.1.0&#20043;&#21069;&#21457;&#29616;1.0.3&#20013;&#26377;&#19968;&#20010;&#37325;&#22823;bug&#65292;&#22914;&#26524;&#21482;&#26159;&#23558;bug&#20462;&#27491;&#32435;&#20837;&#21040;1.1.0&#65292;&#32780;&#21578;&#30693;&#25152;&#26377;&#30340;1.0.x&#29992;&#25143;&#24517;&#39035;&#21319;&#32423;&#21040;1.1.0&#65292;&#20854;&#32467;&#26524;&#23558;&#20250;&#38750;&#24120;&#24694;&#21155;&#12290;&#20026;&#20160;&#20040;&#19981;&#21516;&#26102;&#21457;&#24067;1.1.0&#21644;1.0.4&#65292;&#36825;&#26679;&#22823;&#23478;&#37117;&#33021;&#39640;&#20852;&#21543;&#65311;</p><p>&#24453;1.1.x&#32447;&#22278;&#28385;&#21518;&#65292;&#20320;&#21487;&#20197;&#23459;&#24067;1.0.x&#36827;&#20837;&#20102;<em class="firstterm">&#29983;&#21629;&#32467;&#26463;&#65288;end of life&#65292;EOL&#65289;</em>&#12290;&#36825;&#19968;&#27493;&#24517;&#39035;&#27491;&#24335;&#23459;&#21578;&#12290;&#23459;&#21578;&#21487;&#20197;&#26159;&#29420;&#31435;&#30340;&#65292;&#20063;&#21487;&#20197;&#20316;&#20026;1.1.x&#21457;&#24067;&#23459;&#21578;&#30340;&#19968;&#37096;&#20998;&#65307;&#21487;&#26159;&#36825;&#26679;&#20570;&#26102;&#65292;&#29992;&#25143;&#24517;&#39035;&#33021;&#22815;&#30693;&#36947;&#32769;&#30340;&#24320;&#21457;&#32447;&#27491;&#22312;&#34987;&#20851;&#38381;&#65292;&#36825;&#26679;&#20182;&#20204;&#21487;&#20197;&#26681;&#25454;&#24773;&#20917;&#20915;&#23450;&#26159;&#21542;&#21319;&#32423;&#12290;</p><p>&#19968;&#20123;&#39033;&#30446;&#35774;&#32622;&#20102;&#20445;&#35777;&#23545;&#20110;&#21069;&#19968;&#21457;&#24067;&#32447;&#20316;&#20986;&#25903;&#25345;&#30340;&#31383;&#21475;&#26102;&#38388;&#12290;&#22312;&#24320;&#28304;&#29615;&#22659;&#20013;&#65292;&#8220;&#25903;&#25345;&#8221;&#24847;&#21619;&#30528;&#25509;&#21463;&#38024;&#23545;&#35813;&#32447;&#30340;bug&#25253;&#21578;&#65292;&#24182;&#22312;&#21457;&#29616;&#37325;&#22823;bug&#21518;&#21457;&#24067;&#32500;&#25252;&#29256;&#26412;&#12290;&#21478;&#22806;&#19968;&#20123;&#39033;&#30446;&#24182;&#27809;&#26377;&#32473;&#20986;&#39044;&#23450;&#20041;&#30340;&#26102;&#38388;&#65292;&#32780;&#26159;&#26681;&#25454;&#25253;&#21578;&#30340;bug&#25968;&#37327;&#21028;&#26029;&#36824;&#22312;&#20351;&#29992;&#36739;&#26087;&#21457;&#24067;&#32447;&#30340;&#29992;&#25143;&#12290;&#24403;&#20302;&#20110;&#26576;&#20010;&#30334;&#20998;&#27604;&#26102;&#65292;&#23601;&#21487;&#20197;&#23459;&#24067;&#21457;&#24067;&#32447;&#30340;&#32467;&#26463;&#24182;&#20572;&#27490;&#23545;&#23427;&#30340;&#25903;&#25345;&#12290;</p><p>&#23545;&#20110;&#27599;&#20010;&#21457;&#24067;&#65292;&#35831;&#30830;&#20445;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#20013;&#26377;<em class="firstterm">&#30446;&#26631;&#29256;&#26412;</em>&#25110;<em class="firstterm">&#30446;&#26631;&#37324;&#31243;&#30865;</em>&#65292;&#36825;&#26679;&#20154;&#20204;&#21487;&#20197;&#26681;&#25454;&#27491;&#30830;&#30340;&#21457;&#24067;&#22635;&#20889;bug&#12290;&#24403;&#28982;&#20063;&#19981;&#35201;&#24536;&#35760;&#20026;&#26368;&#26032;&#30340;&#24320;&#21457;&#28304;&#20195;&#30721;&#25552;&#20379;&#21483;&#20570;&#8220;&#24320;&#21457;&#8221;&#25110;&#8220;&#26368;&#26032;&#8221;&#30340;&#30446;&#26631;&#65292;&#22240;&#20026;&#24635;&#26377;&#20123;&#20154;&#8212;&#19981;&#20165;&#20165;&#26159;&#27963;&#36291;&#30340;&#24320;&#21457;&#32773;&#8212;&#36890;&#24120;&#20250;&#22312;&#23448;&#26041;&#21457;&#24067;&#30340;&#26368;&#21069;&#27839;&#12290;</p><div class="sect2" title="&#23433;&#20840;&#21457;&#24067;"><div class="titlepage"><div><div><h3 class="title"><a name="security-releases"></a>&#23433;&#20840;&#21457;&#24067;</h3></div></div></div><p>&#23545;&#20110;&#23433;&#20840;bug&#30340;&#22788;&#29702;&#35831;&#21442;&#32771;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a></span><a class="xref" href="publicity.html#security" title="&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;">the section called &#8220;&#22768;&#26126;&#23433;&#20840;&#28431;&#27934;&#8221;</a>&#65292;&#20294;&#26159;&#23545;&#20110;&#23433;&#20840;&#21457;&#24067;&#26377;&#35768;&#22810;&#29305;&#27530;&#30340;&#32454;&#33410;&#38656;&#35201;&#35752;&#35770;&#12290;</p><p>&#19968;&#20010;<em class="firstterm">&#23433;&#20840;&#21457;&#24067;</em>&#26159;&#19968;&#20010;&#19987;&#38376;&#20851;&#38381;&#23433;&#20840;&#28431;&#27934;&#30340;&#21457;&#24067;&#12290;&#20462;&#27491;bug&#30340;&#20195;&#30721;&#22312;&#21457;&#24067;&#20043;&#21069;&#19981;&#33021;&#20844;&#24067;&#20110;&#20247;&#65292;&#20063;&#23601;&#26159;&#35828;&#22312;&#21457;&#24067;&#26085;&#20043;&#21069;&#20195;&#30721;&#19981;&#33021;&#25552;&#20132;&#21040;&#29256;&#26412;&#24211;&#65292;&#20063;&#24847;&#21619;&#30528;&#22312;&#20844;&#24320;&#20043;&#21069;&#20195;&#30721;&#19981;&#33021;&#32463;&#36807;&#20844;&#20849;&#27979;&#35797;&#12290;&#24456;&#26126;&#26174;&#65292;&#24320;&#21457;&#32773;&#21487;&#20197;&#33258;&#24049;&#26816;&#26597;&#36825;&#20010;&#20462;&#27491;&#65292;&#24182;&#22312;&#31169;&#19979;&#37324;&#27979;&#35797;&#21457;&#24067;&#65292;&#20294;&#26159;&#26080;&#27861;&#36827;&#34892;&#24191;&#27867;&#30340;&#30495;&#23454;&#19990;&#30028;&#27979;&#35797;&#12290;</p><p>&#22240;&#20026;&#32570;&#20047;&#27979;&#35797;&#65292;&#25152;&#20197;&#23433;&#20840;&#21457;&#24067;&#24517;&#39035;&#26159;&#22312;&#29616;&#26377;&#21457;&#24067;&#22522;&#30784;&#20043;&#19978;&#65292;&#21482;&#38468;&#21152;&#20102;&#23433;&#20840;bug&#30340;&#20462;&#27491;&#65292;&#27809;&#26377;<span class="emphasis"><em>&#20854;&#20182;&#21464;&#26356;</em></span>&#30340;&#21457;&#24067;&#12290;&#36825;&#26159;&#22240;&#20026;&#26410;&#32463;&#27979;&#35797;&#30340;&#21464;&#26356;&#36234;&#22810;&#65292;&#36234;&#26377;&#21487;&#33021;&#23548;&#33268;&#26032;&#30340;bug&#65292;&#29978;&#33267;&#26159;&#26032;&#30340;&#23433;&#20840;bug&#65281;&#36825;&#31181;&#20445;&#23432;&#20063;&#26159;&#23545;&#31649;&#29702;&#21592;&#30340;&#19968;&#31181;&#21451;&#22909;&#65292;&#20182;&#20204;&#23558;&#35201;&#37096;&#32626;&#23433;&#20840;&#20462;&#27491;&#65292;&#20294;&#26159;&#20182;&#20204;&#30340;&#37096;&#32626;&#31574;&#30053;&#20542;&#21521;&#20110;&#19981;&#22312;&#21516;&#19968;&#26102;&#38388;&#37096;&#32626;&#20219;&#20309;&#20854;&#20182;&#21464;&#26356;&#12290;</p><p>&#20316;&#20986;&#23433;&#20840;&#21457;&#24067;&#26377;&#26102;&#26377;&#20123;&#23567;&#30340;&#35809;&#35745;&#12290;&#20363;&#22914;&#65292;&#39033;&#30446;&#21487;&#33021;&#24037;&#20316;&#20110;&#21457;&#24067;1.1.3&#65292;&#23545;&#20110;1.1.2&#30340;&#19968;&#20123;bug&#20462;&#27491;&#24050;&#32463;&#20844;&#24320;&#22768;&#26126;&#65292;&#27492;&#26102;&#20986;&#29616;&#20102;&#23433;&#20840;&#25253;&#21578;&#12290;&#24456;&#33258;&#28982;&#65292;&#24320;&#21457;&#32773;&#22312;&#23436;&#25104;&#20462;&#27491;&#21069;&#19981;&#33021;&#35752;&#35770;&#23433;&#20840;&#38382;&#39064;&#65292;&#20182;&#20204;&#24517;&#39035;&#32487;&#32493;&#35752;&#35770;&#65292;&#22909;&#20687;1.1.3&#36824;&#20250;&#25353;&#29031;&#35745;&#21010;&#25512;&#20986;&#19968;&#26679;&#12290;&#20294;&#26159;&#24403;1.1.3&#23454;&#38469;&#19978;&#21040;&#26469;&#26102;&#65292;&#19982;1.1.2&#30340;&#21306;&#21035;&#21482;&#26377;&#23433;&#20840;&#34917;&#19969;&#65292;&#32780;&#25152;&#26377;&#20854;&#20182;&#30340;&#20462;&#27491;&#37117;&#20250;&#36827;&#20837;1.1.4&#65288;&#24403;&#28982;&#65292;&#29616;&#22312;<span class="emphasis"><em>&#20063;&#20250;</em></span>&#21253;&#21547;&#23433;&#20840;&#20462;&#27491;&#65292;&#20197;&#21518;&#25152;&#26377;&#30340;&#29256;&#26412;&#20063;&#20250;&#19968;&#30452;&#21253;&#21547;&#65289;&#12290;</p><p>&#20320;&#20063;&#21487;&#20197;&#20026;&#29616;&#26377;&#30340;&#29256;&#26412;&#21495;&#30721;&#28155;&#21152;&#19968;&#20010;&#39069;&#22806;&#30340;&#37096;&#20998;&#65292;&#20197;&#35828;&#26126;&#23427;&#21482;&#21253;&#21547;&#23433;&#20840;&#21464;&#26356;&#12290;&#20363;&#22914;&#65292;&#20154;&#20204;&#33021;&#22815;&#30693;&#36947;1.1.2.1&#26159;&#38024;&#23545;1.1.2&#30340;&#19968;&#20010;&#23433;&#20840;&#21457;&#24067;&#65292;&#25152;&#26377;&#26356;&#39640;&#30340;&#21457;&#24067;&#65288;1.1.3&#65292;1.2.0&#31561;&#65289;&#20250;&#21253;&#21547;&#30456;&#21516;&#30340;&#23433;&#20840;&#20462;&#27491;&#12290;&#23545;&#20110;&#20102;&#35299;&#20869;&#24773;&#30340;&#20154;&#65292;&#36825;&#20010;&#31995;&#32479;&#21487;&#20197;&#20256;&#36882;&#35768;&#22810;&#20449;&#24687;&#12290;&#22312;&#21478;&#19968;&#26041;&#38754;&#65292;&#37027;&#20123;&#19981;&#33021;&#32039;&#36319;&#39033;&#30446;&#30340;&#20154;&#65292;&#24403;&#22823;&#22810;&#25968;&#26102;&#38388;&#30475;&#21040;&#30340;&#26159;3&#37096;&#20998;&#30340;&#21457;&#24067;&#21495;&#30721;&#65292;&#20598;&#23572;&#30475;&#21040;4&#37096;&#20998;&#30340;&#21495;&#30721;&#20250;&#24863;&#21040;&#28151;&#20081;&#12290;&#25105;&#35265;&#36807;&#30340;&#22823;&#22810;&#25968;&#39033;&#30446;&#20250;&#36873;&#25321;&#19968;&#33268;&#24615;&#65292;&#20351;&#29992;&#24120;&#35268;&#30340;&#19979;&#20010;&#21495;&#30721;&#20316;&#20026;&#23433;&#20840;&#21457;&#24067;&#65292;&#21363;&#20351;&#23427;&#24847;&#21619;&#30528;&#35745;&#21010;&#20013;&#30340;&#21457;&#24067;&#21069;&#36827;&#19968;&#20010;&#29256;&#26412;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="testing-and-releasing.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="releases-and-daily-development.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#27979;&#35797;&#21644;&#21457;&#24067; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</td></tr></table></div></body></html>
