<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="prev" href="release-lines.html" title="&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;"><link rel="next" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="release-lines.html">Prev</a> </td><th width="60%" align="center">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th><td width="20%" align="right"> <a accesskey="n" href="managing-volunteers.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="releases-and-daily-development"></a>&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</h2></div></div></div><p>&#32500;&#25252;&#21516;&#26102;&#30340;&#24179;&#34892;&#21457;&#24067;&#21253;&#21547;&#20102;&#22914;&#20309;&#23436;&#25104;&#26085;&#24120;&#24320;&#21457;&#30340;&#26263;&#31034;&#12290;&#29305;&#21035;&#26159;&#24212;&#35813;&#36981;&#23432;&#27599;&#27425;&#25552;&#20132;&#21482;&#21253;&#21547;&#19968;&#20010;&#21333;&#29420;&#36923;&#36753;&#21464;&#26356;&#30340;&#38081;&#24459;&#65292;&#32477;&#19981;&#35201;&#22312;&#19968;&#27425;&#25552;&#20132;&#20013;&#28151;&#26434;&#19981;&#30456;&#20851;&#30340;&#21464;&#26356;&#12290;&#22914;&#26524;&#19968;&#27425;&#25552;&#20132;&#30340;&#21464;&#26356;&#22826;&#22823;&#65292;&#25110;&#20855;&#26377;&#30772;&#22351;&#24615;&#65292;&#21487;&#20197;&#20998;&#20026;N&#27492;&#25552;&#20132;&#65292;&#27599;&#27425;&#25552;&#20132;&#37117;&#26159;&#19968;&#20010;&#25972;&#20307;&#21464;&#26356;&#30340;&#20998;&#21306;&#23376;&#38598;&#65292;&#32780;&#19988;&#19981;&#21253;&#21547;&#19982;&#25972;&#20307;&#21464;&#26356;&#26080;&#20851;&#30340;&#20869;&#23481;&#12290;</p><p>&#36825;&#37324;&#26159;&#19968;&#20010;&#26410;&#32463;&#24910;&#37325;&#32771;&#34385;&#36827;&#34892;&#25552;&#20132;&#30340;&#20363;&#23376;&#65306;</p><pre class="screen">
------------------------------------------------------------------------
r6228 | jrandom | 2004-06-30 22:13:07 -0500 (Wed, 30 Jun 2004) | 8 lines

Fix Issue #1729: Make indexing gracefully warn the user when a file
is changing as it is being indexed.

* ui/repl.py
  (ChangingFile): New exception class.
  (DoIndex): Handle new exception.

* indexer/index.py
  (FollowStream): Raise new exception if file changes during indexing.
  (BuildDir): Unrelatedly, remove some obsolete comments, reformat
  some code, and fix the error check when creating a directory.

Other unrelated cleanups:

* www/index.html: Fix some typos, set next release date.
------------------------------------------------------------------------
</pre><p>&#24403;&#26576;&#20154;&#38656;&#35201;&#23558;<code class="function">BuildDir</code>&#38169;&#35823;&#26816;&#26597;&#20462;&#27491;&#25644;&#36816;&#21040;&#32500;&#25252;&#21363;&#23558;&#21040;&#26469;&#32500;&#25252;&#21457;&#24067;&#20998;&#25903;&#26102;&#65292;&#36825;&#31181;&#38382;&#39064;&#31435;&#21051;&#21464;&#24471;&#38750;&#24120;&#26126;&#26174;&#12290;&#25644;&#36816;&#32773;&#19981;&#24076;&#26395;&#20219;&#20309;&#20854;&#20182;&#30340;&#21464;&#26356;&#8212;&#20363;&#22914;&#65292;#1729&#38382;&#39064;&#30340;&#20462;&#27491;&#26410;&#33021;&#36890;&#36807;&#32500;&#25252;&#20998;&#25903;&#30340;&#30830;&#35748;&#65292;&#32780;&#19988;<code class="filename">index.html</code>&#30340;&#20462;&#25913;&#21464;&#24471;&#27627;&#26080;&#20851;&#31995;&#12290;&#20294;&#26159;&#22905;&#19981;&#33021;&#20165;&#20165;&#36890;&#36807;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#30340;&#21512;&#24182;&#21151;&#33021;&#21482;&#33719;&#21462;<code class="function">BuildDir</code>&#30340;&#21464;&#26356;&#65292;&#22240;&#20026;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#34987;&#21578;&#30693;&#35813;&#21464;&#26356;&#22312;&#36923;&#36753;&#19978;&#30001;&#25152;&#26377;&#20854;&#20182;&#19981;&#30456;&#20851;&#30340;&#20107;&#21153;&#32452;&#25104;&#12290;&#23454;&#38469;&#19978;&#65292;&#22312;&#21512;&#24182;&#20043;&#21069;&#36825;&#20010;&#38382;&#39064;&#20063;&#21313;&#20998;&#26126;&#26174;&#12290;&#20165;&#20165;&#20026;&#34920;&#20915;&#21015;&#20986;&#21464;&#26356;&#20250;&#26377;&#35768;&#22810;&#38382;&#39064;&#65306;&#19981;&#20165;&#20165;&#35201;&#25552;&#20379;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#25552;&#35758;&#32773;&#20063;&#24517;&#39035;&#25552;&#20379;&#29305;&#21035;&#30340;&#34917;&#19969;&#25110;&#21464;&#26356;&#20998;&#25903;&#65292;&#25165;&#33021;&#23558;&#25552;&#35758;&#30340;&#37096;&#20998;&#20998;&#31163;&#20986;&#26469;&#12290;&#23545;&#20110;&#20854;&#20182;&#20154;&#26469;&#35828;&#36824;&#35201;&#25215;&#21463;&#35768;&#22810;&#20219;&#21153;&#65292;&#20165;&#20165;&#22240;&#20026;&#26368;&#21021;&#30340;&#25552;&#20132;&#32773;&#26410;&#33021;&#25353;&#29031;&#36923;&#36753;&#25226;&#20107;&#24773;&#20998;&#32452;&#12290;</p><p>&#23454;&#38469;&#19978;&#65292;&#36825;&#20010;&#25552;&#20132;&#24212;&#35813;&#20998;&#20026;<span class="emphasis"><em>&#22235;</em></span>&#27425;&#29420;&#31435;&#30340;&#25552;&#20132;&#65306;&#19968;&#20010;&#29992;&#20110;&#20462;&#27491;#1729&#65292;&#21478;&#19968;&#20010;&#21024;&#38500;<code class="function">BuildDir</code>&#20013;&#24223;&#24323;&#30340;&#27880;&#37322;&#65292;&#24182;&#37325;&#26032;&#26684;&#24335;&#21270;&#20195;&#30721;&#65292;&#36824;&#26377;&#19968;&#20010;&#20462;&#27491;<code class="function">BuildDir</code>&#20013;&#30340;&#38169;&#35823;&#26816;&#26597;&#65292;&#26368;&#21518;&#35201;&#20462;&#25913;<code class="filename">index.html</code>&#12290;&#20854;&#20013;&#31532;&#19977;&#20010;&#25552;&#20132;&#24212;&#35813;&#26159;&#20026;&#32500;&#25252;&#21457;&#24067;&#20998;&#25903;&#25152;&#20570;&#30340;&#25552;&#35758;&#12290;</p><p>&#24403;&#28982;&#65292;&#21457;&#24067;&#31283;&#23450;&#19981;&#20165;&#20165;&#26159;&#35201;&#27714;&#27599;&#27425;&#25552;&#20132;&#20165;&#21253;&#21547;&#19968;&#20010;&#36923;&#36753;&#21464;&#26356;&#30340;&#21807;&#19968;&#21407;&#22240;&#20174;&#24515;&#29702;&#23398;&#19978;&#35762;&#65292;&#35821;&#20041;&#19978;&#32479;&#19968;&#30340;&#25552;&#20132;&#26356;&#21033;&#20110;&#26816;&#26597;&#65292;&#26356;&#21033;&#20110;&#22312;&#24517;&#35201;&#26102;&#22238;&#36864;&#65288;&#22312;&#26576;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#22238;&#36864;&#21482;&#26159;&#19968;&#31181;&#29305;&#27530;&#30340;&#21512;&#24182;&#65289;&#12290;&#36825;&#31181;&#27599;&#20010;&#20154;&#39044;&#20808;&#36981;&#23432;&#30340;&#32426;&#24459;&#21487;&#20197;&#36991;&#20813;&#39033;&#30446;&#20043;&#21518;&#30340;&#22836;&#30171;&#12290;</p><div class="sect2" title="&#35745;&#21010;&#21457;&#24067;"><div class="titlepage"><div><div><h3 class="title"><a name="planning"></a>&#35745;&#21010;&#21457;&#24067;</h3></div></div></div><p>&#19982;&#31169;&#26377;&#39033;&#30446;&#30456;&#27604;&#65292;&#24320;&#28304;&#39033;&#30446;&#22312;&#21457;&#24067;&#35745;&#21010;&#19978;&#26377;&#21382;&#21490;&#19978;&#30340;&#21306;&#21035;&#12290;&#31169;&#26377;&#39033;&#30446;&#36890;&#24120;&#26377;&#20005;&#26684;&#30340;&#26368;&#21518;&#26399;&#38480;&#12290;&#26377;&#26102;&#26159;&#22240;&#20026;&#24050;&#32463;&#21521;&#23458;&#25143;&#35768;&#35834;&#22312;&#35268;&#23450;&#26102;&#38388;&#23436;&#25104;&#21319;&#32423;&#65292;&#21487;&#33021;&#22240;&#20026;&#26032;&#21457;&#24067;&#38656;&#35201;&#37197;&#21512;&#20854;&#20182;&#24066;&#22330;&#30446;&#26631;&#30340;&#25237;&#20837;&#65292;&#20063;&#21487;&#33021;&#26159;&#22240;&#20026;&#39118;&#38505;&#25237;&#36164;&#24076;&#26395;&#22312;&#36827;&#19968;&#27493;&#25237;&#20837;&#21069;&#30475;&#21040;&#20123;&#32467;&#26524;&#12290;&#32780;&#23545;&#20110;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#65292;&#29616;&#38454;&#27573;&#20027;&#35201;&#26159;&#30001;&#19994;&#20313;&#24320;&#21457;&#32773;&#20197;&#26368;&#23383;&#38754;&#24847;&#20041;&#30340;&#26041;&#24335;&#28608;&#21169;&#30528;&#65306;&#22240;&#20026;&#21916;&#29233;&#65292;&#25152;&#20197;&#32534;&#30721;&#12290;&#22312;&#25152;&#26377;&#30340;&#29305;&#24615;&#23436;&#27605;&#20043;&#21069;&#65292;&#27809;&#26377;&#20154;&#35273;&#24471;&#38656;&#35201;&#35013;&#36816;&#12290;&#24182;&#19981;&#26159;&#25152;&#26377;&#20154;&#30340;&#24037;&#20316;&#37117;&#22312;&#24320;&#21457;&#32447;&#19978;&#12290;</p><p>&#29616;&#20170;&#65292;&#35768;&#22810;&#24320;&#28304;&#39033;&#30446;&#30001;&#20844;&#21496;&#36164;&#21161;&#65292;&#36234;&#26469;&#36234;&#21463;&#21040;&#20844;&#21496;&#25991;&#21270;&#20013;&#30340;&#26368;&#21518;&#26399;&#38480;&#24433;&#21709;&#12290;&#26080;&#35770;&#22914;&#20309;&#36825;&#20063;&#26159;&#19968;&#20214;&#22909;&#20107;&#65292;&#20294;&#26159;&#20250;&#23548;&#33268;&#26377;&#24037;&#36164;&#30340;&#31169;&#26377;&#24320;&#21457;&#32773;&#19982;&#24535;&#24895;&#36129;&#29486;&#26102;&#38388;&#30340;&#20914;&#31361;&#12290;&#36825;&#20123;&#20914;&#31361;&#36890;&#24120;&#20250;&#22260;&#32469;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#35745;&#21010;&#21457;&#24067;&#31561;&#38382;&#39064;&#21457;&#29983;&#12290;&#22788;&#20110;&#21387;&#21147;&#20043;&#19979;&#30340;&#26377;&#24037;&#36164;&#24320;&#21457;&#32773;&#24456;&#33258;&#28982;&#20250;&#24076;&#26395;&#36873;&#25321;&#19968;&#20010;&#21457;&#24067;&#21457;&#29983;&#30340;&#26085;&#26399;&#65292;&#24182;&#35753;&#27599;&#20010;&#20154;&#30340;&#27963;&#21160;&#25237;&#20837;&#21040;&#36825;&#20010;&#21457;&#24067;&#32447;&#12290;&#20294;&#26159;&#24535;&#24895;&#32773;&#26377;&#33258;&#24049;&#30340;&#26085;&#31243;&#8212;&#25110;&#35768;&#26159;&#20182;&#20204;&#24076;&#26395;&#23436;&#25104;&#30340;&#29305;&#24615;&#65292;&#25110;&#19968;&#20123;&#24076;&#26395;&#36827;&#34892;&#30340;&#27979;&#35797;&#8212;&#20182;&#20204;&#24076;&#26395;&#21457;&#24067;&#33021;&#31561;&#24453;&#36825;&#20123;&#24037;&#20316;&#23436;&#25104;&#12290;</p><p>&#24403;&#28982;&#23545;&#20110;&#27492;&#31867;&#38382;&#39064;&#65292;&#38500;&#20102;&#35752;&#35770;&#21644;&#22949;&#21327;&#27809;&#26377;&#26222;&#36890;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#20294;&#26159;&#36890;&#36807;&#23558;&#21457;&#24067;&#20013;&#26576;&#20010;&#25552;&#35758;&#30340;<span class="emphasis"><em>&#20986;&#29616;</em></span>&#19982;&#20854;&#23436;&#25104;&#30340;&#26085;&#26399;&#35299;&#32806;&#65292;&#20320;&#21487;&#20197;&#26368;&#23567;&#21270;&#25152;&#23548;&#33268;&#38459;&#21147;&#30340;&#39057;&#29575;&#21644;&#31243;&#24230;&#12290;&#20063;&#23601;&#26159;&#23558;&#35752;&#35770;&#20027;&#39064;&#23548;&#21521;&#21040;&#39033;&#30446;&#22312;&#36817;&#26399;&#65292;&#20197;&#21450;&#20013;&#26399;&#23558;&#35201;&#20316;&#20986;&#30340;&#21457;&#24067;&#65292;&#20197;&#21450;&#20854;&#20013;&#21253;&#21547;&#30340;&#21738;&#20123;&#29305;&#24615;&#65292;&#32780;&#19981;&#24517;&#19968;&#24320;&#22987;&#23601;&#30830;&#23450;&#25152;&#26377;&#20851;&#20110;&#26085;&#26399;&#30340;&#20107;&#24773;&#65292;&#38500;&#20102;&#31895;&#30053;&#30340;&#19968;&#20123;&#29468;&#27979;&#12290;<sup>[<a name="idp2574" href="#ftn.idp2574" class="footnote">23</a>]</sup>&#12290;&#36890;&#36807;&#23613;&#26089;&#26126;&#30830;&#29305;&#24615;&#38598;&#21512;&#65292;&#20320;&#20943;&#23569;&#20102;&#38024;&#23545;&#20219;&#20309;&#21333;&#20010;&#21457;&#24067;&#35752;&#35770;&#30340;&#22797;&#26434;&#24230;&#65292;&#22240;&#32780;&#25913;&#36827;&#20102;&#21487;&#39044;&#27979;&#24615;&#12290;&#36825;&#20063;&#21019;&#24314;&#20102;&#19968;&#31181;&#24815;&#24615;&#20559;&#35265;&#65292;&#38024;&#23545;&#36890;&#36807;&#28155;&#21152;&#29305;&#24615;&#25110;&#20854;&#20182;&#22797;&#26434;&#24230;&#30340;&#25552;&#35758;&#20197;&#25193;&#23637;&#21457;&#24067;&#23450;&#20041;&#30340;&#20154;&#12290;&#22914;&#26524;&#21457;&#24067;&#30340;&#20869;&#23481;&#23450;&#20041;&#33391;&#22909;&#65292;&#21017;&#25552;&#35758;&#32773;&#38656;&#35201;&#25215;&#25285;&#35777;&#26126;&#35813;&#25193;&#23637;&#30340;&#36127;&#25285;&#65292;&#21363;&#20351;&#21457;&#24067;&#30340;&#26085;&#26399;&#36824;&#27809;&#26377;&#35774;&#23450;&#12290;</p><p>&#22312;Thomas Jefferson&#30340;&#22810;&#21367;&#20256;&#35760;<em class="citetitle">Jefferson and His Time</em>&#20013;&#65292;Dumas Malone&#35762;&#20102;&#19968;&#20010;&#25925;&#20107;&#65292;Jefferson&#22914;&#20309;&#22788;&#29702;&#20915;&#23450;&#24343;&#21513;&#23612;&#20122;&#22823;&#23398;&#26410;&#26469;&#32452;&#32455;&#32467;&#26500;&#30340;&#31532;&#19968;&#27425;&#20250;&#35758;&#12290;&#22823;&#23398;&#39318;&#20808;&#26469;&#33258;Jefferson&#30340;&#19968;&#20010;&#26500;&#24819;&#65292;&#20294;&#26159;&#65288;&#19981;&#20165;&#20165;&#26159;&#22312;&#24320;&#28304;&#39033;&#30446;&#65292;&#20854;&#20182;&#39046;&#22495;&#20063;&#23649;&#35265;&#19981;&#40092;&#65289;&#26377;&#35768;&#22810;&#20854;&#20182;&#21442;&#19982;&#32773;&#65292;&#37117;&#26377;&#33258;&#24049;&#30340;&#20852;&#36259;&#21644;&#26085;&#31243;&#12290;&#24403;&#20182;&#20204;&#21484;&#38598;&#22312;&#19968;&#36215;&#20030;&#34892;&#31532;&#19968;&#27425;&#20250;&#35758;&#26102;&#65292;Jefferson&#30830;&#20445;&#23637;&#31034;&#20102;&#31934;&#24515;&#20934;&#22791;&#30340;&#26550;&#26500;&#22270;&#65292;&#20197;&#21450;&#24076;&#26395;&#20174;&#27431;&#27954;&#24341;&#20837;&#30340;&#29305;&#23450;&#25945;&#32844;&#21592;&#24037;&#30340;&#22995;&#21517;&#12290;&#25151;&#38388;&#20013;&#25152;&#26377;&#20854;&#20182;&#20154;&#37117;&#27809;&#26377;&#20219;&#20309;&#20934;&#22791;&#65307;&#36825;&#20010;&#22242;&#38431;&#20174;&#26412;&#36136;&#19978;&#23601;&#38656;&#35201;&#26381;&#20174;Jefferson&#30340;&#36828;&#35265;&#65292;&#32780;&#36825;&#20010;&#22823;&#23398;&#26368;&#32456;&#20960;&#20046;&#25353;&#29031;&#20182;&#30340;&#35745;&#21010;&#24314;&#31435;&#12290;&#20107;&#23454;&#19978;&#25972;&#20010;&#24314;&#35774;&#36828;&#36229;&#39044;&#31639;&#65292;&#20182;&#30340;&#35768;&#22810;&#24819;&#27861;&#20986;&#20110;&#24456;&#22810;&#21407;&#22240;&#65292;&#26368;&#32456;&#26410;&#33021;&#24471;&#21040;&#35299;&#20915;&#65292;&#20294;&#37027;&#37117;&#26159;Jefferson&#19968;&#24320;&#22987;&#23601;&#20102;&#35299;&#65292;&#24182;&#39044;&#35745;&#21040;&#20250;&#21457;&#29983;&#30340;&#20107;&#24773;&#12290;&#20182;&#30340;&#30446;&#30340;&#26159;&#31574;&#30053;&#24615;&#30340;&#65306;&#36890;&#36807;&#22312;&#20250;&#35758;&#19978;&#23637;&#31034;&#38750;&#24120;&#30830;&#23454;&#30340;&#19996;&#35199;&#65292;&#35753;&#20854;&#20182;&#25152;&#26377;&#20154;&#20165;&#20165;&#38656;&#35201;&#23653;&#34892;&#20462;&#25913;&#25552;&#35758;&#30340;&#35282;&#33394;&#65292;&#25152;&#20197;&#39033;&#30446;&#25972;&#20307;&#30340;&#24418;&#29366;&#65292;&#20197;&#21450;&#38543;&#20043;&#32780;&#26469;&#30340;&#26085;&#31243;&#20063;&#21487;&#20197;&#21644;&#20182;&#30340;&#39044;&#26399;&#22823;&#20307;&#19968;&#33268;&#12290;</p><p>&#23545;&#20110;&#24320;&#28304;&#36719;&#20214;&#39033;&#30446;&#65292;&#27809;&#26377;&#19968;&#20010;&#21333;&#29420;&#30340;&#8220;&#20250;&#35758;&#8221;&#65292;&#32780;&#26159;&#19968;&#31995;&#21015;&#30001;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#20195;&#34920;&#30340;&#23567;&#24314;&#35758;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;&#22312;&#39033;&#30446;&#24320;&#22987;&#26102;&#26377;&#19968;&#20123;&#20449;&#35465;&#65292;&#32780;&#19988;&#26681;&#25454;&#23459;&#31216;&#30340;&#25972;&#20307;&#35745;&#21010;&#23558;&#35768;&#22810;&#29305;&#24615;&#12289;&#25913;&#36827;&#21644;bugs&#36171;&#20104;&#21040;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#20013;&#30340;&#30446;&#26631;&#21457;&#24067;&#29256;&#26412;&#65292;&#20154;&#20204;&#20250;&#21644;&#20320;&#36208;&#21040;&#19968;&#36215;&#12290;&#19968;&#26086;&#20320;&#26681;&#25454;&#33258;&#24049;&#30340;&#38656;&#35201;&#30830;&#31435;&#20102;&#19968;&#20123;&#20107;&#24773;&#65292;&#20851;&#20110;&#23454;&#38469;&#21457;&#24067;<span class="emphasis"><em>&#26085;&#26399;</em></span>&#30340;&#23545;&#35805;&#23558;&#20250;&#21464;&#24471;&#38750;&#24120;&#24179;&#28369;&#12290;</p><p>&#21478;&#19968;&#20010;&#24456;&#37325;&#35201;&#30340;&#65292;&#19981;&#35201;&#25226;&#20219;&#20309;&#20915;&#23450;&#24403;&#20316;&#26159;&#22825;&#32463;&#22320;&#20041;&#30340;&#12290;&#23545;&#20110;&#26410;&#26469;&#29305;&#23450;&#21457;&#24067;&#30340;&#26576;&#20010;&#38382;&#39064;&#25152;&#20851;&#32852;&#30340;&#27880;&#37322;&#20013;&#65292;&#36992;&#35831;&#35752;&#35770;&#12289;&#24322;&#35758;&#24182;&#23613;&#21487;&#33021;&#30495;&#35802;&#30340;&#24076;&#26395;&#34987;&#35828;&#26381;&#12290;&#19981;&#35201;&#20026;&#20102;&#32451;&#20064;&#25511;&#21046;&#32780;&#32451;&#20064;&#25511;&#21046;&#65306;&#20854;&#20182;&#20154;&#36234;&#26159;&#28145;&#20837;&#30340;&#21442;&#19982;&#21040;&#21457;&#24067;&#35745;&#21010;&#36807;&#31243;&#65288;&#35265;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="share-management.html" title="&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;">the section called &#8220;&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;&#8221;</a>&#65289;&#65292;&#36234;&#26159;&#23481;&#26131;&#35828;&#26381;&#20854;&#20182;&#20154;&#20998;&#20139;&#20320;&#22312;&#36825;&#20010;&#38382;&#39064;&#19978;&#26412;&#23646;&#20110;&#20320;&#30340;&#29305;&#26435;&#12290;</p><p>&#21478;&#19968;&#20010;&#38477;&#20302;&#39033;&#30446;&#21457;&#24067;&#35745;&#21010;&#32039;&#24352;&#31243;&#24230;&#30340;&#26041;&#27861;&#26159;&#25552;&#39640;&#21457;&#24067;&#30340;&#39057;&#29575;&#12290;&#24403;&#21457;&#24067;&#20043;&#38388;&#30340;&#26102;&#38388;&#24456;&#38271;&#26102;&#65292;&#27599;&#27425;&#21457;&#24067;&#22312;&#27599;&#20010;&#20154;&#24515;&#30446;&#20013;&#30340;&#22320;&#20301;&#20063;&#34987;&#25918;&#22823;&#65307;&#22914;&#26524;&#20182;&#20204;&#30340;&#20195;&#30721;&#26410;&#33021;&#36827;&#20837;&#65292;&#20182;&#20204;&#20250;&#24863;&#35273;&#21040;&#26356;&#22810;&#30340;&#21387;&#21147;&#65292;&#22240;&#20026;&#20182;&#20204;&#30693;&#36947;&#19979;&#19968;&#27425;&#26426;&#20250;&#35201;&#31561;&#24453;&#24456;&#20037;&#12290;&#26681;&#25454;&#21457;&#24067;&#36807;&#31243;&#30340;&#37325;&#35201;&#31243;&#24230;&#65292;&#20197;&#21450;&#39033;&#30446;&#30340;&#26412;&#24615;&#65292;&#21457;&#24067;&#30340;&#38388;&#38548;&#21487;&#20197;&#22312;3&#20010;&#26376;&#21040;6&#20010;&#26376;&#20043;&#38388;&#65292;&#23613;&#31649;&#22914;&#26524;&#26377;&#38656;&#27714;&#26102;&#65292;&#32500;&#25252;&#32447;&#21487;&#20197;&#35753;&#24494;&#23567;&#21457;&#24067;&#26356;&#24555;&#19968;&#28857;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2574" href="#idp2574" class="para">23</a>] </sup>&#20316;&#20026;&#21478;&#22806;&#19968;&#20010;&#36873;&#25321;&#65292;&#20320;&#25110;&#35768;&#24076;&#26395;&#38405;&#35835;Martin Michlmayr&#21338;&#22763;&#30340;&#35770;&#25991;<em class="citetitle">Quality
Improvement in Volunteer Free and Open Source Software Projects:
Exploring the Impact of Release Management</em>&#65288;<a class="ulink" href="http://www.cyrius.com/publications/michlmayr-phd.html" target="_top">http://www.cyrius.com/publications/michlmayr-phd.html</a>&#65289;&#12290;&#23427;&#20351;&#29992;&#30340;&#26159;&#22522;&#20110;&#26102;&#38388;&#30340;&#21457;&#24067;&#36807;&#31243;&#65292;&#32780;&#19981;&#26159;&#22522;&#20110;&#29305;&#24615;&#30340;&#22823;&#22411;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#12290;Michlmayr&#20063;&#22312;Google&#25552;&#20379;&#20102;&#19968;&#20010;&#35813;&#20027;&#39064;&#30340;&#28436;&#35762;&#65292;&#21487;&#20197;&#36890;&#36807;Google Video&#30340;<a class="ulink" href="http://video.google.com/videoplay?docid=-5503858974016723264" target="_top">http://video.google.com/videoplay?docid=-5503858974016723264</a>&#35266;&#30475;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="release-lines.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="managing-volunteers.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#32500;&#25252;&#22810;&#21457;&#24067;&#32447; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</td></tr></table></div></body></html>
