<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#21457;&#24067;&#20998;&#25903;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="prev" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="next" href="stabilizing-a-release.html" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21457;&#24067;&#20998;&#25903;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="development-cycle.html">Prev</a> </td><th width="60%" align="center">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th><td width="20%" align="right"> <a accesskey="n" href="stabilizing-a-release.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#21457;&#24067;&#20998;&#25903;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-branches"></a>&#21457;&#24067;&#20998;&#25903;</h2></div></div></div><p>&#20174;&#24320;&#21457;&#32773;&#30340;&#35282;&#24230;&#35762;&#65292;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#22788;&#20110;&#36830;&#32493;&#21457;&#24067;&#30340;&#29366;&#24577;&#12290;&#24320;&#21457;&#32773;&#36890;&#24120;&#19968;&#30452;&#22312;&#20219;&#20309;&#26102;&#20505;&#37117;&#36816;&#34892;&#26368;&#26032;&#30340;&#21487;&#29992;&#20195;&#30721;&#65292;&#22240;&#20026;&#20182;&#20204;&#38656;&#35201;&#23450;&#20301;bug&#65292;&#32780;&#19988;&#22240;&#20026;&#20182;&#20204;&#36817;&#36317;&#31163;&#30340;&#25509;&#35302;&#39033;&#30446;&#65292;&#21487;&#20197;&#36991;&#24320;&#24403;&#21069;&#29305;&#24615;&#30340;&#19981;&#31283;&#23450;&#21306;&#22495;&#12290;&#20182;&#20204;&#36890;&#24120;&#20250;&#27599;&#22825;&#26356;&#26032;&#20182;&#20204;&#36719;&#20214;&#30340;&#22791;&#20221;&#65292;&#26377;&#26102;&#19968;&#22825;&#20960;&#27425;&#65292;&#24403;&#20182;&#20204;&#26816;&#20837;&#21464;&#26356;&#26102;&#65292;&#20182;&#20204;&#26377;&#36947;&#29702;&#35748;&#20026;&#20854;&#20182;&#24320;&#21457;&#32773;&#20250;&#22312;24&#23567;&#26102;&#20869;&#24471;&#21040;&#12290;</p><p>&#28982;&#32780;&#65292;&#20309;&#26102;&#39033;&#30446;&#24212;&#35813;&#20570;&#20986;&#27491;&#24335;&#30340;&#21457;&#24067;&#65311;&#26159;&#21542;&#20165;&#20165;&#21462;&#24471;&#26576;&#20010;&#26102;&#21051;&#30340;&#24555;&#29031;&#65292;&#25171;&#21253;&#24182;&#20132;&#32473;&#19990;&#30028;&#65292;&#28982;&#21518;&#35828;&#8220;3.5.0&#8221;&#65311;&#24120;&#35782;&#21578;&#35785;&#25105;&#20204;&#19981;&#26159;&#12290;&#39318;&#20808;&#65292;&#20960;&#20046;&#27809;&#26377;&#19968;&#20010;&#26102;&#21051;&#25972;&#20010;&#24320;&#21457;&#26641;&#26159;&#24178;&#20928;&#21644;&#20934;&#22791;&#22909;&#21457;&#24067;&#30340;&#12290;&#26032;&#24320;&#22987;&#30340;&#29305;&#24615;&#21487;&#33021;&#22788;&#20110;&#19981;&#21516;&#30340;&#29366;&#24577;&#12290;&#19968;&#20123;&#20154;&#21487;&#33021;&#26816;&#20837;&#20102;&#20462;&#27491;bug&#30340;&#20027;&#35201;&#21464;&#26356;&#65292;&#20294;&#26159;&#36825;&#20010;&#21464;&#26356;&#21487;&#33021;&#20805;&#28385;&#20105;&#35758;&#65292;&#22312;&#21457;&#29983;&#24555;&#29031;&#26102;&#20381;&#28982;&#22788;&#20110;&#36777;&#35770;&#38454;&#27573;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20165;&#20165;&#26159;&#24310;&#21518;&#24555;&#29031;&#65292;&#31561;&#24453;&#36777;&#35770;&#30340;&#32467;&#26463;&#26159;&#27809;&#26377;&#29992;&#30340;&#65292;&#22240;&#20026;&#27492;&#21051;&#21478;&#19968;&#20010;&#19981;&#30456;&#20851;&#30340;&#36777;&#35770;&#21487;&#33021;&#21516;&#26102;&#21457;&#29983;&#65292;&#37027;&#26102;&#20320;&#23601;&#38656;&#35201;&#31561;&#24453;<span class="emphasis"><em>&#37027;&#20010;</em></span>&#36777;&#35770;&#30340;&#32467;&#26463;&#12290;&#26080;&#27861;&#20445;&#35777;&#36825;&#20010;&#36807;&#31243;&#30340;&#32456;&#27490;&#12290;</p><p>&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992;&#25972;&#20010;&#26641;&#30340;&#24555;&#29031;&#20316;&#20026;&#21457;&#24067;&#37117;&#20250;&#24178;&#25200;&#27491;&#22312;&#36827;&#34892;&#30340;&#24320;&#21457;&#24037;&#20316;&#65292;&#21363;&#20351;&#25972;&#20010;&#26641;&#24050;&#32463;&#36827;&#20837;&#20102;&#21487;&#21457;&#24067;&#29366;&#24577;&#12290;&#20551;&#23450;&#24555;&#29031;&#23558;&#20250;&#25104;&#20026;&#8220;3.5.0&#8221;&#65307;&#32780;&#19979;&#20010;&#24555;&#29031;&#23558;&#20250;&#26159;&#8220;3.5.1&#8221;&#65292;&#20250;&#21253;&#21547;&#22312;3.5.0&#29256;&#26412;&#21457;&#29616;&#30340;&#22823;&#22810;&#25968;bug&#20462;&#27491;&#12290;&#20294;&#26159;&#22914;&#26524;&#24555;&#29031;&#26469;&#33258;&#21516;&#19968;&#20010;&#26641;&#65292;&#24320;&#21457;&#32773;&#22312;&#20004;&#20010;&#29256;&#26412;&#20043;&#38388;&#24212;&#35813;&#24590;&#20040;&#20570;&#65311;&#20182;&#20204;&#19981;&#21487;&#20197;&#28155;&#21152;&#26032;&#29305;&#24615;&#65307;&#20860;&#23481;&#24615;&#25919;&#31574;&#19981;&#20801;&#35768;&#36825;&#31181;&#34892;&#20026;&#12290;&#20294;&#26159;&#65292;&#19981;&#26159;&#27599;&#20010;&#20154;&#37117;&#20250;&#26377;&#28608;&#24773;&#20462;&#25913;3.5.0&#30340;&#20195;&#30721;bug&#12290;&#22240;&#20026;&#20154;&#20204;&#21487;&#33021;&#26377;&#38656;&#35201;&#23436;&#25104;&#30340;&#26032;&#29305;&#24615;&#65292;&#22914;&#26524;&#24517;&#39035;&#22312;&#38745;&#20505;&#21644;&#19981;&#24819;&#20570;&#30340;&#20107;&#24773;&#20043;&#38388;&#20570;&#20986;&#36873;&#25321;&#65292;&#20182;&#20204;&#20250;&#38750;&#24120;&#24868;&#24594;&#65292;&#32780;&#21407;&#22240;&#26159;&#39033;&#30446;&#21457;&#24067;&#36807;&#31243;&#35201;&#27714;&#24320;&#21457;&#26641;&#20445;&#25345;&#19981;&#33258;&#28982;&#30340;&#38745;&#40664;&#12290;</p><p>&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#19968;&#30452;&#26159;&#20351;&#29992;<em class="firstterm">&#21457;&#24067;&#20998;&#25903;</em>&#12290;&#19968;&#20010;&#21457;&#24067;&#20998;&#25903;&#20165;&#20165;&#26159;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65288;&#35265;<a class="xref" href="vc.html#vc-vocabulary-branch"><em class="firstterm">&#20998;&#25903;&#65288;branch&#65289;</em></a>&#65289;&#30340;&#19968;&#20010;&#20998;&#25903;&#65292;&#20854;&#20013;&#39044;&#23450;&#35201;&#21457;&#24067;&#30340;&#20195;&#30721;&#24050;&#32463;&#19982;&#24320;&#21457;&#20027;&#32447;&#20998;&#31163;&#12290;&#21457;&#24067;&#20998;&#25903;&#30340;&#27010;&#24565;&#19981;&#20165;&#20165;&#26469;&#33258;&#33258;&#30001;&#36719;&#20214;&#65307;&#35768;&#22810;&#21830;&#19994;&#24320;&#21457;&#32452;&#32455;&#20063;&#20250;&#20351;&#29992;&#23427;&#12290;&#28982;&#21518;&#65292;&#22312;&#21830;&#19994;&#29615;&#22659;&#20013;&#65292;&#21457;&#24067;&#20998;&#25903;&#36890;&#24120;&#34987;&#35748;&#20026;&#26159;&#26114;&#36149;&#30340;&#8212;&#19968;&#31867;&#27491;&#24335;&#30340;&#8220;&#26368;&#20339;&#23454;&#36341;&#8221;&#21487;&#20197;&#22312;&#20027;&#24320;&#21457;&#32447;&#38024;&#23545;&#26368;&#32456;&#26399;&#38480;&#30340;&#21516;&#26102;&#65292;&#21487;&#20197;&#35753;&#22242;&#38431;&#30340;&#27599;&#20010;&#20154;&#20998;&#25955;&#31934;&#21147;&#21435;&#23436;&#25104;&#31283;&#23450;&#20027;&#24320;&#21457;&#26641;&#30340;&#24037;&#20316;&#12290;</p><p>&#20294;&#26159;&#65292;&#21457;&#24067;&#20998;&#25903;&#22312;&#24320;&#28304;&#39033;&#30446;&#20013;&#26159;&#19981;&#21487;&#25110;&#32570;&#30340;&#12290;&#25105;&#32463;&#21382;&#36807;&#30340;&#19968;&#20123;&#27809;&#26377;&#21457;&#24067;&#20998;&#25903;&#30340;&#39033;&#30446;&#65292;&#20294;&#26159;&#36825;&#26679;&#24635;&#20250;&#23548;&#33268;&#19968;&#20123;&#24320;&#21457;&#32773;&#24517;&#39035;&#20572;&#27490;&#19979;&#26469;&#31561;&#24453;&#21035;&#20154;&#8212;&#36890;&#24120;&#26159;&#24494;&#23567;&#30340;&#8212;&#21457;&#24067;&#20986;&#38376;&#30340;&#24037;&#20316;&#12290;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#36890;&#24120;&#32467;&#26524;&#26159;&#19981;&#22909;&#30340;&#12290;&#39318;&#20808;&#65292;&#25972;&#20307;&#24320;&#21457;&#21160;&#21147;&#34987;&#38477;&#20302;&#12290;&#20854;&#27425;&#65292;&#21457;&#24067;&#29256;&#26412;&#21487;&#33021;&#26080;&#27861;&#36798;&#21040;&#24517;&#39035;&#30340;&#36136;&#37327;&#65292;&#22240;&#20026;&#21482;&#26377;&#23569;&#25968;&#20154;&#22312;&#19978;&#38754;&#24037;&#20316;&#65292;&#32780;&#19988;&#20182;&#20204;&#20250;&#24613;&#20110;&#23436;&#25104;&#24037;&#20316;&#65292;&#36825;&#26679;&#21035;&#20154;&#25165;&#33021;&#22238;&#26469;&#24037;&#20316;&#12290;&#31532;&#19977;&#65292;&#36890;&#36807;&#35774;&#23450;&#20102;&#19968;&#20010;&#24773;&#24418;&#65292;&#19981;&#21516;&#31867;&#22411;&#30340;&#24037;&#20316;&#19981;&#24517;&#35201;&#30340;&#20114;&#30456;&#24178;&#25200;&#20102;&#21035;&#20154;&#30340;&#24037;&#20316;&#65292;&#22312;&#24515;&#29702;&#19978;&#20998;&#21106;&#20102;&#24320;&#21457;&#22242;&#38431;&#12290;&#22788;&#20110;&#20572;&#28382;&#30340;&#24320;&#21457;&#32773;&#21487;&#33021;&#20250;&#24456;&#20048;&#24847;&#20026;&#21457;&#24067;&#20998;&#25903;&#36129;&#29486;<span class="emphasis"><em>&#19968;&#20123;</em></span>&#31934;&#21147;&#65292;&#21482;&#35201;&#20182;&#20204;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#26085;&#31243;&#21644;&#20852;&#36259;&#20570;&#20986;&#36873;&#25321;&#12290;&#20294;&#26159;&#65292;&#27809;&#26377;&#36825;&#20010;&#20998;&#25903;&#65292;&#20182;&#20204;&#30340;&#36873;&#25321;&#23601;&#21464;&#25104;&#8220;&#20170;&#22825;&#25105;&#21487;&#20197;&#21442;&#19982;&#39033;&#30446;&#21527;&#65311;&#8221;&#32780;&#19981;&#26159;&#8220;&#25105;&#21487;&#20197;&#20026;&#21457;&#24067;&#24037;&#20316;&#65292;&#36824;&#26159;&#20026;&#20027;&#24320;&#21457;&#32447;&#19978;&#30340;&#26032;&#29305;&#24615;&#30340;&#24037;&#20316;&#65311;&#8221;</p><div class="sect2" title="&#21457;&#24067;&#20998;&#25903;&#30340;&#25216;&#24039;"><div class="titlepage"><div><div><h3 class="title"><a name="release-branch-mechanics"></a>&#21457;&#24067;&#20998;&#25903;&#30340;&#25216;&#24039;</h3></div></div></div><p>&#21019;&#24314;&#21457;&#24067;&#20998;&#25903;&#30340;&#30830;&#20999;&#25216;&#24039;&#21462;&#20915;&#20110;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#24403;&#28982;&#22522;&#26412;&#27010;&#24565;&#22522;&#26412;&#19978;&#26159;&#30456;&#21516;&#30340;&#12290;&#19968;&#20010;&#20998;&#25903;&#36890;&#24120;&#20174;&#21478;&#19968;&#20010;&#20998;&#25903;&#25110;&#20027;&#24178;&#20998;&#20986;&#12290;&#20256;&#32479;&#19978;&#65292;&#20027;&#24178;&#65288;trunk&#65289;&#26159;&#20027;&#35201;&#24320;&#21457;&#36827;&#34892;&#30340;&#22320;&#26041;&#65292;&#19981;&#21463;&#21457;&#24067;&#30340;&#38480;&#21046;&#12290;&#31532;&#19968;&#20010;&#21457;&#24067;&#20998;&#25903;&#65292;&#20063;&#23601;&#26159;&#23558;&#20250;&#21464;&#25104;&#8220;1.0&#8221;&#29256;&#26412;&#30340;&#20998;&#25903;&#26159;&#20174;&#20027;&#24178;&#20998;&#20986;&#30340;&#12290;&#22312;CVS&#20013;&#65292;&#20998;&#25903;&#21629;&#20196;&#31867;&#20284;&#19979;&#38754;&#30340;&#24418;&#24335;</p><pre class="screen">
$ cd trunk-working-copy
$ cvs tag -b RELEASE_1_0_X
</pre><p>&#25110;&#32773;&#22312;Subversion&#20013;&#65292;&#31867;&#20284;&#65306;</p><pre class="screen">
$ svn copy http://.../repos/trunk http://.../repos/branches/1.0.x
</pre><p>&#65288;&#36825;&#20123;&#20363;&#23376;&#37117;&#20551;&#35774;&#20351;&#29992;&#19977;&#37096;&#20998;&#30340;&#21457;&#24067;&#21495;&#30721;&#31995;&#32479;&#12290;&#22240;&#20026;&#25105;&#26080;&#27861;&#23637;&#31034;&#27599;&#20010;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#30340;&#31934;&#30830;&#21629;&#20196;&#65292;&#25105;&#23558;&#20250;&#32473;&#20986;CVS&#21644;Subversion&#30340;&#20363;&#23376;&#65292;&#24076;&#26395;&#20854;&#20182;&#31995;&#32479;&#20013;&#23545;&#24212;&#30340;&#21629;&#20196;&#21487;&#20197;&#20174;&#20013;&#25512;&#23548;&#20986;&#26469;&#12290;&#65289;</p><p>&#35831;&#27880;&#24847;&#65292;&#25105;&#20204;&#21019;&#24314;&#20102;&#20998;&#25903;&#8220;1.0.x&#8221;&#65288;&#21253;&#21547;&#25991;&#23383;&#8220;x&#8221;&#65289;&#65292;&#32780;&#19981;&#26159;&#8220;1.0.0&#8221;&#12290;&#36825;&#26159;&#22240;&#20026;&#21516;&#19968;&#26465;&#27425;&#35201;&#24320;&#21457;&#32447;&#8212;&#20063;&#23601;&#26159;&#21516;&#19968;&#20010;&#20998;&#25903;&#8212;&#23558;&#20250;&#34987;&#25152;&#26377;&#24494;&#23567;&#29256;&#26412;&#20849;&#29992;&#12290;&#29992;&#20110;&#21457;&#24067;&#30340;&#20998;&#25903;&#31283;&#23450;&#21270;&#23558;&#20250;&#22312;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="stabilizing-a-release.html" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;">the section called &#8220;&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;&#8221;</a>&#25551;&#36848;&#12290;&#36825;&#37324;&#65292;&#25105;&#20204;&#20165;&#20165;&#20851;&#27880;&#19982;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#20132;&#20114;&#21644;&#21457;&#24067;&#36807;&#31243;&#12290;&#24403;&#21457;&#24067;&#20998;&#25903;&#24050;&#32463;&#31283;&#23450;&#24182;&#20570;&#22909;&#20934;&#22791;&#65292;&#21017;&#24212;&#35813;&#20174;&#20998;&#25903;&#23436;&#25104;&#26631;&#35760;&#24555;&#29031;&#20102;&#65306;</p><pre class="screen">
$ cd RELEASE_1_0_X-working-copy
$ cvs tag RELEASE_1_0_0
</pre><p>&#25110;</p><pre class="screen">
$ svn copy http://.../repos/branches/1.0.x http://.../repos/tags/1.0.0
</pre><p>&#29616;&#22312;&#26631;&#31614;&#20195;&#34920;&#20102;&#39033;&#30446;&#28304;&#20195;&#30721;&#26641;&#22312;1.0.0&#29256;&#26412;&#30340;&#31934;&#30830;&#29366;&#24577;&#65288;&#22312;&#36739;&#32769;&#29256;&#26412;&#30340;&#25171;&#21253;&#21457;&#24067;&#21644;&#20108;&#36827;&#21046;&#31243;&#24207;&#34987;&#21435;&#25481;&#21518;&#65292;&#22914;&#26524;&#26576;&#20154;&#24076;&#26395;&#33719;&#21462;&#26102;&#38750;&#24120;&#26377;&#29992;&#65289;&#12290;&#21516;&#19968;&#24320;&#21457;&#32447;&#30340;&#19979;&#20010;&#24494;&#23567;&#29256;&#26412;&#20063;&#24456;&#21487;&#33021;&#38656;&#35201;&#22312;1.0.x&#20998;&#25903;&#19978;&#20934;&#22791;&#65292;&#23436;&#25104;&#21518;&#65292;&#21017;&#22686;&#21152;1.0.1&#30340;&#26631;&#31614;&#12290;&#20877;&#27425;&#65292;&#37325;&#22797;&#23436;&#25104;1.0.2&#31561;&#31561;&#12290;&#24403;&#38656;&#35201;&#23436;&#25104;1.1.x&#29256;&#26412;&#26102;&#65292;&#21017;&#20174;&#20027;&#24178;&#20877;&#21019;&#24314;&#19968;&#20010;&#20998;&#25903;&#12290;</p><pre class="screen">
$ cd trunk-working-copy
$ cvs tag -b RELEASE_1_1_X
</pre><p>&#25110;</p><pre class="screen">
$ svn copy http://.../repos/trunk http://.../repos/branches/1.1.x
</pre><p>&#32500;&#25252;&#21487;&#20197;&#22312;1.0.x&#21644;1.1.x&#19978;&#24182;&#34892;&#32487;&#32493;&#65292;&#32780;&#29256;&#26412;&#21457;&#24067;&#20063;&#21487;&#20197;&#22312;&#20004;&#26465;&#32447;&#19978;&#29420;&#31435;&#36827;&#34892;&#12290;&#23454;&#38469;&#19978;&#65292;&#22312;&#20004;&#20010;&#19981;&#21516;&#30340;&#24320;&#21457;&#32447;&#19978;&#36817;&#20046;&#21516;&#27493;&#30340;&#21457;&#24067;&#29256;&#26412;&#24182;&#19981;&#32597;&#35265;&#12290;&#36739;&#26087;&#30340;&#31995;&#21015;&#26159;&#20445;&#23432;&#30340;&#31449;&#28857;&#31649;&#29702;&#21592;&#24212;&#35813;&#20351;&#29992;&#30340;&#65292;&#20182;&#20204;&#21487;&#33021;&#19981;&#24076;&#26395;&#22312;&#27809;&#26377;&#23567;&#24515;&#20934;&#22791;&#30340;&#24773;&#20917;&#19979;&#20570;&#20986;&#37325;&#22823;&#30340;&#36339;&#36291;&#21040;&#65288;&#20551;&#35774;&#21040;&#65289;1.1&#12290;&#32780;&#21516;&#26102;&#65292;&#26356;&#22810;&#21191;&#20110;&#20882;&#38505;&#30340;&#20154;&#20250;&#23558;&#29256;&#26412;&#20445;&#25345;&#22312;&#26368;&#39640;&#30340;&#24320;&#21457;&#32447;&#19978;&#65292;&#20197;&#30830;&#20445;&#20182;&#20204;&#33021;&#33719;&#21462;&#26368;&#26032;&#30340;&#29305;&#24615;&#65292;&#21363;&#20351;&#35201;&#20882;&#26356;&#22823;&#30340;&#31283;&#23450;&#24615;&#39118;&#38505;&#12290;</p></div><p>&#36825;&#24182;&#19981;&#26159;&#21807;&#19968;&#30340;&#21457;&#24067;&#20998;&#25903;&#31574;&#30053;&#65292;&#24403;&#28982;&#12290;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#20063;&#19981;&#26159;&#26368;&#22909;&#30340;&#65292;&#21482;&#26159;&#22312;&#25105;&#21442;&#19982;&#36807;&#30340;&#39033;&#30446;&#20013;&#23427;&#30340;&#34920;&#29616;&#30456;&#24403;&#22909;&#12290;&#23613;&#21487;&#20197;&#20351;&#29992;&#26377;&#25928;&#30340;&#31574;&#30053;&#65292;&#20294;&#35831;&#29282;&#35760;&#35201;&#28857;&#65306;&#21457;&#24067;&#20998;&#25903;&#30340;&#30446;&#30340;&#26159;&#38548;&#31163;&#21457;&#24067;&#24037;&#20316;&#19982;&#26085;&#24120;&#24320;&#21457;&#65292;&#24182;&#32473;&#39033;&#30446;&#19968;&#20010;&#29289;&#29702;&#23454;&#20307;&#29992;&#20110;&#32452;&#32455;&#25972;&#20010;&#21457;&#24067;&#36807;&#31243;&#12290;&#36825;&#20010;&#36807;&#31243;&#23558;&#20250;&#22312;&#19979;&#19968;&#23567;&#33410;&#35814;&#32454;&#25551;&#36848;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="development-cycle.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="stabilizing-a-release.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#31283;&#23450;&#21457;&#24067;&#29256;&#26412;</td></tr></table></div></body></html>
