<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#35774;&#32622;&#39118;&#26684;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="getting-started.html" title="Chapter 2. &#36215;&#27493;"><link rel="prev" href="license-quickstart.html" title="&#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992;"><link rel="next" href="announcing.html" title="&#36890;&#21578;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#35774;&#32622;&#39118;&#26684;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="license-quickstart.html">Prev</a> </td><th width="60%" align="center">Chapter 2. &#36215;&#27493;</th><td width="20%" align="right"> <a accesskey="n" href="announcing.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#35774;&#32622;&#39118;&#26684;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="setting-tone"></a>&#35774;&#32622;&#39118;&#26684;</h2></div></div></div><p>&#25105;&#20204;&#24050;&#32463;&#35206;&#30422;&#20102;&#37197;&#32622;&#39033;&#30446;&#26102;&#30340;&#22823;&#22810;&#25968;&#19968;&#27425;&#24615;&#20219;&#21153;&#65306;&#36873;&#25321;&#19968;&#20010;&#35768;&#21487;&#35777;&#65292;&#23433;&#25490;&#21021;&#22987;&#30340;&#32593;&#31449;&#31561;&#31561;&#12290;&#20294;&#26159;&#24320;&#22987;&#19968;&#20010;&#26032;&#39033;&#30446;&#26102;&#26368;&#37325;&#35201;&#30340;&#26041;&#38754;&#26159;&#20250;&#21464;&#21270;&#30340;&#12290;&#36873;&#25321;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#22320;&#22336;&#24456;&#23481;&#26131;&#65307;&#32780;&#20445;&#35777;&#21015;&#34920;&#30340;&#23545;&#35805;&#19981;&#36208;&#39064;&#19988;&#26377;&#25928;&#29575;&#21017;&#23436;&#20840;&#26159;&#21478;&#19968;&#22238;&#20107;&#24773;&#12290;&#22914;&#26524;&#39033;&#30446;&#32463;&#36807;&#22810;&#24180;&#30340;&#20851;&#38381;&#65292;&#20869;&#37096;&#30340;&#24320;&#21457;&#65292;&#37325;&#26032;&#24320;&#22987;&#26102;&#24320;&#21457;&#36807;&#31243;&#23558;&#20250;&#25913;&#21464;&#65292;&#20320;&#38656;&#35201;&#20934;&#22791;&#24320;&#21457;&#32773;&#26469;&#24212;&#23545;&#36825;&#31181;&#21464;&#21270;&#12290;</p><p>&#31532;&#19968;&#27493;&#26159;&#26368;&#38590;&#30340;&#65292;&#22240;&#20026;&#26410;&#26469;&#31649;&#29702;&#30340;&#20808;&#20363;&#21644;&#39044;&#26399;&#37117;&#27809;&#26377;&#35774;&#32622;&#12290;&#27491;&#24335;&#30340;&#35268;&#21017;&#36824;&#27809;&#26377;&#24102;&#26469;&#39033;&#30446;&#30340;&#31283;&#23450;&#24615;&#65292;&#32780;&#26159;&#30001;&#24320;&#21457;&#36807;&#31243;&#20013;&#20849;&#20139;&#30340;&#38590;&#20197;&#31283;&#23450;&#30340;&#22242;&#20307;&#26234;&#24935;&#24102;&#26469;&#12290;&#20063;&#35768;&#26377;&#24050;&#32463;&#20889;&#22909;&#30340;&#35268;&#21017;&#65292;&#20294;&#36890;&#24120;&#26159;&#36890;&#36807;&#38590;&#20197;&#39044;&#26009;&#30340;&#65292;&#19981;&#26029;&#36827;&#21270;&#30340;&#21327;&#35758;&#26469;&#24341;&#23548;&#39033;&#30446;&#12290;&#20889;&#22909;&#30340;&#35268;&#21017;&#19981;&#33021;&#23450;&#20041;&#20854;&#25551;&#36848;&#30340;&#39033;&#30446;&#25991;&#21270;&#65292;&#21363;&#20351;&#21518;&#26469;&#20063;&#26159;&#36817;&#20284;&#32780;&#24050;&#12290;</p><p>&#36825;&#37324;&#26159;&#22914;&#27492;&#35299;&#20915;&#38382;&#39064;&#30340;&#19968;&#20123;&#21407;&#22240;&#12290;&#25104;&#38271;&#21644;&#39640;&#36716;&#21270;&#29575;&#19981;&#20250;&#20687;&#19968;&#33324;&#20154;&#24819;&#35937;&#30340;&#37027;&#26679;&#25439;&#22351;&#31038;&#20250;&#35268;&#33539;&#30340;&#31215;&#32047;&#12290;&#21482;&#35201;&#21464;&#21270;&#19981;&#35201;<span class="emphasis"><em>&#22826;</em></span>&#24555;&#65292;&#23601;&#26377;&#26102;&#38388;&#35753;&#26032;&#26469;&#32773;&#23398;&#20250;&#22914;&#20309;&#20570;&#20107;&#65292;&#22312;&#20182;&#20204;&#23398;&#20250;&#20043;&#21518;&#65292;&#20182;&#20204;&#33258;&#24049;&#23601;&#20250;&#26469;&#21152;&#24378;&#36825;&#31181;&#26041;&#24335;&#12290;&#32771;&#34385;&#19968;&#19979;&#25968;&#19990;&#32426;&#20197;&#26469;&#20799;&#31461;&#27468;&#26354;&#30340;&#21457;&#23637;&#12290;&#29616;&#22312;&#23401;&#23376;&#20204;&#28436;&#21809;&#30340;&#27468;&#26354;&#21644;&#20960;&#30334;&#24180;&#21069;&#26377;&#22823;&#33268;&#30456;&#21516;&#30340;&#38901;&#33050;&#65292;&#21363;&#20351;&#29616;&#22312;&#30340;&#23401;&#23376;&#20174;&#26469;&#27809;&#26377;&#29983;&#27963;&#22312;&#37027;&#20010;&#26102;&#20195;&#12290;&#23567;&#28857;&#30340;&#23401;&#23376;&#21548;&#21040;&#22823;&#28857;&#30340;&#23401;&#23376;&#21809;&#27468;&#65292;&#28982;&#21518;&#24403;&#20182;&#20204;&#38271;&#22823;&#20102;&#65292;&#20182;&#20204;&#21448;&#20250;&#22312;&#26356;&#23567;&#30340;&#23401;&#23376;&#38754;&#21069;&#28436;&#21809;&#12290;&#23401;&#23376;&#19981;&#26159;&#25925;&#24847;&#21442;&#19982;&#36825;&#20010;&#20256;&#36882;&#31243;&#24207;&#65292;&#24403;&#28982;&#65292;&#36825;&#20123;&#27468;&#26354;&#30340;&#20256;&#25215;&#30830;&#23454;&#26159;&#22240;&#20026;&#26377;&#35268;&#24459;&#21644;&#37325;&#22797;&#30340;&#20256;&#36882;&#12290;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#19981;&#20250;&#20197;&#19990;&#32426;&#65288;&#25105;&#20204;&#36824;&#19981;&#33021;&#30693;&#36947;&#65289;&#20316;&#20026;&#27979;&#37327;&#30340;&#26102;&#38388;&#21051;&#24230;&#65292;&#20294;&#26159;&#21464;&#21270;&#21644;&#20256;&#36882;&#38750;&#24120;&#31867;&#20284;&#12290;&#36716;&#21270;&#29575;&#26356;&#24555;&#65292;&#19981;&#31649;&#24590;&#26679;&#65292;&#24517;&#39035;&#20197;&#26356;&#27963;&#36291;&#21644;&#24910;&#37325;&#30340;&#20256;&#36882;&#25237;&#20837;&#26469;&#20316;&#20026;&#34917;&#20607;&#12290;</p><p>&#20154;&#20204;&#36890;&#24120;&#20250;&#26399;&#26395;&#21644;&#23547;&#25214;&#31038;&#20250;&#35268;&#33539;&#30340;&#20107;&#23454;&#65292;&#20250;&#25104;&#20026;&#36825;&#31181;&#21162;&#21147;&#30340;&#36741;&#21161;&#12290;&#36825;&#20063;&#26159;&#20154;&#31867;&#30340;&#20570;&#27861;&#12290;&#22312;&#20219;&#20309;&#20197;&#20849;&#21516;&#21162;&#21147;&#32479;&#19968;&#30340;&#22242;&#38431;&#20013;&#65292;&#21152;&#20837;&#32773;&#37117;&#20250;&#20973;&#30452;&#35273;&#23547;&#25214;&#21487;&#20197;&#23558;&#33258;&#24049;&#26631;&#35760;&#20026;&#22242;&#38431;&#19968;&#37096;&#20998;&#30340;&#34892;&#20026;&#12290;&#23613;&#26089;&#35774;&#23450;&#20808;&#20363;&#30340;&#30446;&#26631;&#26159;&#35753;&#36825;&#20123;&#8220;&#32452;&#20869;&#8221;&#34892;&#20026;&#23545;&#20110;&#39033;&#30446;&#21457;&#29983;&#20316;&#29992;&#65307;&#19968;&#26086;&#24314;&#31435;&#65292;&#22810;&#21322;&#20250;&#29983;&#29983;&#19981;&#24687;&#12290;</p><p>&#36890;&#36807;&#29305;&#23450;&#23454;&#20363;&#65292;&#20320;&#21487;&#20197;&#35774;&#32622;&#22909;&#30340;&#20808;&#20363;&#12290;&#36825;&#19981;&#24517;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#21015;&#34920;&#65292;&#20294;&#26159;&#36890;&#36807;&#23613;&#26089;&#35774;&#32622;&#36825;&#26679;&#30340;&#21327;&#20316;&#24773;&#32490;&#30340;&#26041;&#27861;&#65292;&#21487;&#20197;&#22823;&#22823;&#30340;&#24110;&#21161;&#39033;&#30446;&#12290;&#20174;&#29289;&#29702;&#19978;&#35762;&#65292;&#27599;&#20010;&#24320;&#21457;&#32773;&#37117;&#22312;&#33258;&#24049;&#30340;&#25151;&#38388;&#29420;&#31435;&#24037;&#20316;&#65292;&#20294;&#26159;&#20320;&#21487;&#20197;&#35774;&#27861;&#35753;&#20182;&#20204;<span class="emphasis"><em>&#24863;&#35273;</em></span>&#26159;&#22312;&#19968;&#20010;&#25151;&#38388;&#19968;&#36215;&#24037;&#20316;&#12290;&#20182;&#20204;&#36825;&#26679;&#30340;&#24863;&#35273;&#36234;&#22810;&#65292;&#23601;&#20250;&#22312;&#39033;&#30446;&#19978;&#33457;&#36153;&#26356;&#22810;&#30340;&#26102;&#38388;&#12290;&#25105;&#36873;&#25321;&#20102;&#36825;&#20123;&#20363;&#23376;&#65292;&#22240;&#20026;&#36825;&#20123;&#23454;&#20363;&#26469;&#33258;Subversion&#39033;&#30446;&#65288;<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>&#65289;&#65292;&#32780;&#25105;&#20174;&#19968;&#24320;&#22987;&#23601;&#21442;&#19982;&#24182;&#35266;&#23519;&#20102;&#36825;&#20123;&#23454;&#20363;&#12290;&#20294;&#26159;&#36825;&#19981;&#20165;&#20165;&#23545;Subversion&#26377;&#25928;&#65307;&#22823;&#22810;&#25968;&#24320;&#28304;&#39033;&#30446;&#20013;&#37117;&#20250;&#36935;&#21040;&#31867;&#20284;&#30340;&#24773;&#24418;&#65292;&#36825;&#26159;&#24320;&#20010;&#22909;&#22836;&#30340;&#22909;&#26426;&#20250;&#12290;</p><div class="sect2" title="&#36991;&#20813;&#31169;&#19979;&#35752;&#35770;"><div class="titlepage"><div><div><h3 class="title"><a name="avoid-private-discussions"></a>&#36991;&#20813;&#31169;&#19979;&#35752;&#35770;</h3></div></div></div><p>&#21363;&#20351;&#20320;&#24050;&#32463;&#23558;&#39033;&#30446;&#20844;&#24320;&#65292;&#20320;&#21644;&#20320;&#30340;&#21019;&#22987;&#20154;&#20063;&#20250;&#32463;&#24120;&#24076;&#26395;&#36890;&#36807;&#31169;&#19979;&#35752;&#35770;&#26469;&#35299;&#20915;&#22256;&#38590;&#30340;&#38382;&#39064;&#12290;&#36825;&#22312;&#39033;&#30446;&#30340;&#24320;&#22987;&#38454;&#27573;&#23588;&#20854;&#26126;&#26174;&#65292;&#22240;&#20026;&#27492;&#26102;&#38656;&#35201;&#20570;&#20986;&#35768;&#22810;&#37325;&#35201;&#30340;&#20915;&#23450;&#65292;&#32780;&#21482;&#26377;&#23569;&#37327;&#24535;&#24895;&#32773;&#33021;&#22815;&#32988;&#20219;&#12290;&#20320;&#20250;&#21457;&#29616;&#20844;&#24320;&#35752;&#35770;&#30340;&#26126;&#26174;&#32570;&#28857;&#65306;&#37038;&#20214;&#23545;&#35805;&#26412;&#36523;&#30340;&#24310;&#36831;&#24615;&#65292;&#38656;&#35201;&#20445;&#30041;&#36275;&#22815;&#30340;&#26102;&#38388;&#26469;&#36798;&#25104;&#19968;&#33268;&#65292;&#22788;&#29702;&#33258;&#20197;&#20026;&#26159;&#30340;&#24188;&#31258;&#30340;&#24535;&#24895;&#32773;&#65288;&#27599;&#20010;&#39033;&#30446;&#37117;&#26377;&#65307;&#26377;&#20123;&#23558;&#26469;&#20250;&#25104;&#20026;&#26126;&#26143;&#36129;&#29486;&#32773;&#65292;&#32780;&#26377;&#20123;&#20250;&#27704;&#36828;&#20445;&#25345;&#24188;&#31258;&#65289;&#65292;&#20063;&#23601;&#26159;&#37027;&#20123;&#19981;&#33021;&#29702;&#35299;&#20320;&#20026;&#20160;&#20040;&#21482;&#24076;&#26395;&#35299;&#20915;&#38382;&#39064;X&#65292;&#32780;X&#26126;&#26174;&#26159;&#22823;&#38382;&#39064;Y&#30340;&#23376;&#38598;&#30340;&#20154;&#12290;&#31192;&#23494;&#20915;&#23450;&#24182;&#20351;&#20043;&#25104;&#20026;<span class="foreignphrase"><em class="foreignphrase">&#26082;&#25104;&#20107;&#23454;</em></span>&#65292;&#25110;&#32773;&#33267;&#23569;&#25104;&#20026;&#32852;&#21512;&#21644;&#26377;&#24433;&#21709;&#21147;&#30340;&#25237;&#31080;&#38598;&#22242;&#30340;&#22362;&#23454;&#25512;&#33616;&#65292;&#30830;&#23454;&#38750;&#24120;&#26377;&#21560;&#24341;&#21147;&#12290;</p><p>&#19981;&#35201;&#36825;&#26679;&#20570;&#12290;</p><p>&#23613;&#31649;&#20844;&#24320;&#35752;&#35770;&#21487;&#33021;&#24456;&#31528;&#37325;&#65292;&#20294;&#26159;&#20174;&#38271;&#36828;&#26469;&#30475;&#36825;&#26679;&#20570;&#26356;&#21512;&#36866;&#12290;&#31169;&#19979;&#37324;&#20570;&#20986;&#37325;&#35201;&#30340;&#20915;&#23450;&#23601;&#20687;&#26159;&#23558;&#36129;&#29486;&#32773;&#25490;&#26021;&#20986;&#39033;&#30446;&#19968;&#26679;&#12290;&#27809;&#26377;&#37325;&#35201;&#30340;&#24535;&#24895;&#32773;&#20250;&#24895;&#24847;&#21574;&#22312;&#36825;&#26679;&#19968;&#20010;&#30001;&#31192;&#23494;&#22996;&#21592;&#20250;&#20570;&#37325;&#35201;&#20915;&#23450;&#30340;&#29615;&#22659;&#37324;&#12290;&#27492;&#22806;&#65292;&#20844;&#24320;&#35752;&#35770;&#20063;&#20250;&#20174;&#20854;&#21103;&#20316;&#29992;&#20013;&#33719;&#30410;&#65292;&#26080;&#35770;&#26159;&#22810;&#20040;&#30701;&#26242;&#30340;&#25216;&#26415;&#38382;&#39064;&#65292;&#19968;&#32463;&#21457;&#36215;&#37117;&#20250;&#19968;&#30452;&#35752;&#35770;&#19979;&#21435;&#65306;

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#35752;&#35770;&#26377;&#21161;&#20110;&#35757;&#32451;&#21644;&#25945;&#32946;&#26032;&#24320;&#21457;&#32773;&#12290;&#20320;&#19981;&#30693;&#36947;&#26377;&#22810;&#23569;&#21452;&#30524;&#30555;&#22312;&#20851;&#27880;&#30528;&#35752;&#35770;&#65307;&#21363;&#20351;&#22823;&#22810;&#25968;&#20154;&#19981;&#20250;&#21442;&#19982;&#65292;&#20173;&#28982;&#21487;&#33021;&#26377;&#24456;&#22810;&#20154;&#22312;&#38745;&#38745;&#30340;&#36319;&#36394;&#65292;&#25910;&#38598;&#36719;&#20214;&#30340;&#20449;&#24687;&#12290;</p></li><li class="listitem"><p>&#35752;&#35770;&#20250;&#35757;&#32451;<span class="emphasis"><em>&#20320;</em></span>&#22914;&#20309;&#21521;&#19981;&#29087;&#24713;&#36719;&#20214;&#30340;&#20154;&#20204;&#35299;&#37322;&#25216;&#26415;&#38382;&#39064;&#12290;&#36825;&#31181;&#25216;&#24039;&#38656;&#35201;&#32451;&#20064;&#65292;&#20320;&#19981;&#33021;&#20174;&#24050;&#32463;&#30693;&#36947;&#20320;&#25152;&#30693;&#36947;&#30340;&#20154;&#37027;&#37324;&#33719;&#24471;&#36825;&#31181;&#32451;&#20064;&#12290;</p></li><li class="listitem"><p>&#20043;&#21518;&#65292;&#35752;&#35770;&#21644;&#32467;&#35770;&#23558;&#20250;&#19968;&#30452;&#23384;&#25918;&#22312;&#20844;&#20849;&#24402;&#26723;&#20013;&#65292;&#21487;&#20197;&#20445;&#35777;&#20197;&#21518;&#30340;&#35752;&#35770;&#19981;&#20250;&#22238;&#21040;&#21516;&#26679;&#30340;&#27493;&#39588;&#20013;&#12290;&#35265;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a></span>&#30340;<a class="xref" href="growth.html#using-archives" title="&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;">the section called &#8220;&#24402;&#26723;&#30340;&#26174;&#33879;&#20351;&#29992;&#8221;</a>&#12290;</p></li></ul></div><p>

</p><p>&#26368;&#21518;&#65292;&#24456;&#26377;&#21487;&#33021;&#26576;&#20010;&#20154;&#20250;&#25552;&#20986;&#19968;&#20010;&#20320;&#20174;&#24819;&#21040;&#36807;&#30340;&#22909;&#20027;&#24847;&#65292;&#32473;&#23545;&#35805;&#24102;&#26469;&#30495;&#27491;&#30340;&#36129;&#29486;&#12290;&#24456;&#38590;&#35828;&#36825;&#26377;&#22810;&#22823;&#30340;&#21487;&#33021;&#65307;&#36825;&#20165;&#20165;&#30001;&#20195;&#30721;&#30340;&#22797;&#26434;&#31243;&#24230;&#21644;&#38656;&#27714;&#30340;&#19987;&#19994;&#31243;&#24230;&#20915;&#23450;&#12290;&#20294;&#26159;&#22914;&#26524;&#20801;&#35768;&#25105;&#20351;&#29992;&#36726;&#20107;&#20316;&#20026;&#35777;&#25454;&#65292;&#25105;&#20250;&#35777;&#26126;&#36825;&#26679;&#20570;&#27604;&#30452;&#35273;&#25152;&#26399;&#26395;&#30340;&#32467;&#26524;&#26356;&#22909;&#12290;&#22312;Subversion&#39033;&#30446;&#65292;&#25105;&#20204;&#65288;&#21019;&#22987;&#20154;&#65289;&#30456;&#20449;&#25105;&#20204;&#38754;&#23545;&#30340;&#26159;&#19968;&#32452;&#28145;&#20837;&#32780;&#22797;&#26434;&#30340;&#38382;&#39064;&#65292;&#20026;&#27492;&#25105;&#20204;&#30171;&#33510;&#24605;&#32771;&#20102;&#20960;&#20010;&#26376;&#65292;&#25105;&#20204;&#24456;&#26126;&#30830;&#30340;&#24576;&#30097;&#22312;&#26032;&#24314;&#31435;&#30340;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#20250;&#26377;&#20219;&#20309;&#20154;&#20570;&#20986;&#30495;&#27491;&#30340;&#36129;&#29486;&#12290;&#25152;&#20197;&#25105;&#20204;&#36873;&#25321;&#20102;&#19968;&#26465;&#27604;&#36739;&#25042;&#24816;&#30340;&#26041;&#24335;&#65292;&#24320;&#22987;&#36890;&#36807;&#31169;&#19979;&#37038;&#20214;&#35752;&#35770;&#25216;&#26415;&#24819;&#27861;&#65292;&#30452;&#21040;&#39033;&#30446;&#30340;&#19968;&#20010;&#35266;&#23519;&#32773;<sup>[<a name="idp585" href="#ftn.idp585" class="footnote">10</a>]</sup>&#21957;&#20986;&#20102;&#38382;&#39064;&#65292;&#24182;&#35201;&#27714;&#23558;&#35752;&#35770;&#20844;&#24320;&#12290;&#30504;&#20102;&#30504;&#30524;&#25105;&#20204;&#36825;&#26679;&#20570;&#20102;&#8212;&#21518;&#26469;&#30340;&#32467;&#26524;&#35753;&#25105;&#20204;&#21313;&#20998;&#24778;&#35766;&#65292;&#25105;&#20204;&#24456;&#24555;&#20415;&#33719;&#24471;&#20102;&#35768;&#22810;&#26377;&#35265;&#22320;&#30340;&#22238;&#22797;&#21644;&#24314;&#35758;&#12290;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#20154;&#20204;&#25552;&#20379;&#30340;&#24819;&#27861;&#37117;&#26159;&#25105;&#20204;&#20174;&#26469;&#27809;&#26377;&#24819;&#21040;&#30340;&#12290;&#32467;&#26524;&#26159;&#37038;&#20214;&#21015;&#34920;&#20013;&#19968;&#19979;&#23376;&#22810;&#20102;&#35768;&#22810;<span class="emphasis"><em>&#38750;&#24120;</em></span>&#33521;&#26126;&#30340;&#20154;&#65307;&#20182;&#20204;&#21482;&#26159;&#22312;&#31561;&#24453;&#27491;&#30830;&#30340;&#35825;&#39285;&#12290;&#21487;&#20197;&#32943;&#23450;&#22320;&#26159;&#20844;&#24320;&#35752;&#35770;&#27604;&#31169;&#19979;&#35752;&#35770;&#20250;&#20445;&#25345;&#26356;&#38271;&#30340;&#26102;&#38388;&#65292;&#20063;&#33021;&#24471;&#21040;&#26356;&#22810;&#30340;&#20135;&#20986;&#65292;&#33457;&#36153;&#39069;&#22806;&#30340;&#26102;&#38388;&#26159;&#20540;&#24471;&#30340;&#12290;</p><p>&#25105;&#20204;&#19981;&#24517;&#25226;&#38382;&#39064;&#24635;&#32467;&#20026;&#65306;&#8220;&#22242;&#32467;&#23601;&#26159;&#21147;&#37327;&#8221;&#65288;&#25105;&#20204;&#24050;&#32463;&#35265;&#36807;&#35768;&#22810;&#26356;&#25104;&#21151;&#30340;&#22242;&#38431;&#65289;&#65292;&#20294;&#21487;&#20197;&#30830;&#35748;&#30340;&#26159;&#26377;&#19968;&#20123;&#20107;&#24773;&#36866;&#20110;&#22312;&#22242;&#38431;&#20013;&#23436;&#25104;&#12290;&#39318;&#20808;&#26159;&#26377;&#20102;&#22823;&#37327;&#30340;&#23457;&#38405;&#65307;&#20854;&#27425;&#26159;&#24555;&#36895;&#20135;&#29983;&#22823;&#37327;&#30340;&#24819;&#27861;&#12290;&#24819;&#27861;&#30340;&#36136;&#37327;&#30001;&#20854;&#25152;&#38024;&#23545;&#30340;&#24605;&#24819;&#20915;&#23450;&#65292;&#24403;&#28982;&#65292;&#22312;&#20320;&#29992;&#25361;&#25112;&#24615;&#30340;&#38382;&#39064;&#21050;&#28608;&#20182;&#20204;&#20043;&#21069;&#65292;&#20320;&#26080;&#27861;&#21028;&#26029;&#36825;&#20123;&#24605;&#32771;&#32773;&#26159;&#37027;&#31181;&#20154;&#12290;</p><p>&#24403;&#28982;&#65292;&#20063;&#26377;&#35768;&#22810;&#35752;&#35770;&#24517;&#39035;&#22312;&#31169;&#19979;&#36827;&#34892;&#65292;&#36890;&#36807;&#27492;&#20070;&#25105;&#20204;&#20250;&#30475;&#21040;&#36825;&#31181;&#20363;&#23376;&#12290;&#20294;&#26159;&#25105;&#20204;&#26377;&#19968;&#20010;&#25351;&#23548;&#21407;&#21017;<span class="emphasis"><em>&#22914;&#26524;&#27809;&#26377;&#20445;&#25345;&#31192;&#23494;&#30340;&#21407;&#22240;&#65292;&#37027;&#23601;&#20844;&#24320;&#36827;&#34892;&#12290;</em></span></p><p>&#35201;&#24819;&#20351;&#20043;&#21457;&#29983;&#65292;&#25105;&#20204;&#38656;&#35201;&#34892;&#21160;&#12290;&#20165;&#20165;&#20445;&#35777;&#33258;&#24049;&#25152;&#26377;&#30340;&#36890;&#21578;&#20844;&#24320;&#26159;&#19981;&#22815;&#30340;&#12290;&#20320;&#20063;&#38656;&#35201;&#21149;&#35828;&#20854;&#20182;&#20154;&#25918;&#24323;&#19981;&#24517;&#35201;&#30340;&#31169;&#19979;&#35752;&#35770;&#12290;&#22914;&#26524;&#26576;&#20010;&#20154;&#23581;&#35797;&#24320;&#22987;&#27809;&#26377;&#24517;&#35201;&#30340;&#31169;&#19979;&#35752;&#35770;&#65292;&#20320;&#35201;&#20041;&#19981;&#23481;&#36766;&#30340;&#31435;&#21051;&#36827;&#34892;&#24688;&#24403;&#30340;&#20803;&#35752;&#35770;&#12290;&#22312;&#20320;&#23558;&#35752;&#35770;&#25104;&#21151;&#30340;&#24341;&#20837;&#20844;&#24320;&#22330;&#25152;&#20043;&#21069;&#65292;&#19981;&#35201;&#23545;&#21407;&#22987;&#20027;&#39064;&#20570;&#20986;&#20219;&#20309;&#22238;&#22797;&#65292;&#25110;&#32773;&#21435;&#30830;&#23450;&#31169;&#19979;&#36827;&#34892;&#26159;&#21542;&#24517;&#39035;&#12290;&#22914;&#26524;&#20320;&#19968;&#36143;&#22914;&#27492;&#65292;&#20154;&#20204;&#20250;&#24456;&#24555;&#20250;&#24847;&#65292;&#24182;&#24320;&#22987;&#39318;&#36873;&#20844;&#24320;&#35770;&#22363;&#36827;&#34892;&#35752;&#35770;&#12290;</p></div><div class="sect2" title="&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;"><div class="titlepage"><div><div><h3 class="title"><a name="prevent-rudeness"></a>&#38450;&#26080;&#31036;&#20110;&#26410;&#28982;</h3></div></div></div><p>&#20174;&#39033;&#30446;&#30340;&#19968;&#24320;&#22987;&#65292;&#20320;&#23601;&#24212;&#35813;&#20445;&#25345;&#35770;&#22363;&#20013;&#31895;&#40065;&#21644;&#26080;&#31036;&#34892;&#20026;&#30340;&#38646;&#23481;&#24525;&#12290;&#38646;&#23481;&#24525;&#19981;&#26159;&#25351;&#25216;&#26415;&#19978;&#30340;&#23454;&#36136;&#24378;&#21046;&#12290;&#24403;&#26377;&#20154;&#20405;&#29359;&#20854;&#20182;&#29992;&#25143;&#65292;&#20320;&#19981;&#38656;&#35201;&#23558;&#20854;&#20174;&#37038;&#20214;&#21015;&#34920;&#20013;&#21024;&#38500;&#65292;&#25110;&#22240;&#20026;&#20854;&#26080;&#31036;&#30340;&#22238;&#22797;&#32780;&#25910;&#22238;&#20854;&#22238;&#22797;&#26435;&#38480;&#12290; &#65288;&#29702;&#35770;&#19978;&#35762;&#65292;&#21487;&#33021;&#26368;&#32456;&#20320;&#24517;&#39035;&#35785;&#35832;&#36825;&#31867;&#34892;&#21160;&#65292;&#20294;&#24212;&#35813;&#26159;&#20854;&#20182;&#26041;&#27861;&#22833;&#36133;&#20043;&#21518;&#25165;&#37319;&#29992;&#8212;&#36825;&#38656;&#35201;&#28165;&#26224;&#30340;&#34920;&#36848;&#65292;&#32780;&#19981;&#24212;&#35813;&#26159;&#39033;&#30446;&#24320;&#22987;&#30340;&#24773;&#20917;&#12290;&#65289;&#38646;&#23481;&#24525;&#25351;&#30340;&#20165;&#20165;&#26159;&#20915;&#19981;&#28431;&#25481;&#20219;&#20309;&#27492;&#31867;&#22351;&#34892;&#20026;&#12290;&#20363;&#22914;&#65292;&#26377;&#20154;&#21457;&#24067;&#30340;&#25216;&#26415;&#22238;&#22797;&#20013;&#25530;&#26434;&#20102;&#23545;&#26576;&#19968;&#20010;&#39033;&#30446;&#24320;&#21457;&#32773;&#30340;<span class="foreignphrase"><em class="foreignphrase">&#20010;&#20154;&#20559;&#22909;&#30340;</em></span>&#25915;&#20987;&#65292;<span class="emphasis"><em>&#39318;&#20808;</em></span>&#20320;&#24212;&#35813;&#32039;&#24613;&#22238;&#22797;&#26469;&#25351;&#26126;&#36825;&#31181;<span class="foreignphrase"><em class="foreignphrase">&#20010;&#20154;&#20559;&#22909;&#30340;</em></span>&#25915;&#20987;&#65292;&#24182;&#25351;&#20986;&#20316;&#20026;&#25216;&#26415;&#38382;&#39064;&#26412;&#36523;&#65292;&#24212;&#35813;&#21482;&#21253;&#21547;&#25216;&#26415;&#20869;&#23481;&#12290;</p><p>&#19981;&#24184;&#30340;&#26159;&#36825;&#24182;&#19981;&#24456;&#23481;&#26131;&#65292;&#26356;&#26222;&#36941;&#30340;&#26159;&#65292;&#24314;&#35774;&#24615;&#30340;&#35752;&#35770;&#28436;&#21464;&#20026;&#30772;&#22351;&#24615;&#30340;&#35770;&#25112;&#12290;&#20154;&#20204;&#20250;&#22312;&#37038;&#20214;&#37324;&#35848;&#20107;&#24773;&#65292;&#32780;&#27704;&#36828;&#19981;&#20250;&#38754;&#23545;&#38754;&#35848;&#35770;&#12290;&#35752;&#35770;&#30340;&#20027;&#39064;&#21482;&#26159;&#25918;&#22823;&#20102;&#36825;&#31181;&#25928;&#26524;&#65306;&#22312;&#25216;&#26415;&#38382;&#39064;&#20013;&#65292;&#20154;&#20204;&#32463;&#24120;&#24863;&#35273;&#23545;&#22823;&#22810;&#25968;&#38382;&#39064;&#26377;&#19968;&#20010;&#21807;&#19968;&#30340;&#31572;&#26696;&#65292;&#32780;&#23545;&#27492;&#31572;&#26696;&#30340;&#24322;&#35758;&#21482;&#33021;&#34987;&#35299;&#37322;&#20026;&#26080;&#30693;&#25110;&#24858;&#34850;&#12290;&#26576;&#20154;&#25216;&#26415;&#25552;&#35758;&#30340;&#24858;&#34850;&#19982;&#26576;&#20154;&#26412;&#36523;&#30340;&#24858;&#34850;&#19981;&#31639;&#22826;&#36828;&#12290;&#23454;&#38469;&#19978;&#65292;&#26377;&#26102;&#20505;&#24456;&#38590;&#35828;&#20986;&#25216;&#26415;&#20105;&#35770;&#21644;&#20154;&#36523;&#25915;&#20987;&#20174;&#21738;&#37324;&#24320;&#22987;&#65292;&#36825;&#20063;&#26159;&#28608;&#28872;&#22238;&#22797;&#25110;&#24809;&#32602;&#19981;&#26159;&#22909;&#20027;&#24847;&#30340;&#19968;&#20010;&#21407;&#22240;&#12290;&#30456;&#21453;&#65292;&#24403;&#20320;&#21457;&#29616;&#27492;&#31867;&#20107;&#20214;&#21457;&#29983;&#65292;&#20320;&#24212;&#24403;&#22238;&#22797;&#26469;&#24378;&#35843;&#20445;&#25345;&#21451;&#21892;&#35752;&#35770;&#30340;&#37325;&#35201;&#24615;&#65292;&#32780;&#19981;&#35201;&#25351;&#36131;&#20219;&#20309;&#20154;&#26159;&#25925;&#24847;&#20026;&#23475;&#12290;&#21487;&#24796;&#36825;&#31181;&#8220;&#36719;&#35268;&#21017;&#8221;&#22238;&#22797;&#26377;&#28857;&#20687;&#24188;&#20799;&#22253;&#32769;&#24072;&#25945;&#23548;&#23398;&#29983;&#23398;&#20064;&#22909;&#30340;&#34892;&#20026;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#39318;&#20808;&#65292;&#35831;&#20943;&#23569;&#24102;&#26377;&#20010;&#20154;&#20542;&#21521;&#30340;&#22238;&#22797;&#65307;&#20363;&#22914;&#65292;&#31216;J&#30340;&#23433;&#20840;&#23618;&#35774;&#35745;&#23545;&#8220;&#35745;&#31639;&#26426;&#23433;&#20840;&#22522;&#26412;&#21407;&#29702;&#30340;&#24188;&#31258;&#21644;&#26080;&#30693;&#8221;&#12290;&#36825;&#26679;&#35828;&#23545;&#38169;&#37117;&#26377;&#21487;&#33021;&#65292;&#20294;&#26159;&#26080;&#35770;&#20309;&#31181;&#24773;&#20917;&#65292;&#25105;&#20204;&#37117;&#26080;&#27861;&#36827;&#34892;&#35752;&#35770;&#12290;J&#30495;&#24515;&#35802;&#24847;&#22320;&#25552;&#20986;&#24847;&#35265;&#12290;&#22914;&#26524;&#23384;&#22312;Bug&#65292;&#35831;&#25351;&#20986;&#26469;&#65292;&#25105;&#20204;&#20250;&#36827;&#34892;&#20462;&#27491;&#24182;&#24471;&#21040;&#26032;&#30340;&#35774;&#35745;&#12290;&#25105;&#30830;&#23450;M&#23545;&#20110;J&#24182;&#26080;&#20154;&#36523;&#25915;&#20987;&#65292;&#20294;&#26159;&#25514;&#36766;&#26159;&#19981;&#21512;&#36866;&#30340;&#65292;&#25105;&#20204;&#20250;&#21162;&#21147;&#20445;&#25345;&#20107;&#21153;&#30340;&#24314;&#35774;&#24615;&#12290;</em></span></p><p><span class="emphasis"><em>&#29616;&#22312;&#65292;&#23545;&#20110;&#36825;&#20010;&#24314;&#35758;&#12290;&#25105;&#35748;&#20026;M&#25152;&#35828;&#30340;&#26159;&#27491;&#30830;&#30340;...</em></span></p></blockquote></div><p>&#22240;&#20026;&#27492;&#22238;&#22797;&#30340;&#19981;&#33258;&#28982;&#65292;&#20250;&#26377;&#26174;&#33879;&#30340;&#25928;&#26524;&#12290;&#22914;&#26524;&#20320;&#23545;&#20110;&#22351;&#30340;&#34892;&#20026;&#20445;&#25345;&#19968;&#36143;&#30340;&#34892;&#21160;&#65292;&#32780;&#19981;&#26159;&#35201;&#27714;&#25915;&#20987;&#26041;&#36827;&#34892;&#36947;&#27465;&#21644;&#25215;&#35748;&#65292;&#36825;&#26679;&#23601;&#35753;&#20154;&#20204;&#21487;&#20197;&#33258;&#30001;&#30340;&#20919;&#38745;&#19979;&#26469;&#65292;&#32780;&#22312;&#19979;&#19968;&#27425;&#33021;&#22815;&#34920;&#29616;&#30340;&#26356;&#26377;&#31036;&#35980;&#19968;&#28857;&#8212;&#20182;&#20204;&#20250;&#30340;&#12290;&#36825;&#26679;&#20570;&#33021;&#25104;&#21151;&#30340;&#35776;&#31373;&#26159;&#19981;&#35201;&#23558;&#20803;&#35752;&#35770;&#20316;&#20026;&#20027;&#39064;&#12290;&#23427;&#24517;&#39035;&#25918;&#22312;&#19968;&#36793;&#65292;&#25104;&#20026;&#22238;&#22797;&#20027;&#35201;&#37096;&#20998;&#30340;&#31616;&#30701;&#24207;&#35328;&#12290;&#36890;&#36807;&#39034;&#20415;&#25552;&#21450;&#25351;&#20986;&#8220;&#25105;&#20204;&#36825;&#37324;&#19981;&#26159;&#36825;&#20040;&#20570;&#30340;&#8221;&#65292;&#28982;&#21518;&#36716;&#31227;&#21040;&#30495;&#27491;&#30340;&#20869;&#23481;&#65292;&#36825;&#26679;&#20320;&#23601;&#32473;&#20102;&#20154;&#20204;&#19968;&#20123;&#21487;&#20197;&#22238;&#22797;&#30340;&#35805;&#39064;&#12290;&#22914;&#26524;&#26377;&#20154;&#25239;&#35758;&#20182;&#20204;&#19981;&#24212;&#35813;&#21463;&#21040;&#20320;&#30340;&#36131;&#38590;&#65292;&#21482;&#38656;&#35201;&#25298;&#32477;&#35752;&#35770;&#36825;&#20010;&#38382;&#39064;&#12290;&#38500;&#20102;&#19981;&#22238;&#22797;&#65288;&#22914;&#26524;&#20320;&#35748;&#20026;&#20182;&#20204;&#21482;&#26159;&#31934;&#21147;&#36807;&#21097;&#65292;&#19981;&#38656;&#35201;&#22238;&#22797;&#65289;&#65292;&#20063;&#21487;&#20197;&#35828;&#20320;&#20026;&#21453;&#24212;&#36807;&#24230;&#32780;&#36947;&#27465;&#65292;&#32780;&#19988;&#22312;&#37038;&#20214;&#20013;&#24456;&#38590;&#24863;&#21040;&#36825;&#31181;&#24494;&#22937;&#20043;&#22788;&#65292;&#28982;&#21518;&#22238;&#21040;&#20027;&#39064;&#12290;&#32477;&#19981;&#22312;&#20219;&#20309;&#26102;&#20505;&#35201;&#27714;&#19968;&#20010;&#20154;&#20026;&#19981;&#21512;&#36866;&#34892;&#20026;&#20316;&#20986;&#25215;&#35748;&#65292;&#26080;&#35770;&#26159;&#20844;&#24320;&#36824;&#26159;&#31169;&#19979;&#30340;&#12290;&#22914;&#26524;&#20182;&#20204;&#36873;&#25321;&#38543;&#33258;&#24049;&#30340;&#24847;&#24895;&#36827;&#34892;&#36947;&#27465;&#65292;&#37027;&#26679;&#24456;&#22909;&#65292;&#20294;&#26159;&#35201;&#27714;&#20182;&#20204;&#37027;&#20040;&#20570;&#21482;&#20250;&#23548;&#33268;&#24616;&#24680;&#12290;</p><p>&#24635;&#20307;&#30446;&#26631;&#26159;&#23558;&#22909;&#30340;&#31036;&#33410;&#35270;&#20026;&#8220;&#22242;&#38431;&#20869;&#8221;&#30340;&#34892;&#20026;&#12290;&#36825;&#21487;&#20197;&#24110;&#21161;&#39033;&#30446;&#65292;&#22240;&#20026;&#24320;&#21457;&#32773;&#20250;&#30001;&#20110;&#35770;&#25112;&#32780;&#27969;&#22833;&#65288;&#21363;&#20351;&#26159;&#20182;&#20204;&#21916;&#29233;&#21644;&#24076;&#26395;&#25552;&#20379;&#25903;&#25345;&#30340;&#39033;&#30446;&#65289;&#12290;&#20320;&#21487;&#33021;&#29978;&#33267;&#19981;&#30693;&#36947;&#20182;&#20204;&#20026;&#20160;&#20040;&#31163;&#24320;&#65307;&#26377;&#20123;&#20154;&#21487;&#33021;&#19968;&#30452;&#28508;&#20239;&#22312;&#37038;&#20214;&#21015;&#34920;&#65292;&#32771;&#34385;&#21040;&#21152;&#20837;&#21040;&#39033;&#30446;&#38656;&#35201;&#30340;&#21402;&#33080;&#30382;&#65292;&#23601;&#20250;&#20915;&#23450;&#25918;&#24323;&#21152;&#20837;&#12290;&#20445;&#25345;&#35770;&#22363;&#30340;&#21451;&#21892;&#26159;&#19968;&#20010;&#38271;&#26399;&#29983;&#23384;&#31574;&#30053;&#65292;&#22312;&#39033;&#30446;&#36824;&#27604;&#36739;&#23567;&#30340;&#26102;&#20505;&#65292;&#36825;&#24456;&#23481;&#26131;&#12290;&#19968;&#26086;&#36825;&#25104;&#20026;&#20102;&#25991;&#21270;&#30340;&#19968;&#37096;&#20998;&#65292;&#20320;&#23601;&#19981;&#26159;&#21807;&#19968;&#25552;&#21319;&#36825;&#31181;&#25991;&#21270;&#30340;&#20154;&#12290;&#25152;&#26377;&#20154;&#20250;&#19968;&#36215;&#32500;&#25252;&#12290;</p></div><div class="sect2" title="&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;"><div class="titlepage"><div><div><h3 class="title"><a name="code-review"></a>&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;</h3></div></div></div><p>&#20419;&#36827;&#24320;&#21457;&#29983;&#20135;&#29575;&#30340;&#19968;&#20010;&#26368;&#22909;&#30340;&#21150;&#27861;&#23601;&#26159;&#35753;&#20154;&#20204;&#20114;&#30456;&#23519;&#30475;&#20195;&#30721;&#12290;&#38656;&#35201;&#19968;&#20123;&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;&#26469;&#36827;&#34892;&#26377;&#25928;&#30340;&#25903;&#25345;&#8212;&#29305;&#21035;&#26159;&#25552;&#20132;&#37038;&#20214;&#24212;&#35813;&#24320;&#21551;&#65307;&#26356;&#22810;&#32454;&#33410;&#35265;<a class="xref" href="vc.html#commit-emails" title="&#25552;&#20132;&#37038;&#20214;">the section called &#8220;&#25552;&#20132;&#37038;&#20214;&#8221;</a>&#12290;&#25552;&#20132;&#37038;&#20214;&#30340;&#20316;&#29992;&#23601;&#26159;&#27599;&#24403;&#26377;&#20154;&#25552;&#20132;&#20102;&#28304;&#20195;&#30721;&#30340;&#20462;&#25913;&#65292;&#23601;&#20250;&#21457;&#36865;&#19968;&#23553;&#21253;&#21547;&#26085;&#24535;&#20449;&#24687;&#21644;&#21464;&#26356;&#24046;&#24322;&#65288;&#35265;<a class="xref" href="vc.html#vc-vocabulary" title="&#29256;&#26412;&#25511;&#21046;&#35789;&#27719;&#34920;">the section called &#8220;&#29256;&#26412;&#25511;&#21046;&#35789;&#27719;&#34920;&#8221;</a>&#30340;<a class="xref" href="vc.html#vc-vocabulary-diff"><em class="firstterm">&#24046;&#24322;&#65288;diff&#65289;</em></a>&#65289;&#30340;&#37038;&#20214;&#12290; <em class="firstterm">&#20195;&#30721;&#35780;&#23457;</em>&#26159;&#22312;&#20195;&#30721;&#26469;&#21040;&#26102;&#23545;&#25552;&#20132;&#37038;&#20214;&#36827;&#34892;&#35780;&#23457;&#65292;&#23547;&#25214;Bug&#21644;&#21487;&#33021;&#30340;&#25913;&#36827;&#30340;&#23454;&#36341;&#12290;<sup>[<a name="idp613" href="#ftn.idp613" class="footnote">11</a>]</sup></p><p>&#20195;&#30721;&#35780;&#23457;&#21516;&#26102;&#28385;&#36275;&#22810;&#20010;&#30446;&#26631;&#12290;&#36825;&#26159;&#24320;&#28304;&#19990;&#30028;&#30340;&#21516;&#32423;&#35780;&#23457;&#20013;&#26368;&#26126;&#26174;&#30340;&#19968;&#20010;&#20363;&#23376;&#65292;&#30452;&#25509;&#20419;&#36827;&#32500;&#25252;&#36719;&#20214;&#30340;&#36136;&#37327;&#12290;&#36719;&#20214;&#30340;&#27599;&#19968;&#20010;Bug&#37117;&#26159;&#25552;&#20132;&#36827;&#26469;&#30340;&#65292;&#32780;&#19988;&#27809;&#26377;&#34987;&#21457;&#29616;&#65307;&#22240;&#27492;&#65292;&#20851;&#27880;&#30340;&#30524;&#30555;&#36234;&#22810;&#65292;&#23558;&#20250;&#24102;&#20837;&#36234;&#23569;&#30340;Bug&#12290;&#20294;&#26159;&#20195;&#30721;&#35780;&#23457;&#20063;&#26377;&#38750;&#30452;&#25509;&#30340;&#30446;&#26631;&#65306;&#23427;&#30830;&#35748;&#20102;&#20154;&#20204;&#25152;&#30495;&#27491;&#20851;&#24515;&#30340;&#19996;&#35199;&#65292;&#22240;&#20026;&#24456;&#26126;&#26174;&#19968;&#20010;&#20154;&#19981;&#20250;&#21435;&#33457;&#26102;&#38388;&#35780;&#23457;&#20182;&#19981;&#20851;&#24515;&#30340;&#21151;&#33021;&#12290;&#24403;&#20154;&#20204;&#30693;&#36947;&#20250;&#26377;&#20154;&#33457;&#26102;&#38388;&#35780;&#20215;&#20182;&#30340;&#24037;&#20316;&#65292;&#20182;&#20204;&#23601;&#20250;&#20542;&#23613;&#20840;&#21147;&#12290;</p><p>&#35780;&#23457;&#24517;&#39035;&#26159;&#20844;&#24320;&#30340;&#12290;&#21363;&#20351;&#26377;&#26102;&#25105;&#19982;&#20854;&#20182;&#24320;&#21457;&#32773;&#22352;&#22312;&#21516;&#19968;&#20010;&#29289;&#29702;&#25151;&#38388;&#65292;&#25105;&#20204;&#20013;&#30340;&#19968;&#20010;&#20570;&#20986;&#20102;&#25552;&#20132;&#65292;&#25105;&#20204;&#20063;&#23613;&#37327;&#19981;&#22312;&#25151;&#38388;&#20013;&#36827;&#34892;&#21475;&#22836;&#35780;&#23457;&#65292;&#32780;&#26159;&#23558;&#20854;&#21457;&#36865;&#21040;&#24320;&#21457;&#37038;&#20214;&#21015;&#34920;&#12290;&#25152;&#26377;&#20154;&#20250;&#20174;&#30475;&#21040;&#21457;&#29983;&#30340;&#35780;&#23457;&#33719;&#30410;&#12290;&#20154;&#20204;&#32039;&#36319;&#30528;&#35780;&#35770;&#65292;&#26377;&#26102;&#20250;&#22312;&#20854;&#20013;&#21457;&#29616;&#29781;&#30133;&#65292;&#21363;&#20351;&#27809;&#26377;&#21457;&#29616;&#65292;&#36825;&#20063;&#20250;&#19968;&#30452;&#25552;&#37266;&#20182;&#20204;&#35780;&#23457;&#26159;&#19968;&#20010;&#39044;&#26399;&#30340;&#65292;&#26377;&#35268;&#24459;&#30340;&#27963;&#21160;&#65292;&#23601;&#20687;&#21047;&#30424;&#23376;&#21644;&#21106;&#33609;&#22378;&#12290;</p><p>&#22312;Subversion&#39033;&#30446;&#65292;&#24320;&#22987;&#26102;&#24182;&#27809;&#26377;&#24314;&#31435;&#26377;&#35268;&#24459;&#30340;&#20195;&#30721;&#35780;&#23457;&#23454;&#36341;&#12290;&#26080;&#27861;&#20445;&#38556;&#25152;&#26377;&#30340;&#25552;&#20132;&#20250;&#24471;&#21040;&#35780;&#23457;&#65292;&#23613;&#31649;&#22914;&#27492;&#65292;&#36824;&#26159;&#20250;&#26377;&#20154;&#22312;&#30475;&#21040;&#24863;&#20852;&#36259;&#30340;&#20195;&#30721;&#22359;&#26102;&#30475;&#19968;&#19979;&#20462;&#25913;&#12290;&#19968;&#20123;&#23567;Bug&#30830;&#23454;&#33021;&#22815;&#65292;&#20063;&#24212;&#35813;&#34987;&#21457;&#29616;&#12290;&#19968;&#20010;&#21483;Greg Stein&#30340;&#24320;&#21457;&#32773;&#65292;&#20174;&#20197;&#21069;&#30340;&#24037;&#20316;&#30693;&#36947;&#20195;&#30721;&#35780;&#23457;&#30340;&#37325;&#35201;&#24615;&#65292;&#20915;&#23450;&#36890;&#36807;&#35780;&#23457;<span class="emphasis"><em>&#27599;&#20010;&#21333;&#29420;&#25552;&#20132;</em></span>&#21040;&#28304;&#20195;&#30721;&#24211;&#30340;&#27599;&#19968;&#34892;&#26469;&#35774;&#31435;&#19968;&#20010;&#33539;&#20363;&#12290;&#27599;&#24403;&#26377;&#20154;&#25552;&#20132;&#65292;&#37038;&#20214;&#21015;&#34920;&#23601;&#20250;&#32039;&#36319;&#30528;&#20986;&#29616;Greg&#30340;&#37038;&#20214;&#65292;&#35299;&#21078;&#36825;&#27425;&#25552;&#20132;&#65292;&#20998;&#26512;&#21487;&#33021;&#30340;&#38382;&#39064;&#65292;&#20598;&#23572;&#36824;&#20250;&#36190;&#25196;&#19968;&#19979;&#32874;&#26126;&#30340;&#20195;&#30721;&#12290;&#24456;&#24555;&#65292;&#20182;&#23601;&#21457;&#29616;&#20102;&#20854;&#20182;&#20154;&#20250;&#30053;&#36807;&#32780;&#19981;&#20250;&#27880;&#24847;&#30340;Bug&#21644;&#38750;&#26368;&#20248;&#30340;&#20195;&#30721;&#23454;&#36341;&#12290;&#26356;&#28145;&#21051;&#30340;&#26159;&#65292;&#20182;&#20174;&#27809;&#26377;&#25265;&#24616;&#20182;&#26159;&#21807;&#19968;&#35780;&#23457;&#25152;&#26377;&#25552;&#20132;&#30340;&#20154;&#65292;&#23613;&#31649;&#36825;&#26679;&#20570;&#21344;&#29992;&#20102;&#20182;&#24456;&#22810;&#26102;&#38388;&#65292;&#20294;&#26159;&#20182;&#30830;&#23454;&#19968;&#26377;&#26426;&#20250;&#23601;&#20250;&#30427;&#36190;&#20195;&#30721;&#35780;&#23457;&#12290;&#19981;&#20037;&#20043;&#21518;&#65292;&#20854;&#20182;&#20154;&#65292;&#21253;&#25324;&#25105;&#20063;&#24320;&#22987;&#20102;&#26377;&#35268;&#24459;&#30340;&#25552;&#20132;&#35780;&#23457;&#12290;&#25105;&#20204;&#30340;&#21160;&#26426;&#26159;&#20160;&#20040;&#65311;&#19981;&#26159;Greg&#26377;&#24847;&#35782;&#30340;&#35753;&#25105;&#20204;&#20026;&#27492;&#24863;&#21040;&#32670;&#24871;&#12290;&#32780;&#26159;&#20182;&#24050;&#32463;&#35777;&#26126;&#20195;&#30721;&#35780;&#23457;&#26159;&#20540;&#24471;&#33457;&#36153;&#26102;&#38388;&#30340;&#26041;&#27861;&#65292;&#23427;&#30340;&#36129;&#29486;&#19982;&#32534;&#20889;&#26032;&#30340;&#20195;&#30721;&#19981;&#30456;&#19978;&#19979;&#12290;&#19968;&#26086;&#20182;&#35777;&#26126;&#20102;&#36825;&#19968;&#28857;&#65292;&#23427;&#23601;&#25104;&#20026;&#39044;&#26399;&#30340;&#34892;&#20026;&#65292;&#20197;&#33267;&#20110;&#22914;&#26524;&#19968;&#20010;&#25552;&#20132;&#32773;&#21457;&#29616;&#27809;&#26377;&#20154;&#23545;&#20854;&#25552;&#20132;&#26377;&#20219;&#20309;&#21453;&#24212;&#65292;&#20182;&#20250;&#24863;&#21040;&#25285;&#24515;&#65292;&#29978;&#33267;&#20250;&#22312;&#21015;&#34920;&#20013;&#35759;&#38382;&#26159;&#21542;&#26377;&#20154;&#24895;&#24847;&#33457;&#26102;&#38388;&#20026;&#20854;&#35780;&#23457;&#12290;&#19981;&#20037;&#20043;&#21518;&#65292;Greg&#24471;&#21040;&#19968;&#20010;&#24037;&#20316;&#65292;&#20182;&#20063;&#27809;&#26377;&#26356;&#22810;&#26102;&#38388;&#20026;Subversion&#24037;&#20316;&#65292;&#32467;&#26463;&#20102;&#26377;&#35268;&#24459;&#30340;&#35780;&#23457;&#12290;&#20294;&#26159;&#20043;&#21518;&#65292;&#20182;&#30340;&#20064;&#24815;&#28145;&#28145;&#24433;&#21709;&#20102;&#25105;&#20204;&#65292;&#20284;&#20046;&#36825;&#26679;&#20570;&#26159;&#22825;&#32463;&#22320;&#20041;&#30340;&#12290;</p><p>&#20174;&#31532;&#19968;&#20010;&#25552;&#20132;&#23601;&#24320;&#22987;&#35780;&#23457;&#12290;&#24046;&#24322;&#35780;&#23457;&#20013;&#26368;&#23481;&#26131;&#26816;&#26597;&#20986;&#26469;&#30340;&#38382;&#39064;&#21253;&#25324;&#23433;&#20840;&#28431;&#27934;&#12289;&#20869;&#23384;&#27844;&#38706;&#12289;&#27880;&#37322;&#19981;&#36275;&#25110;API&#25991;&#26723;&#38382;&#39064;&#12289;&#20301;&#20559;&#31227;&#38169;&#35823;&#12289;&#35843;&#29992;/&#34987;&#35843;&#29992;&#19981;&#21305;&#37197;&#20197;&#21450;&#20854;&#20182;&#22312;&#36739;&#23567;&#30340;&#19978;&#19979;&#25991;&#23601;&#33021;&#21457;&#29616;&#30340;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#21363;&#20351;&#36825;&#31867;&#26410;&#33021;&#23558;&#37325;&#22797;&#30340;&#27169;&#24335;&#25277;&#35937;&#21040;&#19968;&#22788;&#30340;&#36739;&#22823;&#35268;&#27169;&#38382;&#39064;&#65292;&#22312;&#32463;&#36807;&#26377;&#35268;&#24459;&#30340;&#35780;&#23457;&#21518;&#20063;&#21487;&#20197;&#34987;&#23450;&#20301;&#20986;&#26469;&#65292;&#22240;&#20026;&#23545;&#20197;&#21069;&#24046;&#24322;&#30340;&#35760;&#24518;&#25552;&#37266;&#20102;&#23545;&#24403;&#21069;&#24046;&#24322;&#30340;&#35780;&#23457;&#12290;</p><p>&#19981;&#35201;&#25285;&#24515;&#20320;&#26410;&#33021;&#21457;&#29616;&#20219;&#20309;&#38656;&#35201;&#22238;&#22797;&#30340;&#20869;&#23481;&#65292;&#25110;&#32773;&#20320;&#19981;&#26159;&#24456;&#28165;&#26970;&#20195;&#30721;&#30340;&#27599;&#20010;&#37096;&#20998;&#12290;&#36890;&#24120;&#20960;&#20046;&#27599;&#19968;&#27425;&#25552;&#20132;&#37117;&#20250;&#35201;&#35828;&#20160;&#20040;&#20107;&#24773;&#65307;&#21363;&#20351;&#20320;&#27809;&#26377;&#21457;&#29616;&#20219;&#20309;&#20107;&#24773;&#21487;&#20197;&#25552;&#38382;&#65292;&#20320;&#36824;&#26159;&#21487;&#33021;&#21457;&#29616;&#19968;&#20123;&#20107;&#24773;&#21487;&#20197;&#23545;&#20854;&#31216;&#36190;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#35753;&#27599;&#20010;&#25552;&#20132;&#32773;&#28165;&#26970;&#65292;&#20182;&#20204;&#25152;&#20570;&#30340;&#20107;&#24773;&#37117;&#27491;&#22312;&#34987;&#20851;&#27880;&#21644;&#29702;&#35299;&#12290;&#24403;&#28982;&#65292;&#20195;&#30721;&#35780;&#23457;&#19981;&#33021;&#35753;&#31243;&#24207;&#21592;&#36867;&#33073;&#22312;&#25552;&#20132;&#20043;&#21069;&#35780;&#23457;&#21644;&#27979;&#35797;&#20182;&#20204;&#25152;&#20570;&#21464;&#26356;&#30340;&#36131;&#20219;&#65307;&#20154;&#20204;&#19981;&#24212;&#35813;&#20381;&#38752;&#20195;&#30721;&#35780;&#23457;&#26469;&#25429;&#25417;&#26412;&#24212;&#35813;&#20182;&#33258;&#24049;&#25429;&#25417;&#30340;&#38382;&#39064;&#12290;</p></div><div class="sect2" title="&#23558;&#19968;&#20010;&#23553;&#38381;&#39033;&#30446;&#24320;&#25918;&#26102;&#65292;&#23545;&#20110;&#25913;&#21464;&#30340;&#24433;&#21709;&#35201;&#26684;&#22806;&#25935;&#24863;"><div class="titlepage"><div><div><h3 class="title"><a name="opening-closed-projects"></a>&#23558;&#19968;&#20010;&#23553;&#38381;&#39033;&#30446;&#24320;&#25918;&#26102;&#65292;&#23545;&#20110;&#25913;&#21464;&#30340;&#24433;&#21709;&#35201;&#26684;&#22806;&#25935;&#24863;</h3></div></div></div><p>&#22914;&#26524;&#20320;&#24320;&#25918;&#19968;&#20010;&#24050;&#23384;&#22312;&#30340;&#39033;&#30446;&#65292;&#20854;&#20013;&#24050;&#32463;&#26377;&#20102;&#35768;&#22810;&#20064;&#24815;&#20110;&#22312;&#23553;&#38381;&#28304;&#20195;&#30721;&#29615;&#22659;&#19979;&#24037;&#20316;&#30340;&#27963;&#36291;&#24320;&#21457;&#32773;&#65292;&#20320;&#24517;&#39035;&#30830;&#20445;&#27599;&#20010;&#20154;&#29702;&#35299;&#27491;&#35201;&#21457;&#29983;&#30340;&#37325;&#22823;&#21464;&#21270;&#8212;&#20320;&#24517;&#39035;&#35774;&#36523;&#22788;&#22320;&#30340;&#20026;&#20182;&#20204;&#30528;&#24819;&#12290;</p><p>&#24819;&#35937;&#19968;&#19979;&#20182;&#20204;&#38754;&#23545;&#30340;&#24773;&#24418;&#65306;&#20197;&#21069;&#65292;&#25152;&#26377;&#30340;&#20195;&#30721;&#21644;&#35774;&#35745;&#20915;&#23450;&#37117;&#26159;&#30001;&#19968;&#32452;&#31243;&#24207;&#21592;&#20570;&#20986;&#65292;&#20182;&#20204;&#23545;&#36719;&#20214;&#26377;&#24046;&#19981;&#22810;&#30456;&#31561;&#30340;&#29087;&#24713;&#31243;&#24230;&#65292;&#32780;&#19988;&#37117;&#26159;&#20174;&#21516;&#19968;&#20010;&#31649;&#29702;&#20013;&#25509;&#21463;&#30456;&#21516;&#30340;&#21387;&#21147;&#65292;&#32780;&#19988;&#28165;&#26970;&#20854;&#20182;&#20154;&#30340;&#38271;&#22788;&#21644;&#24369;&#28857;&#12290;&#29616;&#22312;&#20320;&#35753;&#20182;&#20204;&#23558;&#20195;&#30721;&#26292;&#38706;&#32473;&#38543;&#26426;&#30340;&#38476;&#29983;&#20154;&#30417;&#35270;&#65292;&#32780;&#20182;&#20204;&#21482;&#20250;&#26681;&#25454;&#20195;&#30721;&#24418;&#25104;&#21028;&#26029;&#65292;&#32780;&#19981;&#20250;&#32771;&#34385;&#36896;&#25104;&#36825;&#31181;&#20915;&#23450;&#30340;&#21830;&#19994;&#21387;&#21147;&#12290;&#36825;&#20123;&#38476;&#29983;&#20154;&#20250;&#35810;&#38382;&#24456;&#22810;&#38382;&#39064;&#65292;&#36825;&#20123;&#38382;&#39064;&#35753;&#24050;&#26377;&#30340;&#24320;&#21457;&#32773;&#21457;&#29616;&#26080;&#35770;&#22914;&#20309;&#20026;&#25991;&#26723;&#33510;&#24178;&#65292;<span class="emphasis"><em>&#20173;&#28982;</em></span>&#19981;&#36275;&#65288;&#19981;&#21487;&#36991;&#20813;&#30340;&#65289;&#12290;&#26368;&#20851;&#38190;&#30340;&#26159;&#65292;&#36825;&#20123;&#26032;&#26469;&#32773;&#26159;&#26410;&#30693;&#30340;&#65292;&#26410;&#38706;&#38754;&#30340;&#23454;&#20307;&#12290;&#22914;&#26524;&#20320;&#30340;&#19968;&#20010;&#24320;&#21457;&#32773;&#24050;&#32463;&#24863;&#35273;&#21040;&#20182;&#30340;&#25216;&#33402;&#19981;&#22815;&#23433;&#20840;&#65292;&#24819;&#24819;&#19968;&#19979;&#24403;&#26032;&#26469;&#32773;&#25351;&#20986;&#20182;&#25152;&#20889;&#20195;&#30721;&#30340;Bug&#26102;&#30340;&#20005;&#37325;&#24615;&#65292;&#26356;&#20005;&#37325;&#30340;&#65292;&#22312;&#20182;&#30340;&#21516;&#20107;&#38754;&#21069;&#12290;&#38500;&#38750;&#20320;&#26377;&#19968;&#20010;&#25317;&#26377;&#23436;&#32654;&#32534;&#30721;&#21592;&#30340;&#22242;&#38431;&#65292;&#36825;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#8212;&#23454;&#38469;&#19978;&#65292;&#23545;&#20110;&#27599;&#19968;&#20010;&#20154;&#24320;&#22987;&#37117;&#20250;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#12290;&#36825;&#19981;&#26159;&#22240;&#20026;&#20182;&#20204;&#19981;&#26159;&#22909;&#31243;&#24207;&#21592;&#65307;&#21482;&#26159;&#22240;&#20026;&#20219;&#20309;&#36229;&#36807;&#19968;&#23450;&#35268;&#27169;&#30340;&#31243;&#24207;&#37117;&#20250;&#26377;Bug&#65292;&#32780;&#21516;&#32423;&#35780;&#23457;&#21487;&#20197;&#21457;&#29616;&#19968;&#20123;&#27492;&#31867;Bug&#65288;<span>&#35265;&#26412;&#31456;&#21069;&#38754;&#30340;</span><a class="xref" href="setting-tone.html#code-review" title="&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;">the section called &#8220;&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;&#8221;</a>&#65289;&#12290;&#32780;&#27492;&#26102;&#65292;&#26032;&#26469;&#32773;&#24320;&#22987;&#26412;&#36523;&#24182;&#27809;&#26377;&#21463;&#21040;&#21516;&#32423;&#35780;&#23457;&#30340;&#25903;&#37197;&#65292;&#22240;&#27492;&#20182;&#20204;&#22312;&#29087;&#24713;&#39033;&#30446;&#20043;&#21069;&#19981;&#33021;&#36129;&#29486;&#20195;&#30721;&#12290;&#23545;&#20320;&#30340;&#24320;&#21457;&#32773;&#65292;&#24863;&#35273;&#25351;&#36131;&#27491;&#22312;&#21040;&#26469;&#65292;&#32477;&#19981;&#20250;&#31163;&#24320;&#12290;&#22240;&#27492;&#65292;&#35201;&#23567;&#24515;&#36825;&#20123;&#32769;&#25163;&#30340;&#20154;&#24515;&#25955;&#20102;&#12290;</p><p>&#38450;&#27490;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#30340;&#26368;&#20339;&#26041;&#27861;&#26159;&#35686;&#21578;&#27599;&#20010;&#20154;&#21363;&#23558;&#21457;&#29983;&#30340;&#24773;&#20917;&#65292;&#21578;&#35785;&#20182;&#20204;&#24320;&#22987;&#30340;&#19981;&#36866;&#26159;&#23436;&#20840;&#27491;&#24120;&#30340;&#65292;&#40723;&#21169;&#20182;&#20204;&#19968;&#20999;&#37117;&#20250;&#22909;&#36215;&#26469;&#30340;&#12290;&#26377;&#19968;&#20123;&#35686;&#21578;&#24212;&#35813;&#22312;&#31169;&#19979;&#21457;&#29983;&#65292;&#22312;&#39033;&#30446;&#24320;&#25918;&#20197;&#21069;&#12290;&#20294;&#26159;&#20320;&#20063;&#20250;&#21457;&#29616;&#22914;&#26524;&#22312;&#20844;&#20849;&#21015;&#34920;&#20013;&#25552;&#37266;&#20154;&#20204;&#20250;&#26377;&#22909;&#22788;&#65292;&#21578;&#35785;&#20182;&#20204;&#36825;&#26159;&#39033;&#30446;&#24320;&#21457;&#30340;&#26032;&#26041;&#24335;&#65292;&#38656;&#35201;&#19968;&#27573;&#26102;&#38388;&#26469;&#35843;&#25972;&#12290;&#20320;&#33021;&#20570;&#30340;&#26368;&#22909;&#30340;&#20107;&#24773;&#26159;&#36890;&#36807;&#23454;&#20363;&#36827;&#34892;&#24341;&#23548;&#12290;&#22914;&#26524;&#20320;&#30475;&#21040;&#20320;&#30340;&#24320;&#21457;&#32773;&#26080;&#27861;&#22238;&#31572;&#36275;&#22815;&#22810;&#30340;&#26032;&#25163;&#38382;&#39064;&#65292;&#37027;&#20040;&#21482;&#35201;&#21578;&#35785;&#20182;&#20204;&#22238;&#31572;&#26356;&#22810;&#20063;&#20110;&#20107;&#26080;&#34917;&#12290;&#20063;&#35768;&#20182;&#20204;&#23545;&#20110;&#20309;&#31181;&#38382;&#39064;&#38656;&#35201;&#20445;&#35777;&#22238;&#22797;&#27809;&#26377;&#22826;&#22909;&#30340;&#24863;&#35273;&#65292;&#25110;&#32773;&#20182;&#20204;&#23545;&#20110;&#22914;&#20309;&#25490;&#23450;&#20195;&#30721;&#24037;&#20316;&#21644;&#26032;&#30340;&#22806;&#37096;&#27807;&#36890;&#20132;&#27969;&#36127;&#25285;&#30340;&#20248;&#20808;&#32423;&#27809;&#26377;&#24863;&#35273;&#12290;&#35753;&#23427;&#20204;&#21442;&#19982;&#36827;&#26469;&#30340;&#26041;&#27861;&#26159;&#20320;&#33258;&#24049;&#21442;&#19982;&#36827;&#21435;&#12290;&#20316;&#20026;&#19968;&#20010;&#20844;&#24320;&#37038;&#20214;&#21015;&#34920;&#65292;&#30830;&#20445;&#22312;&#37027;&#37324;&#22238;&#31572;&#19968;&#20123;&#38382;&#39064;&#12290;&#24403;&#20320;&#27809;&#26377;&#22238;&#31572;&#26576;&#20010;&#38382;&#39064;&#30340;&#25216;&#33021;&#26102;&#65292;&#35201;&#26126;&#30830;&#30340;&#20132;&#32473;&#33021;&#20570;&#30340;&#24320;&#21457;&#32773;&#8212;&#28982;&#21518;&#35266;&#23519;&#30830;&#20445;&#26377;&#22238;&#31572;&#25110;&#33267;&#23569;&#26159;&#19968;&#20010;&#22238;&#24212;&#12290;&#24403;&#28982;&#29616;&#22312;&#36824;&#26159;&#26377;&#38271;&#26399;&#24320;&#21457;&#32773;&#36827;&#34892;&#31169;&#19979;&#35752;&#35770;&#30340;&#35825;&#24785;&#65292;&#22240;&#20026;&#20182;&#20204;&#19968;&#36143;&#22914;&#27492;&#12290;&#35831;&#30830;&#23450;&#20320;&#24050;&#32463;&#35746;&#38405;&#20102;&#21487;&#33021;&#21457;&#29983;&#38382;&#39064;&#30340;&#20869;&#37096;&#37038;&#20214;&#21015;&#34920;&#65292;&#24182;&#19988;&#21578;&#30693;&#20182;&#20204;&#27492;&#31867;&#35752;&#35770;&#24212;&#35813;&#31435;&#21051;&#20844;&#24320;&#12290;</p><p>&#23545;&#20110;&#24320;&#25918;&#30340;&#23553;&#38381;&#39033;&#30446;&#65292;&#36824;&#26377;&#19968;&#20123;&#20854;&#23427;&#30340;&#38271;&#26399;&#20851;&#27880;&#12290;<a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#25506;&#32034;&#20102;&#28151;&#21512;&#20184;&#36153;&#21644;&#26410;&#20184;&#36153;&#24320;&#21457;&#32773;&#30340;&#25216;&#24039;&#65292;<a class="xref" href="legal.html" title="Chapter 9. &#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;">Chapter 9, <i>&#35768;&#21487;&#35777;&#65292;&#29256;&#26435;&#21644;&#19987;&#21033;</i></a>&#35752;&#35770;&#20102;&#24403;&#20844;&#24320;&#30340;&#31169;&#26377;&#20195;&#30721;&#22522;&#21253;&#21547;&#20854;&#23427;&#32452;&#32455;&#32534;&#20889;&#25110;&#8220;&#25317;&#26377;&#30340;&#8221;&#36719;&#20214;&#26102;&#25152;&#24517;&#39035;&#25215;&#25285;&#30340;&#27861;&#24459;&#20041;&#21153;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp585" href="#idp585" class="para">10</a>] </sup>&#25105;&#20204;&#36825;&#37324;&#19981;&#26159;&#20026;&#20102;&#36824;&#20538;&#65292;&#32780;&#26159;&#23454;&#36341;&#25105;&#21069;&#38754;&#35762;&#30340;&#35828;&#25945;&#65306;&#36825;&#20301;&#35266;&#23519;&#32773;&#30340;&#21517;&#23383;&#26159;Brian Behlendorf&#65292;&#20182;&#25351;&#20986;&#20102;&#38500;&#38544;&#31169;&#21407;&#22240;&#20197;&#22806;&#65292;&#20445;&#25345;&#25152;&#26377;&#35752;&#35770;&#20844;&#24320;&#30340;&#26222;&#36941;&#37325;&#35201;&#24615;&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp613" href="#idp613" class="para">11</a>] </sup>&#26080;&#35770;&#22914;&#20309;&#65292;&#36825;&#26159;&#24320;&#28304;&#39033;&#30446;&#24120;&#35265;&#30340;&#20570;&#27861;&#12290;&#22312;&#26356;&#38598;&#20013;&#24335;&#30340;&#39033;&#30446;&#20013;&#65292;&#8220;&#20195;&#30721;&#35780;&#23457;&#8221;&#20063;&#20063;&#24847;&#21619;&#30528;&#35768;&#22810;&#20154;&#22352;&#22312;&#19968;&#36215;&#65292;&#19968;&#36215;&#23519;&#30475;&#25171;&#21360;&#30340;&#28304;&#20195;&#30721;&#65292;&#23547;&#25214;&#29305;&#23450;&#30340;&#38382;&#39064;&#21644;&#27169;&#24335;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="license-quickstart.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="announcing.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36873;&#25321;&#35768;&#21487;&#35777;&#24182;&#24212;&#29992; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#36890;&#21578;</td></tr></table></div></body></html>
