<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><link rel="prev" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><link rel="next" href="transitions.html" title="&#36716;&#21270;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="managing-volunteers.html">Prev</a> </td><th width="60%" align="center">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</th><td width="20%" align="right"> <a accesskey="n" href="transitions.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="share-management"></a>&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;</h2></div></div></div><p>&#36816;&#34892;&#39033;&#30446;&#26102;&#35201;&#20687;&#20998;&#25285;&#25216;&#26415;&#36127;&#25285;&#37027;&#26679;&#20998;&#25285;&#31649;&#29702;&#36127;&#25285;&#12290;&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#65292;&#23601;&#20250;&#26377;&#26356;&#22810;&#20851;&#20110;&#31649;&#29702;&#20154;&#21592;&#21644;&#20449;&#24687;&#27969;&#31243;&#30340;&#24037;&#20316;&#12290;&#27809;&#26377;&#36947;&#29702;&#19981;&#20998;&#25285;&#36825;&#20123;&#36127;&#25285;&#65292;&#36825;&#24182;&#19981;&#19968;&#23450;&#38656;&#35201;&#19968;&#31181;&#33258;&#39030;&#21521;&#19979;&#30340;&#38454;&#32423;&#32452;&#32455;&#8212;&#23454;&#36341;&#20013;&#26356;&#22810;&#26159;&#21516;&#32423;&#30340;&#32593;&#32476;&#25299;&#25169;&#32467;&#26500;&#65292;&#32780;&#19981;&#26159;&#20891;&#38431;&#24335;&#30340;&#21629;&#20196;&#32467;&#26500;&#12290;</p><p>&#26377;&#26102;&#31649;&#29702;&#35282;&#33394;&#26159;&#27491;&#24335;&#30340;&#65292;&#26377;&#26102;&#21017;&#26159;&#33258;&#28982;&#21457;&#29983;&#30340;&#12290;&#22312;Subversion&#39033;&#30446;&#20013;&#65292;&#25105;&#20204;&#26377;&#19968;&#20010;&#34917;&#19969;&#31649;&#29702;&#21592;&#65292;&#19968;&#20010;&#32763;&#35793;&#31649;&#29702;&#21592;&#65292;&#25991;&#26723;&#31649;&#29702;&#21592;&#21644;&#38382;&#39064;&#31649;&#29702;&#21592;&#65288;&#23613;&#31649;&#26159;&#38750;&#27491;&#24335;&#30340;&#65289;&#20197;&#21450;&#19968;&#20010;&#21457;&#24067;&#31649;&#29702;&#21592;&#12290;&#26377;&#26102;&#36825;&#20123;&#35282;&#33394;&#26159;&#32463;&#36807;&#35748;&#30495;&#32771;&#34385;&#25165;&#24320;&#22987;&#30340;&#65292;&#32780;&#26377;&#20123;&#21017;&#23436;&#20840;&#26159;&#33258;&#21457;&#30340;&#65307;&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#65292;&#25105;&#30456;&#20449;&#20250;&#22686;&#21152;&#26356;&#22810;&#30340;&#35282;&#33394;&#12290;&#19979;&#38754;&#25105;&#20204;&#20250;&#35814;&#32454;&#23457;&#35270;&#36825;&#20123;&#35282;&#33394;&#65292;&#20197;&#21450;&#19968;&#20123;&#20854;&#20182;&#30340;&#35282;&#33394;&#65288;&#38500;&#20102;<span>&#22312;&#26412;&#31456;&#21069;&#38754;</span>&#30340;<a class="xref" href="stabilizing-a-release.html#release-manager" title="&#21457;&#24067;&#32463;&#29702;">the section called &#8220;&#21457;&#24067;&#32463;&#29702;&#8221;</a>&#21644;<a class="xref" href="stabilizing-a-release.html#release-owner" title="&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;">the section called &#8220;&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;&#8221;</a>&#20013;&#20171;&#32461;&#30340;&#21457;&#24067;&#31649;&#29702;&#21592;&#65289;&#12290;</p><p>&#23601;&#20687;&#20320;&#30475;&#21040;&#30340;&#35282;&#33394;&#25551;&#36848;&#65292;&#35831;&#27880;&#24847;&#27809;&#26377;&#20154;&#29420;&#21344;&#25511;&#21046;&#20854;&#25152;&#22312;&#39046;&#22495;&#12290;&#38382;&#39064;&#31649;&#29702;&#21592;&#24182;&#27809;&#26377;&#38450;&#27490;&#20854;&#20182;&#20154;&#22312;&#38382;&#39064;&#25968;&#25454;&#24211;&#20013;&#20570;&#20986;&#20462;&#25913;&#65292;FAQ&#31649;&#29702;&#21592;&#20063;&#19981;&#24517;&#26159;&#32534;&#36753;FAQ&#30340;&#21807;&#19968;&#20154;&#36873;&#12290;&#20182;&#20204;&#30340;&#35282;&#33394;&#37117;&#26159;&#38750;&#22404;&#26029;&#30340;&#36131;&#20219;&#12290;&#27599;&#20010;&#39046;&#22495;&#31649;&#29702;&#21592;&#25152;&#20316;&#24037;&#20316;&#30340;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#26159;&#25552;&#37266;&#22312;&#35813;&#39046;&#22495;&#24037;&#20316;&#30340;&#20154;&#65292;&#35757;&#32451;&#20182;&#20204;&#25353;&#29031;&#31649;&#29702;&#21592;&#30340;&#26041;&#24335;&#24037;&#20316;&#65292;&#36825;&#26679;&#22810;&#31181;&#21147;&#37327;&#23601;&#21487;&#20197;&#20114;&#30456;&#21152;&#24378;&#65292;&#32780;&#19981;&#26159;&#21457;&#29983;&#20914;&#31361;&#12290;&#39046;&#22495;&#31649;&#29702;&#21592;&#24517;&#39035;&#35760;&#24405;&#20182;&#20204;&#24037;&#20316;&#30340;&#36807;&#31243;&#65292;&#36825;&#26679;&#24403;&#20182;&#20204;&#31163;&#24320;&#26102;&#65292;&#21035;&#20154;&#23601;&#21487;&#20197;&#31435;&#21051;&#25509;&#29677;&#12290;</p><p>&#26377;&#26102;&#20250;&#21457;&#29983;&#19968;&#31181;&#20914;&#31361;&#65306;&#20004;&#20010;&#25110;&#26356;&#22810;&#30340;&#20154;&#24076;&#26395;&#21516;&#19968;&#20010;&#35282;&#33394;&#12290;&#29616;&#22312;&#27809;&#26377;&#20154;&#22788;&#29702;&#36825;&#20214;&#20107;&#12290;&#20320;&#21487;&#20197;&#24314;&#35758;&#27599;&#20010;&#24535;&#24895;&#32773;&#20889;&#19968;&#20010;&#35745;&#21010;&#65288;&#19968;&#20010;&#8220;&#30003;&#35831;&#8221;&#65289;&#65292;&#35753;&#25152;&#26377;&#30340;&#25552;&#20132;&#32773;&#36873;&#20986;&#26368;&#20339;&#12290;&#19981;&#36807;&#36825;&#26679;&#26377;&#20123;&#31528;&#25305;&#65292;&#32780;&#19988;&#21487;&#33021;&#26377;&#20123;&#23604;&#23596;&#12290;&#25105;&#21457;&#29616;&#26368;&#22909;&#30340;&#26041;&#27861;&#21482;&#26159;&#21578;&#35785;&#22810;&#20010;&#20505;&#36873;&#32773;&#33258;&#24049;&#22788;&#29702;&#12290;&#20182;&#20204;&#36890;&#24120;&#33021;&#22815;&#65292;&#20063;&#20250;&#26356;&#28385;&#24847;&#33258;&#24049;&#24471;&#20986;&#30340;&#32467;&#26524;&#65292;&#32780;&#19981;&#26159;&#21035;&#20154;&#26045;&#21152;&#30340;&#32467;&#26524;&#12290;</p><div class="sect2" title="&#34917;&#19969;&#31649;&#29702;&#21592;"><div class="titlepage"><div><div><h3 class="title"><a name="patch-manager"></a>&#34917;&#19969;&#31649;&#29702;&#21592;</h3></div></div></div><p>&#22312;&#19968;&#20010;&#25509;&#25910;&#35768;&#22810;&#34917;&#19969;&#30340;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#65292;&#36319;&#36394;&#21040;&#36798;&#30340;&#34917;&#19969;&#20197;&#21450;&#25152;&#20570;&#30340;&#20915;&#23450;&#20250;&#25104;&#20026;&#19968;&#22330;&#22121;&#26790;&#65292;&#29305;&#21035;&#24403;&#36890;&#36807;&#38750;&#38598;&#20013;&#26041;&#24335;&#23436;&#25104;&#26102;&#12290;&#22823;&#22810;&#25968;&#34917;&#19969;&#26159;&#20197;&#37038;&#20214;&#30340;&#24418;&#24335;&#20986;&#29616;&#22312;&#39033;&#30446;&#24320;&#21457;&#21015;&#34920;&#65288;&#23613;&#31649;&#21487;&#33021;&#26377;&#20123;&#26368;&#26089;&#20986;&#29616;&#22312;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#65292;&#25110;&#22806;&#37096;&#31449;&#28857;&#65289;&#30340;&#65292;&#22312;&#34917;&#19969;&#21040;&#36798;&#26102;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#22788;&#29702;&#34917;&#19969;&#30340;&#20363;&#31243;&#21487;&#20197;&#36873;&#25321;&#12290;</p><p>&#26377;&#26102;&#65292;&#26576;&#20154;&#35780;&#23457;&#20102;&#34917;&#19969;&#65292;&#21457;&#29616;&#20102;&#38382;&#39064;&#65292;&#28982;&#21518;&#36386;&#22238;&#32473;&#21407;&#20316;&#32773;&#25972;&#29702;&#12290;&#36825;&#36890;&#24120;&#20250;&#23548;&#33268;&#19968;&#20010;&#20132;&#20114;&#36807;&#31243;&#8212;&#37117;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#21487;&#35265;&#8212;&#21407;&#22987;&#30340;&#20316;&#32773;&#19968;&#30452;&#21457;&#24067;&#20462;&#27491;&#30340;&#34917;&#19969;&#29256;&#26412;&#65292;&#30452;&#21040;&#35780;&#23457;&#32773;&#26080;&#27861;&#25214;&#21040;&#26356;&#22810;&#30340;&#38382;&#39064;&#12290;&#26377;&#26102;&#24456;&#38590;&#35828;&#28165;&#26970;&#36825;&#20010;&#36807;&#31243;&#24050;&#32463;&#32467;&#26463;&#65306;&#22914;&#26524;&#35780;&#23457;&#32773;&#25552;&#20132;&#20102;&#34917;&#19969;&#65292;&#21017;&#21487;&#20197;&#35828;&#25972;&#20010;&#21608;&#26399;&#24050;&#32463;&#32467;&#26463;&#12290;&#20294;&#26159;&#22914;&#26524;&#22905;&#27809;&#26377;&#65292;&#25110;&#35768;&#20165;&#20165;&#22240;&#20026;&#22905;&#27809;&#26377;&#26102;&#38388;&#65292;&#25110;&#32773;&#27809;&#26377;&#25552;&#20132;&#26435;&#38480;&#65292;&#32780;&#19988;&#26080;&#27861;&#25289;&#20854;&#20182;&#24320;&#21457;&#32773;&#20570;&#36825;&#20214;&#20107;&#12290;</p><p>&#21478;&#19968;&#20010;&#23545;&#34917;&#19969;&#30340;&#24120;&#35265;&#22238;&#24212;&#26159;&#36731;&#24555;&#30340;&#35752;&#35770;&#65292;&#19981;&#24517;&#26159;&#38024;&#23545;&#34917;&#19969;&#26412;&#36523;&#65292;&#32780;&#26159;&#20851;&#20110;&#34917;&#19969;&#20043;&#21518;&#30340;&#27010;&#24565;&#12290;&#20363;&#22914;&#65292;&#34917;&#19969;&#21487;&#33021;&#20462;&#27491;&#20102;&#19968;&#20010;bug&#65292;&#20294;&#39033;&#30446;&#24076;&#26395;&#29992;&#21478;&#19968;&#31181;&#26041;&#24335;&#20462;&#27491;&#36825;&#20010;bug&#65292;&#20316;&#20026;&#35299;&#20915;&#19968;&#20010;&#26356;&#26222;&#36890;&#31867;&#22411;&#38382;&#39064;&#30340;&#19968;&#37096;&#20998;&#12290;&#36890;&#24120;&#19968;&#24320;&#22987;&#36825;&#37117;&#26159;&#26410;&#30693;&#30340;&#65292;&#21482;&#26159;&#34917;&#19969;&#28608;&#21457;&#20102;&#25506;&#32034;&#12290;</p><p>&#20598;&#28982;&#24773;&#20917;&#19979;&#65292;&#21457;&#24067;&#30340;&#34917;&#19969;&#21487;&#33021;&#20250;&#36935;&#21040;&#23436;&#20840;&#30340;&#27785;&#40664;&#12290;&#36890;&#24120;&#26159;&#22240;&#20026;&#27809;&#26377;&#24320;&#21457;&#32773;&#26377;&#26102;&#38388;<span class="emphasis"><em>&#22312;&#37027;&#20010;&#26102;&#21051;</em></span>&#21435;&#35780;&#23457;&#36825;&#20010;&#34917;&#19969;&#65292;&#37117;&#24076;&#26395;&#20854;&#20182;&#20154;&#33021;&#21435;&#20570;&#36825;&#20214;&#20107;&#12290;&#22240;&#20026;&#27599;&#20010;&#20154;&#31561;&#24453;&#20854;&#20182;&#20154;&#25441;&#36215;&#36825;&#20010;&#29699;&#30340;&#26102;&#38388;&#24182;&#19981;&#19968;&#23450;&#65292;&#32780;&#20854;&#20182;&#20248;&#20808;&#30340;&#20107;&#24773;&#19981;&#26029;&#20986;&#29616;&#65292;&#24456;&#23481;&#26131;&#20250;&#36896;&#25104;&#34917;&#19969;&#34987;&#28431;&#25481;&#30340;&#24773;&#20917;&#65292;&#20294;&#36825;&#26159;&#20219;&#20309;&#20154;&#37117;&#19981;&#20250;&#24076;&#26395;&#21457;&#29983;&#30340;&#20107;&#24773;&#12290;&#39033;&#30446;&#21487;&#33021;&#20197;&#36825;&#31181;&#26041;&#24335;&#38169;&#35823;&#21487;&#29992;&#30340;&#30340;&#34917;&#19969;&#65292;&#20063;&#26377;&#20854;&#20182;&#26377;&#23475;&#30340;&#21103;&#20316;&#29992;&#65306;&#20250;&#25171;&#20987;&#20316;&#32773;&#65292;&#20182;&#20026;&#34917;&#19969;&#20570;&#20102;&#35768;&#22810;&#24037;&#20316;&#65292;&#35753;&#20182;&#35273;&#24471;&#25972;&#20010;&#39033;&#30446;&#38590;&#20197;&#38752;&#36817;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#20854;&#20182;&#32771;&#34385;&#32534;&#20889;&#34917;&#19969;&#30340;&#20154;&#12290;</p><p>&#34917;&#19969;&#31649;&#29702;&#21592;&#30340;&#24037;&#20316;&#23601;&#26159;&#30830;&#20445;&#34917;&#19969;&#19981;&#20250;&#28431;&#25481;&#12290;&#36825;&#26159;&#36890;&#36807;&#36319;&#36394;&#27599;&#20010;&#34917;&#19969;&#30340;&#31283;&#23450;&#29366;&#24577;&#23454;&#29616;&#30340;&#12290;&#34917;&#19969;&#31649;&#29702;&#21592;&#35266;&#23519;&#37038;&#20214;&#21015;&#34920;&#20013;&#27599;&#20010;&#30001;&#25552;&#20986;&#34917;&#19969;&#24341;&#21457;&#30340;&#32447;&#32034;&#12290;&#22914;&#26524;&#26368;&#32456;&#20197;&#34917;&#19969;&#30340;&#25552;&#20132;&#23436;&#25104;&#65292;&#20182;&#19981;&#38656;&#35201;&#20570;&#20219;&#20309;&#20107;&#12290;&#22914;&#26524;&#36827;&#20837;&#20102;&#35780;&#23457;/&#20462;&#27491;&#36845;&#20195;&#65292;&#20197;&#34917;&#19969;&#30340;&#26368;&#32456;&#29256;&#26412;&#32467;&#26463;&#65292;&#20294;&#26159;&#27809;&#26377;&#25552;&#20132;&#65292;&#20182;&#21457;&#36215;&#19968;&#20010;&#25351;&#21521;&#26368;&#32456;&#29256;&#26412;&#20197;&#21450;&#30456;&#20851;&#37038;&#20214;&#21015;&#34920;&#30340;&#38382;&#39064;&#65292;&#36825;&#26679;&#20043;&#21518;&#36319;&#36827;&#30340;&#25152;&#26377;&#24320;&#21457;&#32773;&#37117;&#26377;&#20102;&#19968;&#20010;&#27704;&#20037;&#30340;&#35760;&#24405;&#12290;&#22914;&#26524;&#34917;&#19969;&#23450;&#20301;&#20102;&#19968;&#20010;&#29616;&#26377;&#30340;&#38382;&#39064;&#65292;&#20182;&#20250;&#23558;&#30456;&#20851;&#20449;&#24687;&#27880;&#37322;&#21040;&#35813;&#38382;&#39064;&#65292;&#32780;&#19981;&#20250;&#24320;&#19968;&#20010;&#26032;&#20107;&#29289;&#12290;</p><p>&#22914;&#26524;&#26576;&#20010;&#34917;&#19969;&#27809;&#26377;&#22238;&#24212;&#65292;&#34917;&#19969;&#31649;&#29702;&#21592;&#24212;&#35813;&#31561;&#24453;&#20960;&#22825;&#65292;&#28982;&#21518;&#35810;&#38382;&#26159;&#21542;&#26377;&#20154;&#20250;&#21435;&#35780;&#23457;&#23427;&#12290;&#36890;&#24120;&#20250;&#26377;&#21709;&#24212;&#65306;&#26576;&#20010;&#24320;&#21457;&#32773;&#20250;&#35299;&#37322;&#22905;&#35748;&#20026;&#35813;&#34917;&#19969;&#19981;&#24517;&#24212;&#29992;&#65292;&#28982;&#21518;&#32473;&#20986;&#21407;&#22240;&#65292;&#25110;&#32773;&#22905;&#20250;&#21435;&#35780;&#23457;&#23427;&#65292;&#12290;&#22914;&#26524;&#36824;&#26159;&#27809;&#26377;&#22238;&#24212;&#65292;&#34917;&#19969;&#31649;&#29702;&#21592;&#21487;&#20197;&#21457;&#36215;&#65292;&#20063;&#21487;&#20197;&#19981;&#21457;&#36215;&#19968;&#20010;&#34917;&#19969;&#30340;&#38382;&#39064;&#65292;&#35201;&#26681;&#25454;&#20182;&#33258;&#24049;&#30340;&#21028;&#26029;&#65292;&#20294;&#33267;&#23569;&#26368;&#21021;&#30340;&#25552;&#20132;&#32773;&#24471;&#21040;&#20102;<span class="emphasis"><em>&#19968;&#20123;</em></span>&#22238;&#24212;&#12290;</p><p>&#25317;&#26377;&#19968;&#20010;&#34917;&#19969;&#31649;&#29702;&#21592;&#20026;Subversion&#24320;&#21457;&#22242;&#38431;&#33410;&#30465;&#20102;&#22823;&#37327;&#26102;&#38388;&#21644;&#24515;&#21147;&#12290;&#22914;&#26524;&#27809;&#26377;&#25351;&#23450;&#30340;&#20154;&#36127;&#36131;&#65292;&#27599;&#20010;&#24320;&#21457;&#32773;&#38656;&#35201;&#19968;&#30452;&#25285;&#24515;&#8220;&#22914;&#26524;&#25105;&#27809;&#26377;&#26102;&#38388;&#29616;&#22312;&#22238;&#24212;&#34917;&#19969;&#65292;&#25105;&#33021;&#25351;&#26395;&#21035;&#20154;&#20570;&#21527;&#65311;&#25105;&#26159;&#21542;&#35201;&#19968;&#30452;&#30447;&#30528;&#65311; &#20294;&#22914;&#26524;&#26377;&#21035;&#20154;&#30447;&#30528;&#65292;&#21516;&#26679;&#30340;&#21407;&#22240;&#65292;&#36825;&#26679;&#26159;&#21542;&#26159;&#27809;&#24517;&#35201;&#30340;&#37325;&#22797;&#12290;&#8221; &#27599;&#20010;&#24320;&#21457;&#32773;&#22312;&#31532;&#19968;&#27425;&#30475;&#21040;&#36825;&#20010;&#34917;&#19969;&#30340;&#26102;&#20505;&#37117;&#35201;&#20570;&#36825;&#26679;&#30340;&#20915;&#23450;&#12290;&#22914;&#26524;&#22905;&#24076;&#26395;&#36319;&#36827;&#35780;&#23457;&#65292;&#22905;&#23601;&#21487;&#20197;&#36825;&#26679;&#20570;&#8212;&#34917;&#19969;&#31649;&#29702;&#21592;&#20250;&#26681;&#25454;&#24773;&#20917;&#35843;&#25972;&#20182;&#30340;&#34892;&#20026;&#26041;&#24335;&#12290;&#22914;&#26524;&#22905;&#24076;&#26395;&#23436;&#20840;&#24573;&#30053;&#36825;&#20010;&#34917;&#19969;&#65292;&#20063;&#27809;&#38382;&#39064;&#65307;&#34917;&#19969;&#31649;&#29702;&#21592;&#20250;&#30830;&#20445;&#23427;&#27809;&#26377;&#34987;&#36951;&#24536;&#12290;</p><p>&#22240;&#20026;&#36825;&#20010;&#31995;&#32479;&#21482;&#26377;&#22312;&#34917;&#19969;&#31649;&#29702;&#21592;&#19981;&#21457;&#29983;&#22833;&#35823;&#30340;&#24773;&#20917;&#19979;&#25165;&#33021;&#36816;&#20316;&#27491;&#24120;&#65292;&#25152;&#20197;&#36825;&#20010;&#35282;&#33394;&#24517;&#39035;&#27491;&#24335;&#20219;&#21629;&#12290;&#22312;Subversion&#65292;&#25105;&#20204;&#22312;&#24320;&#21457;&#21644;&#29992;&#25143;&#37038;&#20214;&#21015;&#34920;&#20013;&#24191;&#32780;&#21578;&#20043;&#65292;&#24471;&#21040;&#20102;&#35768;&#22810;&#24535;&#24895;&#32773;&#65292;&#24182;&#36873;&#20102;&#31532;&#19968;&#20010;&#22238;&#22797;&#30340;&#12290;&#24403;&#37027;&#20010;&#20154;&#35831;&#36766;&#21518;&#65288;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="transitions.html" title="&#36716;&#21270;">the section called &#8220;&#36716;&#21270;&#8221;</a>&#65289;&#65292;&#25105;&#20204;&#37325;&#22797;&#20102;&#36825;&#20010;&#27493;&#39588;&#12290;&#25105;&#20204;&#19968;&#30452;&#27809;&#26377;&#35797;&#22270;&#35753;&#22810;&#20010;&#20154;&#20998;&#25285;&#36825;&#20010;&#35282;&#33394;&#65292;&#22240;&#20026;&#20182;&#20204;&#20043;&#38388;&#20250;&#38656;&#35201;&#20132;&#27969;&#30340;&#36127;&#25285;&#65307;&#20294;&#26159;&#22914;&#26524;&#34917;&#19969;&#25552;&#20132;&#30340;&#35268;&#27169;&#26356;&#22823;&#65292;&#21017;&#19968;&#20010;&#22810;&#22836;&#30340;&#34917;&#19969;&#31649;&#29702;&#21592;&#23601;&#20250;&#26377;&#24847;&#20041;&#12290;</p></div><div class="sect2" title="&#32763;&#35793;&#31649;&#29702;&#21592;"><div class="titlepage"><div><div><h3 class="title"><a name="translation-manager"></a>&#32763;&#35793;&#31649;&#29702;&#21592;</h3></div></div></div><p>&#22312;&#36719;&#20214;&#39033;&#30446;&#20013;&#65292;&#8220;&#32763;&#35793;&#8221;&#21487;&#33021;&#25351;&#30340;&#26159;&#20004;&#20214;&#23436;&#20840;&#19981;&#21516;&#30340;&#20107;&#12290;&#23427;&#21487;&#33021;&#25351;&#30340;&#26159;&#23558;&#36719;&#20214;&#25991;&#26723;&#32763;&#35793;&#20026;&#20854;&#20182;&#35821;&#35328;&#65292;&#25110;&#32773;&#25351;&#30340;&#26159;&#32763;&#35793;&#36719;&#20214;&#26412;&#36523;&#8212;&#20063;&#23601;&#26159;&#35753;&#31243;&#24207;&#20351;&#29992;&#29992;&#25143;&#36873;&#20013;&#30340;&#35821;&#35328;&#26174;&#31034;&#38169;&#35823;&#21644;&#24110;&#21161;&#20449;&#24687;&#12290;&#20004;&#32773;&#37117;&#26159;&#22797;&#26434;&#30340;&#20219;&#21153;&#65292;&#19981;&#36807;&#19968;&#26086;&#24314;&#31435;&#20102;&#27491;&#30830;&#30340;&#22522;&#30784;&#26550;&#26500;&#65292;&#21017;&#21487;&#20197;&#24456;&#22823;&#31243;&#24230;&#19978;&#19982;&#20854;&#20182;&#24320;&#21457;&#20998;&#31163;&#12290;&#22240;&#20026;&#36825;&#20123;&#20219;&#21153;&#38750;&#24120;&#31867;&#20284;&#65292;&#25152;&#20197;&#35774;&#32622;&#19968;&#20010;&#21333;&#29420;&#30340;&#32763;&#35793;&#31649;&#29702;&#21592;&#22788;&#29702;&#20004;&#37096;&#20998;&#20219;&#21153;&#23601;&#38750;&#24120;&#26377;&#24847;&#20041;&#65288;&#21462;&#20915;&#20110;&#20320;&#30340;&#39033;&#30446;&#65289;&#65292;&#20134;&#25110;&#32773;&#26356;&#22909;&#30340;&#26041;&#24335;&#26159;&#35774;&#32622;&#20004;&#20010;&#19981;&#21516;&#30340;&#31649;&#29702;&#21592;&#12290;</p><p>&#22312;Subversion&#39033;&#30446;&#65292;&#25105;&#20204;&#26377;&#19968;&#20010;&#22788;&#29702;&#20004;&#37096;&#20998;&#30340;&#32763;&#35793;&#31649;&#29702;&#21592;&#12290;&#20182;&#33258;&#24049;&#24182;&#19981;&#32534;&#20889;&#32763;&#35793;&#65292;&#24403;&#28982;&#8212;&#20182;&#21487;&#20197;&#24110;&#21161;&#19968;&#20004;&#20010;&#65292;&#20294;&#26159;&#22312;&#20889;&#36825;&#20123;&#35805;&#26102;&#65292;&#22914;&#26524;&#20182;&#24076;&#26395;&#19982;&#20182;&#20204;&#25152;&#26377;&#20154;&#19968;&#36215;&#24037;&#20316;&#65292;&#20182;&#38656;&#35201;&#35762;10&#31181;&#35821;&#35328;&#65288;12&#31181;&#26041;&#35328;&#65289;&#12290;&#22240;&#32780;&#65292;&#20182;&#31649;&#29702;&#24535;&#24895;&#32763;&#35793;&#32773;&#65306;&#20182;&#24110;&#21161;&#20182;&#20204;&#20114;&#30456;&#21327;&#35843;&#65292;&#20197;&#21450;&#20182;&#20204;&#22242;&#38431;&#19982;&#39033;&#30446;&#20854;&#20313;&#37096;&#20998;&#30340;&#21327;&#35843;&#12290;</p><p>&#35774;&#32622;&#32763;&#35793;&#31649;&#29702;&#21592;&#30340;&#19968;&#20010;&#21407;&#22240;&#26159;&#32763;&#35793;&#32773;&#26159;&#19982;&#24320;&#21457;&#32773;&#19981;&#21516;&#30340;&#20154;&#12290;&#20182;&#20204;&#26377;&#26102;&#21482;&#26377;&#26377;&#38480;&#30340;&#29978;&#33267;&#27809;&#26377;&#20219;&#20309;&#22312;&#29256;&#26412;&#25511;&#21046;&#29256;&#26412;&#24211;&#20013;&#24037;&#20316;&#30340;&#32463;&#39564;&#65292;&#20063;&#27809;&#26377;&#19982;&#20998;&#24067;&#24335;&#24535;&#24895;&#22242;&#38431;&#19968;&#36215;&#24037;&#20316;&#30340;&#32463;&#39564;&#12290;&#20294;&#22312;&#21478;&#19968;&#26041;&#38754;&#65292;&#20182;&#20204;&#36890;&#24120;&#26159;&#26368;&#22909;&#30340;&#19968;&#31867;&#24535;&#24895;&#32773;&#65306;&#25317;&#26377;&#29305;&#23450;&#39046;&#22495;&#30693;&#35782;&#65292;&#21487;&#20197;&#30475;&#21040;&#38656;&#27714;&#65292;&#36873;&#25321;&#21442;&#19982;&#36827;&#26469;&#12290;&#20182;&#20204;&#20063;&#36890;&#24120;&#24895;&#24847;&#23398;&#20064;&#65292;&#23545;&#24037;&#20316;&#20805;&#28385;&#28909;&#24773;&#12290;&#25152;&#38656;&#35201;&#21482;&#26159;&#26377;&#20154;&#21578;&#35785;&#20182;&#20204;&#22914;&#20309;&#20570;&#12290;&#32763;&#35793;&#31649;&#29702;&#21592;&#30830;&#20445;&#32763;&#35793;&#19981;&#20250;&#27809;&#24517;&#35201;&#30340;&#24178;&#25200;&#26085;&#24120;&#30340;&#24320;&#21457;&#12290;&#27599;&#24403;&#24320;&#21457;&#32773;&#24517;&#39035;&#34987;&#21578;&#30693;&#38656;&#35201;&#20026;&#25903;&#25345;&#32763;&#35793;&#24037;&#20316;&#25552;&#20379;&#25216;&#26415;&#21464;&#26356;&#26102;&#65292;&#20182;&#20063;&#35201;&#20316;&#20026;&#32763;&#35793;&#32773;&#20316;&#20026;&#19968;&#20010;&#32479;&#19968;&#25972;&#20307;&#30340;&#20195;&#34920;&#12290;</p><p>&#22240;&#27492;&#65292;&#36825;&#20010;&#20301;&#32622;&#26368;&#37325;&#35201;&#30340;&#25216;&#33021;&#26159;&#22806;&#20132;&#33021;&#21147;&#65292;&#32780;&#19981;&#26159;&#25216;&#26415;&#33021;&#21147;&#12290;&#20363;&#22914;&#65292;&#22312;Subversion&#25105;&#20204;&#26377;&#19968;&#20010;&#25919;&#31574;&#65292;&#27599;&#31181;&#35821;&#35328;&#30340;&#32763;&#35793;&#37117;&#24517;&#39035;&#33267;&#23569;&#26377;&#20004;&#20010;&#20154;&#27491;&#22312;&#21442;&#19982;&#65292;&#21542;&#21017;&#65292;&#23601;&#27809;&#26377;&#20154;&#21487;&#20197;&#26816;&#26597;&#25991;&#26412;&#12290;&#35692;&#22914;&#35828;&#65292;&#26377;&#26032;&#30340;&#24535;&#24895;&#32773;&#35831;&#27714;&#25552;&#20379;Subversion&#39532;&#36798;&#21152;&#26031;&#21152;&#35821;&#32763;&#35793;&#26102;&#65292;&#32763;&#35793;&#31649;&#29702;&#21592;&#24517;&#39035;&#25552;&#31034;&#20182;&#21435;&#19982;&#20845;&#20010;&#26376;&#21069;&#26576;&#20010;&#34920;&#36798;&#36807;&#39532;&#36798;&#21152;&#26031;&#21152;&#35821;&#32763;&#35793;&#24847;&#21521;&#30340;&#20154;&#24314;&#31435;&#32852;&#31995;&#65292;&#25110;&#32773;&#26377;&#31036;&#35980;&#30340;&#35810;&#38382;&#24535;&#24895;&#32773;&#21435;&#23547;&#25214;<span class="emphasis"><em>&#21478;&#19968;&#20010;</em></span>&#39532;&#36798;&#21152;&#26031;&#21152;&#32763;&#35793;&#32773;&#19982;&#20854;&#25645;&#26723;&#24037;&#20316;&#12290;&#24403;&#26377;&#20102;&#36275;&#22815;&#30340;&#20154;&#25163;&#65292;&#31649;&#29702;&#21592;&#23601;&#21487;&#20197;&#20026;&#20182;&#20204;&#35774;&#32622;&#27491;&#30830;&#30340;&#25552;&#20132;&#35775;&#38382;&#26435;&#38480;&#65292;&#21578;&#30693;&#20182;&#20204;&#39033;&#30446;&#30340;&#24815;&#20363;&#65288;&#20363;&#22914;&#22914;&#20309;&#32534;&#20889;&#26085;&#24535;&#25991;&#20214;&#65289;&#65292;&#28982;&#21518;&#32039;&#30447;&#20182;&#20204;&#26159;&#21542;&#36981;&#24490;&#20102;&#36825;&#20123;&#24815;&#20363;&#12290;</p><p>&#32763;&#35793;&#31649;&#29702;&#21592;&#21644;&#24320;&#21457;&#32773;&#20043;&#38388;&#65292;&#20197;&#21450;&#32763;&#35793;&#31649;&#29702;&#21644;&#32763;&#35793;&#22242;&#38431;&#20043;&#38388;&#30340;&#23545;&#35805;&#36890;&#24120;&#20351;&#29992;&#39033;&#30446;&#21407;&#20808;&#30340;&#35821;&#35328;&#8212;&#20063;&#23601;&#26159;&#25152;&#20197;&#32763;&#35793;&#30340;&#28304;&#35821;&#35328;&#12290;&#23545;&#20110;&#22823;&#22810;&#25968;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#65292;&#23601;&#26159;&#33521;&#35821;&#65292;&#20294;&#26159;&#26159;&#20160;&#20040;&#35821;&#35328;&#24182;&#19981;&#37325;&#35201;&#65292;&#21482;&#35201;&#39033;&#30446;&#35748;&#21487;&#21363;&#21487;&#12290;&#65288;&#23545;&#20110;&#24076;&#26395;&#21560;&#24341;&#24191;&#27867;&#22269;&#38469;&#24320;&#21457;&#31038;&#21306;&#30340;&#39033;&#30446;&#65292;&#33521;&#35821;&#21487;&#33021;&#26159;&#26368;&#22909;&#30340;&#35821;&#35328;&#12290;&#65289;</p><p>&#22312;&#29305;&#23450;&#32763;&#35793;&#23567;&#32452;<span class="emphasis"><em>&#20013;&#30340;</em></span>&#23545;&#35805;&#36890;&#24120;&#20351;&#29992;&#23427;&#20204;&#20849;&#20139;&#30340;&#35821;&#35328;&#65292;&#28982;&#32780;&#32763;&#35793;&#31649;&#29702;&#21592;&#30340;&#21478;&#19968;&#20010;&#20219;&#21153;&#23601;&#26159;&#20026;&#20102;&#27599;&#20010;&#22242;&#38431;&#35774;&#23450;&#19968;&#20010;&#19987;&#38376;&#30340;&#37038;&#20214;&#21015;&#34920;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#32763;&#35793;&#32773;&#21487;&#20197;&#33258;&#30001;&#30340;&#35752;&#35770;&#20182;&#20204;&#30340;&#24037;&#20316;&#65292;&#32780;&#19981;&#20250;&#25171;&#25200;&#39033;&#30446;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#20154;&#65292;&#20182;&#20204;&#21487;&#33021;&#26681;&#26412;&#19981;&#29702;&#35299;&#20182;&#20204;&#30340;&#32763;&#35793;&#35821;&#35328;&#12290;</p><div class="sidebar" title="&#22269;&#38469;&#21270;&#36824;&#26159;&#26412;&#22320;&#21270;"><a name="i7n"></a><div class="titlepage"><div><div><p class="title"><b>&#22269;&#38469;&#21270;&#36824;&#26159;&#26412;&#22320;&#21270;</b></p></div></div></div><p><em class="firstterm">&#22269;&#38469;&#21270;</em>(<em class="firstterm">I18N</em>)&#21644;<em class="firstterm">&#26412;&#22320;&#21270;</em>(<em class="firstterm">L10N</em>)&#37117;&#25351;&#30340;&#26159;&#37319;&#29992;&#38750;&#21407;&#36719;&#20214;&#32534;&#20889;&#30340;&#35821;&#35328;&#21644;&#29615;&#22659;&#20351;&#29992;&#31243;&#24207;&#30340;&#36807;&#31243;&#12290;&#36825;&#20004;&#20010;&#26415;&#35821;&#36890;&#24120;&#26159;&#21487;&#20197;&#20114;&#30456;&#26367;&#25442;&#30340;&#65292;&#20294;&#26159;&#23454;&#38469;&#19978;&#20182;&#20204;&#24182;&#19981;&#26159;&#21516;&#19968;&#22238;&#20107;&#12290;&#23601;&#20687;<a class="ulink" href="http://en.wikipedia.org/wiki/G11n" target="_top">http://en.wikipedia.org/wiki/G11n</a>&#25152;&#35828;&#30340;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p>&#23427;&#20204;&#20043;&#38388;&#30340;&#21306;&#21035;&#26159;&#24494;&#23567;&#30340;&#65292;&#20294;&#26159;&#38750;&#24120;&#37325;&#35201;&#65306;&#22269;&#38469;&#21270;&#25351;&#30340;&#26159;&#20026;<span class="emphasis"><em>&#28508;&#22312;&#30340;</em></span>&#29992;&#20110;&#25152;&#26377;&#22320;&#26041;&#30340;&#20135;&#21697;&#25913;&#36896;&#65292;&#32780;&#26412;&#22320;&#21270;&#26159;&#20026;&#29992;&#20110;<span class="emphasis"><em>&#29305;&#23450;</em></span>&#22320;&#22495;&#30340;&#29305;&#21035;&#29305;&#24615;&#38468;&#21152;&#12290;</p></blockquote></div><p>&#20363;&#22914;&#65292;&#23558;&#24744;&#30340;&#36719;&#20214;&#20462;&#25913;&#20026;&#23454;&#29616;&#23545;Unicode(<a class="ulink" href="http://en.wikipedia.org/wiki/Unicode" target="_top">http://en.wikipedia.org/wiki/Unicode</a>)&#25991;&#26412;&#32534;&#30721;&#26080;&#25439;&#22788;&#29702;&#26159;&#19968;&#31181;&#22269;&#38469;&#21270;&#34892;&#21160;&#65292;&#22240;&#20026;&#23427;&#24182;&#19981;&#26159;&#20851;&#20110;&#29305;&#23450;&#30340;&#35821;&#35328;&#65292;&#32780;&#26159;&#20851;&#20110;&#25509;&#21463;&#26469;&#33258;&#20219;&#24847;&#25968;&#37327;&#35821;&#35328;&#30340;&#25991;&#26412;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#24403;&#26816;&#27979;&#21040;&#36719;&#20214;&#26159;&#36816;&#34892;&#20110;&#26031;&#27931;&#25991;&#23612;&#20122;&#35821;&#29615;&#22659;&#26102;&#65292;&#20415;&#20197;&#26031;&#27931;&#25991;&#23612;&#20122;&#35821;&#25171;&#21360;&#38169;&#35823;&#20449;&#24687;&#65292;&#21017;&#26159;&#26412;&#22320;&#21270;&#30340;&#34892;&#21160;&#12290;</p><p>&#22240;&#27492;&#65292;&#32763;&#35793;&#31649;&#29702;&#21592;&#30340;&#20219;&#21153;&#20174;&#21407;&#29702;&#19978;&#26159;&#20851;&#20110;&#26412;&#22320;&#21270;&#30340;&#65292;&#32780;&#19981;&#26159;&#22269;&#38469;&#21270;&#12290;</p></div></div><div class="sect2" title="&#25991;&#26723;&#31649;&#29702;&#21592;"><div class="titlepage"><div><div><h3 class="title"><a name="documentation-manager"></a>&#25991;&#26723;&#31649;&#29702;&#21592;</h3></div></div></div><p>&#20445;&#25345;&#36719;&#20214;&#25991;&#26723;&#30340;&#23454;&#25928;&#24615;&#26159;&#19968;&#39033;&#26080;&#27861;&#32467;&#26463;&#30340;&#20219;&#21153;&#12290;&#27599;&#20010;&#36827;&#20837;&#20195;&#30721;&#30340;&#26032;&#29305;&#24615;&#25110;&#25913;&#36827;&#37117;&#21487;&#33021;&#20250;&#23548;&#33268;&#25991;&#26723;&#30340;&#21464;&#26356;&#12290;&#21478;&#22806;&#65292;&#19968;&#26086;&#39033;&#30446;&#25991;&#26723;&#36798;&#21040;&#20102;&#19968;&#23450;&#32423;&#21035;&#30340;&#23436;&#25972;&#24615;&#65292;&#23601;&#20250;&#21457;&#29616;&#35768;&#22810;&#20154;&#21457;&#26469;&#30340;&#34917;&#19969;&#26159;&#38024;&#23545;&#25991;&#26723;&#30340;&#65292;&#32780;&#19981;&#26159;&#20195;&#30721;&#12290;&#36825;&#26159;&#22240;&#20026;&#35768;&#22810;&#20154;&#26159;&#22312;&#25991;&#31456;&#20013;&#20462;&#27491;&#20102;bug&#65292;&#32780;&#19981;&#26159;&#22312;&#20195;&#30721;&#20013;&#65306;&#25152;&#26377;&#30340;&#29992;&#25143;&#37117;&#26159;&#35835;&#32773;&#65292;&#20294;&#20165;&#26377;&#23569;&#25968;&#26159;&#31243;&#24207;&#21592;&#12290;</p><p>&#25991;&#26723;&#34917;&#19969;&#36890;&#24120;&#27604;&#20195;&#30721;&#34917;&#19969;&#26356;&#26131;&#20110;&#26816;&#26597;&#21644;&#24212;&#29992;&#12290;&#20165;&#38656;&#35201;&#23569;&#35768;&#25110;&#26080;&#38656;&#27979;&#35797;&#65292;&#32780;&#19988;&#21487;&#20197;&#24555;&#36895;&#30340;&#36890;&#36807;&#26816;&#26597;&#35780;&#20215;&#21464;&#26356;&#30340;&#36136;&#37327;&#12290;&#22240;&#20026;&#25968;&#37327;&#24456;&#22810;&#65292;&#20294;&#26159;&#26816;&#26597;&#30340;&#36127;&#25285;&#30456;&#23545;&#36739;&#20302;&#65292;&#25991;&#26723;&#34917;&#19969;&#20013;&#26377;&#25928;&#24037;&#20316;&#30340;&#31649;&#29702;&#36127;&#25285;&#27604;&#29575;&#36828;&#27604;&#20195;&#30721;&#34917;&#19969;&#39640;&#12290;&#27492;&#22806;&#65292;&#22823;&#22810;&#25968;&#34917;&#19969;&#38656;&#35201;&#19968;&#20123;&#35843;&#25972;&#65292;&#25165;&#33021;&#20445;&#25345;&#25991;&#26723;&#20013;&#20316;&#32773;&#35821;&#27668;&#30340;&#19968;&#33268;&#24615;&#12290;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#34917;&#19969;&#36890;&#24120;&#20250;&#35206;&#30422;&#25110;&#24433;&#21709;&#20854;&#20182;&#34917;&#19969;&#65292;&#22312;&#25552;&#20132;&#20043;&#21069;&#38656;&#35201;&#26681;&#25454;&#20043;&#38388;&#30340;&#20851;&#31995;&#36827;&#34892;&#35843;&#25972;&#12290;</p><p>&#20986;&#20110;&#22788;&#29702;&#25991;&#26723;&#34917;&#19969;&#30340;&#32039;&#36843;&#24615;&#65292;&#20197;&#21450;&#38656;&#35201;&#25345;&#32493;&#30417;&#25511;&#20195;&#30721;&#22522;&#20197;&#20415;&#20445;&#25345;&#25991;&#26723;&#30340;&#23454;&#25928;&#24615;&#65292;&#26377;&#24517;&#35201;&#35753;&#26576;&#20010;&#20154;&#25110;&#19968;&#20010;&#23567;&#32452;&#19987;&#38376;&#20174;&#20107;&#36825;&#39033;&#20219;&#21153;&#12290;&#20182;&#20204;&#38656;&#35201;&#31934;&#30830;&#30340;&#20445;&#23384;&#25991;&#26723;&#22312;&#20309;&#22788;&#28382;&#21518;&#20110;&#36719;&#20214;&#30340;&#35760;&#24405;&#65292;&#32780;&#19988;&#20182;&#20204;&#21487;&#20197;&#29992;&#19968;&#31181;&#25972;&#20307;&#26041;&#24335;&#30340;&#23454;&#36341;&#27493;&#39588;&#26469;&#22788;&#29702;&#22823;&#37327;&#30340;&#34917;&#19969;&#12290;</p><p>&#24403;&#28982;&#65292;&#36825;&#26679;&#19981;&#20250;&#38459;&#30861;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#20154;&#22312;&#24037;&#20316;&#20013;&#24212;&#29992;&#25991;&#26723;&#34917;&#19969;&#65292;&#29305;&#21035;&#26159;&#26102;&#38388;&#20801;&#35768;&#26102;&#19968;&#20123;&#23567;&#30340;&#34917;&#19969;&#12290;&#21516;&#19968;&#20010;&#34917;&#19969;&#31649;&#29702;&#21592;&#65288;&#35265;<span>&#26412;&#31456;&#21069;&#38754;&#25552;&#21040;&#30340;</span><a class="xref" href="share-management.html#patch-manager" title="&#34917;&#19969;&#31649;&#29702;&#21592;">the section called &#8220;&#34917;&#19969;&#31649;&#29702;&#21592;&#8221;</a>&#65289;&#21487;&#20197;&#21516;&#26102;&#36319;&#36394;&#20195;&#30721;&#21644;&#25991;&#26723;&#34917;&#19969;&#65292;&#24403;&#24320;&#21457;&#21644;&#25991;&#26723;&#22242;&#38431;&#24076;&#26395;&#26102;&#23436;&#25104;&#23427;&#20204;&#12290;&#65288;&#22914;&#26524;&#34917;&#19969;&#30340;&#24635;&#25968;&#24050;&#32463;&#36229;&#20986;&#20102;&#21333;&#20010;&#20154;&#21487;&#20197;&#36319;&#36394;&#30340;&#23481;&#37327;&#65292;&#26368;&#22909;&#30340;&#19968;&#20010;&#27493;&#39588;&#21487;&#33021;&#23601;&#26159;&#23558;&#34917;&#19969;&#31649;&#29702;&#21592;&#20998;&#20026;&#20195;&#30721;&#21644;&#25991;&#26723;&#12290;&#65289;&#25991;&#26723;&#22242;&#38431;&#30340;&#20851;&#38190;&#26159;&#20351;&#20154;&#20204;&#25226;&#20445;&#25345;&#25991;&#26723;&#32452;&#32455;&#24615;&#12289;&#23454;&#25928;&#24615;&#21644;&#19968;&#33268;&#24615;&#24403;&#20316;&#33258;&#24049;&#30340;&#36131;&#20219;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#36825;&#24847;&#21619;&#30528;&#23545;&#20110;&#25991;&#26723;&#30340;&#29087;&#24713;&#65292;&#20851;&#27880;<span class="emphasis"><em>&#20854;&#20182;&#20154;</em></span>&#25552;&#20132;&#32473;&#25991;&#26723;&#30340;&#21464;&#26356;&#65292;&#20851;&#27880;&#21040;&#26469;&#30340;&#25991;&#26723;&#34917;&#19969;&#65292;&#24182;&#20351;&#29992;&#25152;&#26377;&#36825;&#20123;&#20449;&#24687;&#28304;&#23436;&#25104;&#20445;&#25345;&#25991;&#26723;&#20581;&#24247;&#30340;&#25152;&#26377;&#24517;&#35201;&#24037;&#20316;&#12290;</p></div><div class="sect2" title="&#38382;&#39064;&#31649;&#29702;&#21592;"><div class="titlepage"><div><div><h3 class="title"><a name="issue-manager"></a>&#38382;&#39064;&#31649;&#29702;&#21592;</h3></div></div></div><p>&#39033;&#30446;bug&#36319;&#36394;&#31995;&#32479;&#20013;&#38382;&#39064;&#30340;&#25968;&#37327;&#26159;&#38543;&#30528;&#20351;&#29992;&#20135;&#21697;&#30340;&#20154;&#25968;&#21516;&#27604;&#20363;&#22686;&#21152;&#30340;&#12290;&#22240;&#32780;&#65292;&#21363;&#20351;&#20320;&#22312;&#19968;&#20010;&#24555;&#36895;&#25104;&#38271;&#30340;&#20581;&#22766;&#31243;&#24207;&#20013;&#20462;&#27491;bug&#24182;&#35013;&#36816;&#65292;&#24744;&#36824;&#26159;&#20250;&#30475;&#21040;&#22823;&#37327;&#24320;&#25918;&#30340;&#38382;&#39064;&#28459;&#26080;&#36793;&#38469;&#30340;&#20135;&#29983;&#12290;&#37325;&#22797;&#38382;&#39064;&#65292;&#20197;&#21450;&#19981;&#23436;&#25972;&#25110;&#25551;&#36848;&#31967;&#31957;&#30340;&#38382;&#39064;&#20063;&#20250;&#39057;&#32321;&#21457;&#29983;&#12290;</p><p>&#38382;&#39064;&#31649;&#29702;&#21592;&#36890;&#36807;&#20851;&#27880;&#36827;&#20837;&#25968;&#25454;&#24211;&#30340;&#20449;&#24687;&#65292;&#23450;&#26399;&#30340;&#28165;&#38500;&#29305;&#23450;&#38382;&#39064;&#26377;&#21161;&#20110;&#32531;&#21644;&#36825;&#31181;&#38382;&#39064;&#12290;&#20182;&#20204;&#30340;&#22823;&#22810;&#25968;&#24120;&#35265;&#34892;&#20026;&#21487;&#20197;&#20462;&#27491;&#36827;&#20837;&#30340;&#38382;&#39064;&#65292;&#19968;&#26041;&#38754;&#22240;&#20026;&#25253;&#21578;&#32773;&#26410;&#33021;&#27491;&#30830;&#30340;&#22788;&#29702;&#37096;&#20998;&#23383;&#27573;&#65292;&#21478;&#19968;&#26041;&#38754;&#20063;&#22240;&#20026;&#38382;&#39064;&#19982;&#25968;&#25454;&#24211;&#20013;&#30340;&#19968;&#20010;&#38382;&#39064;&#24050;&#32463;&#37325;&#22797;&#12290;&#24456;&#26126;&#26174;&#65292;&#38382;&#39064;&#31649;&#29702;&#21592;&#23545;&#39033;&#30446;bug&#25968;&#25454;&#24211;&#36234;&#29087;&#24713;&#65292;&#20182;&#23601;&#36234;&#33021;&#26377;&#25928;&#29575;&#30340;&#26816;&#27979;&#21040;&#37325;&#22797;&#38382;&#39064;&#8212;&#36825;&#20063;&#26159;&#35774;&#32622;&#19968;&#23567;&#37096;&#20998;&#20154;&#19987;&#38376;&#20851;&#27880;bug&#25968;&#25454;&#24211;&#65292;&#32780;&#19981;&#26159;&#35753;&#27599;&#20010;&#20154;&#37117;<span class="foreignphrase"><em class="foreignphrase">&#29305;&#21035;</em></span>&#21442;&#19982;&#20854;&#20013;&#30340;&#21407;&#22240;&#12290;&#24403;&#22242;&#38431;&#35797;&#22270;&#25353;&#29031;&#38750;&#38598;&#20013;&#24335;&#30340;&#26041;&#24335;&#23436;&#25104;&#36825;&#39033;&#20219;&#21153;&#26102;&#65292;&#23601;&#19981;&#20250;&#26377;&#20219;&#20309;&#19968;&#20010;&#20154;&#20855;&#22791;&#23545;&#20110;&#25968;&#25454;&#24211;&#20869;&#23481;&#30340;&#28145;&#20837;&#19987;&#19994;&#30693;&#35782;&#12290;</p><p>&#38382;&#39064;&#31649;&#29702;&#21592;&#21487;&#20197;&#24110;&#21161;&#25105;&#20204;&#26144;&#23556;&#38382;&#39064;&#21644;&#20010;&#21035;&#24320;&#21457;&#32773;&#12290;&#24403;&#26377;&#22823;&#37327;bug&#25253;&#21578;&#36827;&#20837;&#26102;&#65292;&#19981;&#26159;&#27599;&#20010;&#24320;&#21457;&#32773;&#20250;&#20197;&#24179;&#31561;&#30340;&#24577;&#24230;&#35835;&#21462;&#38382;&#39064;&#36890;&#30693;&#37038;&#20214;&#21015;&#34920;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#26576;&#20154;&#30693;&#36947;&#24320;&#21457;&#22242;&#38431;&#32039;&#30447;&#30528;&#25152;&#26377;&#36827;&#20837;&#30340;&#38382;&#39064;&#65292;&#22905;&#21487;&#20197;&#23558;&#27880;&#24847;&#21147;&#25918;&#21040;&#29305;&#23450;&#21512;&#36866;&#30340;bug&#19978;&#12290;&#24403;&#28982;&#65292;&#36825;&#38656;&#35201;&#23545;&#39033;&#30446;&#25152;&#26377;&#24320;&#21457;&#30340;&#20107;&#24773;&#65292;&#25509;&#21463;&#32773;&#26399;&#26395;&#21644;&#24615;&#24773;&#37117;&#24456;&#25935;&#24863;&#12290;&#22240;&#32780;&#65292;&#38382;&#39064;&#31649;&#29702;&#21592;&#26368;&#22909;&#20063;&#26159;&#24320;&#21457;&#32773;&#30340;&#19968;&#20998;&#23376;&#12290;</p><p>&#21462;&#20915;&#20110;&#20320;&#30340;&#39033;&#30446;&#22914;&#20309;&#20351;&#29992;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#65292;&#38382;&#39064;&#31649;&#29702;&#21592;&#20063;&#21487;&#20197;&#35843;&#25972;&#35813;&#25968;&#25454;&#24211;&#20197;&#21453;&#26144;&#39033;&#30446;&#30340;&#20248;&#20808;&#32423;&#12290;&#20363;&#22914;&#65292;&#22312;Subversion&#25105;&#20204;&#23558;&#38382;&#39064;&#25490;&#20837;&#26410;&#26469;&#30340;&#29305;&#23450;&#21457;&#24067;&#65292;&#36825;&#26679;&#27599;&#24403;&#26377;&#20154;&#35810;&#38382;&#8220;&#26576;&#20010;bug X&#20309;&#26102;&#21487;&#20197;&#20462;&#22797;&#26102;&#65311;&#8221;&#25105;&#20204;&#21487;&#20197;&#35828;&#8220;&#20043;&#21518;&#30340;&#20004;&#20010;&#21457;&#24067;&#65292;&#8221;&#21363;&#20351;&#25105;&#20204;&#19981;&#33021;&#35828;&#20986;&#30830;&#20999;&#30340;&#26085;&#26399;&#12290;&#36825;&#20010;&#21457;&#24067;&#22312;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#20013;&#20197;&#30446;&#26631;&#37324;&#31243;&#30865;&#30340;&#24418;&#24335;&#23637;&#31034;&#65292;&#20063;&#23601;&#26159;IssueZilla&#20013;&#30340;&#19968;&#20010;&#23383;&#27573;&#12290;<sup>[<a name="idp2809" href="#ftn.idp2809" class="footnote">27</a>]</sup>&#20316;&#20026;&#19968;&#20010;&#35268;&#21017;&#65292;&#27599;&#20010;Subversion&#21457;&#24067;&#37117;&#26377;&#19968;&#20010;&#26032;&#30340;&#29305;&#24615;&#21644;&#19968;&#32452;&#29305;&#23450;&#30340;bug&#20462;&#27491;&#12290;&#25105;&#20204;&#20026;&#35813;&#21457;&#24067;&#30340;&#25152;&#26377;&#38382;&#39064;&#36171;&#20104;&#19968;&#20010;&#21512;&#36866;&#30340;&#30446;&#26631;&#37324;&#31243;&#30865;&#65288;&#21253;&#25324;&#26032;&#29305;&#24615;&#8212;&#23427;&#20063;&#20250;&#24471;&#21040;&#19968;&#20010;&#38382;&#39064;&#65289;&#65292;&#36825;&#26679;&#20154;&#20204;&#23601;&#21487;&#20197;&#36890;&#36807;&#21457;&#24067;&#35745;&#21010;&#26597;&#30475;bug&#25968;&#25454;&#24211;&#12290;&#36825;&#20123;&#30446;&#26631;&#24456;&#23569;&#24773;&#20917;&#19979;&#20250;&#20445;&#25345;&#38745;&#27490;&#12290;&#38543;&#30528;&#26032;bug&#30340;&#21040;&#26469;&#65292;&#31561;&#32423;&#20250;&#21457;&#29983;&#20999;&#25442;&#65292;&#32780;&#19988;&#26377;&#20123;bug&#24517;&#39035;&#31227;&#21040;&#21478;&#19968;&#20010;&#37324;&#31243;&#30865;&#65292;&#20197;&#20445;&#35777;&#27599;&#20010;&#21457;&#24067;&#30340;&#21487;&#31649;&#29702;&#24615;&#12290;&#20877;&#27425;&#65292;&#26368;&#22909;&#30001;&#23545;&#39033;&#30446;&#25968;&#25454;&#24211;&#30340;&#20869;&#23481;&#20197;&#21450;&#38382;&#39064;&#20043;&#38388;&#30340;&#20851;&#31995;&#26377;&#30528;&#25972;&#20307;&#24847;&#35782;&#30340;&#20154;&#23436;&#25104;&#12290;</p><p>&#38382;&#39064;&#31649;&#29702;&#21592;&#30340;&#21478;&#19968;&#39033;&#20540;&#24471;&#20851;&#27880;&#30340;&#20219;&#21153;&#26159;&#31649;&#29702;&#24223;&#24323;&#30340;&#38382;&#39064;&#12290;&#26377;&#26102;&#65292;&#26576;&#20010;bug&#20250;&#22240;&#20026;&#36719;&#20214;&#19968;&#20010;&#19981;&#30456;&#20851;&#21464;&#26356;&#32780;&#24847;&#22806;&#30340;&#20462;&#27491;&#65292;&#25110;&#32773;&#26377;&#26102;&#39033;&#30446;&#23545;&#20110;&#29305;&#23450;&#34892;&#20026;&#26159;&#21542;&#20026;bug&#30340;&#24847;&#35265;&#21457;&#29983;&#25913;&#21464;&#12290;&#23547;&#25214;&#24223;&#24323;&#30340;&#38382;&#39064;&#24182;&#19981;&#31616;&#21333;&#65306;&#21807;&#19968;&#30340;&#31995;&#32479;&#26041;&#27861;&#26159;&#28165;&#29702;&#25968;&#25454;&#24211;&#20013;&#30340;&#25152;&#26377;&#38382;&#39064;&#12290;&#38543;&#30528;&#38382;&#39064;&#25968;&#37327;&#30340;&#22686;&#38271;&#65292;&#23436;&#20840;&#30340;&#28165;&#29702;&#20250;&#21464;&#24471;&#36234;&#26469;&#36234;&#19981;&#21487;&#34892;&#12290;&#22312;&#36798;&#21040;&#26576;&#20010;&#28857;&#26102;&#65292;&#20445;&#25345;&#25968;&#25454;&#24211;&#20581;&#24247;&#30340;&#21807;&#19968;&#26041;&#27861;&#23601;&#26159;&#20998;&#32780;&#27835;&#20043;&#65306;&#26681;&#25454;&#36827;&#20837;&#25968;&#25454;&#24211;&#30340;&#24773;&#20917;&#23558;&#38382;&#39064;&#20998;&#31867;&#65292;&#24182;&#30452;&#25509;&#20998;&#37197;&#32473;&#21512;&#36866;&#30340;&#24320;&#21457;&#32773;&#25110;&#22242;&#38431;&#12290;&#28982;&#21518;&#25509;&#21463;&#32773;&#36127;&#36131;&#38382;&#39064;&#20313;&#19979;&#30340;&#24037;&#20316;&#65292;&#26681;&#25454;&#38656;&#35201;&#20915;&#23450;&#26159;&#35299;&#20915;&#36824;&#26159;&#24223;&#24323;&#12290;&#22914;&#26524;&#25968;&#25454;&#24211;&#36275;&#22815;&#22823;&#65292;&#38382;&#39064;&#31649;&#29702;&#21592;&#30340;&#24037;&#20316;&#23601;&#26356;&#20542;&#21521;&#20110;&#21327;&#35843;&#65292;&#23558;&#20250;&#33457;&#36153;&#36739;&#23569;&#30340;&#26102;&#38388;&#29992;&#20110;&#33258;&#24049;&#26597;&#25214;&#38382;&#39064;&#65292;&#32780;&#26159;&#33457;&#26356;&#22810;&#30340;&#26102;&#38388;&#20351;&#20043;&#21040;&#36798;&#27491;&#30830;&#30340;&#20154;&#25163;&#20013;&#12290;</p></div><div class="sect2" title="FAQ&#31649;&#29702;&#21592;"><div class="titlepage"><div><div><h3 class="title"><a name="faq-manager"></a>FAQ&#31649;&#29702;&#21592;</h3></div></div></div><p>FAQ&#32500;&#25252;&#26159;&#19968;&#39033;&#20986;&#20154;&#24847;&#26009;&#30340;&#22256;&#38590;&#24037;&#20316;&#12290;&#39033;&#30446;&#20013;&#20854;&#20182;&#25991;&#26723;&#30340;&#20869;&#23481;&#37117;&#26159;&#30001;&#20316;&#32773;&#39044;&#20808;&#35745;&#21010;&#24471;&#21040;&#30340;&#65292;&#32780;FAQ&#21017;&#23436;&#20840;&#26159;&#34987;&#21160;&#30340;&#25991;&#26723;&#65288;&#35265;<a class="xref" href="getting-started.html#starting-a-faq" title="&#32500;&#25252;FAQ">&#32500;&#25252;FAQ</a>&#65289;&#12290;&#26080;&#35770;&#23427;&#21464;&#24471;&#22914;&#20309;&#24040;&#22823;&#65292;&#20320;&#27704;&#36828;&#19981;&#30693;&#36947;&#20309;&#26102;&#20250;&#20877;&#19968;&#27425;&#28155;&#21152;&#12290;&#32780;&#19988;&#22240;&#20026;&#23427;&#24635;&#26159;&#38646;&#38646;&#25955;&#25955;&#30340;&#28155;&#21152;&#65292;&#23427;&#24456;&#23481;&#26131;&#21464;&#24471;&#19981;&#22815;&#19968;&#33268;&#24182;&#32570;&#20047;&#32452;&#32455;&#65292;&#29978;&#33267;&#20250;&#21253;&#21547;&#37325;&#22797;&#30340;&#25110;&#21322;&#37325;&#22797;&#30340;&#26465;&#30446;&#12290;&#21363;&#20351;&#23427;&#27809;&#26377;&#20219;&#20309;&#27492;&#31867;&#30340;&#26126;&#26174;&#38382;&#39064;&#65292;&#39033;&#30446;&#20043;&#38388;&#20063;&#36890;&#24120;&#20250;&#26377;&#19981;&#24341;&#20154;&#27880;&#30446;&#30340;&#20114;&#30456;&#20381;&#36182;&#8212;&#24517;&#39035;&#26377;&#38142;&#25509;&#65292;&#20294;&#26159;&#27809;&#26377;&#8212;&#22240;&#20026;&#19982;&#20851;&#32852;&#30340;&#39033;&#30446;&#28155;&#21152;&#30340;&#26102;&#38388;&#30456;&#24046;&#19968;&#24180;&#12290;</p><p>FAQ&#31649;&#29702;&#21592;&#30340;&#35282;&#33394;&#26159;&#21452;&#37325;&#30340;&#12290;&#39318;&#20808;&#65292;&#36890;&#36807;&#33267;&#23569;&#23545;&#25152;&#26377;&#38382;&#39064;&#30340;&#26631;&#39064;&#20445;&#25345;&#29087;&#24713;&#65292;&#22905;&#32500;&#25252;&#20102;FAQ&#30340;&#25972;&#20307;&#36136;&#37327;&#65292;&#36825;&#26679;&#27599;&#24403;&#26377;&#20154;&#28155;&#21152;&#30340;&#26032;&#26465;&#30446;&#19982;&#21407;&#26469;&#30340;&#26465;&#30446;&#37325;&#22797;&#25110;&#32773;&#30456;&#20851;&#65292;&#21487;&#20197;&#20316;&#20986;&#21512;&#36866;&#30340;&#35843;&#25972;&#12290;&#20854;&#27425;&#65292;&#22905;&#20851;&#27880;&#30528;&#39033;&#30446;&#30340;&#37038;&#20214;&#21015;&#34920;&#21644;&#20854;&#20182;&#35770;&#22363;&#20013;&#37325;&#22797;&#21457;&#29983;&#30340;&#38382;&#39064;&#25110;&#30097;&#38382;&#65292;&#24182;&#26681;&#25454;&#36825;&#20123;&#36755;&#20837;&#32534;&#20889;&#26032;&#30340;FAQ&#26465;&#30446;&#12290;&#21518;&#19968;&#39033;&#24037;&#20316;&#21487;&#33021;&#38750;&#24120;&#22797;&#26434;&#65306;&#24517;&#39035;&#33021;&#32039;&#36319;&#32447;&#32034;&#65292;&#35782;&#21035;&#20986;&#20854;&#20013;&#30340;&#26680;&#24515;&#38382;&#39064;&#65292;&#21457;&#34920;&#19968;&#20010;&#25552;&#35758;FAQ&#26465;&#30446;&#65292;&#32452;&#21512;&#26469;&#33258;&#20854;&#20182;&#20154;&#30340;&#35780;&#35770;&#65288;&#22240;&#20026;FAQ&#31649;&#29702;&#21592;&#19981;&#21487;&#33021;&#26159;FAQ&#21253;&#21547;&#30340;&#25152;&#26377;&#20027;&#39064;&#30340;&#19987;&#23478;&#65289;&#65292;&#24182;&#24863;&#30693;&#20309;&#26102;&#32467;&#26463;&#36825;&#20010;&#36807;&#31243;&#24182;&#23558;&#20854;&#28155;&#21152;&#21040;FAQ&#12290;</p><p>FAQ&#31649;&#29702;&#21592;&#36890;&#24120;&#20063;&#20250;&#25104;&#20026;FAQ&#26684;&#24335;&#30340;&#40664;&#35748;&#19987;&#23478;&#12290;&#26377;&#35768;&#22810;&#20445;&#25345;FAQ&#32467;&#26500;&#30340;&#23567;&#32454;&#33410;&#65288;&#35265;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="growth.html#all-as-archives" title="&#23558;&#25152;&#26377;&#30340;&#36164;&#28304;&#35270;&#20026;&#24402;&#26723;">the section called &#8220;&#23558;&#25152;&#26377;&#30340;&#36164;&#28304;&#35270;&#20026;&#24402;&#26723;&#8221;</a>&#65289;&#65307;&#24403;&#26576;&#20154;&#32534;&#36753;&#20102;FAQ&#65292;&#20182;&#20204;&#21487;&#33021;&#20250;&#24536;&#35760;&#36825;&#20123;&#32454;&#33410;&#12290;&#20294;&#21482;&#35201;FAQ&#31649;&#29702;&#21592;&#33021;&#22815;&#22312;&#20043;&#21518;&#26597;&#28431;&#34917;&#32570;&#65292;&#36825;&#26679;&#20415;&#27809;&#26377;&#20219;&#20309;&#38382;&#39064;&#12290;</p><p>&#35768;&#22810;&#33258;&#30001;&#36719;&#20214;&#21487;&#20197;&#29992;&#20110;&#36741;&#21161;&#32500;&#25252;FAQ&#30340;&#36807;&#31243;&#12290;&#21482;&#35201;&#33021;&#22815;&#20445;&#35777;FAQ&#30340;&#36136;&#37327;&#65292;&#23601;&#21487;&#20197;&#36873;&#19968;&#20010;&#26469;&#20351;&#29992;&#65292;&#20294;&#26159;&#35201;&#36991;&#20813;&#36807;&#24230;&#33258;&#21160;&#21270;&#12290;&#19968;&#20123;&#39033;&#30446;&#35797;&#22270;&#23436;&#20840;&#33258;&#21160;&#21270;FAQ&#32500;&#25252;&#30340;&#36807;&#31243;&#65292;&#20351;&#29992;&#31867;&#20284;wiki&#30340;&#27169;&#24335;&#20801;&#35768;&#27599;&#20010;&#20154;&#36129;&#29486;&#21644;&#32534;&#36753;FAQ&#26465;&#30446;&#65288;&#35265;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="wikis.html" title="Wikis">the section called &#8220;Wikis&#8221;</a>&#65289;&#12290;&#25105;&#26366;&#32463;&#36935;&#21040;&#36807;&#22312;Faq-O-Matic&#19978;&#21457;&#29983;&#30340;&#36825;&#31181;&#24773;&#20917;&#65288;<a class="ulink" href="http://faqomatic.sourceforge.net/" target="_top">http://faqomatic.sourceforge.net/</a>&#65289;&#65292;&#23613;&#31649;&#25105;&#30475;&#21040;&#21407;&#22240;&#20165;&#20165;&#26159;&#23545;Faq-O-Matic&#36229;&#20986;&#26412;&#26469;&#30446;&#30340;&#30340;&#28389;&#29992;&#12290;&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#65292;&#34429;&#28982;&#23436;&#20840;&#30340;&#20998;&#24067;&#24335;FAQ&#32500;&#25252;&#21487;&#20197;&#20943;&#23569;&#39033;&#30446;&#30340;&#36127;&#25285;&#65292;&#20294;&#20063;&#20250;&#23548;&#33268;&#36739;&#24046;&#30340;FAQ&#12290;&#27809;&#26377;&#20154;&#20855;&#22791;&#25972;&#20010;FAQ&#30340;&#24191;&#27867;&#35270;&#37326;&#65292;&#27809;&#26377;&#20154;&#27880;&#24847;&#21040;&#20102;&#21738;&#20010;&#26465;&#30446;&#38656;&#35201;&#26356;&#26032;&#25110;&#21464;&#24471;&#23436;&#20840;&#19981;&#21487;&#29992;&#65292;&#27599;&#20010;&#20154;&#30475;&#21040;&#30340;&#37117;&#26159;&#23396;&#31435;&#30340;&#26465;&#30446;&#12290;&#32467;&#26524;&#26159;FAQ&#32463;&#24120;&#20250;&#26080;&#27861;&#20026;&#29992;&#25143;&#25552;&#20379;&#20182;&#20204;&#25152;&#38656;&#35201;&#26597;&#25214;&#30340;&#19996;&#35199;&#65292;&#29978;&#33267;&#20250;&#35823;&#23548;&#20182;&#20204;&#12290;&#24744;&#21487;&#20197;&#20351;&#29992;&#20219;&#20309;&#24517;&#39035;&#30340;&#24037;&#20855;&#32500;&#25252;&#39033;&#30446;FAQ&#65292;&#20294;&#26159;&#19981;&#35201;&#22240;&#20026;&#24037;&#20855;&#20415;&#21033;&#24615;&#30340;&#35825;&#24785;&#32780;&#25439;&#23475;FAQ&#30340;&#36136;&#37327;&#12290;</p><p>&#35265;Sean Michael Kerner&#22312;<a class="ulink" href="http://osdir.com/Article1722.phtml" target="_top">http://osdir.com/Article1722.phtml</a>&#30340;&#25991;&#31456;<em class="citetitle">The FAQs on
FAQs</em>&#65292;&#25551;&#36848;&#21644;&#35780;&#20272;&#20102;&#24320;&#28304;FAQ&#32500;&#25252;&#24037;&#20855;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2809" href="#idp2809" class="para">27</a>] </sup>IssueZilla&#23601;&#26159;&#25105;&#20204;&#20351;&#29992;&#30340;&#38382;&#39064;&#36319;&#36394;&#31995;&#32479;&#65307;&#23427;&#26159;BugZilla&#30340;&#21518;&#32487;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="managing-volunteers.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="transitions.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#36716;&#21270;</td></tr></table></div></body></html>
