<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="web-site.html" title="&#32593;&#31449;"><link rel="next" href="consensus-democracy.html" title="&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="web-site.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="consensus-democracy.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;"><div class="titlepage"><div><div><h2 class="title"><a name="social-infrastructure"></a>Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="social-infrastructure.html#benevolent-dictator">&#24904;&#21892;&#29420;&#35009;&#32773;</a></span></dt><dd><dl><dt><span class="sect2"><a href="social-infrastructure.html#benevolent-dictator-qualifications">&#35841;&#21487;&#20197;&#25104;&#20026;&#19968;&#20010;&#24904;&#21892;&#29420;&#35009;&#32773;&#65311;</a></span></dt></dl></dd><dt><span class="sect1"><a href="consensus-democracy.html">&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;</a></span></dt><dd><dl><dt><span class="sect2"><a href="consensus-democracy.html#version-control-relaxation">&#29256;&#26412;&#25511;&#21046;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#25918;&#36731;&#26494;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#voting">&#22914;&#26524;&#26080;&#27861;&#36798;&#25104;&#20849;&#35782;&#65292;&#37027;&#20040;&#34920;&#20915;&#65281;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#when-to-vote">&#20309;&#26102;&#34920;&#20915;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#electorate">&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#polls">&#27665;&#24847;&#35843;&#26597;&#19982;&#34920;&#20915;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#veto">&#21542;&#20915;&#26435;</a></span></dt></dl></dd><dt><span class="sect1"><a href="written-rules.html">&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#26377;&#20851;&#33258;&#30001;&#36719;&#20214;&#65292;&#20154;&#20204;&#32463;&#24120;&#38382;&#21040;&#30340;&#31532;&#19968;&#20010;&#38382;&#39064;&#26159;&#65306;&#8220;&#23427;&#33021;&#34892;&#21527;&#65311;&#22914;&#20309;&#20445;&#25345;&#39033;&#30446;&#19968;&#30452;&#36816;&#34892;&#65311;&#35841;&#26469;&#20570;&#20915;&#23450;&#65311;&#8221;&#25105;&#19968;&#30452;&#23545;&#20851;&#20110;&#30693;&#35782;&#30028;&#31934;&#21270;&#12289;&#21512;&#20316;&#31934;&#31070;&#12289;&#20195;&#30721;&#20250;&#35828;&#35805;&#27492;&#31867;&#30340;&#24179;&#28129;&#22238;&#22797;&#26080;&#27861;&#24863;&#21040;&#28385;&#24847;&#12290;&#20107;&#23454;&#26159;&#36825;&#20010;&#38382;&#39064;&#24456;&#38590;&#22238;&#31572;&#12290;&#30693;&#35782;&#30028;&#31934;&#21270;&#12289;&#21512;&#20316;&#31934;&#31070;&#21644;&#36816;&#34892;&#20195;&#30721;&#21482;&#26159;&#20854;&#20013;&#30340;&#19968;&#37096;&#20998;&#65292;&#20294;&#23427;&#20204;&#23545;&#20110;&#35299;&#37322;&#26085;&#22797;&#19968;&#26085;&#30340;&#39033;&#30446;&#36816;&#36716;&#36129;&#29486;&#19981;&#22810;&#65292;&#23545;&#20110;&#22914;&#20309;&#35299;&#20915;&#20914;&#31361;&#20160;&#20040;&#20063;&#27809;&#35828;&#12290;</p><p>&#26412;&#31456;&#23581;&#35797;&#23637;&#31034;&#25903;&#25345;&#25104;&#21151;&#39033;&#30446;&#30340;&#20849;&#21516;&#32467;&#26500;&#12290; &#8220;&#25104;&#21151;&#8221;&#19981;&#20165;&#20165;&#25351;&#30340;&#25216;&#26415;&#36136;&#37327;&#26041;&#38754;&#65292;&#32780;&#19988;&#20063;&#21253;&#21547;&#20102;&#36816;&#34892;&#20581;&#24247;&#29366;&#20917;&#21644;&#29983;&#23384;&#24615;&#12290;&#36816;&#34892;&#20581;&#24247;&#29366;&#20917;&#26159;&#25351;&#39033;&#30446;&#23558;&#26032;&#20195;&#30721;&#21644;&#26032;&#24320;&#21457;&#32773;&#21560;&#25910;&#36827;&#26469;&#65292;&#24182;&#23545;&#21040;&#26469;&#30340;bug&#36127;&#36131;&#30340;&#25345;&#32493;&#33021;&#21147;&#12290;&#29983;&#23384;&#24615;&#26159;&#39033;&#30446;&#29420;&#31435;&#20110;&#20219;&#20309;&#21333;&#29420;&#21442;&#19982;&#32773;&#25110;&#36190;&#21161;&#21830;&#32780;&#23384;&#22312;&#30340;&#33021;&#21147;&#8212;&#32771;&#34385;&#19968;&#19979;&#22914;&#26524;&#39033;&#30446;&#25152;&#26377;&#30340;&#21019;&#22987;&#25104;&#21592;&#31163;&#24320;&#21518;&#39033;&#30446;&#32487;&#32493;&#36816;&#20316;&#30340;&#21487;&#33021;&#24615;&#12290;&#25216;&#26415;&#25104;&#21151;&#19981;&#38590;&#23454;&#29616;&#65292;&#20294;&#26159;&#22914;&#26524;&#27809;&#26377;&#20581;&#22766;&#30340;&#24320;&#21457;&#32773;&#22522;&#30784;&#21644;&#31038;&#20250;&#22522;&#30784;&#65292;&#19968;&#20010;&#39033;&#30446;&#23601;&#19981;&#33021;&#22788;&#29702;&#30001;&#21021;&#22987;&#30340;&#25104;&#21151;&#24102;&#26469;&#30340;&#25104;&#38271;&#65292;&#25110;&#32773;&#26377;&#39749;&#21147;&#20010;&#20307;&#30340;&#31163;&#24320;&#12290;</p><p>&#33719;&#21462;&#27492;&#31867;&#25104;&#21151;&#26377;&#24456;&#22810;&#26041;&#27861;&#12290;&#26377;&#20123;&#28041;&#21450;&#27491;&#24335;&#30340;&#31649;&#29702;&#32467;&#26500;&#65292;&#36890;&#36807;&#21738;&#20123;&#20105;&#35770;&#34987;&#35299;&#20915;&#12289;&#26032;&#24320;&#21457;&#32773;&#34987;&#36992;&#35831;&#21152;&#20837;&#65288;&#26377;&#26102;&#26159;&#31163;&#24320;&#65289;&#21644;&#35745;&#21010;&#30340;&#26032;&#29305;&#34892;&#31561;&#31561;&#12290;&#36824;&#26377;&#19968;&#20123;&#28041;&#21450;&#19981;&#22826;&#27491;&#24335;&#30340;&#32467;&#26500;&#65292;&#20294;&#38656;&#35201;&#26356;&#26377;&#24847;&#35782;&#30340;&#33258;&#25105;&#20811;&#21046;&#65292;&#26469;&#20135;&#29983;&#19968;&#31181;&#20154;&#20204;&#21487;&#20197;&#20381;&#36182;&#30340;&#27491;&#30452;&#27675;&#22260;&#65292;&#20316;&#20026;<span class="foreignphrase"><em class="foreignphrase">&#20107;&#23454;&#19978;&#30340;</em></span>&#31649;&#29702;&#24418;&#24335;&#12290;&#20004;&#31181;&#26041;&#24335;&#37117;&#20135;&#29983;&#30456;&#21516;&#30340;&#32467;&#26524;&#65306;&#19968;&#31181;&#30001;&#26469;&#24050;&#20037;&#30340;&#27704;&#24658;&#24863;&#35273;&#65292;&#30001;&#25152;&#26377;&#21442;&#19982;&#32773;&#37117;&#20805;&#20998;&#29702;&#35299;&#30340;&#20064;&#24815;&#21644;&#31243;&#24207;&#20316;&#20026;&#25903;&#25745;&#12290;&#36825;&#20123;&#29305;&#24615;&#22312;&#33258;&#25105;&#32452;&#32455;&#30340;&#31995;&#32479;&#20013;&#29978;&#33267;&#27604;&#38598;&#20013;&#25511;&#21046;&#30340;&#31995;&#32479;&#26356;&#37325;&#35201;&#65292;&#27599;&#20010;&#20154;&#37117;&#30693;&#36947;&#19968;&#20010;&#22351;&#33529;&#26524;&#21487;&#20197;&#27585;&#25481;&#19968;&#26742;&#65292;&#21363;&#20351;&#21482;&#26159;&#19968;&#20250;&#20799;&#12290;</p><div class="sect1" title="&#20998;&#21449;&#33021;&#21147;&#65288;forkability&#65289;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="forkability"></a>&#20998;&#21449;&#33021;&#21147;&#65288;forkability&#65289;</h2></div></div></div><p>&#33021;&#23558;&#24320;&#21457;&#32773;&#32465;&#23450;&#22312;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#30340;&#24517;&#38656;&#32452;&#25104;&#37096;&#20998;&#65292;&#33021;&#35753;&#20182;&#20204;&#22312;&#24517;&#35201;&#26102;&#24895;&#24847;&#20316;&#20986;&#22949;&#21327;&#65292;&#26159;&#20195;&#30721;&#30340;<em class="firstterm">&#20998;&#21449;&#33021;&#21147;</em>&#65306;&#20063;&#23601;&#26159;&#20219;&#20309;&#20154;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#25335;&#36125;&#24182;&#20351;&#20043;&#25104;&#20026;&#19968;&#20010;&#31454;&#20105;&#39033;&#30446;&#30340;&#33021;&#21147;&#65292;&#34987;&#31216;&#20026;<em class="firstterm">&#20998;&#21449;</em>&#12290;&#24618;&#24322;&#30340;&#26159;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#20013;&#20998;&#21449;<span class="emphasis"><em>&#21487;&#33021;&#24615;</em></span>&#20855;&#22791;&#27604;&#23454;&#38469;&#30340;&#20998;&#21449;&#26356;&#22823;&#30340;&#21160;&#21147;&#65292;&#24456;&#23569;&#20250;&#21457;&#29983;&#12290;&#22240;&#20026;&#20998;&#21449;&#23545;&#20110;&#27599;&#20010;&#20154;&#37117;&#19981;&#22909;&#65288;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="forks.html" title="&#20998;&#21449;">the section called &#8220;&#20998;&#21449;&#8221;</a>&#20250;&#35299;&#37322;&#35814;&#32454;&#21407;&#22240;&#65289;&#65292;&#20998;&#21449;&#30340;&#23041;&#32961;&#36234;&#22823;&#65292;&#36234;&#26399;&#26395;&#30340;&#20154;&#23601;&#36234;&#20250;&#22949;&#21327;&#21435;&#36991;&#20813;&#23427;&#12290;</p><p>&#20998;&#21449;&#65292;&#26356;&#30830;&#20999;&#35828;&#26159;&#20998;&#21449;&#30340;&#21487;&#33021;&#24615;&#65292;&#26159;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20013;&#27809;&#26377;&#30495;&#27491;&#29420;&#35009;&#32773;&#30340;&#21407;&#22240;&#12290;&#32771;&#34385;&#21040;&#22312;&#19968;&#20010;&#29305;&#23450;&#24320;&#28304;&#39033;&#30446;&#20013;&#21548;&#21040;&#26576;&#20154;&#34987;&#31216;&#20026;&#8220;&#29420;&#35009;&#32773;&#8221;&#25110;&#32773;&#8220;&#26292;&#21531;&#8221;&#26159;&#22810;&#20040;&#24120;&#35265;&#65292;&#36825;&#30475;&#36215;&#26469;&#26159;&#19968;&#20010;&#20196;&#20154;&#24778;&#35766;&#30340;&#26029;&#35328;&#12290;&#20294;&#26159;&#27492;&#31867;&#26292;&#25919;&#26159;&#29305;&#21035;&#30340;&#65292;&#19982;&#19968;&#33324;&#24847;&#20041;&#19978;&#30340;&#23383;&#38754;&#29702;&#35299;&#38750;&#24120;&#19981;&#21516;&#12290;&#24819;&#35937;&#19968;&#19979;&#19968;&#20010;&#22269;&#29579;&#30340;&#33251;&#27665;&#21487;&#20197;&#22312;&#20219;&#20309;&#26102;&#20505;&#22797;&#21046;&#25972;&#20010;&#29579;&#22269;&#65292;&#24182;&#25644;&#36807;&#21435;&#25353;&#33258;&#24049;&#28385;&#24847;&#30340;&#35268;&#21017;&#32479;&#27835;&#12290;&#36825;&#19982;&#22269;&#29579;&#26080;&#35770;&#22914;&#20309;&#20570;&#65292;&#33251;&#27665;&#37117;&#26080;&#27861;&#31163;&#24320;&#30340;&#24773;&#20917;&#26159;&#22810;&#20040;&#30340;&#19981;&#21516;&#65311;</p><p>&#36825;&#20063;&#26159;&#20026;&#20160;&#20040;&#21363;&#20351;&#39033;&#30446;&#19981;&#26159;&#23436;&#20840;&#25353;&#29031;&#27665;&#20027;&#26041;&#24335;&#32452;&#32455;&#26102;&#65292;&#22312;&#23454;&#36341;&#20013;&#65292;&#37325;&#35201;&#20915;&#23450;&#36824;&#26159;&#36890;&#36807;&#27665;&#20027;&#26041;&#24335;&#20135;&#29983;&#12290;&#21487;&#22797;&#21046;&#24615;&#26263;&#25351;&#20102;&#20998;&#21449;&#33021;&#21147;&#65307;&#20998;&#21449;&#33021;&#21147;&#26263;&#25351;&#20102;&#24847;&#35265;&#19968;&#33268;&#12290;&#20063;&#21487;&#33021;&#26159;&#27599;&#20010;&#20154;&#37117;&#24076;&#26395;&#19982;&#19968;&#20010;&#39046;&#34966;&#19981;&#21516;&#65288;&#26368;&#26377;&#21517;&#30340;&#20363;&#23376;&#26159;&#22312;Linux&#20869;&#26680;&#24320;&#21457;&#20013;&#30340;Linus Torvalds&#65289;&#65292;&#20294;&#37027;&#26159;&#22240;&#20026;&#20182;&#20204;<span class="emphasis"><em>&#36873;&#25321;</em></span>&#22914;&#27492;&#65292;&#20197;&#19968;&#31181;&#38750;&#24868;&#19990;&#23241;&#20439;&#21644;&#38750;&#37034;&#24694;&#30340;&#26041;&#24335;&#12290;&#26292;&#21531;&#27809;&#26377;&#39033;&#30446;&#30340;&#23450;&#36523;&#27861;&#12290;&#25152;&#26377;&#24320;&#28304;&#35768;&#21487;&#35777;&#37117;&#26377;&#19968;&#20010;&#20851;&#38190;&#29305;&#24615;&#65292;&#20063;&#23601;&#26159;&#22312;&#20195;&#30721;&#22914;&#20309;&#21464;&#26356;&#25110;&#20351;&#29992;&#19978;&#27809;&#26377;&#32473;&#20219;&#20309;&#32452;&#32455;&#26356;&#22810;&#30340;&#26435;&#21147;&#12290;&#22914;&#26524;&#19968;&#20010;&#29420;&#35009;&#32773;&#31361;&#28982;&#24320;&#22987;&#20570;&#20102;&#19968;&#20010;&#22351;&#30340;&#20915;&#23450;&#65292;&#23601;&#20174;&#27492;&#19981;&#24471;&#23433;&#23425;&#65292;&#32039;&#25509;&#30528;&#23601;&#26159;&#36896;&#21453;&#21644;&#20998;&#21449;&#12290;&#38500;&#38750;&#65292;&#24403;&#28982;&#65292;&#24456;&#22810;&#26102;&#20505;&#19981;&#20250;&#21040;&#36825;&#19968;&#27493;&#65292;&#22240;&#20026;&#29420;&#35009;&#32773;&#20250;&#39318;&#20808;&#22949;&#21327;&#12290;</p><p>&#20294;&#20165;&#20165;&#22240;&#20026;&#20998;&#21449;&#33021;&#21147;&#25918;&#32622;&#20102;&#19968;&#20010;&#19978;&#19968;&#20010;&#20154;&#22312;&#19968;&#20010;&#39033;&#30446;&#20013;&#21457;&#25381;&#22810;&#23569;&#21147;&#37327;&#30340;&#19978;&#38480;&#65292;&#24182;&#19981;&#24847;&#21619;&#30528;&#39033;&#30446;&#30340;&#31649;&#29702;&#26041;&#24335;&#27809;&#26377;&#22826;&#22823;&#30340;&#21306;&#21035;&#12290;&#20320;&#19981;&#20250;&#24076;&#26395;&#27599;&#20010;&#20915;&#23450;&#37117;&#26159;&#26576;&#20154;&#35201;&#32771;&#34385;&#20998;&#21449;&#21518;&#30340;&#32467;&#26524;&#12290;&#37027;&#26679;&#20250;&#35753;&#20154;&#36805;&#36895;&#30130;&#20518;&#65292;&#20007;&#22833;&#30495;&#27491;&#24037;&#20316;&#30340;&#33021;&#37327;&#12290;&#19979;&#38754;&#20004;&#20010;&#23567;&#33410;&#20250;&#20180;&#32454;&#26816;&#26597;&#32452;&#32455;&#39033;&#30446;&#24179;&#31283;&#20570;&#20986;&#22823;&#22810;&#25968;&#20915;&#23450;&#30340;&#19981;&#21516;&#26041;&#27861;&#12290;&#36825;&#20004;&#20010;&#37117;&#26159;&#26497;&#31471;&#29702;&#24819;&#30340;&#20363;&#23376;&#65307;&#35768;&#22810;&#39033;&#30446;&#20250;&#22788;&#20110;&#20013;&#38388;&#29366;&#24577;&#12290;</p></div></div><div class="simplesect"><div class="titlepage"></div></div><div class="sect1" title="&#24904;&#21892;&#29420;&#35009;&#32773;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="benevolent-dictator"></a>&#24904;&#21892;&#29420;&#35009;&#32773;</h2></div></div></div><p><em class="firstterm">&#24904;&#21892;&#29420;&#35009;&#32773;</em>&#27169;&#22411;&#36825;&#19968;&#31216;&#21495;&#30830;&#23454;&#21517;&#21103;&#20854;&#23454;&#65306;&#26368;&#32456;&#30340;&#20915;&#23450;&#26435;&#23436;&#20840;&#21462;&#20915;&#20110;&#19968;&#20010;&#20154;&#65292;&#22240;&#20026;&#20854;&#20154;&#26684;&#21644;&#32463;&#39564;&#30340;&#21147;&#37327;&#65292;&#20182;&#34987;&#35748;&#20026;&#21487;&#20197;&#26126;&#26234;&#30340;&#36816;&#29992;&#36825;&#20010;&#26435;&#21147;&#12290;</p><p>&#23613;&#31649;&#8220;&#24904;&#21892;&#29420;&#35009;&#32773;&#8221;&#65288;<em class="firstterm">BD</em>&#65289;&#26159;&#36825;&#20010;&#35282;&#33394;&#30340;&#26631;&#20934;&#26415;&#35821;&#65292;&#20294;&#26159;&#26356;&#24212;&#35813;&#23558;&#20854;&#35270;&#20026;&#8220;&#31038;&#21306;&#35748;&#21487;&#30340;&#20210;&#35009;&#32773;&#8221;&#25110;&#8220;&#35009;&#21028;&#32773;&#8221;&#12290;&#36890;&#24120;&#26469;&#35828;&#65292;&#24904;&#21892;&#29420;&#35009;&#32773;&#24182;&#19981;&#20250;&#20316;&#20986;&#25152;&#26377;&#30340;&#12289;&#29978;&#33267;&#22823;&#22810;&#25968;&#30340;&#20915;&#23450;&#12290;&#19968;&#20010;&#20154;&#24456;&#38590;&#25317;&#26377;&#22312;&#39033;&#30446;&#25152;&#26377;&#39046;&#22495;&#20013;&#37117;&#33021;&#20570;&#20986;&#27491;&#30830;&#20915;&#23450;&#30340;&#19987;&#19994;&#25216;&#33021;&#65292;&#27605;&#31455;&#65292;&#22914;&#26524;&#23545;&#20110;&#39033;&#30446;&#30340;&#26041;&#21521;&#27809;&#26377;&#20219;&#20309;&#24433;&#21709;&#65292;&#26377;&#20215;&#20540;&#30340;&#24320;&#21457;&#32773;&#20063;&#19981;&#20250;&#22312;&#27492;&#20572;&#30041;&#12290;&#22240;&#27492;&#65292;&#24904;&#21892;&#29420;&#35009;&#32773;&#36890;&#24120;&#19981;&#20250;&#38750;&#24120;&#30340;&#29420;&#35009;&#12290;&#30456;&#21453;&#65292;&#20182;&#20204;&#20250;&#23613;&#21487;&#33021;&#30340;&#35753;&#20107;&#24773;&#22312;&#35752;&#35770;&#21644;&#23454;&#39564;&#20013;&#39034;&#20854;&#33258;&#28982;&#12290;&#20182;&#20204;&#33258;&#24049;&#20063;&#20250;&#21442;&#19982;&#35752;&#35770;&#65292;&#20294;&#26159;&#20316;&#20026;&#26576;&#39046;&#22495;&#30340;&#26222;&#36890;&#24320;&#21457;&#32773;&#65292;&#20182;&#20204;&#19968;&#33324;&#20250;&#23562;&#37325;&#25317;&#26377;&#26356;&#22810;&#19987;&#19994;&#30693;&#35782;&#30340;&#39046;&#22495;&#32500;&#25252;&#32773;&#12290;&#21482;&#26377;&#24403;&#26126;&#26174;&#26080;&#27861;&#24471;&#20986;&#32467;&#35770;&#26102;&#65292;&#32780;&#19988;&#22823;&#22810;&#25968;&#25104;&#21592;<span class="emphasis"><em>&#26399;&#26395;</em></span>&#26377;&#20154;&#33021;&#22815;&#25351;&#23548;&#20316;&#20986;&#20915;&#23450;&#65292;&#24182;&#35753;&#24320;&#21457;&#32487;&#32493;&#26102;&#65292;&#20182;&#20204;&#25165;&#20250;&#37319;&#21462;&#22362;&#23450;&#30340;&#31435;&#22330;&#24182;&#35828;&#8220;&#36825;&#26159;&#25105;&#20204;&#21069;&#36827;&#30340;&#36335;&#12290;&#8221;&#36991;&#20813;&#20351;&#29992;&#21629;&#20196;&#20316;&#20915;&#23450;&#26159;&#25152;&#26377;&#25104;&#21151;&#24904;&#21892;&#29420;&#35009;&#32773;&#20849;&#21516;&#30340;&#29305;&#24449;&#65307;&#20063;&#26159;&#20182;&#20204;&#35774;&#27861;&#20445;&#25345;&#36825;&#20010;&#35282;&#33394;&#30340;&#19968;&#20010;&#29702;&#30001;&#12290;</p><div class="simplesect"><div class="titlepage"></div></div><div class="sect2" title="&#35841;&#21487;&#20197;&#25104;&#20026;&#19968;&#20010;&#24904;&#21892;&#29420;&#35009;&#32773;&#65311;"><div class="titlepage"><div><div><h3 class="title"><a name="benevolent-dictator-qualifications"></a>&#35841;&#21487;&#20197;&#25104;&#20026;&#19968;&#20010;&#24904;&#21892;&#29420;&#35009;&#32773;&#65311;</h3></div></div></div><p>&#25104;&#20026;&#19968;&#20010;BD&#38656;&#35201;&#35768;&#22810;&#29305;&#24615;&#30340;&#32452;&#21512;&#12290;&#39318;&#20808;&#65292;&#35201;&#23545;&#33258;&#24049;&#22312;&#39033;&#30446;&#20013;&#30340;&#24433;&#21709;&#26377;&#32463;&#36807;&#20805;&#20998;&#30952;&#32451;&#30340;&#25935;&#24863;&#24615;&#65292;&#36825;&#26679;&#21487;&#20197;&#20445;&#35777;&#33258;&#25105;&#32422;&#26463;&#12290;&#22312;&#19968;&#20010;&#35752;&#35770;&#30340;&#26089;&#26399;&#38454;&#27573;&#65292;&#19968;&#23450;&#19981;&#33021;&#36807;&#20110;&#30830;&#23450;&#30340;&#34920;&#36798;&#33258;&#24049;&#30340;&#24847;&#35265;&#21644;&#32467;&#35770;&#65292;&#20197;&#33267;&#20110;&#35753;&#21035;&#20154;&#35273;&#24471;&#32487;&#32493;&#21457;&#29983;&#20998;&#27495;&#27627;&#26080;&#24847;&#24605;.&#20154;&#20204;&#24212;&#24403;&#33021;&#33258;&#30001;&#30340;&#25918;&#39134;&#24605;&#24819;&#65292;&#21363;&#20351;&#26159;&#24858;&#34850;&#30340;&#24819;&#27861;&#12290;BD&#20063;&#20250;&#19981;&#21487;&#36991;&#20813;&#30340;&#23649;&#23649;&#21457;&#34920;&#24858;&#34850;&#30340;&#24847;&#35265;&#65292;&#25152;&#20197;&#36825;&#20010;&#35282;&#33394;&#20063;&#24517;&#39035;&#20855;&#22791;&#35748;&#21487;&#21644;&#25215;&#35748;&#33258;&#24049;&#20316;&#20986;&#38169;&#35823;&#20915;&#23450;&#30340;&#33021;&#21147;&#8212;&#23613;&#31649;&#36825;&#26159;&#19968;&#20010;<span class="emphasis"><em>&#25152;&#26377;</em></span>&#20248;&#31168;&#24320;&#21457;&#32773;&#37117;&#24212;&#35813;&#20855;&#22791;&#30340;&#33021;&#21147;&#65292;&#20294;&#22914;&#26524;&#22905;&#35201;&#38271;&#26399;&#21574;&#22312;&#19968;&#20010;&#39033;&#30446;&#65292;&#36825;&#19968;&#28857;&#29305;&#21035;&#37325;&#35201;&#12290;&#20294;&#21306;&#21035;&#26159;BD&#26080;&#27861;&#26080;&#35270;&#20854;&#20449;&#35465;&#30340;&#38271;&#26399;&#25439;&#23475;&#12290;&#20294;&#36164;&#21382;&#23578;&#27973;&#30340;&#24320;&#21457;&#32773;&#19981;&#24517;&#22914;&#27492;&#35880;&#24910;&#65292;&#25152;&#20197;BD&#24517;&#39035;&#23545;&#25209;&#35780;&#25110;&#21453;&#23545;&#20915;&#23450;&#30340;&#35821;&#21477;&#23567;&#24515;&#25514;&#36766;&#65292;&#23545;&#20110;&#35789;&#27719;&#30340;&#20998;&#37327;&#21313;&#20998;&#25935;&#24863;&#65292;&#19981;&#20165;&#26159;&#25216;&#26415;&#19978;&#30340;&#65292;&#36824;&#21253;&#25324;&#24515;&#29702;&#30340;&#12290;</p><p>BD&#30340;&#25216;&#26415;&#25216;&#33021;<span class="emphasis"><em>&#19981;</em></span>&#38656;&#35201;&#36229;&#36234;&#39033;&#30446;&#20013;&#30340;&#25152;&#26377;&#20154;&#12290;&#20294;&#22905;&#23545;&#20110;&#33258;&#24049;&#30340;&#20195;&#30721;&#24037;&#20316;&#24517;&#39035;&#36275;&#22815;&#31934;&#36890;&#65292;&#20063;&#24517;&#39035;&#33021;&#22815;&#29702;&#35299;&#32771;&#34385;&#20013;&#30340;&#25152;&#26377;&#21464;&#26356;&#30340;&#35752;&#35770;&#65292;&#20294;&#36825;&#36824;&#19981;&#22815;&#12290;BD&#30340;&#20301;&#32622;&#24182;&#19981;&#26159;&#36890;&#36807;&#24656;&#24598;&#30340;&#32534;&#30721;&#25216;&#24039;&#33719;&#21462;&#25110;&#20445;&#25345;&#30340;&#12290;&#37325;&#35201;&#30340;<span class="emphasis"><em>&#26159;</em></span>&#23500;&#20110;&#32463;&#39564;&#21644;&#20840;&#23616;&#30340;&#35774;&#35745;&#24863;&#35273;&#8212;&#19981;&#24517;&#26159;&#26681;&#25454;&#35201;&#27714;&#29983;&#20135;&#22909;&#35774;&#35745;&#30340;&#33021;&#21147;&#65292;&#21482;&#38656;&#35201;&#26377;&#35782;&#21035;&#22909;&#35774;&#35745;&#30340;&#33021;&#21147;&#65292;&#26080;&#35770;&#26159;&#20160;&#20040;&#26469;&#28304;&#12290;</p><p>&#24904;&#21892;&#29420;&#35009;&#32773;&#32463;&#24120;&#26159;&#39033;&#30446;&#30340;&#21019;&#24314;&#32773;&#65292;&#20294;&#36825;&#21482;&#26159;&#19968;&#31181;&#20851;&#31995;&#65292;&#32780;&#19981;&#26159;&#21407;&#22240;&#12290;&#36825;&#31867;&#29305;&#24615;&#35753;&#19968;&#20010;&#20154;&#33021;&#22815;&#25104;&#21151;&#30340;&#24320;&#22987;&#19968;&#20010;&#39033;&#30446;&#8212;&#25216;&#26415;&#33021;&#21147;&#12289;&#35828;&#26381;&#21035;&#20154;&#21152;&#20837;&#30340;&#33021;&#21147;&#31561;&#31561;&#8212;&#20063;&#37117;&#26159;BD&#25152;&#38656;&#35201;&#30340;&#12290;&#24403;&#28982;&#65292;&#21019;&#24314;&#32773;&#24320;&#22987;&#23601;&#33258;&#21160;&#26377;&#20102;&#30456;&#20851;&#30340;&#36164;&#21382;&#65292;&#22312;&#25104;&#20026;&#24904;&#21892;&#29420;&#35009;&#32773;&#30340;&#26041;&#27861;&#20013;&#65292;&#26159;&#25152;&#25285;&#24515;&#30340;&#38459;&#21147;&#26368;&#23567;&#30340;&#12290;</p><p>&#35831;&#35760;&#20303;&#65292;&#28508;&#22312;&#30340;&#20998;&#21449;&#20250;&#20197;&#20004;&#31181;&#26041;&#24335;&#20986;&#29616;&#12290;&#19968;&#20010;BD&#21487;&#20197;&#21644;&#20854;&#20182;&#20154;&#19968;&#26679;&#20998;&#20986;&#19968;&#20010;&#39033;&#30446;&#65292;&#30830;&#23454;&#26377;&#20123;&#20154;&#24050;&#32463;&#36825;&#26679;&#20570;&#20102;&#65292;&#36825;&#26159;&#22240;&#20026;&#20182;&#20204;&#35273;&#24471;&#35201;&#23558;&#39033;&#30446;&#24102;&#39046;&#21040;&#22823;&#22810;&#25968;&#39033;&#30446;&#25104;&#21592;&#19981;&#24076;&#26395;&#30340;&#26041;&#24335;&#20013;&#12290;&#22240;&#20026;&#21487;&#20998;&#21449;&#30340;&#33021;&#21147;&#65292;&#24904;&#21892;&#29420;&#35009;&#32773;&#26159;&#21542;&#26377;&#39033;&#30446;&#20027;&#26381;&#21153;&#22120;&#30340;root&#26435;&#38480;&#65288;&#31995;&#32479;&#31649;&#29702;&#21592;&#29305;&#26435;&#65289;&#24182;&#19981;&#37325;&#35201;&#12290;&#20154;&#20204;&#26377;&#26102;&#20505;&#20250;&#23558;&#26381;&#21153;&#22120;&#30340;&#25511;&#21046;&#33021;&#21147;&#24403;&#20570;&#23545;&#20110;&#19968;&#20010;&#39033;&#30446;&#30340;&#26435;&#21147;&#26681;&#28304;&#65292;&#20294;&#23454;&#38469;&#19978;&#36825;&#27627;&#19981;&#30456;&#24178;&#12290;&#23558;&#26576;&#26381;&#21153;&#22120;&#19978;&#26576;&#20154;&#30340;&#25552;&#20132;&#23494;&#30721;&#28155;&#21152;&#25110;&#21024;&#38500;&#30340;&#33021;&#21147;&#21482;&#20250;&#24433;&#21709;&#23384;&#25918;&#22312;&#37027;&#20010;&#26381;&#21153;&#22120;&#19978;&#30340;&#39033;&#30446;&#25335;&#36125;&#12290;&#23545;&#20110;&#27492;&#26435;&#21147;&#30340;&#38271;&#26399;&#28389;&#29992;&#65292;&#26080;&#35770;&#22905;&#26159;BD&#25110;&#20854;&#20182;&#20154;&#65292;&#37117;&#20250;&#33268;&#20351;&#24320;&#21457;&#36716;&#21040;&#20854;&#20182;&#26381;&#21153;&#22120;&#19978;&#12290;</p></div><p>&#26080;&#35770;&#20320;&#30340;&#39033;&#30446;&#26159;&#21542;&#23384;&#22312;&#19968;&#20010;&#24904;&#21892;&#29420;&#35009;&#32773;&#65292;&#25110;&#33021;&#22815;&#22312;&#19968;&#20010;&#36739;&#24369;&#30340;&#38598;&#20013;&#24335;&#31995;&#32479;&#19979;&#36816;&#34892;&#33391;&#22909;&#65292;&#37117;&#21313;&#20998;&#20381;&#36182;&#20110;&#35841;&#22312;&#25215;&#25285;&#36825;&#20010;&#35282;&#33394;&#12290;&#20316;&#20026;&#19968;&#20010;&#26222;&#36941;&#30340;&#35268;&#21017;&#65292;&#36890;&#24120;&#23545;&#27599;&#20010;&#20154;&#26469;&#35828;&#35841;&#26159;BD&#38750;&#24120;&#30340;&#26126;&#26174;&#65292;&#28982;&#21518;&#23601;&#20250;&#22914;&#27492;&#32487;&#32493;&#12290;&#20294;&#26159;&#22914;&#26524;&#27809;&#26377;&#26126;&#26174;&#30340;BD&#20505;&#36873;&#32773;&#65292;&#39033;&#30446;&#36890;&#24120;&#20250;&#20351;&#29992;&#20998;&#25955;&#30340;&#20915;&#31574;&#36807;&#31243;&#65292;&#36825;&#23601;&#26159;&#19979;&#20010;&#23567;&#33410;&#25152;&#25551;&#36848;&#30340;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="web-site.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="consensus-democracy.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#32593;&#31449; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;</td></tr></table></div></body></html>
