<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#36164;&#26009;&#26469;&#28304;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="preface.html" title="&#21069;&#35328;"><link rel="prev" href="audience.html" title="&#35841;&#24212;&#35813;&#35835;&#26412;&#20070;&#65311;"><link rel="next" href="acknowledgments.html" title="&#33268;&#35874;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#36164;&#26009;&#26469;&#28304;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="audience.html">Prev</a> </td><th width="60%" align="center">&#21069;&#35328;</th><td width="20%" align="right"> <a accesskey="n" href="acknowledgments.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#36164;&#26009;&#26469;&#28304;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sources"></a>&#36164;&#26009;&#26469;&#28304;</h2></div></div></div><p>&#27492;&#20070;&#20013;&#30340;&#24456;&#22810;&#21407;&#22987;&#26448;&#26009;&#37117;&#26159;&#26469;&#33258;Subversion&#39033;&#30446;&#65288;<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>&#65289;&#30340;&#20116;&#24180;&#24037;&#20316;&#12290;Subversion&#26159;&#19968;&#20010;&#20174;&#38646;&#24320;&#22987;&#30340;&#24320;&#28304;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#30446;&#30340;&#22312;&#20110;&#26367;&#20195;CVS&#25104;&#20026;&#24320;&#28304;&#31038;&#21306;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;<span class="foreignphrase"><em class="foreignphrase">&#20107;&#23454;&#19978;</em></span>&#30340;&#36873;&#25321;&#12290;&#36825;&#20010;&#39033;&#30446;&#30001;&#25105;&#30340;&#38599;&#20027;CollabNet&#20844;&#21496;&#65288;<a class="ulink" href="http://www.collab.net/" target="_top">http://www.collab.net/</a>&#65289;&#22312;2000&#24180;&#21021;&#21457;&#36215;&#65292;&#24863;&#35874;&#19978;&#24093;CollaNet&#20174;&#19968;&#24320;&#22987;&#23601;&#27491;&#30830;&#29702;&#35299;&#22914;&#20309;&#23558;&#23427;&#20316;&#20026;&#19968;&#20010;&#20998;&#24067;&#24191;&#27867;&#30340;&#21512;&#20316;&#24615;&#39033;&#30446;&#26469;&#36816;&#20316;&#12290;&#20174;&#19968;&#24320;&#22987;&#25105;&#20204;&#23601;&#21560;&#25910;&#20102;&#24456;&#22810;&#30340;&#24535;&#24895;&#32773;&#65292;&#29616;&#22312;&#36825;&#20010;&#39033;&#30446;&#26377;50&#22810;&#21517;&#24320;&#21457;&#32773;&#65292;&#20854;&#20013;&#21482;&#26377;&#23569;&#25968;&#26159;CollabNet&#30340;&#38599;&#21592;&#12290;</p><p>&#22312;&#24456;&#22810;&#26041;&#38754;Subversion&#37117;&#26159;&#24320;&#28304;&#36719;&#20214;&#39033;&#30446;&#30340;&#19968;&#20010;&#20856;&#22411;&#20363;&#23376;&#65292;&#26368;&#32456;&#25105;&#22312;&#19978;&#38754;&#33457;&#36153;&#30340;&#31934;&#21147;&#36828;&#36229;&#20986;&#25105;&#26368;&#21021;&#30340;&#39044;&#24819;&#12290;&#21478;&#19968;&#26041;&#38754;&#20063;&#26159;&#20986;&#20110;&#20415;&#21033;&#65306;&#26080;&#35770;&#20309;&#26102;&#25105;&#38656;&#35201;&#19968;&#20010;&#29616;&#35937;&#30340;&#26679;&#26412;&#65292;&#25105;&#30340;&#33041;&#28023;&#37324;&#20415;&#20250;&#31435;&#21363;&#28014;&#29616;&#20986;Subversion&#20013;&#30340;&#19968;&#20010;&#23454;&#20363;&#12290;&#20294;&#36825;&#20063;&#20107;&#20851;&#39564;&#35777;&#12290;&#34429;&#28982;&#25105;&#19981;&#21516;&#31243;&#24230;&#22320;&#21442;&#19982;&#20102;&#20854;&#20182;&#20960;&#20010;&#24320;&#28304;&#39033;&#30446;&#65292;&#24182;&#19988;&#20250;&#21644;&#24456;&#22810;&#30340;&#26379;&#21451;&#21644;&#30456;&#20851;&#30340;&#20154;&#20132;&#35848;&#65292;&#20294;&#25105;&#24456;&#24555;&#23601;&#21457;&#29616;&#65292;&#24403;&#20889;&#25104;&#25991;&#23383;&#26102;&#65292;&#25152;&#26377;&#30340;&#26029;&#35328;&#37117;&#38656;&#35201;&#32463;&#36807;&#20107;&#23454;&#30340;&#26816;&#39564;&#12290;&#25105;&#19981;&#24819;&#20165;&#20165;&#26681;&#25454;&#25105;&#35835;&#21040;&#30340;&#23427;&#20204;&#20844;&#24320;&#37038;&#20214;&#21015;&#34920;&#19978;&#21015;&#20986;&#30340;&#25991;&#26723;&#32780;&#23545;&#20107;&#20214;&#21457;&#34920;&#24847;&#35265;&#12290;&#22914;&#26524;&#26377;&#20154;&#24819;&#29992;&#20197;&#19978;&#30340;&#26041;&#24335;&#23581;&#35797;Subversion&#65292;&#25105;&#30693;&#36947;&#65292;&#22905;&#22823;&#32422;&#21482;&#26377;50%&#30340;&#27491;&#30830;&#29575;&#65292;&#32780;&#21478;&#22806;50%&#26159;&#38169;&#35823;&#30340;&#12290;&#22240;&#27492;&#65292;&#24403;&#38656;&#35201;&#20174;&#19968;&#20010;&#25105;&#27809;&#26377;&#30452;&#25509;&#21442;&#19982;&#30340;&#39033;&#30446;&#25214;&#23547;&#28789;&#24863;&#25110;&#32773;&#23454;&#20363;&#26102;&#65292;&#25105;&#20250;&#25214;&#19968;&#20010;&#25105;&#20449;&#20219;&#24182;&#19988;&#20102;&#35299;&#20869;&#24773;&#30340;&#20154;&#65292;&#35753;&#20182;&#26469;&#35828;&#26126;&#39033;&#30446;&#30340;&#30495;&#23454;&#24773;&#20917;&#12290;</p><p>&#34429;&#28982;&#36807;&#21435;5&#24180;&#25105;&#19968;&#30452;&#22312;&#20570;Subversion&#65292;&#20294;&#25105;&#20174;&#20107;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#24050;&#26377;12&#20010;&#24180;&#22836;&#20102;&#12290;&#22240;&#32780;&#65292;&#20854;&#23427;&#19968;&#20123;&#39033;&#30446;&#20063;&#23545;&#26412;&#20070;&#26377;&#25152;&#24433;&#21709;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#33258;&#30001;&#36719;&#20214;&#22522;&#37329;&#20250;(Free Software Foundation)&#30340;GNU Emacs&#25991;&#26412;&#32534;&#36753;&#22120;&#39033;&#30446;&#65292;&#25105;&#22312;&#20854;&#20013;&#32500;&#25252;&#20102;&#20960;&#20010;&#23567;&#30340;&#36719;&#20214;&#21253;&#12290;</p></li><li class="listitem"><p>Concurrent Versions System (CVS)&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26159;&#25105;&#22312;1994&#8211;1995&#26399;&#38388;&#19982;Jim Blandy&#20840;&#21147;&#25237;&#20837;&#30340;&#19968;&#20010;&#39033;&#30446;&#65292;&#27492;&#21518;&#65292;&#25105;&#21482;&#26159;&#26029;&#26029;&#32493;&#32493;&#22320;&#21442;&#19982;&#36825;&#20010;&#39033;&#30446;&#30340;&#24037;&#20316;&#12290;</p></li><li class="listitem"><p>Apache&#36719;&#20214;&#22522;&#37329;&#20250;&#65288;Apache Software Foundation&#65289;&#30340;&#24320;&#28304;&#36719;&#20214;&#39033;&#30446;&#38598;&#65292;&#23588;&#20854;&#26159;Apache&#21487;&#31227;&#26893;&#36816;&#34892;&#24211;&#65288;Apache Portable Runtime (APR)&#21644;Apache HTTP&#26381;&#21153;&#22120;&#12290;</p></li><li class="listitem"><p>OpenOffice.org &#21150;&#20844;&#36719;&#20214;&#39033;&#30446;&#65292;Sleepycat&#36719;&#20214;&#20844;&#21496;&#30340;Berkeley Database&#39033;&#30446;&#65292;&#20197;&#21450;MySQL&#25968;&#25454;&#24211;&#39033;&#30446;&#65307;&#25105;&#20010;&#20154;&#24182;&#26410;&#21442;&#19982;&#36825;&#20123;&#39033;&#30446;&#30340;&#24320;&#21457;&#65292;&#20294;&#26366;&#32463;&#23545;&#20854;&#36827;&#34892;&#20851;&#27880;&#65292;&#24182;&#22312;&#19968;&#20123;&#26696;&#20363;&#20013;&#19982;&#20854;&#24320;&#21457;&#20154;&#21592;&#36827;&#34892;&#36807;&#20132;&#35848;&#12290;</p></li><li class="listitem"><p>GNU Debugger(GDB)&#39033;&#30446;&#65288;&#21516;&#19978;&#65289;&#12290;</p></li><li class="listitem"><p>Debian&#39033;&#30446;&#65288;&#21516;&#19978;&#65289;&#12290;</p></li></ul></div><p>&#24403;&#28982;&#65292;&#20197;&#19978;&#24182;&#19981;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#21517;&#21333;&#12290;&#27491;&#22914;&#22810;&#25968;&#30340;&#33258;&#30001;&#36719;&#20214;&#31243;&#24207;&#21592;&#19968;&#26679;&#65292;&#25105;&#19981;&#23450;&#26399;&#22320;&#36861;&#36394;&#33258;&#30001;&#36719;&#20214;&#34892;&#19994;&#20013;&#35768;&#22810;&#19981;&#21516;&#30340;&#39033;&#30446;&#65292;&#20197;&#23545;&#34892;&#19994;&#30340;&#25972;&#20307;&#24773;&#20917;&#26377;&#20840;&#38754;&#30340;&#20102;&#35299;&#12290;&#22312;&#27492;&#65292;&#25105;&#19981;&#19968;&#19968;&#21015;&#20030;&#25152;&#26377;&#30340;&#39033;&#30446;&#65292;&#20294;&#22312;&#20070;&#20013;&#20250;&#36866;&#26102;&#25552;&#21450;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="audience.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="acknowledgments.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#35841;&#24212;&#35813;&#35835;&#26412;&#20070;&#65311; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#33268;&#35874;</td></tr></table></div></body></html>
