<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;"><link rel="prev" href="release-branches.html" title="&#21457;&#24067;&#20998;&#25903;"><link rel="next" href="packaging.html" title="&#25171;&#21253;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="release-branches.html">Prev</a> </td><th width="60%" align="center">Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</th><td width="20%" align="right"> <a accesskey="n" href="packaging.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="stabilizing-a-release"></a>&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;</h2></div></div></div><p><em class="firstterm">&#31283;&#23450;&#21270;</em>&#26159;&#35753;&#19968;&#20010;&#21457;&#24067;&#20998;&#25903;&#36827;&#20837;&#21457;&#24067;&#29366;&#24577;&#30340;&#36807;&#31243;&#65307;&#20063;&#23601;&#26159;&#20915;&#23450;&#21738;&#20123;&#21464;&#26356;&#23558;&#20250;&#36827;&#20837;&#21457;&#24067;&#29256;&#26412;&#65292;&#24182;&#20197;&#27492;&#20026;&#26681;&#25454;&#20462;&#25972;&#20998;&#25903;&#30340;&#20869;&#23481;&#12290;</p><p>&#8220;&#20915;&#23450;&#8221;&#19968;&#35789;&#26377;&#35768;&#22810;&#28508;&#22312;&#30340;&#19981;&#24184;&#12290;&#22312;&#21327;&#20316;&#36719;&#20214;&#39033;&#30446;&#20013;&#26368;&#21518;&#19968;&#20998;&#38047;&#29305;&#24615;&#20914;&#20987;&#26159;&#38750;&#24120;&#24120;&#35265;&#30340;&#29616;&#35937;&#65306;&#24403;&#24320;&#21457;&#32773;&#30475;&#21040;&#36719;&#20214;&#21457;&#24067;&#23558;&#35201;&#21457;&#29983;&#65292;&#20182;&#20204;&#20415;&#28151;&#20081;&#30340;&#32467;&#26463;&#24403;&#21069;&#30340;&#21464;&#26356;&#65292;&#19981;&#24076;&#26395;&#38169;&#36807;&#36825;&#29677;&#33337;&#12290;&#24403;&#28982;&#65292;&#36825;&#26159;&#22312;&#21457;&#24067;&#26102;&#20320;&#26368;&#19981;&#24819;&#30475;&#21040;&#30340;&#22330;&#38754;&#12290;&#22914;&#26524;&#20154;&#20204;&#33021;&#22312;&#27604;&#36739;&#20197;&#33298;&#36866;&#30340;&#33410;&#22863;&#65292;&#26080;&#38656;&#25285;&#24515;&#21464;&#26356;&#26159;&#36827;&#20837;&#36825;&#20010;&#29256;&#26412;&#36824;&#26159;&#19979;&#19968;&#20010;&#29256;&#26412;&#26102;&#23436;&#25104;&#36825;&#20010;&#29305;&#24615;&#65292;&#25928;&#26524;&#20250;&#26356;&#22909;&#12290;&#35774;&#27861;&#22312;&#26368;&#21518;&#19968;&#20998;&#38047;&#36827;&#20837;&#21457;&#24067;&#30340;&#21464;&#26356;&#36234;&#22810;&#65292;&#20195;&#30721;&#23601;&#36234;&#19981;&#31283;&#23450;&#65292;&#32780;&#19988;&#65288;&#36890;&#24120;&#26159;&#65289;&#20063;&#20250;&#36896;&#25104;&#26356;&#22810;&#30340;&#26032;bug&#12290;</p><p>&#22823;&#22810;&#25968;&#36719;&#20214;&#24037;&#31243;&#24072;&#35748;&#21487;&#22312;&#31283;&#23450;&#38454;&#27573;&#65292;&#21464;&#26356;&#36827;&#20837;&#21457;&#24067;&#29256;&#26412;&#32447;&#26102;&#20351;&#29992;&#20005;&#33499;&#26631;&#20934;&#30340;&#29702;&#35770;&#12290;&#24456;&#26126;&#26174;&#65292;&#23545;&#20110;&#20005;&#37325;bug&#65292;&#23588;&#20854;&#26159;&#27809;&#26377;&#20020;&#26102;&#35299;&#20915;&#21150;&#27861;&#30340;bug&#30340;&#20462;&#27491;&#24212;&#35813;&#36827;&#20837;&#12290;&#25991;&#26723;&#26356;&#26032;&#20197;&#21450;&#38169;&#35823;&#20449;&#24687;&#20462;&#25913;&#65288;&#38500;&#38750;&#26159;&#34987;&#35748;&#20026;&#26159;&#30028;&#38754;&#30340;&#19968;&#37096;&#20998;&#65292;&#24182;&#24517;&#39035;&#20445;&#25345;&#31283;&#23450;&#30340;&#20449;&#24687;&#65289;&#20063;&#27809;&#38382;&#39064;&#12290;&#35768;&#22810;&#39033;&#30446;&#20063;&#20801;&#35768;&#29305;&#23450;&#31867;&#22411;&#30340;&#20302;&#39118;&#38505;&#25110;&#38750;&#26680;&#24515;&#21464;&#26356;&#22312;&#31283;&#23450;&#26399;&#36827;&#20837;&#65292;&#24182;&#25552;&#20379;&#35780;&#20272;&#39118;&#38505;&#30340;&#27491;&#24335;&#25351;&#23548;&#12290;&#20294;&#26159;&#27809;&#26377;&#27491;&#24335;&#30340;&#25991;&#26723;&#21487;&#20197;&#22238;&#36991;&#23545;&#20110;&#20154;&#20204;&#21028;&#26029;&#30340;&#38656;&#35201;&#12290;&#22312;&#24456;&#22810;&#24773;&#20917;&#19979;&#39033;&#30446;&#38656;&#35201;&#20026;&#26159;&#21542;&#23558;&#21738;&#20010;&#21464;&#26356;&#32435;&#20837;&#21457;&#24067;&#20316;&#20986;&#20915;&#23450;&#12290;&#21361;&#38505;&#30340;&#26159;&#22240;&#20026;&#27599;&#20010;&#20154;&#37117;&#24076;&#26395;&#30475;&#21040;&#33258;&#24049;&#21916;&#27426;&#30340;&#21464;&#26356;&#36827;&#20837;&#21457;&#24067;&#29256;&#26412;&#65292;&#24182;&#20250;&#28608;&#21457;&#36275;&#22815;&#30340;&#20154;&#36190;&#25104;&#36825;&#20010;&#21464;&#26356;&#65292;&#32780;&#19981;&#20250;&#28608;&#21457;&#36275;&#22815;&#30340;&#21453;&#23545;&#32773;&#12290;</p><p>&#22240;&#27492;&#65292;&#31283;&#23450;&#19968;&#20010;&#21457;&#24067;&#29256;&#26412;&#20063;&#23601;&#26159;&#35201;&#21019;&#24314;&#19968;&#31181;&#35828;&#8220;&#19981;&#8221;&#30340;&#26426;&#21046;&#12290;&#23545;&#20110;&#24320;&#28304;&#39033;&#30446;&#26469;&#35828;&#65292;&#25216;&#24039;&#22312;&#20110;&#22914;&#20309;&#33021;&#22312;&#35828;&#8220;&#19981;&#8221;&#30340;&#21516;&#26102;&#65292;&#23613;&#21487;&#33021;&#36991;&#20813;&#36896;&#25104;&#36807;&#22810;&#30340;&#24773;&#32490;&#20260;&#23475;&#25110;&#22833;&#26395;&#30340;&#24320;&#21457;&#32773;&#65292;&#24182;&#19988;&#36824;&#35201;&#38450;&#27490;&#22312;&#21457;&#24067;&#29256;&#26412;&#20013;&#28431;&#25481;&#30495;&#27491;&#38656;&#35201;&#30340;&#21464;&#26356;&#12290;&#24403;&#28982;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#26041;&#27861;&#12290;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#35774;&#35745;&#19968;&#20010;&#28385;&#36275;&#36825;&#20010;&#26631;&#20934;&#30340;&#31995;&#32479;&#65292;&#21482;&#35201;&#39033;&#30446;&#33021;&#22815;&#23558;&#20854;&#35270;&#20316;&#37325;&#35201;&#30340;&#26631;&#20934;&#12290;&#22312;&#24191;&#38420;&#30340;&#33539;&#22260;&#20013;&#65292;&#36825;&#37324;&#25105;&#20165;&#20165;&#20171;&#32461;&#20004;&#31181;&#26368;&#27969;&#34892;&#30340;&#31995;&#32479;&#65292;&#24076;&#26395;&#36825;&#19981;&#20250;&#35753;&#20320;&#22833;&#21435;&#22312;&#39033;&#30446;&#20013;&#21457;&#25381;&#21019;&#36896;&#24615;&#30340;&#28608;&#24773;&#12290;&#26377;&#36275;&#22815;&#22810;&#30340;&#20854;&#20182;&#26041;&#24335;&#20063;&#26159;&#21487;&#33021;&#30340;&#65307;&#20294;&#36825;&#20004;&#20010;&#26159;&#25105;&#22312;&#23454;&#36341;&#20013;&#20351;&#29992;&#36807;&#30340;&#12290;</p><div class="sect2" title="&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;"><div class="titlepage"><div><div><h3 class="title"><a name="release-owner"></a>&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;</h3></div></div></div><p>&#22242;&#38431;&#35748;&#21487;&#35753;&#26576;&#20154;&#25104;&#20026;<em class="firstterm">&#21457;&#24067;&#25152;&#26377;&#32773;</em>&#12290;&#36825;&#20010;&#20154;&#21487;&#20197;&#26368;&#32456;&#30830;&#23450;&#36827;&#20837;&#21457;&#24067;&#29256;&#26412;&#30340;&#21464;&#26356;&#12290;&#24403;&#28982;&#65292;&#26377;&#30740;&#35752;&#21644;&#36777;&#35770;&#20063;&#26159;&#27491;&#24120;&#21644;&#21487;&#20197;&#35774;&#24819;&#30340;&#65292;&#20294;&#26159;&#26368;&#21518;&#22242;&#38431;&#24517;&#39035;&#36171;&#20104;&#25152;&#26377;&#32773;&#36275;&#22815;&#30340;&#26435;&#23041;&#20316;&#20986;&#26368;&#32456;&#30340;&#20915;&#23450;&#12290;&#23545;&#20110;&#27492;&#31867;&#31995;&#32479;&#65292;&#24517;&#39035;&#36873;&#20986;&#19968;&#20010;&#21512;&#36866;&#30340;&#20154;&#65292;&#20855;&#22791;&#29702;&#35299;&#25152;&#26377;&#21464;&#26356;&#30340;&#25216;&#26415;&#33021;&#21147;&#65292;&#20855;&#22791;&#22312;&#36991;&#20813;&#20260;&#23475;&#36807;&#22810;&#24863;&#24773;&#30340;&#24773;&#20917;&#19979;&#23558;&#35752;&#35770;&#24341;&#20837;&#21457;&#24067;&#30340;&#31038;&#20250;&#23041;&#26395;&#21644;&#31038;&#20132;&#25216;&#24039;&#12290;</p><p>&#21457;&#24067;&#25152;&#26377;&#32773;&#22330;&#26223;&#20250;&#35828;&#8220;&#25105;&#19981;&#35748;&#20026;&#36825;&#20010;&#21464;&#26356;&#26377;&#20160;&#20040;&#38169;&#35823;&#65292;&#21482;&#26159;&#25105;&#20204;&#27809;&#26377;&#36275;&#22815;&#30340;&#26102;&#38388;&#27979;&#35797;&#65292;&#25152;&#20197;&#19981;&#33021;&#36827;&#20837;&#36825;&#20010;&#21457;&#24067;&#29256;&#26412;&#12290;&#8221;&#22914;&#26524;&#21457;&#24067;&#25152;&#26377;&#32773;&#23545;&#20110;&#39033;&#30446;&#20855;&#22791;&#24191;&#27867;&#30340;&#25216;&#26415;&#30693;&#35782;&#23558;&#20250;&#38750;&#24120;&#26377;&#30410;&#65292;&#36825;&#26679;&#21487;&#20197;&#35299;&#37322;&#20026;&#20160;&#20040;&#36825;&#20010;&#21464;&#26356;&#20250;&#28508;&#22312;&#30340;&#23548;&#33268;&#19981;&#31283;&#23450;&#24615;&#65288;&#20363;&#22914;&#65292;&#24403;&#19982;&#36719;&#20214;&#30340;&#20854;&#20182;&#37096;&#20998;&#20132;&#20114;&#26102;&#65292;&#25110;&#31227;&#26893;&#24615;&#32771;&#34385;&#31561;&#65289;&#12290;&#20154;&#20204;&#26377;&#26102;&#20250;&#20026;&#36825;&#31867;&#20915;&#23450;&#36777;&#25252;&#65292;&#25110;&#32773;&#36136;&#38382;&#20160;&#20040;&#26679;&#30340;&#21464;&#26356;&#27809;&#26377;&#36825;&#31181;&#39118;&#38505;&#12290;&#36825;&#31181;&#23545;&#35805;&#19981;&#38656;&#35201;&#26159;&#23545;&#25239;&#24615;&#30340;&#65292;&#21482;&#35201;&#21457;&#24067;&#25152;&#26377;&#32773;&#35748;&#20026;&#25152;&#26377;&#30340;&#35770;&#28857;&#37117;&#26159;&#23458;&#35266;&#30340;&#65292;&#32780;&#19981;&#26159;&#26465;&#20214;&#21453;&#23556;&#24335;&#30340;&#22362;&#23450;&#33258;&#24049;&#30340;&#31435;&#22330;&#12290;</p><p>&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#21457;&#24067;&#25152;&#26377;&#32773;&#19982;&#39033;&#30446;&#39046;&#23548;&#19981;&#24517;&#26159;&#21516;&#19968;&#20010;&#20154;&#65288;&#22914;&#26524;&#26377;&#39033;&#30446;&#39046;&#23548;&#30340;&#35805;&#65292;&#35265;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="social-infrastructure.html#benevolent-dictator" title="&#24904;&#21892;&#29420;&#35009;&#32773;">the section called &#8220;&#24904;&#21892;&#29420;&#35009;&#32773;&#8221;</a>&#65289;&#12290;&#23454;&#38469;&#19978;&#65292;&#26377;&#26102;&#35201;&#30830;&#20445;&#20182;&#20204;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#21516;&#19968;&#20010;&#20154;&#12290;&#25104;&#20026;&#19968;&#20010;&#20248;&#31168;&#39033;&#30446;&#39046;&#23548;&#30340;&#25216;&#24039;&#19982;&#25104;&#20026;&#20248;&#31168;&#21457;&#24067;&#25152;&#26377;&#32773;&#30340;&#25216;&#24039;&#24182;&#19981;&#19968;&#23450;&#30456;&#21516;&#12290;&#22312;&#26377;&#20123;&#26102;&#20505;&#65292;&#19982;&#21457;&#24067;&#36807;&#31243;&#21516;&#31561;&#37325;&#35201;&#30340;&#26159;&#33021;&#26377;&#19968;&#20010;&#20154;&#21487;&#20197;&#25104;&#20026;&#39033;&#30446;&#39046;&#23548;&#21028;&#26029;&#21147;&#30340;&#24179;&#34913;&#21147;&#37327;&#12290;</p><p>&#21457;&#24067;&#25152;&#26377;&#32773;&#35282;&#33394;&#19982;&#36739;&#24369;&#29420;&#35009;&#32773;&#35282;&#33394;&#30340;&#27604;&#36739;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="stabilizing-a-release.html#release-manager" title="&#21457;&#24067;&#32463;&#29702;">the section called &#8220;&#21457;&#24067;&#32463;&#29702;&#8221;</a>&#12290;</p></div><div class="sect2" title="&#21464;&#26356;&#34920;&#20915;"><div class="titlepage"><div><div><h3 class="title"><a name="release-voting"></a>&#21464;&#26356;&#34920;&#20915;</h3></div></div></div><p>&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;&#26041;&#24335;&#30340;&#21478;&#19968;&#20010;&#26497;&#31471;&#23601;&#26159;&#20026;&#36827;&#20837;&#21457;&#24067;&#30340;&#21464;&#26356;&#36827;&#34892;&#34920;&#20915;&#12290;&#28982;&#32780;&#65292;&#22240;&#20026;&#21457;&#24067;&#31283;&#23450;&#21270;&#26368;&#37325;&#35201;&#21151;&#33021;&#26159;<span class="emphasis"><em>&#25490;&#38500;</em></span>&#21464;&#26356;&#65292;&#25152;&#20197;&#21183;&#24517;&#35201;&#35774;&#35745;&#19968;&#31181;&#34920;&#20915;&#31995;&#32479;&#65292;&#21482;&#26377;&#22312;&#22823;&#22810;&#25968;&#24320;&#21457;&#32773;&#34920;&#31034;&#27491;&#38754;&#24847;&#35265;&#26102;&#25165;&#23558;&#21464;&#26356;&#32435;&#20837;&#21457;&#24067;&#12290;&#21482;&#26377;&#27604;&#31616;&#21333;&#22810;&#25968;&#26356;&#22810;&#30340;&#36190;&#25104;&#25165;&#21487;&#20197;&#24341;&#20837;&#19968;&#20010;&#21464;&#26356;&#65288;&#35265;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="consensus-democracy.html#electorate" title="&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;">the section called &#8220;&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;&#8221;</a>&#65289;&#12290;&#21542;&#21017;&#65292;&#19968;&#20010;&#20154;&#25552;&#20986;&#65292;&#27809;&#26377;&#20154;&#21453;&#23545;&#65292;&#19968;&#20010;&#21464;&#26356;&#23601;&#36275;&#20197;&#36827;&#20837;&#21457;&#24067;&#65292;&#19968;&#20010;&#19981;&#24184;&#30340;&#21464;&#21270;&#23601;&#26159;&#27599;&#20010;&#24320;&#21457;&#32773;&#37117;&#20250;&#25552;&#20986;&#33258;&#24049;&#30340;&#21464;&#26356;&#65292;&#32780;&#19988;&#22788;&#20110;&#38450;&#27490;&#20182;&#20154;&#25253;&#22797;&#30340;&#21407;&#22240;&#65292;&#20182;&#20204;&#20063;&#19981;&#20250;&#20877;&#21453;&#23545;&#20854;&#20182;&#20154;&#25552;&#20986;&#30340;&#21464;&#26356;&#12290;&#20026;&#20102;&#36991;&#20813;&#36825;&#20010;&#24773;&#20917;&#65292;&#24517;&#39035;&#23433;&#25490;&#19968;&#20123;&#24320;&#21457;&#32773;&#32452;&#25104;&#23376;&#22242;&#38431;&#65292;&#36215;&#21040;&#23558;&#21464;&#26356;&#32435;&#20837;&#21457;&#24067;&#30340;&#21327;&#20316;&#20316;&#29992;&#12290;&#36825;&#24182;&#19981;&#26159;&#24847;&#21619;&#30528;&#35753;&#26356;&#22810;&#30340;&#20154;&#35780;&#23457;&#27599;&#20010;&#21464;&#26356;&#65292;&#32780;&#26159;&#20026;&#20102;&#20943;&#23569;&#27599;&#20010;&#21333;&#29420;&#30340;&#24320;&#21457;&#32773;&#22312;&#21453;&#23545;&#26576;&#20010;&#21464;&#26356;&#26102;&#30340;&#29369;&#35947;&#65292;&#22240;&#20026;&#22905;&#30693;&#36947;&#36190;&#25104;&#35813;&#21464;&#26356;&#30340;&#25152;&#26377;&#20154;&#19981;&#20250;&#23558;&#22905;&#30340;&#21453;&#23545;&#24847;&#35265;&#24403;&#20316;&#20154;&#36523;&#25915;&#20987;&#12290;&#23376;&#22242;&#38431;&#21442;&#19982;&#30340;&#20154;&#25968;&#36234;&#22810;&#65292;&#35752;&#35770;&#23601;&#20250;&#26356;&#21152;&#38598;&#20013;&#19982;&#21464;&#26356;&#26412;&#36523;&#65292;&#32780;&#19981;&#20250;&#26159;&#20851;&#20110;&#26576;&#20010;&#20154;&#12290;</p><p>&#25105;&#20204;&#22312;Subversion&#39033;&#30446;&#20013;&#20351;&#29992;&#30340;&#31995;&#32479;&#36798;&#21040;&#20102;&#38750;&#24120;&#22909;&#30340;&#24179;&#34913;&#65292;&#25152;&#20197;&#25105;&#22312;&#36825;&#37324;&#23558;&#20250;&#25512;&#33616;&#23427;&#12290;&#20026;&#20102;&#35753;&#19968;&#20010;&#21464;&#26356;&#36827;&#20837;&#21457;&#24067;&#20998;&#25903;&#65292;&#24517;&#39035;&#33267;&#23569;&#26377;3&#20301;&#24320;&#21457;&#32773;&#35201;&#25237;&#31080;&#36190;&#25104;&#23427;&#65292;&#32780;&#19988;&#27809;&#26377;&#21453;&#23545;&#32773;&#12290;&#19968;&#20010;&#21333;&#29420;&#30340;&#8220;&#21453;&#23545;&#8221;&#31080;&#36275;&#20197;&#38459;&#27490;&#21464;&#26356;&#30340;&#36827;&#20837;&#65307;&#22312;&#21457;&#24067;&#22330;&#26223;&#20013;&#19968;&#20010;&#8220;&#21453;&#23545;&#8221;&#31080;&#31561;&#21516;&#20110;&#21542;&#20915;&#31080;&#65288;&#35265;<a class="xref" href="consensus-democracy.html#veto" title="&#21542;&#20915;&#26435;">the section called &#8220;&#21542;&#20915;&#26435;&#8221;</a>&#65289;&#12290;&#24456;&#33258;&#28982;&#65292;&#36825;&#31867;&#34920;&#20915;&#24517;&#39035;&#20276;&#38543;&#30528;&#36777;&#25252;&#24847;&#35265;&#65292;&#32780;&#19988;&#22914;&#26524;&#26377;&#36275;&#22815;&#22810;&#30340;&#20154;&#35748;&#20026;&#36777;&#25252;&#27627;&#26080;&#36947;&#29702;&#65292;&#20063;&#21487;&#20197;&#21457;&#36215;&#19968;&#27425;&#38024;&#23545;&#35813;&#21464;&#26356;&#30340;&#29305;&#21035;&#34920;&#20915;&#12290;&#22312;&#23454;&#36341;&#20013;&#65292;&#36825;&#31181;&#24773;&#20917;&#36824;&#27809;&#26377;&#21457;&#29983;&#36807;&#65292;&#25105;&#20063;&#19981;&#35748;&#20026;&#23558;&#20250;&#21457;&#29983;&#12290;&#20154;&#20204;&#38754;&#23545;&#21457;&#24067;&#26102;&#24635;&#26159;&#36235;&#21521;&#20110;&#20445;&#23432;&#65292;&#24403;&#20154;&#20204;&#24863;&#21040;&#21487;&#20197;&#21542;&#20915;&#26576;&#20010;&#21464;&#26356;&#26102;&#65292;&#36890;&#24120;&#26159;&#22240;&#20026;&#26377;&#20102;&#36275;&#22815;&#22909;&#30340;&#29702;&#30001;&#12290;</p><p>&#22240;&#20026;&#65292;&#21457;&#24067;&#35268;&#31243;&#25925;&#24847;&#20542;&#21521;&#20110;&#20445;&#23432;&#65292;&#25152;&#20197;&#21542;&#20915;&#26102;&#30340;&#36777;&#25252;&#26377;&#26102;&#26159;&#20986;&#20110;&#31243;&#24207;&#19978;&#30340;&#21407;&#22240;&#65292;&#32780;&#38750;&#25216;&#26415;&#19978;&#30340;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;&#20154;&#35748;&#20026;&#26576;&#20010;&#21464;&#26356;&#20889;&#30340;&#24456;&#22909;&#65292;&#19981;&#22826;&#21487;&#33021;&#23548;&#33268;&#26032;bug&#65292;&#20294;&#26159;&#21542;&#20915;&#23427;&#36827;&#20837;&#24494;&#23567;&#29256;&#26412;&#30340;&#24847;&#35265;&#20165;&#20165;&#26159;&#23427;&#22826;&#22823;&#20102;&#8212;&#25110;&#35768;&#23427;&#24341;&#20837;&#20102;&#26032;&#29305;&#24615;&#65292;&#21448;&#25110;&#32773;&#23427;&#20197;&#24494;&#22937;&#30340;&#26041;&#24335;&#36829;&#21453;&#20102;&#20860;&#23481;&#24615;&#25919;&#31574;&#12290;&#25105;&#20063;&#20598;&#23572;&#20250;&#30475;&#21040;&#19968;&#20123;&#24320;&#21457;&#32773;&#20165;&#20165;&#22240;&#20026;&#26377;&#19981;&#22909;&#30340;&#24863;&#35273;&#32780;&#21542;&#20915;&#19968;&#20123;&#19996;&#35199;&#65292;&#20182;&#20204;&#35748;&#20026;&#36825;&#20123;&#21464;&#26356;&#38656;&#35201;&#26356;&#22810;&#30340;&#27979;&#35797;&#65292;&#21363;&#20351;&#26080;&#27861;&#26816;&#26597;&#20986;&#20219;&#20309;bug&#12290;&#20154;&#20204;&#24635;&#20250;&#21457;&#20123;&#29282;&#39578;&#65292;&#20294;&#26159;&#21542;&#20915;&#24050;&#32463;&#25104;&#31435;&#65292;&#32780;&#19988;&#21464;&#26356;&#19981;&#20250;&#36827;&#20837;&#21457;&#24067;&#65288;&#21363;&#20351;&#25105;&#19981;&#35760;&#24471;&#20043;&#21518;&#30340;&#27979;&#35797;&#26159;&#21542;&#21457;&#29616;&#20102;bug&#65289;&#12290;</p><div class="sect3" title="&#31649;&#29702;&#21327;&#20316;&#21457;&#24067;&#31283;&#23450;&#21270;"><div class="titlepage"><div><div><h4 class="title"><a name="release-stabilization-collaboration"></a>&#31649;&#29702;&#21327;&#20316;&#21457;&#24067;&#31283;&#23450;&#21270;</h4></div></div></div><p>&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#36873;&#25321;&#20102;&#19968;&#31181;&#21464;&#26356;&#34920;&#20915;&#31995;&#32479;&#65292;&#19968;&#23450;&#35201;&#30830;&#20445;&#35774;&#32622;&#25237;&#31080;&#21644;&#21457;&#24067;&#34920;&#20915;&#30340;&#29289;&#29702;&#26426;&#21046;&#23613;&#21487;&#33021;&#30340;&#20415;&#21033;&#12290;&#23613;&#31649;&#26377;&#22823;&#37327;&#24320;&#28304;&#30005;&#23376;&#25237;&#31080;&#36719;&#20214;&#65292;&#22312;&#23454;&#36341;&#20013;&#26368;&#31616;&#21333;&#30340;&#26041;&#24335;&#36824;&#26159;&#22312;&#21457;&#24067;&#20998;&#25903;&#19978;&#35774;&#32622;&#19968;&#20010;&#21483;&#20570;<code class="filename">STATUS</code>&#12289;<code class="filename">VOTES</code>&#25110;&#35832;&#22914;&#27492;&#31867;&#30340;&#25991;&#26412;&#25991;&#20214;&#12290;&#36825;&#20010;&#25991;&#20214;&#21015;&#20986;&#25152;&#26377;&#30340;&#21464;&#26356;&#25552;&#35758;&#8212;&#20219;&#20309;&#24320;&#21457;&#32773;&#21487;&#20197;&#25552;&#20986;&#21253;&#21547;&#26576;&#20010;&#21464;&#26356;&#30340;&#25552;&#35758;&#8212;&#20043;&#21518;&#23601;&#26159;&#21516;&#24847;&#21644;&#21453;&#23545;&#23427;&#30340;&#34920;&#20915;&#65292;&#20197;&#21450;&#27880;&#37322;&#25110;&#35780;&#35770;&#12290; &#65288;&#25552;&#20986;&#19968;&#20010;&#21464;&#26356;&#24182;&#19981;&#24847;&#21619;&#30528;&#19968;&#23450;&#35201;&#20026;&#27492;&#25237;&#31080;&#65292;&#23613;&#31649;&#20004;&#32773;&#32463;&#24120;&#19968;&#36215;&#20986;&#29616;&#12290;&#65289;&#36825;&#20010;&#25991;&#20214;&#20013;&#20219;&#24847;&#19968;&#20010;&#26465;&#30446;&#30340;&#20869;&#23481;&#31867;&#20284;&#36825;&#20010;&#65306;</p><pre class="screen">
* r2401 (issue #49)
  Prevent client/server handshake from happening twice.
  Justification:
    Avoids extra network turnaround; small change and easy to review.
  Notes:
    This was discussed in http://.../mailing-lists/message-7777.html
    and other messages in that thread.
  Votes:
    +1: jsmith, kimf
    -1: tmartin (breaks compatibility with some pre-1.0 servers;
                 admittedly, those servers are buggy, but why be
                 incompatible if we don't have to?)
</pre><p>&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;&#35813;&#21464;&#26356;&#24471;&#21040;&#20102;&#20004;&#20010;&#36190;&#25104;&#31080;&#65292;&#20294;&#26159;&#34987;tmartin&#21542;&#20915;&#65292;&#20182;&#22312;&#38468;&#21152;&#35828;&#26126;&#20013;&#32473;&#20986;&#20102;&#21407;&#22240;&#12290;&#35813;&#26465;&#30446;&#30340;&#35814;&#32454;&#26684;&#24335;&#24182;&#19981;&#37325;&#35201;&#65307;&#20320;&#30340;&#39033;&#30446;&#22914;&#20309;&#35774;&#32622;&#37117;&#21487;&#20197;&#8212;&#25110;&#35768;tmartin&#30340;&#35299;&#37322;&#24212;&#35813;&#20986;&#29616;&#22312;&#8220;Notes:&#8221;&#37096;&#20998;&#65292;&#20063;&#35768;&#21464;&#26356;&#25551;&#36848;&#20063;&#24212;&#35813;&#26377;&#19968;&#20010;&#8221;Description: &#8220;&#22836;&#26469;&#21305;&#37197;&#20854;&#20182;&#23567;&#33410;&#12290;&#37325;&#35201;&#30340;&#26159;&#38656;&#35201;&#35780;&#20272;&#36825;&#20010;&#21464;&#26356;&#30340;&#25152;&#26377;&#20449;&#24687;&#37117;&#26159;&#35302;&#25163;&#21487;&#21450;&#30340;&#65292;&#36827;&#34892;&#25237;&#31080;&#30340;&#26426;&#21046;&#20063;&#26159;&#23613;&#21487;&#33021;&#30340;&#20445;&#25345;&#36731;&#37327;&#32423;&#12290;&#25552;&#35758;&#30340;&#21464;&#26356;&#30452;&#25509;&#29992;&#29256;&#26412;&#24211;&#20013;&#30340;&#20462;&#35746;&#21495;&#30721;&#24341;&#29992;&#65288;&#22914;&#26524;&#26159;&#21333;&#20010;&#20462;&#35746;&#21487;&#33021;&#26159;r2401&#65292;&#24403;&#28982;&#25552;&#35758;&#30340;&#21464;&#26356;&#20063;&#21487;&#33021;&#30001;&#22810;&#20010;&#20462;&#35746;&#32452;&#25104;&#65289;&#12290;&#20462;&#35746;&#21487;&#20197;&#26159;&#24341;&#29992;&#22312;&#20027;&#24178;&#19978;&#30340;&#21464;&#26356;&#65307;&#32780;&#22914;&#26524;&#21464;&#26356;&#23601;&#21457;&#29983;&#22312;&#21457;&#24067;&#20998;&#25903;&#65292;&#21487;&#33021;&#27809;&#24517;&#35201;&#20877;&#34920;&#20915;&#20102;&#12290;&#22914;&#26524;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#27809;&#26377;&#24341;&#29992;&#26576;&#20010;&#21464;&#26356;&#30340;&#26126;&#30830;&#35821;&#27861;&#65292;&#21017;&#39033;&#30446;&#38656;&#35201;&#24314;&#31435;&#19968;&#20010;&#12290;&#20026;&#20102;&#34920;&#20915;&#30340;&#21487;&#25805;&#20316;&#24615;&#65292;&#27599;&#20010;&#38656;&#35201;&#32771;&#34385;&#30340;&#21464;&#26356;&#24517;&#39035;&#26159;&#26126;&#30830;&#21487;&#26631;&#35782;&#30340;&#12290;</p><p>&#36825;&#20123;&#25552;&#35758;&#21644;&#34920;&#20915;&#21487;&#20197;&#20445;&#35777;&#21464;&#26356;&#21487;&#20197;&#24178;&#20928;&#30340;&#36827;&#20837;&#21457;&#24067;&#20998;&#25903;&#65292;&#20063;&#23601;&#26159;&#19981;&#20250;&#21457;&#29983;&#20914;&#31361;&#65288;&#35265;<a class="xref" href="vc.html#vc-vocabulary-conflict"><em class="firstterm">&#20914;&#31361;&#65288;conflict&#65289;</em></a>&#65289;&#12290;&#22914;&#26524;&#26377;&#20914;&#31361;&#65292;&#21017;&#35813;&#26465;&#30446;&#24212;&#24403;&#21253;&#21547;&#25351;&#21521;&#19968;&#20010;&#21487;&#20197;&#20351;&#21464;&#26356;&#21464;&#24178;&#20928;&#30340;&#34917;&#19969;&#65292;&#25110;&#32773;&#26159;&#21253;&#21547;&#24050;&#20462;&#27491;&#21464;&#26356;&#30340;&#20020;&#26102;&#20998;&#25903;&#65292;&#20363;&#22914;&#65306;</p><pre class="screen">
* r13222, r13223, r13232
  Rewrite libsvn_fs_fs's auto-merge algorithm
  Justification:
    unacceptable performance (&gt;50 minutes for a small commit) in
    a repository with 300,000 revisions
  Branch:
    1.1.x-r13222@13517
  Votes:
    +1: epg, ghudson
</pre><p>&#36825;&#20010;&#20363;&#23376;&#21462;&#33258;&#30495;&#23454;&#30340;&#29983;&#27963;&#65307;&#26469;&#33258;Subversion 1.1.4&#21457;&#24067;&#36807;&#31243;&#30340;<code class="filename">STATUS</code>&#25991;&#20214;&#12290;&#35831;&#27880;&#24847;&#65292;&#23427;&#26159;&#22914;&#20309;&#20351;&#29992;&#21407;&#22987;&#30340;&#20462;&#35746;&#29256;&#26412;&#20316;&#20026;&#21464;&#26356;&#30340;&#26631;&#20934;&#25551;&#36848;&#26041;&#24335;&#65292;&#21363;&#20351;&#26377;&#19968;&#20010;&#20998;&#25903;&#24050;&#32463;&#26377;&#20102;&#20462;&#27491;&#20914;&#31361;&#21518;&#30340;&#21464;&#26356;&#29256;&#26412;&#65288;&#20026;&#20102;&#26356;&#31616;&#21333;&#30340;&#23558;&#19968;&#23450;&#20250;&#34987;&#36890;&#36807;&#30340;&#21464;&#26356;&#21512;&#24182;&#21040;&#21457;&#24067;&#29256;&#26412;&#65292;&#20998;&#25903;&#20063;&#23558;&#19977;&#20010;trunk&#30340;&#20462;&#35746;&#29256;&#26412;&#21512;&#24182;&#20026;&#19968;&#20010;r13517&#65289;&#12290;&#36825;&#37324;&#36824;&#26159;&#25552;&#20379;&#20102;&#21407;&#22987;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#20316;&#20026;&#26368;&#26089;&#30340;&#21487;&#20197;&#26816;&#26597;&#30340;&#23454;&#20307;&#65292;&#22240;&#20026;&#20182;&#20204;&#37117;&#25552;&#20379;&#20102;&#21407;&#22987;&#30340;&#26085;&#24535;&#20449;&#24687;&#12290;&#20020;&#26102;&#20998;&#25903;&#19981;&#20250;&#26377;&#37027;&#20123;&#26085;&#24535;&#20449;&#24687;&#65292;&#20026;&#20102;&#36991;&#20813;&#20449;&#24687;&#30340;&#22797;&#21046;&#65288;<span><a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;">Chapter 3, <i>&#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</i></a>&#30340;</span><a class="xref" href="vc.html#vc-singularity" title="&#20449;&#24687;&#21333;&#19968;&#24615;">the section called &#8220;&#20449;&#24687;&#21333;&#19968;&#24615;&#8221;</a>&#65289;&#65292;&#20998;&#25903;&#19978;r13517&#30340;&#26085;&#24535;&#20449;&#24687;&#20165;&#20165;&#26159;&#8220;&#35843;&#25972;r13222&#12289;r13223&#21644;r13232&#22238;&#21040;&#20998;&#25903;1.1.x&#12290;&#8221;&#20851;&#20110;&#21464;&#26356;&#30340;&#25152;&#26377;&#20854;&#20182;&#20449;&#24687;&#37117;&#21487;&#20197;&#36319;&#36394;&#21407;&#22987;&#30340;&#20462;&#35746;&#29256;&#26412;&#24471;&#21040;&#12290;</p></div><div class="sect3" title="&#21457;&#24067;&#32463;&#29702;"><div class="titlepage"><div><div><h4 class="title"><a name="release-manager"></a>&#21457;&#24067;&#32463;&#29702;</h4></div></div></div><p>&#23558;&#24050;&#30830;&#35748;&#21464;&#26356;&#21512;&#24182;&#21040;&#21457;&#24067;&#20998;&#25903;&#30340;&#23454;&#38469;&#36807;&#31243;&#65288;&#35265;<a class="xref" href="vc.html#vc-vocabulary-merge"><em class="firstterm">&#21512;&#24182;&#65288;&#21448;&#21517;&#25644;&#36816;&#65289;&#65288;merge, a.k.a. port&#65289;</em></a>&#65289;&#21487;&#20197;&#30001;&#20219;&#20309;&#24320;&#21457;&#32773;&#25191;&#34892;&#12290;&#19981;&#24517;&#26377;&#19968;&#20010;&#20154;&#19987;&#38376;&#36127;&#36131;&#21512;&#24182;&#21464;&#26356;&#65307;&#22914;&#26524;&#21464;&#26356;&#24456;&#22810;&#65292;&#26368;&#22909;&#33021;&#26377;&#20154;&#20998;&#25285;&#24037;&#20316;&#12290;</p><p>&#28982;&#32780;&#65292;&#23613;&#31649;&#34920;&#20915;&#21644;&#21512;&#24182;&#37117;&#20197;&#38750;&#38598;&#20013;&#30340;&#26679;&#24335;&#20986;&#29616;&#65292;&#22312;&#23454;&#36341;&#20013;&#36890;&#24120;&#20250;&#26377;&#19968;&#21040;&#20004;&#20010;&#20154;&#25484;&#25511;&#30528;&#21457;&#24067;&#36807;&#31243;&#12290;&#36825;&#20010;&#35282;&#33394;&#26377;&#26102;&#34987;&#27491;&#24335;&#30340;&#31216;&#20316;<em class="firstterm">&#21457;&#24067;&#32463;&#29702;</em>&#65292;&#20294;&#26159;&#19982;&#25317;&#26377;&#26368;&#32456;&#20915;&#23450;&#26435;&#30340;&#21457;&#24067;&#25152;&#26377;&#32773;&#65288;&#35265;<span>&#26412;&#31456;&#21069;&#38754;&#30340;</span><a class="xref" href="stabilizing-a-release.html#release-owner" title="&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;">the section called &#8220;&#21457;&#24067;&#25152;&#26377;&#32773;&#29420;&#35009;&#8221;</a>&#65289;&#26377;&#24456;&#22823;&#30340;&#21306;&#21035;&#12290;&#21457;&#24067;&#32463;&#29702;&#36319;&#36394;&#24403;&#21069;&#26377;&#22810;&#23569;&#27491;&#22312;&#32771;&#34385;&#30340;&#21464;&#26356;&#65292;&#26377;&#22810;&#23569;&#24050;&#32463;&#30830;&#35748;&#65292;&#26377;&#22810;&#23569;&#21487;&#33021;&#20250;&#34987;&#30830;&#35748;&#31561;&#31561;&#12290;&#22914;&#26524;&#20182;&#20204;&#24863;&#21040;&#37325;&#35201;&#30340;&#21464;&#26356;&#26410;&#33021;&#33719;&#24471;&#36275;&#22815;&#30340;&#20851;&#27880;&#65292;&#25110;&#32773;&#21487;&#33021;&#22240;&#20026;&#32570;&#23569;&#25237;&#31080;&#32780;&#26080;&#27861;&#36827;&#20837;&#21457;&#24067;&#65292;&#20182;&#20204;&#20250;&#26377;&#31036;&#35980;&#30340;&#25552;&#37266;&#20854;&#20182;&#24320;&#21457;&#32773;&#26816;&#26597;&#24182;&#25237;&#31080;&#12290;&#24403;&#19968;&#32452;&#21464;&#26356;&#32463;&#36807;&#30830;&#35748;&#65292;&#36825;&#20123;&#20154;&#20250;&#33258;&#24049;&#21435;&#23558;&#23427;&#20204;&#21512;&#24182;&#21040;&#21457;&#24067;&#20998;&#25903;&#65307;&#22914;&#26524;&#26377;&#20854;&#20182;&#20154;&#24895;&#24847;&#33258;&#24049;&#23436;&#25104;&#36825;&#20010;&#20219;&#21153;&#20063;&#27809;&#26377;&#38382;&#39064;&#65292;&#21482;&#35201;&#25152;&#26377;&#20154;&#37117;&#29702;&#35299;&#22914;&#26524;&#20182;&#20204;&#27809;&#26377;&#26126;&#30830;&#30340;&#22768;&#26126;&#35201;&#33258;&#24049;&#20570;&#65292;&#36825;&#20415;&#19981;&#26159;&#24378;&#21046;&#35201;&#20570;&#30340;&#24037;&#20316;&#12290;&#24403;&#35201;&#23558;&#21457;&#24067;&#20844;&#24067;&#20110;&#20247;&#26102;&#65288;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="testing-and-releasing.html" title="&#27979;&#35797;&#21644;&#21457;&#24067;">the section called &#8220;&#27979;&#35797;&#21644;&#21457;&#24067;&#8221;</a>&#65289;&#65292;&#21457;&#24067;&#32463;&#29702;&#23558;&#20250;&#23436;&#25104;&#26368;&#32456;&#21457;&#24067;&#21253;&#30340;&#21019;&#24314;&#65292;&#25910;&#38598;&#25968;&#23383;&#31614;&#21517;&#65292;&#19978;&#20256;&#21457;&#24067;&#21253;&#24182;&#20316;&#20986;&#20844;&#21578;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="release-branches.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="packaging.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#21457;&#24067;&#20998;&#25903; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#25171;&#21253;</td></tr></table></div></body></html>
