<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="announcing.html" title="&#36890;&#21578;"><link rel="next" href="mailing-lists.html" title="&#37038;&#20214;&#21015;&#34920;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="announcing.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="mailing-lists.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><div class="titlepage"><div><div><h2 class="title"><a name="technical-infrastructure"></a>Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="technical-infrastructure.html#tools-needed">&#19968;&#20010;&#39033;&#30446;&#38656;&#35201;&#20160;&#20040;</a></span></dt><dt><span class="sect1"><a href="mailing-lists.html">&#37038;&#20214;&#21015;&#34920;</a></span></dt><dd><dl><dt><span class="sect2"><a href="mailing-lists.html#spam-prevention">&#22403;&#22334;&#37038;&#20214;&#38450;&#25252;</a></span></dt><dd><dl><dt><span class="sect3"><a href="mailing-lists.html#spam-filtering">&#36807;&#28388;&#37038;&#20214;</a></span></dt><dt><span class="sect3"><a href="mailing-lists.html#address-hiding">&#24402;&#26723;&#20013;&#30340;&#22320;&#22336;&#38544;&#34255;</a></span></dt></dl></dd><dt><span class="sect2"><a href="mailing-lists.html#header-management">&#36523;&#20221;&#21644;&#22836;&#31649;&#29702;</a></span></dt><dt><span class="sect2"><a href="mailing-lists.html#reply-to">&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;</a></span></dt><dd><dl><dt><span class="sect3"><a href="mailing-lists.html#reply-fantasies">&#20004;&#20010;&#24187;&#24819;</a></span></dt></dl></dd><dt><span class="sect2"><a href="mailing-lists.html#archiving">&#24402;&#26723;</a></span></dt><dt><span class="sect2"><a href="mailing-lists.html#mailing-list-software">&#36719;&#20214;</a></span></dt></dl></dd><dt><span class="sect1"><a href="vc.html">&#29256;&#26412;&#25511;&#21046;</a></span></dt><dd><dl><dt><span class="sect2"><a href="vc.html#vc-vocabulary">&#29256;&#26412;&#25511;&#21046;&#35789;&#27719;&#34920;</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-choosing">&#36873;&#25321;&#19968;&#20010;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-using">&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</a></span></dt><dd><dl><dt><span class="sect3"><a href="vc.html#version-everything">&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-browsing">&#21487;&#27983;&#35272;&#24615;</a></span></dt><dt><span class="sect3"><a href="vc.html#commit-emails">&#25552;&#20132;&#37038;&#20214;</a></span></dt><dt><span class="sect3"><a href="vc.html#branches">&#20351;&#29992;&#20998;&#25903;&#26469;&#36991;&#20813;&#29942;&#39048;</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-singularity">&#20449;&#24687;&#21333;&#19968;&#24615;</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-authz">&#25480;&#26435;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="bug-tracker.html">Bug&#36319;&#36394;</a></span></dt><dd><dl><dt><span class="sect2"><a href="bug-tracker.html#bug-tracker-mailing-list-interaction">&#19982;&#37038;&#20214;&#21015;&#34920;&#20132;&#20114;</a></span></dt><dt><span class="sect2"><a href="bug-tracker.html#bug-filtering">Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;</a></span></dt></dl></dd><dt><span class="sect1"><a href="irc.html">IRC / &#23454;&#26102;&#32842;&#22825;&#31995;&#32479;</a></span></dt><dd><dl><dt><span class="sect2"><a href="irc.html#bots">&#26426;&#22120;&#20154;&#65288;Bots&#65289;</a></span></dt><dt><span class="sect2"><a href="irc.html#irc-archiving">&#24402;&#26723;IRC</a></span></dt></dl></dd><dt><span class="sect1"><a href="rss.html">RSS&#20379;&#31295;</a></span></dt><dt><span class="sect1"><a href="wikis.html">Wikis</a></span></dt><dt><span class="sect1"><a href="web-site.html">&#32593;&#31449;</a></span></dt><dd><dl><dt><span class="sect2"><a href="web-site.html#canned-hosting">&#21253;&#35013;&#20027;&#26426;</a></span></dt><dd><dl><dt><span class="sect3"><a href="web-site.html#canned-hosting-choosing">&#36873;&#25321;&#19968;&#20010;&#21253;&#35013;&#31449;&#28857;</a></span></dt><dt><span class="sect3"><a href="web-site.html#anonymity">&#21311;&#21517;&#21644;&#21442;&#19982;</a></span></dt></dl></dd></dl></dd></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#20381;&#36182;&#20110;&#36873;&#25321;&#24615;&#25429;&#33719;&#21644;&#20449;&#24687;&#38598;&#25104;&#30340;&#25216;&#26415;&#12290;&#23545;&#36825;&#20123;&#25216;&#26415;&#30340;&#20351;&#29992;&#36234;&#26159;&#29087;&#32451;&#65292;&#24182;&#35828;&#26381;&#21035;&#20154;&#21435;&#20351;&#29992;&#36825;&#20123;&#25216;&#26415;&#65292;&#20320;&#30340;&#39033;&#30446;&#23601;&#36234;&#25104;&#21151;&#12290;&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#65292;&#36825;&#19968;&#28857;&#24840;&#21457;&#27491;&#30830;&#12290;&#22909;&#30340;&#20449;&#24687;&#31649;&#29702;&#31995;&#32479;&#24212;&#35813;&#33021;&#22815;&#38450;&#27490;&#24320;&#28304;&#39033;&#30446;&#22312;&#24067;&#40065;&#20811;&#27861;&#21017;&#30340;&#37325;&#21387;&#19979;&#23849;&#22604;<sup>[<a name="idp655" href="#ftn.idp655" class="footnote">12</a>]</sup>
&#65292;&#20063;&#23601;&#26159;&#35828;&#21521;&#19968;&#20010;&#24050;&#32463;&#24310;&#26399;&#30340;&#39033;&#30446;&#22686;&#21152;&#20154;&#21147;&#65292;&#21482;&#33021;&#20351;&#39033;&#30446;&#24310;&#26399;&#26356;&#22810;&#12290;&#20315;&#38647;&#24503;·&#24067;&#40065;&#20811;&#35266;&#23519;&#21040;&#65292;&#39033;&#30446;&#30340;&#22797;&#26434;&#24615;&#21516;&#21442;&#19982;&#20154;&#21592;&#25968;&#37327;&#30340;<span class="emphasis"><em>&#24179;&#26041;</em></span>&#25104;&#27491;&#27604;&#12290;&#24403;&#39033;&#30446;&#20013;&#21482;&#26377;&#23569;&#25968;&#20960;&#20010;&#20154;&#26102;&#65292;&#22823;&#23478;&#21487;&#20197;&#23481;&#26131;&#30340;&#20114;&#30456;&#20132;&#35848;&#65292;&#20294;&#24403;&#26377;&#19978;&#30334;&#20154;&#21442;&#19982;&#26102;&#65292;&#19981;&#21487;&#33021;&#35753;&#27599;&#20010;&#20154;&#37117;&#33021;&#30693;&#36947;&#21035;&#20154;&#27491;&#22312;&#20570;&#20160;&#20040;&#12290;&#22914;&#26524;&#35828;&#20248;&#31168;&#30340;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#31649;&#29702;&#26159;&#35753;&#27599;&#20010;&#20154;&#37117;&#24863;&#35273;&#26159;&#22312;&#21516;&#19968;&#20010;&#23627;&#23376;&#37324;&#20849;&#21516;&#24037;&#20316;&#65292;&#24456;&#26126;&#26174;&#38382;&#39064;&#22312;&#20110;&#65306;&#24403;&#22312;&#19968;&#38388;&#25317;&#25380;&#30340;&#25151;&#38388;&#20869;&#65292;&#22312;&#21516;&#19968;&#26102;&#21051;&#27599;&#20010;&#20154;&#37117;&#24819;&#21457;&#20986;&#22768;&#38899;&#65292;&#20250;&#21457;&#29983;&#20160;&#20040;&#65311;</p><p>&#36825;&#19981;&#26159;&#19968;&#20010;&#26032;&#38382;&#39064;&#12290;&#22312;&#29616;&#23454;&#20013;&#30340;&#25317;&#25380;&#25151;&#38388;&#20013;&#65292;&#35299;&#20915;&#26041;&#26696;&#26159;<em class="firstterm">&#20250;&#35758;&#31243;&#24207;</em>&#65306;&#25105;&#20204;&#38656;&#35201;&#27491;&#24335;&#30340;&#25351;&#23548;&#35268;&#21017;&#65306;&#21253;&#25324;&#22914;&#20309;&#22312;&#19968;&#20010;&#22823;&#22411;&#22242;&#38431;&#20013;&#36827;&#34892;&#21363;&#26102;&#30340;&#35752;&#35770;&#65292;&#22914;&#20309;&#20445;&#25252;&#37325;&#35201;&#30340;&#24322;&#35758;&#19981;&#20250;&#22312;&#19968;&#29255;&#8220;&#25105;&#20063;&#26159;&#8221;&#30340;&#22238;&#22797;&#20013;&#28153;&#27809;&#65292;&#22914;&#20309;&#24418;&#25104;&#23567;&#32452;&#22996;&#21592;&#20250;&#65292;&#22914;&#20309;&#35782;&#21035;&#20986;&#20309;&#26102;&#20316;&#20986;&#20915;&#23450;&#31561;&#31561;&#12290;&#20250;&#35758;&#31243;&#24207;&#30340;&#19968;&#20010;&#37325;&#35201;&#32452;&#25104;&#37096;&#20998;&#26159;&#25351;&#26126;&#22242;&#38431;&#22914;&#20309;&#21516;&#23427;&#30340;&#20449;&#24687;&#31649;&#29702;&#31995;&#32479;&#20114;&#21160;&#12290;&#26377;&#20123;&#35780;&#35770;&#8220;&#20026;&#20102;&#34987;&#35760;&#24405;&#8221;&#32780;&#23384;&#22312;&#30340;&#65292;&#26377;&#20123;&#21017;&#19981;&#26159;&#12290;&#35760;&#24405;&#26412;&#36523;&#32463;&#24120;&#26159;&#34987;&#30452;&#25509;&#22788;&#29702;&#30340;&#65292;&#19981;&#33021;&#26681;&#25454;&#23383;&#38754;&#24847;&#20041;&#21435;&#29702;&#35299;&#65292;&#32780;&#26159;&#20195;&#34920;&#20102;&#22242;&#38431;&#24050;&#32463;&#30830;&#31435;&#36798;&#25104;<span class="emphasis"><em>&#20849;&#35782;</em></span>&#12290;&#35760;&#24405;&#24182;&#38750;&#19968;&#25104;&#19981;&#21464;&#65292;&#20026;&#19981;&#21516;&#30340;&#30446;&#30340;&#20250;&#26377;&#19981;&#21516;&#30340;&#24418;&#24335;&#12290;&#23427;&#21487;&#20197;&#21253;&#25324;&#20010;&#20154;&#20250;&#35758;&#35760;&#24405;&#12289;&#27599;&#27425;&#20250;&#35758;&#30340;&#23436;&#25972;&#35760;&#24405;&#12289;&#25688;&#35201;&#12289;&#35758;&#31243;&#21450;&#20854;&#27880;&#35299;&#12289;&#22996;&#21592;&#20250;&#25253;&#21578;&#65292;&#26469;&#33258;&#26410;&#20986;&#24109;&#36890;&#20449;&#32773;&#30340;&#25253;&#21578;&#65292;&#27963;&#21160;&#39033;&#30446;&#21015;&#34920;&#31561;&#31561;&#12290;</p><p>&#22240;&#20026;&#20114;&#32852;&#32593;&#24182;&#19981;&#26159;&#19968;&#20010;&#30495;&#23454;&#30340;&#25151;&#38388;&#65292;&#25152;&#20197;&#25105;&#20204;&#20063;&#26080;&#39035;&#25285;&#24515;&#21435;&#22797;&#21360;&#35832;&#22914;&#35753;&#37096;&#20998;&#20154;&#22312;&#21035;&#20154;&#35762;&#35805;&#26102;&#20445;&#25345;&#23433;&#38745;&#20043;&#31867;&#30340;&#35758;&#20250;&#31243;&#24207;&#12290;&#20294;&#24403;&#23427;&#21644;&#20449;&#24687;&#31649;&#29702;&#25216;&#26415;&#25509;&#21512;&#26102;&#65292;&#19968;&#20010;&#36816;&#20316;&#33391;&#22909;&#30340;&#24320;&#28304;&#39033;&#30446;&#23601;&#20250;&#26159;&#25171;&#20102;&#20852;&#22859;&#21058;&#30340;&#20250;&#35758;&#31243;&#24207;&#12290;&#30001;&#20110;&#24320;&#28304;&#39033;&#30446;&#20013;&#30340;&#20132;&#27969;&#37117;&#26159;&#36890;&#36807;&#20070;&#20889;&#26041;&#24335;&#23436;&#25104;&#30340;&#65292;&#30001;&#27492;&#21457;&#23637;&#20986;&#20102;&#22797;&#26434;&#30340;&#31995;&#32479;&#65306;&#20026;&#20102;&#24688;&#24403;&#23548;&#21521;&#21644;&#26631;&#35760;&#25968;&#25454;&#65307;&#20026;&#20102;&#36991;&#20813;&#20250;&#36896;&#25104;&#35823;&#35299;&#30340;&#37325;&#22797;&#65307;&#20026;&#20102;&#20648;&#23384;&#21644;&#26816;&#32034;&#25968;&#25454;&#65307;&#20026;&#20102;&#32416;&#27491;&#38169;&#35823;&#21644;&#24223;&#24323;&#30340;&#20449;&#24687;&#65307;&#20197;&#21450;&#20026;&#20102;&#22312;&#21457;&#29616;&#19981;&#30456;&#20851;&#20449;&#24687;&#30340;&#26032;&#20851;&#31995;&#26102;&#36827;&#34892;&#20851;&#32852;&#12290;&#24320;&#28304;&#39033;&#30446;&#20013;&#30340;&#27963;&#36291;&#21442;&#19982;&#32773;&#24050;&#32463;&#23558;&#25484;&#25569;&#20102;&#20854;&#20013;&#30340;&#24456;&#22810;&#25216;&#26415;&#65292;&#24182;&#19988;&#32463;&#24120;&#20026;&#20102;&#30830;&#20445;&#20449;&#24687;&#34987;&#27491;&#30830;&#30340;&#23548;&#21521;&#32780;&#36827;&#34892;&#22797;&#26434;&#30340;&#25163;&#24037;&#20219;&#21153;&#12290;&#20294;&#26159;&#25152;&#26377;&#30340;&#21162;&#21147;&#37117;&#26159;&#20381;&#36182;&#20110;&#22797;&#26434;&#30340;&#36719;&#20214;&#25903;&#25345;&#12290;&#20132;&#27969;&#23186;&#20307;&#24212;&#35813;&#23613;&#21487;&#33021;&#22320;&#20381;&#38752;&#33258;&#36523;&#23436;&#25104;&#21457;&#36865;&#12289;&#26631;&#31614;&#21644;&#35760;&#24405;&#24037;&#20316;&#65292;&#24212;&#35813;&#30830;&#20445;&#20154;&#23613;&#21487;&#33021;&#26041;&#20415;&#22320;&#24471;&#21040;&#36825;&#20123;&#20449;&#24687;&#12290;&#24403;&#28982;&#22312;&#23454;&#38469;&#20013;&#65292;&#22312;&#25972;&#20010;&#36807;&#31243;&#20013;&#30340;&#24456;&#22810;&#26041;&#38754;&#36824;&#26159;&#38656;&#35201;&#20154;&#30340;&#24178;&#39044;&#65292;&#24182;&#19988;&#37325;&#35201;&#20043;&#22788;&#22312;&#20110;&#36719;&#20214;&#20351;&#24471;&#36825;&#31181;&#24178;&#39044;&#20063;&#26159;&#26041;&#20415;&#30340;&#12290;&#20294;&#24635;&#24471;&#26469;&#35828;&#65292;&#22914;&#26524;&#20154;&#33021;&#30830;&#20445;&#39318;&#27425;&#36827;&#20837;&#31995;&#32479;&#26102;&#20449;&#24687;&#30340;&#23548;&#21521;&#21644;&#26631;&#31614;&#37117;&#26159;&#27491;&#30830;&#30340;&#65292;&#36719;&#20214;&#24212;&#35813;&#34987;&#37197;&#32622;&#25104;&#21487;&#20197;&#20805;&#20998;&#21033;&#29992;&#36825;&#20123;&#20803;&#25968;&#25454;&#12290;</p><p>&#27492;&#31456;&#20013;&#30340;&#24314;&#35758;&#37117;&#26159;&#38750;&#24120;&#21153;&#23454;&#30340;&#65292;&#37117;&#26159;&#22522;&#20110;&#26126;&#30830;&#30340;&#36719;&#20214;&#21644;&#20351;&#29992;&#27169;&#24335;&#30340;&#32463;&#39564;&#12290;&#20294;&#36825;&#37324;&#19981;&#20165;&#20165;&#26159;&#25945;&#25480;&#23454;&#29992;&#30340;&#25216;&#26415;&#12290;&#32780;&#26159;&#36890;&#36807;&#35768;&#22810;&#23567;&#33539;&#20363;&#26469;&#28436;&#31034;&#19968;&#31181;&#24635;&#20307;&#24577;&#24230;&#65292;&#36825;&#31181;&#24577;&#24230;&#21487;&#20197;&#26368;&#22823;&#31243;&#24230;&#30340;&#20419;&#36827;&#20320;&#39033;&#30446;&#20013;&#30340;&#22909;&#30340;&#20449;&#24687;&#31649;&#29702;&#12290;&#36825;&#31181;&#24577;&#24230;&#21253;&#21547;&#20102;&#25216;&#26415;&#25216;&#24039;&#21516;&#20154;&#21147;&#25216;&#24039;&#30340;&#32467;&#21512;&#12290;&#24182;&#19988;&#25216;&#26415;&#25216;&#24039;&#26159;&#20851;&#38190;&#65292;&#22240;&#20026;&#24403;&#26032;&#30340;&#38656;&#27714;&#20986;&#29616;&#26102;&#65292;&#20449;&#24687;&#31649;&#29702;&#36719;&#20214;&#24635;&#38656;&#35201;&#37197;&#32622;&#65292;&#20197;&#21450;&#19968;&#23450;&#37327;&#30340;&#25345;&#32493;&#32500;&#25252;&#21644;&#35843;&#25972;&#65288;&#20363;&#22914;&#65292;&#20851;&#20110;&#22914;&#20309;&#22788;&#29702;&#39033;&#30446;&#25104;&#38271;&#30340;&#35752;&#35770;&#21442;&#21152;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="bug-tracker.html#bug-filtering" title="Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;">the section called &#8220;Bug&#36319;&#36394;&#30340;&#39044;&#36807;&#28388;&#8221;</a>&#65289;&#12290;&#20154;&#21147;&#25216;&#24039;&#20063;&#26159;&#19981;&#21487;&#25110;&#32570;&#30340;&#65292;&#22240;&#20026;&#20154;&#31867;&#31038;&#21306;&#20063;&#38656;&#35201;&#32500;&#25252;&#65306;&#22914;&#20309;&#21033;&#29992;&#36825;&#20123;&#24037;&#20855;&#30340;&#20248;&#21183;&#26377;&#26102;&#20505;&#19981;&#26159;&#31435;&#21051;&#23601;&#24456;&#26126;&#26174;&#65292;&#22312;&#26377;&#20123;&#39033;&#30446;&#26696;&#20363;&#20013;&#29978;&#33267;&#26377;&#20914;&#31361;&#30340;&#20064;&#24815;&#65288;&#20363;&#22914;&#65292;&#21442;&#35265;<a class="xref" href="mailing-lists.html" title="&#37038;&#20214;&#21015;&#34920;">the section called &#8220;&#37038;&#20214;&#21015;&#34920;&#8221;</a>&#20013;&#30340;&#20851;&#20110;&#22312;&#22806;&#21457;&#30340;&#37038;&#20214;&#21015;&#34920;&#36890;&#21578;&#20013;&#35774;&#32622;<code class="systemitem">Reply-to</code>&#22836;&#30340;&#35752;&#35770;&#65289;&#12290;&#24212;&#35813;&#40723;&#21169;&#39033;&#30446;&#30456;&#20851;&#30340;&#27599;&#19968;&#20010;&#20154;&#22312;&#27491;&#30830;&#30340;&#26102;&#38388;&#12289;&#27491;&#30830;&#30340;&#22320;&#28857;&#23613;&#33258;&#24049;&#30340;&#32844;&#36131;&#26469;&#20445;&#25345;&#39033;&#30446;&#20449;&#24687;&#32452;&#32455;&#30340;&#33391;&#22909;&#12290;&#36129;&#29486;&#32773;&#21442;&#19982;&#30340;&#31243;&#24230;&#36234;&#28145;&#65292;&#23601;&#36234;&#33021;&#39044;&#26399;&#22905;&#33021;&#23398;&#20064;&#26356;&#22797;&#26434;&#21644;&#19987;&#19994;&#30340;&#25216;&#26415;&#12290;</p><p>&#20449;&#24687;&#31649;&#29702;&#27809;&#26377;&#29616;&#25104;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#26377;&#30528;&#20247;&#22810;&#30340;&#19981;&#30830;&#23450;&#22240;&#32032;&#12290;&#20320;&#21487;&#33021;&#22909;&#19981;&#23481;&#26131;&#25165;&#25226;&#25152;&#26377;&#20107;&#24773;&#37117;&#25353;&#29031;&#33258;&#24049;&#30340;&#24847;&#24895;&#23436;&#25104;&#37197;&#32622;&#65292;&#24182;&#19988;&#31038;&#21306;&#30340;&#22823;&#22810;&#25968;&#20154;&#21442;&#19982;&#36827;&#26469;&#65292;&#20294;&#38543;&#30528;&#39033;&#30446;&#30340;&#25104;&#38271;&#35753;&#26576;&#20123;&#23454;&#36341;&#19981;&#33021;&#25193;&#23637;&#12290;&#25110;&#32773;&#26412;&#26469;&#20320;&#30340;&#39033;&#30446;&#27491;&#22312;&#31283;&#27493;&#21457;&#23637;&#65292;&#25216;&#26415;&#22522;&#30784;&#26550;&#26500;&#20063;&#33021;&#20351;&#24320;&#21457;&#32773;&#21644;&#29992;&#25143;&#30340;&#31038;&#21306;&#20851;&#31995;&#34701;&#27965;&#65292;&#20294;&#31361;&#28982;&#26576;&#20123;&#20154;&#20986;&#29616;&#65292;&#21457;&#26126;&#20102;&#19968;&#20010;&#20840;&#26032;&#30340;&#20449;&#24687;&#31649;&#29702;&#26381;&#21153;&#65292;&#24456;&#24555;&#26032;&#26469;&#30340;&#20250;&#36136;&#38382;&#20026;&#20309;&#20320;&#30340;&#39033;&#30446;&#19981;&#29992;&#23427;&#8212;&#20363;&#22914;&#24456;&#22810;&#22312;&#32500;&#22522;&#65288;&#21442;&#35265;<a class="ulink" href="http://en.wikipedia.org/wiki/Wiki" target="_top">http://en.wikipedia.org/wiki/Wiki</a>&#65289;&#21457;&#26126;&#20043;&#21069;&#24314;&#31435;&#30340;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#23601;&#27491;&#38754;&#20020;&#36825;&#19968;&#38382;&#39064;&#12290;&#24456;&#22810;&#38382;&#39064;&#38656;&#35201;&#20915;&#26029;&#65292;&#27604;&#22914;&#26435;&#34913;&#29983;&#20135;&#20449;&#24687;&#30340;&#26041;&#20415;&#24615;&#36824;&#26159;&#28040;&#36153;&#20449;&#24687;&#30340;&#26041;&#20415;&#24615;&#65292;&#25110;&#32773;&#26435;&#34913;&#33457;&#22312;&#37197;&#32622;&#20449;&#24687;&#31649;&#29702;&#36719;&#20214;&#19978;&#30340;&#26102;&#38388;&#19982;&#20854;&#20026;&#39033;&#30446;&#24102;&#26469;&#30340;&#30410;&#22788;&#12290;</p><p>&#23567;&#24515;&#36807;&#24230;&#33258;&#21160;&#21270;&#30340;&#35825;&#24785;&#65292;&#35831;&#33258;&#21160;&#21270;&#37027;&#20123;&#30495;&#27491;&#38656;&#35201;&#20154;&#20204;&#20851;&#27880;&#30340;&#19996;&#35199;&#12290;&#25216;&#26415;&#22522;&#30784;&#26550;&#26500;&#26159;&#37325;&#35201;&#30340;&#65292;&#20294;&#25512;&#21160;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#36816;&#36716;&#30340;&#26159;&#21442;&#19982;&#30340;&#20154;&#30340;&#24847;&#24895;&#8212;&#29992;&#26234;&#24935;&#30340;&#26041;&#24335;&#34920;&#36798;&#30340;&#24847;&#24895;&#8212;&#36890;&#36807;&#20154;&#30340;&#21442;&#19982;&#12290;&#25216;&#26415;&#22522;&#30784;&#26550;&#26500;&#21482;&#26159;&#20026;&#20154;&#38376;&#36798;&#21040;&#36825;&#20010;&#30446;&#26631;&#25552;&#20379;&#20415;&#21033;&#12290;</p></div><div class="sect1" title="&#19968;&#20010;&#39033;&#30446;&#38656;&#35201;&#20160;&#20040;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="tools-needed"></a>&#19968;&#20010;&#39033;&#30446;&#38656;&#35201;&#20160;&#20040;</h2></div></div></div><p>&#22823;&#37096;&#20998;&#24320;&#28304;&#39033;&#30446;&#33267;&#23569;&#25552;&#20379;&#20102;&#26368;&#20302;&#38480;&#24230;&#30340;&#26631;&#20934;&#24037;&#20855;&#29992;&#20110;&#31649;&#29702;&#20449;&#24687;&#65306;</p><div class="variablelist"><dl><dt><span class="term">&#32593;&#31449;</span></dt><dd><p>&#20027;&#35201;&#26159;&#19968;&#20010;&#38598;&#20013;&#23558;&#39033;&#30446;&#20449;&#24687;&#21457;&#24067;&#32473;&#20844;&#20849;&#30340;&#21333;&#21521;&#28192;&#36947;&#12290;&#32593;&#31449;&#20063;&#21487;&#20197;&#20316;&#20026;&#20854;&#20182;&#39033;&#30446;&#24037;&#20855;&#30340;&#31649;&#29702;&#30028;&#38754;&#20351;&#29992;&#12290;</p></dd><dt><span class="term">&#37038;&#20214;&#21015;&#34920;</span></dt><dd><p>&#36890;&#24120;&#20250;&#26159;&#39033;&#30446;&#20013;&#26368;&#27963;&#36291;&#30340;&#36890;&#35759;&#25163;&#27573;&#65292;&#26159;&#8220;&#21487;&#35760;&#24405;&#30340;&#23186;&#20171;&#8221;&#12290;</p></dd><dt><span class="term">&#29256;&#26412;&#25511;&#21046;</span></dt><dd><p>&#35753;&#24320;&#21457;&#32773;&#21487;&#20197;&#26041;&#20415;&#22320;&#31649;&#29702;&#20195;&#30721;&#30340;&#21464;&#26356;&#65292;&#21253;&#25324;&#22238;&#22797;&#21644;&#8220;&#21464;&#26356;&#36716;&#36816;&#8221;&#12290;&#35753;&#27599;&#19968;&#20010;&#20154;&#33021;&#30475;&#21040;&#20195;&#30721;&#30340;&#21464;&#21270;&#12290;</p></dd><dt><span class="term">Bug&#36319;&#36394;</span></dt><dd><p>&#20351;&#24320;&#21457;&#32773;&#21487;&#20197;&#36861;&#36394;&#20182;&#20204;&#27491;&#22312;&#24037;&#20316;&#30340;&#20869;&#23481;&#65292;&#20114;&#30456;&#21327;&#35843;&#65292;&#20197;&#21450;&#35745;&#21010;&#21457;&#24067;&#12290;&#35753;&#27599;&#20010;&#20154;&#37117;&#33021;&#26597;&#35810;Bug&#30340;&#29366;&#20917;&#24182;&#19988;&#35760;&#24405;&#29305;&#23450;Bug&#30340;&#20449;&#24687;&#65288;&#20363;&#22914;&#37325;&#29616;&#26041;&#27861;&#65289;&#12290;&#19981;&#20165;&#33021;&#29992;&#20110;&#23545;bug&#30340;&#36861;&#36394;&#65292;&#32780;&#19988;&#33021;&#29992;&#20110;&#20219;&#21153;&#12289;&#21457;&#24067;&#21644;&#26032;&#29305;&#24615;&#31561;&#31561;&#12290;</p></dd><dt><span class="term">&#21363;&#26102;&#32842;&#22825;</span></dt><dd><p>&#19968;&#20010;&#21487;&#20197;&#24555;&#36895;&#21644;&#26041;&#20415;&#30340;&#36827;&#34892;&#35752;&#35770;&#21644;&#38382;&#31572;&#30340;&#22320;&#26041;&#65292;&#32570;&#28857;&#26159;&#24182;&#19981;&#24635;&#26159;&#33021;&#23436;&#25972;&#22320;&#24402;&#26723;&#12290;</p></dd></dl></div><p>&#36825;&#20010;&#24037;&#20855;&#38598;&#20013;&#30340;&#27599;&#20010;&#24037;&#20855;&#28385;&#36275;&#20102;&#19981;&#21516;&#30340;&#38656;&#35201;&#65292;&#20294;&#23427;&#20204;&#30340;&#21151;&#33021;&#37117;&#26159;&#30456;&#20851;&#30340;&#65292;&#36825;&#20123;&#24037;&#20855;&#24517;&#39035;&#33021;&#21327;&#21516;&#24037;&#20316;&#12290;&#19979;&#38754;&#25105;&#20204;&#23558;&#26816;&#39564;&#23427;&#20204;&#24590;&#26679;&#20570;&#21040;&#36825;&#19968;&#28857;&#65292;&#32780;&#26368;&#37325;&#35201;&#30340;&#26159;&#22914;&#20309;&#35753;&#20154;&#20204;&#20351;&#29992;&#23427;&#12290;&#32593;&#31449;&#23558;&#25918;&#22312;&#26368;&#21518;&#35752;&#35770;&#65292;&#22240;&#20026;&#23427;&#26356;&#22810;&#30340;&#26159;&#25198;&#28436;&#20854;&#20182;&#32452;&#20214;&#40655;&#21512;&#21058;&#30340;&#35282;&#33394;&#65292;&#32780;&#19981;&#26159;&#24037;&#20855;&#26412;&#36523;&#12290;</p><p>&#36890;&#36807;&#20351;&#29992;<em class="firstterm">&#21253;&#35013;&#20027;&#26426;</em>&#20320;&#20063;&#35768;&#33021;&#36991;&#20813;&#24456;&#22810;&#36873;&#25321;&#24037;&#20855;&#21644;&#37197;&#32622;&#30340;&#22836;&#30140;&#20107;&#65292;&#21253;&#35013;&#20027;&#26426;&#26159;&#19968;&#20010;&#25552;&#20379;&#39044;&#21253;&#35013;&#65292;&#27169;&#26495;&#21270;&#30340;&#32593;&#39029;&#21306;&#22495;&#65292;&#20197;&#21450;&#21487;&#36816;&#34892;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#30340;&#25152;&#26377;&#24037;&#20855;&#30340;&#26381;&#21153;&#22120;&#12290;&#20851;&#20110;&#21253;&#35013;&#20027;&#26426;&#20248;&#32570;&#28857;&#30340;&#35752;&#35770;&#21487;&#20197;&#30475;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="web-site.html#canned-hosting" title="&#21253;&#35013;&#20027;&#26426;">the section called &#8220;&#21253;&#35013;&#20027;&#26426;&#8221;</a>&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp655" href="#idp655" class="para">12</a>] </sup>&#25688;&#33258;<em class="citetitle">&#12298;&#20154;&#26376;&#31070;&#35805;&#12299;</em>&#65292;1975&#12290;&#21442;&#35265;<a class="ulink" href="http://en.wikipedia.org/wiki/The_Mythical_Man-Month" target="_top">http://en.wikipedia.org/wiki/The_Mythical_Man-Month</a>&#21644;<a class="ulink" href="http://en.wikipedia.org/wiki/Brooks_Law" target="_top">http://en.wikipedia.org/wiki/Brooks_Law</a>&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="announcing.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="mailing-lists.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#36890;&#21578; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#37038;&#20214;&#21015;&#34920;</td></tr></table></div></body></html>
