<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#29616;&#29366;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="introduction.html" title="Chapter 1. &#20171;&#32461;"><link rel="prev" href="introduction.html" title="Chapter 1. &#20171;&#32461;"><link rel="next" href="getting-started.html" title="Chapter 2. &#36215;&#27493;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29616;&#29366;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="introduction.html">Prev</a> </td><th width="60%" align="center">Chapter 1. &#20171;&#32461;</th><td width="20%" align="right"> <a accesskey="n" href="getting-started.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#29616;&#29366;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="today"></a>&#29616;&#29366;</h2></div></div></div><p>&#24403;&#36816;&#20316;&#19968;&#20010;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#26102;&#65292;&#20320;&#19981;&#24517;&#22312;&#26085;&#24120;&#24037;&#20316;&#20013;&#35848;&#35770;&#27785;&#37325;&#30340;&#21746;&#23398;&#21629;&#39064;&#12290;&#31243;&#24207;&#21592;&#19981;&#20250;&#35201;&#27714;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#20154;&#21644;&#33258;&#24049;&#22312;&#25152;&#26377;&#20107;&#24773;&#19978;&#33021;&#22815;&#30475;&#27861;&#19968;&#33268;&#65288;&#37027;&#20123;&#36825;&#19968;&#28857;&#19978;&#22362;&#25345;&#30340;&#20154;&#24456;&#24555;&#23601;&#20250;&#21457;&#29616;&#20182;&#20204;&#26080;&#27861;&#22312;&#20219;&#20309;&#39033;&#30446;&#20869;&#24037;&#20316;&#65289;&#12290;&#20294;&#26159;&#20320;&#24517;&#39035;&#20102;&#35299;&#8220;&#33258;&#30001;&#36824;&#26159;&#24320;&#28304;&#8221;&#20043;&#20105;&#30340;&#23384;&#22312;&#65292;&#37096;&#20998;&#21407;&#22240;&#26159;&#36991;&#20813;&#35848;&#35770;&#24341;&#36215;&#37096;&#20998;&#24320;&#21457;&#32773;&#25269;&#35302;&#30340;&#20107;&#24773;&#65292;&#37096;&#20998;&#26159;&#22240;&#20026;&#29702;&#35299;&#24320;&#21457;&#32773;&#30340;&#21160;&#26426;&#26159;&#31649;&#29702;&#19968;&#20010;&#39033;&#30446;&#26368;&#22909;&#30340;&#26041;&#27861;&#8212;&#26377;&#26102;&#65292;&#26159;&#31649;&#29702;&#19968;&#20010;&#39033;&#30446;&#30340;<span class="emphasis"><em>&#21807;&#19968;</em></span>&#26041;&#27861;&#12290;</p><p>&#33258;&#30001;&#36719;&#20214;&#26159;&#19968;&#31181;&#26377;&#20851;&#36873;&#25321;&#30340;&#25991;&#21270;&#12290;&#20320;&#24517;&#39035;&#39318;&#20808;&#29702;&#35299;&#20026;&#20160;&#20040;&#20154;&#20204;&#20250;&#21442;&#19982;&#20854;&#20013;&#65292;&#25165;&#33021;&#25104;&#21151;&#22320;&#36816;&#20316;&#19968;&#20010;&#39033;&#30446;&#12290;&#24378;&#21046;&#26159;&#19981;&#31649;&#29992;&#30340;&#12290;&#22914;&#26524;&#19968;&#20010;&#39033;&#30446;&#35753;&#20154;&#19981;&#39640;&#20852;&#20102;&#65292;&#20182;&#20204;&#20250;&#31435;&#21051;&#36716;&#31227;&#21040;&#21478;&#19968;&#20010;&#39033;&#30446;&#12290;&#33258;&#30001;&#36719;&#20214;&#30340;&#29420;&#29305;&#20043;&#22788;&#36824;&#22312;&#20110;&#24535;&#24895;&#32773;&#31038;&#21306;&#30340;&#25237;&#36164;&#24378;&#24230;&#12290;&#22823;&#37096;&#20998;&#20869;&#37096;&#30340;&#20154;&#20174;&#26469;&#27809;&#26377;&#21644;&#21478;&#19968;&#20010;&#21442;&#19982;&#32773;&#38754;&#23545;&#38754;&#22320;&#20132;&#27969;&#36807;&#65292;&#21482;&#26159;&#22312;&#39640;&#20852;&#26102;&#25424;&#21161;&#19968;&#28857;&#26102;&#38388;&#12290;&#36890;&#24120;&#20154;&#31867;&#29992;&#26469;&#20114;&#30456;&#32467;&#35782;&#24182;&#32467;&#25104;&#29282;&#22266;&#30340;&#22242;&#20307;&#30340;&#28192;&#36947;&#34987;&#21387;&#32553;&#25104;&#20102;&#19968;&#26465;&#32454;&#31649;&#65306;&#22312;&#38190;&#30424;&#19978;&#25171;&#23383;&#28982;&#21518;&#36890;&#36807;&#30005;&#32518;&#20256;&#36755;&#12290;&#22240;&#27492;&#65292;&#24418;&#25104;&#19968;&#20010;&#26377;&#20957;&#32858;&#21147;&#21644;&#19987;&#27880;&#21147;&#30340;&#32452;&#32455;&#38656;&#35201;&#33457;&#19978;&#24456;&#38271;&#26102;&#38388;&#12290;&#30456;&#21453;&#65292;&#22312;&#39318;&#27425;&#25509;&#35302;&#30340;&#20116;&#20998;&#38047;&#20869;&#27969;&#22833;&#19968;&#20010;&#28508;&#22312;&#30340;&#24320;&#21457;&#32773;&#26159;&#38750;&#24120;&#23481;&#26131;&#30340;&#12290;&#22914;&#26524;&#23545;&#19968;&#20010;&#39033;&#30446;&#27809;&#26377;&#33391;&#22909;&#30340;&#31532;&#19968;&#21360;&#35937;&#65292;&#26032;&#26469;&#32773;&#24456;&#23569;&#20250;&#32473;&#20104;&#31532;&#20108;&#27425;&#26426;&#20250;&#12290;</p><p>&#20851;&#31995;&#30340;&#26080;&#24120;&#24615;&#65292;&#25110;&#32773;&#26159;<span class="emphasis"><em>&#28508;&#22312;&#30340;</em></span>&#26080;&#24120;&#24615;&#65292;&#20063;&#35768;&#26159;&#38754;&#23545;&#19968;&#20010;&#26032;&#39033;&#30446;&#26102;&#26368;&#35753;&#20154;&#30031;&#24807;&#30340;&#19968;&#28857;&#12290;&#22914;&#20309;&#25165;&#33021;&#20351;&#36825;&#20123;&#20154;&#23613;&#21487;&#33021;&#38271;&#26102;&#38388;&#30340;&#21574;&#22312;&#19968;&#36215;&#20570;&#19968;&#20123;&#26377;&#29992;&#30340;&#20107;&#65311;&#36825;&#20010;&#38382;&#39064;&#30340;&#31572;&#26696;&#36275;&#21487;&#20197;&#29992;&#26412;&#20070;&#21097;&#20313;&#30340;&#31687;&#24133;&#26469;&#35828;&#26126;&#65292;&#20294;&#22914;&#26524;&#24517;&#39035;&#29992;&#19968;&#21477;&#35805;&#26469;&#22238;&#31572;&#65292;&#20250;&#26159;&#36825;&#26679;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#20154;&#20204;&#24212;&#35813;&#33021;&#24863;&#21040;&#20182;&#20204;&#21516;&#19968;&#20010;&#39033;&#30446;&#30340;&#32852;&#31995;&#21644;&#23545;&#23427;&#30340;&#24433;&#21709;&#21147;&#26159;&#30452;&#25509;&#21516;&#20182;&#20204;&#30340;&#36129;&#29486;&#25104;&#27491;&#27604;&#30340;&#12290;</em></span></p></blockquote></div><p>&#27809;&#26377;&#21738;&#31867;&#24320;&#21457;&#32773;&#25110;&#26159;&#28508;&#22312;&#30340;&#24320;&#21457;&#32773;&#24212;&#35813;&#24863;&#21040;&#33258;&#24049;&#30001;&#20110;&#38750;&#25216;&#26415;&#21407;&#22240;&#32780;&#34987;&#21306;&#21035;&#23545;&#24453;&#12290;&#29305;&#21035;&#26159;&#39033;&#30446;&#30340;&#36190;&#21161;&#21830;&#25110;&#26159;&#39046;&#21462;&#25253;&#37228;&#30340;&#24320;&#21457;&#32773;&#22312;&#36825;&#19968;&#28857;&#19978;&#35201;&#29305;&#21035;&#23567;&#24515;&#65292;&#36825;&#19968;&#28857;&#23558;&#22312;&#21518;&#38754;&#30340;<a class="xref" href="money.html" title="Chapter 5. &#37329;&#38065;">Chapter 5, <i>&#37329;&#38065;</i></a>&#35814;&#32454;&#35752;&#35770;&#12290;&#24403;&#28982;&#65292;&#36825;&#19981;&#26159;&#35828;&#22914;&#26524;&#27809;&#26377;&#20844;&#21496;&#36190;&#21161;&#21830;&#30340;&#35805;&#23601;&#21487;&#20197;&#39640;&#26517;&#26080;&#24551;&#20102;&#12290;&#38065;&#21482;&#26159;&#33021;&#24433;&#21709;&#39033;&#30446;&#25104;&#21151;&#30340;&#35768;&#22810;&#22240;&#32032;&#20043;&#19968;&#12290;&#36824;&#26377;&#35832;&#22914;&#35821;&#35328;&#30340;&#36873;&#25321;&#12289;&#35768;&#21487;&#35777;&#30340;&#36873;&#25321;&#12289;&#20309;&#31181;&#24320;&#21457;&#36807;&#31243;&#12289;&#35774;&#31435;&#20309;&#31181;&#31867;&#22411;&#30340;&#22522;&#30784;&#26550;&#26500;&#20043;&#31867;&#30340;&#35768;&#22810;&#20854;&#20182;&#22240;&#32032;&#12290;&#22312;&#33391;&#22909;&#30340;&#22522;&#30784;&#19978;&#24320;&#22987;&#19968;&#20010;&#39033;&#30446;&#26159;<a class="link" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">&#19979;&#19968;&#31456;</a>&#30340;&#20027;&#39064;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="introduction.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="introduction.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="getting-started.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 1. &#20171;&#32461; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 2. &#36215;&#27493;</td></tr></table></div></body></html>
