<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#36716;&#21270;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;"><link rel="prev" href="share-management.html" title="&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153;"><link rel="next" href="committers.html" title="&#25552;&#20132;&#32773;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#36716;&#21270;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="share-management.html">Prev</a> </td><th width="60%" align="center">Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;</th><td width="20%" align="right"> <a accesskey="n" href="committers.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#36716;&#21270;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transitions"></a>&#36716;&#21270;</h2></div></div></div><p>&#19968;&#27425;&#21448;&#19968;&#27425;&#65292;&#26576;&#20010;&#20301;&#32622;&#19978;&#25215;&#25285;&#36131;&#20219;&#30340;&#24535;&#24895;&#32773;&#65288;&#20363;&#22914;&#34917;&#19969;&#31649;&#29702;&#21592;&#65292;&#32763;&#35793;&#31649;&#29702;&#21592;&#31561;&#65289;&#26080;&#27861;&#25191;&#34892;&#35813;&#20301;&#32622;&#30340;&#36131;&#20219;&#12290;&#36825;&#21487;&#33021;&#26159;&#22240;&#20026;&#20986;&#29616;&#20102;&#36229;&#20986;&#20182;&#39044;&#26399;&#30340;&#24037;&#20316;&#65292;&#25110;&#32773;&#23436;&#20840;&#22240;&#20026;&#26159;&#35768;&#22810;&#22806;&#37096;&#22240;&#32032;&#65306;&#32467;&#23130;&#12289;&#23401;&#23376;&#20986;&#19990;&#12289;&#26032;&#30340;&#32769;&#26495;&#31561;&#31561;&#20043;&#31867;&#30340;&#12290;</p><p>&#24403;&#19968;&#20010;&#24535;&#24895;&#32773;&#38519;&#20837;&#36825;&#31181;&#22659;&#22320;&#65292;&#20182;&#36890;&#24120;&#19981;&#20250;&#31435;&#21051;&#27880;&#24847;&#21040;&#12290;&#21487;&#33021;&#20197;&#24456;&#23567;&#30340;&#31243;&#24230;&#21457;&#29983;&#30528;&#21464;&#21270;&#65292;&#32780;&#19988;&#27809;&#26377;&#19968;&#20010;&#26102;&#21051;&#21487;&#20197;&#33258;&#35273;&#30340;&#35748;&#35782;&#21040;&#20182;&#24050;&#32463;&#26080;&#27861;&#23436;&#25104;&#36825;&#20010;&#35282;&#33394;&#30340;&#20219;&#21153;&#12290;&#30456;&#21453;&#65292;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#37096;&#20998;&#21482;&#26159;&#21457;&#29616;&#26377;&#19968;&#27573;&#26102;&#38388;&#26410;&#33021;&#21548;&#21040;&#20182;&#30340;&#28040;&#24687;&#20102;&#12290;&#28982;&#21518;&#20182;&#20204;&#20250;&#20250;&#31435;&#21051;&#21254;&#24537;&#34892;&#21160;&#65292;&#32780;&#20182;&#21017;&#35273;&#24471;&#38271;&#26102;&#38388;&#23545;&#39033;&#30446;&#30340;&#24608;&#24930;&#26159;&#26377;&#24871;&#30340;&#65292;&#24182;&#31435;&#21051;&#36830;&#22812;&#36214;&#24037;&#12290;&#28982;&#21518;&#23601;&#26377;&#26356;&#38271;&#30340;&#19968;&#27573;&#26102;&#38388;&#20320;&#26080;&#27861;&#21548;&#21040;&#20182;&#30340;&#28040;&#24687;&#65292;&#28982;&#21518;&#21487;&#33021;&#26159;&#25110;&#21487;&#33021;&#19981;&#26159;&#21478;&#19968;&#22330;&#24908;&#20081;&#12290;&#20294;&#26159;&#65292;&#24456;&#23569;&#26377;&#20027;&#21160;&#25552;&#20986;&#30340;&#27491;&#24335;&#36766;&#32844;&#12290;&#24535;&#24895;&#32773;&#29992;&#33258;&#24049;&#30340;&#19994;&#20313;&#26102;&#38388;&#24037;&#20316;&#65292;&#36766;&#32844;&#24847;&#21619;&#30528;&#20844;&#24320;&#25215;&#35748;&#20182;&#30340;&#19994;&#20313;&#26102;&#38388;&#34987;&#27704;&#20037;&#30340;&#20943;&#23569;&#20102;&#12290;&#20154;&#20204;&#36890;&#24120;&#19981;&#24895;&#24847;&#36825;&#26679;&#20570;&#12290;</p><p>&#22240;&#32780;&#65292;&#38656;&#35201;&#20320;&#21644;&#39033;&#30446;&#20013;&#30340;&#20854;&#20182;&#20154;&#21457;&#29616;&#21457;&#29983;&#30340;&#20107;&#24773;&#8212;&#25110;&#32773;&#35828;&#21457;&#29616;&#27809;&#26377;&#21457;&#29983;&#8212;&#65292;&#24182;&#33021;&#22815;&#35810;&#38382;&#21738;&#20010;&#24535;&#24895;&#32773;&#21487;&#20197;&#32487;&#32493;&#12290;&#36825;&#31181;&#35810;&#38382;&#24517;&#39035;&#26159;&#21451;&#22909;&#21644;100%&#26080;&#20869;&#30106;&#30340;&#12290;&#20320;&#30340;&#30446;&#30340;&#21482;&#26159;&#25214;&#20986;&#30495;&#30456;&#65292;&#32780;&#19981;&#26159;&#35753;&#20154;&#38590;&#36807;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#20010;&#35810;&#38382;&#24212;&#24403;&#23545;&#39033;&#30446;&#30340;&#20854;&#20182;&#20154;&#21487;&#35265;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#30693;&#36947;&#19968;&#20123;&#24517;&#39035;&#31169;&#19979;&#36827;&#34892;&#30340;&#21407;&#22240;&#65292;&#20063;&#27809;&#26377;&#38382;&#39064;&#12290;&#20844;&#24320;&#36827;&#34892;&#30340;&#20027;&#35201;&#21407;&#22240;&#26159;&#22914;&#26524;&#24535;&#24895;&#32773;&#22238;&#22797;&#35828;&#26080;&#27861;&#23436;&#25104;&#24037;&#20316;&#26102;&#65292;&#23601;&#21487;&#20197;&#20026;&#20320;&#30340;<span class="emphasis"><em>&#19979;&#19968;&#27425;</em></span>&#20844;&#24320;&#21457;&#24067;&#25552;&#20379;&#19968;&#20010;&#19978;&#19979;&#25991;&#29615;&#22659;&#65306;&#35831;&#27714;&#19968;&#20010;&#26032;&#30340;&#24535;&#24895;&#32773;&#23436;&#25104;&#35813;&#35282;&#33394;&#12290;</p><p>&#26377;&#26102;&#65292;&#19968;&#20010;&#24535;&#24895;&#32773;&#26080;&#27861;&#23436;&#25104;&#20854;&#25509;&#21463;&#30340;&#24037;&#20316;&#65292;&#20294;&#26159;&#27809;&#26377;&#24847;&#35782;&#21040;&#25110;&#19981;&#24076;&#26395;&#25215;&#35748;&#36825;&#20010;&#20107;&#23454;&#12290;&#24403;&#28982;&#65292;&#20219;&#20309;&#20154;&#22312;&#19968;&#24320;&#22987;&#37117;&#20250;&#36935;&#21040;&#22256;&#38590;&#65292;&#29305;&#21035;&#26159;&#24403;&#36131;&#20219;&#24456;&#22797;&#26434;&#26102;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#26576;&#20154;&#19981;&#21162;&#21147;&#23436;&#25104;&#20182;&#25509;&#21463;&#30340;&#20219;&#21153;&#65292;&#21363;&#20351;&#25152;&#26377;&#20154;&#37117;&#32473;&#20986;&#20840;&#37096;&#30340;&#24110;&#21161;&#21644;&#24314;&#35758;&#65292;&#26368;&#21518;&#21807;&#19968;&#30340;&#35299;&#20915;&#26041;&#27861;&#21482;&#33021;&#26159;&#20182;&#25918;&#24323;&#24182;&#35753;&#20854;&#20182;&#20154;&#26469;&#23581;&#35797;&#12290;&#32780;&#19988;&#22914;&#26524;&#36825;&#20010;&#20154;&#27809;&#33021;&#30475;&#21040;&#36825;&#19968;&#28857;&#65292;&#38656;&#35201;&#26377;&#20154;&#21578;&#35785;&#20182;&#12290;&#22522;&#26412;&#19978;&#26469;&#35762;&#65292;&#25105;&#35748;&#20026;&#21482;&#26377;&#19968;&#31181;&#22788;&#29702;&#26041;&#27861;&#65292;&#20294;&#26159;&#38656;&#35201;&#19968;&#20010;&#22810;&#27493;&#39588;&#30340;&#36807;&#31243;&#65292;&#27599;&#20010;&#27493;&#39588;&#37117;&#24456;&#37325;&#35201;&#12290;</p><p>&#39318;&#20808;&#65292;&#30830;&#20445;&#20320;&#33258;&#24049;&#27809;&#26377;&#21457;&#30127;&#12290;&#22312;&#31169;&#19979;&#19982;&#39033;&#30446;&#30340;&#20854;&#20182;&#20154;&#35752;&#35770;&#65292;&#30475;&#30475;&#20182;&#20204;&#26159;&#19981;&#26159;&#21644;&#20320;&#19968;&#26679;&#35748;&#20026;&#38382;&#39064;&#24456;&#20005;&#37325;&#12290;&#21363;&#20351;&#20320;&#20204;&#24050;&#32463;&#32943;&#23450;&#65292;&#36825;&#26679;&#20063;&#23454;&#29616;&#20102;&#35753;&#20854;&#20182;&#20154;&#30693;&#26195;&#20320;&#20204;&#27491;&#32771;&#34385;&#35753;&#36825;&#20010;&#20154;&#36864;&#20986;&#30340;&#30446;&#30340;&#12290;&#36890;&#24120;&#19981;&#20250;&#26377;&#20154;&#21453;&#23545;&#8212;&#20182;&#20204;&#20250;&#24456;&#39640;&#20852;&#20320;&#32937;&#36127;&#36825;&#20010;&#23604;&#23596;&#30340;&#20219;&#21153;&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#19981;&#24517;&#21160;&#25163;&#20102;&#65281;</p><p>&#19979;&#19968;&#27493;&#65292;<span class="emphasis"><em>&#31169;&#19979;</em></span>&#32852;&#31995;&#26377;&#38382;&#39064;&#30340;&#24535;&#24895;&#32773;&#24182;&#21451;&#22909;&#21644;&#30452;&#25509;&#30340;&#21578;&#30693;&#20182;&#65292;&#20320;&#25152;&#21457;&#29616;&#30340;&#38382;&#39064;&#12290;&#20026;&#20102;&#25928;&#26524;&#65292;&#35201;&#23613;&#21487;&#33021;&#25552;&#20379;&#22810;&#30340;&#23454;&#20363;&#12290;&#30830;&#20445;&#33021;&#22815;&#25351;&#20986;&#20154;&#20204;&#26159;&#22914;&#20309;&#19981;&#24895;&#32487;&#32493;&#24110;&#21161;&#30340;&#65292;&#32780;&#38382;&#39064;&#19968;&#30452;&#23384;&#22312;&#24471;&#19981;&#21040;&#25913;&#21892;&#12290;&#35831;&#30830;&#20445;&#33457;&#36739;&#38271;&#30340;&#26102;&#38388;&#32534;&#20889;&#35813;&#37038;&#20214;&#65292;&#23545;&#20110;&#27492;&#31867;&#37038;&#20214;&#65292;&#22914;&#26524;&#20320;&#26080;&#27861;&#25903;&#25345;&#20320;&#25152;&#35828;&#30340;&#65292;&#26368;&#22909;&#23601;&#20160;&#20040;&#37117;&#19981;&#35201;&#35828;&#12290;&#35201;&#35828;&#26126;&#20320;&#20250;&#25214;&#19968;&#20010;&#26032;&#30340;&#24535;&#24895;&#32773;&#20805;&#24403;&#36825;&#20010;&#35282;&#33394;&#65292;&#20294;&#20063;&#35201;&#25351;&#20986;&#26377;&#35768;&#22810;&#26041;&#27861;&#21487;&#20197;&#25903;&#25345;&#36825;&#20010;&#39033;&#30446;&#12290;&#22312;&#36825;&#20010;&#38454;&#27573;&#65292;&#19981;&#35201;&#35828;&#20320;&#24050;&#32463;&#20026;&#27492;&#19982;&#20854;&#20182;&#20154;&#36827;&#34892;&#20102;&#35848;&#35805;&#65307;&#27809;&#26377;&#20154;&#24076;&#26395;&#34987;&#21578;&#30693;&#26377;&#20154;&#22312;&#20934;&#22791;&#25509;&#26367;&#20182;&#12290;</p><p>&#20043;&#21518;&#65292;&#21487;&#20197;&#26377;&#35768;&#22810;&#20854;&#20182;&#19981;&#21516;&#30340;&#26041;&#27861;&#12290;&#26368;&#21487;&#33021;&#30340;&#21453;&#24212;&#26159;&#20182;&#20204;&#21487;&#33021;&#20250;&#35748;&#21487;&#20320;&#65292;&#25110;&#32773;&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#20250;&#20105;&#35770;&#65292;&#24182;&#24895;&#24847;&#36864;&#20986;&#12290;&#22914;&#26524;&#26159;&#36825;&#20010;&#24773;&#20917;&#65292;&#24314;&#35758;&#20182;&#33258;&#24049;&#20316;&#20986;&#22768;&#26126;&#65292;&#28982;&#21518;&#20320;&#21487;&#20197;&#36319;&#20174;&#20182;&#30340;&#25991;&#31456;&#23547;&#25214;&#19968;&#20010;&#26367;&#20195;&#32773;&#12290;</p><p>&#25110;&#32773;&#65292;&#20182;&#21487;&#33021;&#35748;&#21487;&#33258;&#24049;&#30340;&#38382;&#39064;&#65292;&#20294;&#26159;&#35831;&#27714;&#22810;&#19968;&#28857;&#30340;&#26102;&#38388;&#65288;&#25110;&#32773;&#20877;&#22810;&#19968;&#27425;&#26426;&#20250;&#65292;&#20363;&#22914;&#31163;&#25955;&#20219;&#21153;&#35282;&#33394;&#30340;&#21457;&#24067;&#31649;&#29702;&#21592;&#65289;&#12290;&#22914;&#20309;&#21709;&#24212;&#36825;&#20010;&#24773;&#20917;&#38656;&#35201;&#24744;&#30340;&#21028;&#26029;&#65292;&#20294;&#26159;&#26080;&#35770;&#24744;&#22914;&#20309;&#20570;&#65292;&#19981;&#35201;&#20165;&#20165;&#22240;&#20026;&#24863;&#21040;&#26080;&#27861;&#25298;&#32477;&#36825;&#31181;&#35831;&#27714;&#32780;&#34920;&#31034;&#21516;&#24847;&#12290;&#36825;&#26679;&#20250;&#24310;&#32493;&#30171;&#33510;&#65292;&#20294;&#19981;&#20250;&#26377;&#25152;&#20943;&#36731;&#12290;&#36825;&#36890;&#24120;&#26159;&#25298;&#32477;&#36825;&#31181;&#35831;&#27714;&#30340;&#22909;&#21407;&#22240;&#65292;&#25442;&#21477;&#35805;&#35828;&#23601;&#26159;&#24050;&#32463;&#32473;&#20102;&#36275;&#22815;&#22810;&#30340;&#26426;&#20250;&#65292;&#32780;&#29616;&#22312;&#23601;&#26159;&#24471;&#21040;&#30340;&#32467;&#26524;&#12290;&#36825;&#26159;&#25105;&#21578;&#30693;&#26576;&#20154;&#26080;&#27861;&#32937;&#36127;&#21457;&#24067;&#31649;&#29702;&#21592;&#35282;&#33394;&#30340;&#37038;&#20214;&#65306;</p><div class="blockquote"><blockquote class="blockquote"><pre class="screen">
&gt;&#22914;&#26524;&#24744;&#24076;&#26395;&#21035;&#20154;&#26367;&#20195;&#25105;&#65292;&#25105;&#20250;&#26377;&#22909;&#30340;&#23558;&#36825;&#20010;&#35282;&#33394;&#20132;&#32473;&#19979;&#20010;&#20154;&#12290;&#25105;&#26377;&#20010;
&gt;&#19981;&#24773;&#20043;&#35831;&#12290;&#25105;&#24076;&#26395;&#20877;&#23581;&#35797;&#19968;&#27425;&#21457;&#24067;&#26469;&#35777;&#26126;&#25105;&#12290;
&gt;
&#25105;&#23436;&#20840;&#33021;&#22815;&#20307;&#20250;&#24744;&#30340;&#24819;&#27861;&#65292;&#20294;&#26159;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979; &#65292;&#25105;&#20204;&#26080;&#27861;&#8220;&#20877;&#35797;&#19968;&#27425;&#8221;&#12290;

&#36825;&#19981;&#26159;&#31532;&#19968;&#27425;&#25110;&#31532;&#20108;&#27425;&#21457;&#24067;&#65292;&#32780;&#26159;&#31532;6&#25110;&#31532;7&#27425;... &#25105;&#30693;&#36947;&#20320;&#20063;&#23545;&#32467;&#26524;
&#19981;&#22815;&#28385;&#24847;&#65288;&#22240;&#20026;&#25105;&#20204;&#20043;&#21069;&#24050;&#32463;&#35752;&#35770;&#36807;&#65289;&#12290;&#25152;&#20197;&#25105;&#20204;&#24050;&#32463;&#26377;&#25928;&#30340;&#23436;&#25104;&#20102;
&#20877;&#27425;&#23581;&#35797;&#30340;&#31243;&#24207;&#12290;&#26368;&#32456;&#65292;&#24635;&#26377;&#19968;&#27425;&#26159;&#26368;&#21518;&#19968;&#27425;... &#25105;&#35748;&#20026;[&#19978;&#19968;&#27425;&#21457;&#24067;]&#23601;&#26159;
&#20102;&#12290;

</pre></blockquote></div><p>&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#65292;&#24535;&#24895;&#32773;&#21487;&#33021;&#23436;&#20840;&#19981;&#21516;&#24847;&#12290;&#28982;&#21518;&#20320;&#38656;&#35201;&#25509;&#21463;&#20107;&#24773;&#21464;&#24471;&#23604;&#23596;&#24182;&#39044;&#20808;&#20934;&#22791;&#12290;&#29616;&#22312;&#26159;&#19982;&#20854;&#20182;&#20154;&#35752;&#35770;&#27492;&#20107;&#20102;&#65288;&#20294;&#22312;&#24471;&#21040;&#20182;&#20204;&#30340;&#20801;&#35768;&#21069;&#65292;&#36824;&#26159;&#19981;&#33021;&#35828;&#26159;&#35841;&#65292;&#22240;&#20026;&#36825;&#20123;&#23545;&#35805;&#26159;&#26426;&#23494;&#30340;&#65289;&#30340;&#26102;&#20505;&#20102;&#65292;&#20063;&#26159;&#20320;&#35748;&#20026;&#39033;&#30446;&#19981;&#24212;&#35813;&#36825;&#26679;&#32487;&#32493;&#19979;&#21435;&#30340;&#26102;&#20505;&#20102;&#12290;&#22362;&#25345;&#65292;&#20294;&#19981;&#35201;&#23041;&#32961;&#12290;&#35831;&#27880;&#24847;&#65292;&#22823;&#22810;&#25968;&#35282;&#33394;&#30340;&#36716;&#25442;&#21487;&#33021;&#22987;&#20110;&#26576;&#20010;&#26032;&#20154;&#24050;&#32463;&#24320;&#22987;&#20102;&#23427;&#30340;&#24037;&#20316;&#65292;&#32780;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#32769;&#20154;&#32467;&#26463;&#20102;&#20182;&#30340;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20105;&#35770;&#20107;&#20851;&#35282;&#33394;&#65292;&#35692;&#22914;&#35828;&#38382;&#39064;&#31649;&#29702;&#21592;&#65292;&#22312;&#20219;&#20309;&#26102;&#21051;&#20320;&#21644;&#20854;&#20182;&#26377;&#24433;&#21709;&#30340;&#20154;&#21487;&#20197;&#35831;&#27714;&#19968;&#20010;&#26032;&#30340;&#38382;&#39064;&#31649;&#29702;&#21592;&#12290;&#21487;&#20197;&#19981;&#24517;&#26159;&#20043;&#21069;&#20570;&#36825;&#20123;&#20107;&#30340;&#20154;&#20572;&#27490;&#20102;&#24037;&#20316;&#65292;&#21482;&#35201;&#20182;&#27809;&#26377;&#22952;&#23475;&#65288;&#25925;&#24847;&#25110;&#20854;&#20182;&#21407;&#22240;&#65289;&#26032;&#24535;&#24895;&#32773;&#30340;&#21162;&#21147;&#12290;</p><p>&#26377;&#19968;&#20010;&#20805;&#28385;&#35825;&#24785;&#21147;&#30340;&#24819;&#27861;&#65306;&#20026;&#20309;&#19981;&#21435;&#23581;&#35797;&#19981;&#24517;&#21578;&#30693;&#20154;&#20204;&#36766;&#32844;&#65292;&#32780;&#20165;&#20165;&#26159;&#20026;&#20182;&#23547;&#25214;&#19968;&#20123;&#24110;&#21161;&#65311;&#20026;&#20160;&#20040;&#19981;&#21487;&#20197;&#26377;&#20004;&#20010;&#38382;&#39064;&#31649;&#29702;&#21592;&#12289;&#34917;&#19969;&#31649;&#29702;&#21592;&#25110;&#20219;&#20309;&#35282;&#33394;&#65311;</p><p>&#23613;&#31649;&#29702;&#35770;&#19978;&#21548;&#36215;&#26469;&#24456;&#19981;&#38169;&#65292;&#20294;&#36890;&#24120;&#19981;&#26159;&#19968;&#20010;&#22909;&#26041;&#27861;&#12290;&#26159;&#20160;&#20040;&#35753;&#31649;&#29702;&#21592;&#35282;&#33394;&#21487;&#20197;&#24037;&#20316;&#8212;&#26159;&#20160;&#20040;&#20351;&#20043;&#21457;&#25381;&#20316;&#29992;&#65292;&#23454;&#38469;&#19978;&#8212;&#24212;&#35813;&#26159;&#38750;&#38598;&#20013;&#21270;&#12290;&#33021;&#22815;&#20197;&#38750;&#38598;&#20013;&#24335;&#23436;&#25104;&#30340;&#24037;&#20316;&#36890;&#24120;&#24050;&#32463;&#36825;&#26679;&#20570;&#20102;&#12290;&#26377;&#20004;&#20010;&#20154;&#32937;&#36127;&#31649;&#29702;&#21592;&#35282;&#33394;&#20250;&#24102;&#26469;&#20004;&#20010;&#20154;&#30340;&#20132;&#27969;&#36127;&#25285;&#65292;&#20063;&#21487;&#33021;&#20250;&#24102;&#26469;&#19981;&#21487;&#38752;&#30340;&#20114;&#30456;&#20381;&#36182;&#65288;&#8220;&#25105;&#20197;&#20026;&#20320;&#24102;&#20102;&#24613;&#25937;&#31665;&#65281;&#8221;  &#8220;&#25105;&#65311;&#25105;&#20197;&#20026;<span class="emphasis"><em>&#20320;</em></span>&#24102;&#20102;&#24613;&#25937;&#31665;&#8221;&#65289;&#12290;&#24403;&#28982;&#65292;&#20063;&#26377;&#20363;&#22806;&#12290;&#26377;&#26102;&#20004;&#20010;&#20154;&#21487;&#20197;&#37197;&#21512;&#30340;&#26497;&#22909;&#65292;&#25110;&#32773;&#20219;&#21153;&#26412;&#36523;&#23601;&#21487;&#20197;&#36731;&#26494;&#30340;&#20998;&#25955;&#32473;&#22810;&#20010;&#20154;&#12290;&#20294;&#24403;&#20320;&#35265;&#21040;&#26576;&#20154;&#25379;&#25166;&#20110;&#26576;&#20010;&#20182;&#19981;&#36866;&#21512;&#30340;&#35282;&#33394;&#26102;&#65292;&#36890;&#24120;&#24182;&#19981;&#20250;&#36215;&#22826;&#22823;&#20316;&#29992;&#12290;&#22914;&#26524;&#20182;&#19968;&#24320;&#22987;&#23601;&#33021;&#22815;&#37325;&#35270;&#36825;&#20123;&#38382;&#39064;&#65292;&#20043;&#21069;&#23601;&#20250;&#23547;&#27714;&#27492;&#31867;&#24110;&#21161;&#12290;&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#65292;&#35753;&#19968;&#20010;&#20154;&#25345;&#32493;&#20570;&#19968;&#20214;&#19981;&#20250;&#35753;&#20154;&#20851;&#27880;&#30340;&#20107;&#24773;&#37117;&#26159;&#22833;&#31036;&#30340;&#12290;</p><p>&#35753;&#26576;&#20010;&#20154;&#38544;&#36864;&#30340;&#37325;&#35201;&#22240;&#32032;&#26159;&#38544;&#31169;&#65306;&#32473;&#20182;&#31354;&#38388;&#20316;&#20986;&#20915;&#23450;&#65292;&#32780;&#19981;&#35201;&#35753;&#20182;&#24863;&#35273;&#22823;&#23478;&#37117;&#22312;&#20851;&#27880;&#21644;&#31561;&#24453;&#12290;&#25105;&#26366;&#32463;&#29359;&#36807;&#36825;&#31181;&#38169;&#35823;&#8212;&#38750;&#24120;&#26126;&#26174;&#30340;&#38169;&#35823;&#65292;&#22238;&#24819;&#36215;&#26469;&#8212;&#20063;&#23601;&#26159;&#21516;&#26102;&#21521;&#25152;&#26377;&#30340;&#19977;&#26041;&#24403;&#20107;&#20154;&#21457;&#36865;&#37038;&#20214;&#65292;&#24449;&#27714;Subversion&#21457;&#24067;&#31649;&#29702;&#21592;&#65292;&#25509;&#26367;&#21478;&#22806;&#20004;&#20010;&#24535;&#24895;&#32773;&#12290;&#25105;&#24050;&#32463;&#19982;&#20004;&#20010;&#20154;&#31169;&#19979;&#26377;&#25152;&#20132;&#27969;&#65292;&#20063;&#30693;&#36947;&#20182;&#20204;&#24076;&#26395;&#32937;&#36127;&#36825;&#20010;&#36131;&#20219;&#12290;&#25152;&#20197;&#25105;&#35748;&#20026;&#65292;&#26377;&#20123;&#22825;&#30495;&#26377;&#20123;&#36831;&#38045;&#65292;&#36890;&#36807;&#21521;&#20182;&#20204;&#21516;&#26102;&#21457;&#36865;&#37038;&#20214;&#24320;&#22987;&#20102;&#36716;&#25442;&#36807;&#31243;&#65292;&#30465;&#21435;&#20102;&#26102;&#38388;&#21644;&#20105;&#36777;&#12290;&#25105;&#35774;&#24819;&#29616;&#22312;&#30340;&#21457;&#24067;&#31649;&#29702;&#21592;&#24050;&#32463;&#23436;&#20840;&#24847;&#35782;&#21040;&#20102;&#38382;&#39064;&#65292;&#20063;&#20250;&#31435;&#21051;&#29702;&#35299;&#25105;&#30340;&#29992;&#24847;&#12290;</p><p>&#25105;&#38169;&#20102;&#12290;&#24403;&#21069;&#30340;&#21457;&#24067;&#31649;&#29702;&#21592;&#34987;&#20882;&#29359;&#20102;&#65292;&#23436;&#23436;&#20840;&#20840;&#30340;&#20882;&#29359;&#20102;&#12290;&#34987;&#20154;&#35201;&#27714;&#20132;&#20986;&#24037;&#20316;&#26159;&#19968;&#22238;&#20107;&#65292;&#32780;&#22312;<span class="emphasis"><em>&#22823;&#24237;&#24191;&#20247;</em></span>&#20043;&#19979;&#34987;&#35201;&#27714;&#20132;&#20986;&#24037;&#20316;&#21017;&#26159;&#21478;&#22806;&#19968;&#22238;&#20107;&#12290;&#24403;&#25105;&#24847;&#35782;&#21040;&#25105;&#30340;&#34892;&#20026;&#26377;&#20123;&#20882;&#29359;&#65292;&#25105;&#20570;&#20986;&#20102;&#36947;&#27465;&#12290;&#20182;&#26368;&#32456;&#26377;&#31036;&#35980;&#30340;&#36864;&#20986;&#65292;&#24182;&#32487;&#32493;&#21442;&#19982;&#36825;&#20010;&#39033;&#30446;&#12290;&#20294;&#26159;&#20182;&#30340;&#24863;&#24773;&#21463;&#21040;&#20102;&#20260;&#23475;&#65292;&#26080;&#38656;&#20877;&#35828;&#65292;&#23545;&#26032;&#24535;&#24895;&#32773;&#26469;&#35828;&#20063;&#19981;&#26159;&#19968;&#20010;&#21513;&#21033;&#30340;&#24320;&#22987;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="share-management.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="managing-volunteers.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="committers.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20687;&#20998;&#25285;&#25216;&#26415;&#20219;&#21153;&#19968;&#26679;&#20998;&#25285;&#31649;&#29702;&#20219;&#21153; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#25552;&#20132;&#32773;</td></tr></table></div></body></html>
