<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="prev" href="licensing-further-resources.html" title="&#28145;&#20837;&#36164;&#28304;"><link rel="next" href="bug-trackers.html" title="Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="licensing-further-resources.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="bug-trackers.html">Next</a></td></tr></table><hr></div><div class="appendix" title="Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;"><div class="titlepage"><div><div><h2 class="title"><a name="vc-systems"></a>Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</h2></div></div></div><div class="simplesect"><div class="titlepage"></div><p>&#36825;&#20123;&#26159;&#22312;2007&#24180;&#20013;&#27573;&#25105;&#25152;&#30693;&#30340;&#25152;&#26377;&#24320;&#28304;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#25105;&#26085;&#24120;&#21807;&#19968;&#20351;&#29992;&#30340;&#26159;Subversion&#12290;&#38500;&#20102;Subversion&#21644;CVS&#65292;&#25105;&#23545;&#22823;&#22810;&#25968;&#31995;&#32479;&#20165;&#26377;&#24456;&#23569;&#65292;&#29978;&#33267;&#27809;&#26377;&#20219;&#20309;&#32463;&#39564;&#65307;&#36825;&#37324;&#30340;&#20449;&#24687;&#21462;&#33258;&#20182;&#20204;&#30340;&#32593;&#31449;&#12290;&#20063;&#35831;&#30475;<a class="ulink" href="http://en.wikipedia.org/wiki/List_of_revision_control_software" target="_top">http://en.wikipedia.org/wiki/List_of_revision_control_software</a>&#12290;
</p><div class="sect2" title="CVS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-cvs"></a><span class="bold"><strong>CVS</strong></span> &#8212; <a class="ulink" href="http://www.nongnu.org/cvs/" target="_top">http://www.nongnu.org/cvs/</a></h3></div></div></div><p>CVS&#24050;&#32463;&#26377;&#24456;&#38271;&#30340;&#21382;&#21490;&#20102;&#65292;&#35768;&#22810;&#31243;&#24207;&#21592;&#24050;&#32463;&#38750;&#24120;&#29087;&#24713;&#12290;&#23427;&#26366;&#32463;&#26159;&#38761;&#21629;&#24615;&#30340;&#65306;&#23427;&#26159;&#31532;&#19968;&#20010;&#24320;&#28304;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#22312;&#32593;&#32476;&#19978;&#34987;&#24320;&#21457;&#32773;&#24191;&#27867;&#20351;&#29992;&#65288;&#22312;&#25105;&#25152;&#30693;&#30340;&#33539;&#22260;&#20869;&#65289;&#65292;&#20063;&#26159;&#31532;&#19968;&#20010;&#25552;&#20379;&#21311;&#21517;&#21482;&#35835;&#26816;&#20986;&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#35753;&#24515;&#24320;&#21457;&#32773;&#36731;&#26494;&#30340;&#24320;&#22987;&#21442;&#19982;&#39033;&#30446;&#12290;CVS&#21482;&#33021;&#29256;&#26412;&#21270;&#25991;&#20214;&#65292;&#20294;&#19981;&#21253;&#25324;&#30446;&#24405;&#65307;&#23427;&#33021;&#25552;&#20379;&#20998;&#25903;&#12289;&#26631;&#31614;&#21644;&#20248;&#33391;&#30340;&#23458;&#25143;&#31471;&#24615;&#33021;&#65292;&#20294;&#19981;&#33021;&#24456;&#22909;&#30340;&#22788;&#29702;&#22823;&#25991;&#20214;&#21644;&#20108;&#36827;&#21046;&#25991;&#20214;&#12290;&#23427;&#20063;&#19981;&#25903;&#25345;&#21407;&#23376;&#25552;&#20132;&#12290;<span class="emphasis"><em>[&#20813;&#36131;&#22768;&#26126;&#65306;&#22312;&#24320;&#22987;&#26367;&#20195;CVS&#30340;Subversion&#39033;&#30446;&#21069;&#65292;&#25105;&#20063;&#22312;CVS&#24320;&#21457;&#19978;&#27963;&#36291;&#20102;&#22823;&#32422;5&#24180;&#12290;]</em></span></p></div><div class="sect2" title="Subversion &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-subversion"></a><span class="bold"><strong>Subversion</strong></span> &#8212; <a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a></h3></div></div></div><p>Subversion&#26159;&#26368;&#26089;&#20063;&#26159;&#26368;&#37325;&#35201;&#30340;CVS&#26367;&#20195;&#32773;&#8212;&#20063;&#23601;&#26159;&#20197;&#19982;CVS&#36817;&#20284;&#30340;&#26041;&#27861;&#23454;&#29616;&#29256;&#26412;&#25511;&#21046;&#65292;&#20294;&#27809;&#26377;&#32463;&#24120;&#22256;&#25200;CVS&#29992;&#25143;&#30340;&#19968;&#20123;&#38382;&#39064;&#21644;&#29305;&#24615;&#32570;&#22833;&#12290;Subversion&#30340;&#19968;&#20010;&#30446;&#26631;&#23601;&#26159;&#20351;&#24050;&#32463;&#20064;&#24815;CVS&#30340;&#29992;&#25143;&#33021;&#22815;&#24179;&#28369;&#30340;&#36807;&#28193;&#21040;Subversion&#12290;&#36825;&#37324;&#27809;&#26377;&#31354;&#38388;&#35814;&#32454;&#25551;&#36848;Subversion&#30340;&#29305;&#24615;&#65307;&#30456;&#20851;&#20449;&#24687;&#35831;&#30475;&#23427;&#30340;&#32593;&#31449;<span class="emphasis"><em>[&#20813;&#36131;&#22768;&#26126;&#65306;&#25105;&#21442;&#19982;&#20102;Subversion&#24320;&#21457;&#65292;&#20063;&#26159;&#22312;&#26085;&#24120;&#20013;&#21807;&#19968;&#20351;&#29992;&#30340;&#31995;&#32479;&#12290;]</em></span></p></div><div class="sect2" title="SVK &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-svk"></a><span class="bold"><strong>SVK</strong></span> &#8212; <a class="ulink" href="http://svk.elixus.org/" target="_top">http://svk.elixus.org/</a></h3></div></div></div><p>&#23613;&#31649;SVK&#24314;&#31435;&#22312;Subversion&#20043;&#19978;&#65292;&#20294;&#23427;&#26356;&#31867;&#20284;&#20110;&#19979;&#38754;&#35828;&#30340;&#19968;&#20123;&#38750;&#38598;&#20013;&#24335;&#30340;&#31995;&#32479;&#65292;&#32780;&#19981;&#26159;Subversion&#12290;SVK&#25903;&#25345;&#20998;&#24067;&#24335;&#24320;&#21457;&#12289;&#26412;&#22320;&#25552;&#20132;&#12289;&#31934;&#23494;&#30340;&#21464;&#26356;&#21512;&#24182;&#21644;&#20174;&#38750;SVK&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#38236;&#20687;&#30446;&#24405;&#26641;&#30340;&#33021;&#21147;&#12290;&#35814;&#32454;&#20449;&#24687;&#21487;&#20197;&#30475;&#23427;&#30340;&#32593;&#31449;&#12290;</p></div><div class="sect2" title="Mercurial &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-mercurial"></a><span class="bold"><strong>Mercurial</strong></span> &#8212; <a class="ulink" href="http://www.selenic.com/mercurial/" target="_top">http://www.selenic.com/mercurial/</a></h3></div></div></div><p>Mercurial&#26159;&#19968;&#20010;&#20998;&#24067;&#24335;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#25552;&#20379;&#8220;&#23436;&#25972;&#30340;&#25991;&#20214;&#21644;&#21464;&#26356;&#38598;&#30340;&#36328;&#32034;&#24341;&#65307;&#26377;&#25928;&#29575;&#30340;&#24102;&#23485;&#21644;CPU&#19979;&#30340;HTTP&#21644;SSH&#21516;&#27493;&#21327;&#35758;&#65307;&#24320;&#21457;&#32773;&#20998;&#25903;&#38388;&#30340;&#20219;&#24847;&#21512;&#24182;&#65307;&#38598;&#25104;&#29420;&#31435;&#30340;web&#30028;&#38754;&#65307;UNIX&#12289;MacOS X&#21644;Windows&#36328;&#24179;&#21488;&#33021;&#21147;&#8221;&#20197;&#21450;&#26356;&#22810;&#65288;&#21069;&#38754;&#30340;&#29305;&#24615;&#21015;&#34920;&#26469;&#33258;Mercurial&#32593;&#31449;&#65289;&#12290;</p></div><div class="sect2" title="GIT &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-git"></a><span class="bold"><strong>GIT</strong></span> &#8212; <a class="ulink" href="http://git.or.cz/" target="_top">http://git.or.cz/</a></h3></div></div></div><p>GIT&#26159;Linus Torvalds&#24320;&#21551;&#30340;&#19968;&#20010;&#29992;&#20110;&#31649;&#29702;Linux kernel&#28304;&#20195;&#30721;&#30340;&#39033;&#30446;&#12290;&#19968;&#24320;&#22987;GIT&#20165;&#20165;&#38480;&#20110;&#28385;&#36275;kernel&#24320;&#21457;&#30340;&#38656;&#35201;&#65292;&#20294;&#19981;&#20037;&#23601;&#36229;&#20986;&#20102;&#36825;&#20010;&#33539;&#22260;&#65292;&#34987;&#29992;&#20110;Linux kernel&#20043;&#22806;&#30340;&#39033;&#30446;&#20013;&#12290;&#23427;&#30340;&#20027;&#39029;&#19978;&#35828;&#8220;...&#35774;&#35745;&#29992;&#20110;&#24555;&#36895;&#26377;&#25928;&#30340;&#22788;&#29702;&#38750;&#24120;&#22823;&#30340;&#39033;&#30446;&#65307;&#20027;&#35201;&#29992;&#20110;&#21508;&#31181;&#24320;&#28304;&#39033;&#30446;&#65292;&#26368;&#24341;&#20154;&#27880;&#30446;&#30340;&#26159;Linux kernel&#12290; Git&#23646;&#20110;&#20998;&#24067;&#24335;&#28304;&#20195;&#30721;&#31649;&#29702;&#24037;&#20855;&#65292;&#31867;&#20284;&#20110;GNU Arch&#25110;Monotone&#65288;&#25110;&#31169;&#26377;&#19990;&#30028;&#30340;BitKeeper&#65289;&#12290;&#27599;&#20010;Git&#24037;&#20316;&#30446;&#24405;&#26159;&#19968;&#20010;&#23436;&#25972;&#30340;&#29256;&#26412;&#24211;&#65292;&#21253;&#21547;&#20102;&#23436;&#25972;&#30340;&#20462;&#35746;&#36319;&#36394;&#33021;&#21147;&#65292;&#19981;&#20381;&#36182;&#20110;&#32593;&#32476;&#35775;&#38382;&#25110;&#20013;&#22830;&#26381;&#21153;&#22120;&#12290;&#8221;</p></div><div class="sect2" title="Bazaar &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-bazaar"></a><span class="bold"><strong>Bazaar</strong></span> &#8212; <a class="ulink" href="http://bazaar.canonical.com/" target="_top">http://bazaar.canonical.com/</a></h3></div></div></div><p>Bazaar&#36824;&#22788;&#20110;&#24320;&#21457;&#20013;&#12290;&#23427;&#26159;GNU Arch&#21327;&#35758;&#30340;&#19968;&#20010;&#23454;&#29616;&#65292;&#24182;&#20381;&#28982;&#38543;&#30528;&#28436;&#36827;&#30340;GNU Arch&#21327;&#35758;&#20445;&#25345;&#20860;&#23481;&#65292;&#32780;&#19988;&#19982;GNU Arch&#31038;&#21306;&#20013;&#23545;&#20110;&#38656;&#35201;&#29992;&#25143;&#21451;&#22909;&#30340;&#20219;&#20309;&#21327;&#35758;&#21464;&#26356;&#30340;&#36827;&#31243;&#36827;&#34892;&#37197;&#21512;&#65292;&#12290;</p></div><div class="sect2" title="Bazaar-NG &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-bazaar-ng"></a><span class="bold"><strong>Bazaar-NG</strong></span> &#8212; <a class="ulink" href="http://bazaar-ng.org/" target="_top">http://bazaar-ng.org/</a></h3></div></div></div><p>Bazaar-NG&#65288;&#25110;bzr&#65289;&#30446;&#21069;&#30001;Canonical&#65288;<a class="ulink" href="http://canonical.com/" target="_top">http://canonical.com/</a>&#65289;&#24320;&#21457;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#31181;&#22312;&#21333;&#20010;&#39033;&#30446;&#20013;&#32467;&#21512;&#38598;&#20013;&#24335;&#21644;&#38750;&#38598;&#20013;&#24335;&#24037;&#20316;&#30340;&#36873;&#25321;&#12290;&#20363;&#22914;&#65292;&#24403;&#22312;&#21150;&#20844;&#23460;&#20013;&#65292;&#20320;&#21487;&#20197;&#22312;&#19968;&#20010;&#20849;&#20139;&#30340;&#20013;&#22830;&#20998;&#25903;&#19978;&#24037;&#20316;&#65307;&#23545;&#20110;&#23454;&#39564;&#24615;&#21464;&#26356;&#25110;&#31163;&#32447;&#24037;&#20316;&#65292;&#20320;&#21487;&#20197;&#22312;&#31508;&#35760;&#26412;&#19978;&#24314;&#31435;&#19968;&#20010;&#20998;&#25903;&#65292;&#24182;&#22312;&#20043;&#21518;&#21512;&#24182;&#22238;&#21435;&#12290;</p></div><div class="sect2" title="Darcs &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-darcs"></a><span class="bold"><strong>Darcs</strong></span> &#8212; <a class="ulink" href="http://abridgegame.org/darcs/" target="_top">http://abridgegame.org/darcs/</a></h3></div></div></div><p>&#8220;David&#30340;&#39640;&#32423;&#20462;&#35746;&#25511;&#21046;&#31995;&#32479;&#65288;Advanced Revision Control System&#65289;&#26159;&#21478;&#19968;&#20010;CVS&#30340;&#26367;&#20195;&#32773;&#12290;&#23427;&#30001;Haskell&#32534;&#20889;&#65292;&#24050;&#32463;&#29992;&#20110;Linux&#12289;MacOS X&#12289;FreeBSD&#12289;OpenBSD&#21644;Microsoft Windows&#12290;Darcs&#21253;&#21547;&#19968;&#20010;&#21487;&#20197;&#26597;&#30475;&#29256;&#26412;&#24211;&#20869;&#23481;&#30340;cgi&#33050;&#26412;&#12290;&#8221;</p></div><div class="sect2" title="Arch &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-arch"></a><span class="bold"><strong>Arch</strong></span> &#8212; <a class="ulink" href="http://www.gnu.org/software/gnu-arch/" target="_top">http://www.gnu.org/software/gnu-arch/</a></h3></div></div></div><p>GNU Arch&#21516;&#26102;&#25903;&#25345;&#20998;&#24067;&#24335;&#21644;&#38598;&#20013;&#24335;&#30340;&#24320;&#21457;&#12290;&#24320;&#21457;&#32773;&#23558;&#21464;&#26356;&#25552;&#20132;&#21040;&#19968;&#20010;&#21487;&#20197;&#26159;&#20301;&#20110;&#26412;&#22320;&#30340;&#8221;&#24402;&#26723;&#65288;archive&#65289;&#8220;&#65292;&#32780;&#31649;&#29702;&#21592;&#21487;&#20197;&#26681;&#25454;&#24773;&#20917;&#23558;&#21464;&#26356;&#25512;&#21644;&#25289;&#21040;&#20854;&#20182;&#24402;&#26723;&#12290;&#36825;&#20010;&#26041;&#27861;&#23398;&#26263;&#31034;&#20102;Arch&#25552;&#20379;&#27604;CVS&#26356;&#31934;&#23494;&#30340;&#21512;&#24182;&#12290;Arch&#20063;&#20801;&#35768;&#19968;&#20010;&#20154;&#36731;&#26494;&#30340;&#20026;&#27809;&#26377;&#25552;&#20132;&#26435;&#38480;&#30340;&#20154;&#24314;&#31435;&#24402;&#26723;&#30340;&#20998;&#25903;&#12290;&#36825;&#37324;&#21482;&#26159;&#31616;&#30701;&#30340;&#25551;&#36848;&#65307;&#26356;&#22810;&#32454;&#33410;&#35831;&#30475;Arch&#32593;&#39029;&#12290;</p></div><div class="sect2" title="monotone &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-monotone"></a><span class="bold"><strong>monotone</strong></span> &#8212; <a class="ulink" href="http://www.venge.net/monotone/" target="_top">http://www.venge.net/monotone/</a></h3></div></div></div><p>&#8221;monotone&#26159;&#33258;&#30001;&#20998;&#24067;&#24335;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#21333;&#65292;&#21333;&#20010;&#25991;&#20214;&#20107;&#21153;&#30340;&#29256;&#26412;&#23384;&#20648;&#65292;&#21253;&#21547;&#23436;&#20840;&#26080;&#36830;&#25509;&#30340;&#25805;&#20316;&#65292;&#20197;&#21450;&#26377;&#25928;&#29575;&#30340;&#31471;&#21040;&#31471;&#21516;&#27493;&#21327;&#35758;&#12290;&#23427;&#29702;&#35299;&#21382;&#21490;&#25935;&#24863;&#30340;&#21512;&#24182;&#65292;&#36731;&#37327;&#32423;&#30340;&#20998;&#25903;&#12289;&#38598;&#25104;&#20195;&#30721;&#35780;&#23457;&#21644;&#31532;&#19977;&#26041;&#27979;&#35797;&#12290;&#23427;&#20351;&#29992;&#21152;&#23494;&#30340;&#21629;&#21517;&#21644;&#23458;&#25143;&#31471;&#30340;RSA&#20973;&#35777;&#12290;&#23427;&#20063;&#26377;&#19981;&#38169;&#30340;&#22269;&#38469;&#21270;&#25903;&#25345;&#65292;&#27809;&#26377;&#22806;&#37096;&#20381;&#36182;&#65292;&#21487;&#20197;&#25353;&#29031;GNU GPL&#36816;&#34892;&#22312;linux&#12289;solaris&#12289;OSX&#21644;windows&#19978;&#12290;&#8220;</p></div><div class="sect2" title="Codeville &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-codeville"></a><span class="bold"><strong>Codeville</strong></span> &#8212; <a class="ulink" href="http://codeville.org/" target="_top">http://codeville.org/</a></h3></div></div></div><p>&#8221;&#20026;&#20160;&#20040;&#38656;&#35201;&#21478;&#19968;&#31181;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65311;&#25152;&#26377;&#20854;&#20182;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#38656;&#35201;&#20320;&#23567;&#24515;&#36319;&#36394;&#20998;&#25903;&#38388;&#30340;&#20851;&#31995;&#65292;&#36825;&#26679;&#20320;&#25165;&#33021;&#19981;&#20250;&#37325;&#22797;&#21512;&#24182;&#21516;&#19968;&#20010;&#20914;&#31361;&#12290;Codeville&#26356;&#21152;&#33258;&#30001;&#12290;&#23427;&#20801;&#35768;&#20320;&#38543;&#26102;&#26356;&#26032;&#25110;&#25552;&#20132;&#21040;&#20219;&#24847;&#29256;&#26412;&#24211;&#65292;&#32780;&#26080;&#38656;&#25285;&#24515;&#37325;&#22797;&#21512;&#24182;&#12290;&#8220;</p><p>&#8221;Codeville&#20026;&#27599;&#20010;&#23436;&#25104;&#30340;&#21464;&#26356;&#21019;&#24314;&#19968;&#20010;&#26631;&#35782;&#31526;&#65292;&#24182;&#35760;&#20303;&#27599;&#20010;&#25991;&#20214;&#24050;&#32463;&#24050;&#32463;&#24212;&#29992;&#30340;&#21464;&#26356;&#21015;&#34920;&#12290;&#22914;&#26524;&#26377;&#20914;&#31361;&#65292;&#23427;&#20250;&#26816;&#26597;&#26576;&#19968;&#26041;&#26159;&#21542;&#24050;&#32463;&#24212;&#29992;&#21040;&#21478;&#19968;&#26041;&#65292;&#22914;&#26524;&#26159;&#36825;&#26679;&#65292;&#21017;&#20351;&#21478;&#19968;&#26041;&#33258;&#21160;&#33719;&#32988;&#12290;&#22914;&#26524;&#30830;&#23454;&#26377;&#38750;&#33258;&#21160;&#30340;&#21487;&#21512;&#24182;&#30340;&#29256;&#26412;&#20914;&#31361;&#65292;codeville&#21017;&#19982;CVS&#30340;&#24037;&#20316;&#26041;&#24335;&#30456;&#21516;&#12290;&#8220;</p></div><div class="sect2" title="Vesta &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-vesta"></a><span class="bold"><strong>Vesta</strong></span> &#8212; <a class="ulink" href="http://www.vestasys.org/" target="_top">http://www.vestasys.org/</a></h3></div></div></div><p>&#8221;Vesta&#26159;&#19968;&#20010;&#21487;&#31227;&#26893;&#30340;SCM[&#36719;&#20214;&#37197;&#32622;&#31649;&#29702;]&#31995;&#32479;&#65292;&#26088;&#22312;&#25903;&#25345;&#20219;&#24847;&#35268;&#27169;&#30340;&#65292;&#20174;&#30456;&#23545;&#36739;&#23567;&#65288;&#23567;&#20110;10000&#34892;&#28304;&#20195;&#30721;&#65289;&#21040;&#38750;&#24120;&#24040;&#22823;&#65288;10000000&#34892;&#65289;&#30340;&#36719;&#20214;&#31995;&#32479;&#30340;&#24320;&#21457;&#12290;&#8220;</p><p>&#8221;Vesta&#26159;&#19968;&#20010;&#25104;&#29087;&#30340;&#31995;&#32479;&#12290;&#23427;&#26159;Compaq/Digital&#31995;&#32479;&#30740;&#31350;&#20013;&#24515;10&#24180;&#30740;&#31350;&#21644;&#24320;&#21457;&#30340;&#25104;&#26524;&#65292;&#23427;&#26159;Compaq&#30340;Alpha&#24494;&#22788;&#29702;&#22120;&#22242;&#38431;&#20004;&#24180;&#21322;&#30340;&#26102;&#38388;&#37324;&#29983;&#20135;&#20351;&#29992;&#30340;&#31995;&#32479;&#12290;Alpha&#22242;&#38431;&#26377;&#36229;&#36807;150&#20010;&#27963;&#36291;&#24320;&#21457;&#32773;&#20301;&#20110;&#36317;&#31163;&#20960;&#21315;&#33521;&#37324;&#30340;&#20004;&#22320;&#65292;&#20998;&#21035;&#22312;&#32654;&#22269;&#30340;&#35199;&#28023;&#23736;&#21644;&#19996;&#28023;&#23736;&#12290;&#35813;&#22242;&#38431;&#20351;&#29992;Vesta&#31649;&#29702;&#32534;&#35793;&#36229;&#36807;130MB&#30340;&#28304;&#25968;&#25454;&#65292;&#20250;&#20135;&#29983;1.5GB&#30340;&#34893;&#29983;&#25968;&#25454;&#12290;&#19996;&#37096;&#30340;&#26500;&#24314;&#27599;&#22825;&#20250;&#20135;&#29983;10&#21040;15GB&#30340;&#34893;&#29983;&#25968;&#25454;&#65292;&#20840;&#37096;&#30001;Vesta&#31649;&#29702;&#12290;&#23613;&#31649;Vesta&#20027;&#35201;&#20851;&#27880;&#30340;&#26159;&#36719;&#20214;&#24320;&#21457;&#65292;&#20294;Vesta Alpha&#22242;&#38431;&#35774;&#27861;&#20351;&#31995;&#32479;&#21487;&#20197;&#29992;&#20110;&#30828;&#20214;&#24320;&#21457;&#65292;&#23558;&#23427;&#20204;&#30340;&#30828;&#20214;&#25551;&#36848;&#35821;&#35328;&#26816;&#20837;&#21040;Vesta&#30340;&#28304;&#20195;&#30721;&#25511;&#21046;&#29992;&#20855;&#20013;&#65292;&#24182;&#20351;&#29992;Vesta&#26500;&#24314;&#22120;&#26500;&#24314;&#27169;&#25311;&#22120;&#21644;&#20854;&#20182;&#34893;&#29983;&#30340;&#23545;&#35937;&#12290;&#21069;Alpha&#22242;&#38431;&#30340;&#25104;&#21592;&#65292;&#29616;&#22312;&#26159;Intel&#30340;&#19968;&#37096;&#20998;&#65292;&#22312;&#26032;&#30340;&#24494;&#22788;&#29702;&#22120;&#39033;&#30446;&#20013;&#36824;&#26159;&#32487;&#32493;&#20351;&#29992;Vesta&#12290;&#8220;</p></div><div class="sect2" title="Aegis &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-aegis"></a><span class="bold"><strong>Aegis</strong></span> &#8212; <a class="ulink" href="http://aegis.sourceforge.net/" target="_top">http://aegis.sourceforge.net/</a></h3></div></div></div><p>&#8221;Aegis&#26159;&#19968;&#20010;&#22522;&#20110;&#20107;&#21153;&#30340;&#36719;&#20214;&#37197;&#32622;&#31649;&#29702;&#31995;&#32479;&#12290;&#23427;&#25552;&#20379;&#20102;&#19968;&#20010;&#26694;&#26550;&#65292;&#22312;&#20854;&#20013;&#19968;&#20010;&#22242;&#38431;&#30340;&#24320;&#21457;&#32773;&#21487;&#20197;&#29420;&#31435;&#30340;&#20026;&#31243;&#24207;&#30340;&#22810;&#20010;&#21464;&#26356;&#24037;&#20316;&#65292;&#32780;Aegis&#21327;&#35843;&#23558;&#36825;&#20123;&#21464;&#26356;&#38598;&#25104;&#21040;&#31243;&#24207;&#30340;&#20027;&#28304;&#20013;&#65292;&#24182;&#23613;&#21487;&#33021;&#20943;&#23569;&#20013;&#26029;&#12290;&#8220;</p></div><div class="sect2" title="CVSNT &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-cvsnt"></a><span class="bold"><strong>CVSNT</strong></span> &#8212; <a class="ulink" href="http://cvsnt.org/" target="_top">http://cvsnt.org/</a></h3></div></div></div><p>&#8221;CVSNT&#19968;&#20010;&#39640;&#32423;&#36328;&#24179;&#21488;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#19982;&#34892;&#19994;&#30340;&#26631;&#20934;CVS&#21327;&#35758;&#30456;&#27604;&#65292;&#28155;&#21152;&#20102;&#35768;&#22810;&#38468;&#21152;&#29305;&#24615;&#12290; ... CVSNT&#26159;&#24320;&#28304;&#65292;&#20351;&#29992;GNU GPL&#35768;&#21487;&#35777;&#30340;&#33258;&#30001;&#36719;&#20214;&#12290;&#8220;&#23427;&#30340;&#29305;&#24615;&#21015;&#34920;&#21253;&#25324;&#36890;&#36807;CVS&#21327;&#35758;&#30340;&#35748;&#35777;&#65292;&#20197;&#21450;Windows&#29305;&#23450;&#30340;SSPI&#21644;&#27963;&#21160;&#30446;&#24405;&#12290;&#25903;&#25345;&#23433;&#20840;&#20256;&#36755;&#65292;&#36890;&#36807;sserver&#25110;&#21152;&#23494;&#30340;SSPI&#65307;&#36328;&#24179;&#21488;&#24615;&#65288;&#21487;&#20197;&#36816;&#34892;&#20110;Windows&#25110;Unix&#29615;&#22659;&#65289;&#65307;NT&#29256;&#26412;&#19982;Win32&#31995;&#32479;&#23436;&#20840;&#38598;&#25104;&#65307;MergePoint&#22788;&#29702;&#30340;&#21547;&#20041;&#26159;&#27809;&#26377;&#26356;&#22810;&#30340;&#26631;&#31614;&#21644;&#21512;&#24182;&#65307;&#22788;&#20110;&#27963;&#36291;&#24320;&#21457;&#20013;&#12290;</p></div><div class="sect2" title="META-CVS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-meta-cvs"></a><span class="bold"><strong>META-CVS</strong></span> &#8212; <a class="ulink" href="http://users.footprints.net/~kaz/mcvs.html" target="_top">http://users.footprints.net/~kaz/mcvs.html</a></h3></div></div></div><p>&#8221;Meta-CVS&#26159;&#19968;&#20010;&#24314;&#31435;&#22312;CVS&#21608;&#36793;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#23613;&#31649;&#23427;&#20445;&#30041;&#20102;CVS&#30340;&#22823;&#22810;&#25968;&#29305;&#24449;&#65292;&#21253;&#25324;&#25152;&#26377;&#30340;&#32593;&#32476;&#25903;&#25345;&#65292;&#23427;&#27604;CVS&#33021;&#24178;&#65292;&#26356;&#26131;&#20110;&#20351;&#29992;&#12290;&#8220;META-CVS&#30340;&#31449;&#28857;&#21253;&#25324;&#30340;&#29305;&#24615;&#21015;&#34920;&#65306;&#30446;&#24405;&#32467;&#26500;&#29256;&#26412;&#21270;&#65292;&#25913;&#36827;&#30340;&#25991;&#20214;&#31867;&#22411;&#22788;&#29702;&#65292;&#31867;&#20284;&#21644;&#26356;&#29992;&#25143;&#21451;&#22909;&#30340;&#20998;&#25903;&#21644;&#21512;&#24182;&#65292;&#25903;&#25345;&#31526;&#21495;&#38142;&#25509;&#65292;&#38468;&#21152;&#23646;&#24615;&#21015;&#34920;&#30340;&#29256;&#26412;&#21270;&#25968;&#25454;&#65292;&#25913;&#36827;&#30340;&#31532;&#19977;&#26041;&#25968;&#25454;&#23548;&#20837;&#65292;&#20197;&#21450;&#26131;&#20110;&#20174;CVS&#21319;&#32423;&#12290;</p></div><div class="sect2" title="OpenCM &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-opencm"></a><span class="bold"><strong>OpenCM</strong></span> &#8212; <a class="ulink" href="http://www.opencm.org/" target="_top">http://www.opencm.org/</a></h3></div></div></div><p>&#8221;OpenCM&#35774;&#35745;&#20026;&#19968;&#20010;&#23433;&#20840;&#30340;&#65292;CVS&#30340;&#39640;&#23436;&#25972;&#24615;&#26367;&#20195;&#20135;&#21697;&#12290;&#20851;&#38190;&#29305;&#24615;&#21015;&#34920;&#21487;&#20197;&#22312;&#29305;&#24615;&#39029;&#38754;&#25214;&#21040;&#12290;&#34429;&#28982;&#19981;&#20687;CVS&#37027;&#26679;&#8216;&#29305;&#24615;&#20016;&#23500;&#8217;&#65292;&#20294;&#23427;&#25552;&#20379;&#20102;&#19968;&#20123;CVS&#32570;&#20047;&#30340;&#29305;&#24615;&#12290;&#31616;&#35201;&#26469;&#35828;&#65292;OpenCM&#25552;&#20379;&#20102;&#31532;&#19968;&#27969;&#30340;&#37325;&#21629;&#21517;&#12289;&#37197;&#32622;&#12289;&#21152;&#23494;&#35748;&#35777;&#21644;&#35775;&#38382;&#25511;&#21046;&#21644;&#31532;&#19968;&#27969;&#30340;&#20998;&#25903;&#12290;&#8220;</p></div><div class="sect2" title="Stellation &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-stellation"></a><span class="bold"><strong>Stellation</strong></span> &#8212; <a class="ulink" href="http://www.eclipse.org/stellation/" target="_top">http://www.eclipse.org/stellation/</a></h3></div></div></div><p>&#8221;Stellation&#26159;&#19968;&#20010;&#39640;&#32423;&#65292;&#21487;&#25193;&#23637;&#30340;&#36719;&#20214;&#37197;&#32622;&#31649;&#29702;&#31995;&#32479;&#65292;&#26368;&#21021;&#30001;IBM&#30740;&#31350;&#38498;&#24320;&#21457;&#12290;&#34429;&#28982;Stellation&#25552;&#20379;&#20102;&#20219;&#20309;SCM&#31995;&#32479;&#25552;&#20379;&#30340;&#25152;&#26377;&#26631;&#20934;&#21151;&#33021;&#65292;&#20294;&#23427;&#20063;&#25552;&#20379;&#20102;&#35768;&#22810;&#39640;&#32423;&#29305;&#24615;&#65292;&#20363;&#22914;&#38754;&#21521;&#20219;&#21153;&#30340;&#21464;&#26356;&#31649;&#29702;&#65292;&#19968;&#33268;&#30340;&#39033;&#30446;&#29256;&#26435;&#21270;&#21644;&#36731;&#37327;&#32423;&#30340;&#20998;&#25903;&#65292;&#30446;&#30340;&#26159;&#31616;&#21270;&#30001;&#26494;&#25955;&#32467;&#21512;&#30340;&#24320;&#21457;&#32773;&#32452;&#25104;&#30340;&#22823;&#35268;&#27169;&#22242;&#38431;&#24320;&#21457;&#36719;&#20214;&#31995;&#32479;&#30340;&#38590;&#24230;&#12290;&#8220;</p></div><div class="sect2" title="PRCS &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-prcs"></a><span class="bold"><strong>PRCS</strong></span> &#8212; <a class="ulink" href="http://prcs.sourceforge.net/" target="_top">http://prcs.sourceforge.net/</a></h3></div></div></div><p>&#8221;PRCS&#65292;&#39033;&#30446;&#20462;&#35746;&#25511;&#21046;&#31995;&#32479;&#26159;&#19968;&#31995;&#21015;&#24037;&#20855;&#65288;&#22914;CVS&#65289;&#30340;&#21069;&#31471;&#65292;&#25552;&#20379;&#20102;&#19968;&#31181;&#20197;&#19968;&#20010;&#25972;&#20307;&#31649;&#29702;&#19968;&#32452;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#26041;&#27861;&#65292;&#20445;&#23384;&#20102;&#25972;&#20010;&#38598;&#21512;&#30340;&#19968;&#33268;&#29256;&#26412;&#12290; ... &#23427;&#30340;&#30446;&#30340;&#31867;&#20284;&#20110;SCCS&#12289;RCS&#21644;CVS&#65292;&#20294;&#26159;&#65288;&#33267;&#23569;&#26681;&#25454;&#20854;&#20316;&#32773;&#31216;&#65289;&#19982;&#36825;&#20123;&#24037;&#20855;&#30456;&#27604;&#26356;&#21152;&#31616;&#21333;&#12290;&#8220;</p></div><div class="sect2" title="ArX &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-arx"></a><span class="bold"><strong>ArX</strong></span> &#8212; <a class="ulink" href="http://www.nongnu.org/arx/" target="_top">http://www.nongnu.org/arx/</a></h3></div></div></div><p>ArX&#26159;&#19968;&#20010;&#20998;&#24067;&#24335;&#20462;&#35746;&#25511;&#21046;&#31995;&#32479;&#65292;&#25552;&#20379;&#20102;&#20998;&#25903;&#21644;&#21512;&#24182;&#29305;&#24449;&#65292;&#21152;&#23494;&#25968;&#25454;&#23436;&#25972;&#24615;&#39564;&#35777;&#21644;&#23558;&#24402;&#26723;&#36731;&#26494;&#21457;&#24067;&#21040;&#20219;&#24847;HTTP&#26381;&#21153;&#22120;&#30340;&#33021;&#21147;&#12290;</p></div><div class="sect2" title="SourceJammer &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-sourcejammer"></a><span class="bold"><strong>SourceJammer</strong></span> &#8212; <a class="ulink" href="http://sourcejammer.org/" target="_top">http://sourcejammer.org/</a></h3></div></div></div><p>&#8221;SourceJammer&#26159;&#19968;&#20010;&#20351;&#29992;Java&#32534;&#20889;&#30340;&#28304;&#20195;&#30721;&#25511;&#21046;&#21644;&#29256;&#26412;&#21270;&#31995;&#32479;&#12290;&#23427;&#30001;&#26381;&#21153;&#22120;&#31471;&#32500;&#25252;&#25991;&#20214;&#21644;&#29256;&#26412;&#21382;&#21490;&#65292;&#22788;&#29702;&#26816;&#20837;&#12289;&#26816;&#20986;&#31561;&#21151;&#33021;&#30340;&#32452;&#20214;&#65292;&#20197;&#21450;&#23458;&#25143;&#31471;&#21521;&#26381;&#21153;&#22120;&#21457;&#36215;&#35831;&#27714;&#24182;&#31649;&#29702;&#23458;&#25143;&#31471;&#25991;&#20214;&#31995;&#32479;&#30340;&#32452;&#20214;&#32452;&#25104;&#12290; &#8220;</p></div><div class="sect2" title="FastCST &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-fastcst"></a><span class="bold"><strong>FastCST</strong></span> &#8212; <a class="ulink" href="http://www.zedshaw.com/projects/fastcst/index.html" target="_top">http://www.zedshaw.com/projects/fastcst/index.html</a></h3></div></div></div><p>&#8221;&#19968;&#20010;&#20351;&#29992;&#25991;&#20214;&#20462;&#35746;&#21464;&#26356;&#38598;&#65292;&#24182;&#19988;&#20998;&#24067;&#24335;&#32780;&#38750;&#38598;&#20013;&#25511;&#21046;&#30340;&#8216;&#29616;&#20195;&#8217;&#31995;&#32479;&#12290;&#21482;&#35201;&#20320;&#26377;&#19968;&#20010;&#37038;&#20214;&#24080;&#21495;&#65292;&#20320;&#23601;&#21487;&#20197;&#20351;&#29992;FastCST&#12290;&#23545;&#20110;&#36739;&#22823;&#30340;&#20998;&#21457;&#65292;&#21482;&#38656;&#35201;&#19968;&#20010;FTP&#26381;&#21153;&#22120;&#21644;&#19968;&#20010;HTTP&#26381;&#21153;&#22120;&#65292;&#25110;&#20351;&#29992;&#20869;&#32622;&#30340;&#8216;serve&#8217;&#21629;&#20196;&#26469;&#30452;&#25509;&#25552;&#20379;&#26381;&#21153;&#12290;&#25152;&#26377;&#30340;&#21464;&#26356;&#38598;&#37117;&#26159;&#20840;&#23616;&#21807;&#19968;&#65292;&#24182;&#19988;&#26377;&#22823;&#37327;&#20803;&#25968;&#25454;&#65292;&#36825;&#26679;&#20320;&#21487;&#20197;&#25298;&#32477;&#20219;&#20309;&#26410;&#32463;&#27979;&#35797;&#30340;&#19996;&#35199;&#12290;&#21512;&#24182;&#26159;&#36890;&#36807;&#27604;&#36739;&#21512;&#24182;&#30340;&#21464;&#26356;&#38598;&#21644;&#24403;&#21069;&#30340;&#30446;&#24405;&#20869;&#23481;&#23436;&#25104;&#30340;&#65292;&#32780;&#19981;&#26159;&#35797;&#22270;&#23558;&#20854;&#19982;&#21478;&#19968;&#20010;&#21464;&#26356;&#38598;&#21512;&#24182;&#12290;&#8220;</p></div><div class="sect2" title="Superversion &#8212; "><div class="titlepage"><div><div><h3 class="title"><a name="vc-superversion"></a><span class="bold"><strong>Superversion</strong></span> &#8212; <a class="ulink" href="http://www.superversion.org/" target="_top">http://www.superversion.org/</a></h3></div></div></div><p>&#8221;Superversion&#26159;&#19968;&#20010;&#22522;&#20110;&#21464;&#26356;&#38598;&#30340;&#22810;&#29992;&#25143;&#20998;&#24067;&#24335;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#23427;&#30340;&#30446;&#26631;&#26159;&#25104;&#20026;&#19968;&#20010;&#34892;&#19994;&#21147;&#37327;&#65292;&#21830;&#19994;&#35299;&#20915;&#26041;&#26696;&#30340;&#24320;&#28304;&#36873;&#25321;&#65292;&#25552;&#20379;&#30456;&#21516;&#65288;&#25110;&#26356;&#31616;&#21333;&#65289;&#30340;&#26131;&#29992;&#24615;&#21644;&#31867;&#20284;&#30340;&#24378;&#22823;&#12290;&#23454;&#38469;&#19978;&#65292;&#20174;&#19968;&#24320;&#22987;&#65292;&#30452;&#35273;&#21644;&#21487;&#29992;&#30340;&#25928;&#29575;&#23601;&#22788;&#20110;Superversion&#24320;&#21457;&#30340;&#26368;&#39640;&#20248;&#20808;&#32423;&#20043;&#19968;&#12290; &#8220;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="licensing-further-resources.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="bug-trackers.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#28145;&#20837;&#36164;&#28304; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Appendix B. &#33258;&#30001;Bug&#36319;&#36394;&#31995;&#32479;</td></tr></table></div></body></html>
