<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#29256;&#26412;&#25511;&#21046;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="prev" href="mailing-lists.html" title="&#37038;&#20214;&#21015;&#34920;"><link rel="next" href="bug-tracker.html" title="Bug&#36319;&#36394;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29256;&#26412;&#25511;&#21046;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="mailing-lists.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th><td width="20%" align="right"> <a accesskey="n" href="bug-tracker.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#29256;&#26412;&#25511;&#21046;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="vc"></a>&#29256;&#26412;&#25511;&#21046;</h2></div></div></div><p>&#19968;&#20010;<em class="firstterm">&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</em>&#65288;&#25110;<em class="firstterm">&#20462;&#35746;&#25511;&#21046;&#31995;&#32479;</em>&#65289;&#26159;&#36319;&#36394;&#21644;&#25511;&#21046;&#39033;&#30446;&#25991;&#20214;&#21464;&#26356;&#30340;&#25216;&#26415;&#19982;&#23454;&#36341;&#30340;&#32452;&#21512;&#65292;&#21253;&#25324;&#28304;&#20195;&#30721;&#12289;&#25991;&#26723;&#21644;&#32593;&#39029;&#12290;&#22914;&#26524;&#20320;&#20197;&#21069;&#20174;&#26469;&#27809;&#26377;&#20351;&#29992;&#36807;&#29256;&#26412;&#25511;&#21046;&#65292;&#37027;&#20320;&#26368;&#22909;&#36214;&#24555;&#25214;&#19968;&#20010;&#26377;&#32463;&#39564;&#30340;&#20154;&#21152;&#20837;&#12290;&#29616;&#20170;&#65292;&#25152;&#26377;&#30340;&#20154;&#37117;&#24076;&#26395;&#20320;&#30340;&#39033;&#30446;&#28304;&#20195;&#30721;&#23384;&#25918;&#22312;&#29256;&#26412;&#25511;&#21046;&#19979;&#65292;&#22914;&#26524;&#19981;&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#65292;&#20154;&#20204;&#23558;&#20250;&#36731;&#35270;&#39033;&#30446;&#12290;</p><p>&#29256;&#26412;&#25511;&#21046;&#22914;&#27492;&#24191;&#27867;&#30340;&#21407;&#22240;&#26159;&#22240;&#20026;&#23427;&#23454;&#38469;&#19978;&#33021;&#24110;&#21161;&#36816;&#33829;&#19968;&#20010;&#39033;&#30446;&#30340;&#25152;&#26377;&#26041;&#38754;&#65306;&#20869;&#37096;&#24320;&#21457;&#32773;&#20132;&#27969;&#12289;&#21457;&#24067;&#31649;&#29702;&#12289;Bug&#31649;&#29702;&#12289;&#20195;&#30721;&#31283;&#23450;&#24615;&#21644;&#35797;&#39564;&#24320;&#21457;&#25237;&#20837;&#65292;&#20197;&#21450;&#23545;&#26576;&#20010;&#21464;&#26356;&#25152;&#23646;&#24320;&#21457;&#32773;&#30340;&#24402;&#22240;&#21644;&#25480;&#26435;&#12290;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20026;&#36825;&#20123;&#39046;&#22495;&#25552;&#20379;&#20102;&#19968;&#20010;&#38598;&#20013;&#30340;&#21327;&#35843;&#21147;&#37327;&#12290;&#29256;&#26412;&#25511;&#21046;&#30340;&#26680;&#24515;&#26159;<em class="firstterm">&#21464;&#26356;&#31649;&#29702;</em>&#65306;&#35782;&#21035;&#23545;&#39033;&#30446;&#25991;&#20214;&#30340;&#27599;&#19968;&#20010;&#19981;&#30456;&#20851;&#30340;&#21464;&#26356;&#65292;&#20351;&#29992;&#20803;&#25968;&#25454;&#20363;&#22914;&#21464;&#26356;&#30340;&#26085;&#26399;&#21644;&#20316;&#32773;&#26469;&#27880;&#35299;&#27599;&#20010;&#21464;&#26356;&#65292;&#20043;&#21518;&#26080;&#35770;&#20351;&#29992;&#20160;&#20040;&#26041;&#27861;&#65292;&#20219;&#20309;&#20154;&#35810;&#38382;&#26102;&#65292;&#37325;&#25918;&#36825;&#20010;&#20107;&#23454;&#12290;&#36825;&#26159;&#19968;&#31181;&#21464;&#26356;&#20026;&#20449;&#24687;&#22522;&#26412;&#21333;&#20803;&#30340;&#20132;&#27969;&#26426;&#21046;&#12290;</p><p>&#36825;&#20010;&#37096;&#20998;&#19981;&#20250;&#35752;&#35770;&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#30340;&#25152;&#26377;&#26041;&#38754;&#12290;&#23427;&#26159;&#22914;&#27492;&#21253;&#32599;&#19975;&#35937;&#65292;&#25105;&#20204;&#19981;&#24471;&#22312;&#26412;&#20070;&#19981;&#26102;&#30340;&#25552;&#21450;&#12290;&#22240;&#27492;&#65292;&#25105;&#20204;&#20250;&#36890;&#36807;&#20419;&#36827;&#21327;&#20316;&#24320;&#21457;&#30340;&#26041;&#24335;&#65292;&#19987;&#27880;&#20110;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#36873;&#25321;&#21644;&#35774;&#32622;&#12290;</p><div class="sect2" title="&#29256;&#26412;&#25511;&#21046;&#35789;&#27719;&#34920;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-vocabulary"></a>&#29256;&#26412;&#25511;&#21046;&#35789;&#27719;&#34920;</h3></div></div></div><p>&#22914;&#26524;&#20320;&#27809;&#26377;&#29992;&#36807;&#29256;&#26412;&#25511;&#21046;&#65292;&#26412;&#20070;&#19981;&#20250;&#25945;&#20320;&#22914;&#20309;&#20351;&#29992;&#65292;&#20294;&#26159;&#22914;&#26524;&#27809;&#26377;&#19968;&#20123;&#20851;&#38190;&#26415;&#35821;&#65292;&#25105;&#20204;&#23601;&#26080;&#27861;&#35752;&#35770;&#12290;&#36825;&#20123;&#26415;&#35821;&#29420;&#31435;&#20110;&#20219;&#20309;&#29305;&#23450;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65306;&#23427;&#20204;&#26159;&#32593;&#32476;&#20132;&#20114;&#30340;&#22522;&#26412;&#21517;&#35789;&#21644;&#21160;&#35789;&#65292;&#23558;&#20250;&#22312;&#26412;&#20070;&#21097;&#19979;&#30340;&#37096;&#20998;&#24191;&#27867;&#20351;&#29992;&#12290;&#21363;&#20351;&#36825;&#20010;&#19990;&#30028;&#19978;&#27809;&#26377;&#29256;&#26412;&#25511;&#21046;&#65292;&#21464;&#26356;&#31649;&#29702;&#30340;&#38382;&#39064;&#20063;&#20250;&#23384;&#22312;&#65292;&#36825;&#20123;&#26415;&#35821;&#20026;&#25105;&#20204;&#31616;&#26126;&#30340;&#35752;&#35770;&#36825;&#20123;&#38382;&#39064;&#25552;&#20379;&#20102;&#19968;&#31181;&#35821;&#35328;&#12290;

</p><div class="variablelist"><div class="sidebar" title="&#8220;&#29256;&#26412;&#8221;&#23545;&#8220;&#20462;&#35746;&#29256;&#26412;&#8221;"><a name="version-vs-revision"></a><div class="titlepage"><div><div><p class="title"><b>&#8220;&#29256;&#26412;&#8221;&#23545;&#8220;&#20462;&#35746;&#29256;&#26412;&#8221;</b></p></div></div></div><p>&#21333;&#35789;<em class="firstterm">&#29256;&#26412;&#65288;version&#65289;</em>&#26377;&#26102;&#20505;&#20316;&#20026;&#8220;&#20462;&#35746;&#29256;&#26412;&#8221;&#30340;&#21516;&#20041;&#35789;&#20351;&#29992;&#65292;&#20294;&#26159;&#22312;&#26412;&#20070;&#25105;&#19981;&#20250;&#36825;&#26679;&#20351;&#29992;&#65292;&#22240;&#20026;&#36825;&#22826;&#23481;&#26131;&#19982;&#19968;&#20010;&#36719;&#20214;&#30340;&#29256;&#26412;&#28151;&#28102;&#8212;&#20063;&#23601;&#26159;&#36719;&#20214;&#30340;&#21457;&#24067;&#25110;&#29256;&#26412;&#21495;&#65292;&#20363;&#22914;&#22312;&#8220;&#29256;&#26412; 1.0&#65288;Version 1.0&#65289;&#8221;&#12290;&#19981;&#31649;&#24590;&#26679;&#65292;&#22240;&#20026;&#30701;&#35821;&#8220;&#29256;&#26412;&#25511;&#21046;&#8221;&#24050;&#32463;&#26631;&#20934;&#21270;&#20102;&#65292;&#25152;&#20197;&#25105;&#20250;&#32487;&#32493;&#23558;&#20854;&#35270;&#20026;&#8220;&#20462;&#35746;&#29256;&#26412;&#25511;&#21046;&#8221;&#21644;&#8220;&#21464;&#26356;&#25511;&#21046;&#8221;&#30340;&#21516;&#20041;&#35789;&#12290;</p></div><dl><dt><a name="vc-vocabulary-commit"></a><span class="term"><em class="firstterm">&#25552;&#20132;&#65288;commit&#65289;</em></span></dt><dd><p>&#23545;&#39033;&#30446;&#20570;&#20986;&#19968;&#20010;&#21464;&#26356;&#65307;&#26356;&#27491;&#24335;&#30340;&#65292;&#20197;&#27492;&#26041;&#24335;&#22312;&#29256;&#26412;&#25511;&#21046;&#25968;&#25454;&#24211;&#23384;&#20648;&#19968;&#20010;&#21464;&#26356;&#65292;&#21487;&#20197;&#25104;&#20026;&#39033;&#30446;&#20197;&#21518;&#21457;&#24067;&#30340;&#19968;&#37096;&#20998;&#12290; &#8220;&#25552;&#20132;&#8221;&#21487;&#20197;&#20316;&#20026;&#21517;&#35789;&#25110;&#21160;&#35789;&#12290;&#20316;&#20026;&#21517;&#35789;&#65292;&#20174;&#26412;&#36136;&#19978;&#35762;&#21487;&#20197;&#30475;&#20316;&#26159;&#8220;&#21464;&#26356;&#65288;change&#65289;&#8221;&#21516;&#20041;&#35789;&#12290;&#20363;&#22914;&#65306;&#8220;&#25105;&#21018;&#21018;&#20026;&#25253;&#21578;&#30340;Mac OS X&#19978;&#30340;&#26381;&#21153;&#22120;&#23445;&#26426;Bug&#25552;&#20132;&#20102;&#19968;&#20010;&#20462;&#35746;&#12290;Jay&#65292;&#20320;&#33021;&#35780;&#23457;&#19968;&#19979;&#25552;&#20132;&#24182;&#30475;&#19968;&#19979;&#25105;&#26377;&#27809;&#26377;&#35823;&#29992;&#20869;&#23384;&#20998;&#37197;&#21527;&#65311;&#8221;</p></dd><dt><a name="vc-vocabulary-log-message"></a><span class="term"><em class="firstterm">&#26085;&#24535;&#20449;&#24687;&#65288;log message&#65289;</em></span></dt><dd><p>&#27599;&#27425;&#25552;&#20132;&#25152;&#38468;&#30340;&#27880;&#37322;&#65292;&#25551;&#36848;&#20102;&#25552;&#20132;&#30340;&#24615;&#36136;&#21644;&#30446;&#30340;&#12290;&#26085;&#24535;&#20449;&#24687;&#26159;&#20219;&#20309;&#39033;&#30446;&#26368;&#37325;&#35201;&#30340;&#25991;&#26723;&#65306;&#23427;&#26159;&#21333;&#20010;&#20195;&#30721;&#21464;&#26356;&#30340;&#39640;&#24230;&#25216;&#26415;&#35821;&#35328;&#19982;&#29305;&#24615;&#12289;Bug&#20462;&#35746;&#21644;&#39033;&#30446;&#36827;&#23637;&#36825;&#31867;&#26356;&#38754;&#21521;&#29992;&#25143;&#30340;&#35821;&#35328;&#30340;&#26725;&#26753;&#12290;&#26412;&#33410;&#30340;&#21518;&#21322;&#37096;&#20998;&#65292;&#25105;&#20204;&#20250;&#20851;&#27880;&#23558;&#26085;&#24535;&#20449;&#24687;&#21457;&#24067;&#32473;&#36866;&#24403;&#35835;&#32773;&#30340;&#26041;&#27861;&#65307;&#21478;&#22806;&#65292;<span><a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#30340;</span><a class="xref" href="growth.html#codifying-tradition" title="&#32534;&#21046;&#27861;&#24459;&#30340;&#20256;&#32479;">the section called &#8220;&#32534;&#21046;&#27861;&#24459;&#30340;&#20256;&#32479;&#8221;</a>&#23558;&#20250;&#35752;&#35770;&#40723;&#21169;&#36129;&#29486;&#32773;&#22635;&#20889;&#31616;&#26126;&#21644;&#26377;&#29992;&#26085;&#24535;&#20449;&#24687;&#30340;&#26041;&#27861;&#12290;</p></dd><dt><a name="vc-vocabulary-update"></a><span class="term"><em class="firstterm">&#26356;&#26032;&#65288;update&#65289;</em></span></dt><dd><p>&#35831;&#27714;&#23558;&#20854;&#20182;&#20154;&#30340;&#21464;&#26356;&#65288;&#25552;&#20132;&#65289;&#21644;&#39033;&#30446;&#30340;&#26412;&#22320;&#25335;&#36125;&#36827;&#34892;&#32452;&#21512;&#65307;&#20063;&#23601;&#26159;&#23558;&#20320;&#30340;&#25335;&#36125;&#8220;&#20445;&#25345;&#26368;&#26032;&#8221;&#12290;&#36825;&#26159;&#19968;&#20010;&#38750;&#24120;&#24120;&#35265;&#30340;&#25805;&#20316;&#65307;&#22823;&#22810;&#25968;&#24320;&#21457;&#32773;&#27599;&#22825;&#37117;&#20250;&#22810;&#27425;&#26356;&#26032;&#20195;&#30721;&#65292;&#22240;&#27492;&#65292;&#21487;&#20197;&#30830;&#35748;&#20182;&#20204;&#36816;&#34892;&#30340;&#20195;&#30721;&#19982;&#21035;&#20154;&#30340;&#30456;&#21516;&#65292;&#22240;&#27492;&#20182;&#20204;&#30475;&#21040;&#19968;&#20010;Bug&#65292;&#20182;&#20204;&#21487;&#20197;&#30830;&#20449;&#23427;&#36824;&#27809;&#26377;&#34987;&#20462;&#27491;&#12290;&#20363;&#22914;&#65306;&#8220;&#21992;&#65292;&#25105;&#21457;&#29616;&#32034;&#24341;&#20195;&#30721;&#19968;&#30452;&#20250;&#20002;&#25481;&#26368;&#21518;&#19968;&#20010;&#23383;&#33410;&#12290;&#36825;&#26159;&#19968;&#20010;&#26032;&#30340;bug&#21527;&#65311;&#8221;&#8220;&#26159;&#30340;&#65292;&#20294;&#24050;&#32463;&#22312;&#19978;&#21608;&#20462;&#27491;&#20102;&#8212;&#26356;&#26032;&#19968;&#19979;&#65292;&#19968;&#23450;&#26159;&#22909;&#20102;&#12290;&#8221;</p></dd><dt><a name="vc-vocabulary-repository"></a><span class="term"><em class="firstterm">&#29256;&#26412;&#24211;&#65288;repository&#65289;</em></span></dt><dd><p>&#19968;&#20010;&#23384;&#25918;&#21464;&#26356;&#30340;&#25968;&#25454;&#24211;&#12290;&#19968;&#20123;&#29256;&#26412;&#25511;&#21046;&#26159;&#38598;&#20013;&#24335;&#30340;&#65306;&#26377;&#19968;&#20010;&#21333;&#29420;&#30340;&#20027;&#29256;&#26412;&#24211;&#65292;&#20250;&#23384;&#25918;&#39033;&#30446;&#30340;&#25152;&#26377;&#21464;&#26356;&#12290;&#20063;&#26377;&#19968;&#20123;&#20998;&#24067;&#24335;&#30340;&#31995;&#32479;&#65306;&#27599;&#20010;&#24320;&#21457;&#32773;&#37117;&#26377;&#33258;&#24049;&#30340;&#29256;&#26412;&#24211;&#65292;&#21464;&#26356;&#21487;&#20197;&#22312;&#29256;&#26412;&#24211;&#20043;&#38388;&#20219;&#24847;&#20132;&#25442;&#12290;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#36319;&#36394;&#20102;&#21464;&#26356;&#20043;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#24403;&#38656;&#35201;&#21457;&#24067;&#26102;&#65292;&#30830;&#35748;&#19968;&#37096;&#20998;&#21464;&#26356;&#38598;&#36827;&#20837;&#21457;&#24067;&#12290;&#38598;&#20013;&#24335;&#36824;&#26159;&#20998;&#24067;&#24335;&#30340;&#38382;&#39064;&#20063;&#26159;&#19968;&#22330;&#19981;&#26429;&#30340;&#36719;&#20214;&#24320;&#21457;&#22307;&#25112;&#65307;&#20063;&#35201;&#38450;&#27490;&#33853;&#20837;&#22312;&#20320;&#30340;&#39033;&#30446;&#21015;&#34920;&#20013;&#35752;&#35770;&#36825;&#20010;&#38382;&#39064;&#30340;&#38519;&#38449;&#12290;</p></dd><dt><a name="vc-vocabulary-checkout"></a><span class="term"><em class="firstterm">&#26816;&#20986;&#65288;checkout&#65289;</em></span></dt><dd><p>&#20174;&#29256;&#26412;&#24211;&#33719;&#21462;&#39033;&#30446;&#25335;&#36125;&#30340;&#36807;&#31243;&#12290;&#19968;&#20010;&#26816;&#20986;&#36890;&#24120;&#20250;&#20135;&#29983;&#19968;&#20010;&#21483;&#20570;&#8220;&#24037;&#20316;&#25335;&#36125;&#8221;&#65288;&#30475;&#21518;&#38754;&#65289;&#30340;&#30446;&#24405;&#26641;&#65292;&#21487;&#20197;&#20174;&#36825;&#20010;&#30446;&#24405;&#23558;&#21464;&#26356;&#25552;&#20132;&#22238;&#21407;&#26469;&#30340;&#29256;&#26412;&#24211;&#12290;&#22312;&#19968;&#20123;&#20998;&#24067;&#24335;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#27599;&#20010;&#24037;&#20316;&#25335;&#36125;&#26412;&#36523;&#37117;&#26159;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#21464;&#26356;&#21487;&#20197;&#25512;&#20986;&#65288;&#25302;&#20837;&#65289;&#21040;&#20219;&#20309;&#24895;&#24847;&#25509;&#21463;&#30340;&#29256;&#26412;&#24211;&#12290;</p></dd><dt><a name="vc-vocabulary-working-copy"></a><span class="term"><em class="firstterm">&#24037;&#20316;&#25335;&#36125;&#65288;working copy&#65289;</em></span></dt><dd><p>&#19968;&#20010;&#21253;&#21547;&#39033;&#30446;&#28304;&#20195;&#30721;&#25991;&#20214;&#25110;&#32773;&#32593;&#39029;&#21450;&#20854;&#20182;&#25991;&#26723;&#30340;&#24320;&#21457;&#32773;&#30340;&#31169;&#26377;&#30446;&#24405;&#26641;&#12290;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#20063;&#21487;&#33021;&#20250;&#21253;&#21547;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#31649;&#29702;&#30340;&#20803;&#25968;&#25454;&#20449;&#24687;&#65292;&#21487;&#20197;&#35828;&#26126;&#24037;&#20316;&#25335;&#36125;&#25152;&#23545;&#24212;&#30340;&#29256;&#26412;&#24211;&#65292;&#20197;&#21450;&#25152;&#23637;&#29616;&#25991;&#20214;&#30340;&#8220;&#20462;&#35746;&#29256;&#26412;&#65288;&#30475;&#21518;&#38754;&#65289;&#8221;&#31561;&#31561;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#27599;&#20010;&#24320;&#21457;&#32773;&#37117;&#26377;&#33258;&#24049;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#20182;&#21487;&#20197;&#22312;&#20854;&#20013;&#36827;&#34892;&#21464;&#26356;&#20197;&#21450;&#27979;&#35797;&#65292;&#24182;&#25552;&#20132;&#12290;</p></dd><dt><a name="vc-vocabulary-revision"></a><span class="term"><em class="firstterm">&#20462;&#35746;&#29256;&#26412;&#65288;revision&#65289;</em>,
        <em class="firstterm">&#21464;&#26356;&#65288;change&#65289;</em>,
        <em class="firstterm">&#21464;&#26356;&#38598;&#65288;changeset&#65289;</em></span></dt><dd><p>&#19968;&#20010;&#8220;&#20462;&#35746;&#29256;&#26412;&#8221;&#36890;&#24120;&#26159;&#19968;&#20010;&#29305;&#23450;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#20855;&#20307;&#21270;&#36523;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#24320;&#22987;&#26102;&#19968;&#20010;&#39033;&#30446;&#26377;&#19968;&#20010;&#25991;&#20214;F&#65292;&#20462;&#35746;&#29256;&#26412;&#26159;6&#65292;&#28982;&#21518;&#22914;&#26524;&#26377;&#19968;&#20010;&#25991;&#20214;&#23545;&#25991;&#20214;F&#25552;&#20132;&#20102;&#19968;&#20010;&#21464;&#26356;&#65292;&#37027;&#20040;&#23601;&#20250;&#20135;&#29983;F&#30340;&#20462;&#35746;&#29256;&#26412;7&#12290;&#19968;&#20123;&#31995;&#32479;&#20063;&#20351;&#29992;&#8220;&#20462;&#35746;&#29256;&#26412;&#8221;&#65292;&#8220;&#21464;&#26356;&#8221;&#25110;&#8220;&#21464;&#26356;&#38598;&#8221;&#26469;&#24341;&#29992;&#20316;&#20026;&#19968;&#20010;&#36923;&#36753;&#27010;&#24565;&#30340;&#19968;&#32452;&#21464;&#26356;&#12290;</p><p>&#36825;&#20123;&#26415;&#35821;&#22312;&#19981;&#21516;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21487;&#33021;&#26377;&#19981;&#21516;&#30340;&#25216;&#26415;&#21547;&#20041;&#65292;&#20294;&#26159;&#22823;&#24847;&#22522;&#26412;&#30456;&#21516;&#65306;&#20182;&#20204;&#25552;&#20379;&#20102;&#19968;&#20010;&#26041;&#27861;&#21487;&#20197;&#31934;&#30830;&#30340;&#25551;&#36848;&#19968;&#20010;&#25991;&#20214;&#25110;&#19968;&#32452;&#25991;&#20214;&#21382;&#21490;&#20013;&#30340;&#31934;&#30830;&#20301;&#32622;&#65288;&#27604;&#26041;&#35828;&#65292;&#24688;&#24688;&#22312;&#19968;&#20010;Bug&#20462;&#27491;&#20043;&#21069;&#25110;&#20043;&#21518;&#65289;&#12290;&#20363;&#22914;&#65306;&#8220;&#22905;&#22312;&#20462;&#35746;&#29256;&#26412;10&#20462;&#27491;&#20102;&#37027;&#20010;&#8221;&#25110;&#32773;&#8220;&#20182;&#22312;&#25991;&#20214;foo.c&#30340;&#20462;&#35746;&#29256;&#26412;10&#20462;&#27491;&#20102;&#37027;&#20010;&#12290;&#8221;</p><p>&#24403;&#19968;&#20010;&#20154;&#22312;&#19981;&#25351;&#23450;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;&#30340;&#26102;&#20505;&#35848;&#35770;&#19968;&#20010;&#25991;&#20214;&#25110;&#19968;&#32452;&#25991;&#20214;&#26102;&#65292;&#36890;&#24120;&#20551;&#23450;&#26159;&#25351;&#26368;&#36817;&#30340;&#20462;&#35746;&#29256;&#26412;&#12290;</p></dd><dt><a name="vc-vocabulary-diff"></a><span class="term"><em class="firstterm">&#24046;&#24322;&#65288;diff&#65289;</em></span></dt><dd><p>&#21464;&#26356;&#30340;&#25991;&#26412;&#21270;&#23637;&#29616;&#12290;&#19968;&#20010;&#24046;&#24322;&#26174;&#31034;&#20102;&#21738;&#20123;&#34892;&#21457;&#29983;&#20102;&#24590;&#26679;&#30340;&#25913;&#21464;&#65292;&#20197;&#21450;&#22260;&#32469;&#19978;&#19979;&#25991;&#20004;&#20391;&#30340;&#20960;&#34892;&#12290;&#19968;&#20010;&#24050;&#32463;&#29087;&#24713;&#20195;&#30721;&#30340;&#24320;&#21457;&#32773;&#36890;&#24120;&#21487;&#20197;&#38405;&#35835;&#21306;&#21035;&#65292;&#24182;&#29702;&#35299;&#21464;&#26356;&#23436;&#25104;&#30340;&#20107;&#24773;&#65292;&#29978;&#33267;&#23450;&#20301;Bug&#12290;</p></dd><dt><a name="vc-vocabulary-tag"></a><span class="term"><em class="firstterm">&#26631;&#31614;&#65288;tag&#65289;</em></span></dt><dd><p>&#19968;&#32452;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;&#30340;&#25991;&#20214;&#30340;&#26631;&#31614;&#12290;&#26631;&#31614;&#36890;&#24120;&#29992;&#26469;&#20445;&#23384;&#20154;&#20204;&#24863;&#20852;&#36259;&#30340;&#39033;&#30446;&#24555;&#29031;&#12290;&#20363;&#22914;&#65292;&#20026;&#27599;&#20010;&#20844;&#24320;&#21457;&#24067;&#20351;&#29992;&#26631;&#31614;&#65292;&#36825;&#26679;&#20154;&#20204;&#23601;&#21487;&#20197;&#20174;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#33719;&#21462;&#21457;&#24067;&#23545;&#24212;&#30340;&#25991;&#20214;/&#20462;&#35746;&#29256;&#26412;&#12290;&#24120;&#35265;&#30340;&#26631;&#31614;&#21517;&#31216;&#26377;<code class="literal">Release_1_0</code>&#12289;<code class="literal">Delivery_00456</code>&#31561;&#31561;&#12290;</p></dd><dt><a name="vc-vocabulary-branch"></a><span class="term"><em class="firstterm">&#20998;&#25903;&#65288;branch&#65289;</em></span></dt><dd><p>&#39033;&#30446;&#30340;&#19968;&#20010;&#25335;&#36125;&#65292;&#22312;&#29256;&#26412;&#25511;&#21046;&#20043;&#19979;&#65292;&#20294;&#21364;&#26159;&#23396;&#31435;&#30340;&#65292;&#25152;&#20197;&#20998;&#25903;&#19978;&#30340;&#21464;&#26356;&#19981;&#20250;&#24433;&#21709;&#39033;&#30446;&#30340;&#20854;&#20182;&#37096;&#20998;&#65292;&#25110;&#32773;&#30456;&#21453;&#65292;&#38500;&#38750;&#20320;&#25925;&#24847;&#23558;&#21464;&#26356;&#8220;&#21512;&#24182;&#8221;&#36807;&#21435;&#65288;&#30475;&#21518;&#38754;&#65289;&#12290;&#20998;&#25903;&#20063;&#34987;&#31216;&#20026;&#8220;&#24320;&#21457;&#32447;&#65288;lines of development&#65289;&#8221;&#12290;&#21363;&#20351;&#24403;&#19968;&#20010;&#39033;&#30446;&#27809;&#26377;&#26126;&#30830;&#30340;&#20998;&#25903;&#65292;&#24320;&#21457;&#20063;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#21457;&#29983;&#22312;&#8220;&#20027;&#20998;&#25903;&#8221;&#65292;&#20063;&#31216;&#20026;&#8220;&#20027;&#32447;&#8221;&#25110;&#8220;<em class="firstterm">&#20027;&#24178;&#65288;trunk&#65289;</em>&#8221;&#12290;</p><p>&#20998;&#25903;&#25552;&#20379;&#20102;&#19968;&#20010;&#23558;&#24320;&#21457;&#32447;&#38548;&#31163;&#30340;&#26041;&#27861;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;&#20998;&#25903;&#21487;&#20197;&#29992;&#26469;&#36827;&#34892;&#23545;&#20110;&#20027;&#24178;&#19981;&#22815;&#31283;&#23450;&#30340;&#23454;&#39564;&#24320;&#21457;&#12290;&#25110;&#32773;&#19968;&#20010;&#20998;&#25903;&#21487;&#20197;&#29992;&#26469;&#31283;&#23450;&#26032;&#30340;&#21457;&#24067;&#12290;&#22312;&#21457;&#24067;&#36807;&#31243;&#20013;&#65292;&#26377;&#35268;&#24459;&#30340;&#24320;&#21457;&#21487;&#20197;&#32487;&#32493;&#19981;&#21463;&#24178;&#25200;&#30340;&#22312;&#29256;&#26412;&#24211;&#30340;&#20027;&#32447;&#36827;&#34892;&#65307;&#19982;&#27492;&#21516;&#26102;&#65292;&#22312;&#21457;&#24067;&#20998;&#25903;&#65292;&#38500;&#38750;&#32463;&#36807;&#21457;&#24067;&#31649;&#29702;&#21592;&#30340;&#30830;&#35748;&#65292;&#19981;&#20801;&#35768;&#20219;&#20309;&#21464;&#26356;&#12290;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#35753;&#21457;&#24067;&#19981;&#24517;&#24178;&#25200;&#27491;&#22312;&#36827;&#34892;&#30340;&#24320;&#21457;&#24037;&#20316;&#12290;&#20851;&#20110;&#20998;&#25903;&#30340;&#35814;&#32454;&#35752;&#35770;&#35265;<span>&#26412;&#31456;&#21518;&#38754;&#30340;</span><a class="xref" href="vc.html#branches" title="&#20351;&#29992;&#20998;&#25903;&#26469;&#36991;&#20813;&#29942;&#39048;">the section called &#8220;&#20351;&#29992;&#20998;&#25903;&#26469;&#36991;&#20813;&#29942;&#39048;&#8221;</a>&#12290;</p></dd><dt><a name="vc-vocabulary-merge"></a><span class="term"><em class="firstterm">&#21512;&#24182;&#65288;&#21448;&#21517;&#25644;&#36816;&#65289;&#65288;merge, a.k.a. port&#65289;</em></span></dt><dd><p>&#29992;&#26469;&#23558;&#21464;&#26356;&#20174;&#19968;&#20010;&#20998;&#25903;&#25644;&#36816;&#21040;&#21478;&#19968;&#20010;&#12290;&#36825;&#21253;&#25324;&#20174;&#20027;&#24178;&#21512;&#24182;&#21040;&#20998;&#25903;&#65292;&#25110;&#32773;&#30456;&#21453;&#12290;&#23454;&#38469;&#19978;&#65292;&#36825;&#26159;&#26368;&#24120;&#35265;&#30340;&#21512;&#24182;&#31867;&#22411;&#65307;&#22312;&#20004;&#20010;&#38750;&#20027;&#20998;&#25903;&#20043;&#38388;&#25644;&#36816;&#21464;&#26356;&#30340;&#24773;&#20917;&#24456;&#23569;&#35265;&#12290;&#20851;&#20110;&#27492;&#31867;&#21512;&#24182;&#30340;&#26356;&#22810;&#20449;&#24687;&#21487;&#20197;&#30475;<a class="xref" href="vc.html#vc-singularity" title="&#20449;&#24687;&#21333;&#19968;&#24615;">the section called &#8220;&#20449;&#24687;&#21333;&#19968;&#24615;&#8221;</a>&#12290;</p><p>&#8220;&#21512;&#24182;&#8221;&#20063;&#26377;&#21478;&#19968;&#31181;&#30456;&#20851;&#30340;&#21547;&#20041;&#65306;&#20063;&#23601;&#26159;&#24403;&#20004;&#20010;&#20154;&#23545;&#20110;&#21516;&#19968;&#20010;&#25991;&#20214;&#20316;&#20986;&#27809;&#26377;&#20132;&#21472;&#30340;&#21464;&#26356;&#26102;&#65292;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#25152;&#20316;&#30340;&#20107;&#24773;&#12290;&#22240;&#20026;&#20004;&#20010;&#21464;&#26356;&#27809;&#26377;&#20114;&#30456;&#24178;&#25200;&#65292;&#24403;&#19968;&#20010;&#20154;&#26356;&#26032;&#20854;&#25335;&#36125;&#20013;&#30340;&#36825;&#20010;&#25991;&#20214;&#65288;&#24050;&#32463;&#21253;&#21547;&#20182;&#33258;&#24049;&#30340;&#21464;&#26356;&#65289;&#26102;&#65292;&#20854;&#20182;&#20154;&#30340;&#21464;&#26356;&#20250;&#33258;&#21160;&#21512;&#24182;&#36827;&#21435;&#12290;&#36825;&#38750;&#24120;&#24120;&#35265;&#65292;&#29305;&#21035;&#26159;&#24403;&#22810;&#20010;&#20154;&#32534;&#36753;&#21516;&#19968;&#20195;&#30721;&#26102;&#12290;&#24403;&#20004;&#20010;&#21464;&#26356;<span class="emphasis"><em>&#30830;&#23454;</em></span>&#20132;&#21472;&#20102;&#65292;&#32467;&#26524;&#23601;&#26159;&#8220;&#20914;&#31361;&#8221;&#20102;&#65307;&#30475;&#19979;&#38754;&#12290;</p></dd><dt><a name="vc-vocabulary-conflict"></a><span class="term"><em class="firstterm">&#20914;&#31361;&#65288;conflict&#65289;</em></span></dt><dd><p>&#24403;&#20004;&#20010;&#20154;&#24076;&#26395;&#23545;&#20110;&#20195;&#30721;&#30340;&#21516;&#19968;&#20010;&#22320;&#26041;&#20316;&#20986;&#19981;&#21516;&#30340;&#20462;&#25913;&#26102;&#12290;&#25152;&#26377;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20250;&#33258;&#21160;&#30417;&#27979;&#21040;&#20914;&#31361;&#65292;&#24182;&#33267;&#23569;&#35753;&#19968;&#20010;&#20154;&#24847;&#35782;&#21040;&#20182;&#20204;&#30340;&#21464;&#26356;&#19982;&#20854;&#20182;&#20154;&#30340;&#20914;&#31361;&#20102;&#12290;&#36825;&#20381;&#36182;&#20110;<em class="firstterm">&#35299;&#20915;&#65288;resolve&#65289;</em>&#20914;&#31361;&#30340;&#20154;&#65292;&#20197;&#21450;&#19982;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#35299;&#20915;&#30340;&#20132;&#27969;&#12290;</p></dd><dt><a name="vc-vocabulary-lock"></a><span class="term"><em class="firstterm">&#38145;&#23450;&#65288;lock&#65289;</em></span></dt><dd><p>&#23545;&#20110;&#26576;&#20010;&#25991;&#20214;&#25110;&#30446;&#24405;&#36827;&#34892;&#25490;&#20182;&#21464;&#26356;&#22768;&#26126;&#30340;&#26041;&#27861;&#12290;&#20363;&#22914;&#65292;&#8220;&#25105;&#29616;&#22312;&#19981;&#33021;&#23545;&#32593;&#39029;&#25991;&#20214;&#25552;&#20132;&#20219;&#20309;&#21464;&#26356;&#12290;&#20284;&#20046;Alfred&#24050;&#32463;&#38145;&#23450;&#20102;&#25152;&#26377;&#25991;&#20214;&#65292;&#22240;&#20026;&#20182;&#35201;&#20462;&#25913;&#32972;&#26223;&#22270;&#29255;&#12290;&#8221;&#19981;&#26159;&#25152;&#26377;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#37117;&#25552;&#20379;&#20102;&#38145;&#23450;&#33021;&#21147;&#65292;&#23427;&#20204;&#24182;&#19981;&#37117;&#38656;&#35201;&#20351;&#29992;&#38145;&#23450;&#29305;&#24615;&#12290;&#36825;&#26159;&#22240;&#20026;&#24179;&#34892;&#65292;&#21516;&#26102;&#24320;&#21457;&#26159;&#34892;&#20026;&#20934;&#21017;&#65292;&#32780;&#23558;&#20154;&#20204;&#38145;&#23450;&#22312;&#25991;&#20214;&#20043;&#22806;&#36829;&#32972;&#20102;&#36825;&#20010;&#24605;&#24819;&#12290;</p><p>&#38656;&#35201;&#38145;&#23450;&#25165;&#33021;&#25552;&#20132;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#25105;&#20204;&#31216;&#20043;&#20351;&#29992;<em class="firstterm">&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;</em>&#27169;&#22411;&#12290;&#32780;&#20854;&#20182;&#30340;&#25105;&#20204;&#31216;&#20043;&#20026;<em class="firstterm">&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;</em>&#27169;&#22411;&#12290;&#20004;&#31181;&#27169;&#22411;&#30340;&#19968;&#20010;&#23436;&#32654;&#30340;&#28145;&#20837;&#35299;&#37322;&#21644;&#27604;&#36739;&#21487;&#20197;&#30475;<a class="ulink" href="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html" target="_top">http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html</a>&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#36866;&#21512;&#20110;&#24320;&#28304;&#24320;&#21457;&#65292;&#22312;&#26412;&#20070;&#35752;&#35770;&#30340;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#37117;&#25903;&#25345;&#36825;&#20010;&#27169;&#22411;&#12290;</p></dd></dl></div><p>

</p></div><div class="sect2" title="&#36873;&#25321;&#19968;&#20010;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-choosing"></a>&#36873;&#25321;&#19968;&#20010;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</h3></div></div></div><p>&#22312;&#20889;&#26412;&#25991;&#30340;&#26102;&#20505;&#65292;&#33258;&#30001;&#36719;&#20214;&#19990;&#30028;&#20013;&#20004;&#20010;&#26368;&#27969;&#34892;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26159;<em class="firstterm">&#24182;&#34892;&#29256;&#26412;&#31995;&#32479;</em>&#65288;<em class="firstterm">CVS</em>&#65292;<a class="ulink" href="http://www.cvshome.org/" target="_top">http://www.cvshome.org/</a>&#65289;&#21644;<em class="firstterm">Subversion</em>&#65288;<em class="firstterm">SVN</em>&#65292;<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>&#65289;&#12290;</p><p>CVS&#24050;&#32463;&#23384;&#22312;&#24456;&#38271;&#26102;&#38388;&#20102;&#12290;&#22823;&#22810;&#25968;&#26377;&#32463;&#39564;&#30340;&#24320;&#21457;&#32773;&#24050;&#32463;&#29087;&#24713;&#20102;&#23427;&#65292;&#23427;&#25110;&#22810;&#25110;&#23569;&#28385;&#36275;&#20102;&#20320;&#30340;&#38656;&#35201;&#65292;&#32780;&#19988;&#22240;&#20026;&#23427;&#24050;&#32463;&#27969;&#34892;&#20102;&#24456;&#38271;&#26102;&#38388;&#20102;&#65292;&#20320;&#21487;&#33021;&#19981;&#20250;&#38519;&#20837;&#23427;&#26159;&#21542;&#20026;&#27491;&#30830;&#36873;&#25321;&#30340;&#20105;&#35770;&#12290;CVS&#26377;&#19968;&#20123;&#32570;&#28857;&#12290;&#23427;&#19981;&#25903;&#25345;&#31616;&#21333;&#30340;&#24341;&#29992;&#22810;&#20010;&#25991;&#20214;&#30340;&#21464;&#26356;&#65307;&#23427;&#19981;&#25903;&#25345;&#29256;&#26412;&#25511;&#21046;&#19979;&#30340;&#25991;&#20214;&#37325;&#21629;&#21517;&#21644;&#25335;&#36125;&#65288;&#36825;&#31181;&#24773;&#20917;&#19979;&#22914;&#26524;&#20320;&#38656;&#35201;&#35782;&#21035;&#20986;&#39033;&#30446;&#24320;&#22987;&#21518;&#30340;&#20195;&#30721;&#26641;&#65292;&#20250;&#38750;&#24120;&#22836;&#30171;&#65289;&#65307;&#23427;&#23545;&#21512;&#24182;&#30340;&#25903;&#25345;&#24456;&#24369;&#65307;&#23427;&#22788;&#29702;&#22823;&#25991;&#20214;&#21644;&#20108;&#36827;&#21046;&#25991;&#20214;&#19981;&#20339;&#65307;&#20197;&#21450;&#22312;&#25805;&#20316;&#24456;&#22810;&#25991;&#20214;&#26102;&#25805;&#20316;&#20250;&#38750;&#24120;&#24930;&#12290;</p><p>CVS&#30340;&#36825;&#20123;Bug&#37117;&#19981;&#26159;&#33268;&#21629;&#30340;&#65292;&#25152;&#20197;&#23427;&#19968;&#30452;&#38750;&#24120;&#27969;&#34892;&#12290;&#28982;&#32780;&#65292;&#26368;&#36817;&#20960;&#24180;Subversion&#36880;&#28176;&#34987;&#20154;&#20204;&#25152;&#25509;&#21463;&#65292;&#29305;&#21035;&#26159;&#22312;&#26032;&#21019;&#24314;&#30340;&#39033;&#30446;&#20013;&#12290;<sup>[<a name="idp1059" href="#ftn.idp1059" class="footnote">15</a>]</sup>&#22914;&#26524;&#20320;&#26032;&#24320;&#22987;&#19968;&#20010;&#39033;&#30446;&#65292;&#25105;&#25512;&#33616;Subversion&#12290;</p><p>&#22312;&#21478;&#19968;&#26041;&#38754;&#65292;&#22240;&#20026;&#25105;&#21442;&#19982;&#20102;Subversion&#39033;&#30446;&#65292;&#25105;&#30340;&#23458;&#35266;&#24615;&#26377;&#29702;&#30001;&#20540;&#24471;&#24576;&#30097;&#12290;&#22312;&#26368;&#36817;&#20960;&#24180;&#65292;&#35768;&#22810;&#26032;&#30340;&#24320;&#28304;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#24050;&#32463;&#20986;&#29616;&#12290;<a class="xref" href="vc-systems.html" title="Appendix A. &#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;">Appendix A, <i>&#33258;&#30001;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</i></a>&#21015;&#20986;&#20102;&#25152;&#26377;&#25105;&#30693;&#36947;&#30340;&#65292;&#22823;&#20307;&#19978;&#26681;&#25454;&#27969;&#34892;&#24615;&#25490;&#24207;&#12290;&#23601;&#20687;&#21015;&#34920;&#35828;&#26126;&#30340;&#65292;&#20915;&#23450;&#20351;&#29992;&#20309;&#31181;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21487;&#33021;&#25104;&#20026;&#19968;&#39033;&#32456;&#36523;&#30340;&#30740;&#31350;&#39033;&#30446;&#12290;&#26377;&#21487;&#33021;&#20320;&#20063;&#20250;&#30465;&#25481;&#36873;&#25321;&#30340;&#36807;&#31243;&#65292;&#22240;&#20026;&#20320;&#30340;&#20027;&#31449;&#24050;&#32463;&#20570;&#20986;&#20102;&#36873;&#25321;&#12290;&#20294;&#22914;&#26524;&#20320;&#24517;&#39035;&#20570;&#20986;&#36873;&#25321;&#65292;&#35831;&#21672;&#35810;&#37027;&#20123;&#26377;&#32463;&#39564;&#30340;&#20154;&#65292;&#28982;&#21518;&#36873;&#25321;&#19968;&#20010;&#24182;&#20351;&#29992;&#36215;&#26469;&#12290;&#20219;&#20309;&#31283;&#23450;&#30340;&#20135;&#21697;&#29366;&#24577;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21487;&#20197;&#23454;&#29616;&#65307;&#20320;&#19981;&#24517;&#25285;&#24515;&#20250;&#20570;&#20986;&#28798;&#38590;&#24615;&#30340;&#38169;&#35823;&#20915;&#23450;&#12290;&#22914;&#26524;&#20320;&#26080;&#27861;&#19979;&#20915;&#24515;&#65292;&#37027;&#23601;Subversion&#21543;&#12290;&#23427;&#23398;&#36215;&#26469;&#30456;&#23545;&#31616;&#21333;&#65292;&#22312;&#36817;&#20960;&#24180;&#37324;&#36824;&#24212;&#35813;&#20445;&#25345;&#26631;&#20934;&#30340;&#22320;&#20301;&#12290;</p></div><div class="sect2" title="&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;"><div class="titlepage"><div><div><h3 class="title"><a name="vc-using"></a>&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</h3></div></div></div><p>&#36825;&#19968;&#37096;&#20998;&#30340;&#24314;&#35758;&#19981;&#38024;&#23545;&#20219;&#20309;&#29305;&#23450;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#23427;&#20204;&#37117;&#24212;&#24403;&#21487;&#20197;&#31616;&#21333;&#30340;&#23454;&#29616;&#12290;&#35814;&#32454;&#20449;&#24687;&#35831;&#21442;&#32771;&#29305;&#23450;&#31995;&#32479;&#30340;&#25991;&#26723;&#12290;</p><div class="sect3" title="&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;"><div class="titlepage"><div><div><h4 class="title"><a name="version-everything"></a>&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;</h4></div></div></div><p>&#19981;&#35201;&#20165;&#20165;&#23558;&#39033;&#30446;&#30340;&#28304;&#20195;&#30721;&#32435;&#20837;&#21040;&#29256;&#26412;&#25511;&#21046;&#19979;&#65292;&#20063;&#24212;&#35813;&#21253;&#25324;&#32593;&#39029;&#12289;&#25991;&#26723;&#12289;FAQ&#12289;&#35774;&#35745;&#27880;&#37322;&#21644;&#20219;&#20309;&#20154;&#20204;&#24076;&#26395;&#32534;&#36753;&#30340;&#20869;&#23481;&#12290;&#35753;&#20182;&#20204;&#19982;&#28304;&#20195;&#30721;&#23613;&#37327;&#25509;&#36817;&#65292;&#22312;&#21516;&#19968;&#20010;&#29256;&#26412;&#24211;&#26641;&#20013;&#12290;&#20219;&#20309;&#20540;&#24471;&#20889;&#19979;&#26469;&#30340;&#20449;&#24687;&#37117;&#24212;&#35813;&#32435;&#20837;&#29256;&#26412;&#25511;&#21046;&#8212;&#20063;&#23601;&#26159;&#20219;&#20309;&#21487;&#33021;&#20250;&#21464;&#26356;&#30340;&#20449;&#24687;&#12290;&#19981;&#20250;&#21457;&#29983;&#21464;&#26356;&#30340;&#19996;&#35199;&#37117;&#24212;&#35813;&#24402;&#26723;&#65292;&#32780;&#38750;&#29256;&#26412;&#21270;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;&#37038;&#20214;&#19968;&#26086;&#21457;&#24067;&#65292;&#23601;&#19981;&#20250;&#21464;&#26356;&#65307;&#22240;&#27492;&#65292;&#23558;&#20854;&#29256;&#26412;&#21270;&#27809;&#26377;&#20219;&#20309;&#24847;&#20041;&#65288;&#38500;&#38750;&#23427;&#25104;&#20026;&#19968;&#20010;&#36739;&#22823;&#30340;&#12289;&#36827;&#21270;&#25991;&#26723;&#30340;&#19968;&#37096;&#20221;&#65289;&#12290;</p><p>&#22312;&#19968;&#20010;&#22320;&#26041;&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;&#30340;&#21407;&#22240;&#38750;&#24120;&#37325;&#35201;&#65292;&#36825;&#26679;&#20154;&#20204;&#21482;&#38656;&#35201;&#23398;&#20064;&#19968;&#31181;&#25552;&#20132;&#21464;&#26356;&#30340;&#26041;&#24335;&#12290;&#20363;&#22914;&#65292;&#32463;&#24120;&#26159;&#19968;&#20010;&#36129;&#29486;&#32773;&#24320;&#22987;&#32534;&#36753;&#19968;&#20010;&#32593;&#39029;&#25110;&#32773;&#25991;&#26723;&#65292;&#28982;&#21518;&#25509;&#30528;&#20570;&#19968;&#20123;&#20195;&#30721;&#21464;&#26356;&#12290;&#24403;&#39033;&#30446;&#23545;&#20110;&#25152;&#26377;&#30340;&#25552;&#20132;&#20351;&#29992;&#30456;&#21516;&#30340;&#25552;&#20132;&#26041;&#24335;&#26102;&#65292;&#20154;&#20204;&#21482;&#38656;&#35201;&#23398;&#20064;&#19968;&#27425;&#12290;&#19968;&#36215;&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;&#20063;&#24847;&#21619;&#30528;&#38543;&#30528;&#25991;&#26723;&#30340;&#26356;&#26032;&#65292;&#26032;&#29305;&#24615;&#21487;&#20197;&#19968;&#36215;&#25552;&#20132;&#65292;&#32780;&#20195;&#30721;&#20998;&#25903;&#26102;&#20063;&#26159;&#23545;&#25991;&#26723;&#20998;&#25903;&#31561;&#31561;&#12290;</p><p>&#19981;&#35201;&#23558;<em class="firstterm">&#29983;&#25104;&#30340;&#25991;&#20214;</em>&#32622;&#20837;&#29256;&#26412;&#25511;&#21046;&#12290;&#37027;&#20123;&#24212;&#35813;&#19981;&#26159;&#21487;&#32534;&#36753;&#30340;&#25968;&#25454;&#65292;&#22240;&#20026;&#23427;&#20204;&#26159;&#31243;&#24207;&#26041;&#24335;&#30001;&#20854;&#20182;&#25991;&#20214;&#20135;&#29983;&#30340;&#12290;&#20363;&#22914;&#65292;&#19968;&#20123;&#26500;&#24314;&#31995;&#32479;&#26681;&#25454;&#27169;&#26495;<code class="filename">configure.in</code>&#25991;&#20214;&#20135;&#29983;<code class="filename">configure</code>&#12290;&#20026;&#20102;&#25913;&#21464;<code class="filename">configure</code>&#65292;&#25105;&#20204;&#38656;&#35201;&#32534;&#36753;<code class="filename">configure.in</code>&#65292;&#28982;&#21518;&#37325;&#26032;&#29983;&#25104;&#65307;&#22240;&#27492;&#65292;&#21482;&#26377;&#25991;&#20214;<code class="filename">configure.in</code>&#26159;&#8220;&#21487;&#32534;&#36753;&#25991;&#20214;&#12290;&#8221;&#21482;&#29256;&#26412;&#21270;&#27169;&#26495;&#8212;&#22914;&#26524;&#20320;&#20063;&#29256;&#26412;&#21270;&#32467;&#26524;&#25991;&#20214;&#65292;&#20154;&#20204;&#22312;&#23545;&#27169;&#26495;&#36827;&#34892;&#20462;&#25913;&#21518;&#20250;&#19981;&#21487;&#36991;&#20813;&#30340;&#24536;&#35760;&#37325;&#26032;&#29983;&#25104;&#23427;&#65292;&#32467;&#26524;&#30340;&#19981;&#19968;&#33268;&#20250;&#23548;&#33268;&#26080;&#20241;&#27490;&#30340;&#28151;&#28102;&#12290;<sup>[<a name="idp1079" href="#ftn.idp1079" class="footnote">16</a>]</sup></p><p>&#25152;&#26377;&#21487;&#32534;&#36753;&#25968;&#25454;&#24517;&#39035;&#23384;&#25918;&#22312;&#29256;&#26412;&#25511;&#21046;&#19979;&#30340;&#35268;&#21017;&#20063;&#26377;&#19968;&#20010;&#19981;&#24184;&#30340;&#20363;&#22806;&#65306;Bug&#36319;&#36394;&#12290;Bug&#25968;&#25454;&#24211;&#20445;&#23384;&#20102;&#22823;&#37327;&#30340;&#21487;&#32534;&#36753;&#25968;&#25454;&#65292;&#20294;&#26159;&#22240;&#20026;&#25216;&#26415;&#21407;&#22240;&#19981;&#33021;&#23558;&#25968;&#25454;&#23384;&#25918;&#22312;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290; &#65288;&#19968;&#20123;&#36319;&#36394;&#24037;&#20855;&#26377;&#19968;&#20123;&#21407;&#22987;&#30340;&#29256;&#26412;&#25511;&#21046;&#29305;&#24615;&#65292;&#28982;&#32780;&#65292;&#29420;&#31435;&#20110;&#39033;&#30446;&#30340;&#20027;&#29256;&#26412;&#24211;&#12290;&#65289;</p></div><div class="sect3" title="&#21487;&#27983;&#35272;&#24615;"><div class="titlepage"><div><div><h4 class="title"><a name="vc-browsing"></a>&#21487;&#27983;&#35272;&#24615;</h4></div></div></div><p>&#39033;&#30446;&#30340;&#29256;&#26412;&#24211;&#24212;&#35813;&#33021;&#22815;&#36890;&#36807;web&#27983;&#35272;&#12290;&#36825;&#19981;&#20165;&#26159;&#24847;&#21619;&#30528;&#27983;&#35272;&#26368;&#26032;&#20462;&#35746;&#30340;&#33021;&#21147;&#65292;&#20063;&#21253;&#25324;&#22238;&#21040;&#36807;&#21435;&#26597;&#30475;&#26089;&#20808;&#30340;&#29256;&#26412;&#65292;&#26597;&#30475;&#20462;&#35746;&#20043;&#38388;&#30340;&#21306;&#21035;&#65292;&#20197;&#21450;&#38405;&#35835;&#38024;&#23545;&#29305;&#23450;&#21464;&#26356;&#30340;&#26085;&#24535;&#20449;&#24687;&#31561;&#31561;&#12290;</p><p>&#21487;&#27983;&#35272;&#24615;&#38750;&#24120;&#37325;&#35201;&#65292;&#22240;&#20026;&#23427;&#26159;&#19968;&#20010;&#36731;&#37327;&#32423;&#30340;&#39033;&#30446;&#25968;&#25454;&#38376;&#25143;&#12290;&#22914;&#26524;&#19981;&#33021;&#36890;&#36807;web&#27983;&#35272;&#29256;&#26412;&#24211;&#65292;&#37027;&#19968;&#20010;&#20154;&#22914;&#26524;&#24076;&#26395;&#26816;&#26597;&#29305;&#23450;&#30340;&#25991;&#20214;&#65288;&#20363;&#22914;&#65292;&#30475;&#19968;&#19979;&#26576;&#20010;bug&#20462;&#27491;&#26159;&#21542;&#24050;&#32463;&#36827;&#20837;&#20195;&#30721;&#65289;&#65292;&#20182;&#24517;&#39035;&#22312;&#26412;&#22320;&#23433;&#35013;&#29256;&#26412;&#25511;&#21046;&#23458;&#25143;&#31471;&#65292;&#36825;&#20250;&#35753;&#19968;&#39033;&#21482;&#38656;&#35201;&#20004;&#20998;&#38047;&#30340;&#20219;&#21153;&#21464;&#25104;&#19968;&#39033;&#21322;&#23567;&#26102;&#25110;&#26356;&#38271;&#30340;&#20219;&#21153;&#12290;</p><p>&#21487;&#27983;&#35272;&#24615;&#20063;&#26263;&#31034;&#20102;&#27983;&#35272;&#25991;&#20214;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;&#30340;&#26631;&#20934;URL&#65292;&#20197;&#21450;&#20219;&#24847;&#32473;&#23450;&#26102;&#38388;&#26368;&#36817;&#30340;&#20462;&#35746;&#12290;&#22312;&#25216;&#26415;&#35752;&#35770;&#25110;&#21521;&#20154;&#20204;&#25351;&#26126;&#20316;&#20026;&#35777;&#25454;&#26102;&#36825;&#38750;&#24120;&#26377;&#29992;&#12290;&#20363;&#22914;&#25105;&#20204;&#19981;&#20250;&#35828;&#8220;&#20851;&#20110;&#35843;&#35797;&#26381;&#21153;&#22120;&#30340;&#25552;&#31034;&#65292;&#21487;&#20197;&#30475;&#20320;&#24037;&#20316;&#25335;&#36125;&#20013;&#30340;www/hacking.html&#8221;&#65292;&#32780;&#20250;&#35828;&#8220;&#20851;&#20110;&#35843;&#35797;&#26381;&#21153;&#22120;&#30340;&#25552;&#31034;&#65292;&#21487;&#20197;&#30475;<span class="emphasis"><em>http://svn.collab.net/repos/svn/trunk/www/hacking.html</em></span>&#65292;&#8221;&#32473;&#23450;&#19968;&#20010;&#20250;&#19968;&#30452;&#25351;&#21521;<code class="filename">hacking.html</code>&#26368;&#26032;&#20462;&#35746;&#30340;URL&#20250;&#26356;&#22909;&#12290;&#22240;&#20026;&#23427;&#19981;&#20250;&#23548;&#33268;&#28151;&#28102;&#65292;&#20063;&#36991;&#20813;&#20102;&#29992;&#25143;&#26159;&#21542;&#26377;&#26368;&#26032;&#24037;&#20316;&#25335;&#36125;&#30340;&#38382;&#39064;&#12290;</p><p>&#19968;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21253;&#21547;&#20869;&#32622;&#30340;&#29256;&#26412;&#24211;&#27983;&#35272;&#26426;&#21046;&#65292;&#32780;&#20854;&#20182;&#19968;&#20123;&#20381;&#36182;&#20110;&#31532;&#19977;&#26041;&#30340;&#24037;&#20855;&#23454;&#29616;&#12290;&#36825;&#31867;&#24037;&#20855;&#26377;<em class="firstterm">ViewCVS</em>&#65288;<a class="ulink" href="http://viewcvs.sourceforge.net/" target="_top">http://viewcvs.sourceforge.net/</a>&#65289;&#12289;<em class="firstterm">CVSWeb</em>&#65288;<a class="ulink" href="http://www.freebsd.org/projects/cvsweb.html" target="_top">http://www.freebsd.org/projects/cvsweb.html</a>&#65289;&#20197;&#21450;<em class="firstterm">WebSVN</em>&#65288;<a class="ulink" href="http://websvn.tigris.org/" target="_top">http://websvn.tigris.org/</a>&#65289;&#12290;&#31532;&#19968;&#20010;&#24037;&#20855;&#21487;&#20197;&#25903;&#25345;CVS&#21644;Subversion&#65292;&#32780;&#31532;&#20108;&#20010;&#21482;&#25903;&#25345;CVS&#65292;&#32780;&#31532;&#19977;&#20010;&#21482;&#25903;&#25345;Subversion&#12290;</p></div><div class="sect3" title="&#25552;&#20132;&#37038;&#20214;"><div class="titlepage"><div><div><h4 class="title"><a name="commit-emails"></a>&#25552;&#20132;&#37038;&#20214;</h4></div></div></div><p>&#23545;&#29256;&#26412;&#24211;&#30340;&#27599;&#19968;&#27425;&#25552;&#20132;&#24212;&#24403;&#33021;&#22815;&#20135;&#29983;&#19968;&#20010;&#37038;&#20214;&#65292;&#21253;&#21547;&#35841;&#20570;&#20986;&#20462;&#25913;&#30340;&#12289;&#20309;&#26102;&#20316;&#20986;&#30340;&#20462;&#25913;&#12289;&#20462;&#25913;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#20197;&#21450;&#20026;&#20160;&#20040;&#20462;&#25913;&#12290;&#37038;&#20214;&#24517;&#39035;&#21457;&#36865;&#21040;&#19987;&#27880;&#20110;&#25552;&#20132;&#37038;&#20214;&#30340;&#29305;&#21035;&#37038;&#20214;&#21015;&#34920;&#65292;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#33021;&#22815;&#21516;&#26222;&#36890;&#20154;&#30340;&#37038;&#20214;&#21306;&#20998;&#24320;&#26469;&#12290;&#24517;&#39035;&#40723;&#21169;&#24320;&#21457;&#32773;&#21644;&#20854;&#20182;&#24863;&#20852;&#36259;&#30340;&#21442;&#19982;&#32773;&#35746;&#38405;&#36825;&#20010;&#25552;&#20132;&#21015;&#34920;&#65292;&#36825;&#26159;&#20174;&#20195;&#30721;&#32423;&#21035;&#26469;&#36319;&#36394;&#39033;&#30446;&#30340;&#26368;&#26377;&#25928;&#26041;&#27861;&#12290;&#38500;&#20102;&#21516;&#32423;&#35780;&#23457;&#65288;&#35265;<a class="xref" href="setting-tone.html#code-review" title="&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;">the section called &#8220;&#23454;&#36341;&#26126;&#26174;&#30340;&#20195;&#30721;&#35780;&#23457;&#8221;</a>&#65289;&#36825;&#19968;&#26126;&#26174;&#30340;&#25216;&#26415;&#30410;&#22788;&#65292;&#25552;&#20132;&#37038;&#20214;&#24110;&#21161;&#25105;&#20204;&#24314;&#31435;&#20102;&#19968;&#31181;&#31038;&#21306;&#24847;&#35782;&#65292;&#22240;&#20026;&#20182;&#20204;&#21019;&#24314;&#20102;&#19968;&#20010;&#20849;&#20139;&#29615;&#22659;&#65292;&#22312;&#20854;&#20013;&#20154;&#20204;&#21487;&#20197;&#23545;&#20854;&#20182;&#20154;&#20063;&#21487;&#35265;&#30340;&#20107;&#20214;&#65288;&#25552;&#20132;&#65289;&#20316;&#20986;&#21453;&#24212;&#12290;</p><p>&#35774;&#32622;&#25552;&#20132;&#37038;&#20214;&#30340;&#20855;&#20307;&#26041;&#27861;&#20381;&#36182;&#20110;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#20294;&#36890;&#24120;&#26377;&#19968;&#20123;&#33050;&#26412;&#25110;&#20854;&#20182;&#24037;&#20855;&#21487;&#20197;&#23436;&#25104;&#36825;&#20010;&#24037;&#20316;&#12290;&#22914;&#26524;&#20320;&#22312;&#23547;&#25214;&#36807;&#31243;&#20013;&#36935;&#21040;&#22256;&#38590;&#65292;&#21487;&#20197;&#26597;&#19968;&#19979;<em class="firstterm">&#38057;&#23376;&#65288;hooks&#65289;</em>&#30340;&#25991;&#26723;&#65292;&#29305;&#21035;&#26159;<em class="firstterm">post-commit hook</em>&#65292;CVS&#20013;&#20063;&#31216;&#20316;<em class="firstterm">loginfo hook</em>&#12290;Post-commit&#38057;&#23376;&#22823;&#24847;&#19978;&#23601;&#26159;&#23545;&#25552;&#20132;&#20570;&#20986;&#33258;&#21160;&#21270;&#30340;&#21709;&#24212;&#12290;&#36825;&#20010;&#38057;&#23376;&#20250;&#30001;&#27599;&#20010;&#25552;&#20132;&#20986;&#21457;&#65292;&#24182;&#25552;&#20379;&#20851;&#20110;&#25552;&#20132;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#20320;&#21487;&#20197;&#33258;&#30001;&#30340;&#20351;&#29992;&#36825;&#20123;&#20449;&#24687;&#20570;&#20219;&#20309;&#20107;&#24773;&#8212;&#20363;&#22914;&#65292;&#21457;&#36865;&#19968;&#20010;&#37038;&#20214;&#12290;</p><p>&#36890;&#36807;&#39044;&#20808;&#21253;&#35013;&#30340;&#25552;&#20132;&#37038;&#20214;&#31995;&#32479;&#65292;&#20320;&#21487;&#33021;&#20250;&#24076;&#26395;&#20462;&#25913;&#19968;&#20123;&#40664;&#35748;&#30340;&#34892;&#20026;&#65306;</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>&#19968;&#20123;&#25552;&#20132;&#37038;&#20214;&#31243;&#24207;&#20250;&#22312;&#37038;&#20214;&#20013;&#21253;&#21547;&#23454;&#38469;&#30340;&#21306;&#21035;&#65292;&#32780;&#19981;&#26159;&#25552;&#20379;&#22312;web&#19978;&#20351;&#29992;&#29256;&#26412;&#24211;&#27983;&#35272;&#31995;&#32479;&#26597;&#30475;&#21464;&#26356;&#30340;URL&#12290;&#34429;&#28982;&#25552;&#20379;URL&#38750;&#24120;&#22909;&#65292;&#36825;&#26679;&#21518;&#38754;&#23601;&#21487;&#20197;&#24341;&#29992;&#36825;&#20010;&#21464;&#26356;&#65292;&#20294;&#26159;&#22312;&#37038;&#20214;&#26412;&#36523;&#20013;&#21253;&#21547;&#21306;&#21035;&#21516;&#26679;<span class="emphasis"><em>&#38750;&#24120;</em></span>&#37325;&#35201;&#12290;&#38405;&#35835;&#37038;&#20214;&#24050;&#32463;&#25104;&#20026;&#20154;&#20204;&#30340;&#20363;&#34892;&#30340;&#19968;&#37096;&#20998;&#65292;&#22914;&#26524;&#21464;&#26356;&#30340;&#20869;&#23481;&#22312;&#25552;&#20132;&#37038;&#20214;&#20013;&#65292;&#24320;&#21457;&#32773;&#21487;&#20197;&#31435;&#21051;&#36827;&#34892;&#35780;&#23457;&#65292;&#19981;&#38656;&#35201;&#31163;&#24320;&#37038;&#20214;&#38405;&#35835;&#22120;&#12290;&#22914;&#26524;&#20182;&#20204;&#38656;&#35201;&#28857;&#20987;&#19968;&#20010;URL&#26469;&#35780;&#23457;&#21464;&#26356;&#65292;&#22823;&#22810;&#25968;&#20154;&#23601;&#19981;&#20250;&#20316;&#20102;&#65292;&#22240;&#20026;&#38656;&#35201;&#24320;&#22987;&#19968;&#20010;&#26032;&#21160;&#20316;&#65292;&#32780;&#19981;&#26159;&#24310;&#32493;&#19968;&#20010;&#24050;&#21457;&#29983;&#30340;&#21160;&#20316;&#12290;&#27492;&#22806;&#65292;&#22914;&#26524;&#35780;&#23457;&#32773;&#24076;&#26395;&#35810;&#38382;&#21464;&#26356;&#30340;&#26576;&#20123;&#20107;&#24773;&#65292;&#21487;&#20197;&#30452;&#25509;&#36873;&#25321;&#24102;&#21407;&#25991;&#22238;&#22797;&#24182;&#27880;&#35299;&#21306;&#21035;&#65292;&#36825;&#26679;&#23601;&#19981;&#24517;&#35775;&#38382;&#32593;&#39029;&#24182;&#36763;&#21220;&#30340;&#20174;web&#27983;&#35272;&#22120;&#25335;&#36125;&#31896;&#36148;&#21040;&#37038;&#20214;&#23458;&#25143;&#31471;&#12290;</p><p>&#65288;&#24403;&#28982;&#65292;&#22914;&#26524;&#21306;&#21035;&#38750;&#24120;&#22823;&#65292;&#35832;&#22914;&#22823;&#29255;&#30340;&#26032;&#20195;&#30721;&#27491;&#25991;&#28155;&#21152;&#21040;&#20102;&#29256;&#26412;&#24211;&#65292;&#37027;&#20040;&#30465;&#25481;&#21306;&#21035;&#32780;&#21482;&#25552;&#20379;URL&#23601;&#27604;&#36739;&#26377;&#24847;&#20041;&#12290;&#22823;&#22810;&#25968;&#25552;&#20132;&#37038;&#20214;&#31243;&#24207;&#21487;&#20197;&#33258;&#21160;&#25191;&#34892;&#36825;&#31181;&#38480;&#21046;&#12290;&#22914;&#26524;&#20320;&#30340;&#19981;&#25903;&#25345;&#65292;&#37027;&#21253;&#21547;&#21306;&#21035;&#20063;&#27809;&#26377;&#20851;&#31995;&#65292;&#21482;&#26159;&#20598;&#23572;&#20250;&#26377;&#20123;&#22823;&#37038;&#20214;&#65292;&#27604;&#23436;&#20840;&#27809;&#26377;&#21306;&#21035;&#26356;&#22909;&#12290;&#20415;&#21033;&#30340;&#35780;&#23457;&#21644;&#22238;&#22797;&#26159;&#21327;&#20316;&#24320;&#21457;&#30340;&#22880;&#22522;&#30707;&#65292;&#26159;&#21542;&#23384;&#22312;&#21313;&#20998;&#20851;&#38190;&#12290;&#65289;</p></li><li class="listitem"><p>&#25552;&#20132;&#37038;&#20214;&#24517;&#39035;&#23558;Reply-to&#22836;&#35774;&#32622;&#20026;&#26222;&#36890;&#30340;&#24320;&#21457;&#37038;&#20214;&#21015;&#34920;&#65292;&#32780;&#19981;&#26159;&#25552;&#20132;&#37038;&#20214;&#21015;&#34920;&#12290;&#37027;&#26159;&#22240;&#20026;&#65292;&#24403;&#26377;&#20154;&#35780;&#23457;&#19968;&#20010;&#25552;&#20132;&#24182;&#25776;&#20889;&#20102;&#19968;&#20010;&#22238;&#22797;&#65292;&#36825;&#20010;&#22238;&#22797;&#24212;&#24403;&#33258;&#21160;&#36716;&#21521;&#21040;&#20154;&#20204;&#30340;&#24320;&#21457;&#37038;&#20214;&#21015;&#34920;&#65292;&#20063;&#23601;&#26159;&#36890;&#24120;&#20154;&#20204;&#35752;&#35770;&#25216;&#26415;&#38382;&#39064;&#30340;&#22320;&#26041;&#12290;&#26377;&#36825;&#20040;&#20960;&#20010;&#21407;&#22240;&#12290;&#39318;&#20808;&#65292;&#20320;&#24076;&#26395;&#23558;&#25216;&#26415;&#35752;&#35770;&#20445;&#25345;&#22312;&#19968;&#20010;&#37038;&#20214;&#21015;&#34920;&#20013;&#65292;&#22240;&#20026;&#36825;&#20063;&#26159;&#20154;&#20204;&#25152;&#26399;&#26395;&#30340;&#24773;&#20917;&#65292;&#32780;&#19988;&#36825;&#31181;&#24773;&#20917;&#19979;&#21482;&#38656;&#35201;&#25628;&#32034;&#19968;&#20010;&#24402;&#26723;&#12290;&#20854;&#27425;&#65292;&#26377;&#19968;&#20123;&#24863;&#20852;&#36259;&#30340;&#21442;&#19982;&#32773;&#21487;&#33021;&#27809;&#26377;&#35746;&#38405;&#25552;&#20132;&#37038;&#20214;&#21015;&#34920;&#12290;&#31532;&#19977;&#65292;&#25552;&#20132;&#37038;&#20214;&#21015;&#34920;&#25226;&#33258;&#24049;&#24403;&#20316;&#19968;&#20010;&#30417;&#35270;&#25552;&#20132;&#30340;&#26381;&#21153;&#65292;&#32780;&#19981;&#26159;&#29992;&#26469;&#20851;&#27880;&#25552;&#20132;<span class="emphasis"><em>&#24182;</em></span>&#20598;&#23572;&#36827;&#34892;&#25216;&#26415;&#35752;&#35770;&#12290;&#35746;&#38405;&#25552;&#20132;&#37038;&#20214;&#21015;&#34920;&#30340;&#20154;&#38500;&#20102;&#25552;&#20132;&#37038;&#20214;&#27809;&#26377;&#35746;&#38405;&#20854;&#20182;&#19996;&#35199;&#65307;&#36890;&#36807;&#37027;&#20010;&#21015;&#34920;&#21457;&#36865;&#20854;&#20182;&#20869;&#23481;&#36829;&#21453;&#20102;&#38544;&#21547;&#30340;&#22865;&#32422;&#12290;&#31532;&#22235;&#65292;&#20154;&#20204;&#32463;&#24120;&#20889;&#31243;&#24207;&#26469;&#38405;&#35835;&#25552;&#20132;&#37038;&#20214;&#21015;&#34920;&#24182;&#22788;&#29702;&#32467;&#26524;&#65288;&#20363;&#22914;&#20026;&#20102;&#26174;&#31034;&#19968;&#20010;&#32593;&#39029;&#65289;&#12290;&#36825;&#20123;&#31243;&#24207;&#39044;&#22791;&#22909;&#20102;&#22788;&#29702;&#19968;&#33268;&#26684;&#24335;&#30340;&#25552;&#20132;&#37038;&#20214;&#65292;&#20294;&#19982;&#20154;&#20889;&#30340;&#37038;&#20214;&#19981;&#21305;&#37197;&#12290;</p><p>&#35831;&#27880;&#24847;&#36825;&#37324;&#35774;&#32622;Reply-to&#30340;&#24314;&#35758;&#19982;<span>&#26412;&#31456;&#21069;&#38754;</span><a class="xref" href="mailing-lists.html#reply-to" title="&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;">the section called &#8220;&#20255;&#22823;&#30340;Reply-to&#36777;&#35770;&#8221;</a>&#20013;&#35828;&#30340;&#24182;&#19981;&#30683;&#30462;&#12290;&#23545;&#20110;&#20449;&#24687;&#30340;<span class="emphasis"><em>&#21457;&#36865;&#32773;</em></span>&#26469;&#35828;&#65292;&#35774;&#32622;Reply-to&#38750;&#24120;&#27491;&#24120;&#12290;&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;&#21457;&#36865;&#32773;&#26159;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26412;&#36523;&#65292;&#23427;&#35774;&#32622;Reply-to&#26159;&#20026;&#20102;&#35828;&#26126;&#22238;&#22797;&#30340;&#21512;&#36866;&#22320;&#26041;&#26159;&#24320;&#21457;&#37038;&#20214;&#21015;&#34920;&#65292;&#32780;&#19981;&#26159;&#25552;&#20132;&#21015;&#34920;&#12290;</p></li></ol></div><div class="sidebar" title="CIA&#65306;&#21478;&#19968;&#31181;&#21464;&#26356;&#20844;&#31034;&#26426;&#21046;"><a name="cia"></a><div class="titlepage"><div><div><p class="title"><b>CIA&#65306;&#21478;&#19968;&#31181;&#21464;&#26356;&#20844;&#31034;&#26426;&#21046;</b></p></div></div></div><p>&#25552;&#20132;&#37038;&#20214;&#19981;&#26159;&#20256;&#25773;&#21464;&#26356;&#26032;&#38395;&#30340;&#21807;&#19968;&#26041;&#24335;&#12290;&#26368;&#36817;&#19968;&#31181;&#21483;&#20570;CIA&#65288;<a class="ulink" href="http://cia.navi.cx/" target="_top">http://cia.navi.cx/</a>&#65289;&#30340;&#26426;&#21046;&#34987;&#24320;&#21457;&#20102;&#20986;&#26469;&#12290;CIA&#26159;&#19968;&#20010;&#23454;&#26102;&#25552;&#20132;&#32479;&#35745;&#20449;&#24687;&#30340;&#32858;&#21512;&#22120;&#21644;&#20998;&#21457;&#22120;&#12290;CIA&#26368;&#27969;&#34892;&#30340;&#29992;&#22788;&#26159;&#21457;&#36865;&#25552;&#20132;&#25552;&#37266;&#21040;IRC&#39057;&#36947;&#65292;&#25152;&#20197;&#30331;&#38470;&#21040;&#39057;&#36947;&#30340;&#20154;&#37117;&#21487;&#20197;&#23454;&#26102;&#30340;&#30475;&#21040;&#21457;&#29983;&#30340;&#25552;&#20132;&#12290;&#23613;&#31649;&#27604;&#25552;&#20132;&#37038;&#20214;&#26377;&#36739;&#23569;&#30340;&#25216;&#26415;&#21151;&#25928;&#65292;&#22240;&#20026;&#35266;&#23519;&#32773;&#19981;&#19968;&#23450;&#20250;&#22312;&#25552;&#20132;&#25552;&#37266;&#24377;&#20986;&#26102;&#23601;&#22312;&#39057;&#36947;&#19978;&#65292;&#20294;&#26159;&#36825;&#39033;&#25216;&#26415;&#20173;&#28982;&#26377;&#24040;&#22823;&#30340;<span class="emphasis"><em>&#31038;&#20250;</em></span>&#21151;&#25928;&#12290;&#20154;&#20204;&#24471;&#21040;&#20102;&#25104;&#20026;&#26576;&#20010;&#23384;&#22312;&#24182;&#27963;&#36291;&#20107;&#21153;&#19968;&#37096;&#20998;&#30340;&#24863;&#35273;&#65292;&#24182;&#19988;&#20182;&#20204;&#33021;&#22815;&#24863;&#21040;&#27491;&#22312;&#21457;&#29983;&#30340;&#36827;&#23637;&#12290;</p><p>&#24037;&#20316;&#21407;&#29702;&#26159;&#36890;&#36807;&#20320;&#30340;post-commit&#38057;&#23376;&#35843;&#29992;CIA&#36890;&#30693;&#31243;&#24207;&#12290;&#36890;&#30693;&#22120;&#20250;&#23558;&#25552;&#20132;&#20449;&#24687;&#26684;&#24335;&#21270;&#20026;XML&#20449;&#24687;&#65292;&#24182;&#21457;&#36865;&#21040;&#20013;&#22830;&#26381;&#21153;&#22120;&#65288;&#36890;&#24120;&#26159;<code class="literal">cia.navi.cx</code>&#65289;&#12290;&#28982;&#21518;&#26381;&#21153;&#22120;&#23558;&#25552;&#20132;&#20449;&#24687;&#20998;&#21457;&#21040;&#20854;&#20182;&#35770;&#22363;&#12290;</p><p>CIA&#20063;&#21487;&#20197;&#35774;&#32622;&#26469;&#21457;&#36865;<a class="ulink" href="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html" target="_top">RSS</a>&#20379;&#31295;&#65292;&#26356;&#22810;&#32454;&#33410;&#21487;&#20197;&#30475;&#22312;<a class="ulink" href="http://cia.navi.cx/" target="_top">http://cia.navi.cx/</a>&#30340;&#25991;&#26723;&#12290;</p><p>&#22914;&#26524;&#20320;&#24819;&#21442;&#32771;CIA&#30340;&#19968;&#20010;&#23454;&#20363;&#65292;&#23558;&#20320;&#30340;IRC&#23458;&#25143;&#31471;&#25351;&#21521;<code class="literal">irc.freenode.net</code>&#65292;&#39057;&#36947;<code class="literal">#commits</code>&#12290;</p></div></div><div class="sect3" title="&#20351;&#29992;&#20998;&#25903;&#26469;&#36991;&#20813;&#29942;&#39048;"><div class="titlepage"><div><div><h4 class="title"><a name="branches"></a>&#20351;&#29992;&#20998;&#25903;&#26469;&#36991;&#20813;&#29942;&#39048;</h4></div></div></div><p>&#38750;&#19987;&#23478;&#30340;&#29256;&#26412;&#25511;&#21046;&#29992;&#25143;&#26377;&#26102;&#20505;&#20250;&#25285;&#24515;&#20998;&#25903;&#19982;&#21512;&#24182;&#12290;&#36825;&#21487;&#33021;&#26159;CVS&#27969;&#34892;&#24615;&#30340;&#21103;&#20316;&#29992;&#65306;CVS&#23545;&#20110;&#20998;&#25903;&#21644;&#21512;&#24182;&#30340;&#25509;&#21475;&#21644;&#25105;&#20204;&#30340;&#30693;&#35273;&#19981;&#22826;&#19968;&#33268;&#65292;&#25152;&#20197;&#24456;&#22810;&#20154;&#23398;&#30528;&#23436;&#20840;&#36991;&#20813;&#27492;&#31867;&#25805;&#20316;&#12290;</p><p>&#22914;&#26524;&#20320;&#21608;&#22260;&#26377;&#24456;&#22810;&#36825;&#31867;&#20154;&#65292;&#31435;&#21363;&#19979;&#20915;&#24515;&#25112;&#32988;&#25152;&#26377;&#24656;&#24807;&#65292;&#24182;&#33457;&#26102;&#38388;&#23398;&#20250;&#22914;&#20309;&#20998;&#25903;&#21644;&#21512;&#24182;&#12290;&#23427;&#20204;&#19981;&#26159;&#20160;&#20040;&#22256;&#38590;&#30340;&#25805;&#20316;&#65292;&#19968;&#26086;&#20320;&#20064;&#24815;&#20102;&#65292;&#23545;&#20110;&#39033;&#30446;&#33719;&#21462;&#26356;&#22810;&#30340;&#24320;&#21457;&#32773;&#36825;&#26085;&#30410;&#37325;&#35201;&#12290;</p><p>&#20998;&#25903;&#38750;&#24120;&#26377;&#20215;&#20540;&#65292;&#22240;&#20026;&#23427;&#23558;&#19968;&#39033;&#31232;&#32570;&#30340;&#36164;&#28304;&#8212;&#39033;&#30446;&#20195;&#30721;&#30340;&#24037;&#20316;&#31354;&#38388;&#8212;&#21464;&#24471;&#20805;&#36275;&#12290;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#25152;&#26377;&#30340;&#24320;&#21457;&#32773;&#22312;&#21516;&#19968;&#20010;&#27801;&#30418;&#19968;&#36215;&#24037;&#20316;&#65292;&#24314;&#35774;&#21516;&#19968;&#24231;&#22478;&#22561;&#12290;&#24403;&#26576;&#20010;&#20154;&#24076;&#26395;&#28155;&#21152;&#19968;&#20010;&#26032;&#30340;&#21514;&#26725;&#65292;&#20294;&#26159;&#19981;&#33021;&#30830;&#35748;&#20854;&#20182;&#20154;&#26159;&#21542;&#27491;&#22312;&#24037;&#20316;&#65292;&#20998;&#25903;&#20351;&#22905;&#34987;&#38548;&#31163;&#21040;&#19968;&#20010;&#35282;&#33853;&#24182;&#20570;&#20986;&#23581;&#35797;&#25104;&#20026;&#21487;&#33021;&#12290;&#22914;&#26524;&#36825;&#31181;&#25237;&#20837;&#25104;&#21151;&#20102;&#65292;&#22905;&#21487;&#20197;&#35201;&#27714;&#20854;&#20182;&#24320;&#21457;&#32773;&#26816;&#39564;&#36825;&#20010;&#32467;&#26524;&#12290;&#22914;&#26524;&#25152;&#26377;&#20154;&#35748;&#21487;&#32467;&#26524;&#65292;&#20182;&#20204;&#21487;&#20197;&#21578;&#35785;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#23558;&#21514;&#26725;&#20174;&#20998;&#25903;&#22478;&#22561;&#31227;&#21160;&#65288;&#8220;&#21512;&#24182;&#8221;&#65289;&#21040;&#20027;&#22478;&#22561;&#12290;</p><p>&#24456;&#23481;&#26131;&#30475;&#21040;&#36825;&#39033;&#33021;&#21147;&#26159;&#22914;&#20309;&#24110;&#21161;&#21327;&#20316;&#24320;&#21457;&#30340;&#12290;&#20154;&#20204;&#38656;&#35201;&#33258;&#30001;&#23581;&#35797;&#26032;&#38382;&#39064;&#30340;&#24863;&#35273;&#65292;&#32780;&#26080;&#39035;&#25285;&#24515;&#24178;&#25200;&#20854;&#20182;&#20154;&#30340;&#24037;&#20316;&#12290;&#21516;&#26679;&#37325;&#35201;&#30340;&#26159;&#65292;&#24403;&#20026;&#20102;&#23436;&#25104;bug&#20462;&#27491;&#25110;&#21457;&#24067;&#31283;&#23450;&#21270;&#65288;&#35265;&lt;<span><a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a>&#30340;</span><a class="xref" href="stabilizing-a-release.html" title="&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;">the section called &#8220;&#31283;&#23450;&#21457;&#24067;&#29256;&#26412;&#8221;</a>&#21644;<a class="xref" href="release-lines.html" title="&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;">the section called &#8220;&#32500;&#25252;&#22810;&#21457;&#24067;&#32447;&#8221;</a>&#65289;&#65292;&#20195;&#30721;&#38656;&#35201;&#20174;&#26085;&#24120;&#30340;&#24320;&#21457;&#20013;&#20998;&#31163;&#20986;&#26469;&#26102;&#65292;&#25152;&#33457;&#36153;&#30340;&#26102;&#38388;&#25968;&#20493;&#20110;&#26080;&#38656;&#25285;&#24515;&#36319;&#36394;&#19968;&#20010;&#31227;&#21160;&#30446;&#26631;&#30340;&#24773;&#20917;&#12290;</p><p>&#19981;&#21463;&#38480;&#21046;&#30340;&#20351;&#29992;&#20998;&#25903;&#65292;&#24182;&#40723;&#21169;&#20854;&#20182;&#20154;&#20063;&#36825;&#26679;&#20570;&#12290;&#20294;&#26159;&#35201;&#30830;&#20445;&#20219;&#20309;&#29305;&#23450;&#20998;&#25903;&#21482;&#20445;&#25345;&#24517;&#35201;&#30340;&#26368;&#30701;&#26102;&#38388;&#12290;&#20219;&#20309;&#27963;&#21160;&#20998;&#25903;&#37117;&#20250;&#35753;&#31038;&#21306;&#20998;&#31070;&#12290;&#21363;&#20351;&#19981;&#26159;&#22312;&#20998;&#25903;&#24037;&#20316;&#30340;&#20154;&#20063;&#38656;&#35201;&#23545;&#27492;&#26377;&#25152;&#20102;&#35299;&#12290;&#36825;&#31181;&#20102;&#35299;&#26159;&#24212;&#35813;&#30340;&#65292;&#24403;&#28982;&#65292;&#23545;&#20110;&#20998;&#25903;&#30340;&#25552;&#20132;&#24212;&#35813;&#33021;&#21644;&#20854;&#20182;&#25552;&#20132;&#19968;&#26679;&#21457;&#36865;&#25552;&#20132;&#37038;&#20214;&#12290;&#20294;&#26159;&#20998;&#25903;&#19981;&#24212;&#35813;&#25104;&#20026;&#20998;&#21106;&#24320;&#21457;&#31038;&#21306;&#30340;&#26426;&#21046;&#12290;&#38500;&#20102;&#24456;&#23569;&#30340;&#20363;&#22806;&#65292;&#22823;&#22810;&#25968;&#20998;&#25903;&#26368;&#32456;&#24517;&#39035;&#21512;&#24182;&#22238;&#23427;&#20204;&#30340;&#20027;&#24178;&#24182;&#28040;&#22833;&#12290;</p></div><div class="sect3" title="&#20449;&#24687;&#21333;&#19968;&#24615;"><div class="titlepage"><div><div><h4 class="title"><a name="vc-singularity"></a>&#20449;&#24687;&#21333;&#19968;&#24615;</h4></div></div></div><p>&#21512;&#24182;&#26377;&#19968;&#20010;&#25512;&#35770;&#65306;&#19981;&#35201;&#23558;&#21516;&#19968;&#20010;&#21464;&#26356;&#25552;&#20132;&#20004;&#27425;&#12290;&#20063;&#23601;&#26159;&#19968;&#20010;&#20462;&#25913;&#21482;&#36827;&#20837;&#19968;&#27425;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#21464;&#26356;&#30340;&#20462;&#35746;&#65288;&#25110;&#19968;&#32452;&#20462;&#35746;&#65289;&#21487;&#20197;&#22312;&#20854;&#36827;&#20837;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20043;&#21518;&#25317;&#26377;&#21807;&#19968;&#26631;&#31034;&#12290;&#22914;&#26524;&#23427;&#38656;&#35201;&#24212;&#29992;&#21040;&#36824;&#27809;&#26377;&#24212;&#29992;&#36807;&#30340;&#20998;&#25903;&#65292;&#37027;&#20040;&#23427;&#24212;&#35813;&#20174;&#26368;&#21021;&#30340;&#20837;&#21475;&#28857;&#21512;&#24182;&#21040;&#20854;&#20182;&#30446;&#26631;&#8212;&#32780;&#19981;&#26159;&#30452;&#25509;&#25552;&#20132;&#30456;&#21516;&#30340;&#25991;&#26412;&#65292;&#36825;&#26679;&#34429;&#28982;&#23545;&#20195;&#30721;&#30340;&#25928;&#26524;&#26159;&#19968;&#26679;&#30340;&#65292;&#20294;&#20250;&#23548;&#33268;&#25105;&#20204;&#26080;&#27861;&#36827;&#34892;&#31934;&#30830;&#30340;&#35760;&#24405;&#21644;&#21457;&#24067;&#31649;&#29702;&#12290;</p><p>&#36825;&#20010;&#24314;&#35758;&#23545;&#20110;&#19981;&#21516;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#23454;&#36341;&#25928;&#26524;&#19981;&#23613;&#30456;&#21516;&#12290;&#22312;&#19968;&#20123;&#31995;&#32479;&#65292;&#21512;&#24182;&#26159;&#29305;&#27530;&#30340;&#20107;&#20214;&#65292;&#20174;&#26681;&#26412;&#19978;&#19982;&#25552;&#20132;&#19981;&#21516;&#65292;&#24182;&#21253;&#21547;&#20182;&#20204;&#33258;&#24049;&#30340;&#20803;&#25968;&#25454;&#12290;&#32780;&#21478;&#22806;&#19968;&#20123;&#31995;&#32479;&#65292;&#21512;&#24182;&#30340;&#32467;&#26524;&#23601;&#20687;&#20854;&#20182;&#21464;&#26356;&#19968;&#26679;&#26159;&#25552;&#20132;&#21040;&#20102;&#31995;&#32479;&#65292;&#25152;&#20197;&#21306;&#21035;&#8220;&#21512;&#24182;&#25552;&#20132;&#8221;&#21644;&#8220;&#26032;&#21464;&#26356;&#25552;&#20132;&#8221;&#30340;&#20027;&#35201;&#26041;&#27861;&#26159;&#20351;&#29992;&#26085;&#24535;&#20449;&#24687;&#12290;&#22312;&#21512;&#24182;&#30340;&#26085;&#24535;&#20449;&#24687;&#20013;&#65292;&#19981;&#20250;&#20877;&#37325;&#22797;&#21407;&#22987;&#21464;&#26356;&#30340;&#20449;&#24687;&#12290;&#32780;&#21482;&#26159;&#25351;&#26126;&#36825;&#26159;&#19968;&#20010;&#21512;&#24182;&#65292;&#24182;&#25552;&#20379;&#21407;&#22987;&#21464;&#26356;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#20197;&#21450;&#19968;&#27573;&#35828;&#26126;&#20854;&#25928;&#26524;&#30340;&#25991;&#23383;&#12290;&#22914;&#26524;&#26377;&#20154;&#24076;&#26395;&#30475;&#21040;&#23436;&#25972;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;&#22905;&#24212;&#35813;&#21442;&#32771;&#21407;&#26469;&#30340;&#20462;&#35746;&#12290;</p><p>&#36991;&#20813;&#22312;&#25552;&#20132;&#20043;&#21518;&#20877;&#37325;&#22797;&#26085;&#24535;&#20449;&#24687;&#30340;&#21407;&#22240;&#38750;&#24120;&#37325;&#35201;&#65292;&#22240;&#20026;&#26085;&#24535;&#20250;&#22312;&#25552;&#20132;&#21518;&#34987;&#20462;&#25913;&#12290;&#22914;&#26524;&#21464;&#26356;&#26085;&#24535;&#22312;&#27599;&#20010;&#21512;&#24182;&#30446;&#26631;&#20013;&#37325;&#22797;&#65292;&#37027;&#26377;&#26397;&#19968;&#26085;&#22905;&#20462;&#25913;&#20102;&#26368;&#21021;&#30340;&#20449;&#24687;&#65292;&#32780;&#37027;&#20123;&#37325;&#22797;&#36824;&#26159;&#20250;&#20445;&#25345;&#38169;&#35823;&#8212;&#28151;&#28102;&#23601;&#20250;&#25345;&#32493;&#19979;&#21435;&#12290;</p><p>&#21516;&#26679;&#30340;&#21407;&#29702;&#20063;&#36866;&#29992;&#20110;&#25764;&#38144;&#19968;&#20010;&#21464;&#26356;&#12290;&#22914;&#26524;&#19968;&#20010;&#21464;&#26356;&#20174;&#20195;&#30721;&#20013;&#25764;&#38144;&#65292;&#37027;&#20040;&#36825;&#20010;&#25764;&#38144;&#30340;&#26085;&#24535;&#20449;&#24687;&#20063;&#24212;&#35813;&#20165;&#20165;&#26159;&#25351;&#26126;&#25764;&#38144;&#30340;&#26159;&#21738;&#20123;&#29305;&#23450;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#32780;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#25551;&#36848;&#25764;&#38144;&#36807;&#31243;&#20013;&#23454;&#38469;&#21464;&#26356;&#30340;&#20195;&#30721;&#65292;&#22240;&#20026;&#21464;&#26356;&#30340;&#20869;&#23481;&#21487;&#20197;&#36890;&#36807;&#38405;&#35835;&#21407;&#26469;&#30340;&#26085;&#24535;&#20449;&#24687;&#21644;&#20462;&#35746;&#33719;&#24471;&#12290;&#24403;&#28982;&#65292;&#20462;&#35746;&#29256;&#26412;&#26085;&#24535;&#20449;&#24687;&#20063;&#24212;&#24403;&#35828;&#26126;&#24674;&#22797;&#21464;&#26356;&#30340;&#21407;&#22240;&#65292;&#20294;&#23427;&#19981;&#24212;&#35813;&#20174;&#21407;&#22987;&#21464;&#26356;&#26085;&#24535;&#20449;&#24687;&#22797;&#21046;&#20219;&#20309;&#19996;&#35199;&#12290;&#22914;&#26524;&#21487;&#33021;&#65292;&#22238;&#21040;&#21407;&#26469;&#30340;&#21464;&#26356;&#26085;&#24535;&#20449;&#24687;&#65292;&#24182;&#25351;&#26126;&#23427;&#24050;&#32463;&#25764;&#38144;&#20102;&#12290;</p><p>&#21069;&#38754;&#25152;&#35828;&#30340;&#37117;&#26263;&#31034;&#20102;&#20320;&#24212;&#35813;&#20351;&#29992;&#19968;&#33268;&#30340;&#35821;&#27861;&#26469;&#24341;&#29992;&#36825;&#20123;&#20462;&#35746;&#29256;&#26412;&#12290;&#36825;&#19981;&#20165;&#20165;&#22312;&#26085;&#24535;&#20449;&#24687;&#20013;&#26377;&#30410;&#65292;&#22312;&#37038;&#20214;&#12289;Bug&#36319;&#36394;&#21644;&#20854;&#20182;&#22320;&#26041;&#20063;&#21516;&#26679;&#37325;&#35201;&#12290;&#22914;&#26524;&#20320;&#20351;&#29992;CVS&#65292;&#25105;&#24314;&#35758;&#20351;&#29992;&#8220;<code class="literal">path/to/file/in/project/tree:REV</code>&#8221;&#65292;&#20854;&#20013;&#30340;REV&#23601;&#26159;CVS&#30340;&#20462;&#35746;&#29256;&#26412;&#22909;&#21527;&#65292;&#20363;&#22914;&#8220;1.76&#8221;&#12290;&#22914;&#26524;&#20320;&#20351;&#29992;Subversion&#65292;&#20462;&#35746;&#29256;&#26412;1729&#30340;&#26631;&#20934;&#35821;&#27861;&#26159;&#8220;r1729&#8221;&#65288;&#25991;&#20214;&#36335;&#24452;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#22240;&#20026;Subversion&#20351;&#29992;&#20840;&#23616;&#20462;&#35746;&#29256;&#26412;&#21495;&#65289;&#12290;&#22312;&#20854;&#20182;&#31995;&#32479;&#20013;&#65292;&#20063;&#37117;&#26377;&#19968;&#20123;&#34920;&#36798;&#21464;&#26356;&#38598;&#30340;&#26631;&#20934;&#35821;&#27861;&#12290;&#26080;&#35770;&#23545;&#20320;&#30340;&#31995;&#32479;&#21512;&#36866;&#30340;&#35821;&#27861;&#26159;&#20160;&#20040;&#65292;&#40723;&#21169;&#20154;&#20204;&#20351;&#29992;&#23427;&#20204;&#26469;&#24341;&#29992;&#21464;&#26356;&#12290;&#23545;&#21464;&#26356;&#21517;&#19968;&#33268;&#30340;&#34920;&#36798;&#26041;&#27861;&#21487;&#20197;&#24110;&#21161;&#39033;&#30446;&#26356;&#31616;&#21333;&#30340;&#32426;&#24405;&#65288;&#22312;<a class="xref" href="communications.html" title="Chapter 6. &#20132;&#27969;">Chapter 6, <i>&#20132;&#27969;</i></a>&#21644;<a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a>&#25105;&#20204;&#23558;&#20250;&#30475;&#21040;&#65289;&#65292;&#32780;&#19988;&#22240;&#20026;&#35768;&#22810;&#32426;&#24405;&#26159;&#30001;&#24535;&#24895;&#32773;&#23436;&#25104;&#30340;&#65292;&#23427;&#24212;&#35813;&#23613;&#21487;&#33021;&#30340;&#31616;&#21333;&#12290;</p><p>&#22312;<span><a class="xref" href="development-cycle.html" title="Chapter 7. &#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">Chapter 7, <i>&#25171;&#21253;&#12289;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;</i></a>&#30340;</span><a class="xref" href="releases-and-daily-development.html" title="&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;">the section called &#8220;&#21457;&#24067;&#21644;&#26085;&#24120;&#24320;&#21457;&#8221;</a>&#20063;&#26377;&#20171;&#32461;&#12290;</p></div><div class="sect3" title="&#25480;&#26435;"><div class="titlepage"><div><div><h4 class="title"><a name="vc-authz"></a>&#25480;&#26435;</h4></div></div></div><p>&#22823;&#22810;&#25968;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#25552;&#20379;&#20102;&#25511;&#21046;&#29305;&#23450;&#20154;&#21487;&#20197;&#20174;&#29256;&#26412;&#24211;&#29305;&#23450;&#23376;&#21306;&#22495;&#25552;&#20132;&#30340;&#29305;&#24615;&#12290;&#26681;&#25454;&#36825;&#20010;&#21407;&#29702;&#65292;&#24403;&#20154;&#20204;&#25163;&#25569;&#38180;&#23376;&#26102;&#65292;&#23601;&#24320;&#22987;&#21040;&#22788;&#25214;&#38025;&#23376;&#65292;&#35768;&#22810;&#39033;&#30446;&#24320;&#22987;&#24675;&#24847;&#20351;&#29992;&#36825;&#31181;&#29305;&#24615;&#65292;&#23567;&#24515;&#30340;&#20026;&#27599;&#20010;&#20154;&#21482;&#36171;&#20104;&#20182;&#20204;&#34987;&#30830;&#35748;&#30340;&#26435;&#38480;&#65292;&#32780;&#19981;&#33021;&#22312;&#20219;&#20309;&#20854;&#20182;&#22320;&#26041;&#25552;&#20132;&#12290; &#65288;&#30475;<span><a class="xref" href="managing-volunteers.html" title="Chapter 8. &#31649;&#29702;&#24535;&#24895;&#32773;">Chapter 8, <i>&#31649;&#29702;&#24535;&#24895;&#32773;</i></a>&#30340;</span><a class="xref" href="committers.html" title="&#25552;&#20132;&#32773;">the section called &#8220;&#25552;&#20132;&#32773;&#8221;</a>&#26469;&#30830;&#35748;&#20309;&#20154;&#21487;&#20197;&#22312;&#20309;&#22788;&#25552;&#20132;&#12290;&#65289;</p><p>&#25191;&#34892;&#36825;&#26679;&#20005;&#26684;&#30340;&#25511;&#21046;&#21487;&#33021;&#20250;&#26377;&#19968;&#20123;&#23475;&#22788;&#65292;&#19968;&#20010;&#23485;&#26494;&#30340;&#25919;&#31574;&#20063;&#36275;&#22815;&#22909;&#12290;&#19968;&#20123;&#39033;&#30446;&#20250;&#31616;&#21333;&#24471;&#20351;&#29992;&#19968;&#20010;&#33635;&#35465;&#31995;&#32479;&#65306;&#24403;&#19968;&#20010;&#20154;&#34987;&#36171;&#20104;&#25552;&#20132;&#26435;&#38480;&#65292;&#21363;&#20351;&#21482;&#26159;&#29256;&#26412;&#24211;&#30340;&#19968;&#20010;&#23376;&#21306;&#22495;&#65292;&#20182;&#20063;&#20250;&#25910;&#21040;&#19968;&#20010;&#21487;&#20197;&#22312;&#39033;&#30446;&#25152;&#26377;&#22320;&#26041;&#21487;&#20197;&#25552;&#20132;&#30340;&#23494;&#30721;&#12290;&#20182;&#20204;&#21482;&#26159;&#34987;&#21578;&#30693;&#35201;&#22312;&#33258;&#24049;&#30340;&#21306;&#22495;&#25552;&#20132;&#12290;&#35831;&#35760;&#20303;&#36825;&#37324;&#27809;&#26377;&#30495;&#27491;&#30340;&#21361;&#38505;&#65306;&#22312;&#19968;&#20010;&#27963;&#36291;&#30340;&#39033;&#30446;&#37324;&#65292;&#25152;&#26377;&#30340;&#25552;&#20132;&#20250;&#34987;&#23457;&#26680;&#12290;&#22914;&#26524;&#26377;&#20154;&#22312;&#19981;&#34987;&#20801;&#35768;&#30340;&#22320;&#26041;&#25552;&#20132;&#65292;&#20854;&#20182;&#20154;&#20250;&#21457;&#29616;&#36825;&#19968;&#28857;&#24182;&#35828;&#20986;&#26469;&#12290;&#22914;&#26524;&#36825;&#20010;&#21464;&#26356;&#38656;&#35201;&#34987;&#22238;&#36864;&#65292;&#24456;&#31616;&#21333;&#8212;&#22240;&#20026;&#25152;&#26377;&#22320;&#21464;&#26356;&#37117;&#22312;&#29256;&#26412;&#25511;&#21046;&#20043;&#19979;&#65292;&#21482;&#38656;&#35201;&#22238;&#36864;&#12290;</p><p>&#36825;&#31181;&#23485;&#26494;&#30340;&#26041;&#27861;&#26377;&#35768;&#22810;&#22909;&#22788;&#12290;&#39318;&#20808;&#65292;&#24403;&#24320;&#21457;&#32773;&#25193;&#23637;&#20102;&#20182;&#20204;&#30340;&#27963;&#21160;&#33539;&#22260;&#65288;&#22914;&#26524;&#20182;&#20204;&#19968;&#30452;&#22312;&#39033;&#30446;&#20013;&#65292;&#36825;&#26159;&#19968;&#20010;&#36890;&#24120;&#30340;&#24773;&#20917;&#65289;&#65292;&#36171;&#20104;&#26356;&#23485;&#27867;&#30340;&#26435;&#38480;&#26080;&#38656;&#39069;&#22806;&#30340;&#31649;&#29702;&#24037;&#20316;&#12290;&#19968;&#26086;&#20316;&#20986;&#20102;&#36825;&#26679;&#30340;&#20915;&#23450;&#65292;&#36825;&#20010;&#20154;&#23601;&#21487;&#20197;&#31435;&#21051;&#22312;&#26032;&#21306;&#22495;&#25552;&#20132;&#12290;</p><p>&#31532;&#20108;&#65292;&#25193;&#23637;&#21487;&#20197;&#20197;&#19968;&#31181;&#26356;&#32454;&#33268;&#30340;&#26041;&#24335;&#23454;&#29616;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#21306;&#22495;X&#30340;&#25552;&#20132;&#32773;&#22914;&#26524;&#24076;&#26395;&#25193;&#23637;&#21040;&#21306;&#22495;Y&#65292;&#20182;&#20250;&#36890;&#36807;&#21457;&#34920;&#23545;Y&#30340;&#19968;&#20010;&#34917;&#19969;&#24182;&#23547;&#27714;&#35780;&#23457;&#24320;&#22987;&#12290;&#22914;&#26524;&#23545;&#21306;&#22495;Y&#26377;&#25552;&#20132;&#26435;&#38480;&#30340;&#20154;&#30475;&#21040;&#36825;&#20010;&#34917;&#19969;&#24182;&#30830;&#35748;&#65292;&#20182;&#21487;&#20197;&#30452;&#25509;&#35753;&#25552;&#20132;&#32773;&#30452;&#25509;&#25552;&#20132;&#36825;&#20010;&#21464;&#26356;&#65288;&#24403;&#28982;&#20063;&#35201;&#22312;&#26085;&#24535;&#20449;&#24687;&#20013;&#25552;&#21450;&#35780;&#23457;&#32773;/&#30830;&#35748;&#32773;&#30340;&#21517;&#23383;&#65289;&#12290;&#36825;&#26679;&#65292;&#36825;&#20010;&#25552;&#20132;&#23601;&#20250;&#25104;&#20026;&#23454;&#38469;&#32534;&#20889;&#21464;&#26356;&#32773;&#30340;&#20316;&#21697;&#65292;&#26080;&#35770;&#20174;&#20449;&#24687;&#31649;&#29702;&#35282;&#24230;&#36824;&#26159;&#23457;&#35745;&#35282;&#24230;&#36825;&#26679;&#37117;&#26356;&#22909;&#12290;</p><p>&#26368;&#21518;&#65292;&#21487;&#33021;&#26159;&#26368;&#37325;&#35201;&#30340;&#65292;&#20351;&#29992;&#33635;&#35465;&#31995;&#32479;&#26469;&#40723;&#21169;&#20114;&#30456;&#23562;&#37325;&#21644;&#20449;&#20219;&#30340;&#27675;&#22260;&#12290;&#32473;&#19968;&#20010;&#20154;&#23545;&#26576;&#19968;&#21306;&#22495;&#30340;&#35775;&#38382;&#26435;&#38480;&#26159;&#23545;&#20182;&#20204;&#24050;&#32463;&#23436;&#25104;&#25216;&#26415;&#20934;&#22791;&#30340;&#35777;&#26126;&#8212;&#36825;&#26159;&#35828;&#65306;&#8220;&#25105;&#20204;&#24050;&#32463;&#30475;&#21040;&#20102;&#20320;&#24050;&#32463;&#20855;&#22791;&#20102;&#23545;&#26576;&#19968;&#39046;&#22495;&#20570;&#20986;&#20462;&#25913;&#30340;&#19987;&#19994;&#30693;&#35782;&#65292;&#37027;&#23601;&#32487;&#32493;&#21543;&#12290;&#8221;&#20294;&#35774;&#32622;&#20005;&#26684;&#30340;&#25480;&#26435;&#25511;&#21046;&#21017;&#26159;&#26263;&#31034;&#65306;&#8220;&#25105;&#20204;&#19981;&#20165;&#20165;&#30830;&#35748;&#20320;&#19987;&#19994;&#30693;&#35782;&#30340;&#38480;&#21046;&#65292;&#32780;&#19988;&#25105;&#20204;&#23545;&#20320;&#30340;<span class="emphasis"><em>&#30446;&#30340;</em></span>&#20063;&#20445;&#25345;&#24576;&#30097;&#12290;&#8221;&#22914;&#26524;&#21487;&#20197;&#36991;&#20813;&#30340;&#35805;&#65292;&#20320;&#19968;&#23450;&#19981;&#24895;&#24847;&#20570;&#20986;&#36825;&#26679;&#30340;&#35780;&#20215;&#12290;&#23558;&#19968;&#20010;&#20154;&#24341;&#20837;&#20026;&#39033;&#30446;&#30340;&#25552;&#20132;&#32773;&#26159;&#23558;&#20854;&#24341;&#20837;&#20114;&#30456;&#20449;&#20219;&#24490;&#29615;&#30340;&#26426;&#20250;&#12290;&#22909;&#30340;&#26041;&#27861;&#26159;&#32473;&#20182;&#20204;&#27604;&#26399;&#26395;&#25152;&#33021;&#21457;&#25381;&#20316;&#29992;&#26356;&#22823;&#30340;&#26435;&#21147;&#65292;&#28982;&#21518;&#21578;&#35785;&#20182;&#20204;&#26159;&#21542;&#20445;&#25345;&#22312;&#35268;&#23450;&#30340;&#38480;&#21046;&#20869;&#23436;&#20840;&#20381;&#36182;&#20110;&#20182;&#20204;&#33258;&#24049;&#12290;</p><p>Subversion&#39033;&#30446;&#25353;&#29031;&#33635;&#35465;&#31995;&#32479;&#30340;&#26041;&#24335;&#24050;&#32463;&#36816;&#20316;&#36229;&#36807;4&#24180;&#20102;&#65292;&#22312;&#20889;&#20316;&#26102;&#21253;&#21547;&#20102;33&#20010;&#23436;&#20840;&#30340;&#21644;43&#20010;&#37096;&#20998;&#25552;&#20132;&#32773;&#12290;&#31995;&#32479;&#23454;&#38469;&#24378;&#21046;&#30340;&#21482;&#26159;&#25552;&#20132;&#32773;&#21644;&#38750;&#25552;&#20132;&#32773;&#30340;&#21306;&#21035;&#65307;&#26356;&#32454;&#30340;&#21010;&#20998;&#21482;&#30001;&#20154;&#20026;&#25511;&#21046;&#12290;&#20294;&#26159;&#25105;&#20204;&#20174;&#26469;&#27809;&#26377;&#36935;&#21040;&#25925;&#24847;&#22312;&#39046;&#22495;&#22806;&#25552;&#20132;&#30340;&#38382;&#39064;&#12290;&#21482;&#26159;&#26377;&#19968;&#20004;&#27425;&#30001;&#20110;&#23545;&#20010;&#20154;&#25552;&#20132;&#26435;&#38480;&#33539;&#22260;&#30340;&#35823;&#35299;&#36896;&#25104;&#30340;&#38169;&#35823;&#65292;&#32780;&#19988;&#37117;&#33021;&#22815;&#36805;&#36895;&#21644;&#20146;&#20999;&#30340;&#24471;&#21040;&#35299;&#20915;&#12290;</p><p>&#24456;&#26126;&#26174;&#65292;&#24403;&#33258;&#24459;&#30340;&#26041;&#24335;&#19981;&#22815;&#23454;&#38469;&#26102;&#65292;&#37027;&#20320;&#23601;&#38656;&#35201;&#20005;&#26684;&#30340;&#25480;&#26435;&#25511;&#21046;&#12290;&#20294;&#36825;&#31181;&#24773;&#24418;&#38750;&#24120;&#23569;&#35265;&#12290;&#21363;&#20351;&#24403;&#26377;&#20960;&#30334;&#19975;&#34892;&#30340;&#20195;&#30721;&#65292;&#20197;&#21450;&#25968;&#30334;&#25110;&#19978;&#21315;&#30340;&#24320;&#21457;&#32773;&#26102;&#65292;&#23545;&#20110;&#20219;&#20309;&#32473;&#23450;&#27169;&#22359;&#30340;&#25552;&#20132;&#65292;&#20063;&#24517;&#39035;&#32463;&#36807;&#27169;&#22359;&#19978;&#24037;&#20316;&#30340;&#20154;&#20204;&#30340;&#35780;&#23457;&#65292;&#32780;&#19988;&#20182;&#20204;&#21487;&#20197;&#35782;&#21035;&#20986;&#25552;&#20132;&#32773;&#26159;&#21542;&#24471;&#24403;&#12290;&#22914;&#26524;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#26377;&#35268;&#24459;&#30340;&#25552;&#20132;&#35780;&#23457;&#65292;&#37027;&#20040;&#39033;&#30446;&#24656;&#24597;&#23601;&#20250;&#36935;&#21040;&#27604;&#27809;&#26377;&#25480;&#26435;&#31995;&#32479;&#26356;&#22823;&#30340;&#38382;&#39064;&#20102;&#12290;</p><p>&#24402;&#32435;&#36215;&#26469;&#65292;&#19981;&#35201;&#22312;&#29256;&#26412;&#25511;&#21046;&#30340;&#25480;&#26435;&#31995;&#32479;&#19978;&#33457;&#36153;&#22826;&#22810;&#26102;&#38388;&#65292;&#38500;&#38750;&#20320;&#26377;&#29305;&#21035;&#30340;&#21407;&#22240;&#12290;&#22797;&#26434;&#30340;&#25480;&#26435;&#31995;&#32479;&#19981;&#33021;&#24102;&#26469;&#23454;&#38469;&#30340;&#22909;&#22788;&#65292;&#20381;&#36182;&#20154;&#20026;&#25511;&#21046;&#26377;&#26356;&#22810;&#30340;&#20248;&#28857;&#12290;</p><p>&#24403;&#28982;&#65292;&#19978;&#38754;&#25152;&#35828;&#30340;&#24182;&#19981;&#24847;&#21619;&#30528;&#38480;&#21046;&#26412;&#36523;&#19981;&#37325;&#35201;&#12290;&#39033;&#30446;&#19981;&#24212;&#35813;&#40723;&#21169;&#20154;&#20204;&#22312;&#19981;&#22815;&#26684;&#30340;&#22320;&#26041;&#25552;&#20132;&#12290;&#27492;&#22806;&#65292;&#22312;&#24456;&#22810;&#39033;&#30446;&#20013;&#65292;&#23436;&#20840;&#65288;&#26080;&#38480;&#21046;&#65289;&#30340;&#25552;&#20132;&#35775;&#38382;&#26377;&#19968;&#20010;&#29305;&#21035;&#30340;&#29366;&#24577;&#65306;&#23427;&#38544;&#21547;&#20102;&#39033;&#30446;&#33539;&#22260;&#38382;&#39064;&#30340;&#25237;&#31080;&#26435;&#12290;&#25552;&#20132;&#35775;&#38382;&#30340;&#25919;&#27835;&#26041;&#38754;&#23558;&#20250;&#22312;<span><a class="xref" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;">Chapter 4, <i>&#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</i></a>&#30340;</span><a class="xref" href="consensus-democracy.html#electorate" title="&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;">the section called &#8220;&#35841;&#36827;&#34892;&#34920;&#20915;&#65311;&#8221;</a>&#35814;&#32454;&#35752;&#35770;&#12290;</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1059" href="#idp1059" class="para">15</a>] </sup>&#20851;&#20110;&#36825;&#31181;&#22686;&#38271;&#30340;&#35777;&#25454;&#21487;&#20197;&#30475;<a class="ulink" href="http://cia.vc/stats/vcs" target="_top">http://cia.vc/stats/vcs</a>&#21644;<a class="ulink" href="http://subversion.tigris.org/svn-dav-securityspace-survey.html" target="_top">http://subversion.tigris.org/svn-dav-securityspace-survey.html</a>&#12290;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp1079" href="#idp1079" class="para">16</a>] </sup>&#23545;&#20110;&#29256;&#26412;&#21270;<code class="filename">configure</code>&#30340;&#19981;&#21516;&#24847;&#35265;&#65292;&#21487;&#20197;&#30475;Alexey Makhotkin&#30340;&#25991;&#31456;&#65292;&#22312;<a class="ulink" href="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/" target="_top">http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/</a>&#30340;&#8220;<em class="citetitle">configure.in and version
control</em>&#8221;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="mailing-lists.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="bug-tracker.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#37038;&#20214;&#21015;&#34920; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Bug&#36319;&#36394;</td></tr></table></div></body></html>
