<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#32593;&#31449;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="prev" href="wikis.html" title="Wikis"><link rel="next" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#32593;&#31449;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="wikis.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th><td width="20%" align="right"> <a accesskey="n" href="social-infrastructure.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#32593;&#31449;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="web-site"></a>&#32593;&#31449;</h2></div></div></div><p>&#20174;&#25216;&#26415;&#35282;&#24230;&#19978;&#30475;&#65292;&#23545;&#20110;&#35774;&#32622;&#39033;&#30446;&#32593;&#31449;&#27809;&#26377;&#21487;&#20197;&#22810;&#35828;&#30340;&#65306;&#35774;&#32622;&#32593;&#31449;&#26381;&#21153;&#22120;&#24182;&#32534;&#20889;&#32593;&#39029;&#37117;&#26159;&#30456;&#24403;&#31616;&#21333;&#30340;&#20219;&#21153;&#65292;&#22823;&#22810;&#25968;&#38656;&#35201;&#35828;&#30340;&#37325;&#35201;&#20107;&#24773;&#22914;&#24067;&#23616;&#21644;&#23433;&#25490;&#24050;&#32463;&#22312;&#21069;&#38754;&#30340;&#31456;&#33410;&#25552;&#36807;&#12290;&#32593;&#31449;&#30340;&#20027;&#35201;&#21151;&#33021;&#26159;&#20026;&#39033;&#30446;&#25552;&#20379;&#19968;&#20010;&#28165;&#26032;&#21644;&#21451;&#22909;&#30340;&#27010;&#20917;&#65292;&#24182;&#32452;&#21512;&#20854;&#20182;&#24037;&#20855;&#65288;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12289;bug&#36319;&#36394;&#31995;&#32479;&#31561;&#31561;&#65289;&#12290;&#22914;&#26524;&#20320;&#27809;&#26377;&#35774;&#32622;&#32593;&#31449;&#30340;&#25216;&#33021;&#65292;&#36890;&#24120;&#19981;&#38590;&#33021;&#25214;&#21040;&#26377;&#33021;&#21147;&#30340;&#20154;&#20048;&#24847;&#24110;&#21161;&#20320;&#12290;&#34429;&#28982;&#22914;&#27492;&#65292;&#20026;&#20102;&#33410;&#30465;&#26102;&#38388;&#21644;&#24037;&#20316;&#37327;&#65292;&#20154;&#20204;&#36890;&#24120;&#20250;&#36873;&#25321;&#19968;&#20010;&#21253;&#35013;&#20027;&#26426;&#31449;&#28857;&#12290;</p><div class="sect2" title="&#21253;&#35013;&#20027;&#26426;"><div class="titlepage"><div><div><h3 class="title"><a name="canned-hosting"></a>&#21253;&#35013;&#20027;&#26426;</h3></div></div></div><p>&#20351;&#29992;&#21253;&#35013;&#31449;&#28857;&#26377;&#20004;&#20010;&#20027;&#35201;&#30340;&#22909;&#22788;&#12290;&#39318;&#20808;&#26159;&#26381;&#21153;&#22120;&#23481;&#37327;&#21644;&#24102;&#23485;&#65306;&#20182;&#20204;&#30340;&#26381;&#21153;&#22120;&#36890;&#24120;&#20301;&#20110;&#38750;&#24120;&#23485;&#30340;&#31649;&#36947;&#19978;&#12290;&#26080;&#35770;&#20320;&#30340;&#39033;&#30446;&#22810;&#20040;&#25104;&#21151;&#65292;&#20320;&#37117;&#19981;&#20250;&#29992;&#23436;&#20320;&#30340;&#30913;&#30424;&#24182;&#28040;&#32791;&#23436;&#32593;&#32476;&#24102;&#23485;&#12290;&#31532;&#20108;&#20010;&#22909;&#22788;&#26159;&#31616;&#21333;&#12290;&#20182;&#20204;&#24050;&#32463;&#36873;&#25321;&#20102;bug&#36319;&#36394;&#12289;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12289;&#37038;&#20214;&#21015;&#34920;&#31649;&#29702;&#22120;&#12289;&#24402;&#26723;&#31243;&#24207;&#20197;&#21450;&#20854;&#20182;&#36816;&#34892;&#19968;&#20010;&#31449;&#28857;&#25152;&#38656;&#30340;&#25152;&#26377;&#19996;&#35199;&#12290;&#20182;&#20204;&#24050;&#32463;&#37197;&#32622;&#22909;&#20102;&#24037;&#20855;&#65292;&#24182;&#19988;&#20250;&#23567;&#24515;&#30340;&#22791;&#20221;&#20854;&#20445;&#31649;&#30340;&#25152;&#26377;&#25968;&#25454;&#12290;&#20320;&#19981;&#38656;&#35201;&#20316;&#20986;&#20219;&#20309;&#36873;&#25321;&#12290;&#20320;&#25152;&#38656;&#35201;&#30340;&#21482;&#26159;&#22635;&#20889;&#34920;&#21333;&#65292;&#28857;&#20987;&#25353;&#38062;&#65292;&#20320;&#23601;&#31435;&#21051;&#24471;&#21040;&#20102;&#19968;&#20010;&#39033;&#30446;&#32593;&#31449;&#12290;</p><p>&#36825;&#20123;&#26159;&#24456;&#26126;&#26174;&#30340;&#30410;&#22788;&#12290;&#22351;&#22788;&#24403;&#28982;&#20063;&#26377;&#65292;&#20320;&#24517;&#39035;&#25509;&#21463;<span class="emphasis"><em>&#20182;&#20204;&#30340;</em></span>&#36873;&#25321;&#21644;&#37197;&#32622;&#65292;&#21363;&#20351;&#26377;&#26102;&#20505;&#19981;&#21516;&#30340;&#26041;&#24335;&#26356;&#36866;&#21512;&#20320;&#30340;&#39033;&#30446;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#21253;&#35013;&#20027;&#31449;&#21487;&#20197;&#36890;&#36807;&#29305;&#23450;&#36739;&#23569;&#30340;&#21442;&#25968;&#36827;&#34892;&#35843;&#25972;&#65292;&#20294;&#26159;&#20320;&#27704;&#36828;&#26080;&#27861;&#24471;&#21040;&#32454;&#33268;&#30340;&#25511;&#21046;&#65292;&#23601;&#20687;&#20320;&#33258;&#24049;&#25645;&#24314;&#31449;&#28857;&#24182;&#23545;&#26381;&#21153;&#22120;&#26377;&#23436;&#20840;&#31649;&#29702;&#26435;&#38480;&#26102;&#30340;&#37027;&#26679;&#12290;</p><p>&#36825;&#37324;&#30340;&#19968;&#20010;&#23436;&#32654;&#20363;&#23376;&#26159;&#23545;&#29983;&#25104;&#25991;&#20214;&#30340;&#22788;&#29702;&#12290;&#29305;&#23450;&#39033;&#30446;&#32593;&#39029;&#21487;&#20197;&#26159;&#29983;&#25104;&#30340;&#25991;&#20214;&#8212;&#20363;&#22914;&#65292;&#26377;&#31995;&#32479;&#21487;&#20197;&#20445;&#25345;FAQ&#25968;&#25454;&#20026;&#26131;&#20110;&#32534;&#36753;&#30340;&#21407;&#26684;&#24335;&#65292;&#32780;&#19981;&#26159;HTML&#12289;PDF&#12289;&#21644;&#20854;&#20182;&#21487;&#20197;&#29983;&#25104;&#30340;&#23637;&#31034;&#26684;&#24335;&#12290;<span>&#26412;&#31456;&#21518;&#30340;</span><a class="xref" href="vc.html#version-everything" title="&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;">the section called &#8220;&#29256;&#26412;&#21270;&#25152;&#26377;&#30340;&#19996;&#35199;&#8221;</a>&#20250;&#26377;&#35299;&#37322;&#65292;&#20320;&#19981;&#20250;&#24076;&#26395;&#29256;&#26412;&#21270;&#36825;&#20123;&#29983;&#25104;&#26684;&#24335;&#65292;&#32780;&#21482;&#35201;&#20445;&#23384;&#21407;&#25991;&#20214;&#12290;&#20294;&#26159;&#24403;&#20320;&#30340;&#32593;&#31449;&#23384;&#25918;&#22312;&#20854;&#20182;&#20154;&#30340;&#26381;&#21153;&#22120;&#19978;&#65292;&#23601;&#19981;&#33021;&#35774;&#32622;&#19968;&#20010;&#33258;&#23450;&#20041;&#30340;&#38057;&#23376;&#65292;&#24403;&#21407;&#26684;&#24335;&#25991;&#20214;&#21464;&#26356;&#26102;&#65292;&#26469;&#29983;&#25104;&#22312;&#32447;&#30340;HTML&#29256;&#26412;&#30340;FAQ&#12290;&#21807;&#19968;&#30340;&#35299;&#20915;&#21150;&#27861;&#26159;&#20063;&#29256;&#26412;&#21270;&#29983;&#25104;&#30340;&#26684;&#24335;&#65292;&#36825;&#26679;&#65292;&#23427;&#20204;&#25165;&#21487;&#20197;&#22312;&#32593;&#31449;&#19978;&#23637;&#31034;&#12290;</p><p>&#20063;&#21487;&#33021;&#26377;&#26356;&#22823;&#30340;&#21518;&#26524;&#12290;&#20320;&#21487;&#33021;&#26080;&#27861;&#25511;&#21046;&#20320;&#25152;&#23637;&#31034;&#30340;&#20869;&#23481;&#12290;&#19968;&#20123;&#21253;&#35013;&#20027;&#31449;&#20801;&#35768;&#20320;&#33258;&#23450;&#20041;&#32593;&#39029;&#65292;&#20294;&#26159;&#31449;&#28857;&#30340;&#32570;&#30465;&#24067;&#23616;&#36890;&#24120;&#26159;&#36890;&#36807;&#35768;&#22810;&#36457;&#33050;&#30340;&#26041;&#27861;&#23436;&#25104;&#12290;&#20363;&#22914;&#65292;&#19968;&#20123;SourceForge&#19978;&#30340;&#39033;&#30446;&#25317;&#26377;&#23436;&#20840;&#30340;&#33258;&#23450;&#20041;&#20027;&#39029;&#65292;&#20294;&#20173;&#28982;&#23558;&#24320;&#21457;&#32773;&#25351;&#21521;&#20182;&#20204;&#30340;&#8220;SourceForge&#39029;&#38754;&#8221;&#26469;&#33719;&#24471;&#36827;&#19968;&#27493;&#20449;&#24687;&#12290;SourceForge&#39029;&#38754;&#26159;&#39033;&#30446;&#30340;&#20027;&#39029;&#65292;&#20351;&#24471;&#39033;&#30446;&#19981;&#33021;&#20351;&#29992;&#33258;&#23450;&#20041;&#20027;&#39029;&#12290;SourceForge&#39029;&#38754;&#21253;&#21547;&#21040;bug&#36319;&#36394;&#12289;CVS&#29256;&#26412;&#24211;&#12289;&#19979;&#36733;&#31561;&#38142;&#25509;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;SourceForge&#39029;&#38754;&#20063;&#21253;&#21547;&#20102;&#22826;&#22810;&#22806;&#26469;&#30340;&#22122;&#38899;&#12290;&#39030;&#19978;&#26377;&#19968;&#20010;&#24191;&#21578;&#26465;&#65292;&#36890;&#24120;&#26159;&#19968;&#20010;&#22270;&#20687;&#21160;&#30011;&#12290;&#24038;&#38754;&#22402;&#30452;&#24067;&#23616;&#30340;&#26159;&#39033;&#30446;&#20013;&#30340;&#26576;&#20154;&#24863;&#20852;&#36259;&#30340;&#19968;&#20123;&#30456;&#20851;&#38142;&#25509;&#12290;&#21491;&#20391;&#21487;&#33021;&#26159;&#21478;&#19968;&#20010;&#24191;&#21578;&#12290;&#21482;&#26377;&#20013;&#22830;&#25165;&#26159;&#39033;&#30446;&#29305;&#23450;&#30340;&#26448;&#26009;&#65292;&#29978;&#33267;&#35753;&#35775;&#38382;&#32773;&#26080;&#27861;&#30830;&#23450;&#19979;&#19968;&#27493;&#24212;&#35813;&#28857;&#20987;&#20160;&#20040;&#12290;</p><p>SourceForge&#35774;&#35745;&#30340;&#27599;&#20010;&#26041;&#38754;&#21518;&#38754;&#65292;&#26080;&#30097;&#26377;&#19968;&#20010;&#22909;&#30340;&#21407;&#22240;&#8212;&#20174;SourceForge&#30340;&#35270;&#28857;&#26159;&#22909;&#30340;&#65292;&#20363;&#22914;&#24191;&#21578;&#12290;&#20294;&#26159;&#20174;&#27599;&#20010;&#39033;&#30446;&#30340;&#35270;&#28857;&#65292;&#32467;&#26524;&#21487;&#33021;&#19981;&#26159;&#19968;&#20010;&#29702;&#24819;&#30340;&#32593;&#39029;&#12290;&#25105;&#19981;&#26159;&#35201;&#25307;&#24825;SourceForge&#65307;&#31867;&#20284;&#30340;&#20851;&#27880;&#20250;&#22312;&#35768;&#22810;&#21253;&#35013;&#20027;&#31449;&#20986;&#29616;&#12290;&#20851;&#38190;&#26159;&#20195;&#20215;&#12290;&#20320;&#30465;&#21435;&#20102;&#36816;&#34892;&#39033;&#30446;&#31449;&#28857;&#30340;&#36127;&#25285;&#65292;&#20294;&#26159;&#35201;&#25509;&#21463;&#20854;&#20182;&#20154;&#36816;&#34892;&#23427;&#30340;&#26041;&#24335;&#12290;</p><p>&#20320;&#21807;&#19968;&#21487;&#20197;&#20915;&#23450;&#30340;&#26159;&#21738;&#20010;&#21253;&#35013;&#20027;&#31449;&#36866;&#21512;&#20320;&#30340;&#39033;&#30446;&#12290;&#22914;&#26524;&#20320;&#36873;&#25321;&#20102;&#19968;&#20010;&#21253;&#35013;&#31449;&#28857;&#65292;&#21487;&#20197;&#20445;&#30041;&#23558;&#31449;&#28857;&#36716;&#31227;&#21040;&#20320;&#33258;&#24049;&#26381;&#21153;&#22120;&#30340;&#36873;&#39033;&#65292;&#36890;&#36807;&#20351;&#29992;&#33258;&#23450;&#20041;&#22495;&#21517;&#20316;&#20026;&#39033;&#30446;&#30340;&#8220;&#20027;&#22320;&#22336;&#8221;&#12290;&#20320;&#21487;&#20197;&#23558;URL&#36716;&#21521;&#21040;&#21253;&#35013;&#20027;&#31449;&#65292;&#25110;&#32773;&#20320;&#22312;&#20844;&#20849;URL&#19978;&#26377;&#23436;&#20840;&#33258;&#23450;&#20041;&#30340;&#20027;&#39029;&#65292;&#21482;&#22312;&#22797;&#26434;&#21151;&#33021;&#26102;&#25165;&#23558;&#29992;&#25143;&#36716;&#31227;&#21040;&#21253;&#35013;&#20027;&#31449;&#12290;&#21482;&#35201;&#30830;&#20445;&#36825;&#26679;&#23433;&#25490;&#65292;&#22914;&#26524;&#20043;&#21518;&#20320;&#24076;&#26395;&#20351;&#29992;&#19981;&#21516;&#30340;&#20027;&#26426;&#26041;&#26696;&#65292;&#39033;&#30446;&#22320;&#22336;&#19981;&#38656;&#35201;&#25913;&#21464;&#12290;</p><div class="sect3" title="&#36873;&#25321;&#19968;&#20010;&#21253;&#35013;&#31449;&#28857;"><div class="titlepage"><div><div><h4 class="title"><a name="canned-hosting-choosing"></a>&#36873;&#25321;&#19968;&#20010;&#21253;&#35013;&#31449;&#28857;</h4></div></div></div><p>&#26368;&#22823;&#26368;&#33879;&#21517;&#30340;&#20027;&#26426;&#31449;&#28857;&#26159;<a class="ulink" href="http://www.sourceforge.net/" target="_top">SourceForge</a>&#12290;<a class="ulink" href="http://savannah.gnu.org/" target="_top">savannah.gnu.org</a>&#21644;<a class="ulink" href="http://www.berlios.de/" target="_top">BerliOS.de</a>&#36825;&#20004;&#20010;&#31449;&#28857;&#25552;&#20379;&#20102;&#30456;&#21516;&#25110;&#31867;&#20284;&#30340;&#26381;&#21153;&#12290;&#19968;&#20123;&#32452;&#32455;&#65292;&#20363;&#22914;<a class="ulink" href="http://www.apache.org/" target="_top">Apache Software&#22522;&#37329;&#20250;</a>&#21644;<a class="ulink" href="http://www.tigris.org/" target="_top">Tigris.org</a>&#12290;<sup>[<a name="idp1415" href="#ftn.idp1415" class="footnote">21</a>]</sup>&#20063;&#20250;&#20026;&#24320;&#28304;&#39033;&#30446;&#25552;&#20379;&#20813;&#36153;&#20027;&#26426;&#65292;&#20294;&#35201;&#31526;&#21512;&#20182;&#20204;&#30340;&#30446;&#26631;&#21644;&#20182;&#20204;&#31038;&#21306;&#24050;&#26377;&#30340;&#39033;&#30446;&#12290;</p><p>Haggen So&#23545;&#20110;&#21508;&#24335;&#21253;&#35013;&#31449;&#28857;&#26377;&#19968;&#20010;&#23436;&#20840;&#30340;&#35780;&#20272;&#65292;&#20316;&#20026;&#20182;&#30340;&#21338;&#22763;&#35770;&#25991;&#30740;&#31350;&#30340;&#19968;&#37096;&#20998;&#65292;<em class="citetitle">Construction of an Evaluation Model for Free/Open Source
Project Hosting (FOSPHost) sites</em>&#12290;&#32467;&#26524;&#22312;<a class="ulink" href="http://www.ibiblio.org/fosphost/" target="_top">http://www.ibiblio.org/fosphost/</a>&#65292;&#36824;&#21487;&#20197;&#30475;&#38750;&#24120;&#26131;&#35835;&#30340;&#27604;&#36739;&#22270;<a class="ulink" href="http://www.ibiblio.org/fosphost/exhost.htm" target="_top">http://www.ibiblio.org/fosphost/exhost.htm</a>&#12290;</p></div><div class="sect3" title="&#21311;&#21517;&#21644;&#21442;&#19982;"><div class="titlepage"><div><div><h4 class="title"><a name="anonymity"></a>&#21311;&#21517;&#21644;&#21442;&#19982;</h4></div></div></div><p>&#19968;&#20010;&#19981;&#20165;&#26159;&#21253;&#35013;&#20027;&#25112;&#65292;&#32780;&#19988;&#35768;&#22810;&#20854;&#20182;&#22320;&#26041;&#20063;&#33021;&#30475;&#21040;&#30340;&#38382;&#39064;&#26159;&#23545;&#20110;&#29992;&#25143;&#30331;&#24405;&#21151;&#33021;&#30340;&#28389;&#29992;&#12290;&#36825;&#20010;&#21151;&#33021;&#26412;&#36523;&#24456;&#31616;&#21333;&#65306;&#31449;&#28857;&#20801;&#35768;&#27599;&#20010;&#35775;&#38382;&#32773;&#33258;&#24049;&#36890;&#36807;&#29992;&#25143;&#21517;&#21644;&#23494;&#30721;&#27880;&#20876;&#12290;&#27492;&#21518;&#20182;&#23601;&#20445;&#23384;&#20102;&#19968;&#20221;&#29992;&#25143;&#20449;&#24687;&#65292;&#39033;&#30446;&#31649;&#29702;&#21592;&#21487;&#20197;&#20026;&#29992;&#25143;&#36171;&#20104;&#29305;&#23450;&#30340;&#26435;&#38480;&#65292;&#20363;&#22914;&#65292;&#25552;&#20132;&#29256;&#26412;&#24211;&#30340;&#26435;&#21033;&#12290;</p><p>&#36825;&#38750;&#24120;&#26377;&#29992;&#65292;&#23454;&#38469;&#19978;&#36825;&#20063;&#26159;&#21253;&#35013;&#20027;&#31449;&#30340;&#19968;&#20010;&#22909;&#22788;&#12290;&#38382;&#39064;&#26159;&#26377;&#26102;&#20505;&#26377;&#19968;&#20123;&#38468;&#21152;&#32473;&#27880;&#20876;&#29992;&#25143;&#30340;&#20219;&#21153;&#26412;&#24212;&#35813;&#30001;&#26410;&#27880;&#20876;&#35775;&#38382;&#32773;&#25191;&#34892;&#65292;&#29305;&#21035;&#26159;&#22914;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#21457;&#36215;&#38382;&#39064;&#21644;&#23545;&#24050;&#26377;&#38382;&#39064;&#36827;&#34892;&#22238;&#22797;&#12290;&#22914;&#26524;&#23545;&#27492;&#31867;&#27963;&#21160;&#35201;&#27714;&#36755;&#20837;&#30331;&#38470;&#29992;&#25143;&#21517;&#65292;&#39033;&#30446;&#23601;&#20026;&#36825;&#31867;&#24555;&#36895;&#26041;&#20415;&#30340;&#20219;&#21153;&#35774;&#32622;&#20102;&#38556;&#30861;&#12290;&#24403;&#28982;&#65292;&#20154;&#20204;&#24076;&#26395;&#21487;&#20197;&#32852;&#31995;&#21040;&#36755;&#20837;&#25968;&#25454;&#30340;&#20154;&#65292;&#20294;&#21482;&#35201;&#20445;&#30041;&#19968;&#20010;&#36755;&#20837;&#37038;&#20214;&#22320;&#22336;&#65288;&#22914;&#26524;&#22905;&#24895;&#24847;&#65289;&#30340;&#23383;&#27573;&#23601;&#22815;&#20102;&#12290;&#22914;&#26524;&#19968;&#20010;&#26032;&#30340;&#29992;&#25143;&#21457;&#29616;&#19968;&#20010;bug&#65292;&#24182;&#24076;&#26395;&#25253;&#21578;&#23427;&#65292;&#22905;&#20250;&#34987;&#22312;&#36755;&#20837;bug&#20043;&#21069;&#34987;&#35201;&#27714;&#22635;&#20889;&#24080;&#25143;&#20449;&#24687;&#24825;&#24700;&#12290;&#22905;&#21487;&#33021;&#20250;&#25918;&#24323;&#21457;&#36215;&#36825;&#20010;bug&#12290;</p><p>&#29992;&#25143;&#31649;&#29702;&#30340;&#22909;&#22788;&#34987;&#36807;&#39640;&#20272;&#35745;&#20102;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;&#21487;&#20197;&#36873;&#25321;&#21738;&#20123;&#21160;&#20316;&#21487;&#20197;&#21311;&#21517;&#23436;&#25104;&#65292;&#35831;&#30830;&#20445;&#19981;&#20165;&#21482;&#26377;<span class="emphasis"><em>&#25152;&#26377;&#30340;</em></span>&#21482;&#35835;&#21160;&#20316;&#23545;&#20110;&#26410;&#30331;&#38470;&#29992;&#25143;&#26159;&#20801;&#35768;&#30340;&#65292;&#20063;&#21253;&#25324;&#19968;&#20123;&#25968;&#25454;&#26465;&#30446;&#21160;&#20316;&#65292;&#29305;&#21035;&#26159;&#22312;bug&#36319;&#36394;&#31995;&#32479;&#65292;&#21487;&#33021;&#30340;&#35805;&#36824;&#26377;&#20320;&#30340;wiki&#39029;&#12290;</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp1415" href="#idp1415" class="para">21</a>] </sup>&#20813;&#36131;&#29983;&#21629;&#65306;&#25105;&#30001;<a class="ulink" href="http://www.collab.net/" target="_top">CollabNet</a>&#38599;&#20323;&#65292;&#23427;&#26159;Tigris.org&#30340;&#36190;&#21161;&#21830;&#65292;&#25105;&#32463;&#24120;&#20250;&#29992;Tigris&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="wikis.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="social-infrastructure.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Wikis </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</td></tr></table></div></body></html>
