<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Wikis</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;"><link rel="prev" href="rss.html" title="RSS&#20379;&#31295;"><link rel="next" href="web-site.html" title="&#32593;&#31449;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Wikis</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="rss.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#25216;&#26415;&#22522;&#30784;&#35774;&#26045;</th><td width="20%" align="right"> <a accesskey="n" href="web-site.html">Next</a></td></tr></table><hr></div><div class="sect1" title="Wikis"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="wikis"></a>Wikis</h2></div></div></div><p>&#19968;&#20010;<em class="firstterm">wiki</em>&#23601;&#26159;&#20801;&#35768;&#20219;&#20309;&#35775;&#38382;&#32773;&#37117;&#21487;&#20197;&#32534;&#36753;&#25110;&#25193;&#23637;&#20854;&#20869;&#23481;&#30340;&#31449;&#28857;&#65307;&#26415;&#35821;&#8220;wiki&#8221;&#65288;&#26469;&#33258;&#22799;&#23041;&#22839;&#35789;&#27719;&#65292;&#24847;&#24605;&#26159;&#8220;&#24555;&#8221;&#25110;&#8220;&#38750;&#24120;&#36805;&#36895;&#8221;&#65289;&#20063;&#29992;&#26469;&#29305;&#25351;&#25903;&#25345;&#36825;&#31181;&#32534;&#36753;&#21151;&#33021;&#30340;&#36719;&#20214;&#12290;Wikis&#22312;1995&#24180;&#21457;&#26126;&#65292;&#20294;&#23427;&#20204;&#30340;&#27969;&#34892;&#26159;&#20174;2000&#25110;2001&#24180;&#24320;&#22987;&#30340;&#65292;&#19968;&#23450;&#31243;&#24230;&#19978;&#30001;&#32500;&#22522;&#30334;&#31185;&#65288;Wikipedia&#65292;<a class="ulink" href="http://www.wikipedia.org/" target="_top">http://www.wikipedia.org/</a>&#65289;&#30340;&#25104;&#21151;&#25512;&#21160;&#65292;&#32500;&#22522;&#30334;&#31185;&#26159;&#20197;wiki&#20026;&#22522;&#30784;&#30340;&#33258;&#30001;&#20869;&#23481;&#30340;&#30334;&#31185;&#20840;&#20070;&#12290;&#21487;&#20197;&#25226;wiki&#30475;&#20316;&#20171;&#20110;IRC&#21644;&#32593;&#39029;&#20043;&#38388;&#65306;wikis&#19981;&#20250;&#23454;&#26102;&#21457;&#29983;&#65292;&#25152;&#20197;&#20154;&#20204;&#21487;&#20197;&#20180;&#32454;&#32771;&#34385;&#24182;&#28070;&#33394;&#20182;&#20204;&#30340;&#36129;&#29486;&#65292;&#20294;&#26159;&#20182;&#20204;&#20063;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#28155;&#21152;&#65292;&#27604;&#27491;&#35268;&#30340;&#32593;&#39029;&#38656;&#35201;&#36739;&#23569;&#30340;&#30028;&#38754;&#25805;&#20316;&#12290;</p><p>wikis&#36824;&#19981;&#26159;&#24320;&#28304;&#39033;&#30446;&#30340;&#26631;&#20934;&#37197;&#32622;&#65292;&#20294;&#26159;&#21487;&#33021;&#24456;&#24555;&#23601;&#20250;&#12290;&#22240;&#20026;&#23427;&#36824;&#26159;&#30456;&#23545;&#26032;&#30340;&#25216;&#26415;&#65292;&#20154;&#20204;&#36824;&#22312;&#23454;&#39564;&#20351;&#29992;&#23427;&#30340;&#22810;&#31181;&#26041;&#24335;&#65292;&#36825;&#37324;&#25105;&#21482;&#25552;&#20379;&#19968;&#20123;&#21149;&#35819;&#8212;&#22312;&#26412;&#38454;&#27573;&#65292;&#26356;&#23481;&#26131;&#20998;&#26512;wiki&#30340;&#35823;&#29992;&#65292;&#32780;&#19981;&#26159;&#20182;&#20204;&#30340;&#25104;&#21151;&#12290;</p><p>&#22914;&#26524;&#20320;&#20915;&#23450;&#36816;&#34892;wiki&#65292;&#38656;&#35201;&#33457;&#36153;&#24456;&#22810;&#21147;&#37327;&#22312;&#20445;&#25345;&#28165;&#27905;&#30340;&#39029;&#38754;&#21644;&#21487;&#35270;&#21270;&#30340;&#24067;&#23616;&#19978;&#65292;&#36825;&#26679;&#35775;&#38382;&#32773;&#65288;&#20063;&#23601;&#26159;&#28508;&#22312;&#30340;&#32534;&#36753;&#32773;&#65289;&#25165;&#21487;&#20197;&#20973;&#30452;&#35273;&#30693;&#36947;&#22914;&#20309;&#25552;&#20379;&#36129;&#29486;&#12290;&#21516;&#26679;&#37325;&#35201;&#30340;&#26159;&#65292;&#22312;wiki&#19978;&#21457;&#34920;&#36825;&#20123;&#26631;&#20934;&#65292;&#36825;&#26679;&#20154;&#20204;&#21487;&#20197;&#35775;&#38382;&#36825;&#20123;&#25351;&#23548;&#12290;&#32463;&#24120;&#26159;&#65292;wiki&#31649;&#29702;&#21592;&#25104;&#20026;&#24187;&#24819;&#30340;&#29306;&#29298;&#21697;&#65292;&#20182;&#20204;&#30456;&#20449;&#22240;&#20026;&#22823;&#32676;&#35775;&#38382;&#32773;&#21508;&#33258;&#20026;&#31449;&#28857;&#28155;&#21152;&#39640;&#36136;&#37327;&#30340;&#20869;&#23481;&#65292;&#25152;&#20197;&#36825;&#20123;&#36129;&#29486;&#30340;&#32452;&#21512;&#20063;&#26159;&#39640;&#36136;&#37327;&#30340;&#12290;&#20294;&#37027;&#19981;&#26159;&#32593;&#31449;&#24037;&#20316;&#30340;&#26041;&#24335;&#12290;&#27599;&#20010;&#21333;&#29420;&#30340;&#39029;&#38754;&#25110;&#27573;&#33853;&#21487;&#33021;&#21333;&#29420;&#30475;&#26469;&#19981;&#38169;&#65292;&#20294;&#26159;&#22914;&#26524;&#22312;&#19968;&#20010;&#27809;&#26377;&#32452;&#32455;&#30340;&#25110;&#36855;&#24785;&#30340;&#25972;&#20307;&#20013;&#23427;&#23601;&#19981;&#26159;&#20102;&#12290;wikis&#32463;&#24120;&#36935;&#21040;&#30340;&#22256;&#22659;&#26377;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>&#32570;&#20047;&#23548;&#33322;&#21407;&#21017;&#12290;</strong></span>&#19968;&#20010;&#32452;&#32455;&#33391;&#22909;&#30340;&#31449;&#28857;&#21487;&#20197;&#35753;&#35775;&#38382;&#32773;&#27704;&#36828;&#30693;&#36947;&#33258;&#24049;&#22312;&#21738;&#37324;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#39029;&#38754;&#35774;&#35745;&#33391;&#22909;&#65292;&#29992;&#25143;&#20250;&#20973;&#26412;&#33021;&#35828;&#20986;&#8220;&#30446;&#24405;&#8221;&#21644;&#8220;&#20869;&#23481;&#8221;&#21306;&#22495;&#30340;&#21306;&#21035;&#12290;wiki&#30340;&#36129;&#29486;&#32773;&#20063;&#20250;&#23562;&#37325;&#36825;&#31181;&#21306;&#21035;&#65292;&#20294;&#26159;&#36825;&#35201;&#27714;&#20197;&#36825;&#20123;&#21306;&#21035;&#20316;&#20026;&#24320;&#22987;&#12290;</p></li><li class="listitem"><p><span class="bold"><strong>&#20449;&#24687;&#37325;&#22797;&#12290;</strong></span>wikis&#32463;&#24120;&#20250;&#21464;&#24471;&#26377;&#24456;&#22810;&#39029;&#38754;&#35752;&#35770;&#30456;&#20284;&#30340;&#20869;&#23481;&#65292;&#22240;&#20026;&#27599;&#20010;&#21333;&#29420;&#30340;&#36129;&#29486;&#32773;&#19981;&#20250;&#27880;&#24847;&#21040;&#37325;&#22797;&#12290;&#36825;&#21487;&#33021;&#37096;&#20998;&#30001;&#20110;&#32570;&#20047;&#21069;&#38754;&#25552;&#21040;&#30340;&#23548;&#33322;&#21407;&#21017;&#65292;&#20154;&#20204;&#21487;&#33021;&#26080;&#27861;&#22312;&#39044;&#26399;&#30340;&#22320;&#26041;&#25214;&#21040;&#37325;&#22797;&#30340;&#20869;&#23481;&#12290;</p></li><li class="listitem"><p><span class="bold"><strong>&#19981;&#19968;&#33268;&#30340;&#30446;&#26631;&#35835;&#32773;&#12290;</strong></span>&#24403;&#26377;&#35768;&#22810;&#20316;&#32773;&#26102;&#65292;&#26576;&#31181;&#31243;&#24230;&#19978;&#36825;&#20010;&#38382;&#39064;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#26159;&#22914;&#26524;&#23384;&#22312;&#20851;&#20110;&#21019;&#24314;&#26032;&#20869;&#23481;&#30340;&#32534;&#20889;&#25351;&#21335;&#26102;&#21487;&#20197;&#20943;&#23569;&#36825;&#31181;&#24773;&#20917;&#12290;&#22914;&#26524;&#33021;&#22815;&#39318;&#20808;&#23601;&#20570;&#20986;&#36129;&#29486;&#20316;&#20026;&#23454;&#20363;&#20063;&#38750;&#24120;&#22909;&#65292;&#36825;&#23601;&#25104;&#20026;&#26631;&#20934;&#34987;&#29702;&#35299;&#12290;</p></li></ul></div><p>&#23545;&#25152;&#26377;&#36825;&#20123;&#38382;&#39064;&#30340;&#19968;&#33324;&#35299;&#20915;&#21150;&#27861;&#23436;&#20840;&#30456;&#21516;&#65306;&#26377;&#32534;&#36753;&#26631;&#20934;&#65292;&#19981;&#20165;&#20165;&#26159;&#21457;&#34920;&#20986;&#26469;&#65292;&#32780;&#19988;&#35201;&#35753;&#32534;&#36753;&#39029;&#21253;&#21547;&#23427;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;wikis&#20250;&#25918;&#22823;&#21407;&#22987;&#26448;&#26009;&#20013;&#30340;&#25152;&#26377;&#32570;&#38519;&#65292;&#22240;&#20026;&#25776;&#31295;&#32773;&#20250;&#27169;&#20223;&#20219;&#20309;&#30524;&#21069;&#30340;&#27169;&#24335;&#12290;&#19981;&#35201;&#26399;&#26395;&#35774;&#32622;&#20102;wikis&#23601;&#20250;&#21457;&#29616;&#25152;&#26377;&#30340;&#20107;&#24773;&#26469;&#21040;&#24688;&#24403;&#30340;&#20301;&#32622;&#12290;&#20320;&#36824;&#38656;&#35201;&#32534;&#20889;&#22909;&#20363;&#23376;&#65292;&#36825;&#26679;&#20154;&#20204;&#21487;&#20197;&#23558;&#20854;&#20316;&#20026;&#36981;&#20174;&#30340;&#27169;&#26495;&#12290;</p><p>&#19968;&#20010;&#36816;&#34892;&#33391;&#22909;&#30340;&#38378;&#32768;&#23454;&#20363;&#26159;&#32500;&#22522;&#30334;&#31185;&#65292;&#23613;&#31649;&#21487;&#33021;&#26159;&#37096;&#20998;&#22240;&#20026;&#23427;&#30340;&#20869;&#23481;&#65288;&#30334;&#31185;&#26465;&#30446;&#65289;&#26412;&#36523;&#23601;&#36866;&#21512;wiki&#30340;&#26684;&#24335;&#12290;&#20294;&#26159;&#22914;&#26524;&#20320;&#28145;&#20837;&#32500;&#22522;&#30334;&#31185;&#65292;&#20320;&#20250;&#21457;&#29616;&#31649;&#29702;&#21592;&#20026;&#21512;&#20316;&#25552;&#20379;&#20102;<span class="emphasis"><em>&#38750;&#24120;</em></span>&#23436;&#25972;&#30340;&#22522;&#30784;&#12290;&#26377;&#20851;&#20110;&#22914;&#20309;&#32534;&#20889;&#26032;&#26465;&#30446;&#65292;&#22914;&#20309;&#32500;&#25252;&#21512;&#36866;&#30340;&#35270;&#35282;&#65292;&#20570;&#20309;&#31181;&#32534;&#36753;&#65292;&#36991;&#20813;&#24590;&#26679;&#30340;&#32534;&#36753;&#65292;&#20105;&#35758;&#32534;&#36753;&#35299;&#20915;&#36807;&#31243;&#65288;&#28041;&#21450;&#35768;&#22810;&#27493;&#39588;&#65292;&#21253;&#21547;&#26368;&#32456;&#30340;&#35009;&#20915;&#65289;&#31561;&#38382;&#39064;&#30340;&#22823;&#37327;&#25991;&#26723;&#12290;&#20182;&#20204;&#20063;&#26377;&#25480;&#26435;&#25511;&#21046;&#65292;&#22914;&#26524;&#26576;&#20010;&#39029;&#38754;&#21453;&#22797;&#25104;&#20026;&#19981;&#24403;&#32534;&#36753;&#30340;&#30446;&#26631;&#65292;&#20182;&#20204;&#20250;&#38145;&#23450;&#23427;&#65292;&#30452;&#21040;&#38382;&#39064;&#35299;&#20915;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#20182;&#20204;&#19981;&#21482;&#26159;&#22312;&#32593;&#31449;&#19978;&#25243;&#20986;&#20102;&#20960;&#20010;&#27169;&#26495;&#23601;&#24076;&#26395;&#22352;&#20139;&#20854;&#25104;&#12290;&#32500;&#22522;&#30334;&#31185;&#33021;&#22815;&#25104;&#21151;&#26159;&#22240;&#20026;&#23427;&#30340;&#21019;&#24314;&#32773;&#20180;&#32454;&#24605;&#32771;&#36807;&#22914;&#20309;&#35753;&#20960;&#21315;&#38476;&#29983;&#20154;&#35843;&#25972;&#20182;&#20204;&#30340;&#20889;&#20316;&#26469;&#23454;&#29616;&#20849;&#21516;&#30340;&#26790;&#24819;&#12290;&#34429;&#28982;&#23545;&#20110;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#65292;&#20320;&#21487;&#33021;&#19981;&#38656;&#35201;&#21516;&#26679;&#32423;&#21035;&#30340;&#20934;&#22791;&#65292;&#20294;&#26159;&#20854;&#31934;&#31070;&#20540;&#24471;&#27169;&#20223;&#12290;</p><p>&#20851;&#20110;wiki&#30340;&#26356;&#22810;&#20449;&#24687;&#21487;&#20197;&#30475;<a class="ulink" href="http://en.wikipedia.org/wiki/Wiki" target="_top">http://en.wikipedia.org/wiki/Wiki</a>&#12290;&#21478;&#22806;&#65292;&#31532;&#19968;&#20010;wiki&#36824;&#27963;&#24471;&#24456;&#22909;&#65292;&#21253;&#21547;&#20102;&#35768;&#22810;&#36816;&#34892;wiki&#30340;&#35752;&#35770;&#65292;&#22312;<a class="ulink" href="http://www.c2.com/cgi/wiki?WelcomeVisitors" target="_top">http://www.c2.com/cgi/wiki?WelcomeVisitors</a>&#12289;<a class="ulink" href="http://www.c2.com/cgi/wiki?WhyWikiWorks" target="_top">http://www.c2.com/cgi/wiki?WhyWikiWorks</a>&#21644;<a class="ulink" href="http://www.c2.com/cgi/wiki?WhyWikiWorksNot" target="_top">http://www.c2.com/cgi/wiki?WhyWikiWorksNot</a>&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#35270;&#28857;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="rss.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="web-site.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">RSS&#20379;&#31295; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#32593;&#31449;</td></tr></table></div></body></html>
