<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#21046;&#36896;&#24320;&#28304;&#36719;&#20214;"><link rel="up" href="social-infrastructure.html" title="Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;"><link rel="prev" href="consensus-democracy.html" title="&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289;"><link rel="next" href="money.html" title="Chapter 5. &#37329;&#38065;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="consensus-democracy.html">Prev</a> </td><th width="60%" align="center">Chapter 4. &#31038;&#20250;&#21644;&#25919;&#27835;&#30340;&#22522;&#30784;&#26550;&#26500;</th><td width="20%" align="right"> <a accesskey="n" href="money.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="written-rules"></a>&#20889;&#19979;&#25152;&#26377;&#30340;&#20869;&#23481;</h2></div></div></div><p>&#26377;&#26102;&#65292;&#39033;&#30446;&#20013;&#30340;&#35768;&#22810;&#24191;&#20026;&#27969;&#20256;&#30340;&#24815;&#20363;&#21644;&#21327;&#23450;&#21464;&#24471;&#38750;&#24120;&#37325;&#35201;&#65292;&#20320;&#38656;&#35201;&#35760;&#24405;&#19979;&#26469;&#12290;&#20026;&#20102;&#20445;&#35777;&#36825;&#31181;&#25991;&#26723;&#30340;&#27491;&#32479;&#24615;&#65292;&#35201;&#28165;&#26970;&#30340;&#34920;&#26126;&#36825;&#20123;&#20869;&#23481;&#22522;&#20110;&#37038;&#20214;&#21015;&#34920;&#30340;&#35752;&#35770;&#65292;&#24182;&#24050;&#32463;&#24418;&#25104;&#21327;&#23450;&#24320;&#22987;&#29983;&#25928;&#12290;&#38543;&#30528;&#20320;&#30340;&#32534;&#20889;&#65292;&#24212;&#24403;&#24341;&#29992;&#37038;&#20214;&#21015;&#34920;&#24402;&#26723;&#20013;&#30340;&#30456;&#20851;&#35752;&#35770;&#65292;&#23545;&#20110;&#20219;&#20309;&#19981;&#33021;&#30830;&#23450;&#30340;&#35201;&#28857;&#65292;&#35201;&#37325;&#26032;&#35810;&#38382;&#24182;&#30830;&#35748;&#12290;&#25991;&#26723;&#20013;&#19981;&#24212;&#24403;&#21253;&#21547;&#20219;&#20309;&#20986;&#20854;&#19981;&#24847;&#30340;&#19996;&#35199;&#65306;&#23427;&#19981;&#24212;&#24403;&#26159;&#21327;&#35758;&#30340;&#26469;&#28304;&#65292;&#32780;&#21482;&#26159;&#23545;&#20110;&#21327;&#35758;&#30340;&#25551;&#36848;&#12290;&#24403;&#28982;&#65292;&#22914;&#26524;&#23427;&#36275;&#22815;&#25104;&#21151;&#65292;&#20154;&#20204;&#20250;&#24320;&#22987;&#24341;&#29992;&#23427;&#26469;&#20316;&#20026;&#33258;&#24049;&#26435;&#21033;&#30340;&#26469;&#28304;&#65292;&#20294;&#26159;&#36825;&#21482;&#26159;&#35828;&#26126;&#23427;&#31934;&#30830;&#30340;&#21453;&#26144;&#20102;&#22242;&#38431;&#30340;&#25972;&#20307;&#24847;&#24895;&#12290;</p><p>&#36825;&#26159;<span><a class="xref" href="getting-started.html" title="Chapter 2. &#36215;&#27493;">Chapter 2, <i>&#36215;&#27493;</i></a>&#30340;</span><a class="xref" href="getting-started.html#developer-guidelines" title="&#24320;&#21457;&#32773;&#25351;&#21335;">the section called &#8220;&#24320;&#21457;&#32773;&#25351;&#21335;&#8221;</a>&#26263;&#31034;&#30340;&#25991;&#26723;&#12290;&#24403;&#28982;&#65292;&#24403;&#39033;&#30446;&#36824;&#38750;&#24120;&#24180;&#36731;&#26102;&#65292;&#20320;&#26080;&#27861;&#20381;&#38752;&#39033;&#30446;&#30340;&#21382;&#21490;&#26469;&#35268;&#21010;&#25351;&#23548;&#26041;&#38024;&#12290;&#20294;&#26159;&#38543;&#30528;&#24320;&#21457;&#31038;&#21306;&#30340;&#25104;&#29087;&#65292;&#20320;&#21487;&#20197;&#35843;&#25972;&#36825;&#20123;&#35821;&#35328;&#20197;&#21453;&#26144;&#23454;&#38469;&#30340;&#20869;&#23481;&#12290;</p><p>&#19981;&#35201;&#23581;&#35797;&#20840;&#38754;&#12290;&#27809;&#26377;&#25991;&#26723;&#33021;&#22815;&#28085;&#30422;&#21442;&#19982;&#19968;&#20010;&#39033;&#30446;&#25152;&#38656;&#30340;&#25152;&#26377;&#20107;&#24773;&#12290;&#35768;&#22810;&#39033;&#30446;&#28436;&#36827;&#20986;&#30340;&#20064;&#24815;&#26159;&#27704;&#36828;&#19981;&#20250;&#35828;&#20986;&#26469;&#30340;&#65292;&#27704;&#36828;&#19981;&#20250;&#26126;&#30830;&#25552;&#20986;&#26469;&#65292;&#21363;&#20351;&#26159;&#25152;&#26377;&#20154;&#36981;&#24490;&#30340;&#12290;&#36824;&#26377;&#19968;&#20123;&#20869;&#23481;&#21017;&#26126;&#26174;&#22826;&#36807;&#31616;&#21333;&#65292;&#26080;&#38656;&#25552;&#21450;&#65292;&#21482;&#20250;&#20998;&#25955;&#20154;&#20204;&#23545;&#20110;&#37325;&#35201;&#20869;&#23481;&#30340;&#27880;&#24847;&#21147;&#12290;&#20363;&#22914;&#65292;&#27809;&#26377;&#24517;&#35201;&#20889;&#19979;&#25351;&#23548;&#26041;&#38024;&#22914;&#8220;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#35201;&#26377;&#31036;&#35980;&#65292;&#35201;&#20114;&#30456;&#23562;&#37325;&#65292;&#19981;&#35201;&#28608;&#28872;&#30340;&#20105;&#35770;&#8221;&#25110;&#8220;&#35201;&#20889;&#28165;&#26970;&#30340;&#12289;&#21487;&#35835;&#30340;&#21644;&#26080;bug&#30340;&#20195;&#30721;&#12290;&#8221;&#24403;&#28982;&#65292;&#36825;&#20123;&#20107;&#24773;&#37117;&#26159;&#20154;&#20204;&#24076;&#26395;&#30340;&#65292;&#20294;&#26159;&#22240;&#20026;&#27809;&#26377;&#24819;&#20687;&#21040;&#20182;&#20204;&#21487;&#33021;<span class="emphasis"><em>&#19981;&#20250;</em></span>&#28212;&#26395;&#24471;&#21040;&#30340;&#19996;&#35199;&#65292;&#25152;&#20197;&#27809;&#26377;&#20215;&#20540;&#21435;&#25552;&#21450;&#12290;&#22914;&#26524;&#20154;&#20204;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#36807;&#20110;&#31895;&#26292;&#65292;&#25110;&#32534;&#20889;&#20102;&#20805;&#28385;bug&#30340;&#20195;&#30721;&#65292;&#19981;&#20250;&#22240;&#20026;&#39033;&#30446;&#25351;&#23548;&#26041;&#38024;&#27809;&#26377;&#35828;&#65292;&#20182;&#20204;&#23601;&#20250;&#32487;&#32493;&#19979;&#21435;&#12290;&#36825;&#31181;&#24773;&#24418;&#20986;&#29616;&#26102;&#23601;&#20250;&#38656;&#35201;&#34987;&#22788;&#29702;&#65292;&#19981;&#20250;&#22240;&#20026;&#39044;&#20808;&#30340;&#21149;&#35819;&#23601;&#20250;&#22909;&#36215;&#26469;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#39033;&#30446;&#26377;&#20851;&#20110;<span class="emphasis"><em>&#22914;&#20309;</em></span>&#20889;&#22909;&#20195;&#30721;&#30340;&#25351;&#23548;&#26041;&#38024;&#65292;&#20363;&#22914;&#20851;&#20110;&#20351;&#29992;&#20309;&#31181;&#26684;&#24335;&#35760;&#24405;API&#30340;&#35268;&#21017;&#65292;&#37027;&#20040;&#36825;&#20010;&#25351;&#23548;&#26041;&#38024;&#23601;&#24212;&#35813;&#23613;&#21487;&#33021;&#30340;&#20889;&#23436;&#25972;&#12290;</p><p>&#20915;&#23450;&#23558;&#20160;&#20040;&#20869;&#23481;&#32435;&#20837;&#25991;&#26723;&#30340;&#26368;&#22909;&#26041;&#27861;&#26159;&#20197;&#26032;&#26469;&#32773;&#25152;&#32463;&#24120;&#35810;&#38382;&#30340;&#38382;&#39064;&#65292;&#20197;&#21450;&#36164;&#28145;&#24320;&#21457;&#32773;&#26368;&#32463;&#24120;&#30340;&#25265;&#24616;&#20026;&#22522;&#30784;&#12290;&#36825;&#19981;&#26159;&#35828;&#19968;&#23450;&#35201;&#21464;&#25104;&#19968;&#20010;FAQ&#34920;&#21333;&#8212;&#24456;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010;&#27604;FAQ&#25152;&#33021;&#25552;&#20379;&#30340;&#26356;&#36830;&#36143;&#30340;&#21465;&#36848;&#32467;&#26500;&#12290;&#20294;&#26159;&#23427;&#24517;&#39035;&#36981;&#24490;&#20107;&#23454;&#20026;&#26681;&#25454;&#30340;&#21407;&#29702;&#65292;&#35760;&#24405;&#38382;&#39064;&#23454;&#38469;&#21457;&#29983;&#30340;&#22320;&#22336;&#65292;&#32780;&#19981;&#26159;&#22909;&#20687;&#20320;&#39044;&#26399;&#20250;&#20986;&#29616;&#12290;</p><p>&#22914;&#26524;&#39033;&#30446;&#26159;&#19968;&#20010;&#24904;&#21892;&#29420;&#35009;&#32773;&#25152;&#26377;&#65292;&#25110;&#32773;&#26377;&#25317;&#26377;&#29305;&#27530;&#26435;&#21033;&#30340;&#23448;&#21592;&#65288;&#24635;&#35009;&#12289;&#20027;&#24109;&#25110;&#20854;&#20182;&#65289;&#65292;&#37027;&#20040;&#32487;&#20219;&#31243;&#24207;&#20063;&#24212;&#24403;&#21046;&#23450;&#25104;&#27861;&#24459;&#24418;&#25104;&#25991;&#26723;&#12290;&#26377;&#26102;&#20505;&#65292;&#36825;&#20165;&#20165;&#26159;BD&#22240;&#25925;&#31361;&#28982;&#31163;&#24320;&#39033;&#30446;&#24182;&#31616;&#21333;&#30340;&#25351;&#23450;&#32487;&#20219;&#32773;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#26377;&#19968;&#20010;BD&#65292;&#37027;&#20040;&#21482;&#26377;BD&#21487;&#20197;&#31163;&#24320;&#24182;&#25552;&#21517;&#32487;&#20219;&#32773;&#12290;&#22914;&#26524;&#26377;&#31454;&#36873;&#30340;&#25104;&#21592;&#65292;&#37027;&#20040;&#25991;&#26723;&#23601;&#24212;&#35813;&#25551;&#36848;&#20174;&#20013;&#21462;&#20986;&#31532;&#19968;&#21517;&#30340;&#25552;&#21517;&#21644;&#36873;&#20030;&#31243;&#24207;&#12290;&#22914;&#26524;&#21407;&#26469;&#27809;&#26377;&#31243;&#24207;&#65292;&#37027;&#20040;&#22312;&#32534;&#20889;<span class="emphasis"><em>&#21069;</em></span>&#24212;&#35813;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#36798;&#25104;&#20849;&#35782;&#12290;&#20154;&#20204;&#26377;&#26102;&#20505;&#21487;&#33021;&#23545;&#20110;&#31561;&#32423;&#32467;&#26500;&#21313;&#20998;&#25935;&#24863;&#65292;&#25152;&#20197;&#20027;&#39064;&#24212;&#24403;&#25935;&#24863;&#30340;&#36798;&#21040;&#36825;&#20010;&#30446;&#26631;&#12290;</p><p>&#21487;&#33021;&#26368;&#37325;&#35201;&#30340;&#20107;&#24773;&#26159;&#34920;&#26126;&#35268;&#21017;&#26159;&#21487;&#20197;&#21830;&#37327;&#30340;&#12290;&#22914;&#26524;&#25991;&#26723;&#20013;&#35268;&#23450;&#30340;&#20064;&#24815;&#21464;&#24471;&#26463;&#32538;&#20102;&#39033;&#30446;&#65292;&#35201;&#35753;&#27599;&#20010;&#20154;&#24819;&#21040;&#36825;&#26159;&#19968;&#31181;&#23545;&#20110;&#22242;&#38431;&#24847;&#24895;&#30340;&#29983;&#21160;&#21453;&#26144;&#65292;&#32780;&#19981;&#26159;&#25387;&#25240;&#21644;&#22581;&#22622;&#30340;&#26469;&#28304;&#12290;&#22914;&#26524;&#26576;&#20154;&#20859;&#25104;&#20102;&#27599;&#24403;&#36935;&#21040;&#22952;&#30861;&#33258;&#24049;&#30340;&#35268;&#21017;&#37117;&#35201;&#27714;&#37325;&#26032;&#32771;&#34385;&#35268;&#21017;&#30340;&#20064;&#24815;&#26102;&#65292;&#20320;&#19981;&#38656;&#35201;&#19968;&#30452;&#19982;&#20854;&#36777;&#35770;&#8212;&#26377;&#26102;&#20505;&#27785;&#40664;&#26159;&#26368;&#22909;&#30340;&#31574;&#30053;&#12290;&#22914;&#26524;&#20854;&#20182;&#20154;&#35748;&#21487;&#36825;&#31181;&#25265;&#24616;&#65292;&#20182;&#20204;&#20250;&#25554;&#35805;&#65292;&#20063;&#23601;&#26159;&#24847;&#21619;&#30528;&#26576;&#20123;&#20107;&#24773;&#24456;&#26126;&#26174;&#38656;&#35201;&#25913;&#21464;&#20102;&#12290;&#22914;&#26524;&#27809;&#26377;&#20854;&#20182;&#20154;&#35748;&#21487;&#65292;&#20154;&#20204;&#23601;&#19981;&#22826;&#20250;&#21709;&#24212;&#65292;&#37027;&#35268;&#21017;&#36824;&#26159;&#20250;&#20445;&#25345;&#19981;&#21464;&#12290;</p><p>&#20004;&#20010;&#25351;&#23548;&#26041;&#38024;&#30340;&#22909;&#20363;&#23376;&#26159;Subversion&#30340;<code class="filename">hacking.html</code>&#25991;&#20214;&#65292;&#22312;<a class="ulink" href="http://svn.collab.net/repos/svn/trunk/www/hacking.html" target="_top">http://svn.collab.net/repos/svn/trunk/www/hacking.html</a>&#65292;&#20197;&#21450;Apache&#36719;&#20214;&#22522;&#37329;&#20250;&#31649;&#29702;&#30340;&#25991;&#26723;&#65292;&#22312;<a class="ulink" href="http://www.apache.org/foundation/how-it-works.html" target="_top">http://www.apache.org/foundation/how-it-works.html</a>&#21644;<a class="ulink" href="http://www.apache.org/foundation/voting.html" target="_top">http://www.apache.org/foundation/voting.html</a>&#12290;ASF&#26159;&#30495;&#27491;&#30340;&#19968;&#32452;&#36719;&#20214;&#39033;&#30446;&#65292;&#21512;&#27861;&#30340;&#32452;&#32455;&#25104;&#19968;&#20010;&#38750;&#30408;&#21033;&#20844;&#21496;&#65292;&#25152;&#20197;&#23427;&#30340;&#25991;&#26723;&#20542;&#21521;&#20110;&#25551;&#36848;&#31649;&#29702;&#31243;&#24207;&#65292;&#32780;&#19981;&#26159;&#24320;&#21457;&#24815;&#20363;&#12290;&#20182;&#20204;&#20063;&#20540;&#24471;&#38405;&#35835;&#65292;&#22240;&#20026;&#20182;&#20204;&#20195;&#34920;&#20102;&#35768;&#22810;&#24320;&#28304;&#39033;&#30446;&#31215;&#32047;&#30340;&#32463;&#39564;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="consensus-democracy.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="social-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="money.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#20849;&#35782;&#20026;&#22522;&#30784;&#30340;&#27665;&#20027;&#65288;Consensus-based Democracy&#65289; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 5. &#37329;&#38065;</td></tr></table></div></body></html>
