<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="up" href="preface.html" title="&#1502;&#1489;&#1493;&#1488;"><link rel="prev" href="preface.html" title="&#1502;&#1489;&#1493;&#1488;"><link rel="next" href="sources.html" title="&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="preface.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><th width="60%" align="center">&#1502;&#1489;&#1493;&#1488;</th><td width="20%" align="left"> <a accesskey="n" href="sources.html">&#1492;&#1489;&#1488;</a></td></tr></table><hr></div><div class="sect1" title="&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="audience"></a>&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?</h2></div></div></div><p>&#1505;&#1508;&#1512; &#1494;&#1492; &#1502;&#1497;&#1493;&#1506;&#1491; &#1500;&#1502;&#1508;&#1514;&#1495;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1493;&#1502;&#1504;&#1492;&#1500;&#1497;&#1501; &#1488;&#1513;&#1512; &#1513;&#1493;&#1511;&#1500;&#1497;&#1501; &#1500;&#1492;&#1514;&#1495;&#1497;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;
&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1488;&#1493; &#1513;&#1492;&#1514;&#1495;&#1497;&#1500;&#1493; &#1488;&#1495;&#1491; &#1493;&#1514;&#1493;&#1492;&#1497;&#1501; &#1502;&#1492; &#1500;&#1506;&#1513;&#1493;&#1514; &#1499;&#1506;&#1514;. &#1499;&#1502;&#1493;-&#1499;&#1503;, &#1505;&#1508;&#1512; &#1494;&#1492; &#1497;&#1492;&#1497;&#1492;
&#1513;&#1497;&#1502;&#1493;&#1513;&#1497; &#1490;&#1501; &#1506;&#1489;&#1493;&#1512; &#1488;&#1504;&#1513;&#1497;&#1501; &#1488;&#1513;&#1512; &#1508;&#1513;&#1493;&#1496; &#1502;&#1506;&#1493;&#1504;&#1497;&#1497;&#1504;&#1497;&#1501; &#1500;&#1492;&#1513;&#1514;&#1514;&#1507; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;
&#1488;&#1498; &#1502;&#1506;&#1493;&#1500;&#1501; &#1500;&#1488; &#1506;&#1513;&#1493; &#1494;&#1488;&#1514; &#1489;&#1506;&#1489;&#1512;.</p><p>&#1488;&#1497;&#1503; &#1492;&#1511;&#1493;&#1512;&#1488; &#1510;&#1512;&#1497;&#1498; &#1500;&#1492;&#1497;&#1493;&#1514; &#1502;&#1514;&#1499;&#1504;&#1514;, &#1488;&#1498; &#1499;&#1491;&#1488;&#1497; &#1513;&#1497;&#1499;&#1497;&#1512; &#1502;&#1505;&#1508;&#1512; &#1502;&#1493;&#1504;&#1495;&#1497;&#1501; &#1489;&#1505;&#1497;&#1505;&#1497;&#1497;&#1501;
&#1489;&#1492;&#1504;&#1491;&#1505;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1499;&#1490;&#1493;&#1503;, &#1511;&#1493;&#1491; &#1502;&#1511;&#1493;&#1512;, &#1502;&#1492;&#1491;&#1512;&#1497;&#1501;, &#1493;&#1502;&#1492;&#1501; &#1496;&#1500;&#1488;&#1497;&#1501;.</p><p>&#1488;&#1497;&#1503; &#1499;&#1500; &#1510;&#1493;&#1512;&#1498; &#1489;&#1504;&#1505;&#1497;&#1493;&#1503; &#1511;&#1493;&#1491;&#1501; &#1506;&#1501; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1492;&#1503; &#1499;&#1502;&#1513;&#1514;&#1502;&#1513; &#1488;&#1493; &#1499;&#1502;&#1508;&#1514;&#1495;. &#1488;&#1500;&#1492;
&#1488;&#1513;&#1512; &#1506;&#1489;&#1491;&#1493; &#1489;&#1506;&#1489;&#1512; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1497;&#1501; &#1513;&#1500; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1505;&#1489;&#1497;&#1512; &#1499;&#1497; &#1497;&#1502;&#1510;&#1488;&#1493; &#1500;&#1508;&#1495;&#1493;&#1514; &#1495;&#1500;&#1511;&#1497;&#1501;
&#1502;&#1492;&#1505;&#1508;&#1512; &#1489;&#1512;&#1493;&#1512;&#1497;&#1501; &#1502;&#1488;&#1500;&#1497;&#1492;&#1501;, &#1493;&#1488;&#1493;&#1500;&#1497; &#1488;&#1507; &#1497;&#1512;&#1510;&#1493; &#1500;&#1491;&#1500;&#1490; &#1506;&#1500; &#1495;&#1500;&#1511;&#1497;&#1501; &#1488;&#1500;&#1492;. &#1502;&#1488;&#1495;&#1512; &#1493;&#1504;&#1505;&#1497;&#1493;&#1504;&#1493;
&#1513;&#1500; &#1511;&#1492;&#1500; &#1492;&#1497;&#1506;&#1491; &#1492;&#1508;&#1493;&#1496;&#1504;&#1510;&#1497;&#1488;&#1500;&#1497; &#1499;&#1492; &#1502;&#1490;&#1493;&#1493;&#1503; &#1493;&#1512;&#1495;&#1489;, &#1492;&#1511;&#1491;&#1513;&#1514;&#1497; &#1514;&#1513;&#1493;&#1502;&#1514; &#1500;&#1489; &#1512;&#1489;&#1492; &#1500;&#1489;&#1492;&#1497;&#1512;&#1493;&#1514;
&#1492;&#1499;&#1493;&#1514;&#1512;&#1493;&#1514; &#1513;&#1504;&#1514;&#1514;&#1497; &#1500;&#1495;&#1500;&#1511;&#1497;&#1493; &#1492;&#1513;&#1493;&#1504;&#1497;&#1501; &#1513;&#1500; &#1492;&#1505;&#1508;&#1512;, &#1493;&#1499;&#1503; &#1500;&#1510;&#1497;&#1493;&#1503; &#1492;&#1488;&#1501; &#1511;&#1493;&#1512;&#1488;&#1497;&#1501; &#1492;&#1502;&#1499;&#1497;&#1512;&#1497;&#1501;
&#1488;&#1514; &#1492;&#1495;&#1493;&#1502;&#1512; &#1497;&#1499;&#1493;&#1500;&#1497;&#1501; &#1500;&#1491;&#1500;&#1490; &#1506;&#1500; &#1504;&#1493;&#1513;&#1488; &#1494;&#1492; &#1488;&#1493; &#1488;&#1495;&#1512;.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="preface.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#1500;&#1502;&#1506;&#1500;&#1492;</a></td><td width="40%" align="left"> <a accesskey="n" href="sources.html">&#1492;&#1489;&#1488;</a></td></tr><tr><td width="40%" align="right" valign="top">&#1502;&#1489;&#1493;&#1488; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1512;&#1488;&#1513;&#1497;</a></td><td width="40%" align="left" valign="top"> &#1502;&#1511;&#1493;&#1512;&#1493;&#1514;</td></tr></table></div></body></html>
