<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1508;&#1512;&#1511; 1. &#1492;&#1511;&#1491;&#1502;&#1492;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="up" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="prev" href="disclaimer.html" title="&#1492;&#1505;&#1512;&#1514; &#1488;&#1495;&#1512;&#1497;&#1493;&#1514;"><link rel="next" href="today.html" title="&#1492;&#1502;&#1510;&#1489; &#1492;&#1497;&#1493;&#1501;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1508;&#1512;&#1511; 1. &#1492;&#1511;&#1491;&#1502;&#1492;</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="disclaimer.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><th width="60%" align="center"> </th><td width="20%" align="left"> <a accesskey="n" href="today.html">&#1492;&#1489;&#1488;</a></td></tr></table><hr></div><div class="chapter" title="&#1508;&#1512;&#1511; 1. &#1492;&#1511;&#1491;&#1502;&#1492;"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>&#1508;&#1512;&#1511; 1. &#1492;&#1511;&#1491;&#1502;&#1492;</h2></div></div></div><div class="toc"><p><b>&#1514;&#1493;&#1499;&#1503; &#1492;&#1506;&#1504;&#1497;&#1497;&#1504;&#1497;&#1501;</b></p><dl><dt><span class="sect1"><a href="introduction.html#history">&#1492;&#1497;&#1505;&#1496;&#1493;&#1512;&#1497;&#1492;</a></span></dt><dd><dl><dt><span class="sect2"><a href="introduction.html#propertization">&#1506;&#1500;&#1497;&#1497;&#1514;&#1503; &#1513;&#1500; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1511;&#1504;&#1497;&#1497;&#1504;&#1497;&#1514; &#1493;&#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514;</a></span></dt><dd><dl><dt><span class="sect3"><a href="introduction.html#history-conscious-resistance">Conscious resistance</a></span></dt><dt><span class="sect3"><a href="introduction.html#history-accidental-resistance">Accidental resistance</a></span></dt></dl></dd><dt><span class="sect2"><a href="introduction.html#free-vs-open-source">"&#1495;&#1493;&#1508;&#1513;&#1497;" &#1500;&#1506;&#1493;&#1502;&#1514; "&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"</a></span></dt></dl></dd><dt><span class="sect1"><a href="today.html">&#1492;&#1502;&#1510;&#1489; &#1492;&#1497;&#1493;&#1501;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#1512;&#1489; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1504;&#1499;&#1513;&#1500;&#1497;&#1501;.</p><p>&#1489;&#1491;&#1512;&#1498;-&#1499;&#1500;&#1500; &#1488;&#1497;&#1504;&#1504;&#1493; &#1513;&#1493;&#1502;&#1506;&#1497;&#1501; &#1512;&#1489;&#1493;&#1514; &#1488;&#1493;&#1491;&#1493;&#1514; &#1492;&#1499;&#1513;&#1500;&#1493;&#1504;&#1493;&#1514;. &#1512;&#1511; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501;
&#1502;&#1510;&#1500;&#1497;&#1495;&#1497;&#1501; &#1502;&#1493;&#1513;&#1499;&#1497;&#1501; &#1514;&#1513;&#1493;&#1502;&#1514;-&#1500;&#1489;, &#1493;&#1511;&#1497;&#1497;&#1502;&#1497;&#1501; &#1499;&#1500;-&#1499;&#1498; &#1492;&#1512;&#1489;&#1492; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492;
&#1495;&#1493;&#1508;&#1513;&#1497;&#1514;<sup>[<a name="idp5292624" href="#ftn.idp5292624" class="footnote">2</a>]</sup> &#1513;&#1488;&#1508;&#1497;&#1500;&#1493; &#1488;&#1497;&#1500;&#1493; &#1512;&#1511;
&#1488;&#1495;&#1493;&#1494; &#1511;&#1496;&#1503; &#1502;&#1510;&#1500;&#1497;&#1495;&#1497;&#1501;, &#1492;&#1514;&#1493;&#1510;&#1488;&#1492; &#1506;&#1493;&#1491;&#1504;&#1492; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1502;&#1493;&#1495;&#1513;&#1497;&#1497;&#1501; &#1512;&#1489;&#1497;&#1501;. &#1499;&#1502;&#1493;-&#1499;&#1503;
&#1488;&#1497;&#1504;&#1504;&#1493; &#1513;&#1493;&#1502;&#1506;&#1497;&#1501; &#1488;&#1493;&#1491;&#1493;&#1514; &#1492;&#1499;&#1513;&#1500;&#1493;&#1504;&#1493;&#1514; &#1502;&#1488;&#1495;&#1512; &#1493;&#1499;&#1513;&#1500;&#1493;&#1503; &#1488;&#1497;&#1504;&#1493; &#1488;&#1497;&#1512;&#1493;&#1506;. &#1488;&#1497;&#1503; &#1512;&#1490;&#1506; &#1497;&#1495;&#1497;&#1491;
&#1489;&#1493; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1495;&#1493;&#1491;&#1500; &#1500;&#1492;&#1497;&#1493;&#1514; &#1495;&#1497;&#1493;&#1504;&#1497;; &#1488;&#1504;&#1513;&#1497;&#1501; &#1508;&#1513;&#1493;&#1496; &#1502;&#1514;&#1512;&#1495;&#1511;&#1497;&#1501; &#1502;&#1502;&#1504;&#1493; &#1493;&#1502;&#1508;&#1505;&#1497;&#1511;&#1497;&#1501;
&#1500;&#1506;&#1489;&#1493;&#1491; &#1506;&#1500;&#1497;&#1493;. &#1497;&#1497;&#1514;&#1499;&#1503; &#1512;&#1490;&#1506; &#1489;&#1493; &#1504;&#1506;&#1512;&#1498; &#1513;&#1497;&#1504;&#1493;&#1497; &#1505;&#1493;&#1508;&#1497; &#1500;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1488;&#1498; &#1488;&#1500;&#1493; &#1513;&#1489;&#1497;&#1510;&#1506;&#1493;
&#1488;&#1493;&#1514;&#1493;, &#1489;&#1491;&#1512;&#1498;-&#1499;&#1500;&#1500; &#1500;&#1488; &#1497;&#1491;&#1506;&#1493; &#1489;&#1512;&#1490;&#1506; &#1492;&#1489;&#1497;&#1510;&#1493;&#1506; &#1513;&#1494;&#1492; &#1497;&#1492;&#1497;&#1492; &#1492;&#1513;&#1497;&#1504;&#1493;&#1497; &#1492;&#1488;&#1495;&#1512;&#1493;&#1503;. &#1488;&#1497;&#1503;
&#1488;&#1508;&#1497;&#1500;&#1493; &#1492;&#1490;&#1491;&#1512;&#1492; &#1489;&#1512;&#1493;&#1512;&#1492; &#1500;&#1502;&#1514;&#1497; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1502;&#1488;&#1489;&#1491; &#1514;&#1493;&#1511;&#1507;. &#1492;&#1488;&#1501; &#1494;&#1492; &#1499;&#1488;&#1513;&#1512; &#1500;&#1488; &#1489;&#1493;&#1510;&#1506;&#1493; &#1489;&#1493;
&#1513;&#1497;&#1504;&#1493;&#1497;&#1497;&#1501; &#1493;&#1508;&#1506;&#1497;&#1500;&#1493;&#1514; &#1489;&#1502;&#1513;&#1498; &#1513;&#1497;&#1513;&#1492; &#1495;&#1493;&#1491;&#1513;&#1497;&#1501;? &#1499;&#1488;&#1513;&#1512; &#1502;&#1488;&#1490;&#1512; &#1492;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1513;&#1500;&#1493; &#1495;&#1491;&#1500; &#1500;&#1510;&#1502;&#1493;&#1495;,
&#1502;&#1489;&#1500;&#1497; &#1500;&#1506;&#1511;&#1493;&#1507; &#1488;&#1514; &#1502;&#1488;&#1490;&#1512; &#1492;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501;? &#1502;&#1492; &#1488;&#1501; &#1492;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1513;&#1500; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1504;&#1493;&#1496;&#1513;&#1497;&#1501; &#1488;&#1493;&#1514;&#1493;
&#1502;&#1488;&#1495;&#1512; &#1493;&#1492;&#1489;&#1497;&#1504;&#1493; &#1499;&#1497; &#1492;&#1501; &#1502;&#1513;&#1499;&#1508;&#1500;&#1497;&#1501; &#1506;&#1489;&#1493;&#1491;&#1492; &#1513;&#1500; &#1488;&#1495;&#1512;? &#1493;&#1502;&#1492; &#1488;&#1501; &#1502;&#1510;&#1496;&#1512;&#1508;&#1497;&#1501; &#1500;&#1488;&#1493;&#1514;&#1493;
&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1488;&#1495;&#1512;, &#1493;&#1502;&#1512;&#1495;&#1497;&#1489;&#1497;&#1501; &#1488;&#1493;&#1514;&#1493; &#1500;&#1492;&#1499;&#1497;&#1500; &#1488;&#1514; &#1502;&#1512;&#1489;&#1497;&#1514; &#1492;&#1502;&#1488;&#1502;&#1510;&#1497;&#1501; &#1492;&#1502;&#1493;&#1511;&#1491;&#1502;&#1497;&#1501; &#1513;&#1500;&#1492;&#1501;? &#1492;&#1488;&#1501;
&#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1492;&#1512;&#1488;&#1513;&#1493;&#1503; &#1492;&#1505;&#1514;&#1497;&#1497;&#1501;, &#1488;&#1493; &#1508;&#1513;&#1493;&#1496; &#1513;&#1497;&#1504;&#1492; &#1489;&#1497;&#1514;?</p><p>&#1506;&#1511;&#1489; &#1492;&#1502;&#1493;&#1512;&#1499;&#1489;&#1493;&#1514; &#1492;&#1494;&#1493;, &#1489;&#1500;&#1514;&#1497; &#1488;&#1508;&#1513;&#1512;&#1497; &#1500;&#1506;&#1502;&#1493;&#1491; &#1489;&#1491;&#1497;&#1493;&#1511; &#1506;&#1500; &#1502;&#1505;&#1508;&#1512; &#1492;&#1499;&#1513;&#1500;&#1493;&#1504;&#1493;&#1514;.
&#1488;&#1498; &#1512;&#1488;&#1497;&#1493;&#1514; &#1488;&#1504;&#1511;&#1491;&#1493;&#1496;&#1497;&#1493;&#1514; &#1513;&#1492;&#1493;&#1508;&#1497;&#1506;&#1493; &#1489;&#1502;&#1513;&#1498; &#1500;&#1502;&#1506;&#1500;&#1492; &#1502;&#1506;&#1513;&#1493;&#1512;, &#1495;&#1500;&#1511;&#1503; &#1489;&#1488;&#1514;&#1512;
SourceForge.net &#1493;&#1495;&#1500;&#1511;&#1503; &#1502;&#1495;&#1497;&#1508;&#1493;&#1513; &#1489;&#1490;&#1493;&#1490;&#1500;, &#1499;&#1493;&#1500;&#1503; &#1502;&#1510;&#1489;&#1497;&#1506;&#1493;&#1514; &#1506;&#1500; &#1488;&#1493;&#1514;&#1492; &#1502;&#1505;&#1511;&#1504;&#1492;: &#1502;&#1505;&#1508;&#1512;
&#1492;&#1499;&#1513;&#1500;&#1493;&#1504;&#1493;&#1514; &#1490;&#1489;&#1493;&#1492; &#1489;&#1497;&#1493;&#1514;&#1512;, &#1505;&#1489;&#1497;&#1512; &#1499;&#1497; &#1489;&#1497;&#1503; 90 &#1506;&#1491; 95 &#1488;&#1495;&#1493;&#1494;. &#1492;&#1502;&#1505;&#1508;&#1512; &#1502;&#1496;&#1508;&#1505; &#1490;&#1489;&#1493;&#1492; &#1497;&#1493;&#1514;&#1512;
&#1488;&#1501; &#1499;&#1493;&#1500;&#1500;&#1497;&#1501; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1513;&#1513;&#1493;&#1512;&#1491;&#1497;&#1501; &#1488;&#1498; &#1500;&#1493;&#1511;&#1497;&#1501; &#1489;&#1514;&#1508;&#1511;&#1493;&#1491;: &#1488;&#1500;&#1492; <span class="emphasis"><em>&#1513;&#1502;&#1497;&#1497;&#1510;&#1512;&#1497;&#1501;</em></span>
&#1511;&#1493;&#1491; &#1512;&#1509;, &#1488;&#1498; &#1488;&#1497;&#1504;&#1501; &#1502;&#1511;&#1493;&#1501; &#1504;&#1495;&#1502;&#1491; &#1500;&#1492;&#1497;&#1493;&#1514; &#1489;&#1493;, &#1488;&#1493; &#1513;&#1488;&#1497;&#1504;&#1501; &#1502;&#1513;&#1497;&#1490;&#1497;&#1501; &#1492;&#1514;&#1511;&#1491;&#1502;&#1493;&#1514; &#1489;&#1502;&#1492;&#1497;&#1512;&#1493;&#1514;
&#1488;&#1493; &#1489;&#1504;&#1488;&#1502;&#1504;&#1493;&#1514; &#1513;&#1492;&#1497;&#1493; &#1497;&#1499;&#1493;&#1500;&#1497;&#1501; &#1500;&#1492;&#1513;&#1497;&#1490;&#1492;.</p><p>&#1505;&#1508;&#1512; &#1494;&#1492; &#1492;&#1493;&#1488; &#1488;&#1493;&#1491;&#1493;&#1514; &#1492;&#1502;&#1504;&#1506;&#1493;&#1514; &#1502;&#1499;&#1513;&#1500;&#1493;&#1503;. &#1492;&#1493;&#1488; &#1505;&#1493;&#1511;&#1512; &#1500;&#1488; &#1512;&#1511; &#1499;&#1497;&#1510;&#1491; &#1500;&#1506;&#1513;&#1493;&#1514; &#1491;&#1489;&#1512;&#1497;&#1501;
&#1504;&#1499;&#1493;&#1504;&#1492;, &#1488;&#1500;&#1488; &#1490;&#1501; &#1488;&#1497;&#1498; &#1500;&#1506;&#1513;&#1493;&#1514;&#1501; &#1500;&#1488; &#1504;&#1499;&#1493;&#1503;, &#1489;&#1499;&#1491;&#1497; &#1513;&#1514;&#1493;&#1499;&#1500;&#1493; &#1500;&#1494;&#1492;&#1493;&#1514; &#1493;&#1500;&#1514;&#1511;&#1503; &#1489;&#1506;&#1497;&#1493;&#1514; &#1502;&#1493;&#1511;&#1491;&#1501;.
&#1488;&#1504;&#1497; &#1502;&#1511;&#1493;&#1493;&#1492; &#1513;&#1500;&#1488;&#1495;&#1512; &#1513;&#1514;&#1511;&#1512;&#1488;&#1493; &#1488;&#1493;&#1514;&#1493;, &#1497;&#1492;&#1497;&#1492; &#1489;&#1495;&#1494;&#1511;&#1514;&#1499;&#1501; &#1512;&#1508;&#1512;&#1496;&#1493;&#1488;&#1512; &#1513;&#1497;&#1496;&#1493;&#1514; &#1500;&#1488; &#1512;&#1511; &#1489;&#1499;&#1491;&#1497;
&#1500;&#1492;&#1502;&#1504;&#1506; &#1502;&#1502;&#1499;&#1513;&#1493;&#1500;&#1497;&#1501; &#1502;&#1493;&#1499;&#1512;&#1497;&#1501; &#1513;&#1500; &#1508;&#1497;&#1514;&#1493;&#1495; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1488;&#1500;&#1488; &#1490;&#1501; &#1489;&#1499;&#1491;&#1497; &#1500;&#1492;&#1514;&#1502;&#1493;&#1491;&#1491; &#1506;&#1501; &#1492;&#1490;&#1497;&#1491;&#1493;&#1500;
&#1493;&#1492;&#1514;&#1495;&#1494;&#1493;&#1511;&#1492; &#1513;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1502;&#1510;&#1500;&#1497;&#1495;. &#1492;&#1510;&#1500;&#1495;&#1492; &#1488;&#1497;&#1504;&#1504;&#1492; &#1502;&#1513;&#1495;&#1511; &#1505;&#1499;&#1493;&#1501;-&#1488;&#1508;&#1505;, &#1493;&#1505;&#1508;&#1512; &#1494;&#1492; &#1488;&#1497;&#1504;&#1504;&#1493;
&#1488;&#1493;&#1491;&#1493;&#1514; &#1504;&#1497;&#1510;&#1495;&#1493;&#1503; &#1488;&#1493; &#1506;&#1511;&#1497;&#1508;&#1514; &#1492;&#1514;&#1495;&#1512;&#1493;&#1514;. &#1500;&#1502;&#1506;&#1513;&#1492;, &#1495;&#1500;&#1511; &#1495;&#1513;&#1493;&#1489; &#1489;&#1504;&#1497;&#1492;&#1493;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;
&#1492;&#1493;&#1488; &#1506;&#1489;&#1493;&#1491;&#1492; &#1495;&#1500;&#1511;&#1492; &#1497;&#1495;&#1491; &#1506;&#1501; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1511;&#1512;&#1493;&#1489;&#1497;&#1501;. &#1489;&#1496;&#1493;&#1493;&#1495; &#1492;&#1488;&#1512;&#1493;&#1498;, &#1499;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1502;&#1510;&#1500;&#1497;&#1495;
&#1514;&#1493;&#1512;&#1501; &#1500;&#1496;&#1493;&#1489;&#1514; &#1499;&#1500; &#1492;&#1490;&#1493;&#1507; &#1492;&#1506;&#1493;&#1500;&#1502;&#1497;, &#1492;&#1499;&#1493;&#1500;&#1500;, &#1513;&#1500; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514;.</p><p>&#1494;&#1492; &#1497;&#1492;&#1497;&#1492; &#1502;&#1508;&#1514;&#1492; &#1500;&#1493;&#1502;&#1512; &#1513;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1499;&#1493;&#1513;&#1500;&#1497;&#1501; &#1502;&#1488;&#1493;&#1514;&#1503; &#1505;&#1497;&#1489;&#1493;&#1514;
&#1502;&#1492;&#1503; &#1499;&#1493;&#1513;&#1500;&#1497;&#1501; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1511;&#1504;&#1497;&#1497;&#1504;&#1497;&#1514;. &#1489;&#1493;&#1493;&#1491;&#1488;&#1497; &#1488;&#1497;&#1503; &#1500;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;
&#1502;&#1493;&#1504;&#1493;&#1508;&#1493;&#1500; &#1506;&#1500; &#1491;&#1512;&#1497;&#1513;&#1493;&#1514; &#1500;&#1488; &#1502;&#1510;&#1497;&#1488;&#1493;&#1514;&#1497;&#1493;&#1514;, &#1492;&#1490;&#1491;&#1512;&#1493;&#1514; &#1506;&#1502;&#1493;&#1502;&#1493;&#1514;, &#1504;&#1497;&#1492;&#1493;&#1500; &#1502;&#1513;&#1488;&#1489;&#1497;&#1501; &#1490;&#1512;&#1493;&#1506;
&#1513;&#1500;&#1489;&#1497; &#1514;&#1499;&#1503; &#1500;&#1488; &#1502;&#1505;&#1508;&#1511;&#1497;&#1501;, &#1488;&#1493; &#1499;&#1500; &#1502;&#1512;&#1506;&#1497;&#1503; &#1489;&#1497;&#1513;&#1497;&#1503; &#1488;&#1495;&#1512; &#1492;&#1497;&#1491;&#1493;&#1506; &#1492;&#1497;&#1496;&#1489; &#1500;&#1514;&#1506;&#1513;&#1497;&#1497;&#1514;
&#1492;&#1514;&#1493;&#1499;&#1504;&#1492;. &#1512;&#1489;&#1493;&#1514; &#1504;&#1499;&#1514;&#1489; &#1506;&#1500; &#1504;&#1493;&#1513;&#1488;&#1497;&#1501; &#1488;&#1500;&#1492;, &#1493;&#1488;&#1504;&#1497; &#1488;&#1513;&#1514;&#1491;&#1500; &#1500;&#1488; &#1500;&#1513;&#1506;&#1514;&#1511; &#1494;&#1488;&#1514; &#1489;&#1505;&#1508;&#1512; &#1494;&#1492;.
&#1489;&#1502;&#1511;&#1493;&#1501; &#1494;&#1488;&#1514;, &#1488;&#1504;&#1505;&#1492; &#1500;&#1514;&#1488;&#1512; &#1488;&#1514; &#1492;&#1489;&#1506;&#1497;&#1493;&#1514; &#1492;&#1497;&#1497;&#1495;&#1493;&#1491;&#1497;&#1493;&#1514; &#1500;&#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;. &#1499;&#1488;&#1513;&#1512;
&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1502;&#1514;&#1512;&#1505;&#1511;, &#1500;&#1512;&#1493;&#1489; &#1494;&#1492; &#1502;&#1499;&#1497;&#1493;&#1493;&#1503; &#1513;&#1492;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501; (&#1488;&#1493; &#1492;&#1502;&#1504;&#1492;&#1500;&#1497;&#1501;)
&#1500;&#1488; &#1492;&#1506;&#1512;&#1497;&#1499;&#1493; &#1488;&#1514; &#1492;&#1489;&#1506;&#1497;&#1493;&#1514; &#1492;&#1497;&#1497;&#1495;&#1493;&#1491;&#1497;&#1493;&#1514; &#1500;&#1508;&#1497;&#1514;&#1493;&#1495; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1506;&#1500;-&#1488;&#1507; &#1513;&#1488;&#1493;&#1500;&#1497; &#1492;&#1497;&#1493;
&#1502;&#1493;&#1499;&#1504;&#1497;&#1501; &#1492;&#1497;&#1496;&#1489; &#1500;&#1511;&#1513;&#1497;&#1497;&#1501; &#1492;&#1497;&#1491;&#1493;&#1506;&#1497;&#1501; &#1497;&#1493;&#1514;&#1512; &#1513;&#1500; &#1508;&#1497;&#1514;&#1493;&#1495; &#1489;&#1511;&#1493;&#1491; &#1505;&#1490;&#1493;&#1512;.</p><p>&#1488;&#1495;&#1514; &#1492;&#1496;&#1506;&#1493;&#1497;&#1493;&#1514; &#1492;&#1504;&#1508;&#1493;&#1510;&#1493;&#1514; &#1489;&#1497;&#1493;&#1514;&#1512; &#1492;&#1497;&#1488; &#1510;&#1497;&#1508;&#1497;&#1493;&#1514; &#1500;&#1488; &#1502;&#1510;&#1497;&#1488;&#1493;&#1514;&#1497;&#1493;&#1514; &#1489;&#1504;&#1493;&#1490;&#1506;
&#1500;&#1497;&#1514;&#1512;&#1493;&#1504;&#1493;&#1514; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495; &#1499;&#1513;&#1500;&#1506;&#1510;&#1502;&#1493;. &#1512;&#1513;&#1497;&#1493;&#1503; &#1508;&#1514;&#1493;&#1495; &#1500;&#1488; &#1502;&#1489;&#1496;&#1497;&#1495; &#1513;&#1506;&#1491;&#1512;&#1497;&#1501; &#1513;&#1500; &#1502;&#1508;&#1514;&#1495;&#1497;&#1501;
&#1508;&#1506;&#1497;&#1500;&#1497;&#1501; &#1497;&#1504;&#1491;&#1489;&#1493; &#1500;&#1508;&#1514;&#1506; &#1488;&#1514; &#1494;&#1502;&#1504;&#1501; &#1500;&#1502;&#1506;&#1503; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1513;&#1500;&#1498;, &#1493;&#1499;&#1503; &#1508;&#1497;&#1514;&#1495;&#1514; &#1511;&#1493;&#1491; &#1513;&#1500;
&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1489;&#1506;&#1497;&#1497;&#1514;&#1497; &#1500;&#1488; &#1502;&#1512;&#1508;&#1488;&#1514; &#1488;&#1514; &#1495;&#1493;&#1500;&#1497;&#1497;&#1493; &#1489;&#1488;&#1493;&#1508;&#1503; &#1488;&#1493;&#1496;&#1493;&#1502;&#1496;&#1497;. &#1500;&#1502;&#1506;&#1513;&#1492;, &#1492;&#1492;&#1508;&#1498;
&#1492;&#1493;&#1488; &#1492;&#1504;&#1499;&#1493;&#1503;: &#1508;&#1514;&#1497;&#1495;&#1514; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1497;&#1499;&#1493;&#1500;&#1492; &#1500;&#1492;&#1493;&#1505;&#1497;&#1507; &#1504;&#1491;&#1489;&#1498; &#1495;&#1491;&#1513; &#1513;&#1500; &#1502;&#1493;&#1512;&#1499;&#1489;&#1493;&#1497;&#1493;&#1514;
&#1493;&#1500;&#1506;&#1500;&#1493;&#1514; <span class="emphasis"><em>&#1497;&#1493;&#1514;&#1512;</em></span> &#1489;&#1496;&#1493;&#1493;&#1495; &#1492;&#1511;&#1510;&#1512; &#1502;&#1488;&#1513;&#1512; &#1508;&#1513;&#1493;&#1496; &#1500;&#1492;&#1513;&#1488;&#1497;&#1512;
&#1488;&#1493;&#1514;&#1493; &#1505;&#1490;&#1493;&#1512; "&#1489;&#1489;&#1497;&#1514;". &#1508;&#1514;&#1497;&#1495;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1508;&#1497;&#1512;&#1493;&#1513;&#1492; &#1492;&#1508;&#1497;&#1499;&#1514; &#1492;&#1511;&#1493;&#1491; &#1500;&#1504;&#1492;&#1497;&#1512; &#1493;&#1511;&#1512;&#1497;&#1488;
&#1506;&#1489;&#1493;&#1512; &#1494;&#1512;&#1497;&#1501; &#1502;&#1493;&#1495;&#1500;&#1496;&#1497;&#1501;, &#1492;&#1511;&#1502;&#1514; &#1488;&#1514;&#1512; &#1508;&#1497;&#1514;&#1493;&#1495; &#1489;&#1512;&#1513;&#1514; &#1493;&#1512;&#1513;&#1497;&#1502;&#1493;&#1514; &#1514;&#1508;&#1493;&#1510;&#1492;, &#1493;&#1500;&#1506;&#1514;&#1497;&#1501;
&#1511;&#1512;&#1493;&#1489;&#1493;&#1514;, &#1499;&#1514;&#1497;&#1489;&#1514; &#1514;&#1497;&#1506;&#1493;&#1491; &#1489;&#1508;&#1506;&#1501; &#1492;&#1512;&#1488;&#1513;&#1493;&#1504;&#1492;. &#1502;&#1491;&#1493;&#1489;&#1512; &#1489;&#1492;&#1502;&#1493;&#1503; &#1506;&#1489;&#1493;&#1491;&#1492;. &#1493;&#1499;&#1502;&#1493;&#1489;&#1503;,
&#1488;&#1501; &#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1502;&#1506;&#1493;&#1504;&#1497;&#1497;&#1504;&#1497;&#1501; <span class="emphasis"><em>&#1488;&#1499;&#1503;</em></span> &#1502;&#1493;&#1508;&#1497;&#1506;&#1497;&#1501;, &#1504;&#1493;&#1505;&#1507; &#1492;&#1506;&#1493;&#1500;
&#1513;&#1500; &#1500;&#1506;&#1504;&#1493;&#1514; &#1500;&#1492;&#1501; &#1506;&#1500; &#1513;&#1488;&#1500;&#1493;&#1514;&#1497;&#1492;&#1501; &#1494;&#1502;&#1503; &#1502;&#1492; &#1496;&#1512;&#1501; &#1502;&#1508;&#1497;&#1511;&#1497;&#1501; &#1514;&#1493;&#1506;&#1500;&#1514; &#1502;&#1504;&#1493;&#1499;&#1495;&#1493;&#1514;&#1501;.
&#1499;&#1508;&#1497; &#1513;&#1488;&#1502;&#1512; &#1492;&#1502;&#1508;&#1514;&#1495; &#1490;'&#1497;&#1497;&#1502;&#1497; &#1494;&#1493;&#1493;&#1497;&#1504;&#1505;&#1511;&#1497; &#1506;&#1500; &#1492;&#1497;&#1502;&#1497;&#1501; &#1492;&#1502;&#1493;&#1511;&#1491;&#1502;&#1497;&#1501; &#1492;&#1489;&#1506;&#1497;&#1514;&#1497;&#1497;&#1501; &#1513;&#1500;
&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1502;&#1493;&#1494;&#1497;&#1500;&#1492;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495; &#1506;&#1493;&#1489;&#1491;, &#1488;&#1498; &#1489;&#1492;&#1495;&#1500;&#1496; &#1488;&#1497;&#1504;&#1504;&#1493; &#1514;&#1512;&#1493;&#1508;&#1514; &#1508;&#1500;&#1488;. &#1488;&#1501; &#1497;&#1513;
      &#1502;&#1493;&#1505;&#1512; &#1492;&#1513;&#1499;&#1500; &#1499;&#1488;&#1503;, &#1492;&#1493;&#1488; &#1513;&#1488;&#1497;&#1504;&#1498; &#1497;&#1499;&#1493;&#1500; &#1500;&#1511;&#1495;&#1514; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1490;&#1493;&#1505;&#1505;, &#1500;&#1508;&#1494;&#1512; &#1506;&#1500;&#1497;&#1493; &#1502;&#1506;&#1496;
      &#1502;&#1488;&#1489;&#1511;&#1514; &#1492;&#1508;&#1497;&#1493;&#1514; &#1513;&#1500; &#1492;"&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495;", &#1493;&#1513;&#1492;&#1499;&#1500; &#1497;&#1506;&#1489;&#1493;&#1491; &#1500;&#1508;&#1514;&#1506; &#1499;&#1489;&#1502;&#1490;&#1506; &#1511;&#1505;&#1501;. &#1508;&#1497;&#1514;&#1493;&#1495;
      &#1514;&#1493;&#1499;&#1504;&#1492; &#1494;&#1488;&#1514; &#1502;&#1500;&#1488;&#1499;&#1492; &#1511;&#1513;&#1492;. &#1492;&#1489;&#1506;&#1497;&#1493;&#1514; &#1489;&#1492;, &#1488;&#1497;&#1504;&#1503; &#1499;&#1492; &#1508;&#1513;&#1493;&#1496;&#1493;&#1514;.</em></span></p><p>(&#1502;&#1514;&#1493;&#1498; <span class="bold"><strong><a class="ulink" href="http://www.jwz.org/gruntle/nomo.html" target="_top">http://www.jwz.org/gruntle/nomo.html</a></strong></span>)</p></blockquote></div><p>&#1496;&#1506;&#1493;&#1514; &#1511;&#1513;&#1493;&#1512;&#1492; &#1492;&#1497;&#1504;&#1492; &#1495;&#1497;&#1508;&#1493;&#1507; &#1489;&#1492;&#1510;&#1490;&#1514; &#1493;&#1488;&#1512;&#1497;&#1494;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1502;&#1514;&#1493;&#1498; &#1502;&#1495;&#1513;&#1489;&#1492;
&#1513;&#1488;&#1500;&#1492; &#1514;&#1502;&#1497;&#1491; &#1497;&#1499;&#1493;&#1500;&#1497;&#1501; &#1500;&#1492;&#1514;&#1489;&#1510;&#1506; &#1502;&#1488;&#1493;&#1495;&#1512; &#1497;&#1493;&#1514;&#1512;, &#1499;&#1488;&#1513;&#1512; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1499;&#1489;&#1512; &#1504;&#1502;&#1510;&#1488; &#1489;&#1491;&#1512;&#1499;&#1493;.
&#1492;&#1510;&#1490;&#1492; &#1493;&#1488;&#1512;&#1497;&#1494;&#1492; &#1502;&#1499;&#1497;&#1500;&#1493;&#1514; &#1489;&#1495;&#1493;&#1489;&#1503; &#1502;&#1490;&#1493;&#1493;&#1503; &#1512;&#1495;&#1489; &#1513;&#1500; &#1502;&#1513;&#1497;&#1502;&#1493;&#1514;, &#1488;&#1513;&#1512; &#1499;&#1493;&#1500;&#1503; &#1505;&#1493;&#1489;&#1489;&#1493;&#1514; &#1505;&#1489;&#1497;&#1489;
&#1492;&#1508;&#1495;&#1514;&#1514; &#1495;&#1505;&#1501; &#1492;&#1499;&#1504;&#1497;&#1505;&#1492; &#1500;&#1513;&#1493;&#1511;. &#1492;&#1508;&#1497;&#1499;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1500;&#1502;&#1494;&#1502;&#1497;&#1503; &#1506;&#1489;&#1493;&#1512; &#1494;&#1512;&#1497;&#1501;, &#1508;&#1497;&#1512;&#1493;&#1513;&#1492;
&#1499;&#1514;&#1497;&#1489;&#1514; &#1514;&#1497;&#1506;&#1493;&#1491; &#1500;&#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1493;&#1500;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501;, &#1492;&#1511;&#1502;&#1514; &#1488;&#1514;&#1512; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496; &#1488;&#1497;&#1504;&#1508;&#1493;&#1512;&#1502;&#1496;&#1497;&#1489;&#1497; &#1500;&#1495;&#1491;&#1513;&#1497;&#1501;
&#1506;&#1489;&#1493;&#1512; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1502;&#1497;&#1499;&#1493;&#1503; &#1513;&#1500; &#1499;&#1502;&#1492; &#1513;&#1497;&#1493;&#1514;&#1512; &#1502;&#1514;&#1492;&#1500;&#1497;&#1499;&#1497; &#1492;&#1492;&#1497;&#1491;&#1493;&#1512; &#1493;&#1492;&#1492;&#1514;&#1511;&#1504;&#1492;, &#1493;&#1499;&#1493;'.
&#1500;&#1512;&#1493;&#1506; &#1492;&#1502;&#1494;&#1500;, &#1502;&#1514;&#1499;&#1504;&#1514;&#1497;&#1501; &#1512;&#1489;&#1497;&#1501; &#1502;&#1514;&#1497;&#1497;&#1495;&#1505;&#1497;&#1501; &#1500;&#1502;&#1513;&#1497;&#1502;&#1493;&#1514; &#1488;&#1500;&#1492; &#1499;&#1502;&#1513;&#1504;&#1497;&#1493;&#1514; &#1489;&#1495;&#1513;&#1497;&#1489;&#1493;&#1514;&#1503; &#1500;&#1506;&#1493;&#1502;&#1514;
&#1499;&#1514;&#1497;&#1489;&#1514; &#1492;&#1511;&#1493;&#1491; &#1506;&#1510;&#1502;&#1493;. &#1497;&#1513; &#1500;&#1499;&#1498; &#1502;&#1505;&#1508;&#1512; &#1505;&#1497;&#1489;&#1493;&#1514;. &#1492;&#1512;&#1488;&#1513;&#1493;&#1504;&#1492; &#1492;&#1497;&#1488; &#1513;&#1494;&#1492; &#1497;&#1499;&#1493;&#1500; &#1500;&#1492;&#1512;&#1490;&#1497;&#1513;
&#1499;&#1502;&#1493; &#1506;&#1489;&#1493;&#1491;&#1492; &#1513;&#1495;&#1493;&#1512;&#1492;, &#1492;&#1497;&#1493;&#1514; &#1493;&#1492;&#1506;&#1512;&#1498; &#1513;&#1500;&#1492; &#1489;&#1512;&#1493;&#1512; &#1497;&#1493;&#1514;&#1512; &#1500;&#1502;&#1497; &#1513;&#1508;&#1495;&#1493;&#1514; &#1502;&#1499;&#1497;&#1512; &#1488;&#1514; &#1508;&#1512;&#1496;&#1497;
&#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1493;&#1500;&#1492;&#1508;&#1498;. &#1488;&#1495;&#1512;&#1497; &#1492;&#1499;&#1500;, &#1492;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1513;&#1500; &#1492;&#1511;&#1493;&#1491;, &#1500;&#1488; &#1502;&#1502;&#1513; &#1510;&#1512;&#1497;&#1499;&#1497;&#1501; &#1488;&#1514; &#1492;&#1488;&#1512;&#1497;&#1494;&#1492;.
&#1492;&#1501; &#1499;&#1489;&#1512; &#1497;&#1493;&#1491;&#1506;&#1497;&#1501; &#1499;&#1497;&#1510;&#1491; &#1500;&#1492;&#1514;&#1511;&#1497;&#1503;, &#1500;&#1504;&#1492;&#1500;, &#1493;&#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489;&#1514;&#1493;&#1499;&#1504;&#1492;, &#1502;&#1488;&#1495;&#1512; &#1493;&#1492;&#1501; &#1499;&#1514;&#1489;&#1493; &#1488;&#1493;&#1514;&#1492;.
&#1513;&#1504;&#1497;&#1514;, &#1492;&#1499;&#1497;&#1513;&#1493;&#1512;&#1497;&#1501; &#1492;&#1504;&#1491;&#1512;&#1513;&#1497;&#1501; &#1500;&#1492;&#1510;&#1490;&#1492; &#1493;&#1488;&#1512;&#1497;&#1494;&#1492; &#1513;&#1500; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1489;&#1510;&#1493;&#1512;&#1492; &#1496;&#1493;&#1489;&#1492;, &#1500;&#1506;&#1497;&#1514;&#1497;&#1501;
&#1511;&#1512;&#1493;&#1489;&#1493;&#1514; &#1499;&#1500;&#1500; &#1488;&#1497;&#1504;&#1501; &#1488;&#1500;&#1492; &#1492;&#1504;&#1491;&#1512;&#1513;&#1497;&#1501; &#1500;&#1499;&#1514;&#1497;&#1489;&#1514; &#1492;&#1511;&#1493;&#1491;. &#1488;&#1504;&#1513;&#1497;&#1501; &#1504;&#1493;&#1496;&#1497;&#1501; &#1500;&#1492;&#1514;&#1502;&#1511;&#1491; &#1489;&#1502;&#1492; &#1513;&#1492;&#1501;
&#1496;&#1493;&#1489;&#1497;&#1501; &#1489;&#1493;, &#1506;&#1500;-&#1488;&#1507; &#1513;&#1497;&#1497;&#1514;&#1499;&#1503; &#1493;&#1497;&#1497;&#1513;&#1512;&#1514;&#1493; &#1496;&#1493;&#1489; &#1497;&#1493;&#1514;&#1512; &#1488;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1488;&#1501; &#1497;&#1513;&#1511;&#1497;&#1506;&#1493; &#1489;&#1502;&#1492;
&#1513;&#1508;&#1495;&#1493;&#1514; &#1502;&#1514;&#1488;&#1497;&#1501; &#1500;&#1492;&#1501; &#1500;&#1506;&#1513;&#1493;&#1514;. <a class="xref" href="getting-started.html" title="&#1508;&#1512;&#1511; 2. &#1502;&#1514;&#1495;&#1497;&#1500;&#1497;&#1501;">&#1508;&#1512;&#1511; 2, <i>&#1502;&#1514;&#1495;&#1497;&#1500;&#1497;&#1501;</i></a> &#1491;&#1503; &#1489;&#1492;&#1510;&#1490;&#1492;
&#1493;&#1488;&#1512;&#1497;&#1494;&#1492; &#1500;&#1508;&#1512;&#1496;&#1497;&#1501;, &#1493;&#1502;&#1505;&#1489;&#1497;&#1512; &#1502;&#1491;&#1493;&#1506; &#1494;&#1492; &#1488;&#1511;&#1493;&#1496;&#1497; &#1513;&#1497;&#1492;&#1497;&#1493; &#1489;&#1495;&#1513;&#1497;&#1489;&#1493;&#1514; &#1490;&#1489;&#1493;&#1492;&#1492; &#1499;&#1489;&#1512; &#1489;&#1513;&#1500;&#1489;&#1497;&#1501;
&#1492;&#1512;&#1488;&#1513;&#1493;&#1504;&#1497;&#1501; &#1513;&#1500; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;.</p><p>&#1496;&#1506;&#1493;&#1514; &#1504;&#1493;&#1505;&#1508;&#1514; &#1492;&#1497;&#1488; &#1492;&#1492;&#1504;&#1495;&#1492; &#1492;&#1502;&#1493;&#1496;&#1506;&#1497;&#1514; &#1513;&#1504;&#1497;&#1492;&#1493;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1502;&#1493;&#1506;&#1496; &#1488;&#1493; &#1500;&#1488;
&#1511;&#1497;&#1497;&#1501; &#1504;&#1495;&#1493;&#1509; &#1500;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1488;&#1493; &#1502;&#1488;&#1497;&#1491;&#1498; &#1490;&#1497;&#1505;&#1492;, &#1513;&#1488;&#1493;&#1514;&#1503; &#1490;&#1497;&#1513;&#1493;&#1514; &#1504;&#1497;&#1492;&#1493;&#1500; &#1492;&#1504;&#1492;&#1493;&#1490;&#1493;&#1514;
&#1489;&#1508;&#1497;&#1514;&#1493;&#1495; &#1511;&#1504;&#1497;&#1497;&#1504;&#1497;, &#1497;&#1506;&#1489;&#1491;&#1493; &#1489;&#1488;&#1493;&#1514;&#1492; &#1502;&#1497;&#1491;&#1492; &#1506;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;. &#1504;&#1497;&#1492;&#1493;&#1500;
&#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495; &#1488;&#1497;&#1504;&#1493; &#1514;&#1502;&#1497;&#1491; &#1489;&#1512;&#1493;&#1512; &#1493;&#1490;&#1500;&#1493;&#1497;, &#1488;&#1498; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1492;&#1502;&#1510;&#1500;&#1497;&#1495;&#1497;&#1501;,
&#1489;&#1491;&#1512;&#1498;-&#1499;&#1500;&#1500; &#1492;&#1493;&#1488; &#1502;&#1514;&#1512;&#1495;&#1513; &#1502;&#1488;&#1495;&#1493;&#1512;&#1497; &#1492;&#1499;&#1500;&#1500;&#1497;&#1501; &#1489;&#1510;&#1493;&#1512;&#1492; &#1499;&#1500;&#1513;&#1492;&#1497;. &#1504;&#1497;&#1505;&#1493;&#1497; &#1502;&#1495;&#1513;&#1489;&#1492; &#1511;&#1496;&#1503;,
&#1502;&#1505;&#1508;&#1497;&#1511; &#1506;&#1500;-&#1502;&#1504;&#1514; &#1500;&#1492;&#1502;&#1495;&#1497;&#1513; &#1502;&#1491;&#1493;&#1506;. &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495; &#1502;&#1493;&#1512;&#1499;&#1489; &#1502;&#1488;&#1493;&#1505;&#1507; &#1502;&#1514;&#1499;&#1504;&#1514;&#1497;&#1501;
&#1488;&#1511;&#1512;&#1488;&#1497; - &#1511;&#1489;&#1493;&#1510;&#1492; &#1489;&#1506;&#1500;&#1514; &#1495;&#1493;&#1513; &#1506;&#1510;&#1502;&#1488;&#1493;&#1514; &#1502;&#1508;&#1493;&#1514;&#1495; &#1499;&#1513;&#1500;&#1506;&#1510;&#1502;&#1493; - &#1488;&#1513;&#1512; &#1505;&#1489;&#1497;&#1512; &#1500;&#1492;&#1504;&#1497;&#1495;
&#1513;&#1502;&#1506;&#1493;&#1500;&#1501; &#1500;&#1488; &#1508;&#1490;&#1513;&#1493; &#1494;&#1492; &#1488;&#1514; &#1494;&#1492;, &#1493;&#1488;&#1513;&#1512; &#1497;&#1497;&#1514;&#1499;&#1503; &#1513;&#1497;&#1513; &#1500;&#1492;&#1501; &#1502;&#1496;&#1512;&#1493;&#1514; &#1508;&#1512;&#1496;&#1497;&#1493;&#1514; &#1513;&#1493;&#1504;&#1493;&#1514;
&#1489;&#1506;&#1489;&#1493;&#1491;&#1492; &#1506;&#1500; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;. &#1504;&#1497;&#1505;&#1493;&#1497; &#1492;&#1502;&#1495;&#1513;&#1489;&#1492; &#1492;&#1497;&#1504;&#1493; &#1508;&#1513;&#1493;&#1496; &#1500;&#1491;&#1502;&#1497;&#1497;&#1503; &#1502;&#1492; &#1497;&#1511;&#1512;&#1492; &#1500;&#1488;&#1493;&#1514;&#1492;
&#1511;&#1489;&#1493;&#1510;&#1492; <span class="emphasis"><em>&#1489;&#1500;&#1497;</em></span> &#1504;&#1497;&#1492;&#1493;&#1500;. &#1500;&#1500;&#1488; &#1504;&#1497;&#1505;&#1497;&#1501;, &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1497;&#1511;&#1512;&#1493;&#1505;
&#1488;&#1493; &#1497;&#1514;&#1502;&#1493;&#1490;&#1490; &#1502;&#1488;&#1491; &#1502;&#1492;&#1512;. &#1491;&#1489;&#1512;&#1497;&#1501; &#1500;&#1488; &#1497;&#1508;&#1506;&#1497;&#1500;&#1493; &#1488;&#1514; &#1506;&#1510;&#1502;&#1501;, &#1500;&#1502;&#1512;&#1493;&#1514; &#1513;&#1488;&#1493;&#1500;&#1497; &#1504;&#1511;&#1493;&#1493;&#1492;
&#1500;&#1499;&#1498;. &#1488;&#1498; &#1492;&#1504;&#1497;&#1492;&#1493;&#1500;, &#1513;&#1497;&#1497;&#1514;&#1499;&#1503; &#1493;&#1492;&#1493;&#1488; &#1488;&#1508;&#1497;&#1500;&#1493; &#1502;&#1488;&#1491; &#1508;&#1506;&#1497;&#1500;, &#1500;&#1512;&#1489; &#1488;&#1497;&#1504;&#1504;&#1493; &#1512;&#1513;&#1502;&#1497;,
&#1492;&#1493;&#1488; &#1502;&#1506;&#1493;&#1491;&#1503;, &#1493;&#1506;&#1500; &#1488;&#1513; &#1504;&#1502;&#1493;&#1499;&#1492;. &#1492;&#1491;&#1489;&#1512; &#1492;&#1497;&#1495;&#1497;&#1491; &#1513;&#1502;&#1495;&#1494;&#1497;&#1511; &#1511;&#1489;&#1493;&#1510;&#1514; &#1508;&#1497;&#1514;&#1493;&#1495; &#1489;&#1497;&#1495;&#1491;,
&#1492;&#1493;&#1488; &#1492;&#1488;&#1502;&#1493;&#1504;&#1492; &#1513;&#1497;&#1495;&#1491;&#1497;&#1493; &#1497;&#1493;&#1499;&#1500;&#1493; &#1500;&#1492;&#1513;&#1497;&#1490; &#1497;&#1493;&#1514;&#1512; &#1502;&#1488;&#1513;&#1512; &#1500;&#1495;&#1493;&#1491;. &#1506;&#1500;-&#1499;&#1503;, &#1514;&#1508;&#1511;&#1497;&#1491;
&#1492;&#1504;&#1497;&#1492;&#1493;&#1500; &#1492;&#1493;&#1488; &#1513;&#1495;&#1489;&#1512;&#1497; &#1492;&#1511;&#1489;&#1493;&#1510;&#1492; &#1497;&#1502;&#1513;&#1497;&#1499;&#1493; &#1500;&#1492;&#1488;&#1502;&#1497;&#1503; &#1489;&#1499;&#1498;, &#1506;&#1500;-&#1497;&#1491;&#1497; &#1492;&#1510;&#1489;&#1514; &#1514;&#1511;&#1504;&#1497;&#1501;
&#1500;&#1514;&#1511;&#1513;&#1493;&#1512;&#1514;, &#1493;&#1497;&#1491;&#1493;&#1488; &#1513;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1502;&#1493;&#1506;&#1497;&#1500;&#1497;&#1501; &#1500;&#1488; &#1504;&#1494;&#1512;&#1511;&#1497;&#1501; &#1500;&#1513;&#1493;&#1500;&#1497;&#1497;&#1501; &#1506;&#1511;&#1489; &#1504;&#1505;&#1497;&#1489;&#1493;&#1514;
&#1488;&#1497;&#1513;&#1497;&#1493;&#1514;, &#1493;&#1489;&#1488;&#1493;&#1508;&#1503; &#1499;&#1500;&#1500;&#1497;, &#1492;&#1508;&#1497;&#1499;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1500;&#1502;&#1511;&#1493;&#1501; &#1513;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1497;&#1512;&#1510;&#1493; &#1500;&#1513;&#1493;&#1489;
&#1488;&#1500;&#1497;&#1493;. &#1496;&#1499;&#1504;&#1497;&#1511;&#1493;&#1514; &#1497;&#1497;&#1506;&#1493;&#1491;&#1497;&#1493;&#1514; &#1500;&#1492;&#1513;&#1490;&#1514; &#1502;&#1496;&#1512;&#1493;&#1514; &#1488;&#1500;&#1493;, &#1497;&#1497;&#1491;&#1493;&#1504;&#1493; &#1489;&#1502;&#1492;&#1500;&#1498; &#1492;&#1502;&#1513;&#1498;
&#1492;&#1505;&#1508;&#1512;.</p><p>&#1500;&#1489;&#1505;&#1493;&#1507;, &#1497;&#1513;&#1504;&#1492; &#1511;&#1489;&#1493;&#1510;&#1514; &#1489;&#1506;&#1497;&#1493;&#1514; &#1499;&#1500;&#1500;&#1497;&#1514; &#1488;&#1513;&#1512; &#1504;&#1497;&#1514;&#1503; &#1500;&#1499;&#1504;&#1493;&#1514; "&#1499;&#1513;&#1500;&#1493;&#1504;&#1493;&#1514; &#1489;&#1504;&#1497;&#1493;&#1493;&#1496;
&#1514;&#1512;&#1489;&#1493;&#1514;&#1497;". &#1500;&#1508;&#1504;&#1497; &#1506;&#1513;&#1512; &#1513;&#1504;&#1497;&#1501;, &#1488;&#1508;&#1497;&#1500;&#1493; &#1495;&#1502;&#1513;, &#1492;&#1497;&#1492; &#1494;&#1492; &#1502;&#1493;&#1511;&#1491;&#1501; &#1500;&#1491;&#1489;&#1512; &#1506;&#1500; &#1514;&#1512;&#1489;&#1493;&#1514; &#1490;&#1500;&#1493;&#1489;&#1500;&#1497;&#1514;
&#1513;&#1500; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;, &#1488;&#1498; &#1500;&#1488; &#1506;&#1493;&#1491;. &#1514;&#1512;&#1489;&#1493;&#1514; &#1499;&#1494;&#1493; &#1492;&#1493;&#1508;&#1497;&#1506; &#1488;&#1496;-&#1488;&#1496;, &#1493;&#1488;&#1507; &#1513;&#1493;&#1493;&#1491;&#1488;&#1497; &#1488;&#1497;&#1504;&#1504;&#1492;
&#1506;&#1510;&#1493;&#1502;&#1492; - &#1488;&#1497;&#1504;&#1504;&#1492; &#1495;&#1505;&#1497;&#1504;&#1492; &#1502;&#1508;&#1504;&#1497; &#1493;&#1497;&#1499;&#1493;&#1495;&#1497;&#1501; &#1493;&#1495;&#1497;&#1500;&#1493;&#1511;&#1497; &#1491;&#1506;&#1493;&#1514;, &#1500;&#1508;&#1495;&#1493;&#1514; &#1499;&#1502;&#1493; &#1514;&#1512;&#1489;&#1493;&#1514;
&#1502;&#1506;&#1493;&#1490;&#1504;&#1514; &#1502;&#1489;&#1495;&#1497;&#1504;&#1492; &#1490;&#1497;&#1488;&#1493;&#1490;&#1512;&#1508;&#1497;&#1514; - &#1497;&#1513; &#1500;&#1492; &#1490;&#1512;&#1506;&#1497;&#1503; &#1491;&#1497; &#1506;&#1511;&#1489;&#1497;. &#1512;&#1489; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495;
&#1492;&#1502;&#1510;&#1500;&#1497;&#1495;&#1497;&#1501;, &#1502;&#1510;&#1497;&#1490;&#1497;&#1501; &#1495;&#1500;&#1511; &#1488;&#1501; &#1500;&#1488; &#1488;&#1514; &#1499;&#1500; &#1492;&#1502;&#1488;&#1508;&#1497;&#1497;&#1504;&#1497;&#1501; &#1513;&#1500; &#1500;&#1497;&#1489;&#1492; &#1494;&#1493;. &#1492;&#1501; &#1502;&#1506;&#1493;&#1491;&#1491;&#1497;&#1501;
&#1492;&#1514;&#1504;&#1492;&#1490;&#1493;&#1497;&#1493;&#1514; &#1502;&#1505;&#1493;&#1497;&#1497;&#1502;&#1493;&#1514; &#1493;&#1502;&#1493;&#1511;&#1497;&#1506;&#1497;&#1501; &#1488;&#1495;&#1512;&#1493;&#1514;. &#1492;&#1501; &#1497;&#1493;&#1510;&#1512;&#1497;&#1501; &#1488;&#1493;&#1493;&#1497;&#1512;&#1492; &#1513;&#1502;&#1506;&#1493;&#1491;&#1491;&#1514; &#1492;&#1513;&#1514;&#1514;&#1508;&#1493;&#1514; &#1500;&#1488;
&#1502;&#1514;&#1493;&#1499;&#1504;&#1504;&#1514;, &#1500;&#1506;&#1497;&#1514;&#1497;&#1501; &#1489;&#1502;&#1495;&#1497;&#1512; &#1514;&#1497;&#1488;&#1493;&#1501; &#1502;&#1512;&#1499;&#1494;&#1497;. &#1497;&#1513; &#1500;&#1492;&#1501; &#1502;&#1493;&#1513;&#1490;&#1497;&#1501; &#1513;&#1500; &#1504;&#1497;&#1502;&#1493;&#1505;&#1497;&#1503; &#1493;&#1495;&#1493;&#1505;&#1512;
&#1504;&#1497;&#1502;&#1493;&#1505;&#1497;&#1503;, &#1488;&#1513;&#1512; &#1506;&#1500;&#1493;&#1500;&#1497;&#1501; &#1500;&#1492;&#1497;&#1493;&#1514; &#1513;&#1493;&#1504;&#1497;&#1501; &#1502;&#1492;&#1493;&#1514;&#1497;&#1514; &#1502;&#1488;&#1500;&#1492; &#1492;&#1502;&#1511;&#1493;&#1489;&#1500;&#1497;&#1501; &#1489;&#1502;&#1511;&#1493;&#1502;&#1493;&#1514; &#1488;&#1495;&#1512;&#1497;&#1501;.
&#1492;&#1495;&#1513;&#1493;&#1489; &#1502;&#1499;&#1500; &#1492;&#1493;&#1488; &#1513;&#1502;&#1513;&#1514;&#1514;&#1508;&#1497;&#1501; &#1489;&#1506;&#1500;&#1497; &#1493;&#1514;&#1511; &#1512;&#1489;, &#1492;&#1508;&#1504;&#1497;&#1502;&#1493; &#1488;&#1514; &#1492;&#1505;&#1496;&#1504;&#1491;&#1512;&#1496;&#1497;&#1501; &#1492;&#1500;&#1500;&#1493; &#1493;&#1497;&#1513;
&#1489;&#1497;&#1504;&#1497;&#1492;&#1501; &#1492;&#1505;&#1499;&#1502;&#1492; &#1512;&#1495;&#1489;&#1492; &#1500;&#1490;&#1489;&#1497; &#1488;&#1493;&#1508;&#1503; &#1492;&#1492;&#1514;&#1504;&#1492;&#1490;&#1493;&#1514; &#1492;&#1512;&#1510;&#1493;&#1497;. &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1499;&#1493;&#1513;&#1500;&#1497;&#1501; &#1500;&#1512;&#1493;&#1489;
&#1505;&#1493;&#1496;&#1497;&#1501; &#1489;&#1489;&#1497;&#1512;&#1493;&#1512; &#1502;&#1500;&#1497;&#1489;&#1492; &#1494;&#1493;, &#1488;&#1493;&#1500;&#1497; &#1488;&#1507; &#1500;&#1488; &#1489;&#1502;&#1514;&#1499;&#1493;&#1493;&#1503;, &#1493;&#1500;&#1506;&#1497;&#1514;&#1497;&#1501; &#1488;&#1508;&#1497;&#1500;&#1493; &#1488;&#1497;&#1503; &#1500;&#1492;&#1501;
&#1492;&#1505;&#1499;&#1502;&#1492; &#1506;&#1500; &#1502;&#1492;&#1497; &#1492;&#1514;&#1504;&#1492;&#1490;&#1493;&#1514; &#1489;&#1512;&#1497;&#1512;&#1514; &#1502;&#1495;&#1491;&#1500; &#1512;&#1510;&#1493;&#1497;&#1492;. &#1508;&#1497;&#1512;&#1493;&#1513; &#1492;&#1491;&#1489;&#1512; &#1492;&#1493;&#1488; &#1513;&#1499;&#1488;&#1513;&#1512; &#1502;&#1493;&#1508;&#1497;&#1506;&#1493;&#1514;
&#1489;&#1506;&#1497;&#1493;&#1514;, &#1492;&#1502;&#1510;&#1489; &#1506;&#1500;&#1493;&#1500; &#1500;&#1492;&#1514;&#1491;&#1512;&#1491;&#1512; &#1489;&#1502;&#1492;&#1512;&#1492;, &#1492;&#1497;&#1493;&#1514; &#1493;&#1500;&#1502;&#1513;&#1514;&#1514;&#1508;&#1497;&#1501; &#1495;&#1505;&#1512; &#1502;&#1506;&#1512;&#1498; &#1514;&#1490;&#1493;&#1489;&#1493;&#1514; &#1514;&#1512;&#1489;&#1493;&#1514;&#1497;
&#1500;&#1492;&#1513;&#1506;&#1503; &#1506;&#1500;&#1497;&#1493;, &#1506;&#1500;-&#1502;&#1504;&#1514; &#1500;&#1508;&#1514;&#1493;&#1512; &#1502;&#1495;&#1500;&#1493;&#1511;&#1493;&#1514;.</p><p>&#1505;&#1508;&#1512; &#1494;&#1492; &#1492;&#1497;&#1504;&#1493; &#1502;&#1491;&#1512;&#1497;&#1498; &#1502;&#1506;&#1513;&#1497;, &#1500;&#1488; &#1502;&#1495;&#1511;&#1512; &#1488;&#1493; &#1505;&#1497;&#1499;&#1493;&#1501; &#1488;&#1504;&#1514;&#1512;&#1493;&#1508;&#1493;&#1500;&#1493;&#1490;&#1497;. &#1500;&#1502;&#1512;&#1493;&#1514;
&#1494;&#1488;&#1514;, &#1497;&#1491;&#1506; &#1502;&#1506;&#1502;&#1497;&#1511; &#1488;&#1493;&#1491;&#1493;&#1514; &#1492;&#1502;&#1511;&#1493;&#1512;&#1493;&#1514; &#1513;&#1500; &#1514;&#1512;&#1489;&#1493;&#1514; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1489;&#1514; &#1494;&#1502;&#1504;&#1504;&#1493;, &#1492;&#1497;&#1504;&#1493;
&#1497;&#1505;&#1493;&#1491; &#1495;&#1497;&#1493;&#1504;&#1497; &#1500;&#1499;&#1500; &#1506;&#1510;&#1492; &#1502;&#1506;&#1513;&#1497;&#1514;. &#1488;&#1491;&#1501; &#1488;&#1513;&#1512; &#1502;&#1489;&#1497;&#1503; &#1488;&#1514; &#1492;&#1514;&#1512;&#1489;&#1493;&#1514; &#1497;&#1499;&#1493;&#1500; &#1500;&#1496;&#1497;&#1497;&#1500; &#1512;&#1495;&#1493;&#1511;
&#1489;&#1504;&#1489;&#1499;&#1497; &#1506;&#1493;&#1500;&#1501; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495;,&#1500;&#1492;&#1514;&#1511;&#1500; &#1489;&#1502;&#1505;&#1508;&#1512; &#1512;&#1489; &#1513;&#1500; &#1504;&#1497;&#1489;&#1497;&#1501; &#1493;&#1502;&#1504;&#1492;&#1490;&#1497;&#1501; &#1502;&#1493;&#1514;&#1488;&#1502;&#1497;&#1501;, &#1493;&#1489;&#1499;&#1500;-&#1494;&#1488;&#1514;
&#1500;&#1492;&#1497;&#1493;&#1514; &#1502;&#1505;&#1493;&#1490;&#1500; &#1500;&#1511;&#1495;&#1514; &#1495;&#1500;&#1511; &#1489;&#1504;&#1493;&#1495;&#1493;&#1514; &#1489;&#1499;&#1500; &#1502;&#1511;&#1493;&#1501;. &#1500;&#1506;&#1493;&#1502;&#1514;&#1493;, &#1488;&#1491;&#1501; &#1513;&#1488;&#1497;&#1504;&#1493; &#1502;&#1489;&#1497;&#1503; &#1488;&#1514; &#1492;&#1514;&#1512;&#1489;&#1493;&#1514;
&#1497;&#1502;&#1510;&#1488; &#1488;&#1514; &#1514;&#1492;&#1500;&#1497;&#1498; &#1488;&#1512;&#1490;&#1493;&#1503; &#1493;&#1492;&#1513;&#1514;&#1514;&#1508;&#1493;&#1514; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1511;&#1513;&#1492; &#1493;&#1502;&#1500;&#1488; &#1492;&#1508;&#1514;&#1506;&#1493;&#1514;. &#1502;&#1488;&#1495;&#1512; &#1493;&#1502;&#1505;&#1508;&#1512;
&#1492;&#1488;&#1504;&#1513;&#1497;&#1501; &#1492;&#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1506;&#1493;&#1491;&#1504;&#1493; &#1490;&#1491;&#1500; &#1489;&#1511;&#1510;&#1489; &#1504;&#1497;&#1499;&#1512;, &#1497;&#1513;&#1504;&#1501; &#1512;&#1489;&#1497;&#1501; &#1489;&#1511;&#1489;&#1493;&#1510;&#1492;
&#1492;&#1513;&#1504;&#1497;&#1492; - &#1488;&#1513;&#1512; &#1489;&#1512;&#1493;&#1489;&#1492; &#1502;&#1492;&#1493;&#1493;&#1492; &#1514;&#1512;&#1489;&#1493;&#1514; &#1513;&#1500; &#1502;&#1492;&#1490;&#1512;&#1497;&#1501; &#1495;&#1491;&#1513;&#1497;&#1501;, &#1493;&#1514;&#1513;&#1488;&#1512; &#1499;&#1494;&#1493; &#1489;&#1502;&#1513;&#1498; &#1494;&#1502;&#1503; &#1502;&#1492;.
&#1488;&#1501; &#1488;&#1514;&#1492; &#1495;&#1493;&#1513;&#1489; &#1513;&#1488;&#1514;&#1492; &#1488;&#1495;&#1491; &#1502;&#1492;&#1501;, &#1492;&#1511;&#1496;&#1506; &#1492;&#1489;&#1488; &#1502;&#1505;&#1508;&#1511; &#1512;&#1511;&#1506; &#1500;&#1491;&#1497;&#1493;&#1504;&#1497;&#1501; &#1488;&#1513;&#1512; &#1514;&#1508;&#1490;&#1493;&#1513; &#1489;&#1492;&#1502;&#1513;&#1498;
&#1489;&#1497;&#1503; &#1488;&#1501; &#1489;&#1505;&#1508;&#1512; &#1494;&#1492;, &#1488;&#1493; &#1489;&#1512;&#1513;&#1514; &#1492;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;. (&#1502;&#1488;&#1497;&#1491;&#1498;, &#1488;&#1501; &#1488;&#1514;&#1492; &#1506;&#1493;&#1489;&#1491; &#1506;&#1501; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495; &#1494;&#1502;&#1503;
&#1502;&#1492;, &#1497;&#1497;&#1514;&#1499;&#1503; &#1493;&#1488;&#1514;&#1492; &#1499;&#1489;&#1512; &#1502;&#1499;&#1497;&#1512; &#1492;&#1512;&#1489;&#1492; &#1502;&#1492;&#1492;&#1497;&#1505;&#1496;&#1493;&#1512;&#1497;&#1492;, &#1493;&#1514;&#1512;&#1510;&#1492; &#1500;&#1491;&#1500;&#1490; &#1500;&#1511;&#1496;&#1506; &#1492;&#1489;&#1488;.)</p></div><div class="sect1" title="&#1492;&#1497;&#1505;&#1496;&#1493;&#1512;&#1497;&#1492;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>&#1492;&#1497;&#1505;&#1496;&#1493;&#1512;&#1497;&#1492;</h2></div></div></div><p>Software sharing has been around as long as software itself.  In
the early days of computers, manufacturers felt that competitive
advantages were to be had mainly in hardware innovation, and therefore
didn't pay much attention to software as a business asset.  Many of
the customers for these early machines were scientists or technicians,
who were able to modify and extend the software shipped with the
machine themselves.  Customers sometimes distributed their patches
back not only to the manufacturer, but to other owners of similar
machines.  The manufacturers often tolerated and even encouraged this:
in their eyes, improvements to the software, from whatever source,
just made the machine more attractive to other potential
customers.</p><p>Although this early period resembled today's free software
culture in many ways, it differed in two crucial respects.  First,
there was as yet little standardization of hardware&#8212;it was a
time of flourishing innovation in computer design, but the diversity
of computing architectures meant that everything was incompatible with
everything else.  Thus, software written for one machine would
generally not work on another.  Programmers tended to acquire
expertise in a particular architecture or family of architectures
(whereas today they would be more likely to acquire expertise in a
programming language or family of languages, confident that their
expertise will be transferable to whatever computing hardware they
happen to find themselves working with).  Because a person's expertise
tended to be specific to one kind of computer, their accumulation of
expertise had the effect of making that computer more attractive to
them and their colleagues.  It was therefore in the manufacturer's
interests for machine-specific code and knowledge to spread as widely
as possible.</p><p>Second, there was no Internet.  Though there were fewer legal
restrictions on sharing than today, there were more technical ones:
the means of getting data from place to place were inconvenient and
cumbersome, relatively speaking.  There were some small, local
networks, good for sharing information among employees at the same
research lab or company.  But there remained barriers to overcome if
one wanted to share with everyone, no matter where they were.  These
barriers <span class="emphasis"><em>were</em></span> overcome in many cases.  Sometimes
different groups made contact with each other independently, sending
disks or tapes through land mail, and sometimes the manufacturers
themselves served as central clearing houses for patches.  It also
helped that many of the early computer developers worked at
universities, where publishing one's knowledge was expected.  But the
physical realities of data transmission meant there was always an
impedance to sharing, an impedance proportional to the distance (real
or organizational) that the software had to travel.  Widespread,
frictionless sharing, as we know it today, was not possible.</p><div class="sect2" title="&#1506;&#1500;&#1497;&#1497;&#1514;&#1503; &#1513;&#1500; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1511;&#1504;&#1497;&#1497;&#1504;&#1497;&#1514; &#1493;&#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514;"><div class="titlepage"><div><div><h3 class="title"><a name="propertization"></a>&#1506;&#1500;&#1497;&#1497;&#1514;&#1503; &#1513;&#1500; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1511;&#1504;&#1497;&#1497;&#1504;&#1497;&#1514; &#1493;&#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514;</h3></div></div></div><p>As the industry matured, several interrelated changes occurred
simultaneously.  The wild diversity of hardware designs gradually gave
way to a few clear winners&#8212;winners through superior technology,
superior marketing, or some combination of the two.  At the same time,
and not entirely coincidentally, the development of so-called "high
level" programming languages meant that one could write a program
once, in one language, and have it automatically translated
("compiled") to run on different kinds of computers.  The implications
of this were not lost on the hardware manufacturers: a customer could
now undertake a major software engineering effort without necessarily
locking themselves into one particular computer architecture.  When
this was combined with the gradual narrowing of performance
differences between various computers, as the less efficient designs
were weeded out, a manufacturer that treated its hardware as its only
asset could look forward to a future of declining profit margins.  Raw
computing power was becoming a fungible good, while software was
becoming the differentiator.  Selling software, or at least treating
it as an integral part of hardware sales, began to look like a good
strategy.</p><p>This meant that manufacturers had to start enforcing the
copyrights on their code more strictly.  If users simply continued to
share and modify code freely among themselves, they might
independently reimplement some of the improvements now being sold as
"added value" by the supplier.  Worse, shared code could get into the
hands of competitors.  The irony is that all this was happening around
the time the Internet was getting off the ground.  Just when truly
unobstructed software sharing was finally becoming technically
possible, changes in the computer business made it economically
undesirable, at least from the point of view of any single company.
The suppliers clamped down, either denying users access to the code
that ran their machines, or insisting on non-disclosure agreements
that made effective sharing impossible.</p><div class="sect3" title="Conscious resistance"><div class="titlepage"><div><div><h4 class="title"><a name="history-conscious-resistance"></a>Conscious resistance</h4></div></div></div><p>As the world of unrestricted code swapping slowly faded away, a
counterreaction crystallized in the mind of at least one programmer.
Richard Stallman worked in the Artificial Intelligence Lab at the
Massachusetts Institute of Technology in the 1970s and early '80s,
during what turned out to be a golden age and a golden location for
code sharing.  The AI Lab had a strong "hacker
ethic",<sup>[<a name="idp5385216" href="#ftn.idp5385216" class="footnote">3</a>]</sup> and people were not only encouraged but
expected to share whatever improvements they made to the system.  As
Stallman wrote later:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>We did not call our software "free software",
      because that term did not yet exist; but that is what it was.
      Whenever people from another university or a company wanted to
      port and use a program, we gladly let them.  If you saw someone
      using an unfamiliar and interesting program, you could always
      ask to see the source code, so that you could read it, change
      it, or cannibalize parts of it to make a new program.
      </em></span></p><p>(from <span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.html" target="_top">http://www.gnu.org/gnu/thegnuproject.html</a></strong></span>)</p></blockquote></div><p>This Edenic community collapsed around Stallman shortly after
1980, when the changes that had been happening in the rest of the
industry finally caught up with the AI Lab.  A startup company hired
away many of the Lab's programmers to work on an operating system
similar to what they had been working on at the Lab, only now under an
exclusive license.  At the same time, the AI Lab acquired new
equipment that came with a proprietary operating system.</p><p>Stallman saw the larger pattern in what was happening:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>The modern computers of the era, such as the VAX
      or the 68020, had their own operating systems, but none of them
      were free software: you had to sign a nondisclosure agreement
      even to get an executable copy.</em></span> </p><p><span class="emphasis"><em>This meant that the first step in using a
      computer was to promise not to help your neighbor. A cooperating
      community was forbidden. The rule made by the owners of
      proprietary software was, "If you share with your neighbor, you
      are a pirate. If you want any changes, beg us to make them."
      </em></span> </p></blockquote></div><p>By some quirk of personality, he decided to resist the trend.
Instead of continuing to work at the now-decimated AI Lab, or taking a
job writing code at one of the new companies, where the results of his
work would be kept locked in a box, he resigned from the Lab and
started the GNU Project and the Free Software Foundation (FSF).  The
goal of GNU<sup>[<a name="idp5392896" href="#ftn.idp5392896" class="footnote">4</a>]</sup> was to develop a completely free and open
computer operating system and body of application software, in which
users would never be prevented from hacking or from sharing their
modifications.  He was, in essence, setting out to recreate what had
been destroyed at the AI Lab, but on a world-wide scale and without
the vulnerabilities that had made the AI Lab's culture susceptible to
disintegration.</p><p>In addition to working on the new operating system, Stallman
devised a copyright license whose terms guaranteed that his code would
be perpetually free.  The GNU General Public License (GPL) is a clever
piece of legal judo: it says that the code may be copied and modified
without restriction, and that both copies and derivative works (i.e.,
modified versions) must be distributed under the same license as the
original, with no additional restrictions.  In effect, it uses
copyright law to achieve an effect opposite to that of traditional
copyright: instead of limiting the software's distribution, it
prevents <span class="emphasis"><em>anyone</em></span>, even the author, from limiting
it.  For Stallman, this was better than simply putting his code into
the public domain.  If it were in the public domain, any particular
copy of it could be incorporated into a proprietary program (as has
also been known to happen to code under permissive copyright
licenses).  While such incorporation wouldn't in any way diminish the
original code's continued availability, it would have meant that
Stallman's efforts could benefit the enemy&#8212;proprietary software.
The GPL can be thought of as a form of protectionism for free
software, because it prevents non-free software from taking full
advantage of GPLed code.  The GPL and its relationship to other free
software licenses are discussed in detail in
<a class="xref" href="legal.html" title="&#1508;&#1512;&#1511; 9. Licenses, Copyrights, and Patents">&#1508;&#1512;&#1511; 9, <i>Licenses, Copyrights, and Patents</i></a>.</p><p>With the help of many programmers, some of whom shared
Stallman's ideology and some of whom simply wanted to see a lot of
free code available, the GNU Project began releasing free replacements
for many of the most critical components of an operating system.
Because of the now-widespread standardization in computer hardware and
software, it was possible to use the GNU replacements on otherwise
non-free systems, and many people did.  The GNU text editor (Emacs)
and C compiler (GCC) were particularly successful, gaining large and
loyal followings not on ideological grounds, but simply on their
technical merits.  By about 1990, GNU had produced most of a free
operating system, except for the kernel&#8212;the part that the
machine actually boots up, and that is responsible for managing memory,
disk, and other system resources.</p><p>Unfortunately, the GNU project had chosen a kernel design that
turned out to be harder to implement than expected.  The ensuing delay
prevented the Free Software Foundation from making the first release
of an entirely free operating system.  The final piece was put into
place instead by Linus Torvalds, a Finnish computer science student
who, with the help of volunteers around the world, had completed a
free kernel using a more conservative design.  He named it Linux, and
when it was combined with the existing GNU programs, the result was a
completely free operating system.  For the first time, you could boot
up your computer and do work without using any proprietary
software.<sup>[<a name="idp5397472" href="#ftn.idp5397472" class="footnote">5</a>]</sup></p><p>Much of the software on this new operating system was not
produced by the GNU project.  In fact, GNU wasn't even the only group
working on producing a free operating system (for example, the code
that eventually became NetBSD and FreeBSD was already under
development by this time).  The importance of the Free Software
Foundation was not only in the code they wrote, but in their political
rhetoric.  By talking about free software as a cause instead of a
convenience, they made it difficult for
programmers <span class="emphasis"><em>not</em></span> to have a political consciousness
about it.  Even those who disagreed with the FSF had to engage the
issue, if only to stake out a different position.  The FSF's
effectiveness as propagandists lay in tying their code to a message,
by means of the GPL and other texts.  As their code spread widely,
that message spread as well.</p></div><div class="sect3" title="Accidental resistance"><div class="titlepage"><div><div><h4 class="title"><a name="history-accidental-resistance"></a>Accidental resistance</h4></div></div></div><p>There were many other things going on in the nascent free
software scene, however, and few were as explictly ideological as
Stallman's GNU Project.  One of the most important was
the <em class="firstterm">Berkeley Software Distribution</em>
(<em class="firstterm">BSD</em>), a gradual re-implementation of the Unix
operating system&#8212;which up until the late 1970's had been a
loosely proprietary research project at AT&amp;T&#8212;by programmers
at the University of California at Berkeley.  The BSD group did not
make any overt political statements about the need for programmers to
band together and share with one another, but they
<span class="emphasis"><em>practiced</em></span> the idea with flair and
enthusiasm, by coordinating a massive distributed development effort
in which the Unix command-line utilities and code libraries, and
eventually the operating system kernel itself, were rewritten from
scratch mostly by volunteers.  The BSD project became a prime example
of non-ideological free software development, and also served as a
training ground for many developers who would go on to remain active
in the open source world.</p><p>Another crucible of cooperative development was the <em class="firstterm">X
Window System</em>, a free, network-transparent graphical
computing environment, developed at MIT in the mid-1980's in
partnership with hardware vendors who had a common interest in being
able to offer their customers a windowing system.  Far from opposing
proprietary software, the X license deliberately allowed proprietary
extensions on top of the free core&#8212;each member of the consortium
wanted the chance to enhance the default X distribution, and thereby
gain a competitive advantage over the other members.  X
Windows<sup>[<a name="idp5397936" href="#ftn.idp5397936" class="footnote">6</a>]</sup> itself was free
software, but mainly as a way to level the playing field between
competing business interests, not out of some desire to end the
dominance of proprietary software.  Yet another example, predating the
GNU project by a few years, was TeX, Donald Knuth's free,
publishing-quality typesetting system.  He released it under a license
that allowed anyone to modify and distribute the code, but not to call
the result "TeX" unless it passed a very strict set of compatibility
tests (this is an example of the "trademark-protecting" class of free
licenses, discussed more in <a class="xref" href="legal.html" title="&#1508;&#1512;&#1511; 9. Licenses, Copyrights, and Patents">&#1508;&#1512;&#1511; 9, <i>Licenses, Copyrights, and Patents</i></a>).  Knuth wasn't
taking a stand one way or the other on the question of
free-versus-proprietary software, he just needed a better typesetting
system in order to complete his
<span class="emphasis"><em>real</em></span> goal&#8212;a book on computer
programming&#8212;and saw no reason not to release his system to the
world when done.</p></div><p>Without listing every project and every license, it's safe to
say that by the late 1980's, there was a lot of free software
available under a wide variety of licenses.  The diversity of licenses
reflected a corresponding diversity of motivations.  Even some of the
progammers who chose the GNU GPL were much less ideologically driven
than the GNU project itself.  Although they enjoyed working on free
software, many developers did not consider proprietary software a
social evil.  There were people who felt a moral impulse to rid the
world of "software hoarding" (Stallman's term for non-free software),
but others were motivated more by technical excitement, or by the
pleasure of working with like-minded collaborators, or even by a
simple human desire for glory.  Yet by and large these disparate
motivations did not interact in destructive ways.  This is partly
because software, unlike other creative forms like prose or the visual
arts, must pass semi-objective tests in order to be considered
successful: it must run, and be reasonably free of bugs.  This gives
all participants in a project a kind of automatic common ground, a
reason and a framework for working together without worrying too much
about qualifications beyond the technical.</p><p>Developers had another reason to stick together as well: it
turned out that the free software world was producing some very
high-quality code.  In some cases, it was demonstrably technically
superior to the nearest non-free alternative; in others, it was at
least comparable, and of course it always cost less.  While only a few
people might have been motivated to run free software on strictly
philosophical grounds, a great many people were happy to run it
because it did a better job.  And of those who used it, some
percentage were always willing to donate their time and skills to help
maintain and improve the software.</p><p>This tendency to produce good code was certainly not universal,
but it was happening with increasing frequency in free software
projects around the world.  Businesses that depended heavily on
software gradually began to take notice.  Many of them discovered that
they were already using free software in day-to-day operations, and
simply hadn't known it (upper management isn't always aware of
everything the IT department does).  Corporations began to take a more
active and public role in free software projects, contributing time
and equipment, and sometimes even directly funding the development of
free programs.  Such investments could, in the best scenarios, repay
themselves many times over.  The sponsor only pays a small number of
expert programmers to devote themselves to the project full time, but
reaps the benefits of <span class="emphasis"><em>everyone's</em></span> contributions,
including work from unpaid volunteers and from programmers being paid
by other corporations.</p></div><div class="sect2" title='"&#1495;&#1493;&#1508;&#1513;&#1497;" &#1500;&#1506;&#1493;&#1502;&#1514; "&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"'><div class="titlepage"><div><div><h3 class="title"><a name="free-vs-open-source"></a>"&#1495;&#1493;&#1508;&#1513;&#1497;" &#1500;&#1506;&#1493;&#1502;&#1514; "&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"</h3></div></div></div><p>As the corporate world gave more and more attention to free
software, programmers were faced with new issues of presentation.  One
was the word "free" itself.  On first hearing the term "free software"
many people mistakenly think it means just "zero-cost software."  It's
true that all free software is zero-cost,<sup>[<a name="idp5416048" href="#ftn.idp5416048" class="footnote">7</a>]</sup>
but not all zero-cost software is free.  For example, during the
battle of the browsers in the 1990s, both Netscape and Microsoft gave
away their competing web browsers at no charge, in a scramble to gain
market share.  Neither browser was free in the "free software" sense.
You couldn't get the source code, and even if you could, you didn't
have the right to modify or redistribute it.<sup>[<a name="idp5417168" href="#ftn.idp5417168" class="footnote">8</a>]</sup>  The only thing
you could do was download an executable and run it.  The browsers were
no more free than shrink-wrapped software bought in a store; they
merely had a lower price.</p><p>This confusion over the word "free" is due entirely to an
unfortunate ambiguity in the English language.  Most other tongues
distinguish low prices from liberty (the distinction between
<span class="emphasis"><em>gratis</em></span> and <span class="emphasis"><em>libre</em></span> is
immediately clear to speakers of Romance languages, for example).  But
English's position as the de facto bridge language of the Internet
means that a problem with English is, to some degree, a problem for
everyone.  The misunderstanding around the word "free" was so
prevalent that free software programmers eventually evolved a standard
formula in response: "It's <span class="emphasis"><em>free</em></span> as in
<span class="emphasis"><em>freedom</em></span>&#8212;think <span class="emphasis"><em>free
speech</em></span>, not <span class="emphasis"><em>free beer</em></span>."  Still, having
to explain it over and over is tiring.  Many programmers felt, with
some justification, that the ambiguous word "free" was hampering the
public's understanding of this software.</p><p>But the problem went deeper than that.  The word "free" carried
with it an inescapable moral connotation: if freedom was an end in
itself, it didn't matter whether free software also happened to
be better, or more profitable for certain businesses in certain
circumstances.  Those were merely pleasant side effects of a motive
that was, at bottom, neither technical nor mercantile, but moral.
Furthermore, the "free as in freedom" position forced a glaring
inconsistency on corporations who wanted to support particular free
programs in one aspect of their business, but continue marketing
proprietary software in others.</p><p>These dilemmas came to a community that was already poised for
an identity crisis.  The programmers who actually
<span class="emphasis"><em>write</em></span> free software have never been of one mind
about the overall goal, if any, of the free software movement.  Even
to say that opinions run from one extreme to the other would be
misleading, in that it would falsely imply a linear range where there
is instead a multidimensional scattering.  However, two broad
categories of belief can be distinguished, if we are willing to ignore
subtleties for the moment.  One group takes Stallman's view, that the
freedom to share and modify is the most important thing, and that
therefore if you stop talking about freedom, you've left out the core
issue.  Others feel that the software itself is the most important
argument in its favor, and are uncomfortable with proclaiming
proprietary software inherently bad.  Some, but not all, free
software programmers believe that the author (or employer, in the case
of paid work)
<span class="emphasis"><em>should</em></span> have the right to control the terms of
distribution, and that no moral judgement need be attached to the
choice of particular terms.</p><p>For a long time, these differences did not need to be carefully
examined or articulated, but free software's burgeoning success in the
business world made the issue unavoidable.  In 1998, the term
<em class="firstterm">open source</em> was created as an alternative
to "free", by a coalition of programmers who eventually became The
Open Source Initiative (OSI).<sup>[<a name="idp5426704" href="#ftn.idp5426704" class="footnote">9</a>]</sup>  The OSI felt
not only that "free software" was potentially confusing, but that the
word "free" was just one symptom of a general problem: that the
movement needed a marketing program to pitch it to the corporate
world, and that talk of morals and the social benefits of sharing
would never fly in corporate boardrooms.  In their own words:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>The Open Source Initiative is a marketing
      program for free software. It's a pitch for "free software" on
      solid pragmatic grounds rather than ideological
      tub-thumping. The winning substance has not changed, the losing
      attitude and symbolism have. ...</em></span></p><p><span class="emphasis"><em>The case that needs to be made to most techies
      isn't about the concept of open source, but the name. Why not
      call it, as we traditionally have, free software?</em></span></p><p><span class="emphasis"><em>One direct reason is that the term "free
      software" is easily misunderstood in ways that lead to
      conflict. ...</em></span></p><p><span class="emphasis"><em>But the real reason for the re-labeling is a
      marketing one. We're trying to pitch our concept to the
      corporate world now. We have a winning product, but our
      positioning, in the past, has been awful. The term "free
      software" has been misunderstood by business persons, who
      mistake the desire to share with anti-commercialism, or worse,
      theft.</em></span></p><p><span class="emphasis"><em>Mainstream corporate CEOs and CTOs will never
      buy "free software." But if we take the very same tradition, the
      same people, and the same free-software licenses and change the
      label to "open source" ? that, they'll buy.</em></span></p><p><span class="emphasis"><em>Some hackers find this hard to believe, but
      that's because they're techies who think in concrete,
      substantial terms and don't understand how important image is
      when you're selling something.</em></span></p><p><span class="emphasis"><em>In marketing, appearance is reality. The
      appearance that we're willing to climb down off the barricades
      and work with the corporate world counts for as much as the
      reality of our behavior, our convictions, and our
      software.</em></span></p><p>(from <span class="bold"><strong><a class="ulink" href="http://www.opensource.org/advocacy/faq.php" target="_top">http://www.opensource.org/advocacy/faq.php</a></strong></span>
      and <span class="bold"><strong><a class="ulink" href="http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a></strong></span>)</p></blockquote></div><p>The tips of many icebergs of controversy are visible in that
text.  It refers to "our convictions", but smartly avoids spelling out
exactly what those convictions are.  For some, it might be the
conviction that code developed according to an open process will be
better code; for others, it might be the conviction that all
information should be shared.  There's the use of the word "theft" to
refer (presumably) to illegal copying&#8212;a usage that many object
to, on the grounds that it's not theft if the original possessor still
has the item afterwards.  There's the tantalizing hint that the free
software movement might be mistakenly accused of anti-commercialism,
but it leaves carefully unexamined the question of whether such an
accusation would have any basis in fact.</p><p>None of which is to say that the OSI's web site is inconsistent
or misleading.  It's not.  Rather, it is an example of exactly what
the OSI claims had been missing from the free software movement: good
marketing, where "good" means "viable in the business world."  The
Open Source Initiative gave a lot of people exactly what they had been
looking for&#8212;a vocabulary for talking about free software as a
development methodology and business strategy, instead of as a moral
crusade.</p></div><p>The appearance of the Open Source Initiative changed the
landscape of free software.  It formalized a dichotomy that had long
been unnamed, and in doing so forced the movement to acknowledge that
it had internal politics as well as external.  The effect today is
that both sides have had to find common ground, since most projects
include programmers from both camps, as well as participants who don't
fit any clear category.  This doesn't mean people never talk about
moral motivations&#8212;lapses in the traditional "hacker ethic" are
sometimes called out, for example.  But it is rare for a free software
/ open source developer to openly question the basic motivations of
others in a project.  The contribution trumps the contributor.  If
someone writes good code, you don't ask them whether they do it for
moral reasons, or because their employer paid them to, or because
they're building up their resumé, or whatever.  You evaluate
the contribution on technical grounds, and respond on technical
grounds.  Even explicitly political organizations like the Debian
project, whose goal is to offer a 100% free (that is, "free as in
freedom") computing environment, are fairly relaxed about integrating
with non-free code and cooperating with programmers who don't share
exactly the same goals.</p></div><div class="footnotes"><br><hr width="100" align="right"><div class="footnote"><p><sup>[<a id="ftn.idp5292624" href="#idp5292624" class="para">2</a>] </sup>SourceForge.net, &#1488;&#1514;&#1512; &#1488;&#1497;&#1512;&#1493;&#1495; &#1508;&#1493;&#1508;&#1493;&#1500;&#1512;&#1497;, &#1492;&#1499;&#1497;&#1500;
79,225 &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1512;&#1513;&#1493;&#1502;&#1497;&#1501; &#1489;&#1488;&#1502;&#1510;&#1506; &#1488;&#1508;&#1512;&#1497;&#1500; 2004. &#1502;&#1505;&#1508;&#1512; &#1494;&#1492; &#1499;&#1502;&#1493;&#1489;&#1503; &#1499;&#1500;&#1500; &#1500;&#1488;
&#1511;&#1512;&#1493;&#1489; &#1500;&#1499;&#1502;&#1493;&#1514; &#1492;&#1499;&#1493;&#1500;&#1500;&#1514; &#1513;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1489;&#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;; &#1494;&#1492; &#1512;&#1511; &#1502;&#1505;&#1508;&#1512;&#1501;
&#1513;&#1500; &#1488;&#1500;&#1492; &#1513;&#1489;&#1495;&#1512;&#1493; &#1500;&#1492;&#1513;&#1514;&#1502;&#1513; &#1489; SourceForge.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5385216" href="#idp5385216" class="para">3</a>] </sup>Stallman uses the word "hacker" in the sense of
"someone who loves to program and enjoys being clever about it," not
the relatively new meaning of "someone who breaks into
computers."</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5392896" href="#idp5392896" class="para">4</a>] </sup>It stands for "GNU's Not Unix", and the
"GNU" in that expansion stands for...the same
thing.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5397472" href="#idp5397472" class="para">5</a>] </sup>Technically, Linux was not the first.  A free
operating system for IBM-compatible computers, called 386BSD, had come
out shortly before Linux.  However, it was a lot harder to get 386BSD
up and running.  Linux made such a splash not only because it was
free, but because it actually had a high chance of booting your
computer when you installed it.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5397936" href="#idp5397936" class="para">6</a>] </sup>They prefer it to be called the "X Window
System", but in practice, people usually call it "X Windows", because
three words is just too cumbersome.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5416048" href="#idp5416048" class="para">7</a>] </sup>One may charge
a fee for giving out copies of free software, but since one cannot
stop the recipients from offering it at no charge afterwards, the
price is effectively driven to zero immediately.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5417168" href="#idp5417168" class="para">8</a>] </sup>The source
code to Netscape Navigator
<span class="emphasis"><em>was</em></span> eventually released under an open source
license, in 1998, and became the foundation for the Mozilla web
browser.  See <a class="ulink" href="http://www.mozilla.org/" target="_top">http://www.mozilla.org/</a>.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5426704" href="#idp5426704" class="para">9</a>] </sup>OSI's web home is <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="disclaimer.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><td width="20%" align="center"> </td><td width="40%" align="left"> <a accesskey="n" href="today.html">&#1492;&#1489;&#1488;</a></td></tr><tr><td width="40%" align="right" valign="top">&#1492;&#1505;&#1512;&#1514; &#1488;&#1495;&#1512;&#1497;&#1493;&#1514; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1512;&#1488;&#1513;&#1497;</a></td><td width="40%" align="left" valign="top"> &#1492;&#1502;&#1510;&#1489; &#1492;&#1497;&#1493;&#1501;</td></tr></table></div></body></html>
