<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1502;&#1489;&#1493;&#1488;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="up" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="prev" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="next" href="audience.html" title="&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1502;&#1489;&#1493;&#1488;</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="index.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><th width="60%" align="center"> </th><td width="20%" align="left"> <a accesskey="n" href="audience.html">&#1492;&#1489;&#1488;</a></td></tr></table><hr></div><div class="preface" title="&#1502;&#1489;&#1493;&#1488;"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>&#1502;&#1489;&#1493;&#1488;</h2></div></div></div><div class="toc"><p><b>&#1514;&#1493;&#1499;&#1503; &#1492;&#1506;&#1504;&#1497;&#1497;&#1504;&#1497;&#1501;</b></p><dl><dt><span class="sect1"><a href="preface.html#why">&#1500;&#1502;&#1492; &#1500;&#1499;&#1514;&#1493;&#1489; &#1488;&#1514; &#1492;&#1505;&#1508;&#1512; &#1492;&#1494;&#1492;?</a></span></dt><dt><span class="sect1"><a href="audience.html">&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?</a></span></dt><dt><span class="sect1"><a href="sources.html">&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">&#1514;&#1493;&#1491;&#1493;&#1514;</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">&#1492;&#1505;&#1512;&#1514; &#1488;&#1495;&#1512;&#1497;&#1493;&#1514;</a></span></dt></dl></div><div class="sect1" title="&#1500;&#1502;&#1492; &#1500;&#1499;&#1514;&#1493;&#1489; &#1488;&#1514; &#1492;&#1505;&#1508;&#1512; &#1492;&#1494;&#1492;?"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>&#1500;&#1502;&#1492; &#1500;&#1499;&#1514;&#1493;&#1489; &#1488;&#1514; &#1492;&#1505;&#1508;&#1512; &#1492;&#1494;&#1492;?</h2></div></div></div><p>&#1489;&#1502;&#1505;&#1497;&#1489;&#1493;&#1514;, &#1488;&#1497;&#1504;&#1504;&#1497; &#1502;&#1511;&#1489;&#1500; &#1506;&#1493;&#1491; &#1488;&#1514; &#1488;&#1493;&#1514;&#1501; &#1502;&#1489;&#1496;&#1497;&#1501; &#1512;&#1497;&#1511;&#1497;&#1501; &#1499;&#1488;&#1513;&#1512; &#1488;&#1504;&#1497; &#1502;&#1505;&#1508;&#1512;
&#1500;&#1488;&#1504;&#1513;&#1497;&#1501; &#1513;&#1488;&#1504;&#1497; &#1499;&#1493;&#1514;&#1489; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;. "&#1492;&#1493;, &#1499;&#1503;, &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;&#8212;&#1499;&#1502;&#1493; &#1500;&#1497;&#1504;&#1493;&#1511;&#1505;?"
&#1492;&#1501; &#1506;&#1493;&#1504;&#1497;&#1501;. &#1488;&#1504;&#1497; &#1502;&#1504;&#1497;&#1491; &#1489;&#1512;&#1488;&#1513;&#1497; &#1489;&#1492;&#1514;&#1500;&#1492;&#1489;&#1493;&#1514; &#1500;&#1492;&#1505;&#1499;&#1502;&#1492;. "&#1499;&#1503;, &#1489;&#1491;&#1497;&#1493;&#1511;! &#1494;&#1492; &#1502;&#1492; &#1513;&#1488;&#1504;&#1497;
&#1506;&#1493;&#1513;&#1492;." &#1494;&#1492; &#1504;&#1495;&#1502;&#1491; &#1500;&#1488; &#1500;&#1492;&#1497;&#1493;&#1514; &#1497;&#1493;&#1514;&#1512; &#1489;&#1513;&#1493;&#1500;&#1497;&#1497;&#1501;. &#1489;&#1506;&#1489;&#1512;, &#1492;&#1513;&#1488;&#1500;&#1492; &#1492;&#1489;&#1488;&#1492; &#1492;&#1497;&#1514;&#1492; &#1489;&#1491;&#1512;&#1498;-&#1499;&#1500;&#1500;
&#1510;&#1508;&#1493;&#1497;&#1492; &#1497;&#1495;&#1505;&#1497;&#1514;: "&#1499;&#1497;&#1510;&#1491; &#1488;&#1514;&#1492; &#1506;&#1493;&#1513;&#1492; &#1502;&#1494;&#1492; &#1499;&#1505;&#1507;?" &#1489;&#1514;&#1513;&#1493;&#1489;&#1492;, &#1492;&#1497;&#1497;&#1514;&#1497; &#1502;&#1505;&#1499;&#1501; &#1488;&#1514; &#1492;&#1499;&#1500;&#1499;&#1500;&#1492;
&#1513;&#1500; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495;: &#1497;&#1513;&#1504;&#1501; &#1488;&#1512;&#1490;&#1493;&#1504;&#1497;&#1501; &#1488;&#1513;&#1512; &#1502;&#1506;&#1493;&#1504;&#1497;&#1497;&#1504;&#1501; &#1513;&#1514;&#1493;&#1499;&#1504;&#1492; &#1502;&#1505;&#1493;&#1497;&#1497;&#1502;&#1514; &#1514;&#1514;&#1511;&#1497;&#1497;&#1501;, &#1488;&#1498;
&#1492;&#1501; &#1488;&#1497;&#1504;&#1501; &#1510;&#1512;&#1497;&#1499;&#1497;&#1501; &#1500;&#1502;&#1499;&#1493;&#1512; &#1506;&#1493;&#1514;&#1511;&#1497;&#1501; &#1513;&#1500;&#1492;, &#1488;&#1500;&#1488; &#1512;&#1511; &#1500;&#1491;&#1488;&#1493;&#1490; &#1500;&#1499;&#1498; &#1513;&#1514;&#1492;&#1497;&#1492; &#1494;&#1502;&#1497;&#1504;&#1492; &#1493;&#1502;&#1514;&#1493;&#1495;&#1494;&#1511;&#1514;,
&#1499;&#1499;&#1500;&#1497; &#1493;&#1500;&#1488; &#1499;&#1502;&#1510;&#1512;&#1498;.</p><p>&#1506;&#1501; &#1494;&#1488;&#1514;, &#1500;&#1488;&#1495;&#1512;&#1493;&#1504;&#1492;, &#1492;&#1513;&#1488;&#1500;&#1492; &#1492;&#1489;&#1488;&#1492; &#1488;&#1497;&#1504;&#1504;&#1492; &#1514;&#1502;&#1497;&#1491; &#1504;&#1493;&#1490;&#1506;&#1514; &#1500;&#1499;&#1505;&#1507;. &#1492;&#1508;&#1503; &#1492;&#1506;&#1497;&#1505;&#1511;&#1497;
&#1513;&#1500; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;<sup>[<a name="idp149104" href="#ftn.idp149104" class="footnote">1</a>]</sup> &#1499;&#1489;&#1512; &#1488;&#1497;&#1504;&#1504;&#1493;
&#1502;&#1505;&#1514;&#1493;&#1512;&#1497; &#1499;&#1500;-&#1499;&#1498;, &#1493;&#1512;&#1489;&#1497;&#1501; &#1513;&#1488;&#1497;&#1504;&#1501; &#1514;&#1499;&#1504;&#1514;&#1497;&#1501; &#1499;&#1489;&#1512; &#1502;&#1489;&#1497;&#1504;&#1497;&#1501;&#8212;&#1488;&#1493; &#1500;&#1508;&#1495;&#1493;&#1514; &#1488;&#1497;&#1504;&#1501;
&#1502;&#1493;&#1508;&#1514;&#1506;&#1497;&#1501;&#8212;&#1513;&#1497;&#1513;&#1504;&#1501; &#1488;&#1504;&#1513;&#1497;&#1501; &#1492;&#1502;&#1493;&#1506;&#1505;&#1511;&#1497;&#1501; &#1489;&#1494;&#1492; &#1489;&#1502;&#1513;&#1512;&#1492; &#1502;&#1500;&#1488;&#1492;. &#1489;&#1502;&#1511;&#1493;&#1501; &#1494;&#1488;&#1514;, &#1497;&#1493;&#1514;&#1512;
&#1493;&#1497;&#1493;&#1514;&#1512; &#1506;&#1493;&#1500;&#1492; &#1492;&#1513;&#1488;&#1500;&#1492; "<span class="emphasis"><em>&#1514;&#1490;&#1497;&#1491;, &#1488;&#1497;&#1498; &#1489;&#1491;&#1497;&#1493;&#1511; &#1494;&#1492; &#1506;&#1493;&#1489;&#1491;?</em></span>"</p><p>&#1500;&#1488; &#1492;&#1497;&#1514;&#1492; &#1500;&#1497; &#1514;&#1513;&#1493;&#1489;&#1492; &#1502;&#1513;&#1489;&#1497;&#1506;&#1514; &#1512;&#1510;&#1493;&#1503; &#1502;&#1493;&#1499;&#1504;&#1492;, &#1493;&#1499;&#1499;&#1500; &#1513;&#1492;&#1514;&#1488;&#1502;&#1510;&#1514;&#1497; &#1500;&#1502;&#1510;&#1493;&#1488; &#1488;&#1495;&#1514;,
&#1492;&#1489;&#1504;&#1514;&#1497; &#1506;&#1491; &#1499;&#1502;&#1492; &#1492;&#1504;&#1493;&#1513;&#1488; &#1492;&#1494;&#1492; &#1489;&#1488;&#1502;&#1514; &#1502;&#1493;&#1512;&#1499;&#1489;. &#1504;&#1497;&#1492;&#1493;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1488;&#1497;&#1504;&#1493;
&#1489;&#1491;&#1497;&#1493;&#1511; &#1499;&#1502;&#1493; &#1504;&#1497;&#1492;&#1493;&#1500; &#1506;&#1505;&#1511; (&#1504;&#1505;&#1493; &#1500;&#1491;&#1502;&#1497;&#1497;&#1503; &#1510;&#1493;&#1512;&#1498; &#1489;&#1491;&#1497;&#1493;&#1503; &#1502;&#1514;&#1502;&#1497;&#1491; &#1506;&#1500; &#1488;&#1493;&#1508;&#1497; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1513;&#1500;&#1499;&#1501;
&#1506;&#1501; &#1511;&#1489;&#1493;&#1510;&#1514; &#1502;&#1514;&#1504;&#1491;&#1489;&#1497;&#1501;, &#1488;&#1513;&#1512; &#1488;&#1514; &#1512;&#1493;&#1489;&#1501; &#1502;&#1506;&#1493;&#1500;&#1501; &#1500;&#1488; &#1508;&#1490;&#1513;&#1514;&#1501;!). &#1499;&#1502;&#1493;-&#1499;&#1503;, &#1502;&#1502;&#1490;&#1493;&#1493;&#1503; &#1496;&#1506;&#1502;&#1497;&#1501;,
&#1488;&#1497;&#1503; &#1494;&#1492; &#1491;&#1493;&#1502;&#1492; &#1500;&#1504;&#1497;&#1492;&#1493;&#1500; &#1488;&#1512;&#1490;&#1493;&#1503; &#1500;&#1500;&#1488; &#1499;&#1493;&#1493;&#1504;&#1514; &#1512;&#1493;&#1493;&#1495; &#1502;&#1505;&#1493;&#1512;&#1514;&#1497;, &#1488;&#1493; &#1502;&#1502;&#1513;&#1500;&#1492;. &#1500;&#1499;&#1500; &#1488;&#1500;&#1492; &#1497;&#1513;&#1504;&#1503;
&#1504;&#1511;&#1493;&#1491;&#1493;&#1514; &#1491;&#1502;&#1497;&#1493;&#1503; &#1500;&#1504;&#1497;&#1492;&#1493;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;, &#1488;&#1498; &#1488;&#1496; &#1488;&#1496; &#1492;&#1490;&#1506;&#1514;&#1497; &#1500;&#1502;&#1505;&#1511;&#1504;&#1492; &#1513;&#1514;&#1493;&#1499;&#1504;&#1492;
&#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1492;&#1497;&#1488; <span class="foreignphrase"><em class="foreignphrase">&#1497;&#1495;&#1497;&#1491;&#1492; &#1489;&#1502;&#1497;&#1504;&#1492;</em></span>. &#1511;&#1497;&#1497;&#1501; &#1502;&#1490;&#1493;&#1493;&#1503; &#1512;&#1495;&#1489;
&#1513;&#1500; &#1491;&#1489;&#1512;&#1497;&#1501; &#1502;&#1493;&#1500;&#1501; &#1504;&#1497;&#1514;&#1503; &#1500;&#1492;&#1513;&#1493;&#1493;&#1514; &#1504;&#1497;&#1492;&#1493;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1513;&#1500; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;, &#1488;&#1498; &#1500;&#1488; &#1488;&#1495;&#1491;
&#1502;&#1492;&#1501; &#1497;&#1492;&#1493;&#1493;&#1492; &#1492;&#1514;&#1488;&#1502;&#1492; &#1502;&#1491;&#1493;&#1497;&#1497;&#1511;&#1514;. &#1500;&#1502;&#1506;&#1513;&#1492;, &#1488;&#1508;&#1497;&#1500;&#1493; &#1492;&#1492;&#1504;&#1495;&#1492; &#1513;&#1504;&#1497;&#1514;&#1503; "&#1500;&#1504;&#1492;&#1500;" &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501;
&#1513;&#1500; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1492;&#1497;&#1504;&#1492; &#1489;&#1506;&#1497;&#1497;&#1514;&#1497;&#1514;. &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1504;&#1497;&#1514;&#1503; <span class="emphasis"><em>&#1500;&#1497;&#1494;&#1493;&#1501;</em></span>,
&#1493;&#1499;&#1502;&#1493;-&#1499;&#1503;, &#1489;&#1506;&#1500;&#1497; &#1506;&#1504;&#1497;&#1497;&#1503; &#1497;&#1499;&#1493;&#1500;&#1497;&#1501; &#1500;&#1492;&#1513;&#1508;&#1497;&#1506; &#1506;&#1500;&#1497;&#1493;, &#1500;&#1506;&#1497;&#1514;&#1497;&#1501; &#1489;&#1510;&#1493;&#1512;&#1492; &#1502;&#1488;&#1491; &#1502;&#1513;&#1502;&#1506;&#1493;&#1514;&#1497;&#1514;. &#1506;&#1501; &#1494;&#1488;&#1514;,
&#1500;&#1506;&#1493;&#1500;&#1501; &#1500;&#1488; &#1497;&#1492;&#1497;&#1492; &#1504;&#1497;&#1514;&#1503; &#1500;&#1497;&#1497;&#1495;&#1505; &#1488;&#1514; &#1504;&#1499;&#1505;&#1497;&#1493; &#1500;&#1489;&#1506;&#1500;&#1497;&#1501; &#1488;&#1495;&#1491; &#1493;&#1497;&#1495;&#1497;&#1491;, &#1493;&#1499;&#1500; &#1506;&#1493;&#1491; &#1497;&#1513;&#1504;&#1501; &#1488;&#1504;&#1513;&#1497;&#1501;
&#1489;&#1506;&#1493;&#1500;&#1501;&#8212;&#1489;&#1499;&#1500; &#1502;&#1511;&#1493;&#1501;&#8212;&#1492;&#1502;&#1506;&#1493;&#1504;&#1497;&#1497;&#1504;&#1497;&#1501; &#1489;&#1492;&#1502;&#1513;&#1499;&#1514; &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1497;&#1497;&#1513;&#1493;&#1514; &#1488;&#1495;&#1514; &#1488;&#1497;&#1504;&#1492; &#1497;&#1499;&#1493;&#1500;&#1492;
&#1500;&#1505;&#1490;&#1493;&#1512; &#1488;&#1493;&#1514;&#1493; &#1500;&#1495;&#1500;&#1493;&#1496;&#1497;&#1503;. &#1500;&#1499;&#1493;&#1500;&#1501; &#1497;&#1513; &#1499;&#1495; &#1488;&#1497;&#1503;-&#1505;&#1493;&#1508;&#1497;; &#1493;&#1500;&#1499;&#1493;&#1500;&#1501; &#1488;&#1497;&#1503; &#1499;&#1495; &#1499;&#1500;&#1500;. &#1502;&#1510;&#1489; &#1494;&#1492; &#1497;&#1493;&#1510;&#1512;
&#1491;&#1497;&#1504;&#1488;&#1502;&#1497;&#1511;&#1492; &#1502;&#1506;&#1504;&#1497;&#1497;&#1504;&#1514; &#1489;&#1497;&#1493;&#1514;&#1512;.</p><p>&#1494;&#1488;&#1514; &#1492;&#1505;&#1497;&#1489;&#1492; &#1513;&#1512;&#1510;&#1497;&#1514;&#1497; &#1500;&#1499;&#1514;&#1493;&#1489; &#1488;&#1514; &#1492;&#1505;&#1508;&#1512; &#1492;&#1494;&#1492;. &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1508;&#1497;&#1514;&#1495;&#1493;
&#1514;&#1512;&#1489;&#1493;&#1514; &#1497;&#1497;&#1495;&#1493;&#1491;&#1497;&#1514;, &#1488;&#1514;&#1493;&#1505; &#1500;&#1508;&#1497;&#1493; &#1492;&#1495;&#1493;&#1508;&#1513; &#1500;&#1497;&#1510;&#1493;&#1512; &#1488;&#1514; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1499;&#1491;&#1497; &#1513;&#1514;&#1506;&#1513;&#1492; &#1499;&#1500; &#1502;&#1492; &#1513;&#1488;&#1514;&#1492;
&#1512;&#1493;&#1510;&#1492; &#1492;&#1493;&#1488; &#1506;&#1497;&#1511;&#1512;&#1493;&#1503; &#1502;&#1512;&#1499;&#1494;&#1497;, &#1493;&#1506;&#1501; &#1494;&#1488;&#1514; &#1492;&#1514;&#1493;&#1510;&#1488;&#1492; &#1513;&#1500; &#1492;&#1495;&#1493;&#1508;&#1513; &#1492;&#1494;&#1492; &#1492;&#1497;&#1488; &#1513;&#1497;&#1514;&#1493;&#1507; &#1508;&#1506;&#1493;&#1500;&#1492;
&#1504;&#1500;&#1492;&#1489; &#1489;&#1497;&#1503; &#1488;&#1504;&#1513;&#1497;&#1501;, &#1489;&#1502;&#1511;&#1493;&#1501; &#1492;&#1514;&#1508;&#1494;&#1512;&#1493;&#1514;&#1501; &#1488;&#1497;&#1513; &#1488;&#1497;&#1513; &#1493;&#1499;&#1497;&#1493;&#1493;&#1504;&#1493; &#1492;&#1493;&#1488;. &#1488;&#1499;&#1503;, &#1492;&#1497;&#1499;&#1493;&#1500;&#1514; &#1500;&#1513;&#1497;&#1514;&#1493;&#1507;
&#1508;&#1506;&#1493;&#1500;&#1492; &#1489;&#1506;&#1510;&#1502;&#1492; &#1492;&#1497;&#1488; &#1488;&#1495;&#1514; &#1502;&#1492;&#1514;&#1499;&#1493;&#1504;&#1493;&#1514; &#1492;&#1502;&#1493;&#1506;&#1512;&#1499;&#1493;&#1514; &#1489;&#1497;&#1493;&#1514;&#1512; &#1489;&#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514;. &#1504;&#1497;&#1492;&#1493;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501;
&#1499;&#1488;&#1500;&#1493;, &#1508;&#1497;&#1512;&#1493;&#1513;&#1493; &#1500;&#1511;&#1495;&#1514; &#1495;&#1500;&#1511; &#1489;&#1513;&#1497;&#1514;&#1493;&#1507; &#1508;&#1506;&#1493;&#1500;&#1492; &#1502;&#1514;&#1506;&#1510;&#1501;, &#1489;&#1493; &#1497;&#1499;&#1493;&#1500;&#1514;&#1493; &#1513;&#1500; &#1488;&#1491;&#1501; &#1500;&#1488; &#1512;&#1511; &#1500;&#1506;&#1489;&#1493;&#1491;
&#1489;&#1502;&#1513;&#1493;&#1514;&#1507; &#1506;&#1501; &#1488;&#1504;&#1513;&#1497;&#1501; &#1488;&#1495;&#1512;&#1497;&#1501;, &#1488;&#1500;&#1488; &#1490;&#1501; &#1500;&#1502;&#1510;&#1493;&#1488; &#1491;&#1512;&#1499;&#1497;&#1501; &#1495;&#1491;&#1513;&#1493;&#1514; &#1500;&#1506;&#1489;&#1493;&#1491; &#1489;&#1502;&#1513;&#1493;&#1514;&#1507;, &#1497;&#1499;&#1493;&#1500;&#1492;
&#1500;&#1492;&#1505;&#1514;&#1499;&#1501; &#1489;&#1497;&#1497;&#1514;&#1512;&#1493;&#1504;&#1493;&#1514; &#1502;&#1493;&#1495;&#1513;&#1497;&#1497;&#1501; &#1500;&#1514;&#1493;&#1499;&#1504;&#1492; &#1506;&#1510;&#1502;&#1492;. &#1505;&#1508;&#1512; &#1494;&#1492; &#1502;&#1504;&#1505;&#1492; &#1500;&#1514;&#1488;&#1512; &#1488;&#1514; &#1492;&#1513;&#1497;&#1496;&#1493;&#1514; &#1500;&#1508;&#1497;&#1492;&#1503;
&#1504;&#1497;&#1514;&#1503; &#1500;&#1489;&#1510;&#1506; &#1494;&#1488;&#1514;. &#1500;&#1500;&#1488; &#1499;&#1500; &#1505;&#1508;&#1511;, &#1488;&#1497;&#1504;&#1493; &#1513;&#1500;&#1501;, &#1488;&#1498; &#1492;&#1493;&#1488; &#1500;&#1508;&#1495;&#1493;&#1514; &#1492;&#1514;&#1495;&#1500;&#1492;.</p><p>&#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1496;&#1493;&#1489;&#1492; &#1492;&#1497;&#1488; &#1502;&#1496;&#1512;&#1492; &#1512;&#1488;&#1493;&#1497;&#1492; &#1500;&#1499;&#1513;&#1506;&#1510;&#1502;&#1492;, &#1493;&#1488;&#1504;&#1497; &#1514;&#1511;&#1493;&#1493;&#1492; &#1513;&#1511;&#1493;&#1512;&#1488;&#1497;&#1501;
&#1488;&#1513;&#1512; &#1502;&#1495;&#1508;&#1513;&#1497;&#1501; &#1491;&#1512;&#1499;&#1497;&#1501; &#1500;&#1492;&#1513;&#1497;&#1490; &#1488;&#1493;&#1514;&#1492; &#1497;&#1492;&#1497;&#1492; &#1513;&#1489;&#1506;&#1497; &#1512;&#1510;&#1493;&#1503; &#1502;&#1502;&#1492; &#1513;&#1497;&#1502;&#1510;&#1488;&#1493; &#1499;&#1488;&#1503;. &#1488;&#1498; &#1502;&#1506;&#1489;&#1512; &#1500;&#1499;&#1498;
&#1488;&#1504;&#1497; &#1502;&#1511;&#1493;&#1493;&#1492; &#1490;&#1501; &#1500;&#1492;&#1506;&#1489;&#1497;&#1512; &#1491;&#1489;&#1512; &#1502;&#1492; &#1502;&#1492;&#1506;&#1493;&#1504;&#1490; &#1492;&#1502;&#1514;&#1511;&#1489;&#1500; &#1502;&#1506;&#1489;&#1493;&#1491;&#1492; &#1506;&#1501; &#1511;&#1489;&#1493;&#1510;&#1492; &#1495;&#1491;&#1493;&#1512;&#1514; &#1502;&#1493;&#1496;&#1497;&#1489;&#1510;&#1497;&#1492;
&#1513;&#1500; &#1502;&#1508;&#1514;&#1495;&#1497; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1493;&#1502;&#1492;&#1492;&#1514;&#1511;&#1513;&#1512;&#1493;&#1514; &#1506;&#1501; &#1502;&#1513;&#1514;&#1502;&#1513;&#1497;&#1501; &#1489;&#1510;&#1493;&#1512;&#1492; &#1492;&#1497;&#1513;&#1497;&#1512;&#1492; &#1492;&#1499;&#1492; &#1504;&#1508;&#1500;&#1488;&#1492; &#1513;&#1511;&#1493;&#1491;
&#1508;&#1514;&#1493;&#1495; &#1502;&#1506;&#1493;&#1491;&#1491;. &#1492;&#1513;&#1514;&#1514;&#1508;&#1493;&#1514; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1502;&#1510;&#1500;&#1497;&#1495; &#1494;&#1492; 
<span class="emphasis"><em>&#1499;&#1497;&#1507;</em></span>, &#1493;&#1489;&#1505;&#1493;&#1508;&#1493; &#1513;&#1500; &#1491;&#1489;&#1512;, &#1494;&#1492; &#1502;&#1492; &#1513;&#1502;&#1504;&#1497;&#1506; &#1488;&#1514; &#1499;&#1500; &#1492;&#1502;&#1506;&#1512;&#1499;&#1514;.</p></div><div class="footnotes"><br><hr width="100" align="right"><div class="footnote"><p><sup>[<a id="ftn.idp149104" href="#idp149104" class="para">1</a>] </sup>&#1492;&#1502;&#1493;&#1504;&#1495;&#1497;&#1501; "&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;" &#1493;"&#1495;&#1493;&#1508;&#1513;&#1497;" &#1494;&#1492;&#1497;&#1501;
&#1506;&#1511;&#1512;&#1493;&#1504;&#1497;&#1514; &#1489;&#1492;&#1511;&#1513;&#1512; &#1494;&#1492;; &#1491;&#1497;&#1493;&#1503; &#1504;&#1512;&#1495;&#1489; &#1489;&#1492;&#1501; &#1504;&#1502;&#1510;&#1488; &#1514;&#1495;&#1514;
<a class="xref" href="introduction.html#free-vs-open-source" title='"&#1495;&#1493;&#1508;&#1513;&#1497;" &#1500;&#1506;&#1493;&#1502;&#1514; "&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"'>&#1492;&#1505;&#1506;&#1497;&#1507; &#1513;&#1504;&#1511;&#1512;&#1488; &#8220;"&#1495;&#1493;&#1508;&#1513;&#1497;" &#1500;&#1506;&#1493;&#1502;&#1514; "&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"&#8221;</a><span> &#1489;&#1508;&#1512;&#1511; 
<a class="xref" href="introduction.html" title="&#1508;&#1512;&#1511; 1. &#1492;&#1511;&#1491;&#1502;&#1492;">&#1508;&#1512;&#1511; 1, <i>&#1492;&#1511;&#1491;&#1502;&#1492;</i></a></span>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="index.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><td width="20%" align="center"> </td><td width="40%" align="left"> <a accesskey="n" href="audience.html">&#1492;&#1489;&#1488;</a></td></tr><tr><td width="40%" align="right" valign="top">&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1512;&#1488;&#1513;&#1497;</a></td><td width="40%" align="left" valign="top"> &#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?</td></tr></table></div></body></html>
