<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1492;&#1508;&#1511;&#1514; &#1514;&#1493;&#1499;&#1504;&#1492; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;"><link rel="up" href="preface.html" title="&#1502;&#1489;&#1493;&#1488;"><link rel="prev" href="audience.html" title="&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;?"><link rel="next" href="acknowledgments.html" title="&#1514;&#1493;&#1491;&#1493;&#1514;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="audience.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><th width="60%" align="center">&#1502;&#1489;&#1493;&#1488;</th><td width="20%" align="left"> <a accesskey="n" href="acknowledgments.html">&#1492;&#1489;&#1488;</a></td></tr></table><hr></div><div class="sect1" title="&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sources"></a>&#1502;&#1511;&#1493;&#1512;&#1493;&#1514;</h2></div></div></div><p>&#1502;&#1512;&#1489;&#1497;&#1514; &#1495;&#1493;&#1502;&#1512; &#1492;&#1490;&#1500;&#1501; &#1506;&#1489;&#1493;&#1512; &#1505;&#1508;&#1512; &#1494;&#1492; &#1504;&#1489;&#1506; &#1502;&#1495;&#1502;&#1513; &#1513;&#1504;&#1493;&#1514; &#1506;&#1489;&#1493;&#1491;&#1492; &#1506;&#1501; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;
Subversion.(<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>).
Subversion &#1492;&#1497;&#1488; &#1502;&#1506;&#1512;&#1499;&#1514; &#1504;&#1497;&#1492;&#1493;&#1500; &#1490;&#1512;&#1505;&#1488;&#1493;&#1514; &#1489;&#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;, &#1488;&#1513;&#1512; &#1508;&#1493;&#1514;&#1495;&#1492; &#1502;&#1488;&#1508;&#1505;, &#1493;&#1502;&#1497;&#1493;&#1506;&#1491;&#1514;
&#1500;&#1492;&#1495;&#1500;&#1497;&#1507; &#1488;&#1514; CVS &#1499;&#1489;&#1495;&#1497;&#1512;&#1492; <span class="foreignphrase"><em class="foreignphrase">&#1491;&#1492; &#1508;&#1511;&#1496;&#1493;</em></span> &#1500;&#1502;&#1506;&#1512;&#1499;&#1514;
&#1504;&#1497;&#1492;&#1493;&#1500; &#1490;&#1512;&#1505;&#1488;&#1493;&#1514; &#1513;&#1500; &#1511;&#1492;&#1497;&#1500;&#1514; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495;. &#1492;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1504;&#1493;&#1510;&#1512; &#1506;&#1500;-&#1497;&#1491;&#1497; &#1492;&#1502;&#1506;&#1505;&#1497;&#1511;&#1497;&#1501;
&#1513;&#1500;&#1497;, CollabNet (<a class="ulink" href="http://www.collab.net/" target="_top">http://www.collab.net/</a> ), &#1489;&#1514;&#1495;&#1497;&#1500;&#1514; &#1513;&#1504;&#1514; 2000
&#1493;&#1514;&#1493;&#1491;&#1492; &#1500;&#1488;&#1500; &#1513; CollabNet &#1492;&#1489;&#1497;&#1504;&#1493; &#1499;&#1489;&#1512; &#1502;&#1514;&#1495;&#1497;&#1500;&#1514;&#1493; &#1499;&#1497;&#1510;&#1491; &#1500;&#1504;&#1492;&#1500; &#1488;&#1493;&#1514;&#1493; &#1499;&#1502;&#1488;&#1502;&#1509; &#1513;&#1497;&#1514;&#1493;&#1508;&#1497; &#1502;&#1489;&#1493;&#1494;&#1512;
&#1488;&#1502;&#1497;&#1514;&#1497;. &#1502;&#1493;&#1511;&#1491;&#1501; &#1502;&#1488;&#1491; &#1494;&#1499;&#1497;&#1504;&#1493; &#1500;&#1492;&#1514;&#1506;&#1504;&#1497;&#1497;&#1504;&#1493;&#1514; &#1512;&#1489;&#1492; &#1489;&#1511;&#1512; &#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1502;&#1514;&#1504;&#1491;&#1489;&#1497;&#1501;; &#1499;&#1497;&#1493;&#1501; &#1497;&#1513;&#1504;&#1501;
&#1499; - 50 &#1493;&#1502;&#1513;&#1492;&#1493; &#1502;&#1508;&#1514;&#1495;&#1497;&#1501; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1502;&#1492;&#1501; &#1512;&#1511; &#1502;&#1506;&#1496;&#1497;&#1501; &#1502;&#1493;&#1506;&#1505;&#1511;&#1497;&#1501; &#1506;&#1500;-&#1497;&#1491;&#1497; CollabNet.</p><p>&#1502;&#1492;&#1512;&#1489;&#1492; &#1492;&#1497;&#1489;&#1496;&#1497;&#1501;, Subversion &#1492;&#1493;&#1488; &#1491;&#1493;&#1490;&#1502;&#1488; &#1511;&#1500;&#1488;&#1505;&#1497;&#1514; &#1500;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1511;&#1493;&#1491; &#1508;&#1514;&#1493;&#1495;,
&#1493;&#1489;&#1505;&#1493;&#1508;&#1493; &#1513;&#1500; &#1491;&#1489;&#1512; &#1502;&#1513;&#1499;&#1514;&#1497; &#1502;&#1504;&#1505;&#1497;&#1493;&#1504;&#1497; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1492;&#1512;&#1489;&#1492; &#1502;&#1506;&#1489;&#1512; &#1502;&#1502;&#1492; &#1513;&#1514;&#1499;&#1504;&#1504;&#1514;&#1497; &#1489;&#1502;&#1511;&#1493;&#1512;. &#1489;&#1502;&#1497;&#1491;&#1492;
&#1502;&#1505;&#1493;&#1497;&#1497;&#1502;&#1514; &#1492;&#1497;&#1492; &#1494;&#1492; &#1506;&#1504;&#1497;&#1497;&#1503; &#1513;&#1500; &#1504;&#1493;&#1495;&#1493;&#1514;: &#1499;&#1500; &#1488;&#1497;&#1502;&#1514; &#1513;&#1504;&#1494;&#1511;&#1511;&#1514;&#1497; &#1500;&#1491;&#1493;&#1490;&#1502;&#1488; &#1500;&#1514;&#1493;&#1508;&#1506;&#1492; &#1502;&#1505;&#1493;&#1497;&#1497;&#1502;&#1514;,
&#1489;&#1491;&#1512;&#1498;-&#1499;&#1500;&#1500; &#1502;&#1510;&#1488;&#1514;&#1497; &#1488;&#1495;&#1514; &#1500;&#1500;&#1488; &#1499;&#1500; &#1502;&#1488;&#1502;&#1509; &#1489; Subversion. &#1488;&#1498; &#1506;&#1501; &#1494;&#1488;&#1514; &#1490;&#1501; &#1506;&#1504;&#1497;&#1497;&#1503; &#1488;&#1497;&#1502;&#1493;&#1514;
&#1492;&#1502;&#1497;&#1491;&#1506; &#1513;&#1497;&#1495;&#1511; &#1514;&#1508;&#1511;&#1497;&#1491;. &#1500;&#1502;&#1512;&#1493;&#1514; &#1513;&#1488;&#1504;&#1497; &#1500;&#1493;&#1511;&#1495; &#1495;&#1500;&#1511; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1488;&#1495;&#1512;&#1497;&#1501; &#1489;&#1502;&#1497;&#1491;&#1492;
&#1494;&#1493; &#1488;&#1493; &#1488;&#1495;&#1512;&#1514;, &#1493;&#1502;&#1513;&#1493;&#1495;&#1495; &#1506;&#1501; &#1495;&#1489;&#1512;&#1497;&#1501; &#1493;&#1502;&#1499;&#1512;&#1497;&#1501; &#1492;&#1502;&#1506;&#1493;&#1512;&#1489;&#1497;&#1501; &#1489;&#1512;&#1489;&#1497;&#1501; &#1504;&#1493;&#1505;&#1508;&#1497;&#1501;, &#1499;&#1513;&#1488;&#1514;&#1492; &#1499;&#1493;&#1514;&#1489;
&#1500;&#1491;&#1508;&#1493;&#1505;, &#1488;&#1514;&#1492; &#1502;&#1489;&#1497;&#1503; &#1489;&#1502;&#1492;&#1512;&#1492; &#1513;&#1497;&#1513; &#1500;&#1489;&#1491;&#1493;&#1511; &#1488;&#1514; &#1492;&#1506;&#1493;&#1489;&#1491;&#1493;&#1514; &#1502;&#1488;&#1495;&#1493;&#1512;&#1497; &#1499;&#1500; &#1496;&#1506;&#1504;&#1492; &#1513;&#1500;&#1498;. &#1500;&#1488; &#1512;&#1510;&#1497;&#1514;&#1497;
&#1500;&#1492;&#1510;&#1492;&#1497;&#1512; &#1492;&#1510;&#1492;&#1512;&#1493;&#1514; &#1489;&#1504;&#1493;&#1490;&#1506; &#1500;&#1488;&#1497;&#1512;&#1493;&#1506;&#1497;&#1501; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1488;&#1495;&#1512;&#1497;&#1501; &#1489;&#1492;&#1514;&#1489;&#1505;&#1505; &#1512;&#1511; &#1506;&#1500; &#1502;&#1492; &#1513;&#1511;&#1512;&#1488;&#1514;&#1497;
&#1489;&#1512;&#1513;&#1497;&#1502;&#1493;&#1514; &#1492;&#1491;&#1497;&#1493;&#1493;&#1512; &#1492;&#1510;&#1497;&#1489;&#1493;&#1512;&#1497;&#1493;&#1514; &#1513;&#1500;&#1492;&#1501;. &#1488;&#1501; &#1502;&#1497;&#1513;&#1492;&#1493; &#1492;&#1497;&#1492; &#1502;&#1504;&#1505;&#1492; &#1494;&#1488;&#1514; &#1506;&#1501; Subversion, &#1497;&#1491;&#1506;&#1514;&#1497;
&#1513;&#1492;&#1493;&#1488; &#1492;&#1497;&#1492; &#1510;&#1493;&#1491;&#1511; &#1489;&#1502;&#1495;&#1510;&#1497;&#1514; &#1502;&#1492;&#1502;&#1511;&#1512;&#1497;&#1501; &#1493;&#1496;&#1493;&#1506;&#1492; &#1489;&#1495;&#1510;&#1497; &#1492;&#1513;&#1504;&#1497;. &#1500;&#1499;&#1503;, &#1499;&#1488;&#1513;&#1512; &#1513;&#1488;&#1500;&#1514;&#1497; &#1491;&#1493;&#1490;&#1502;&#1488;&#1493;&#1514;
&#1502;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1489;&#1492;&#1501; &#1500;&#1488; &#1492;&#1497;&#1514;&#1492; &#1500;&#1497; &#1502;&#1506;&#1493;&#1512;&#1489;&#1493;&#1514; &#1497;&#1513;&#1497;&#1512;&#1492;, &#1504;&#1497;&#1505;&#1497;&#1514;&#1497; &#1511;&#1493;&#1491;&#1501; &#1500;&#1513;&#1493;&#1495;&#1495; &#1506;&#1501; &#1502;&#1497;&#1513;&#1492;&#1493;
&#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;, &#1506;&#1500;&#1497;&#1493; &#1497;&#1499;&#1493;&#1500;&#1514;&#1497; &#1500;&#1505;&#1502;&#1493;&#1498; &#1513;&#1497;&#1505;&#1489;&#1497;&#1512; &#1489;&#1491;&#1497;&#1493;&#1511; &#1502;&#1492; &#1511;&#1493;&#1512;&#1492; &#1513;&#1501;.</p><p>&#1488;&#1502;&#1504;&#1501; Subversion &#1492;&#1497;&#1492; &#1492;&#1506;&#1489;&#1493;&#1491;&#1492; &#1513;&#1500;&#1497; &#1489;&#1502;&#1513;&#1498; 5 &#1492;&#1513;&#1504;&#1497;&#1501; &#1492;&#1488;&#1495;&#1512;&#1493;&#1504;&#1493;&#1514;, &#1488;&#1498; &#1488;&#1504;&#1497;
&#1502;&#1506;&#1493;&#1512;&#1489; &#1489;&#1514;&#1493;&#1499;&#1504;&#1492; &#1495;&#1493;&#1508;&#1513;&#1497;&#1514; &#1499;&#1489;&#1512; 12 &#1513;&#1504;&#1492;. &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1488;&#1495;&#1512;&#1497;&#1501; &#1488;&#1513;&#1512; &#1492;&#1513;&#1508;&#1497;&#1506;&#1493; &#1506;&#1500; &#1505;&#1508;&#1512;
&#1494;&#1492;:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#1506;&#1493;&#1512;&#1498; &#1492;&#1502;&#1500;&#1500; Emacs &#1513;&#1500; GNU &#1514;&#1495;&#1514; &#1511;&#1512;&#1503; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1492;&#1495;&#1493;&#1508;&#1513;&#1497;&#1514;,
            &#1488;&#1513;&#1512; &#1489;&#1493; &#1488;&#1504;&#1497; &#1502;&#1514;&#1495;&#1494;&#1511; &#1502;&#1505;&#1508;&#1512; &#1495;&#1489;&#1497;&#1500;&#1493;&#1514; &#1511;&#1496;&#1504;&#1493;&#1514;.</p></li><li class="listitem"><p>&#1502;&#1506;&#1512;&#1499;&#1514; &#1490;&#1512;&#1505;&#1488;&#1493;&#1514; &#1502;&#1511;&#1489;&#1497;&#1500;&#1497;&#1514; (CVS), &#1488;&#1513;&#1512; &#1506;&#1489;&#1491;&#1514;&#1497; &#1506;&#1500;&#1497;&#1492; &#1489;&#1502;&#1492;&#1500;&#1498;
            1994&#8211;1995 &#1497;&#1495;&#1491; &#1506;&#1501; &#1490;'&#1497;&#1501; &#1489;&#1500;&#1504;&#1491;&#1497;, &#1493;&#1488;&#1513;&#1512; &#1502;&#1488;&#1494; &#1492;&#1497;&#1497;&#1514;&#1497; &#1502;&#1506;&#1493;&#1512;&#1489;
            &#1489;&#1492; &#1500;&#1508;&#1512;&#1511;&#1497;&#1501; &#1489;&#1500;&#1489;&#1491;.</p></li><li class="listitem"><p>&#1488;&#1505;&#1493;&#1508;&#1514; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495; &#1492;&#1497;&#1491;&#1493;&#1506; &#1489;&#1513;&#1501; &#1511;&#1512;&#1503; &#1492;&#1514;&#1493;&#1499;&#1504;&#1492;
            &#1513;&#1500; &#1488;&#1508;&#1488;&#1510;'&#1497; (Apache), &#1489;&#1497;&#1497;&#1495;&#1493;&#1491; &#1489; - Apache Portable
            Runtime (APR) &#1493;&#1489;&#1513;&#1512;&#1514; &#1492; - HTTP &#1513;&#1500; &#1488;&#1508;&#1488;&#1510;'&#1497;.</p></li><li class="listitem"><p>&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; OpenOffice.org, &#1502;&#1505;&#1491; &#1492;&#1504;&#1514;&#1493;&#1504;&#1497;&#1501; &#1513;&#1500; &#1489;&#1512;&#1511;&#1500;&#1497;
            &#1502; - Sleepycat, &#1493;&#1502;&#1505;&#1491; &#1492;&#1504;&#1514;&#1493;&#1504;&#1497;&#1501; MySQL; &#1500;&#1488; &#1500;&#1511;&#1495;&#1514;&#1497; &#1495;&#1500;&#1511;
            &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1488;&#1500;&#1492; &#1489;&#1488;&#1493;&#1508;&#1503; &#1488;&#1497;&#1513;&#1497;, &#1488;&#1498; &#1510;&#1508;&#1497;&#1514;&#1497; &#1489;&#1492;&#1501; &#1493;&#1489;&#1502;&#1511;&#1512;&#1497;&#1501;
            &#1502;&#1505;&#1493;&#1497;&#1497;&#1502;&#1497;&#1501;, &#1513;&#1493;&#1495;&#1495;&#1514;&#1497; &#1506;&#1501; &#1488;&#1504;&#1513;&#1497;&#1501; &#1489;&#1492;&#1501;.</p></li><li class="listitem"><p>&#1502;&#1504;&#1508;&#1492; &#1492;&#1489;&#1488;&#1490;&#1497;&#1501; (GDB) &#1513;&#1500; GNU (&#1499;&#1504;"&#1500;).</p></li><li class="listitem"><p>&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496; &#1491;&#1489;&#1497;&#1488;&#1503; (&#1499;&#1504;"&#1500;)</p></li></ul></div><p>&#1499;&#1502;&#1493;&#1489;&#1503;, &#1488;&#1497;&#1503; &#1494;&#1493; &#1512;&#1513;&#1497;&#1502;&#1492; &#1502;&#1500;&#1488;&#1492;. &#1499;&#1502;&#1493; &#1512;&#1493;&#1489; &#1514;&#1499;&#1504;&#1514;&#1497; &#1492;&#1511;&#1493;&#1491; &#1492;&#1508;&#1514;&#1493;&#1495;, &#1488;&#1504;&#1497;
&#1489;&#1511;&#1513;&#1512; &#1512;&#1493;&#1508;&#1507; &#1506;&#1501; &#1502;&#1505;&#1508;&#1512; &#1512;&#1489; &#1513;&#1500; &#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501; &#1513;&#1493;&#1504;&#1497;&#1501;, &#1493;&#1500;&#1493; &#1489;&#1513;&#1489;&#1497;&#1500; &#1500;&#1511;&#1489;&#1500; &#1514;&#1495;&#1493;&#1513;&#1492; &#1513;&#1500;
&#1492;&#1502;&#1510;&#1489; &#1492;&#1499;&#1500;&#1500;&#1497; &#1513;&#1500; &#1492;&#1491;&#1489;&#1512;&#1497;&#1501; &#1489;&#1508;&#1512;&#1493;&#1497;&#1497;&#1511;&#1496;&#1497;&#1501;. &#1500;&#1488; &#1488;&#1504;&#1511;&#1493;&#1489; &#1489;&#1513;&#1502;&#1493;&#1514; &#1499;&#1493;&#1500;&#1501; &#1499;&#1488;&#1503;, &#1488;&#1498; &#1492;&#1501;
&#1502;&#1510;&#1493;&#1497;&#1497;&#1504;&#1497;&#1501; &#1489;&#1502;&#1500;&#1500;, &#1492;&#1497;&#1499;&#1503; &#1513;&#1510;&#1512;&#1497;&#1498;.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="audience.html">&#1492;&#1511;&#1493;&#1491;&#1501;</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#1500;&#1502;&#1506;&#1500;&#1492;</a></td><td width="40%" align="left"> <a accesskey="n" href="acknowledgments.html">&#1492;&#1489;&#1488;</a></td></tr><tr><td width="40%" align="right" valign="top">&#1500;&#1502;&#1497; &#1502;&#1497;&#1493;&#1506;&#1491; &#1505;&#1508;&#1512; &#1494;&#1492;? </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1512;&#1488;&#1513;&#1497;</a></td><td width="40%" align="left" valign="top"> &#1514;&#1493;&#1491;&#1493;&#1514;</td></tr></table></div></body></html>
