<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1588;&#1585;&#1575;&#1740;&#1591; &#1705;&#1606;&#1608;&#1606;&#1740;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="&#1578;&#1608;&#1604;&#1740;&#1583; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1740; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586;"><link rel="up" href="introduction.html" title="&#1601;&#1589;&#1604; 1. &#1605;&#1602;&#1583;&#1605;&#1607;"><link rel="prev" href="introduction.html" title="&#1601;&#1589;&#1604; 1. &#1605;&#1602;&#1583;&#1605;&#1607;"><link rel="next" href="getting-started.html" title="&#1601;&#1589;&#1604; 2. Getting Started"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1588;&#1585;&#1575;&#1740;&#1591; &#1705;&#1606;&#1608;&#1606;&#1740;</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="introduction.html">&#1602;&#1576;&#1604;&#1740;</a> </td><th width="60%" align="center">
      &#1601;&#1589;&#1604; 1. &#1605;&#1602;&#1583;&#1605;&#1607;</th><td width="20%" align="left"> <a accesskey="n" href="getting-started.html">&#1576;&#1593;&#1583;&#1740;</a></td></tr></table><hr></div><div class="sect1" title="&#1588;&#1585;&#1575;&#1740;&#1591; &#1705;&#1606;&#1608;&#1606;&#1740;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="today"></a>&#1588;&#1585;&#1575;&#1740;&#1591; &#1705;&#1606;&#1608;&#1606;&#1740;</h2></div></div></div><p>&#1586;&#1605;&#1575;&#1606;&#1740; &#1705;&#1607; &#1662;&#1585;&#1608;&#1688;&#1607; &#1606;&#1585;&#1605;&#8204;&#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1740; &#1570;&#1586;&#1575;&#1583; &#1585;&#1575; &#1575;&#1580;&#1585;&#1575; &#1605;&#1740;&#8204;&#1705;&#1606;&#1740;&#1583;&#1548;  &#1576;&#1607; &#1589;&#1581;&#1576;&#1578; &#1705;&#1585;&#1583;&#1606; 
&#1581;&#1608;&#1604; &#1605;&#1587;&#1575;&#1574;&#1604; &#1601;&#1604;&#1587;&#1601;&#1740; &#1587;&#1606;&#1711;&#1740;&#1606; &#1585;&#1608;&#1586;&#1575;&#1606;&#1607; &#1575;&#1581;&#1578;&#1740;&#1575;&#1580; &#1606;&#1583;&#1575;&#1585;&#1740;&#1605;. &#1576;&#1585;&#1606;&#1575;&#1605;&#1607;&#8204;&#1606;&#1608;&#1740;&#1587;&#1575;&#1606; &#1576;&#1607; &#1575;&#1740;&#1606;&#1705;&#1607; &#1607;
&#1585;&#1705;&#1587;&#1740; &#1583;&#1585; &#1662;&#1585;&#1608;&#1688;&#1607; &#1605;&#1608;&#1575;&#1601;&#1602; &#1583;&#1740;&#1583;&#1711;&#1575;&#1607; &#1570;&#1606;&#8204;&#1607;&#1575; &#1583;&#1585; &#1607;&#1605;&#1607; &#1605;&#1608;&#1585;&#1575;&#1583; &#1576;&#1575;&#1588;&#1583; &#1575;&#1589;&#1585;&#1575;&#1585;&#1740; &#1606;&#1583;&#1575;&#1585;&#1606;&#1583; 
( &#1705;&#1587;&#1575;&#1606;&#1740; &#1705;&#1607; &#1576;&#1585; &#1587;&#1585;&#1593;&#1578; &#1575;&#1589;&#1585;&#1575;&#1585; &#1583;&#1575;&#1585;&#1606;&#1583; &#1583;&#1585;&#1605;&#1740;&#8204;&#1740;&#1575;&#1576;&#1606;&#1583; &#1705;&#1607; &#1583;&#1585; &#1607;&#1740;&#1670; &#1662;&#1585;&#1608;&#1688;&#1607;&#8204;&#1575;&#1740; &#1602;&#1575;&#1583;&#1585; &#1576;&#1607; &#1705;&#1575;&#1585;
&#1606;&#1740;&#1587;&#1578;&#1606;&#1583;). &#1575;&#1605;&#1575; &#1588;&#1605;&#1575; &#1576;&#1607; &#1570;&#1711;&#1575;&#1607;&#1740; &#1583;&#1585;&#1605;&#1608;&#1585;&#1583; &#1608;&#1580;&#1608;&#1583; "&#1570;&#1586;&#1575;&#1583;" &#1583;&#1585; &#1576;&#1585;&#1575;&#1576;&#1585; "&#1605;&#1578;&#1606; &#1576;&#1575;&#1586;" 
&#1606;&#1740;&#1575;&#1586; &#1583;&#1575;&#1585;&#1740;&#1583;&#1548; &#1608; &#1578;&#1575; &#1581;&#1583;&#1608;&#1583;&#1740; &#1576;&#1607; &#1711;&#1601;&#1578;&#1606; &#1670;&#1740;&#1586;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607; &#1605;&#1605;&#1705;&#1606; &#1575;&#1587;&#1578; &#1576;&#1585;&#1582;&#1604;&#1575;&#1601; &#1606;&#1592;&#1585; &#1740;&#1705;&#1587;&#1585;&#1740; 
&#1575;&#1586; &#1588;&#1585;&#1705;&#1578;&#8204;&#1705;&#1606;&#1606;&#1583;&#1711;&#1575;&#1606; &#1576;&#1575;&#1588;&#1583; &#1575;&#1580;&#1578;&#1606;&#1575;&#1576; &#1605;&#1740;&#8204;&#1705;&#1606;&#1583; &#1576;&#1607;&#1578;&#1585;&#1740;&#1606; &#1585;&#1575;&#1607; &#8212;&#1583;&#1585; &#1576;&#1593;&#1590;&#1740; &#1605;&#1608;&#1575;&#1585;&#1583; 
<span class="emphasis"><em>&#1578;&#1606;&#1607;&#1575;</em></span> &#1585;&#1575;&#1607;&#8212; &#1605;&#1583;&#1740;&#1585;&#1740;&#1578; &#1662;&#1585;&#1608;&#1688;&#1607; &#1575;&#1587;&#1578;. </p><p>&#1606;&#1585;&#1605;&#8204;&#1575;&#1601;&#1586;&#1575;&#1585; &#1570;&#1586;&#1575;&#1583; &#1740;&#1705; &#1601;&#1585;&#1607;&#1606;&#1711; &#1575;&#1606;&#1578;&#1582;&#1575;&#1576;&#1740; &#1575;&#1587;&#1578;. &#1576;&#1585;&#1575;&#1740; &#1593;&#1605;&#1604;&#1705;&#1585;&#1583; &#1605;&#1608;&#1601;&#1602; &#1583;&#1585;&#1575;&#1740;&#1606; &#1586;&#1605;&#1740;&#1606;&#1607;&#1548; 
&#1576;&#1575;&#1740;&#1583; &#1583;&#1585;&#1705; &#1705;&#1606;&#1740;&#1583; &#1705;&#1607; &#1670;&#1585;&#1575; &#1575;&#1601;&#1585;&#1575;&#1583; &#1570;&#1606; &#1585;&#1575; &#1583;&#1585; &#1608;&#1607;&#1604;&#1607; &#1575;&#1608;&#1604; &#1575;&#1606;&#1578;&#1582;&#1575;&#1576; &#1605;&#1740;&#8204;&#1705;&#1606;&#1606;&#1583;.
&#1583;&#1585; &#1575;&#1740;&#1606; &#1585;&#1608;&#1588;&#1548;&#1585;&#1608;&#1588;&#8204;&#1607;&#1575;&#1740; &#1587;&#1585;&#1705;&#1608;&#1576;&#8204;&#1711;&#1585;&#1575;&#1740;&#1575;&#1606;&#1607; &#1705;&#1575;&#1585; &#1606;&#1605;&#1740;&#8204;&#1705;&#1606;&#1583;.  &#1575;&#1711;&#1585; &#1575;&#1601;&#1585;&#1575;&#1583; &#1575;&#1586; &#1740;&#1705; &#1662;&#1585;&#1608;&#1688;&#1607; 
&#1606;&#1575;&#1585;&#1590;&#1575;&#1740;&#1578;&#1605;&#1606;&#1583; &#1576;&#1575;&#1588;&#1606;&#1583;&#1548; &#1576;&#1607; &#1587;&#1585;&#1575;&#1594; &#1662;&#1585;&#1608;&#1688;&#1607; &#1583;&#1740;&#1711;&#1585;&#1740; &#1605;&#1740;&#8204;&#1585;&#1608;&#1606;&#1583;. &#1606;&#1585;&#1605;&#8204;&#1575;&#1601;&#1586;&#1575;&#1585; &#1570;&#1586;&#1575;&#1583; &#1581;&#1578;&#1740; &#1583;&#1585; 
&#1605;&#1740;&#1575;&#1606; &#1580;&#1608;&#1575;&#1605;&#1593; &#1583;&#1575;&#1608;&#1591;&#1604;&#1576; &#1576;&#1585;&#1575;&#1740; &#1587;&#1576;&#1705;&#1740; &#1575;&#1586; &#1587;&#1585;&#1605;&#1575;&#1740;&#1607;&#8204;&#1711;&#1584;&#1575;&#1585;&#1740; &#1602;&#1575;&#1576;&#1604; &#1578;&#1608;&#1580;&#1607; &#1575;&#1587;&#1578;. &#1575;&#1594;&#1604;&#1576; 
&#1575;&#1601;&#1585;&#1575;&#1583; &#1607;&#1585;&#1711;&#1586; &#1583;&#1585;&#1711;&#1740;&#1585; &#1605;&#1604;&#1575;&#1602;&#1575;&#1578; &#1670;&#1607;&#1585;&#1607; &#1576;&#1607; &#1670;&#1607;&#1585;&#1607; &#1583;&#1740;&#1711;&#1585; &#1588;&#1585;&#1705;&#1578;&#8204;&#1705;&#1606;&#1606;&#1583;&#1711;&#1575;&#1606; &#1606;&#1605;&#1740;&#8204;&#1588;&#1608;&#1606;&#1583;&#1548; &#1608; 
&#1576;&#1607; &#1587;&#1575;&#1583;&#1711;&#1740; &#1576;&#1607; &#1586;&#1605;&#1575;&#1606;&#1740; &#1705;&#1607; &#1570;&#1606;&#8204;&#1607;&#1575; &#1585;&#1575; &#1575;&#1581;&#1587;&#1575;&#1587; &#1605;&#1740;&#8204;&#1705;&#1606;&#1606;&#1583; &#1578;&#1608;&#1580;&#1607; &#1605;&#1740;&#8204;&#1705;&#1606;&#1606;&#1583;. &#1575;&#1585;&#1578;&#1576;&#1575;&#1591; 
&#1575;&#1601;&#1585;&#1575;&#1583; &#1576;&#1575;&#1740;&#1705;&#1583;&#1740;&#1711;&#1585; &#1576;&#1607; &#1740;&#1705;&#1587;&#1585;&#1740; &#1705;&#1575;&#1606;&#1575;&#1604;&#8204;&#1607;&#1575;&#1740; &#1575;&#1585;&#1578;&#1576;&#1575;&#1591;&#1740; &#1605;&#1581;&#1583;&#1608;&#1583; &#1605;&#1740;&#8204;&#1588;&#1608;&#1583;: &#1705;&#1604;&#1605;&#1607;&#8204;&#1607;&#1575;&#1740; &#1606;&#1608;&#1588;&#1578;&#1607; 
&#1588;&#1583;&#1607;&#1548; &#1576;&#1585;&#1585;&#1608;&#1740; &#1587;&#1740;&#1605;&#8204;&#1607;&#1575;&#1740; &#1575;&#1604;&#1705;&#1578;&#1585;&#1608;&#1606;&#1740;&#1705;&#1740; &#1605;&#1606;&#1578;&#1602;&#1604; &#1605;&#1740;&#8204;&#1588;&#1608;&#1606;&#1583;. &#1576;&#1607; &#1607;&#1605;&#1740;&#1606; &#1583;&#1604;&#1740;&#1604;&#1548; &#1586;&#1605;&#1575;&#1606; 
&#1586;&#1740;&#1575;&#1583;&#1740; &#1576;&#1585;&#1575;&#1740; &#1575;&#1606;&#1587;&#1580;&#1575;&#1605; &#1608; &#1578;&#1588;&#1582;&#1740;&#1589; &#1601;&#1585;&#1605; &#1711;&#1585;&#1608;&#1607; &#1591;&#1608;&#1604; &#1605;&#1740;&#8204;&#1705;&#1588;&#1583;. &#1583;&#1585; &#1606;&#1578;&#1740;&#1580;&#1607;&#1548; &#1705;&#1575;&#1605;&#1604;&#1570; &#1576;&#1585;&#1575;&#1740; 
&#1662;&#1585;&#1608;&#1688;&#1607;&#8204;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607;  &#1740;&#1705; &#1583;&#1575;&#1608;&#1591;&#1604;&#1576; &#1576;&#1575;&#1604;&#1602;&#1608;&#1607; &#1585;&#1575; &#1583;&#1585; &#1662;&#1606;&#1580; &#1583;&#1602;&#1740;&#1602;&#1607; &#1575;&#1608;&#1604; &#1570;&#1588;&#1606;&#1575;&#1740;&#1740; &#1575;&#1586; &#1583;&#1587;&#1578; 
&#1605;&#1740;&#8204;&#1583;&#1607;&#1606;&#1583;&#1548; &#1570;&#1587;&#1575;&#1606; &#1575;&#1587;&#1578;. &#1575;&#1711;&#1585; &#1662;&#1585;&#1608;&#1688;&#1607; &#1583;&#1585; &#1575;&#1608;&#1604;&#1740;&#1606; &#1576;&#1585;&#1583;&#1575;&#1588;&#1578; &#1582;&#1608;&#1576; &#1606;&#1576;&#1575;&#1588;&#1583;&#1548; &#1578;&#1575;&#1586;&#1607;&#8204; &#1608;&#1575;&#1585;&#1583;&#1575;&#1606; 
&#1605;&#1605;&#1705;&#1606; &#1575;&#1587;&#1578; &#1605;&#1583;&#1578; &#1586;&#1605;&#1575;&#1606; &#1586;&#1740;&#1575;&#1583;&#1740; &#1576;&#1585;&#1575;&#1740; &#1588;&#1575;&#1606;&#1587; &#1583;&#1608;&#1576;&#1575;&#1585;&#1607; &#1570;&#1588;&#1606;&#1575;&#1740;&#1740; &#1589;&#1576;&#1585; &#1705;&#1606;&#1606;&#1583;. </p><p>&#1606;&#1575;&#1662;&#1575;&#1740;&#1583;&#1575;&#1585;&#1740;&#1548; &#1608; &#1740;&#1575; &#1576;&#1607; &#1580;&#1575;&#1740; &#1570;&#1606; &#1606;&#1575;&#1662;&#1575;&#1740;&#1583;&#1575;&#1585;&#1740; &#1576;&#1575;&#1604;&#1602;&#1608;&#1607; &#1575;&#1585;&#1578;&#1576;&#1575;&#1591;&#1575;&#1578; &#1588;&#1575;&#1740;&#1583; &#1578;&#1606;&#1607;&#1575; 
&#1608;&#1592;&#1740;&#1601;&#1607; &#1583;&#1604;&#1607;&#1585;&#1607;&#8204;&#1570;&#1608;&#1585; &#1583;&#1585; &#1605;&#1608;&#1575;&#1580;&#1607;&#1607; &#1576;&#1575; &#1740;&#1705; &#1662;&#1585;&#1608;&#1688;&#1607; &#1580;&#1583;&#1740;&#1583; &#1576;&#1575;&#1588;&#1583;. &#1670;&#1607; &#1605;&#1740;&#8204;&#1588;&#1608;&#1583; &#1575;&#1711;&#1585; &#1607;&#1605;&#1607; 
&#1575;&#1601;&#1585;&#1575;&#1583; &#1585;&#1575; &#1576;&#1585;&#1575;&#1740; &#1662;&#1740;&#1608;&#1587;&#1578;&#1711;&#1740; &#1705;&#1575;&#1601;&#1740; &#1576;&#1575; &#1607;&#1605;&#1583;&#1740;&#1711;&#1585; &#1576;&#1585;&#1575;&#1740; &#1578;&#1608;&#1604;&#1740;&#1583; &#1740;&#1705; &#1606;&#1578;&#1740;&#1580;&#1607; &#1587;&#1608;&#1583;&#1605;&#1606;&#1583; 
&#1605;&#1578;&#1602;&#1575;&#1593;&#1583; &#1705;&#1606;&#1740;&#1605;&#1567; &#1580;&#1608;&#1575;&#1576; &#1576;&#1607; &#1575;&#1740;&#1606; &#1587;&#1608;&#1575;&#1604; &#1576;&#1607; &#1575;&#1606;&#1583;&#1575;&#1586;&#1607; &#1705;&#1575;&#1601;&#1740; &#1576;&#1585;&#1575;&#1740; &#1578;&#1589;&#1585;&#1601; &#1705;&#1585;&#1583;&#1606; &#1576;&#1602;&#1740;&#1607; 
&#1705;&#1578;&#1575;&#1576; &#1662;&#1740;&#1670;&#1740;&#1583;&#1607;&#8204;&#1575;&#1587;&#1578;&#1548; &#1575;&#1605;&#1575;  &#1575;&#1711;&#1585; &#1602;&#1585;&#1575;&#1585; &#1576;&#1575;&#1588;&#1583; &#1575;&#1740;&#1606; &#1605;&#1591;&#1604;&#1576; &#1583;&#1585; &#1740;&#1705; &#1593;&#1576;&#1575;&#1585;&#1578; &#1576;&#1740;&#1575;&#1606; &#1588;&#1608;&#1583;&#1548; 
&#1605;&#1740;&#8204;&#1578;&#1608;&#1575;&#1606; &#1711;&#1601;&#1578;: </p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#1575;&#1601;&#1585;&#1575;&#1583; &#1576;&#1575;&#1740;&#1583; &#1575;&#1585;&#1578;&#1576;&#1575;&#1591; &#1576;&#1575; &#1662;&#1585;&#1608;&#1688;&#1607; &#1585;&#1575; &#1575;&#1581;&#1587;&#1575;&#1587; &#1705;&#1606;&#1606;&#1583;&#1548; 
	  &#1608; &#1583;&#1585; &#1570;&#1606; &#1606;&#1601;&#1608;&#1584; &#1705;&#1606;&#1606;&#1583;&#1548; &#1608; &#1576;&#1607; &#1591;&#1608;&#1585; &#1605;&#1587;&#1578;&#1602;&#1740;&#1605; &#1608; &#1605;&#1578;&#1606;&#1575;&#1587;&#1576; &#1576;&#1575; &#1662;&#1585;&#1608;&#1688;&#1607; 
	  &#1607;&#1605;&#1705;&#1575;&#1585;&#1740; &#1705;&#1606;&#1606;&#1583;.</em></span></p></blockquote></div><p>&#1607;&#1740;&#1670; &#1602;&#1588;&#1585;&#1740; &#1575;&#1586; &#1578;&#1608;&#1587;&#1593;&#1607;&#8204;&#1583;&#1607;&#1606;&#1583;&#1711;&#1575;&#1606;&#1548; &#1740;&#1575; &#1578;&#1608;&#1587;&#1593;&#1607;&#8204;&#1583;&#1607;&#1606;&#1583;&#1711;&#1575;&#1606; &#1576;&#1575;&#1604;&#1602;&#1608;&#1607;&#1548; &#1606;&#1576;&#1575;&#1740;&#1583; &#1575;&#1581;&#1587;&#1575;&#1587; &#1578;&#1606;&#1586;&#1604; &#1608; 
&#1740;&#1575; &#1578;&#1576;&#1593;&#1740;&#1590; &#1576;&#1607; &#1583;&#1604;&#1575;&#1740;&#1604; &#1594;&#1740;&#1585;&#1601;&#1606;&#1740; &#1585;&#1575; &#1583;&#1575;&#1588;&#1578;&#1607; &#1576;&#1575;&#1588;&#1606;&#1583;[11]. &#1576;&#1607; &#1591;&#1608;&#1585; &#1608;&#1575;&#1590;&#1581;&#1548; &#1662;&#1585;&#1608;&#1688;&#1607;&#8204;&#1607;&#1575; &#1576;&#1575; 
&#1581;&#1605;&#1575;&#1740;&#1578; &#1588;&#1585;&#1705;&#1578;&#8204;&#1607;&#1575;&#1740; &#1576;&#1586;&#1585;&#1711; &#1608; / &#1740;&#1575; &#1578;&#1608;&#1587;&#1593;&#1607;&#8204;&#1583;&#1607;&#1606;&#1583;&#1711;&#1575;&#1606; &#1581;&#1602;&#1608;&#1602; &#1576;&#1711;&#1740;&#1585; &#1606;&#1740;&#1575;&#1586; &#1583;&#1575;&#1585;&#1606;&#1583; &#1705;&#1607; &#1583;&#1585; 
&#1575;&#1740;&#1606; &#1605;&#1587;&#1574;&#1604;&#1607; &#1576;&#1587;&#1740;&#1575;&#1585; &#1583;&#1602;&#1578; &#1576;&#1582;&#1585;&#1580; &#1583;&#1607;&#1606;&#1583;&#1548; &#1607;&#1605;&#1575;&#1606;&#1591;&#1608;&#1585; &#1705;&#1607; &#1583;&#1585; <a class="xref" href="money.html" title="&#1601;&#1589;&#1604; 5. Money">
      &#1601;&#1589;&#1604; 5, <i>Money</i></a>
&#1576;&#1575; &#1580;&#1586;&#1740;&#1740;&#1575;&#1578; &#1576;&#1740;&#1588;&#1578;&#1585;
&#1576;&#1581;&#1579; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;. &#1575;&#1604;&#1576;&#1578;&#1607;&#1548; &#1575;&#1740;&#1606; &#1576;&#1607; &#1605;&#1593;&#1606;&#1740; &#1575;&#1740;&#1606; &#1606;&#1740;&#1587;&#1578; &#1705;&#1607;  &#1575;&#1711;&#1585; &#1581;&#1605;&#1575;&#1740;&#1578; &#1588;&#1585;&#1705;&#1578;&#8204;&#1607;&#1575;&#1740; &#1576;&#1586;&#1585;&#1711; 
&#1608;&#1580;&#1608;&#1583; &#1606;&#1583;&#1575;&#1585;&#1583; &#1670;&#1740;&#1586;&#1740; &#1576;&#1585;&#1575;&#1740; &#1575;&#1740;&#1606;&#1705;&#1607; &#1583;&#1585;&#1605;&#1608;&#1585;&#1583; &#1570;&#1606; &#1606;&#1711;&#1585;&#1575;&#1606; &#1576;&#1575;&#1588;&#1740;&#1583; &#1608;&#1580;&#1608;&#1583; &#1606;&#1583;&#1575;&#1585;&#1583;. &#1662;&#1608;&#1604; &#1576;&#1607; 
&#1578;&#1606;&#1607;&#1575;&#1740;&#1740; &#1740;&#1705;&#1740; &#1575;&#1586; &#1607;&#1586;&#1575;&#1585;&#1575;&#1606; &#1593;&#1575;&#1605;&#1604;&#1740;&#1587;&#1578; &#1705;&#1607; &#1605;&#1740;&#8204;&#1578;&#1608;&#1575;&#1606;&#1583; &#1605;&#1608;&#1601;&#1602;&#1740;&#1578; &#1662;&#1585;&#1608;&#1688;&#1607; &#1585;&#1575; &#1578;&#1581;&#1578; &#1578;&#1575;&#1579;&#1740;&#1585; 
&#1602;&#1585;&#1575;&#1585; &#1583;&#1607;&#1583;. &#1607;&#1605;&#1670;&#1606;&#1740;&#1606; &#1575;&#1740;&#1606; &#1587;&#1608;&#1575;&#1604; &#1608;&#1580;&#1608;&#1583; &#1583;&#1575;&#1585;&#1583; &#1705;&#1607; &#1670;&#1607; &#1586;&#1576;&#1575;&#1606;&#1740;&#1548; &#1670;&#1607; &#1605;&#1580;&#1608;&#1586;&#1740;&#1548; &#1608; &#1670;&#1607; 
&#1601;&#1585;&#1570;&#1740;&#1606;&#1583; &#1578;&#1608;&#1587;&#1593;&#1607;&#8204;&#1575;&#1740;&#1548; &#1608; &#1583;&#1602;&#1740;&#1602;&#1570; &#1670;&#1607; &#1606;&#1608;&#1593; &#1586;&#1740;&#1585;&#1587;&#1575;&#1582;&#1578;&#8204;&#1607;&#1575;&#1740; &#1585;&#1575;&#1607;&#8204;&#1575;&#1606;&#1583;&#1575;&#1586;&#1740; &#1575;&#1606;&#1578;&#1582;&#1575;&#1576; &#1588;&#1608;&#1583;&#1548; 
&#1670;&#1711;&#1608;&#1606;&#1607; &#1570;&#1594;&#1575;&#1586; &#1576;&#1607; &#1705;&#1575;&#1585; &#1662;&#1585;&#1608;&#1688;&#1607; &#1585;&#1575; &#1576;&#1607; &#1591;&#1608;&#1585; &#1605;&#1608;&#1601;&#1602;&#1740;&#1578; &#1570;&#1605;&#1740;&#1586; &#1576;&#1607; &#1575;&#1591;&#1604;&#1575;&#1593; &#1593;&#1605;&#1608;&#1605; &#1576;&#1585;&#1587;&#1575;&#1606;&#1740;&#1605;&#1548; 
&#1608; &#1594;&#1740;&#1585;&#1607;. &#1588;&#1585;&#1608;&#1593; &#1662;&#1585;&#1608;&#1688;&#1607; &#1605;&#1608;&#1590;&#1608;&#1593; <a class="link" href="getting-started.html" title="&#1601;&#1589;&#1604; 2. Getting Started"> &#1601;&#1589;&#1604; &#1576;&#1593;&#1583;&#1740; 
</a> &#1575;&#1587;&#1578;.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="introduction.html">&#1602;&#1576;&#1604;&#1740;</a> </td><td width="20%" align="center"><a accesskey="u" href="introduction.html">&#1576;&#1575;&#1604;&#1575;</a></td><td width="40%" align="left"> <a accesskey="n" href="getting-started.html">&#1576;&#1593;&#1583;&#1740;</a></td></tr><tr><td width="40%" align="right" valign="top">
      &#1601;&#1589;&#1604; 1. &#1605;&#1602;&#1583;&#1605;&#1607; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1582;&#1575;&#1606;&#1607;</a></td><td width="40%" align="left" valign="top"> 
      &#1601;&#1589;&#1604; 2. Getting Started</td></tr></table></div></body></html>
