<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Mul&#539;umiri</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producerea de software open-source"><link rel="up" href="preface.html" title="Prefa&#539;&#259;"><link rel="prev" href="sources.html" title="Surse"><link rel="next" href="disclaimer.html" title="Preciz&#259;ri (limitare a responsabilit&#259;&#539;ii)"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Mul&#539;umiri</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="sources.html">Înapoi</a> </td><th width="60%" align="center">Prefa&#539;&#259;</th><td width="20%" align="right"> <a accesskey="n" href="disclaimer.html">Înainte</a></td></tr></table><hr></div><div class="sect1" title="Mul&#539;umiri"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="acknowledgments"></a>Mul&#539;umiri</h2></div></div></div><p>Cartea aceasta mi-a ocupat de patru ori mai mult timp decât 
am anticipat &#537;i mult timp am sim&#539;it-o ca pe un pian suspendat deasupra
capului meu oriunde mergeam. F&#259;r&#259; ajutorul multor oameni nu a&#537; fi putut
s-o termin &#537;i s&#259; r&#259;mân s&#259;n&#259;tos.</p><p>Andy Oram, editorul meu de la O'Reilly, a fost pentru mine visul 
oric&#259;rui scriitor. Pe lâng&#259; faptul c&#259; deja cunoa&#537;te îndeaproape domeniul (
el a sugerat o mare parte din subiecte), are &#537;i rarul talent de a &#537;ti ce
vreau s&#259; transmit &#537;i s&#259; m&#259; ajute s&#259; g&#259;sesc formularea corect&#259;. A fost o onoare
s&#259; lucrez al&#259;turi de el. Îi mul&#539;umesc de asemenea lui Chuck Toporek care a 
direc&#539;ionat propunerea mea c&#259;tre Andy imediat.</p><p>Brian Fitzpatrick a corectat aproape întregul material pe m&#259;sur&#259; 
ce îl scriam ceea ce nu numai c&#259; a f&#259;cut cartea mai bun&#259; dar m-a convins
s&#259; continui s&#259; scriu atunci când a&#537; fi vrut s&#259; fiu oriunde în lume dar nu în fa&#539;a
calculatorului. Ben Collins-Sussman &#537;i Mike Pilato au supravegheat &#537;i ei progresul
&#537;i au fost întotdeauna dornici s&#259; discute &#8212;câteodat&#259; în am&#259;nun&#539;ime&#8212;
orice tem&#259; doream s&#259; acop&#259;r într-o anumit&#259; s&#259;pt&#259;mân&#259;. Ei au observat &#537;i când am
încetinit &#537;i m-au mustrat cu blânde&#539;e când a fost nevoie. V&#259; mul&#539;umesc, b&#259;ie&#539;i.</p><p>Biella Coleman î&#537;i scria dizerta&#539;ia în acela&#537;i timp în care eu scriam aceast&#259;
carte. Ea &#537;tie ce înseam&#259; s&#259; te a&#537;ezi &#537;i s&#259; scrii în fiecare zi &#537;i mi-a fost atât exemplu
cât &#537;i ureche plin&#259; de simpatie. De asemenea, ea are o viziune interesant&#259;, de
antropolog, a mi&#537;c&#259;rii pentru software gratuit &#537;i mi-a dat idei &#537;i referin&#539;e
pe care le-am putut folosi în carte. Alex Golub&#8212;un alt antropolog cu 
un picior în lumea software-ului gratuit care î&#537;i termina dizerta&#539;ia în aceea&#537;i
perioad&#259;&#8212; a fost de un mare sprijin la începutul proiectului, ceea ce m-a ajutat
considerabil.</p><p>Micah Anderson niciodat&#259; nu p&#259;rea prea asuprit de propria lui munc&#259; de scris,
ceea ce m-a inspirat într-un mod bolnav &#537;i generator de invidie, dar mi-a
oferit întotdeauna prietenie, conversa&#539;ie &#537;i (cel pu&#539;in o dat&#259;) suport tehnic.
Mul&#539;umesc, Micah!</p><p>Jon Trowbridge &#537;i Sander Striker mi-au oferit atât încuraj&#259;ri cât
&#537;i ajutor concret&#8212;experien&#539;a lor vast&#259; în domeniu mi-a oferit material
pe care nu l-a&#537; fi putut ob&#539;ine altfel.</p><p>Îi mul&#539;umesc lui Greg Stein nu numai pentru prietenia &#537;i
încuraj&#259;rile venite la momentul potrivit dar &#537;i pentru c&#259; a ar&#259;tat proiectului
Subversion cât de important&#259; este revederea regulat&#259; a codului pentru construirea
unei comunit&#259;&#539;i de programatori. Mul&#539;umiri &#537;i lui Brian Behlendorf, care
ne-a b&#259;gat în cap cu tact importan&#539;a discu&#539;iilor purtate public; sper ca acest
principiu s&#259; fie reflectat în cuprinsul acestei c&#259;r&#539;i.</p><p>Mul&#539;umiri lui Benjamin "Mako" Hill &#537;i Seth Schoen, pentru diferite
conversa&#539;ii despre software-ul gratuit &#537;i politica lui; lui Zack Urlocker
&#537;i Louis Suarez-Potts pentru c&#259; au rezervat timp în programele lor înc&#259;rcate
pentru un interviu; lui Shane de pe lista Slashcode pentru c&#259; mi-a permis s&#259;
citez post-ul lui; &#537;i lui Haggen So pentru ajutorul enorm acordat în compararea 
site-urilor de hosting.</p><p>Le mul&#539;umesc &#537;i lui Alla Dekhtyar, Polina, &#537;i Sonya pentru încuraj&#259;rile lor
r&#259;bd&#259;toare. Sunt foarte fericit c&#259; nu mai e nevoie s&#259; închei (sau, s&#259; încerc f&#259;r&#259; 
succes s&#259; închei) serile noastre împreun&#259; devreme pentru a merge acas&#259; s&#259; lucrez la
&#8221;carte&#8221;</p><p>Mul&#539;umiri &#537;i lui Jack Repenning pentru prietenie, conversa&#539;ie &#537;i refuzul
înc&#259;p&#259;&#539;ânat de a accepta vreodat&#259; o analiz&#259; u&#537;oar&#259; &#537;i gre&#537;it&#259; atunci când
exist&#259; una mai dificil&#259; dar corect&#259;. Sper ca o parte din experien&#539;a lui îndelungat&#259;
cu dezvoltarea de aplica&#539;ii &#537;i industria software s&#259; se resimt&#259; în aceast&#259; carte.</p><p>Compania CollabNet a fost extrem de generoas&#259; pentru c&#259; mi-a permis s&#259; 
am un program flexibil în care s&#259; scriu &#537;i nu s-a plâns pentru c&#259; a durat mult mai mult
decât planificasem anterios. Nu cunosc toate detaliile modului în care conducerea
ia astfel de decizii dar suspectez c&#259; Sandhya Klute &#537;i, mai apoi, Mahesh Murthy 
au avut ceva de-a face cu asta&#8212;le mul&#539;umesc amândurora</p><p>Întreaga echip&#259; de dezvoltare a proiectului Subversion a fost inspira&#539;ia mea
în ultimii cinci ani &#537;i mult din ce am cuprins în aceast&#259; carte am înv&#259;&#539;at lucrând cu ei.
Nu o s&#259; îi men&#539;ionez pe to&#539;i aici dup&#259; nume pentru c&#259; sunt prea mul&#539;i dar rog fiecare
cititor care se întâlne&#537;te cu unul dintre participan&#539;ii la proiect s&#259;-i cumpere
imediat o b&#259;utur&#259; la alegere&#8212;eu unul a&#537;a voi face.</p><p>De multe ori m-am plâns lui Rachel Scollon despre starea c&#259;r&#539;ii;
ea a fost întotdeauna dornic&#259; s&#259; asculte &#537;i, cumva, a reu&#537;it s&#259; fac&#259; problemele
s&#259; par&#259; mai mici decât înaintea discu&#539;iei&#8212;mul&#539;umesc.</p><p>Îi mul&#539;umesc din nou lui Noel Taylor, care sigur s-a întrebat de ce
am vrut s&#259; scriu înc&#259; o carte dat fiind cât m-am plâns data trecut&#259; dar a c&#259;rui
prietenie &#537;i bun&#259; conducere a Golosá au f&#259;cut ca muzica &#537;i compania pl&#259;cut&#259;
s&#259; r&#259;mân&#259; în via&#539;a mea chiar &#537;i în cele mai aglomerate momente. Le mul&#539;umesc &#537;i lui
Matthew Dean &#537;i Dorothea Samtleben, prieteni &#537;i parteneri în muzic&#259;, care au fost
foarte în&#539;eleg&#259;tori c&#259; nu exersam. Megan Jennings m-a sprijinit în mod constant &#537;i
a fost interesat&#259; de subiect chiar dac&#259; nu îi era cunoscut&#8212;un tonifiant 
bun pentru un scriitor nesigur.  Mul&#539;umesc, prieteni!</p><p>Am avut patru recenzori plini de cuno&#537;tin&#539;e &#537;i silitori pentru aceast&#259;
carte: Yoav Shapira, Andrew Stellman, Davanum Srinivas, &#537;i Ben Hyde. Dac&#259;
a&#537; fi reu&#537;it s&#259; includ toate sugestiile lor excelente, aceast&#259; carte ar fi fost
mai bun&#259;. A&#537;a cum s-a întâmplat, constrângerile de timp m-au obligat s&#259; aleg 
dintre ele dar îmbun&#259;t&#259;&#539;irile au fost oricum semnificative. Orice gre&#537;eli care 
au mai r&#259;mas sunt în întregime ale mele.</p><p>P&#259;rin&#539;ii mei, Frances &#537;i Henry, m-au sprijinit la fel de mult ca întotdeauna,
&#537;i, de vreme ce aceast&#259; carte e mai pu&#539;in tehnic&#259; decât cea anterioar&#259;, sper c&#259;
li se va p&#259;rea mai u&#537;or de citit.</p><p>În cele din urm&#259; a&#537; vrea s&#259; le mul&#539;umesc celor c&#259;rora le dedic cartea aceasta,
Karen Underhill &#537;i Jim Blandy. Prietenia &#537;i în&#539;elegerea lui Karen au însemnat
totul pentru mine, nu doar în timp ce am scris aceast&#259; carte ci în ultimii &#537;apte
ani. Nu a&#537; fi putut termina cartea f&#259;r&#259; ajutorul ei. De asemenea pentru Jim,
un prieten adev&#259;rat &#537;i un hacker al hacker-ilor, care m-a înv&#259;&#539;at despre 
open-source cam la fel cum o pas&#259;re ar putea înv&#259;&#539;a un avion s&#259; zboare.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="sources.html">Înapoi</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Sus</a></td><td width="40%" align="right"> <a accesskey="n" href="disclaimer.html">Înainte</a></td></tr><tr><td width="40%" align="left" valign="top">Surse </td><td width="20%" align="center"><a accesskey="h" href="index.html">Acas&#259;</a></td><td width="40%" align="right" valign="top"> Preciz&#259;ri (limitare a responsabilit&#259;&#539;ii)</td></tr></table></div></body></html>
