<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Cap. 2. Începutul</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producerea de software open-source"><link rel="up" href="index.html" title="Producerea de software open-source"><link rel="prev" href="today.html" title="Situa&#539;ia ast&#259;zi"><link rel="next" href="license-quickstart.html" title="Choosing a License and Applying It"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Cap. 2. Începutul</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="today.html">Înapoi</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="license-quickstart.html">Înainte</a></td></tr></table><hr></div><div class="chapter" title="Cap. 2. Începutul"><div class="titlepage"><div><div><h2 class="title"><a name="getting-started"></a>Cap. 2. Începutul</h2></div></div></div><div class="toc"><p><b>Cuprins</b></p><dl><dt><span class="sect1"><a href="getting-started.html#starting-from-what-you-have">Cum s&#259; începi cu ce exist&#259; deja</a></span></dt><dd><dl><dt><span class="sect2"><a href="getting-started.html#choosing-a-name">Alegerea unui nume bun</a></span></dt><dt><span class="sect2"><a href="getting-started.html#mission-statement">Stabili&#539;i o declara&#539;ie a misiunii clar&#259;</a></span></dt><dt><span class="sect2"><a href="getting-started.html#state-freedom">Afirma&#539;i c&#259; proiectul este liber</a></span></dt><dt><span class="sect2"><a href="getting-started.html#features-and-requirements">Lista de posibilit&#259;&#539;i &#537;i cerin&#539;e</a></span></dt><dt><span class="sect2"><a href="getting-started.html#development-status">Starea dezvolt&#259;rii</a></span></dt><dt><span class="sect2"><a href="getting-started.html#downloads">Download-uri</a></span></dt><dt><span class="sect2"><a href="getting-started.html#vc-and-bug-tracker-access">Version Control and Bug Tracker Access</a></span></dt><dt><span class="sect2"><a href="getting-started.html#communications-channels">Communications Channels</a></span></dt><dt><span class="sect2"><a href="getting-started.html#developer-guidelines">Developer Guidelines</a></span></dt><dt><span class="sect2"><a href="getting-started.html#documentation">Documentation</a></span></dt><dd><dl><dt><span class="sect3"><a href="getting-started.html#documentation-availability">Availability of documentation</a></span></dt><dt><span class="sect3"><a href="getting-started.html#developer-documentation">Developer documentation</a></span></dt></dl></dd><dt><span class="sect2"><a href="getting-started.html#example-output">Example Output and Screenshots</a></span></dt><dt><span class="sect2"><a href="getting-started.html#starting-with-canned-hosting">Canned Hosting</a></span></dt></dl></dd><dt><span class="sect1"><a href="license-quickstart.html">Choosing a License and Applying It</a></span></dt><dd><dl><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-non-gpl">The "Do Anything" Licenses</a></span></dt><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-gpl">The GPL</a></span></dt><dt><span class="sect2"><a href="license-quickstart.html#license-quickstart-applying">How to Apply a License to Your Software</a></span></dt></dl></dd><dt><span class="sect1"><a href="setting-tone.html">Setting the Tone</a></span></dt><dd><dl><dt><span class="sect2"><a href="setting-tone.html#avoid-private-discussions">Avoid Private Discussions</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#prevent-rudeness">Nip Rudeness in the Bud</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#code-review">Practice Conspicuous Code Review</a></span></dt><dt><span class="sect2"><a href="setting-tone.html#opening-closed-projects">When Opening a Formerly Closed Project, be Sensitive to the
Magnitude of the Change</a></span></dt></dl></dd><dt><span class="sect1"><a href="announcing.html">Announcing</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>Modelul clasic al ini&#539;ierii unui proiect de software liber a fost
creat de Eric Raymond, într-un articol acum faimos despre proiecte
open-source intitulat <em class="citetitle">Catedrala &#537;i bazarul</em>.  
El scria:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Fiecare exemplu de software bun începe prin a 
      sc&#259;rpina o mânc&#259;rime a unui dezvoltator.</em></span></p><p>(din <span class="bold"><strong><a class="ulink" href="http://www.catb.org/~esr/writings/cathedral-bazaar/" target="_top">http://www.catb.org/~esr/writings/cathedral-bazaar/</a>
      </strong></span>)</p></blockquote></div><p>Trebuie re&#539;inut faptul c&#259; Rayomnd nu a spus c&#259; proiectele open-source
apar doar când un individ simte o nevoie. Mai degrab&#259; spunea c&#259; aplica&#539;iile
<span class="emphasis"><em>bune</em></span> rezult&#259; atunci când programatorul are un
interes personal în a-&#537;i vedea problema rezolvat; relevan&#539;a fa&#539;&#259;
de software-ul liber este c&#259; preocuparea personal&#259; reprezenta cea mai
des întâlnit&#259; motiva&#539;ie pentru ini&#539;ierea unui astfel de proiect.</p><p>&#536;i în zilele noastre tot a&#537;a pornesc majoritatea proiectelor de 
software liber, dar mai pu&#539;in decât în 1997, când Raymond a scris aceste
cuvinte. Ast&#259;zi, avem fenomenul organiza&#539;iilor&#8212;inclusiv corpora&#539;ii
în c&#259;utare de profit&#8212;care ini&#539;iaz&#259; proiecte mari, administrate
centralizat, de la zero. Programatorul singuratic, care scrie ni&#537;te cod
pentru a rezolva o problem&#259; &#537;i care, mai apoi, realizeaz&#259; c&#259; rezultatul
are o aplicabilitate mai mare, este înc&#259; sursa multor proiecte de software
liber dar aceasta nu mai este unica poveste.</p><p>Punctul de vedere al lui Raymond este, înc&#259;, pertinent. Condi&#539;ia
esen&#539;ial&#259; este ca produc&#259;torii software-ului s&#259; aiba un interes direct
în succesul acestuia, pentru c&#259; ei în&#537;i&#537;i îl folosesc. Dac&#259; aplica&#539;ia nu
face exact ceea ce ar trebui, persoana sau organiza&#539;ia care o produce va
sim&#539;i acest lucru în munca de zi cu zi. De exemplu, proiectul OpenAdapter 
(<a class="ulink" href="http://www.openadapter.org/" target="_top">http://www.openadapter.org/</a>), ini&#539;iat de bancherul
Dresdner Kleinwort Wasserstein ca o platform&#259; open-source pentru 
integrarea sistemelorde informa&#539;ii financiare disparate, nu se poate
spune c&#259; adreseaz&#259; problema individual&#259; a vreunui programator. El rezolv&#259;
o problem&#259; institu&#539;ional&#259;. Dar problema aceasta apare direct din 
experien&#539;ele institu&#539;iei &#537;i a partenerilor ei &#537;i de aceea, dac&#259; proiectul
nu reu&#537;e&#537;te s&#259; ofere solu&#539;ii, ei vor &#537;ti. Acest lucru produce software
de calitate pentru c&#259; bucla de reglaj func&#539;ioneaz&#259; în direc&#539;ia potrivit&#259;.
Programul nu se scrie pentru a fi vândut altcuiva care s&#259;  <span class="emphasis"><em>î&#537;i</em></span> rezolve
problema.  Este scris pentru a rezolva o problem&#259; <span class="emphasis"><em>proprie
</em></span> &#537;i apoi distribuit altora, la fel ca &#537;i când problema ar fi 
o boal&#259; iar aplica&#539;ia medicamentul a c&#259;rui distribu&#539;ie vrea s&#259; elimine
complet epidemia.</p><p>Capitolul acesta discut&#259; cum s&#259; prezin&#539;i o aplica&#539;ie liber&#259; nou&#259;
lumii dar multe dintre recomand&#259;rile lui pot s&#259; par&#259; cunoscute unei
organiza&#539;ii de s&#259;n&#259;tate care distribuie medicamente. Scopurile sunt
asem&#259;n&#259;toare: Vrei s&#259; fie clar ce face medicamentul, s&#259; ajung&#259; în mâinile
oamenilor potrivi&#539;i &#537;i s&#259; fii sigur c&#259; persoanele care îl vor primi &#537;tiu
cum s&#259; îl foloseasc&#259;. În cazul software-ului, vrei de asemenea s&#259; atragi
unii dintre cei care îl primesc în activitatea de cercetare pentru a
îmbun&#259;t&#259;&#539;i medicamentul.</p><p>Distribuirea de software gratuit e o problem&#259; cu dou&#259; t&#259;i&#537;uri. 
Aplica&#539;ia trebuie s&#259; strâng&#259; utilizatori &#537;i dezvoltatori. Aceste dou&#259; 
nevoi nu se afl&#259; neap&#259;rat în conflict dar adaug&#259; pu&#539;in&#259; complexitate
modului de prezentare ini&#539;ial&#259; a proiectului. O parte a informa&#539;iei
e util&#259; pentru amândou&#259; mediile, o alt&#259; parte doar pentru unul dintre ele.
Amândou&#259; tipurile de informa&#539;ie trebuie s&#259; subscrie principiului unei
prezent&#259;ri scalate; mai precis, gradul de detaliu prezentat în fiecare
etap&#259; trebuie s&#259; corespund&#259; în mod direct timpului &#537;i efortului depus
de cititor. Efortul mai mare trebuie s&#259; corespund&#259; recompensei mai mari.
Când cele dou&#259; nu sunt corelate îndeaproape, oamenii î&#537;i pierd
repede credin&#539;a &#537;i nu mai depun efort.</p><p>Corolarul este c&#259; <span class="emphasis"><em>aparen&#539;ele conteaz&#259;</em></span>.  
Programatorii, în special, nu vor s&#259; cread&#259; acest lucru de multe ori.
Dragostea lor de fond peste form&#259; este aproape un punct de mândrie
profesional&#259;. Nu e accidental faptul c&#259; atât de mul&#539;i programatori au
o antipatie fa&#539;&#259; de marketing &#537;i rela&#539;ii publice, nici c&#259; designerii
profesioni&#537;ti sunt, de multe ori, oripila&#539;i de ceea ce creeaz&#259; 
programatorii pe cont propriu.</p><p>E de regretat acest lucru pentru c&#259; exist&#259; situa&#539;ii în care forma
<span class="emphasis"><em>este &#537;i</em></span> fond, iar prezentarea proiectului este una
dintre ele. De exemplu, primul lucru pe care îl afl&#259; un vizitator 
despre un proiect este cum arat&#259; site-ul web. Informa&#539;ia aceasta
e absorbit&#259; înainte ca orice parte din con&#539;inutul site-ului
s&#259; fie în&#539;eles&#8212;înainte s&#259; se fi citit vreun text sau s&#259; se fi
dat click pe un link. Oricât de nedrept ar putea s&#259; par&#259;, oamenii nu se
pot ab&#539;ine de la a-&#537;i forma o prim&#259; impresie imediat. Aspectul site-ului
arat&#259; dac&#259; s-a realizat prezentarea proiectului cu grij&#259;. Majoritatea
putem s&#259; ne d&#259;m seama din prima dac&#259; un site a fost creat în grab&#259; sau
a fost gândit cu aten&#539;ie. Asta este prima informa&#539;ie pe care proiectul
vostru o ofer&#259; &#537;i impresia pe care o creeaz&#259; se va transfera mai apoi
restului proiectului prin asocia&#539;ie.</p><p>Astfel, în vreme ce o mare parte din acest capitol vorbe&#537;te de
con&#539;inutul cu care trebuie s&#259; înceap&#259; proiectul vostru, trebuie s&#259;
v&#259; aminti&#539;i &#537;i c&#259; aspectul acestuia conteaz&#259;. Pentru c&#259; site-ul
proiectului trebuie s&#259; func&#539;ioneze pentru dou&#259; tipuri diferite de 
vizitatori&#8212;utilizatori &#537;i dezvoltatori&#8212;trebuie acordat&#259; mult&#259;
aten&#539;ie clarit&#259;&#539;ii &#537;i franche&#539;ii. De&#537;i nu este locul potrivit pentru un
tratat general despre design-ul de pagini web, un principiu e destul
de important pentru a merita s&#259; fie men&#539;ionat, în special când site-ul
serve&#537;te mai multor audien&#539;e (poate suprapuse): oamenii trebuie s&#259; aib&#259;
o idee despre unde îi va duce un link înainte de a da click pe el. De 
exemplu, trebuie s&#259; fie evident <span class="emphasis"><em>doar privind link-ul
</em></span> c&#259;tre documenta&#539;ia pentru utilizatori c&#259; el duce c&#259;tre
documenta&#539;ia pentru utilizatori &#537;i nu c&#259;tre cea pentru dezvoltatori.
Conducerea unui proiect înseamn&#259;, pe de-o parte, furnizarea de informa&#539;ii
dar &#537;i asigurarea comfortului. Simpla prezen&#539;&#259; a anumitor oferte 
standard, în locurile a&#537;teptate, d&#259; asigur&#259;ri utilizatorilor &#537;i 
dezvoltatorilor care se gândesc dac&#259; s&#259; se implice. Spune faptul c&#259;
acest proiect e bine organizat, a anticipat întreb&#259;rile pe care 
oamenii le vor pune, &#537;i a f&#259;cut un efort pentru a r&#259;spunde la ele 
într-un mod care s&#259; necesite un efort minim din partea celui care
întreab&#259;. Emanând aceast&#259; aur&#259; de preg&#259;tire, proiectul trimite un mesaj:
&#8222;Timpul vostru nu va fi irosit dac&#259; v&#259; implica&#539;i&#8221;, care e exact ceea
ce vor oamenii s&#259; aud&#259;.</p><div class="sect2" title="Dar, prima dat&#259;, prive&#537;te în jur"><div class="titlepage"><div><div><h3 class="title"><a name="look-around"></a>Dar, prima dat&#259;, prive&#537;te în jur</h3></div></div></div><p>Înainte de a începe un proiect open-source, trebuie f&#259;cut un lucru
important:</p><p>Întotdeauna uita&#539;i-v&#259; dac&#259; nu exist&#259; un proiect care s&#259; fac&#259;
exact ceea ce vre&#539;i. &#536;ansele sunt destul de mari ca, oricare ar fi
problema pe care o vre&#539;i rezolvat&#259; acum, altcineva s-o fi rezolvat-o
înainte. Dac&#259; au rezolvat-o &#537;i au distribuit &#537;i codul cu o licen&#539;&#259; liber&#259;,
atunci nu exist&#259; niciun motiv pentru a reinventa roata ast&#259;zi. Exist&#259;, 
desigur, &#537;i excep&#539;ii: dac&#259; vre&#539;i s&#259; porni&#539;i un proiect ca pe o experien&#539;&#259;
educa&#539;ional&#259;, codul pre-existent nu v&#259; va ajuta; poate c&#259; proiectul la
care v&#259; gândi&#539;i e atât de specializat încât nu exist&#259; nicio &#537;ans&#259; ca
oricine altcineva s&#259; o fi facut-o. Dar, în general, nu exist&#259; nici un 
sens în a nu c&#259;uta &#537;i recompensa poate fi mare. Dac&#259; motoarele normale
de c&#259;utare pe Internet nu returneaz&#259; nimic, încerca&#539;i s&#259; c&#259;uta&#539;i pe: 
<a class="ulink" href="http://freecode.com/" target="_top">http://freecode.com/</a> (un site de &#537;tiri legate de 
proiecte open-source, despre care se va discuta mai mult mai încolo), pe
<a class="ulink" href="http://www.sourceforge.net/" target="_top">http://www.sourceforge.net/</a> &#537;i în directorul de software
liber al Funda&#539;iei pentru Software Liber la adresa:
<a class="ulink" href="http://directory.fsf.org/" target="_top">http://directory.fsf.org/</a>.</p><p>Chiar dac&#259; nu g&#259;se&#537;ti exact ceea ce cau&#539;i, s-ar putea s&#259; 
g&#259;se&#537;ti ceva atât de apropiat încât s&#259; aib&#259; sens s&#259; te al&#259;turi 
proiectului &#537;i s&#259; adaugi func&#539;ionalitate decât s&#259; începi de la zero
de unul singur.</p></div></div><div class="sect1" title="Cum s&#259; începi cu ce exist&#259; deja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="starting-from-what-you-have"></a>Cum s&#259; începi cu ce exist&#259; deja</h2></div></div></div><p>Te-ai uitat în jur, ai v&#259;zut c&#259; nimic din ce exist&#259; nu se 
potrive&#537;te nevoilor tale, &#537;i ai decis s&#259; ini&#539;iezi un proiect nou.</p><p>Ce faci acum?</p><p>Cea mai grea parte când lansezi un proiect de software liber e
s&#259; transformi o viziune privat&#259; într-una public&#259;. Tu sau organiza&#539;ia ta
poti s&#259; &#537;tii foarte bine ceea ce vrei dar exprimarea acestui scop
într-un mod comprehensibil lumii necesit&#259; un volum apreciabil de lucru.
Cu toate acestea, e esen&#539;ial s&#259; asiguri timpul necesar pentru a o face.
Tu &#537;i ceilal&#539;i fondatori trebuie s&#259; decide&#539;i la ce se refer&#259; exact
proiectul&#8212;adic&#259; s&#259; decide&#539;i care sunt limit&#259;rile lui, ceea ce 
<span class="emphasis"><em>nu</em></span> va face precum &#537;i ceea ce va putea face&#8212;&#537;i
s&#259; scrie&#539;i o declara&#539;ie a misiunii. Aceast&#259; parte nu e, de obicei, prea
dificil&#259; de&#537;i poate uneori s&#259; scoat&#259; la iveal&#259; presupuneri nerostite sau
chiar neîn&#539;elegeri despre natura proiectului, ceea ce e un lucru bun:
e mai bine s&#259; le rezolva&#539;i acum decât mai târziu. Urm&#259;torul pas este
de a preg&#259;ti proiectul pentru consumul public, etap&#259; care este una
extrem de grea.</p><p>Ceea ce face aceast&#259; parte atât de laborioas&#259; este faptul c&#259; ea
presupune organizarea &#537;i documentarea lucrurilor pe care toat&#259; lumea le
&#537;tie deja&#8212;&#8222;toat&#259; lumea&#8221; înseamn&#259; to&#539;i cei care au fost implica&#539;i
în proiect pân&#259; acum. Astfel, pentru oamenii care execut&#259; aceast&#259; munc&#259;,
nu exist&#259; niciun beneficiu imediat. Ei nu au nevoie de un fi&#537;ier
<code class="filename">README</code> care s&#259; dea o descriere a proiectului &#537;i
nici de un document de design sau manual de utilizator. Ei nu au nevoie
de un arbore de cod bine ordonat, conform standardelor informale dar
acceptate pe scar&#259; larg&#259; ale distribu&#539;iei surselor software.
Indiferent cum ar fi aranjat codul, pentru ei este în regul&#259; pentru c&#259;
deja cunosc structura &#537;i, dac&#259; exist&#259; un cod executabil, &#537;tiu &#537;i cum s&#259;
îl foloseasc&#259;. Nu conteaz&#259;, pentru ei, nici dac&#259; presupunerile 
arhitecturale fundamentale ale proiectului r&#259;mân nedocumentate; ei deja
sunt familiariza&#539;i &#537;i cu acestea.</p><p>Pe de alt&#259; parte, nou veni&#539;ii au nevoie de aceste lucruri. Din 
fericire, ei nu au nevoie de toate odat&#259;. Nu e nevoie s&#259; se furnizeze
toate resursele posibile înainte de a transforma proiectul în unul public.
Într-o lume perfect&#259;, poate, fiecare proiect open-source nou &#537;i-ar
începe via&#539;a cu un document de design cuprinz&#259;tor, un manual complet
pentru utilizatori (cu marcaje speciale pentru op&#539;iunile planificate
dar înc&#259; neimplementate), cod bine &#537;i frumos împachetat, capabil s&#259;
ruleze pe orice platform&#259; de execu&#539;ie, &#537;i a&#537;a mai departe. În realitate,
rezolvarea tuturor acestor probleme ar fi un mare consumator de timp &#537;i,
oricum, e o munc&#259; pentru care dezvoltatorii se pot a&#537;tepta &#537;i la ajutor
din partea din partea voluntarilor odat&#259; ce proiectul a început.</p><p>Ce <span class="emphasis"><em>este</em></span> totu&#537;i necesar este s&#259; se 
investeasc&#259; destul în prezentare astfel încât nou-veni&#539;ii s&#259; poat&#259; trece
u&#537;or peste obstacolul ini&#539;ial al lipsei de familiaritate. Imagina&#539;i-v&#259;
c&#259; este primul pas dintr-un proces de bootstrapping, de a aduce proiectul
la un fel de nivel minim de energie pentru activare. Am auzit oameni
numind acest prag ca &#537;i <em class="firstterm">energie de hacktivare</em>:
cantitatea de efort pe care un nou-venit trebuie s&#259;-l depun&#259; înainte de
a primi ceva în schimbul timpului lui. Cu cât nivelul acestei energii
e mai sc&#259;zut, cu atât mai bine. Prima etap&#259; presupune aducerea acestui
nivel suficient de jos încât oamenii s&#259; fie încuraja&#539;i s&#259; se implice.
</p><p>Fiecare dintre urm&#259;toarele subsec&#539;iuni descrie un aspect
important al ini&#539;ierii unui proiect. Ele sunt prezentate aproximativ
în ordinea în care un vizitator nou le-ar întâlni de&#537;i ordinea în care
ar fi implementate în realitate ar fi diferit&#259;. Pute&#539;i s&#259; le trata&#539;i ca
o list&#259; de verific&#259;ri. Când porni&#539;i un proiect parcurge&#539;i lista &#537;i
asigura&#539;i-v&#259; c&#259; fiecare aspect e tratat sau cel pu&#539;in c&#259; v&#259; sim&#539;i&#539;i
confortabil cu consecin&#539;ele poten&#539;iale dac&#259; a&#539;i omis una dintre ele.
</p><div class="sect2" title="Alegerea unui nume bun"><div class="titlepage"><div><div><h3 class="title"><a name="choosing-a-name"></a>Alegerea unui nume bun</h3></div></div></div><p>Pune&#539;i-v&#259; în pantofii cuiva care tocmai a auzit despre proiect,
poate chiar în urma c&#259;ut&#259;rii unei aplica&#539;ii care s&#259; rezolve o problem&#259;.
Primul lucru pe care îl vor observa va fi numele proiectului.</p><p>Un nume bun nu va aduce automat succesul proiectului la fel cum
un nume r&#259;u nu-l va blestema&#8212;de&#537;i, în realitate, un nume
<span class="emphasis"><em>foarte,</em></span>r&#259;u ar putea face asta, vom porni de la
presupunerea c&#259; niciunul dintre cititori nu vrea s&#259;-&#537;i fac&#259; proiectul
s&#259; e&#537;ueze. Cu toate acestea, un nume r&#259;u poate încetini rata de adop&#539;ie
a proiectului, fie pentru c&#259; oamenii nu-l consider&#259; serios, fie pentru c&#259;
pur &#537;i simplu nu pot s&#259;-l re&#539;in&#259;.</p><p>Un nume bun:

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>D&#259; o idee despre ceea ce face proiectului sau are m&#259;car
  				o leg&#259;tur&#259; evident&#259;, astfel încât, dac&#259; o persoan&#259; &#537;tie
  				numele &#537;i ceea ce face proiectul, s&#259; poat&#259; reg&#259;si
  				rapid numele în memorie mai târziu.</p></li><li class="listitem"><p>E u&#537;or de re&#539;inut. Nu se poate trece peste faptul c&#259;
  				engleza este limba standard a Internet-ului. &#8222;u&#537;or de memorat&#8221;
  				înseamn&#259; &#8222;u&#537;or de memorat pentru o persoan&#259; care &#537;tie bine
  				englez&#259;&#8221;. Numele care sunt glume dependente de pronun&#539;ia
  				unui vorbitor nativ, de exemplu, vor fi opace pentru mul&#539;i
  				vorbitori nenativi de englez&#259;. Dac&#259; gluma este foarte 
  				conving&#259;toare &#537;i memorabil&#259;, ar putea fi totu&#537;i folosit&#259;; 
  				&#539;ine&#539;i doar minte faptul c&#259; majoritatea oamenilor care v&#259;d
  				numele nu &#537;i-l vor imagina în cap în acela&#537;i mod cum ar
  				face-o un vorbitor nativ.</p></li><li class="listitem"><p>Nu este identic cu numele altui proiect &#537;i nu încalc&#259;
  				nicio marc&#259; înregistrat&#259;. Aici nu e vorba doar de bune maniere
  				ci &#537;i de aspectul legal. Nu vre&#539;i s&#259; ave&#539;i parte de o 
  				confuzie de identitate. E destul de greu s&#259; urm&#259;re&#537;ti toate
  				proiectele care sunt disponibile pe net f&#259;r&#259; a avea
  				proiecte diferite care poart&#259; acela&#537;i nume.</p><p>Resursele men&#539;ionate anterior la
            <a class="xref" href="getting-started.html#look-around" title="Dar, prima dat&#259;, prive&#537;te în jur">&#8222;Dar, prima dat&#259;, prive&#537;te în jur&#8221;</a> sunt utile pentru
            desoperirea faptului c&#259; alt proiect are deja numele la
            care v&#259; gândi&#539;i. C&#259;ut&#259;ri gratuite dup&#259; m&#259;rci înregistrate
            se pot face la adresele <a class="ulink" href="http://www.nameprotect.org/" target="_top">http://www.nameprotect.org/</a>
            &#537;i <a class="ulink" href="http://www.uspto.gov/" target="_top">http://www.uspto.gov/</a>.</p></li><li class="listitem"><p>Dac&#259; se poate, e disponibil ca un nume de domeniu în
  				domeniile r&#259;d&#259;cin&#259; de genul
            <code class="systemitem">.com</code>,
            <code class="systemitem">.net</code> &#537;i
            <code class="systemitem">.org</code>. Probabil c&#259; ar fi bine
            de ales unul <code class="systemitem">.org</code>,
            pentru a îl prezenta ca pagina oficial&#259; a proiectului;
            celelalte dou&#259; ar trebui s&#259; redirec&#539;ioneze acolo &#537;i ar trebui
            s&#259; existe doar pentru a preveni ca ter&#539;e p&#259;r&#539;i s&#259; creeze
            confuzii de identitate în jurul numelui proiectului. Chiar
            dac&#259; vre&#539;i s&#259; g&#259;zdui&#539;i proiectul la alt&#259; adres&#259; (vezi
            <a class="xref" href="getting-started.html#starting-with-canned-hosting" title="Canned Hosting">&#8222;Canned Hosting&#8221;</a>), 
            pute&#539;i s&#259; înregistra&#539;i, totu&#537;i, domenii specifice proiectului
            &#537;i s&#259; le redirec&#539;iona&#539;i c&#259;tre site-ul de g&#259;zduire. E
            mai u&#537;or pentru utilizatori s&#259; &#539;in&#259; minte un URL simplu.
            </p></li></ul></div><p>

</p></div><div class="sect2" title="Stabili&#539;i o declara&#539;ie a misiunii clar&#259;"><div class="titlepage"><div><div><h3 class="title"><a name="mission-statement"></a>Stabili&#539;i o declara&#539;ie a misiunii clar&#259;</h3></div></div></div><p>Dup&#259; ce au g&#259;sit site-ul proiectului, urm&#259;torul lucru pe care
oamenii îl vor face este s&#259; caute o descriere rapid&#259;, o declara&#539;ie a 
misiunii, astfel încât s&#259; decid&#259; (în termen de 30 de secunde) dac&#259; sunt
sau nu interesa&#539;i s&#259; afle mai multe. Aceasta trebuie amplasat&#259; pe prima
pagin&#259; în mod proeminent, de preferin&#539;&#259; chiar sub numele proiectului.
</p><p>Declara&#539;ia scopului trebuie s&#259; fie concret&#259;, limitatoare &#537;i, mai
presus de orice, scurt&#259;. Acesta este un exemplu bun, de la <a class="ulink" href="http://www.openoffice.org/" target="_top">http://www.openoffice.org/</a>:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>De a crea, ca &#537;i o comunitate, cea mai bun&#259; suit&#259; de
  produse pentru birou astfel încât aceasta s&#259; ruleze pe toate platformele
  principale &#537;i s&#259; furnizeze acces la toat&#259; func&#539;ionalitatea &#537;i toate
  datele prin API-uri bazate pe componente deschise &#537;i un format
  al fi&#537;ierelor bazat pe XML.</em></span></p></blockquote></div><p>În doar câteva cuvinte, au nimerit toate punctele importante, în
special prin apelul la cuno&#537;tin&#539;ele anterioare ale cititorului. Spunând:
"<span class="emphasis"><em>ca &#537;i o comunitate</em></span>", ei semnalizeaz&#259; faptul c&#259; 
nicio corpora&#539;ie nu va domina dezvoltarea; "<span class="emphasis"><em>interna&#539;ional
</em></span>" înseamn&#259; c&#259; aplica&#539;ia va permite oamenilor s&#259; lucreze
în mai multe limbi &#537;i cu mai multe set&#259;ri locale; "<span class="emphasis"><em>toate
platformele principale </em></span>" înseamn&#259; c&#259; aceasta va fi portabil&#259;
pe Unix, Macintosh &#537;i Windows. Restul sugereaz&#259; faptul c&#259; interfe&#539;ele
deschise &#537;i formatele de fi&#537;iere u&#537;or de în&#539;eles sunt o parte important&#259;
a &#539;elului. Nu spun direct c&#259; vor s&#259; creeze o alternativ&#259; gratuit&#259; la
Microsoft Office dar majoritatea oamenilor pot s&#259; citeasc&#259; printre 
rânduri. De&#537;i aceast&#259; declara&#539;ie pare larg&#259; la prima vedere, în realitate
este destul de restrâns&#259;: cuvintele "<span class="emphasis"><em>suit&#259; de produse pentru
birou</em></span>" au un în&#539;eles foarte concret pentru cineva care este
familiarizat cu astfel de aplica&#539;ii. Din nou, se presupune experien&#539;a
anterioar&#259; a cititorului (în acest caz, probabil din MS Office) pentru
a face declara&#539;ia misiunii concis&#259;.</p><p>Natura declara&#539;iei misiunii depinde par&#539;ial de cel care o scrie, 
nu doar de aplica&#539;ia pe care o descrie. De exemplu, are sens pentru
OpenOffice.org s&#259; foloseasc&#259; sintagma "<span class="emphasis"><em>ca &#537;i o comunitate
</em></span>", pentru c&#259; proiectul a fost ini&#539;iat, &#537;i înc&#259; este 
sponsorizat în mare, de Sun Microsystems. Incluzând aceste cuvinte, Sun
indic&#259; faptul c&#259; e con&#537;tient&#259; de grijile c&#259; ar încerca s&#259; domine
procesul de dezvoltare. În acest fel de probleme, simpla demonstra&#539;ie
de con&#537;tientizare a <span class="emphasis"><em>poten&#539;ialului</em></span> problemei ajut&#259;
destul în evitarea problemei în întregimea ei. Pe de alt&#259; parte,
proiectele care nu sunt sponsorizate de o corpora&#539;ie nu au nevoie de 
o astfel de sintagm&#259;; dezvoltarea de c&#259;tre comunitate este lucrul
normal a&#537;a c&#259;, în mod normal, nu ar fi niciun motiv pentru care
s&#259; fie enumerat ca &#537;i parte a misiunii.</p></div><div class="sect2" title="Afirma&#539;i c&#259; proiectul este liber"><div class="titlepage"><div><div><h3 class="title"><a name="state-freedom"></a>Afirma&#539;i c&#259; proiectul este liber</h3></div></div></div><p>Cei care r&#259;mân interesa&#539;i dup&#259; ce au citit declara&#539;ia scopului
vor vrea s&#259; vad&#259; mai multe detalii, poate documenta&#539;ia pentru utilizatori
sau dezvoltatori, &#537;i, în cele din urm&#259;, s&#259; downloadeze ceva. Dar înainte
s&#259; se întâmple oricare dintre lucrurile acestea, vor dori s&#259; &#537;tie c&#259;
sursele sunt deschise.</p><p><span class="emphasis"><em>Prima pagin&#259; trebuie s&#259; explice clar &#537;i f&#259;r&#259; ambiguitate
c&#259; proiectul este open-source.</em></span> Poate p&#259;rea evident acest
lucru dar a&#539;i fi surprin&#537;i s&#259; afla&#539;i câte proiecte uit&#259; s&#259; fac&#259; asta. Am
v&#259;zut site-uri de proiecte de software liber unde prima pagin&#259; nu numai
c&#259; nu specifica sub care licen&#539;&#259; de software liber era distribuit&#259; dar
nici m&#259;car nu men&#539;iona faptul c&#259; proiectul e liber. Uneori cea mai
important&#259; informa&#539;ie era retrogradat&#259; pân&#259; la pagina de download, cea 
pentru dezvoltatori sau alt loc în care era nevoie de mai mult de un
click de mouse pentru a ajunge. În cazuri extreme, licen&#539;a nu ap&#259;rea
nic&#259;ieri pe site&#8212;singurul mod de a o g&#259;si era de a downloada
aplica&#539;ia &#537;i de a c&#259;uta în&#259;untru.</p><p>Nu face&#539;i aceast&#259; gre&#537;eal&#259;. O astfel de omisiune poate duce la
pierderea unor poten&#539;iali dezvoltatori &#537;i utilizatori. Publica&#539;i pe prima
pagin&#259;, chiar sub declara&#539;ia scopului proiectului, c&#259; acesta este
software liber sau open-source &#537;i men&#539;iona&#539;i licen&#539;a exact&#259;. Un ghid
scurt pentru alegerea licen&#539;ei se g&#259;se&#537;te în
<a class="xref" href="license-quickstart.html" title="Choosing a License and Applying It">&#8222;Choosing a License and Applying It&#8221;</a><span>
în continuarea acestui capitol</span>, iar problemele legate de
licen&#539;iere sunt discutate în detaliu în <a class="xref" href="legal.html" title="Cap. 9. Licenses, Copyrights, and Patents">Cap. 9, <i>Licenses, Copyrights, and Patents</i></a>.</p><p>În acest moment, vizitatorul nostru ipotetic a determinat&#8212;
probabil într-un minut sau mai pu&#539;in&#8212;c&#259; e interesat s&#259; petreac&#259;, de
exemplu, înc&#259; cinci minute pentru a investiga proiectul. Urm&#259;toarele
sec&#539;iuni descriu ce trebuie s&#259; descopere în acele cinci minute.</p></div><div class="sect2" title="Lista de posibilit&#259;&#539;i &#537;i cerin&#539;e"><div class="titlepage"><div><div><h3 class="title"><a name="features-and-requirements"></a>Lista de posibilit&#259;&#539;i &#537;i cerin&#539;e</h3></div></div></div><p>Ar trebui s&#259; existe o list&#259; scurt&#259; cu posibilit&#259;&#539;ile oferite de
software (dac&#259; una dintre ele nu e înc&#259; terminat&#259;, ea poate fi listat&#259;
dar se pune "<span class="emphasis"><em>planificat</em></span>" sau
"<span class="emphasis"><em>în curs</em></span>" lâng&#259; aceasta), &#537;i genul de sistem
necesar pentru a rula software-ul. Gândi&#539;i-v&#259; la lista de posibilit&#259;&#539;i &#537;i
cerin&#539;e la fel cum a&#539;i prezenta cuiva care v&#259; cere un rezumat scurt al
proiectului. De multe ori e doar o extindere logic&#259; a scopului declarat.
De exemplu, declara&#539;ia misiunii proiectului poate fi:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>De a crea un motor de indexare &#537;i c&#259;utare text cu
  o interfa&#539;&#259; de programare bogat&#259;, pentru a fi folosit&#259; de programatori
  în furnizarea serviciilor de c&#259;utare în seturi mari de fi&#537;iere text.
  </em></span></p></blockquote></div><p>Lista de posibilit&#259;&#539;i &#537;i cerin&#539;e ar da detaliile, clarificând
prezentarea scopului declarat:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Posibilit&#259;&#539;i:</em></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="emphasis"><em>Caut&#259; în text simplu, HTML &#537;i XML</em></span>
      </p></li><li class="listitem"><p><span class="emphasis"><em>C&#259;utare dup&#259; cuvinte &#537;i fraze</em></span>
      </p></li><li class="listitem"><p><span class="emphasis"><em>(planificat) C&#259;utare fuzzy</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>(planificat) Actualizare incremental&#259; a indec&#537;ilor
      	</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>(planificat) Indexarea paginilor web
      	distante</em></span></p></li></ul></div><p><span class="emphasis"><em>Cerin&#539;e:</em></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="emphasis"><em>Python 2.2 sau mai recent</em></span></p></li><li class="listitem"><p><span class="emphasis"><em>Spa&#539;iu suficient pe disc pentru a salva
      		indec&#537;ii(aproximativ de dou&#259; ori dimensiunea datelor
      		originale)</em></span></p></li></ul></div></blockquote></div><p>Având la dispozi&#539;ie aceste informa&#539;ii, cititorii pot s&#259; în&#539;eleag&#259;
rapid dac&#259; acest proiect are vreo &#537;ans&#259; s&#259; îi ajute &#537;i pot lua în
calcul s&#259; contribuie &#537;i ei ca dezvoltatori.</p></div><div class="sect2" title="Starea dezvolt&#259;rii"><div class="titlepage"><div><div><h3 class="title"><a name="development-status"></a>Starea dezvolt&#259;rii</h3></div></div></div><p>Oamenii vor întotdeauna s&#259; afle în ce stadiu se afl&#259; proiectul.
Pentru proiectele noi, vor s&#259; &#537;tie care e diferen&#539;a dintre promisiunile
proiectului &#537;i realitatea curent&#259;. Pentru proiectele mature, vor s&#259; &#537;tie
cât de activ sunt între&#539;inute, cât de des apar noi versiuni, cât de rapid
se r&#259;spunde la erorile raportate, etc.</p><p>Pentru a r&#259;spunde la astfel de întreb&#259;ri, trebuie s&#259; existe o
pagin&#259; pentru starea dezvolt&#259;rii în care s&#259; se prezinte scopurile pe 
termen scurt ale proiectului &#537;i nevoile (de exemplu, se poate s&#259; fie
nevoie de dezvoltatori cu o anumit&#259; expertiz&#259;). Pagina poate da &#537;i
informa&#539;ii despre versiunile anterioare, cu liste de capabilit&#259;&#539;i, astfel
încât vizitatorii s&#259; în&#539;eleag&#259; cum define&#537;te proiectul ideea de
&#8222;progres&#8221; &#537;i cât de rapid progreseaz&#259; în concordan&#539;&#259; cu acea defini&#539;ie.
</p><p>S&#259; nu v&#259; fie fric&#259; s&#259; p&#259;re&#539;i nepreg&#259;ti&#539;i &#537;i nu ceda&#539;i tenta&#539;iei
de a min&#539;i în leg&#259;tur&#259; cu starea proiectului. Toat&#259; lumea &#537;tie c&#259; 
aplica&#539;iile evolueaz&#259; în etape; nu e nicio ru&#537;ine în a spune &#8222;aplica&#539;ia
e în stadiul alpha &#537;i are bug-uri cunoscute. Ruleaz&#259;, &#537;i func&#539;ioneaz&#259; în
cea mai mare parte a timpului, dar o folosi&#539;i pe propria r&#259;spundere&#8221;. 
O astfel de exprimare nu va speria dezvoltatorii de care e nevoie în
aceast&#259; etap&#259;. Cât despre utilizatori, unul dintre cele mai proaste 
lucruri pe care le poate face un proiect este s&#259; atrag&#259; utilizatori
înainte ca aplica&#539;ia s&#259; fie preg&#259;tit&#259; pentru ei. O reputa&#539;ie de
de instabilitate sau probleme (bug-uri) este greu de înlocuit odat&#259;
&#8222;câ&#537;tigat&#259;&#8221;. Conservatorismul are meritele lui pe termen lung; 
întotdeauna e mai bine ca aplica&#539;iaa s&#259; fie 
<span class="emphasis"><em>mai</em></span> stabil&#259; decât se a&#537;teapt&#259; utilizatorul decât
mai pu&#539;in stabil&#259; &#537;i surprizele pl&#259;cute produc cea mai bun&#259; reputa&#539;ie.
</p><div class="sidebar" title="Alpha &#537;i Beta"><a name="alpha-and-beta"></a><div class="titlepage"><div><div><p class="title"><b>Alpha &#537;i Beta</b></p></div></div></div><p>Termenul <em class="firstterm">alpha</em> reprezint&#259; o prim&#259;
  versiune, cu care utilizatorii pot s&#259; î&#537;i fac&#259; treaba &#537;i care are
  func&#539;ionalitatea inten&#539;ionat&#259;, dar care are &#537;i bug-uri. Principalul
  scop al software-ului alpha este de a genera feedback astfel încât
  dezvoltatorii s&#259; &#537;tie la ce e nevoie s&#259; mai lucreze. Stadiul urm&#259;tor,
   <em class="firstterm">beta</em>, presupune c&#259; toate problemele serioase
   ale aplica&#539;iei au fost rezolvate dar înc&#259; nu s-au efectuat
   destule teste pentru a certifica versiunea. Scopul software-ului
   beta este de a deveni versiunea oficial&#259;, dac&#259; nu se g&#259;sesc bug-uri, 
   sau de a oferi feedback detaliat dezvoltatorilor astfel încât ei s&#259;
   ajung&#259; la versiunea oficial&#259; cât mai repede. Diferen&#539;a dintre alpha
   &#537;i beta este, în principal, una de judecat&#259;.</p></div></div><div class="sect2" title="Download-uri"><div class="titlepage"><div><div><h3 class="title"><a name="downloads"></a>Download-uri</h3></div></div></div><p>Aplica&#539;ia trebuie s&#259; poat&#259; fi desc&#259;rcat&#259; ca &#537;i cod surs&#259; într-un
format standard. Când proiectul se afl&#259; la început, pachetele binare
(executabile) nu sunt necesare decât dac&#259; aplica&#539;ia are cerin&#539;e sau
dependen&#539;e atât de complicate pentru a fi transformat&#259; în executabil
încât ar fi prea greu pentru majoritatea oamenilor s&#259; o fac&#259; s&#259;
ruleze. (Dac&#259; aceasta e situa&#539;ia, proiectul va avea probleme
serioase în a atrage dezvoltatori orice-ar fi).</p><p>Mecanismul de distribu&#539;ie trebuie s&#259; fie cât mai convenabil,
standardizat &#537;i simplu. Dac&#259; a&#539;i încerca s&#259; elimina&#539;i o boal&#259;, nu a&#539;i
distribui medicamentul într-un a&#537;a fel încât ar fi nevoie de o
dimensiune non-standard de sering&#259; pentru a-l administra. La fel,
aplica&#539;ia trebuie s&#259; fie conform&#259; cu metodele de compilare &#537;i instalare
standard; cu cât deviaz&#259; mai mult de la standarde, cu atât vor renun&#539;a
mai u&#537;or poten&#539;ialii dezvoltatori &#537;i utilizatori &#537;i vor pleca.</p><p>De&#537;i sun&#259; evident, majoritatea proiectelor nu se obosesc s&#259;
standardizeze procedurile de instalare pân&#259; la o etap&#259; foarte
târzie, spunându-&#537;i c&#259; pot s&#259; fac&#259; asta oricând: <span class="emphasis"><em>"O s&#259;
rezolv&#259;m toate problemele astea când codul va fi mai aproape de a fi
gata."</em></span>Ceea ce nu realizeaz&#259; e c&#259;, amânând munca plictisitoare
de a termina procedurile pentru compilare &#537;i instalare, ei de fapt
prelungesc durata de care e nevoie pentru a termina&#8212;pentru c&#259;
ei descurajeaz&#259; dezvoltatorii care altfel ar fi putut contribui la
cod. Mai grav de-atât, ei nu <span class="emphasis"><em>&#537;tiu</em></span> c&#259; pierd to&#539;i
ace&#537;ti dezvoltatori pentru c&#259; procesul este o acumulare de
non-evenimente: cineva viziteaz&#259; site-ul, downloadeaz&#259; aplica&#539;ia, 
încearc&#259; s&#259; o foloseasc&#259;, nu reu&#537;e&#537;te, renun&#539;&#259; &#537;i merge mai departe. Cine
va &#537;ti vreodat&#259; c&#259; s-a întâmplat în afar&#259; de acea persoan&#259;? Nimeni care
lucreaz&#259; la proiect nu va realiza interesul acelei persoane &#537;i un
lucru bun va fi irosit în mod tacit.</p><p>Munca plictisitoare care poate aduce câ&#537;tiguri mari ar trebui
s&#259; fie f&#259;cut&#259; întotdeauna devreme &#537;i reducerea semnificativ&#259; a barierelor
în calea celor care vor s&#259; se al&#259;ture proiectului aduce câ&#537;tiguri mari.
</p><p>Când crea&#539;i un pachet binar downloadabil, e vital s&#259; da&#539;i un num&#259;r 
unic de versiune astfel încât oamenii s&#259; poat&#259; compara dou&#259; versiuni
diferite &#537;i s&#259; &#537;tie care dintre ele e mai recent&#259;. O discu&#539;ie detaliat&#259;
a modului în care se dau numerele de versiune apare în <a class="xref" href="development-cycle.html#release-numbering" title="Release Numbering">&#8222;Release Numbering&#8221;</a>, iar detaliile despre standardizarea
procedurilor de compilare &#537;i instalare sunt prezentate în
<a class="xref" href="packaging.html" title="Packaging">&#8222;Packaging&#8221;</a><span>, amândou&#259; reg&#259;site
în <a class="xref" href="development-cycle.html" title="Cap. 7. Packaging, Releasing, and Daily Development">Cap. 7, <i>Packaging, Releasing, and Daily Development</i></a></span>.</p></div><div class="sect2" title="Version Control and Bug Tracker Access"><div class="titlepage"><div><div><h3 class="title"><a name="vc-and-bug-tracker-access"></a>Version Control and Bug Tracker Access</h3></div></div></div><p>Downloading source packages is fine for those who just want to
install and use the software, but it's not enough for those who want
to debug or add new features.  Nightly source snapshots can help, but
they're still not fine-grained enough for a thriving development
community.  People need real-time access to the latest sources, and
the way to give them that is to use a version control system.  The
presence of anonymously accessible version controlled sources is a
sign&#8212;to both users and developers&#8212;that this project is
making an effort to give people what they need to participate.  If you
can't offer version control right away, then put up a sign saying you
intend to set it up soon.  Version control infrastructure is discussed
in detail in <a class="xref" href="vc.html" title="Version Control">&#8222;Version Control&#8221;</a><span> in
<a class="xref" href="technical-infrastructure.html" title="Cap. 3. Technical Infrastructure">Cap. 3, <i>Technical Infrastructure</i></a></span>.</p><p>The same goes for the project's bug tracker.  The importance of
a bug tracking system lies not only in its usefulness to developers,
but in what it signifies for project observers.  For many people, an
accessible bug database is one of the strongest signs that a project
should be taken seriously.  Furthermore, the higher the number of bugs
in the database, the better the project looks.  This might seem
counterintuitive, but remember that the number of bugs recorded really
depends on three things: the absolute number of bugs present in the
software, the number of users using the software, and the convenience
with which those users can register new bugs.  Of these three factors,
the latter two are more significant than the first.  Any software of
sufficient size and complexity has an essentially arbitrary number of
bugs waiting to be discovered.  The real question is, how well will
the project do at recording and prioritizing those bugs?  A project
with a large and well-maintained bug database (meaning bugs are
responded to promptly, duplicate bugs are unified, etc.) therefore
makes a better impression than a project with no bug database, or a
nearly empty database.</p><p>Of course, if your project is just getting started, then the bug
database will contain very few bugs, and there's not much you can do
about that.  But if the status page emphasizes the project's youth,
and if people looking at the bug database can see that most filings have
taken place recently, they can extrapolate from that that the project
still has a healthy <span class="emphasis"><em>rate</em></span> of filings, and they
will not be unduly alarmed by the low absolute number of bugs
recorded.</p><p>Note that bug trackers are often used to track not only software
bugs, but enhancement requests, documentation changes, pending tasks,
and more.  The details of running a bug tracker are covered in
<a class="xref" href="bug-tracker.html" title="Bug Tracker">&#8222;Bug Tracker&#8221;</a><span> in
<a class="xref" href="technical-infrastructure.html" title="Cap. 3. Technical Infrastructure">Cap. 3, <i>Technical Infrastructure</i></a></span>, so I won't
go into them here.  The important thing from a presentation point of
view is just to <span class="emphasis"><em>have</em></span> a bug tracker, and to make
sure that fact is visible from the front page of the project.</p></div><div class="sect2" title="Communications Channels"><div class="titlepage"><div><div><h3 class="title"><a name="communications-channels"></a>Communications Channels</h3></div></div></div><p>Visitors usually want to know how to reach the human beings
involved with the project.  Provide the addresses of mailing lists,
chat rooms, and IRC channels, and any other forums where others
involved with the software can be reached.  Make it clear that you and
the other authors of the project are subscribed to these mailing
lists, so people see there's a way to give feedback that will reach
the developers.  Your presence on the lists does not imply a
committment to answer all questions or implement all feature requests.
In the long run, most users will probably never join the forums
anyway, but they will be comforted to know that they
<span class="emphasis"><em>could</em></span> if they ever needed to.</p><p>In the early stages of a project, there's no need to have
separate user and developer forums.  It's much better to have everyone
involved with the software talking together, in one "room."  Among
early adopters, the distinction between developer and user is often
fuzzy; to the extent that the distinction can be made, the ratio of
developers to users is usually much higher in the early days of the
project than later on.  While you can't assume that every early
adopter is a programmer who wants to hack on the software, you can
assume that they are at least interested in following development
discussions and in getting a sense of the project's direction.</p><p>As this chapter is only about getting a project started, it's
enough merely to say that these communications forums need to exist.
Later, in <a class="xref" href="growth.html" title="Handling Growth">&#8222;Handling Growth&#8221;</a><span> in
<a class="xref" href="communications.html" title="Cap. 6. Communications">Cap. 6, <i>Communications</i></a></span>, we'll examine where
and how to set up such forums, the ways in which they might need
moderation or other management, and how to separate user forums from
developer forums, when the time comes, without creating an
unbridgeable gulf.</p></div><div class="sect2" title="Developer Guidelines"><div class="titlepage"><div><div><h3 class="title"><a name="developer-guidelines"></a>Developer Guidelines</h3></div></div></div><p>If someone is considering contributing to the project, she'll
look for developer guidelines.  Developer guidelines are not so much
technical as social: they explain how the developers interact with
each other and with the users, and ultimately how things get
done.</p><p>This topic is covered in detail in
<a class="xref" href="written-rules.html" title="Writing It All Down">&#8222;Writing It All Down&#8221;</a><span> in
<a class="xref" href="social-infrastructure.html" title="Cap. 4. Social and Political Infrastructure">Cap. 4, <i>Social and Political Infrastructure</i></a></span>, but the basic
elements of developer guidelines are:

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>pointers to forums for interaction with other
            developers</p></li><li class="listitem"><p>instructions on how to report bugs and submit
            patches</p></li><li class="listitem"><p>some indication of <span class="emphasis"><em>how</em></span>
            development is usually done&#8212;is the project a
            benevolent dictatorship, a democracy, or something
            else</p></li></ul></div><p>

No pejorative sense is intended by "dictatorship", by the way.  It's
perfectly okay to run a tyranny where one particular developer has
veto power over all changes.  Many successful projects work this way.
The important thing is that the project come right out and say so.  A
tyranny pretending to be a democracy will turn people off; a tyranny
that says it's a tyranny will do fine as long as the tyrant is
competent and trusted.</p><p>See <a class="ulink" href="http://subversion.apache.org/docs/community-guide/" target="_top">http://subversion.apache.org/docs/community-guide/</a>
for an example of particularly thorough developer guidelines, or
<a class="ulink" href="http://www.openoffice.org/dev_docs/guidelines.html" target="_top">http://www.openoffice.org/dev_docs/guidelines.html</a> for
broader guidelines that focus more on governance and the spirit of
participation and less on technical matters.</p><p>The separate issue of providing a programmer's introduction to
the software is discussed in <a class="xref" href="getting-started.html#developer-documentation" title="Developer documentation">&#8222;Developer documentation&#8221;</a><span>
later in this chapter</span>.</p></div><div class="sect2" title="Documentation"><div class="titlepage"><div><div><h3 class="title"><a name="documentation"></a>Documentation</h3></div></div></div><p>Documentation is essential.  There needs to be
<span class="emphasis"><em>something</em></span> for people to read, even if it's
rudimentary and incomplete.  This falls squarely into the "drudgery"
category referred to earlier, and is often the first area where a new
open source project falls down.  Coming up with a mission statement
and feature list, choosing a license, summarizing development
status&#8212;these are all relatively small tasks, which can be
definitively completed and usually need not be returned to once done.
Documentation, on the other hand, is never really finished, which may
be one reason people sometimes delay starting it at all.</p><p>The most insidious thing is that documentation's utility to
those writing it is the reverse of its utility to those who will read
it.  The most important documentation for initial users is the basics:
how to quickly set up the software, an overview of how it works,
perhaps some guides to doing common tasks.  Yet these are exactly the
things the <span class="emphasis"><em>writers</em></span> of the documentation know all
too well&#8212;so well that it can be difficult for them to see
things from the reader's point of view, and to laboriously spell out
the steps that (to the writers) seem so obvious as to be unworthy of
mention.</p><p>There's no magic solution to this problem.  Someone just needs
to sit down and write the stuff, and then run it by typical new users
to test its quality.  Use a simple, easy-to-edit format such as HTML,
plain text, Texinfo, or some variant of XML&#8212;something that's
convenient for lightweight, quick improvements on the spur of the
moment.  This is not only to remove any overhead that might impede the
original writers from making incremental improvements, but also for
those who join the project later and want to work on the
documentation.</p><p>One way to ensure basic initial documentation gets done is to
limit its scope in advance.  That way, writing it at least won't feel
like an open-ended task.  A good rule of thumb is that it should meet
the following minimal criteria:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>Tell the reader clearly how much technical
            expertise they're expected to have.</p></li><li class="listitem"><p>Describe clearly and thoroughly how to set up
            the software, and somewhere near the beginning of the
            documentation, tell the user how to run some sort of
            diagnostic test or simple command to confirm that
            they've set things up correctly.  Startup
            documentation is in some ways more important than
            actual usage documentation.  The more effort someone has
            invested in installing and getting started with the
            software, the more persistent she'll be in figuring out
            advanced functionality that's not well-documented.
            When people abandon, they abandon early; therefore,
            it's the earliest stages, like installation, that need
            the most support.</p></li><li class="listitem"><p>Give one tutorial-style example of how to do a
            common task.  Obviously, many examples for many tasks
            would be even better, but if time is limited, pick one
            task and walk through it thoroughly.  Once someone
            sees that the software <span class="emphasis"><em>can</em></span> be
            used for one thing, they'll start to explore what else
            it can do on their own&#8212;and, if you're lucky,
            start filling in the documentation themselves.  Which
            brings us to the next point...</p></li><li class="listitem"><p>Label the areas where the documentation is known
            to be incomplete.  By showing the readers that you are
            aware of its deficiencies, you align yourself with
            their point of view.  Your empathy reassures them that
            they don't face a struggle to convince the project of
            what's important.  These labels needn't represent
            promises to fill in the gaps by any particular date
           &#8212;it's equally legitimate to treat them as open
            requests for volunteer help.</p></li></ul></div><p>The last point is of wider importance, actually, and can be
applied to the entire project, not just the documentation.  An
accurate accounting of known deficiencies is the norm in the open
source world.  You don't have to exaggerate the project's
shortcomings, just identify them scrupulously and dispassionately when
the context calls for it (whether in the documentation, in the bug
tracking database, or on a mailing list discussion).  No one will
treat this as defeatism on the part of the project, nor as a
commitment to solve the problems by a certain date, unless the project
makes such a commitment explicitly.  Since anyone who uses the
software will discover the deficiencies for themselves, it's much
better for them to be psychologically prepared&#8212;then the
project will look like it has a solid knowledge of how it's
doing.</p><div class="sidebar" title="Maintaining a FAQ"><a name="starting-a-faq"></a><div class="titlepage"><div><div><p class="title"><b>Maintaining a FAQ</b></p></div></div></div><p>A <em class="firstterm">FAQ</em> ("Frequently Asked Questions"
  document) can be one of the best investments a project makes in
  terms of educational payoff.  FAQs are highly tuned to the questions
  users and developers actually ask&#8212;as opposed to the questions
  you might have <span class="emphasis"><em>expected</em></span> them to ask&#8212;and
  therefore, a well-maintained FAQ tends to give those who consult it
  exactly what they're looking for.  The FAQ is often the first place
  users look when they encounter a problem, often even in preference
  to the official manual, and it's probably the document in your
  project most likely to be linked to from other sites.</p><p>Unfortunately, you cannot make the FAQ at the start of the
  project.  Good FAQs are not written, they are grown.  They are by
  definition reactive documents, evolving over time in response to
  people's day-to-day usage of the software.  Since it's impossible to
  correctly anticipate the questions people will ask, it is impossible
  to sit down and write a useful FAQ from scratch.</p><p>Therefore, don't waste your time trying to.  You may, however,
  find it useful to set up a mostly blank FAQ template, so there will
  be an obvious place for people to contribute questions and answers
  after the project is under way.  At this stage, the most important
  property is not completeness, but convenience: if the FAQ is easy to
  add to, people will add to it.  (Proper FAQ maintenance is a
  non-trivial and intriguing problem, and is discussed more in <a class="xref" href="share-management.html#faq-manager" title="FAQ Manager">&#8222;FAQ Manager&#8221;</a><span> in
  <a class="xref" href="managing-volunteers.html" title="Cap. 8. Managing Volunteers">Cap. 8, <i>Managing Volunteers</i></a></span>.)</p></div><div class="sect3" title="Availability of documentation"><div class="titlepage"><div><div><h4 class="title"><a name="documentation-availability"></a>Availability of documentation</h4></div></div></div><p>Documentation should be available from two places: online
(directly from the web site), <span class="emphasis"><em>and</em></span> in the
downloadable distribution of the software (see
<a class="xref" href="packaging.html" title="Packaging">&#8222;Packaging&#8221;</a><span> in
<a class="xref" href="development-cycle.html" title="Cap. 7. Packaging, Releasing, and Daily Development">Cap. 7, <i>Packaging, Releasing, and Daily Development</i></a></span>).  It needs to be
online, in browsable form, because people often read documentation
<span class="emphasis"><em>before</em></span> downloading software for the first time,
as a way of helping them decide whether to download at all.  But it
should also accompany the software, on the principle that downloading
should supply (i.e., make locally accessible) everything one needs to
use the package.</p><p>For online documentation, make sure that there is a link that
brings up the <span class="emphasis"><em>entire</em></span> documentation in one HTML
page (put a note like "monolithic" or "all-in-one" or "single large
page" next to the link, so people know that it might take a while to
load).  This is useful because people often want to search for a
specific word or phrase across the entire documentation.  Generally,
they already know what they're looking for; they just can't remember
what section it's in.  For such people, nothing is more frustrating
than encountering one HTML page for the table of contents, then a
different page for the introduction, then a different page for
installation instructions, etc.  When the pages are broken up like
that, their browser's search function is useless.  The separate-page
style is useful for those who already know what section they need, or
who want to read the entire documentation from front to back in
sequence.  But this is <span class="emphasis"><em>not</em></span> the most common way
documentation is accessed.  Far more often, someone who is basically
familiar with the software is coming back to search for a specific
word or phrase.  To fail to provide them with a single, searchable
document would only make their lives harder.</p></div><div class="sect3" title="Developer documentation"><div class="titlepage"><div><div><h4 class="title"><a name="developer-documentation"></a>Developer documentation</h4></div></div></div><p>Developer documentation is written to help programmers
understand the code, so they can repair and extend it.  This is
somewhat different from the <span class="emphasis"><em>developer guidelines</em></span>
discussed earlier, which are more social than technical.  Developer
guidelines tell programmers how to get along with each other;
developer documentation tells them how to get along with the code
itself.  The two are often packaged together in one document for
convenience (as with the <a class="ulink" href="http://subversion.apache.org/docs/community-guide/" target="_top">http://subversion.apache.org/docs/community-guide/</a> example given
earlier), but they don't have to be.</p><p>Although developer documentation can be very helpful, there's no
reason to delay a release to do it.  As long as the original authors
are available (and willing) to answer questions about the code, that's
enough to start with.  In fact, having to answer the same questions
over and over is a common motivation for writing documentation.  But
even before it's written, determined contributors will still manage to
find their way around the code.  The force that drives people to spend
time learning a code base is that the code does something useful for
them.  If people have faith in that, they will take the time to figure
things out; if they don't have that faith, no amount of developer
documentation will get or keep them.</p><p>So if you have time to write documentation for only one
audience, write it for users.  All user documentation is, in effect,
developer documentation as well; any programmer who's going to work on
a piece of software will need to be familiar with how to use it.
Later, when you see programmers asking the same questions over and
over, take the time to write up some separate documents just for
them.</p><p>Some projects use wikis for their initial documentation, or even
as their primary documentation.  In my experience, this really only
works if the wiki is actively edited by a few people who agree on how
the documentation is to be organized and what sort of "voice" it
should have.  See
<a class="xref" href="wikis.html" title="Wikis">&#8222;Wikis&#8221;</a><span> in
<a class="xref" href="technical-infrastructure.html" title="Cap. 3. Technical Infrastructure">Cap. 3, <i>Technical Infrastructure</i></a></span> for
more.</p></div></div><div class="sect2" title="Example Output and Screenshots"><div class="titlepage"><div><div><h3 class="title"><a name="example-output"></a>Example Output and Screenshots</h3></div></div></div><p>If the project involves a graphical user interface, or if it
produces graphical or otherwise distinctive output, put some samples
up on the project web site.  In the case of interface, this means
screenshots; for output, it might be screenshots or just files.  Both
cater to people's need for instant gratification: a single screenshot
can be more convincing than paragraphs of descriptive text and mailing
list chatter, because a screenshot is inarguable proof that the
software <span class="emphasis"><em>works</em></span>.  It may be buggy, it may be hard
to install, it may be incompletely documented, but that screenshot is
still proof that if one puts in enough effort, one can get it to
run.</p><div class="sidebar" title="Screenshots"><a name="screenshots"></a><div class="titlepage"><div><div><p class="title"><b>Screenshots</b></p></div></div></div><p>Since screenshots can be daunting until you've actually made a
  few, here are basic instructions for making them.  Using the Gimp
  (<a class="ulink" href="http://www.gimp.org/" target="_top">http://www.gimp.org/</a>), open
  <span class="guimenu">File</span>-&gt;<span class="guimenu">Acquire</span>-&gt;<span class="guimenu">Screenshot</span>,
  choose <span class="guimenuitem">Single Window</span> or
  <span class="guimenuitem">Whole Screen</span>, then click
  <span class="guimenuitem">OK</span>.  Now your next mouse click will
  capture the window or screen clicked on as an image in the Gimp.
  Crop and resize the image as necessary, using the instructions at 
  <a class="ulink" href="http://www.gimp.org/tutorials/Lite_Quickies/#crop" target="_top">http://www.gimp.org/tutorials/Lite_Quickies/#crop</a>.</p></div></div><p>There are many other things you could put on the project web
site, if you have the time, or if for one reason or another they are
especially appropriate: a news page, a project history page, a related
links page, a site-search feature, a donations link, etc.  None of
these are necessities at startup time, but keep them in mind for the
future.</p><div class="sect2" title="Canned Hosting"><div class="titlepage"><div><div><h3 class="title"><a name="starting-with-canned-hosting"></a>Canned Hosting</h3></div></div></div><p>There are a few sites that provide free hosting and
infrastructure for open source projects: a web area, version control,
a bug tracker, a download area, chat forums, regular backups, etc.
The details vary from site to site, but the same basic services are
offered at all of them.  By using one of these sites, you get a lot
for free; what you give up, obviously, is fine-grained control over
the user experience.  The hosting service decides what software the
site runs, and may control or at least influence the look and feel of
the project's web pages.</p><p>See
<a class="xref" href="web-site.html#canned-hosting" title="Canned Hosting">&#8222;Canned Hosting&#8221;</a><span> in
<a class="xref" href="technical-infrastructure.html" title="Cap. 3. Technical Infrastructure">Cap. 3, <i>Technical Infrastructure</i></a></span> for a more
detailed discussion of the advantages and disadvantages of canned
hosting, and a list of sites that offer it.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="today.html">Înapoi</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="license-quickstart.html">Înainte</a></td></tr><tr><td width="40%" align="left" valign="top">Situa&#539;ia ast&#259;zi </td><td width="20%" align="center"><a accesskey="h" href="index.html">Acas&#259;</a></td><td width="40%" align="right" valign="top"> Choosing a License and Applying It</td></tr></table></div></body></html>
