<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Cap. 1. Introducere</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producerea de software open-source"><link rel="up" href="index.html" title="Producerea de software open-source"><link rel="prev" href="disclaimer.html" title="Preciz&#259;ri (limitare a responsabilit&#259;&#539;ii)"><link rel="next" href="today.html" title="Situa&#539;ia ast&#259;zi"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Cap. 1. Introducere</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="disclaimer.html">Înapoi</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="today.html">Înainte</a></td></tr></table><hr></div><div class="chapter" title="Cap. 1. Introducere"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>Cap. 1. Introducere</h2></div></div></div><div class="toc"><p><b>Cuprins</b></p><dl><dt><span class="sect1"><a href="introduction.html#history">Istorie</a></span></dt><dd><dl><dt><span class="sect2"><a href="introduction.html#propertization">Apari&#539;ia software-ului proprietar &#537;i a celui gratuit</a></span></dt><dd><dl><dt><span class="sect3"><a href="introduction.html#history-conscious-resistance">Rezisten&#539;a con&#537;tient&#259;</a></span></dt><dt><span class="sect3"><a href="introduction.html#history-accidental-resistance">Rezisten&#539;a accidental&#259;</a></span></dt></dl></dd><dt><span class="sect2"><a href="introduction.html#free-vs-open-source">"Gratuit" Versus "Surs&#259; deschis&#259;"</a></span></dt></dl></dd><dt><span class="sect1"><a href="today.html">Situa&#539;ia ast&#259;zi</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>Cele mai multe proiecte de software gratuit e&#537;ueaz&#259;.</p><p>Nu auzim prea multe despre e&#537;ecuri. Numai proiectele cu succes 
atrag aten&#539;ia dar exist&#259; atât de multe proiecte de software gratuit
<sup>[<a name="idp4602528" href="#ftn.idp4602528" class="footnote">2</a>]</sup> încât chiar dac&#259; numai un procentaj mic au succes
tot va rezulta un num&#259;r mare de proiecte vizibile. De asemenea nu auzim
de e&#537;ecuri pentru c&#259; e&#537;ecul nu este un eveniment în sine. Nu exist&#259; un 
moment anume de timp în care un proiect înceteaz&#259; s&#259; mai fie util; 
oamenii se îndep&#259;rteaz&#259; de el &#537;i înceteaz&#259; s&#259; mai lucreze la el. Poate 
exista un moment când se face o ultim&#259; modificare la un proiect dar cei
care au f&#259;cut-o de obicei nu &#537;tiu c&#259; aceasta este ultima. Nu exist&#259;
nicio defini&#539;ie clar&#259; a momentului în care se consider&#259; c&#259; un proiect
a expirat. S&#259; fie când la un proiect nu s-a mai lucrat timp de &#537;ase luni?
Sau când num&#259;rul de utilizatori nu mai cre&#537;te f&#259;r&#259; a fi dep&#259;&#537;it 
capacitatea num&#259;rului de dezvoltatori de a între&#539;ine proiectul? Dar dac&#259;
dezvoltatorii unui proiect îl abandoneaz&#259; pentru c&#259; realizeaz&#259; c&#259; 
replicau efortul unui altul&#8212;&#537;i dac&#259; se al&#259;tur&#259; acelui alt 
proiect, apoi îl extind pentru a putea s&#259; includ&#259; o parte a efortului
anterior? Primul proiect s-a încheiat s-au &#537;i-a schimbat doar locul? </p><p>Aceast&#259; complexitate duce la imposibilitatea stabilirii
unei rate exacte a e&#537;ecului. Dar dovezile anecdotice strânse dup&#259;
mai mult de un deceniu de open-source, pu&#539;in&#259; navigare pe SourceForge.net
&#537;i câteva c&#259;ut&#259;ri pe Google duc toate la aceea&#537;i concluzie: rata este
extrem de mare, probabil ajungând la 90&#8211;95%. Num&#259;rul cre&#537;te
dac&#259; includem proiectele existente dar disfunc&#539;ionale: acele care 
<span class="emphasis"><em>produc</em></span> cod executabil dar care nu sunt pl&#259;cute 
utilizatorului sau care nu progreseaz&#259; la fel de rapid sau de fiabil 
cum ar putea.
</p><p>Aceast&#259; carte vorbe&#537;te despre evitarea e&#537;ecului. Examineaz&#259; nu 
numai cum se fac lucrurile corect dar &#537;i cum se fac în mod gre&#537;it pentru
a putea recunoa&#537;te &#537;i corecta problemele din timp. Sper c&#259;, dup&#259; citirea
c&#259;r&#539;ii, ve&#539;i avea un repertoriu de tehnici nu numai pentru a evita
problemele uzuale din dezvoltarea open-source dar &#537;i pentru a v&#259; ocupa
de cre&#537;terea &#537;i între&#539;inerea unui proiect de succes. Succesul nu este un
joc cu sum&#259; zero &#537;i aceast&#259; carte nu este despre cum s&#259; câ&#537;tigi sau s&#259;
î&#539;i întreci adversarii. Din contr&#259;, o parte important&#259; a conducerii
unui proiect open-source o constituie interfa&#539;area simpl&#259; cu proiecte
înrudinte. Pe termen lung, fiecare proiect de succes contribuie la 
binele corpului mondial de software gratuit.</p><p>Ar fi tentant de spus faptul c&#259; proiectele de software gratuit
e&#537;ueaz&#259; din acelea&#537;i categorii de motive ca &#537;i proiectele de software
proprietar. Cu siguran&#539;&#259;, software-ul gratuit nu de&#539;ine monopolul asupra
cerin&#539;elor nerealiste, cerin&#539;elor vagi, administr&#259;rii deficitare a
resurselor, fazelor insuficiente de design sau altor pitici deja 
bine cunoscu&#539;i în industria software. Exist&#259; deja destule scrieri pe
aceste teme &#537;i nu voi încerca s&#259; le reproduc în aceast&#259; carte. În schimb,
voi încerca s&#259; descriu problemele caracteristice software-ului gratuit.
Când un proiect de software gratuit dispare se întâmpl&#259; de obicei 
pentru c&#259; dezvoltatorii (sau managerii) nu au apreciat problemele unice
ale dezvolt&#259;rii de software open-source de&#537;i poate c&#259; erau destul de bine
preg&#259;ti&#539;i pentru dificult&#259;&#539;ile dezvolt&#259;rii closed-source.</p><p>Una dintre cele mai frecvente gre&#537;eli este de a avea a&#537;tept&#259;ri
nerealiste de la avantajul unei surse deschise. O licen&#539;&#259; deschis&#259; nu 
garanteaz&#259; faptul c&#259; hoarde de dezvoltatori activi î&#537;i vor oferi brusc
timpul lor proiectului &#537;i nici transformarea unui proiect în open-source
nu îi rezolv&#259; în mod magic problemele. De fapt, se poate întâmpla chiar 
contrariul: deschiderea unui proiect poate ad&#259;uga complexitate &#537;i poate
costa <span class="emphasis"><em>mai mult</em></span> pe termen scurt decât p&#259;strarea
codului închis. Deschiderea c&#259;tre public presupune aranjarea codului
astfel încât s&#259; poat&#259; s&#259; fie în&#539;eles de str&#259;ini, stabilirea unui site de
dezvoltare &#537;i a unor liste de e-mail &#537;i adesea scrierea documenta&#539;iei 
pentru prima dat&#259;. Toate acestea presupun mult&#259; munc&#259;. Desigur, dac&#259;
totu&#537;i <span class="emphasis"><em>apar</em></span> apar noi dezvoltatori, exist&#259; povara
suplimentar&#259; de a le r&#259;spunde la întreb&#259;ri pentru o vreme înainte de a
beneficia de pe urma prezen&#539;ei lor. Dup&#259; cum spunea &#537;i dezvoltatorul
Jamie Zawinski despre problemele din primele zile ale proiectului
Mozilla:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Open source-ul func&#539;ioneaz&#259; dar nu este un panaceu.
      Dac&#259; exist&#259; un un în&#539;eles în aceast&#259; poveste este c&#259; nu se poate
      pres&#259;ra praful magic "open-source" pe un proiect aflat pe moarte
      &#537;i totul s&#259; func&#539;ioneze în mod magic. Software-ul este complicat.
      Problemele nu sunt atât de simple.</em></span></p><p>(sursa: <span class="bold"><strong><a class="ulink" href="http://www.jwz.org/gruntle/nomo.html" target="_top">http://www.jwz.org/gruntle/nomo.html</a></strong></span>)</p></blockquote></div><p>O gre&#537;eal&#259; înrudit&#259; este aceea de a s&#259;ri peste partea de prezentare
&#537;i împachetare, considerând c&#259; acestea pot fi f&#259;cute mai târziu, când
proiectul a demarat deja de ceva vreme. Prezentarea &#537;i împachetarea 
aplica&#539;iei cuprind destul de multe etape care toate se învârt în 
jurul ideei de a reduce dificultatea intr&#259;rii. Pentru ca proiectul s&#259; fie
deschis celor neini&#539;ia&#539;i trebuie scris&#259; documenta&#539;ia pentru utilizatori
&#537;i dezvoltatori, trebuie creat un site web care s&#259; ofere informa&#539;iile 
necesare celor care sunt noi, trebuie automate procesele de compilare
&#537;i instalare a software-ului, etc. Din p&#259;cate mul&#539;i programatori 
consider&#259; c&#259; aceast&#259; munc&#259; este de mai pu&#539;in&#259; importan&#539;&#259; decât codul în
sine. Exist&#259; câteva motive pentru care se întâmpl&#259; acest lucru. În primul
rând poate s&#259; par&#259; munc&#259; inutil&#259; pentru c&#259; beneficiile ei sunt mai
degrab&#259; vizibile celor mai pu&#539;in familiariza&#539;i cu proiectul &#537;i invers.
Oamenii care dezvolt&#259; codul nu au nevoie neap&#259;rat de acest proces de 
ambalare. Ei deja &#537;tiu s&#259; instaleze, administreze &#537;i s&#259; foloseasc&#259;
aplica&#539;ia pentru c&#259; au scris-o. În al doilea rând, deprinderile
necesare pentru a realiza bine prezentarea &#537;i împachetarea aplica&#539;iei
sunt complet diferite de cele de care e nevoie pentru a scrie cod.
Oamenii tind s&#259; se concentreze pe lucrurile la care sunt buni chiar dac&#259;
ar fi mai bine pentru proiect s&#259; petreac&#259; &#537;i pu&#539;in timp f&#259;când ceva
care li se potrive&#537;te mai pu&#539;in.  <a class="xref" href="getting-started.html" title="Cap. 2. Începutul">Cap. 2, <i>Începutul</i></a> discut&#259; în detaliu procesele de realizare
a prezent&#259;rii &#537;i împachet&#259;rii aplica&#539;iei &#537;i explic&#259; de ce e crucial
ca ele s&#259; fie o prioritate înc&#259; de la începutul proiectului.</p><p>Urm&#259;toarea pe lista noastr&#259; de gre&#537;eli frecvente sunt presupunerile
gre&#537;ita c&#259; în open-source nu e nevoie de management de proiect, c&#259; e 
nevoie de foarte pu&#539;in sau c&#259; acelea&#537;i practici de management folosite
la dezvoltarea în cadrul unei firme vor func&#539;iona la fel de bine la un
proiect open-source. Administrarea unui proiect deschis nu este 
întotdeauna foarte vizibil&#259; utilizatorilor dar în proiectele de succes
aceasta are loc în culise într-o form&#259; sau alta. Un mic exerci&#539;iu de 
gândire ajunge pentru a demonstra de ce. Un proiect open-source cuprinde
un grup aleator de programatori&#8212;deja o categorie cunoscut&#259; pentru
firea independent&#259;&#8212;care, cel mai probabil, nu s-au întâlnit 
niciodat&#259; unii cu al&#539;ii &#537;i care pot s&#259; urm&#259;reasc&#259; fiecare scopuri 
diferite prin munca lor de la proiect. Exerci&#539;iul const&#259; doar în a ne
imagina ce s-ar întâmpla cu un astfel de grup <span class="emphasis"><em>f&#259;r&#259;</em></span> 
management. Dac&#259; nu lu&#259;m în considerare miracolele, un astfel de grup 
s-ar destr&#259;ma foarte repede. Lucrurile pur &#537;i simplu nu se vor a&#537;eza 
singure, indiferent cât am dori noi s&#259; fie invers. Dar partea de 
management, de&#537;i poate fi destul de activ&#259;, e adesea lipsit&#259; de
formalitate &#537;i subtil&#259;. Singurul lucru care men&#539;ine coeziunea unui grup
de dezvoltare este credin&#539;a comun&#259; c&#259; pot face mai multe împreun&#259;
decât fiecare individual. Astfel, scopul procesului managerial este
de a se asigura faptul c&#259; ei împ&#259;rt&#259;&#537;esc în continuare acest crez prin
eliminarea marginaliz&#259;rii dezvoltatorilor datorate idiosincraziei &#537;i,
în general, f&#259;când proiectul unul la care dezvoltatorii s&#259; vrea s&#259; se
întoarc&#259;. Tehnicile specifice pentru realizarea acestui scop sunt
discutate pe parcursul c&#259;r&#539;ii.</p><p>Ultima categorie este a acelor probleme care ar putea fi denumite
"e&#537;ecuri ale naviga&#539;iei culturale". Acum zece ani, poate chiar cinci,
ar fi fost prematur s&#259; vorbim despre o cultur&#259; global&#259; a software-ului
gratuit. Ulterior a ap&#259;rut o cultur&#259; u&#537;or de recunoscut care nu este
monolitic&#259;&#8212;este la fel de predispus&#259; la conflicte interne ca &#537;i
orice alt&#259; cultur&#259; delimitat&#259; geografic&#8212; dar are un miez consistent.
Majoritatea proiectelor de succes prezint&#259; unele dintre aceste 
caracteristici comune. Ele recompenseaz&#259; anumite tipuri de comportament &#537;i
pedepsesc altele; creeaz&#259; o atmosfer&#259; care încurajeaz&#259; participarea 
neplanificat&#259;, uneori cu riscul reducerii gradului de coordonare; au
concepte de polite&#539;e &#537;i impolite&#539;e care pot s&#259; difere substan&#539;ial de cele
care exist&#259; în alte locuri. Cel mai important, cei care particip&#259; pe 
termen lung internalizeaz&#259; aceste standarde astfel încât s&#259; existe un 
consens vis-a-vis de conduita a&#537;teptat&#259; de la membri. Proiectele lipsite
de succes deviaz&#259; puternic de la acest miez de idei, chiar dac&#259; 
neinten&#539;ionat, &#537;i adeseori nu prezint&#259; un consens în leg&#259;tur&#259; cu 
ideea de comportament rezonabil. Asta înseamn&#259; c&#259;, atunci când apar 
probleme, situa&#539;ia poate s&#259; deterioreze rapid de vreme ce participan&#539;ilor
le lipse&#537;te un set de reflexe culturale la care s&#259; recurg&#259; pentru
rezolvarea diferen&#539;elor.</p><p>Aceast&#259; carte nu este un ghid practic, nu un studiu antropologic
sau o istorie. Totu&#537;i e nevoie de cunoa&#537;terea originilor culturii
free software din ziua de ast&#259;zi pentru a crea orice fel de sfaturi
practice. O persoan&#259; care în&#539;elege cultura poate s&#259; ajung&#259; departe în
lumea open-source, întâlnind multe varia&#539;ii locale în obiceiuri &#537;i 
dialect, r&#259;mânând capabil&#259; s&#259; participe confortabil &#537;i efectiv oriunde.
O persoan&#259; care nu în&#539;elege aceast&#259; cultur&#259; va considera procesul de
organizare sau participare la un proiect dificil &#537;i plin de surprize.
De vreme ce num&#259;rul de oameni care dezvolt&#259; software gratuit cre&#537;te 
cu salturi &#537;i limite, exist&#259; mul&#539;i oameni în aceast&#259; a doua categorie
&#8212;aceasta este, în mare, o cultur&#259; a imigran&#539;ilor recen&#539;i &#537;i va fi
la fel timp de ceva vreme. Dac&#259; v&#259; considera&#539;i a fi unul dintre ei, 
urm&#259;toarea sec&#539;iune furnizeaz&#259; informa&#539;iile de baz&#259; pentru discu&#539;iile
pe care le ve&#539;i întâlni ulterior, atât în aceast&#259; carte cât &#537;i pe Internet.
(Pe de alt&#259; parte, dac&#259; deja lucra&#539;i cu software open-source de ceva
vreme, s-ar putea s&#259; &#537;ti&#539;i deja destule despre istoria mi&#537;c&#259;rii a&#537;a
c&#259; pute&#539;i s&#259;ri lini&#537;ti&#539;i peste aceast&#259; sec&#539;iune.)</p></div><div class="sect1" title="Istorie"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>Istorie</h2></div></div></div><p>Folosirea de software în comun exist&#259; de aproape la fel de mult
ca &#537;i no&#539;iunea de software în sine. În primele zile ale calculatoarelor
fabrican&#539;ii au sim&#539;it c&#259; avantajele competitive puteau s&#259; apar&#259; doar
în inova&#539;ia hardware &#537;i nu au fost aten&#539;i la folosirea software-ului ca 
un bun comercial. Mul&#539;i dintre clien&#539;ii pentru aceste ma&#537;ini timpurii
erau oameni de &#537;tiin&#539;&#259; sau tehnicieni care erau capabili s&#259; modifice sau
 s&#259; extind&#259; aplica&#539;iile care erau livrate cu ma&#537;inile. Clien&#539;ii uneori
 distribuiau propriile patch-uri nu doar produc&#259;torului ci &#537;i 
 proprietarilor unor sisteme similare. Produc&#259;torii de multe ori tolerau
 &#537;i chiar încurajau acest fenomen: în ochii lor, îmbun&#259;t&#259;&#539;irile aduse
 soft-ului, indiferent de sursa de provenien&#539;&#259;, f&#259;ceau ma&#537;inile mai 
 atractive pentru poten&#539;ialii clien&#539;i.</p><p>De&#537;i aceast&#259; perioad&#259; seam&#259;n&#259; cu ceea ce se întâmpl&#259; ast&#259;zi în
cultura software-ului gratuit, difer&#259; în dou&#259; aspecte cruciale. În primul
rând, înc&#259; nu exista o standardizare a hardware-ului&#8212;era o perioad&#259;
de înflorire pentru inova&#539;ia în design-ul calculatoarelor, dar
diversitatea arhitecturilor de calcul însemna c&#259; totul era incompatibil
cu orice altceva. Astfel, aplica&#539;iile scrise pentru o ma&#537;in&#259; nu func&#539;ionau
pe altele. Programatorii acumulau expertiza într-o arhitectur&#259; sau o 
familie de arhitecturi (în ziua de ast&#259;zi devin exper&#539;i într-un limbaj
de programare sau într-o familie de limbaje de programare, &#537;tiind c&#259; 
expertiza lor va fi u&#537;or de transferat pe orice arhitectur&#259; hardware cu 
care au ocazia s&#259; lucreze). Pentru c&#259; experien&#539;a era specific&#259; unui
anumit tip de calculator, acumularea de expertiz&#259; avea efect asupra 
atractivit&#259;&#539;ii calculatorului pentru persoana respectiv&#259; &#537;i colegii ei.
Astfel, era în cel mai bun interes al produc&#259;torului s&#259; se disemineze 
cât mai departe codul &#537;i cuno&#537;tin&#539;ele specifice unei anumite ma&#537;ini.</p><p>În al doilea rând, nu exista Internet. De&#537;i existau mai pu&#539;ine
restric&#539;ii legale decât în ziua de ast&#259;zi, existau mai multe de ordin
tehnic: modalit&#259;&#539;ile de a transfera date dintr-un loc în altul erau 
neconvenabile &#537;i greoaie în compara&#539;ie cu ziua de ast&#259;zi. Existau ni&#537;te 
re&#539;ele micil, locale, bune pentru diseminarea informa&#539;iei între angaja&#539;ii
de la acela&#537;i laborator de cercetare sau dintr-o companie. Dar existau 
bariere de dep&#259;&#537;it dac&#259; o persoan&#259; ar fi vrut s&#259; împart&#259; ceva cu toat&#259;
lumea, indiferent unde se aflau. Aceste bariere <span class="emphasis"><em>erau dep&#259;&#537;ite
</em></span> în multe cazuri. Uneori diferite grupuri intrau în leg&#259;tur&#259;
unele cu altele în mod independent, trimi&#539;ând dischete sau casete prin
po&#537;t&#259;, uneori fabrican&#539;ii serveau ei în&#537;i&#537;i ca &#537;i puncte centrale de 
transmisie a patch-urilor. A fost de ajutor &#537;i faptul c&#259; mul&#539;i dintre
primii dezvoltatori software lucrau la universit&#259;&#539;i unde era de a&#537;teptat
ca fiecare s&#259;-&#537;i publice cuno&#537;tin&#539;ele. Dar realitatea de ordin fizic în
transmiterea datelor însemna c&#259; întotdeauna exista un obstacol în calea
distribu&#539;iei, o problem&#259; direct propor&#539;ional&#259; cu distan&#539;a (dificult&#259;&#539;i 
reale sau de ordin organiza&#539;ional) pe care aplica&#539;ia trebuia s&#259; o parcurg&#259;
pân&#259; la destina&#539;ie. Nu era posibil&#259; împ&#259;r&#539;irea pe scar&#259; larg&#259;, cum se
întâmpl&#259; în ziua de ast&#259;zi.</p><div class="sect2" title="Apari&#539;ia software-ului proprietar &#537;i a celui gratuit"><div class="titlepage"><div><div><h3 class="title"><a name="propertization"></a>Apari&#539;ia software-ului proprietar &#537;i a celui gratuit</h3></div></div></div><p>Pe m&#259;sur&#259; ce industria s-a maturizat, mai multe schimb&#259;ri 
interrela&#539;ionale au avut loc simultan. Diversitatea modelelor hardware
a f&#259;cut loc câtorva câ&#537;tig&#259;tori&#8212;prin tehnologie superioar&#259;, 
marketing superior sau o combina&#539;ie a celor dou&#259;. În acela&#537;i timp, &#537;i
nu în întregime printr-o coinciden&#539;&#259;, dezvoltarea a&#537;a-numitelor limbaje
de programare "de nivel înalt" însemna c&#259; se puteau scrie programe o 
singur&#259; dat&#259;, într-un limbaj, care s&#259; fie apoi traduse automat 
("compilate") pentru a rula pe diferite tipuri de calculatoare. 
Implica&#539;iile acestui fapt nu au r&#259;mas necunoscute pentru produc&#259;torii
de hardware: un client putea acum s&#259; ini&#539;ieze un proiect de inginerie
software de mare anvergur&#259; f&#259;r&#259; a fi nevoie s&#259; r&#259;mân&#259; bloca&#539;i într-o
anumit&#259; arhitectur&#259; de calculator. Când acest lucru s-a combinat cu 
reducerea treptat&#259; a diferen&#539;ei de performan&#539;&#259; dintre diferitele 
calculatoare, pe m&#259;sur&#259; ce modelele mai pu&#539;in eficiente au disp&#259;rut, 
un produc&#259;tor care î&#537;i trata hardware-ul ca fiind singurul bun comercial
aflat la dispozi&#539;ie putea s&#259; se a&#537;tepte la o descre&#537;tere a ratei
profitului în viitor. Puterea de calcul pur&#259; devenea un bun fungibil
pe când software-ul devenea un diferen&#539;iator. Vânzarea de aplica&#539;ii, sau
cel pu&#539;in tratarea acestora ca o parte integral&#259; a vânz&#259;rii de hardware,
începea s&#259; par&#259; o strategie bun&#259;.</p><p>Asta însemna c&#259; produc&#259;torii trebuiau s&#259; impun&#259; mai strict reguli
de copyright asupra codului surs&#259;. Dac&#259; utilizatorii continuau pur &#537;i
simplu s&#259; împart&#259; codul &#537;i s&#259;-l modifice liberi între ei, ar fi putut s&#259;
reimplementeze în mod independent unele dintre îmbun&#259;t&#259;&#539;irile care
erau vândute acum ca &#537;i "valoare ad&#259;ugat&#259;" de c&#259;tre furnizor. Mai r&#259;u,
codul putea s&#259; ajung&#259; în mâinile concuren&#539;ei. Ironia face ca acest
fenomen s&#259; aib&#259; loc exact în perioada în care Internetul f&#259;cea primii
pa&#537;i. Când împ&#259;r&#539;irea neobstruc&#539;ionat&#259; a software-ului devenea posibil&#259;
tehnic, schimb&#259;rile din industria computerelor o f&#259;ceau nedorit&#259; 
economic, cel pu&#539;in din punctul de vedere al oric&#259;rei companii. Furnizorii
au închis aceste porti&#539;e prin refuzul de a permite accesul utilizatorilor
la codul care rula pe ma&#537;inile lor, sau prin impunerea unor 
acorduri de nedivulgare a secretului care f&#259;ceau utilizarea la comun
a codului imposibil&#259;.</p><div class="sect3" title="Rezisten&#539;a con&#537;tient&#259;"><div class="titlepage"><div><div><h4 class="title"><a name="history-conscious-resistance"></a>Rezisten&#539;a con&#537;tient&#259;</h4></div></div></div><p>Pe m&#259;sur&#259; ce lumea care efectua schimburi nelimitate de cod 
disp&#259;rea încet, în mintea a cel pu&#539;in un programator s-a cristalizat
o contrareac&#539;ie. Richard Stallman a lucrat în Laboratorul de Inteligen&#539;&#259;
Artificial&#259; de la Institutul de Tehnologie din Massachusetts în anii '70 
&#537;i la începutul anilor '80, în timpul a ceea ce s-a dovedit a fit epoca 
de aur &#537;i locul potrivit pentru folosirea în comun a codului. Laboratorul
de Inteligen&#539;&#259; Artificial&#259; avea o &#8222;etic&#259; de lucru&#8221; puternic&#259;. <sup>[<a name="idp4695392" href="#ftn.idp4695392" class="footnote">3</a>]</sup> &#537;i oamenii nu erau 
încuraja&#539;i dar se a&#537;tepta de la ei s&#259; îi în&#537;tiin&#539;eze pe restul de 
modific&#259;rile pe care le f&#259;ceau sistemului. Dup&#259; cum a scris mai târziu
Stallman:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Nu ne intitulam aplica&#539;iile ca fiind &#8222;software 
      gratuit&#8221; pentru c&#259; termenul nu exista; dar asta era în realitate.
      Oricând oamenii de la o alt&#259; universitate sau companie voiau s&#259;
      transforme &#537;i s&#259; foloseasc&#259; un program, îi l&#259;sam ferici&#539;i s&#259; o fac&#259;.
      Dac&#259; vedeai pe cineva care folosea un program necunoscut dar 
      interesant, puteai întotdeauna s&#259; ceri s&#259; vezi codul surs&#259; astfel
      încât s&#259; po&#539;i s&#259;-l cite&#537;ti, s&#259;-l modifici sau s&#259; folose&#537;ti p&#259;r&#539;i 
      din el pentru a face un nou program.
      </em></span></p><p>(sursa <span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.html" target="_top">http://www.gnu.org/gnu/thegnuproject.html</a></strong></span>)</p></blockquote></div><p>Aceast&#259; comunitate Edenic&#259; s-a pr&#259;bu&#537;it în jurul lui Stallman
pu&#539;in dup&#259; 1980, când schimb&#259;rile care aveau loc în restul industriei 
au ajuns &#537;i în laborator. O companie start-up a angajat mul&#539;i dintre 
programatorii Laboratorului pentru a lucra la un sistem de operare
asem&#259;n&#259;tor cu ceea ce lucrau acolo numai c&#259;, de data aceasta, totul
se f&#259;cea sub o licen&#539;&#259; exclusiv&#259;. În acela&#537;i timp, Laboratorul achizi&#539;iona
echipament nou care venea cu un sistem de operare proprietar.</p><p>Stallman observa modelul mare a ceea ce se întâmpla:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Calculatoarele moderne ale erei, cum ar fi VAX sau
      68020, aveau propriile sisteme de operare dar niciunul dintre ele
      nu era software gratuit: trebuia s&#259; semnezi un act de 
      confiden&#539;ialitate numai pentru a ob&#539;ine o copie executabil&#259;.
      </em></span> </p><p><span class="emphasis"><em>Asta însemna c&#259; primul pas pentru a folosi un 
      calculator era s&#259; promi&#539;i s&#259; nu-&#539;i aju&#539;i vecinul. Comunitatea 
      cooperant&#259; era interzis&#259;. Regula f&#259;cut&#259; de proprietarii soft-ului
      proprietar era: &#8222;dac&#259; împar&#539;i cu vecinii, e&#537;ti un pirat; dac&#259; vrei
      modific&#259;ri, implor&#259;-ne s&#259; le facem.&#8221;
      </em></span> </p></blockquote></div><p>Printr-o ciud&#259;&#539;enie de personalitate, el s-a decis s&#259; reziste 
modei. În loc s&#259; lucreze în continuare la acum-decimatul Laborator de 
Inteligen&#539;&#259; Artificial&#259; sau s&#259;-&#537;i ia o slujb&#259; scriind cod la una dintre
noile companii, unde rezultatele muncii lui ar fi r&#259;mas închise într-o
cutie, a demisionat de la laborator &#537;i a ini&#539;iat Proiectul GNU &#537;i 
Funda&#539;ia pentru Software Gratuit (Free Software Foundation - FSF). 
Scopul GNU<sup>[<a name="idp4705104" href="#ftn.idp4705104" class="footnote">4</a>]</sup> era s&#259; dezvolte un sistem de operare complet gratuit
&#537;i deschis &#537;i un corp de software în care utilizatorii nu erau niciodat&#259;
împiedica&#539;i s&#259; modifice codul sau s&#259; împart&#259; modific&#259;rile cu al&#539;ii. El,
în esen&#539;&#259;, încerca s&#259; recreeze ceea ce se distrusese la laborator, dar la
o scar&#259; global&#259; &#537;i f&#259;r&#259; vulnerabilit&#259;&#539;ile care f&#259;cuser&#259; cultura 
laboratorului AI susceptibil&#259; la dezintegrare.</p><p>Pe lâng&#259; faptul c&#259; lucra la un sistem de operare nou, Stallman a 
creat o licen&#539;&#259; de copyright ai c&#259;rei termeni garantau faptul c&#259;
sursele aplica&#539;iilor create urmau s&#259; fie întotdeauna libere. Licen&#539;a
General&#259; Public&#259; GNU (GPL) este o pies&#259; inteligent&#259; de judo legal: spune
c&#259; sursele pot fi copiate &#537;i modificate f&#259;r&#259; restric&#539;ii &#537;i c&#259; atât copiile
cât &#537;i lucr&#259;rile derivate (i.e. versiunile modificate) trebuie s&#259; fie
distribuite sub aceea&#537;i licen&#539;&#259; ca &#537;i originalul, f&#259;r&#259; niciun fel de
restric&#539;ii adi&#539;ionale. Prin urmare, folose&#537;te legea copyright-ului pentru
a ob&#539;ine un efect contrar aceluia al copyright-ului tradi&#539;ional: previne
ca <span class="emphasis"><em>oricine</em></span>, chiar &#537;i autorul, s&#259; poat&#259; s&#259; limiteze 
accesul la cod. Pentru Stallman era mai bine decât s&#259; dea drumul codului
în domeniul public. Dac&#259; ar fi fost proprietate din domeniul public, orice
copie particular&#259; putea fi copiat&#259; într-un program proprietar (dup&#259; cum 
s-a întâmplat deja cu licen&#539;ele de copyright pu&#539;in restrictive). În timp
ce aceast&#259; încorporare nu ar diminua deloc disponibilitatea codului 
original, ar fi însemnat  c&#259; eforturile lui Stallman puteau beneficia
du&#537;manului&#8212; software-ul proprietar. Licen&#539;a GPL poate fi v&#259;zut&#259; ca 
o form&#259; de protec&#539;ionism pentru software-ul gratuit pentru c&#259; previne ca 
aplica&#539;iile comerciale s&#259; foloseasc&#259; la maximum codul creat sub licen&#539;&#259; 
GPL. Licen&#539;a &#537;i rela&#539;ia ei cu alte licen&#539;e software sunt discutate în
detaliu în
<a class="xref" href="legal.html" title="Cap. 9. Licenses, Copyrights, and Patents">Cap. 9, <i>Licenses, Copyrights, and Patents</i></a>.</p><p>Cu ajutorul multor programatori, dintre care unii împ&#259;rt&#259;&#537;eau
ideologia lui Stallman iar al&#539;ii pur &#537;i simplu voiau s&#259; vad&#259; mult cod
gratuit disponibil, proiectul GNU a început s&#259; elibereze aplica&#539;ii 
gratuite care s&#259; înlocuuiasc&#259; multe dintre componentele critice ale
unui sistem de operare. Mul&#539;umit&#259; standardiz&#259;rii la scar&#259; larg&#259; care 
exista deja, era posibil pentru a folosi aplica&#539;ii GNU pe alte sisteme, 
care nu erau gratuite, iar mul&#539;i oameni au ales s&#259; fac&#259; asta. Editorul
de text GNU (Emacs) &#537;i compilatorul C (GCC) aveau cel mai mare succes,
adunând mul&#539;i utilizatori nu pe motive ideologice ci datorit&#259; meritelor
lor tehnice. Pân&#259; în jurul anului 1990, GNU produsese deja cea mai mare 
parte a unui sistem de operare gratuit, cu excep&#539;ia kernel-ului&#8212;
partea pe care ma&#537;ina o ini&#539;ializeaz&#259; la pornirea sistemului de operare
&#537;i care gestioneaz&#259; memoria, hard-disk-ul &#537;i alte resurse. </p><p>Din p&#259;cate, proiectul GNU a ales un design de kernel care s-a 
dovedit a fi mai greu de implementat decât se a&#537;tepta ini&#539;ial. Întârzierea
care a urmat a împiedicat Funda&#539;ia pentru Software Liber s&#259; lanseze primul
sistem de operare în întregime gratuit. Ultima bucat&#259; a fost pus&#259; la
locul ei de Linus Torvalds, un student în calculatoare finlandez care,
cu ajutorul voluntarilor din jurul lumii, a terminat un kernel folosind
un design mai conservator. L-a denumit Linux &#537;i astfel, când l-a combinat cu 
programele GNU existente, a rezultat primul sistem de operare complet
gratuit. Pentru prima dat&#259; puteai s&#259;-&#539;i porne&#537;ti calculatorul &#537;i
s&#259; faci asta f&#259;r&#259; a folosi niciun fel de software proprietar.
<sup>[<a name="idp4711696" href="#ftn.idp4711696" class="footnote">5</a>]</sup></p><p>O parte mare din software-ul acestui sistem de operare nou nu era
produs de proiectul GNU. De fapt, GNU nu nici m&#259;car singurul grup
care lucra la crearea unui sistem de operare gratuit (de exemplu, codul
care a devenit ulterior NetBSD &#537;i FreeBSD deja era în curs de dezvoltare
la acest moment). Importan&#539;a Funda&#539;iei pentru Software Gratuit nu era
doar în codul scris ci în retorica politic&#259;. Vorbind despre software liber
ca &#537;i despre o cauz&#259; în loc de un bun, au f&#259;cut destul de greu ca un
programator s&#259; <span class="emphasis"><em>nu</em></span> aib&#259; o pozi&#539;ie politic&#259; pe aceast&#259;
tem&#259;. Chiar &#537;i cei care nu erau de-acord cu Funda&#539;ia erau nevoi&#539;i s&#259;
dezbat&#259; tema, chiar dac&#259; numai pentru a sus&#539;ine o pozi&#539;ie diferit&#259;. 
Eficien&#539;a Funda&#539;iei ca &#537;i element de propagand&#259; se afla în legarea codului
lor de un mesaj, cu ajutorul GPL &#537;i a altor texte. Pe m&#259;sur&#259; ce codul
lor se r&#259;spândea, se r&#259;spândea &#537;i acel mesaj.</p></div><div class="sect3" title="Rezisten&#539;a accidental&#259;"><div class="titlepage"><div><div><h4 class="title"><a name="history-accidental-resistance"></a>Rezisten&#539;a accidental&#259;</h4></div></div></div><p>Existau destul de multe lucruri care se întâmplau pe scena na&#537;terii
software-ului liber dar pu&#539;ine erau explicite în mod ideologic, cum era
proiectul GNU al lui Stallman. Unul dintre cele mai importante era
<em class="firstterm">Berkeley Software Distribution</em>
(<em class="firstterm">BSD</em>), o reimplementare treptat&#259; a sistemului de
operare Unix&#8212; care, pân&#259; la sfâr&#537;itul anilor 70, era un proiect
de cercetare în mare parte proprietar al celor de la AT&amp;T&#8212;de 
c&#259;tre programatorii de la Universitatea din California de la Berkeley.
Grupul BSD nu f&#259;cea afirma&#539;ii politice deschise despre nevoia ca
programatorii s&#259; se strâng&#259; la un loc &#537;i s&#259; împart&#259; codul unii cu al&#539;ii
dar ei <span class="emphasis"><em>practicau</em></span> aceast&#259; idee cu fler &#537;i entuziasm,
coordonând un efort de dezvoltare distribuit masiv în care s-au rescris
de la zero toate utilitarele Unix de linie de comand&#259;, libr&#259;riile de cod 
&#537;i, ulterior, inclusiv nucleul sistemului de operare prin munca
voluntarilor. Proiectul BSD a devenit un exemplu de prim&#259; mân&#259; de 
dezvoltare de software gratuit neideologic&#259; &#537;i a servit ca &#537;i teren de
antrenament pentru mul&#539;i dezvoltatori care urmau s&#259; r&#259;mân&#259; activi în
lumea open source.</p><p>Un alt exemplu de dezvoltare cooperativ&#259; a fost primul <em class="firstterm">
Sistem de ferestre X</em>, un mediu de calcul grafic gratuit &#537;i
transparent la existen&#539;a unei re&#539;ele, dezvoltat la MIT la mijlocul anilor
1980 în parteneriat cu produc&#259;torii hardware care aveau un interes comun
în a fi capabili s&#259; ofere clien&#539;ilor lor un sistem de ferestre. Departe
de a se opune software-ului proprietar, licen&#539;a X permitea în mod
inten&#539;ionat extensii proprietare peste miezul gratuit&#8212; fiecare
membru al consor&#539;iului dorea s&#259; aib&#259; ocazia de a extinde distribu&#539;ia de 
baz&#259; X &#537;i de a câ&#537;tiga un avantaj competitiv peste al&#539;i membri. X Windows
<sup>[<a name="idp4721104" href="#ftn.idp4721104" class="footnote">6</a>]</sup> reprezenta, în sine, un software 
gratuit dar era în principal un mod de a nivela terenul de joc între
interesele de afaceri aflate în concuren&#539;&#259;, nu o dorin&#539;&#259; de a termina 
domina&#539;ia software-ului proprietar. Un alt exemplu, care preceda GNU
cu câ&#539;iva ani, era TeX, sistemul gratuit de tehnoredactare pentru calitatea
publica&#539;iei realizat de Donald Knuth. El l-a lansat cu o licen&#539;&#259; care
permitea oricui s&#259; modifice &#537;i s&#259; distribuie codul dar s&#259; nu denumeasc&#259;
rezultatul TeX decât dac&#259; trecea de un set foarte strict de teste de
compatibilitate (acesta este un exemplu al unei clase de licen&#539;e 
gratuite care &#8222;protejeaz&#259; marca&#8221;, discutate mai mult în 
<a class="xref" href="legal.html" title="Cap. 9. Licenses, Copyrights, and Patents">Cap. 9, <i>Licenses, Copyrights, and Patents</i></a>) Knuth nu era de o parte a barierei sau de alta 
în lupta dintre software proprietar &#537;i liber, el avea nevoie doar de un
sistem mai bun de tehnoredactare pentru a-&#537;i realiza <span class="emphasis"><em>adev&#259;ratul
</em></span> &#539;el&#8212;o carte despre programarea calculatoarelor &#8212;
&#537;i nu vedea niciun motiv pentru care s&#259; nu pun&#259; sistemul lui la 
dispozi&#539;ia întregii lumi dup&#259; ce era terminat.</p></div><p>F&#259;r&#259; a pune pe list&#259; fiecare proiect &#537;i fiecare licen&#539;&#259;, putem 
spune cu siguran&#539;&#259; c&#259;, pân&#259; la sfâr&#537;itul anilor 1980, exista deja destul
de mult software gratuit sub o gam&#259; larg&#259; de licen&#539;e. Diversitatea 
acestora din urm&#259; reflecta o gam&#259; larg&#259; de motive corespondente. Chiar
&#537;i unii dintre programatorii care au ales licen&#539;a GNU GPL erau mult mai
pu&#539;in orienta&#539;i ideologic decât proiectul GNU în sine. De&#537;i le f&#259;cea 
pl&#259;cere s&#259; lucreze la software gratuit, majoritatea nu considerau 
aplica&#539;iile proprietare ca fiind un r&#259;u social. Existau oameni care 
sim&#539;eau un impuls moral de a sc&#259;pa lumea de &#8222;software hoarding&#8221; (termenul
lui Stallman pentru aplica&#539;iile comerciale), dar al&#539;ii erau mai motiva&#539;i
de interesele tehnice sau de pl&#259;cerea de a lucra al&#259;turi de colaboratori
care gândeau la fel sau pur &#537;i simplu dintr-o nevoie uman&#259; simpl&#259; de
glorie. Totu&#537;i, aceste motiva&#539;ii diverse nu prea interac&#539;ionau în moduri
destructive. Aceasta se datoreaz&#259; în mare parte faptului c&#259;, spre 
deosebire de proz&#259; sau arte vizuale, software-ul trebuie s&#259; treac&#259; de
teste obiective pentru a fi considerat de succes: trebuie s&#259; ruleze &#537;i s&#259;
fie, în mare parte, lipsit de erori. Asta d&#259; majoritatea participan&#539;ilor
la un proiect un fel de teren comun automat, un motiv &#537;i o funda&#539;ie pentru
colaborare f&#259;r&#259; a-&#537;i face prea multe griji pentru altfel de calific&#259;ri
decât cele de ordin tehnic.</p><p>Dezvoltatorii mai aveau un motiv pentru a r&#259;mâne împreun&#259;: s-a 
dovedit c&#259; în lumea software-ului liber se producea ni&#537;te cod de calitate
foarte bun&#259;. În unele cazuri, s-a demonstrat a fi tehnic superior celor
mai apropiate alternative comerciale; în alte cazuri era cel pu&#539;in 
comparabil dar costa întotdeauna mai pu&#539;in. De&#537;i doar pu&#539;ini oameni erau
motiva&#539;i s&#259; ruleze software gratuit din ra&#539;iuni pur filosofice, mul&#539;i
oameni erau bucuro&#537;i s&#259;-l foloseasc&#259; pentru c&#259; f&#259;cea o treab&#259; mai bun&#259;.
Dintre cei care îl foloseau, unii erau întotdeauna dornici s&#259;-&#537;i doneze
timpul &#537;i abilit&#259;&#539;ile pentru a ajuta la între&#539;inerea &#537;i îmbun&#259;t&#259;&#539;irea
aplica&#539;iilor.</p><p>Aceast&#259; tendin&#539;&#259; de a produce cod bun nu era, desigur, universal&#259;
dar se întâmpla cu o frecven&#539;&#259; crescând&#259; în proiectele libere din jurul
lumii. Afacerile care depindeau din greu de software au început s&#259;
observe acest fenomen. Multe dintre ele au descoperit c&#259; deja foloseau
astfel de aplica&#539;ii în func&#539;ionarea de zi cu zi &#537;i nu au &#537;tiut (conducerea
nu &#537;tie întotdeauna ce se întâmpl&#259; în departamentele de IT). Corpora&#539;iile
au început s&#259; ia o pozi&#539;ie public&#259; &#537;i mai activ&#259; în dezvoltarea de
proiecte libere, contribuind timp &#537;i echipament, uneori chiar finan&#539;ând
în mod direct dezvoltarea de aplica&#539;ii gratuite. Astfel de investi&#539;ii
puteau, în cele mai bune cazuri, s&#259; se r&#259;spl&#259;teasc&#259; de mai multe ori.
Sponsorul pl&#259;te&#537;te doar un num&#259;r mic de programatori exper&#539;i care s&#259;
se dedice proiectului full-time dar câ&#537;tig&#259; de pe urma beneficiilor
aduse de contribu&#539;ia <span class="emphasis"><em>oricui</em></span>, inclusiv de pe urma
muncii realizate de voluntari nepl&#259;ti&#539;i &#537;i chiar de programatori
pl&#259;ti&#539;i de alte corpora&#539;ii.</p></div><div class="sect2" title='"Gratuit" Versus "Surs&#259; deschis&#259;"'><div class="titlepage"><div><div><h3 class="title"><a name="free-vs-open-source"></a>"Gratuit" Versus "Surs&#259; deschis&#259;"</h3></div></div></div><p>Pe m&#259;sur&#259; ce lumea corporatist&#259; dedica din ce în ce mai mult&#259;
aten&#539;ie software-ului gratuit, programatorii se loveau de o noi probleme
cu prezentarea. Una dintre acestea era cuvântul &#8222;gratuit&#8221; în sine. La
auzul cuvintelor &#8222;software gratuit&#8221; mul&#539;i oameni se gândesc doar la
&#8222;software f&#259;r&#259; cost&#8221;. E adev&#259;rat c&#259; toate aplica&#539;iile libere sunt
lipsite de cost<sup>[<a name="idp4738320" href="#ftn.idp4738320" class="footnote">7</a>]</sup> dar nu tot software-ul gratuit e complet liber. De exemplu,
în timpul &#8222;b&#259;t&#259;liei browserelor&#8221; din anii 1990, atât Netscape cât &#537;i
Microsoft î&#537;i ofereau browserele f&#259;r&#259; cost, în graba de a câ&#537;tiga cot&#259;
de pia&#539;&#259;. Niciunul dintre browsere nu era liber. Nu se putea face rost
de codul surs&#259; al aplica&#539;iei &#537;i, chiar dac&#259; ai fi reu&#537;it, nu aveai dreptul
de a îl modifica sau redistribui.<sup>[<a name="idp4740048" href="#ftn.idp4740048" class="footnote">8</a>]</sup>  Nu se putea face mai
mult decât s&#259; downloadezi un executabil &#537;i s&#259; îl rulezi. Browserele nu 
erau mai libere decât software-ul care se putea cump&#259;ra din magazine; pur
&#537;i simplu aveau un pre&#539; mai mic.</p><p>Aceast&#259; confuzie datorat&#259; termenului &#8222;free&#8221; se datoreaz&#259;
unei ambiguit&#259;&#539;i nefericite din limba Englez&#259;. Majoritatea limbilor fac
distinc&#539;ia între pre&#539;ul mic &#537;i libertate (diferen&#539;a dintre
<span class="emphasis"><em>gratis</em></span> &#537;i <span class="emphasis"><em>libre</em></span> este clar&#259; 
tuturor vorbitorilor de limbi romanice, de exemplu). Dar pozi&#539;ia
limbii engleza ca &#537;i limb&#259; care une&#537;te de facto Internetul înseamn&#259; c&#259;
o problem&#259; cu limba englez&#259; este, într-o anumit&#259; m&#259;sur&#259;, o problem&#259;
pentru toat&#259; lumea. Confuzia creat&#259; în jurul acestui termen a fost atât
de mare încât programatorii de software liber &#537;i-au creat un r&#259;spuns
standard: &#8222;E <span class="emphasis"><em>liber</em></span> ca în
<span class="emphasis"><em>liberate</em></span>&#8212;gândi&#539;i-v&#259; la <span class="emphasis"><em>libertatea
cuvântului</em></span> &#537;i nu la <span class="emphasis"><em>bere gratuit&#259;</em></span>."  
Totu&#537;i, necesitatea de a explica înc&#259; &#537;i înc&#259; o dat&#259; acest lucru e 
obositoare. Mul&#539;i programatori au sim&#539;it, cu un anumit grad de 
justificare, c&#259; natura ambigu&#259; a cuvântului &#8222;free&#8221; îngreuna în&#539;elegerea
publicului pentru acest tip de software.</p><p>Dar problema mergea mai adânc de atât. Cuvântul &#8222;free&#8221; aduce cu el
o conota&#539;ie moral&#259; de care nu se poate sc&#259;pa: dac&#259; libertatea era un 
scop, nu conta dac&#259; software-ul liber era &#537;i mai bun sau mai profitabil
pentru anumite afaceri în anumite condi&#539;ii. Acesta era pur &#537;i simplu un
efect secundar pl&#259;cut al unei motiva&#539;ii care, la origini, nu era nici
tehnic&#259; nici mercantil&#259; ci moral&#259;. Mai departe, pozi&#539;ia de &#8222;liber ca &#537;i
în cuvântul libertate&#8221; a for&#539;at corpora&#539;iile care voiau s&#259; sprijine
anumite programe libere s&#259; fie inconsistente într-o parte din afacerile
lor în timp ce continuau s&#259; vând&#259; software proprietar în alta.
</p><p>Aceste dileme s-au pus unei comunit&#259;&#539;i care se afla deja în fa&#539;a
unei crize de identitate. Programatorii care
<span class="emphasis"><em>scriu</em></span> software liber nu au avut niciodat&#259; o singur&#259;
p&#259;rere despre scopul per ansamblu, dac&#259; exist&#259; un astfel de scop, al 
mi&#537;c&#259;rii pentru software liber. Chiar dac&#259; am spune c&#259; p&#259;rerile trec
dintr-o extrem&#259; într-alta tot am induce în eroare deoarece am sugera 
c&#259; avem de-a face cu un domeniu liniar când, în realitate, avem o 
împr&#259;&#537;tiere multidimensional&#259;. Totu&#537;i, dou&#259; categorii largi de p&#259;reri pot
fi distinse, dac&#259; dorim s&#259; ignor&#259;m temporar nuan&#539;ele. Un grup e de
p&#259;rerea lui Stallman, c&#259; libertatea de a distribui &#537;i modifica e cea mai 
importan&#259; &#537;i c&#259;, de aceea, dac&#259; nu se mai vorbe&#537;te de libertate s-a 
pierdut elementul central. Al&#539;ii cred c&#259; software-ul însu&#537;i este cel
mai important argument în favoarea lui &#537;i nu se simt confortabil în a 
cataloga software-ul proprietar ca fiind r&#259;u din oficiu. Unii, dar nu
to&#539;i, dintre programatorii de software liber cred c&#259; autorul (sau 
angajatorul, în cazul muncii pl&#259;tite)
<span class="emphasis"><em>ar trebui</em></span> s&#259; aib&#259; dreptul de a controla termenii
sub care e permis&#259; distribuirea &#537;i c&#259; nu trebuie s&#259; fie ata&#537;at&#259; o 
judecat&#259; moral&#259; alegerii unor anumi&#539;i termeni.</p><p>Pentru mult&#259; vreme, aceste diferen&#539;e nu trebuiau s&#259; fie atent
examinate sau articulate, dar succesul software-ului liber în lumea
afacerilor au f&#259;cut tema imposibil de evitat. În 1998, termenul 
<em class="firstterm">open source</em> a fost creat ca o alternativ&#259;
la &#8222;liber&#8221; de c&#259;tre o coali&#539;ie de programatori care au devenit în cele
din urm&#259; Ini&#539;iativa Open-Source (OSI).
<sup>[<a name="idp4753424" href="#ftn.idp4753424" class="footnote">9</a>]</sup>  OSI consider&#259;
nu doar c&#259; termenul &#8222;free software&#8221; poate cauza confuzie dar &#537;i c&#259;
folosirea cuvântului &#8222;free&#8221; e doar o simptom&#259; a problemei generale:
c&#259; mi&#537;carea are nevoie de un program de marketing pentru a se lega de 
lumea corporatist&#259; &#537;i c&#259; discu&#539;ia despre moralitate &#537;i beneficiile sociale
ale distribuirii gratuite nu ar avea niciodat&#259; succes în s&#259;lile de &#537;edin&#539;&#259;
corporatiste. În propriile lor cuvinte:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Ini&#539;iativa Open-Source este un program
      de marketing pentru software liber. E un teren de tratare a 
      software-ului liber pe un teren solid &#537;i pragmatic în locul
      ideologiilor extremiste. Elementul câ&#537;tig&#259;tor nu s-a schimbat
      ci doar atitudinea &#537;i simbolismul care duceau la înfrângere. 
      ...</em></span></p><p><span class="emphasis"><em>Explica&#539;ia care trebuie dat&#259; majorit&#259;&#539;ii celor
      din domeniul tehnic nu este despre conceptul open source ci 
      despre nume. De ce s&#259; nu se numeasc&#259;, a&#537;a cum a fost în mod 
      tradi&#539;ional, software liber?</em></span></p><p><span class="emphasis"><em>Un motiv este c&#259; termenul de software liber
      poate fi u&#537;or în&#539;eles în moduri care genereaz&#259; conflict. 
      ;...</em></span></p><p><span class="emphasis"><em>Dar adev&#259;ratul motiv pentru re-etichetare
      este unul de marketing. Noi încerc&#259;m s&#259; lans&#259;m un nou concept
      c&#259;tre lumea corporatist&#259;. Avem un produs câ&#537;tig&#259;tor, dar pozi&#539;ionarea
      noastr&#259; din trecut a fost groaznic&#259;. Termenul de software liber
      a fost prost în&#539;eles de c&#259;tre oamenii de afaceri, care confund&#259; 
      dorin&#539;a de a îp&#259;r&#539;i cu al&#539;ii cu anti-comercialismul sau, chiar mai
      r&#259;u, cu furtul.</em></span></p><p><span class="emphasis"><em>Directorii &#537;i responsabilii tehnici ai corpora&#539;iilor
      nu vor cump&#259;ra niciodat&#259; software liber. Dar dac&#259; lu&#259;m aceea&#537;i 
      tradi&#539;ie, aceia&#537;i oameni &#537;i acelea&#537;i licen&#539;e pentru software liber
      &#537;i schimb&#259;m eticheta în &#8222;open source&#8221;? A&#537;a ceva vor cump&#259;ra.
      </em></span></p><p><span class="emphasis"><em>Unora dintre hackeri li se va p&#259;rea greu de crezut
      a&#537;a ceva dar asta e doar pentru c&#259; ei sunt oameni tehnici, care 
      gândesc în termeni concre&#539;i, cu substan&#539;&#259;, &#537;i nu în&#539;eleg
      cât de important&#259; e imaginea atunci când vinzi ceva.
      </em></span></p><p><span class="emphasis"><em>În marketing, înveli&#537;ul reprezint&#259; realitatea.
      Imaginea pentru care suntem dispu&#537;i s&#259; coborâm de pe baricade
      &#537;i s&#259; lucr&#259;m pentru lumea corporatist&#259; conteaz&#259; la fel de mult
      ca &#537;i realitatea comportamentului nostru, a convingerilor
      noastre &#537;i a software-ului nostru.</em></span></p><p>(din <span class="bold"><strong><a class="ulink" href="http://opensource.feratech.com/advocacy/faq.php" target="_top">http://opensource.feratech.com/advocacy/faq.php</a></strong></span>
      &#537;i <span class="bold"><strong><a class="ulink" href="http://opensource.feratech.com/advocacy/case_for_hackers.php#marketing" target="_top">http://opensource.feratech.com/advocacy/case_for_hackers.php#marketing</a></strong></span>)</p></blockquote></div><p>Vârfurile mai multor iceberg-uri de controvers&#259; sunt vizibile
în acest text. Se refer&#259; la &#8222;convingerile noastre&#8221; dar evit&#259; în mod 
inteligent s&#259; scrie care sunt acestea. Pentru unii, ar putea fi convingerea
c&#259; aplica&#539;iile dezvoltate într-un proces deschis vor fi mai de calitate;
pentru al&#539;ii, convingerea c&#259; toat&#259; informa&#539;ia trebuie s&#259; fie distribuit&#259;
liber. Termenul de &#8222;furt&#8221; se folose&#537;te pentru referirea la copierea
(presupus&#259;) ilegal&#259;&#8212;o întrebuin&#539;are la care exist&#259; multe obiec&#539;ii,
motivând c&#259; nu e furt dac&#259; proprietarul original înc&#259; are obiectul
dup&#259; copiere. Exist&#259; o indica&#539;ie c&#259; mi&#537;carea pentru software liber poate
fi acuzat&#259; în mod gre&#537;it de anti-comercialism dar textul las&#259; 
neexaminat&#259; întrebarea dac&#259; o astfel de acuza&#539;ie are vreo baz&#259; real&#259;.
</p><p>Nu trebuie în&#539;eles c&#259; site-ul OSI e inconsistent sau c&#259; induce în
eroare Mai degrab&#259;, e un exemplu a ceea ce OSI sus&#539;ine c&#259; a lipsit
din mi&#537;carea pentru software liber:marketing-ul bun, unde &#8222;bun&#8221; înseamn&#259;
viabil în mediul de afaceri. Ini&#539;iativa open-source a dat multor oameni
exact ceea ce c&#259;utau&#8212;un vocabular care s&#259; le permit&#259; s&#259; vorbeasc&#259;
despre software-ul liber ca de o metodologie de dezvoltare &#537;i o strategie
de afaceri în loc de o cruciad&#259; moral&#259;.</p></div><p>Apari&#539;ia ini&#539;iativei open-source a schimbat mediul software-ului
liber. A formalizat o dihotomie care era de mult&#259; vreme nenumit&#259; &#537;i
astfel a for&#539;at mi&#537;carea s&#259; accepte faptul c&#259; ea are atât politici
interne cât &#537;i externe. Efectul în ziua de ast&#259;zi este c&#259; amândou&#259; taberele
trebuie s&#259; g&#259;seasc&#259; un teren comun, de vreme ce majoritatea proiectelor
includ programatori veni&#539;i din ambele tabere &#537;i participan&#539;i care nu
apar&#539;in clar niciunei categorii. Asta nu înseamn&#259; c&#259; oamenii nu vorbesc
niciodat&#259; de motiva&#539;ia moral&#259;&#8212;de exemplu, de multe ori sunt aduse
în discu&#539;ie lipsuri din tradi&#539;ionala &#8222;etic&#259; a hacker-ului&#8221;. Dar rareori
un dezvoltator de software liber/cu surse deschise va provoca motiva&#539;iile
de baz&#259; ale altor participan&#539;i la un proiect. Contribu&#539;ia e mai important&#259;
decât contribuitorul. Dac&#259; o persoan&#259; scrie cod bun, nu îi întrebi dac&#259;
o fac din motiva&#539;ie moral&#259; sau pentru c&#259; pentru asta i-a pl&#259;tit angajatorul
sau pentru c&#259; î&#537;i construiesc un curriculum vitae sau pentru alte motive.
Le evaluezi contribu&#539;ia în termeni tehnici &#537;i le r&#259;spunzi tot în termeni
tehnici. Chiar &#537;i organiza&#539;iile politice în mod explicit, cum ar fi 
proiectul Debian, al c&#259;rui scop e de a oferi un mediu de lucru 100%
liber (cu sensul de &#8222;liber ca &#537;i în libertate&#8221;) sunt destul de relaxate
când vine vorba de integrarea cu cod non-liber &#537;i colaborarea cu 
programatori care nu împ&#259;rt&#259;&#537;esc întocmai acest scop.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp4602528" href="#idp4602528" class="para">2</a>] </sup>SourceForge.net, un site cunoscut de g&#259;zduire, înregistrase
79225 de proiecte pân&#259; la mijlocul lunii aprilie 2004. Desigur c&#259; num&#259;rul
acesta nu se apropie de num&#259;rul total de proiecte existente pe Internet;
reprezint&#259; doar num&#259;rul celor care au ales s&#259; utilizeze SourceForge.
</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4695392" href="#idp4695392" class="para">3</a>] </sup>Stallman folose&#537;te cuvântul &#8222;hacker&#8221; pentru a se referi la &#8222;cineva
c&#259;ruia îi place s&#259; programeze &#537;i s&#259; fac&#259; lucrul acesta într-un mod 
inteligent&#8221; &#537;i nu în sensul modern de &#8222;persoan&#259; care compromite
securitatea unui computer&#8221;.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4705104" href="#idp4705104" class="para">4</a>] </sup>vine de la &#8222;GNU is not Unix&#8221; &#8212; GNU nu 
este Unix&#8212; &#537;i GNU în extensia aceasta vine de la... acela&#537;i lucru.
</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4711696" href="#idp4711696" class="para">5</a>] </sup>Din punct de vedere tehnic, Linux nu a fost primul. Un
sistem de operare gratuit pentru computere compatibile cu sistemul IBM,
numit 386BSD, a ap&#259;rut cu pu&#539;in timp înainte de Linux. Totu&#537;i, era mult
mai greu de pornit 386BSD. Linux a avut un asemenea succes nu doar pentru
c&#259; era gratuit ci &#537;i pentru c&#259; avea o &#537;ans&#259; bun&#259; de a reu&#537;i s&#259; porneasc&#259;
atunci când îl instalai.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4721104" href="#idp4721104" class="para">6</a>] </sup>Era preferat apelativul de "X Window System", dar, în
practic&#259;, oamenii îi spuneau doar "X Windows" pentru c&#259; trei cuvinte
erau prea multe.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4738320" href="#idp4738320" class="para">7</a>] </sup>se poate cere o tax&#259; pentru copii
de software liber dar, cum nu se poate impune celui care îl ia s&#259; nu
îl dea mai departe f&#259;r&#259; cost, pre&#539;ul scade la zero imediat.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4740048" href="#idp4740048" class="para">8</a>] </sup>Codul surs&#259; al aplica&#539;iei
Netscape Navigator <span class="emphasis"><em>a fost</em></span>, în cele din urm&#259;, eliberat
sub o licen&#539;&#259; open-source în 1998 &#537;i a devenit funda&#539;ia pentru 
browser-ul web Mozilla. Vezi <a class="ulink" href="http://www.mozilla.org/" target="_top">http://www.mozilla.org/</a>.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4753424" href="#idp4753424" class="para">9</a>] </sup>OSI se g&#259;se&#537;te pe Internet la adresa <a class="ulink" href="http://www.opensource.org/" target="_top">http://www.opensource.org/</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="disclaimer.html">Înapoi</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="today.html">Înainte</a></td></tr><tr><td width="40%" align="left" valign="top">Preciz&#259;ri (limitare a responsabilit&#259;&#539;ii) </td><td width="20%" align="center"><a accesskey="h" href="index.html">Acas&#259;</a></td><td width="40%" align="right" valign="top"> Situa&#539;ia ast&#259;zi</td></tr></table></div></body></html>
