<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Prefa&#539;&#259;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producerea de software open-source"><link rel="up" href="index.html" title="Producerea de software open-source"><link rel="prev" href="index.html" title="Producerea de software open-source"><link rel="next" href="audience.html" title="Cine ar trebui s&#259; citeasc&#259; aceast&#259; carte?"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Prefa&#539;&#259;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Înapoi</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="audience.html">Înainte</a></td></tr></table><hr></div><div class="preface" title="Prefa&#539;&#259;"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>Prefa&#539;&#259;</h2></div></div></div><div class="toc"><p><b>Cuprins</b></p><dl><dt><span class="sect1"><a href="preface.html#why">De ce a fost scris&#259; aceast&#259; carte?</a></span></dt><dt><span class="sect1"><a href="audience.html">Cine ar trebui s&#259; citeasc&#259; aceast&#259; carte?</a></span></dt><dt><span class="sect1"><a href="sources.html">Surse</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">Mul&#539;umiri</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">Preciz&#259;ri (limitare a responsabilit&#259;&#539;ii)</a></span></dt></dl></div><div class="sect1" title="De ce a fost scris&#259; aceast&#259; carte?"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>De ce a fost scris&#259; aceast&#259; carte?</h2></div></div></div><p>La petreceri, oamenii nu mai r&#259;mân pierdu&#539;i când le spun c&#259; eu
scriu software gratuit. Ei ma întreab&#259; "A, da, open-source&#8212;ca &#537;i Linux?"
Eu dau din cap în semn de aprobare. "Da, exact! Cu asta m&#259; ocup."
E pl&#259;cut s&#259; nu mai lucrezi într-un domeniu complet necunoscut.
În trecut, urm&#259;toarea întrebare era destul de previzibil&#259;: "Cum faci
bani f&#259;când asta?" Pentru a r&#259;spunde, a&#537; fi rezumat economia din spatele
mi&#537;c&#259;rii open-source: c&#259; exist&#259; organiza&#539;ii care sunt interesate de 
existen&#539;a anumitor aplica&#539;ii dar care nu au nevoie s&#259; vând&#259; copii 
ale acestora ci doar s&#259; se asigure ca software-ul este disponibil &#537;i
între&#539;inut, ca o unealt&#259; &#537;i nu ca un bun.</p><p>Cu toate acestea, în ultima vreme urm&#259;toarea întrebarea nu a mai
fost întotdeauna despre bani. Afacerile bazate pe open-source
<sup>[<a name="idp2914848" href="#ftn.idp2914848" class="footnote">1</a>]</sup> nu mai 
reprezint&#259; un asemenea mister &#537;i majoritatea non-programatorilor
în&#539;eleg&#8212;sau cel pu&#539;in nu sunt surprin&#537;i&#8212;c&#259; exist&#259; oameni
care sunt angaja&#539;i în acest domeniu cu norma întreag&#259;.  În schimb, 
întrebarea pe care o aud din ce în ce mai des este"<span class="emphasis"><em>Cum func&#539;ioneaz&#259; asta?</em></span>"</p><p>Nu aveam un r&#259;spuns satisf&#259;c&#259;tor preg&#259;tit &#537;i, cu cât încercam
mai greu s&#259; formulez unul, cu atât realizam mai bine ce tem&#259; complicat&#259; este.
Conducerea unui proiect de software gratuit nu este întocmai ca &#537;i conducerea
unei afaceri (imagina&#539;i-v&#259; s&#259; fi&#539;i nevoi&#539;i s&#259; negocia&#539;i în mod constant
cu un grup de voluntari pe care, în marea lor majoritate, nu i-a&#539;i
întâlnit niciodat&#259;. Din diferite motive nu seam&#259;n&#259; perfect cu conducerea
unei organiza&#539;ii non-profit &#537;i nici cu un guvern. Are unele puncte
similare tuturor acestora dar am ajuns încet la concluzia c&#259; software-ul
gratuit este <span class="foreignphrase"><em class="foreignphrase">sui
generis</em></span>.  Exist&#259; multe lucruri cu care poate fi comparat&#259;
dar niciunul cu care s&#259; fie egal&#259;. Pân&#259; &#537;i presupunerea c&#259; proiectele de 
software gratuit pot fi conduse este dus&#259; la extrem. Un proiect de software
gratuit poate fi <span class="emphasis"><em>demarat</em></span>,
&#537;i poate fi influen&#539;at chiar puternic de c&#259;tre p&#259;r&#539;ile interesate.
Dar bunurile lui nu pot deveni ale unui singur proprietar &#537;i, atâta vreme cât
exist&#259; oameni undeva &#8212;oriunde&#8212;care s&#259; fie interesa&#539;i de 
continuarea lui, nu poate fi terminat în mod unilateral.  Toat&#259; lumea are 
putere infinit&#259;; toat&#259; lumea este lipsit&#259; de putere.  Dinamica acestui fenomen
e interesant&#259;.</p><p>De aceea am vrut s&#259; scriu aceast&#259; carte.  Proiectele de software gratuit
au evoluat într-o cultur&#259; distinct&#259;, un etos în care libertatea de a face
aplica&#539;ia s&#259; fac&#259; orice reprezint&#259; canonul principal, &#537;i totu&#537;i rezultatul
acestei libert&#259;&#539;i nu este o împr&#259;&#537;tiere a indivizilor în care fiecare
s&#259; mearg&#259; în direc&#539;ia lui proprie cu codul ci colaborarea entuziast&#259;.
Într-adev&#259;r, competen&#539;a în cooperare este una dintre cele mai valoroase
abilit&#259;&#539;i în software-ul gratuit. Conducerea unui astfel de proiect 
înseamn&#259; angajarea într-o cooperare hipertrofiat&#259; unde nu numai abilitatea
de a lucra cu ceilal&#539;ii dar &#537;i abilitatea de a g&#259;si noi modalit&#259;&#539;i de a lucra
împreun&#259; pot aduce beneficii tangibile aplica&#539;iei. Aceast&#259; carte încearc&#259; s&#259;
descrie tehnicile prin care se poate realiza acest lucru. Nu este complet&#259; 
dar reprezint&#259; cel pu&#539;in un început în acest sens.</p><p>Software-ul gratuit de calitate reprezint&#259; el însu&#537;i un &#539;el valoros &#537;i 
sper ca cititorii care caut&#259; în aceast&#259; carte modalit&#259;&#539;i prin care s&#259;-l
ating&#259; s&#259; fie satisf&#259;cu&#539;i de ce vor g&#259;si. Dincolo de acest scop sper &#537;i s&#259; 
transmit o parte din pura pl&#259;cere pe care o ai când lucrezi cu o echip&#259;
motivat&#259; de dezvoltatori open-source &#537;i din minunata interac&#539;iune direct&#259; 
cu utilizatorii pe care mi&#537;carea open-source o încurajeaz&#259;. Participarea
într-un proiect open-source de succes este <span class="emphasis"><em>distractiv&#259;</em></span>
&#537;i, în cele din urm&#259;, asta face ca sistemul s&#259; mearg&#259; înainte.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp2914848" href="#idp2914848" class="para">1</a>] </sup>Termenii &#8221;open-source&#8221; &#537;i &#8221;gratuit&#8221; sunt, în esen&#539;&#259;,
sinonime în acest context; ei sunt discuta&#539;i mai mult în  
<a class="xref" href="introduction.html#free-vs-open-source" title='"Gratuit" Versus "Surs&#259; deschis&#259;"'>&#8222;"Gratuit" Versus "Surs&#259; deschis&#259;"&#8221;</a><span> în
<a class="xref" href="introduction.html" title="Cap. 1. Introducere">Cap. 1, <i>Introducere</i></a></span>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Înapoi</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="audience.html">Înainte</a></td></tr><tr><td width="40%" align="left" valign="top">Producerea de software open-source </td><td width="20%" align="center"><a accesskey="h" href="index.html">Acas&#259;</a></td><td width="40%" align="right" valign="top"> Cine ar trebui s&#259; citeasc&#259; aceast&#259; carte?</td></tr></table></div></body></html>
