<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Situa&#539;ia ast&#259;zi</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producerea de software open-source"><link rel="up" href="introduction.html" title="Cap. 1. Introducere"><link rel="prev" href="introduction.html" title="Cap. 1. Introducere"><link rel="next" href="getting-started.html" title="Cap. 2. Începutul"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Situa&#539;ia ast&#259;zi</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="introduction.html">Înapoi</a> </td><th width="60%" align="center">Cap. 1. Introducere</th><td width="20%" align="right"> <a accesskey="n" href="getting-started.html">Înainte</a></td></tr></table><hr></div><div class="sect1" title="Situa&#539;ia ast&#259;zi"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="today"></a>Situa&#539;ia ast&#259;zi</h2></div></div></div><p>Când conduci un proiect de software liber, nu trebuie s&#259; discu&#539;i
probleme filosofice atât de dificile zilnic. Porgramatorii nu vor insista
ca toat&#259; lumea care particip&#259; la proiect s&#259; fie de-acord cu modul în
care v&#259;d ei lucrurile (cei care insist&#259; descoper&#259; repede c&#259; nu pot
lucra la niciun proiect). Dar trebuie s&#259; fii con&#537;tient de diferen&#539;a dintre
&#8222;liber&#8221; &#537;i &#8222;cu surse deschise&#8221;, în special pentru a evita s&#259; spui lucruri
care ar putea fi potrivnice unor participan&#539;i dar &#537;i pentru c&#259; în&#539;elegerea
motiva&#539;iilor dezvoltatorilor este cel mai bun mod&#8212;dac&#259; nu chiar
<span class="emphasis"><em>singurul</em></span>
mod&#8212;de a conduce un proiect.</p><p>Software-ul liber este o cultur&#259; proprie. Pentru a te integra
cu succes în ea, trebuie s&#259; în&#539;elegi de ce oamenii au ales s&#259; fac&#259; parte
din ea în primul rând. Tehnicile coercitive nu vor func&#539;iona. Dac&#259;
oamenii sunt neferici&#539;i într-un proiect, vor trece imediat la altul.
Software-ul liber e remarcabil chiar &#537;i între comunit&#259;&#539;ile de voluntari
pentru u&#537;urin&#539;a de a investi. Majoritatea persoanelor implicate nu s-au
întâlnit niciodat&#259; cu celelalte persoane fa&#539;&#259; în fa&#539;&#259; &#537;i pur &#537;i simplu
doneaz&#259; buc&#259;&#539;i din timpul lor atunci când au chef. Circuitele normale
prin care oamenii se leag&#259; unii de al&#539;ii &#537;i creeaz&#259; grupuri statornice
sunt reduse la un canal minuscul: cuvântul scris, transmis prin fire de 
curent electric. Din acest motiv, poate dura ceva vreme pân&#259; se creeaz&#259;
un grup strâns &#537;i dedicat. Invers, e foarte u&#537;or pentru ca un proiect
s&#259; piard&#259; un poten&#539;ial voluntar în primele cinci minute de f&#259;cut
cuno&#537;tin&#539;&#259;. Dac&#259; un proiect nu las&#259; o prim&#259; impresie bun&#259;, nou-veni&#539;ii
rareori îi dau o a doua &#537;ans&#259;.</p><p>Caracterul efemer, sau <span class="emphasis"><em>poten&#539;iala</em></span>
efemeritate a rela&#539;iilor este, poate, cea mai dificil&#259; problem&#259; aflat&#259;
în calea unui nou proiect. Ce îi va convinge pe to&#539;i ace&#537;ti oameni
s&#259; stea împreun&#259; suficient de mult timp încât s&#259; produc&#259; un lucru util?
R&#259;spunsul la aceast&#259; întrebare este destul de complex încât s&#259; ocupe restul
acestei c&#259;r&#539;i dar, dac&#259; ar trebui s&#259; fie exprimat într-o singur&#259; 
propozi&#539;ie, ea ar fi aceasta:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>Oamenii trebuie s&#259; simt&#259; c&#259; leg&#259;tura lor cu un 
      proiect &#537;i influen&#539;a asupra acestuia este direct propor&#539;ional&#259; cu
      contribu&#539;ia lor.</em></span></p></blockquote></div><p>Niciun grup de dezvoltatori, sau de poten&#539;iali dezvoltatori, nu ar 
trebui s&#259; se simt&#259; ignorat sau discriminat din motive non-tehnice. În mod
clar, proiectele cu sponsorizare corporatist&#259; &#537;i/sau dezvoltatori 
salaria&#539;i trebuie s&#259; aib&#259; foarte mare grij&#259; în acest sens, dup&#259; cum se
discut&#259; în detaliu aici: <a class="xref" href="money.html" title="Cap. 5. Money">Cap. 5, <i>Money</i></a>. Desigur, asta nu
înseamn&#259; c&#259;, dac&#259; nu exist&#259; finan&#539;are corporatist&#259;, nu exist&#259; niciun motiv
de îngrijorare. Banii reprezint&#259; doar unul dintre mul&#539;ii factori care pot
afecta succesul unui proiect. Exist&#259; &#537;i întreb&#259;ri legate de limbajul
care va fi folosit, de licen&#539;&#259;, procesele de dezvoltare, ce fel de 
infrastructur&#259; se pune la punct, cum se face publicitate începerii 
proiectului &#537;i multe altele. Cum se începe un proiect cu dreptul înainte
se dezbate în <a class="link" href="getting-started.html" title="Cap. 2. Începutul">capitolul urm&#259;tor
</a>.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="introduction.html">Înapoi</a> </td><td width="20%" align="center"><a accesskey="u" href="introduction.html">Sus</a></td><td width="40%" align="right"> <a accesskey="n" href="getting-started.html">Înainte</a></td></tr><tr><td width="40%" align="left" valign="top">Cap. 1. Introducere </td><td width="20%" align="center"><a accesskey="h" href="index.html">Acas&#259;</a></td><td width="40%" align="right" valign="top"> Cap. 2. Începutul</td></tr></table></div></body></html>
