<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="preface.html" title="Preface"><link rel="prev" href="preface.html" title="Preface"><link rel="next" href="sources.html" title="&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="preface.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><th width="60%" align="center">Preface</th><td width="20%" align="left"> <a accesskey="n" href="sources.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr></table><hr></div><div class="sect1" title="&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="audience"></a>&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;</h2></div></div></div><p>&#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1605;&#1608;&#1580;&#1607; &#1575;&#1604;&#1609; &#1575;&#1604;&#1605;&#1591;&#1608;&#1585;&#1610;&#1606; &#1608; &#1575;&#1604;&#1605;&#1583;&#1585;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1582;&#1591;&#1591;&#1608;&#1606; &#1604;&#1576;&#1583;&#1569; &#1605;&#1588;&#1585;&#1608;&#1593; &#1605;&#1601;&#1578;&#1608;&#1581;
 &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;&#1548; &#1571;&#1608; &#1575;&#1604;&#1584;&#1610;&#1606; &#1576;&#1583;&#1571;&#1608; &#1576;&#1584;&#1604;&#1603; &#1608; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606; &#1605;&#1593;&#1585;&#1601;&#1577; &#1605;&#1575;&#1584;&#1575; &#1610;&#1580;&#1576; &#1601;&#1593;&#1604;&#1607; &#1575;&#1604;&#1570;&#1606;. &#1603;&#1605;&#1575; &#1571;&#1606; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;
 &#1605;&#1601;&#1610;&#1583; &#1604;&#1604;&#1584;&#1610;&#1606; &#1610;&#1585;&#1594;&#1576;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1603;&#1577; &#1601;&#1610; &#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; &#1608; &#1604;&#1610;&#1587;&#1578; &#1604;&#1583;&#1610;&#1607;&#1605;
 &#1582;&#1576;&#1585;&#1577; &#1587;&#1575;&#1576;&#1602;&#1577; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1580;&#1575;&#1604;.</p><p>&#1604;&#1575; &#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1602;&#1575;&#1585;&#1574; &#1605;&#1576;&#1585;&#1605;&#1580;&#1575;&#1548; &#1604;&#1603;&#1606; &#1610;&#1601;&#1590;&#1604; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1593;&#1604;&#1609; &#1593;&#1604;&#1605; &#1576;&#1575;&#1604;&#1605;&#1601;&#1575;&#1607;&#1610;&#1605; 
&#1575;&#1604;&#1571;&#1587;&#1575;&#1587;&#1610;&#1577; &#1604;&#1607;&#1606;&#1583;&#1587;&#1577; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1601;&#1585;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;&#1610;&#1577;&#1548; &#1575;&#1604;&#1605;&#1578;&#1585;&#1580;&#1605; &#1608; 
<span style="color: red">&lt;todo&gt;patches&lt;/todo&gt;</span>.</p><p>&#1604;&#1575; &#1578;&#1588;&#1578;&#1585;&#1591; &#1582;&#1576;&#1585;&#1577; &#1587;&#1575;&#1576;&#1602;&#1577; &#1601;&#1610; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;&#1548; &#1587;&#1608;&#1575;&#1569; &#1603;&#1606;&#1578; &#1605;&#1587;&#1578;&#1582;&#1583;&#1605;&#1575; &#1571;&#1608; 
&#1605;&#1591;&#1608;&#1585;&#1575;. &#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1604;&#1584;&#1610;&#1606; &#1593;&#1605;&#1604;&#1608;&#1575; &#1601;&#1610; &#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1576;&#1585;&#1575;&#1605;&#1580; &#1581;&#1585;&#1577; &#1587;&#1575;&#1576;&#1602;&#1575;&#1548; &#1602;&#1583; &#1610;&#1580;&#1583;&#1608;&#1606; &#1576;&#1593;&#1590; 
&#1575;&#1604;&#1601;&#1589;&#1608;&#1604; &#1605;&#1571;&#1604;&#1608;&#1601;&#1577; &#1608; &#1602;&#1583; &#1610;&#1585;&#1594;&#1576;&#1608;&#1606; &#1601;&#1610; &#1578;&#1580;&#1575;&#1607;&#1604;&#1607;&#1575;. &#1608; &#1576;&#1605;&#1575; &#1571;&#1606; &#1575;&#1581;&#1578;&#1605;&#1575;&#1604;&#1575;&#1578; &#1582;&#1576;&#1585;&#1577; &#1575;&#1604;&#1602;&#1585;&#1575;&#1569; &#1588;&#1610;&#1574; &#1604;&#1575; 
&#1610;&#1605;&#1603;&#1606; &#1581;&#1589;&#1585;&#1607; &#1601;&#1602;&#1583; &#1575;&#1580;&#1578;&#1607;&#1583;&#1578; &#1604;&#1580;&#1593;&#1604; &#1571;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1601;&#1589;&#1608;&#1604; &#1608;&#1575;&#1590;&#1581;&#1577; &#1608; &#1584;&#1603;&#1585; &#1605;&#1578;&#1609; &#1610;&#1605;&#1603;&#1606; &#1578;&#1580;&#1575;&#1607;&#1604; 
&#1575;&#1604;&#1601;&#1589;&#1604; &#1604;&#1604;&#1584;&#1610;&#1606; &#1604;&#1583;&#1610;&#1607;&#1605; &#1593;&#1604;&#1605; &#1587;&#1575;&#1576;&#1602; &#1576;&#1605;&#1581;&#1578;&#1608;&#1575;&#1607;.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="preface.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#1571;&#1593;&#1604;&#1609;</a></td><td width="40%" align="left"> <a accesskey="n" href="sources.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr><tr><td width="40%" align="right" valign="top">Preface </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1575;&#1604;&#1576;&#1583;&#1575;&#1610;&#1577;</a></td><td width="40%" align="left" valign="top"> &#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;</td></tr></table></div></body></html>
