<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Preface</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="index.html" title="Producing Open Source Software"><link rel="next" href="audience.html" title="&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Preface</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="index.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><th width="60%" align="center"> </th><td width="20%" align="left"> <a accesskey="n" href="audience.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr></table><hr></div><div class="preface" title="Preface"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>Preface</h2></div></div></div><div class="toc"><p><b>&#1602;&#1575;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1581;&#1578;&#1608;&#1610;&#1575;&#1578;</b></p><dl><dt><span class="sect1"><a href="preface.html#why">&#1578;&#1605;&#1607;&#1610;&#1583;</a></span></dt><dt><span class="sect1"><a href="audience.html">&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;</a></span></dt><dt><span class="sect1"><a href="sources.html">&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">Acknowledgments</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">Disclaimer</a></span></dt></dl></div><div class="sect1" title="&#1578;&#1605;&#1607;&#1610;&#1583;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>&#1578;&#1605;&#1607;&#1610;&#1583;</h2></div></div></div><p>
&#1604;&#1605; &#1610;&#1593;&#1583; &#1575;&#1604;&#1606;&#1575;&#1587; &#1594;&#1610;&#1585; &#1605;&#1576;&#1575;&#1604;&#1610;&#1606; &#1593;&#1606;&#1583;&#1605;&#1575; &#1571;&#1582;&#1576;&#1585;&#1607;&#1605; &#1571;&#1606;&#1610; &#1571;&#1603;&#1578;&#1576; &#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;&#1548; &#1576;&#1604; &#1610;&#1578;&#1587;&#1575;&#1574;&#1604;&#1608;&#1606; &#1576;&#1575;&#1607;&#1578;&#1605;&#1575;&#1605; "&#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; &#1605;&#1579;&#1604; &#1606;&#1592;&#1575;&#1605; Linux&#1567;". &#1571;&#1608;&#1605;&#1574; &#1576;&#1575;&#1604;&#1575;&#1610;&#1580;&#1575;&#1576; &#1608; &#1571;&#1602;&#1608;&#1604; "&#1606;&#1593;&#1605;! &#1607;&#1584;&#1575; &#1605;&#1575;
&#1571;&#1601;&#1593;&#1604;&#1607; &#1576;&#1575;&#1604;&#1590;&#1576;&#1591;". &#1573;&#1606;&#1607; &#1588;&#1610;&#1574; &#1580;&#1605;&#1610;&#1604; &#1571;&#1606; &#1604;&#1575; &#1571;&#1603;&#1608;&#1606; &#1605;&#1607;&#1605;&#1588;&#1575; &#1576;&#1593;&#1583; &#1575;&#1604;&#1570;&#1606;. &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1590;&#1610; &#1603;&#1575;&#1606; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1578;&#1575;&#1604;&#1610; &#1575;&#1604;&#1605;&#1578;&#1608;&#1602;&#1593; &#1607;&#1608; "&#1603;&#1610;&#1601; &#1578;&#1580;&#1606;&#1610; &#1575;&#1604;&#1605;&#1575;&#1604; &#1576;&#1607;&#1584;&#1607; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602;&#1577;&#1567;"  &#1601;&#1603;&#1606;&#1578; &#1571;&#1580;&#1610;&#1576; &#1576;&#1578;&#1604;&#1582;&#1610;&#1589; &#1604;&#1587;&#1610;&#1575;&#1587;&#1577;
&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585; &#1575;&#1604;&#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1576;&#1571;&#1606; &#1605;&#1589;&#1604;&#1581;&#1577; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1606;&#1592;&#1605;&#1575;&#1578; &#1601;&#1610; &#1608;&#1580;&#1608;&#1583; &#1576;&#1593;&#1590; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1608;&#1604;&#1610;&#1587; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1576;&#1605;&#1602;&#1575;&#1576;&#1604; &#1605;&#1575;&#1583;&#1610;&#1548; &#1605;&#1575; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606;&#1607; &#1607;&#1608; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1578;&#1608;&#1601;&#1585;&#1577; &#1603;&#1571;&#1583;&#1608;&#1575;&#1578; &#1576;&#1583;&#1604; &#1587;&#1604;&#1593;.

</p><p>&#1604;&#1603;&#1606; &#1605;&#1572;&#1582;&#1585;&#1575; &#1604;&#1605; &#1610;&#1593;&#1583; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1578;&#1575;&#1604;&#1610; &#1593;&#1606; &#1575;&#1604;&#1605;&#1575;&#1604; &#1594;&#1575;&#1604;&#1576;&#1575;.  &#1601;&#1575;&#1604;&#1608;&#1590;&#1593; &#1575;&#1604;&#1578;&#1580;&#1575;&#1585;&#1610; &#1604;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;<sup>[<a name="idp125088" href="#ftn.idp125088" class="footnote">1</a>]</sup> &#1604;&#1605; &#1610;&#1593;&#1583; &#1594;&#1575;&#1605;&#1590;&#1575;&#1548; &#1608; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1594;&#1610;&#1585; &#1575;&#1604;&#1605;&#1576;&#1585;&#1605;&#1580;&#1610;&#1606; &#1576;&#1575;&#1578;&#1608;&#1575; &#1610;&#1593;&#1604;&#1605;&#1608;&#1606; &#8212; &#1571;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1571;&#1602;&#1604; &#1604;&#1575; &#1610;&#1578;&#1601;&#1575;&#1580;&#1574;&#1608;&#1606; &#8212; &#1576;&#1571;&#1606; &#1579;&#1605;&#1577;
 &#1571;&#1606;&#1575;&#1587;&#1575; &#1610;&#1608;&#1592;&#1601;&#1608;&#1606; &#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1605;&#1604;.   &#1604;&#1603;&#1606; &#1576;&#1575;&#1578; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1607;&#1608; <span class="emphasis"><em>"&#1603;&#1610;&#1601; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1607;&#1584;&#1575;&#1567;"</em></span>
</p><p>&#1604;&#1605; &#1578;&#1603;&#1606; &#1604;&#1583;&#1610; &#1575;&#1580;&#1575;&#1576;&#1577; &#1588;&#1575;&#1601;&#1610;&#1577; &#1580;&#1575;&#1607;&#1586;&#1577; &#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604;&#1548; &#1608; &#1603;&#1604;&#1605;&#1575; &#1581;&#1575;&#1608;&#1604;&#1578; &#1580;&#1575;&#1607;&#1583;&#1575; &#1571;&#1606; &#1571;&#1580;&#1583; &#1575;&#1580;&#1575;&#1576;&#1577; &#1571;&#1583;&#1585;&#1603;&#1578; &#1603;&#1605; &#1607;&#1608; &#1575;&#1604;&#1605;&#1608;&#1590;&#1608;&#1593; &#1605;&#1593;&#1602;&#1583;. 
&#1575;&#1583;&#1575;&#1585;&#1577; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1581;&#1585;&#1577; &#1604;&#1610;&#1587; &#1605;&#1579;&#1604; &#1575;&#1604;&#1578;&#1580;&#1575;&#1585;&#1610;&#1577;(&#1578;&#1589;&#1608;&#1585; &#1603;&#1610;&#1601; &#1610;&#1605;&#1603;&#1606; &#1575;&#1604;&#1578;&#1601;&#1575;&#1608;&#1590; &#1576;&#1575;&#1587;&#1578;&#1605;&#1585;&#1575;&#1585; &#1593;&#1606; &#1591;&#1576;&#1610;&#1593;&#1577; &#1575;&#1604;&#1605;&#1606;&#1578;&#1580; &#1605;&#1593; &#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1578;&#1591;&#1608;&#1593;&#1610;&#1606; &#1571;&#1594;&#1604;&#1576;&#1607;&#1605; &#1604;&#1605; &#1578;&#1602;&#1575;&#1576;&#1604;&#1607;&#1605; &#1571;&#1576;&#1583;&#1575;!) &#1603;&#1605;&#1575; &#1571;&#1606;&#1607; &#1604;&#1610;&#1587; &#1605;&#1579;&#1604; &#1575;&#1583;&#1575;&#1585;&#1577; &#1605;&#1606;&#1592;&#1605;&#1577; &#1594;&#1610;&#1585; &#1585;&#1576;&#1581;&#1610;&#1577; &#1578;&#1602;&#1604;&#1610;&#1583;&#1610;&#1577;&#1548;
 &#1608; &#1604;&#1575; &#1581;&#1578;&#1609; &#1605;&#1579;&#1604; &#1575;&#1583;&#1575;&#1585;&#1577; &#1581;&#1603;&#1608;&#1605;&#1577;. 
&#1608; &#1578;&#1608;&#1589;&#1604;&#1578; &#1575;&#1604;&#1609; &#1582;&#1604;&#1575;&#1589;&#1577; &#1571;&#1606; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1581;&#1585;&#1577; &#1607;&#1610;<span class="foreignphrase"><em class="foreignphrase">&#1588;&#1610;&#1574; &#1601;&#1585;&#1610;&#1583; &#1605;&#1606; &#1606;&#1608;&#1593;&#1607;</em></span>. 
&#1578;&#1608;&#1580;&#1583; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1571;&#1588;&#1610;&#1575;&#1569; &#1575;&#1604;&#1578;&#1610; &#1578;&#1578;&#1588;&#1575;&#1576;&#1607; &#1605;&#1593;&#1607;&#1575; &#1604;&#1603;&#1606;&#1607;&#1575; &#1604;&#1575; &#1578;&#1578;&#1587;&#1575;&#1608;&#1609; &#1605;&#1593; &#1571;&#1610; &#1605;&#1606;&#1607;&#1575;. &#1576;&#1604; &#1581;&#1578;&#1609; &#1575;&#1604;&#1575;&#1601;&#1578;&#1585;&#1575;&#1590; &#1576;&#1571;&#1606; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1581;&#1585;&#1577; &#1610;&#1605;&#1603;&#1606; &#1575;&#1583;&#1575;&#1585;&#1578;&#1607;&#1575; &#1607;&#1608; &#1588;&#1610;&#1574; &#1605;&#1587;&#1578;&#1576;&#1593;&#1583;.
 &#1601;&#1610;&#1605;&#1603;&#1606; <span class="emphasis"><em>&#1575;&#1604;&#1576;&#1583;&#1569;</em></span> &#1576;&#1605;&#1588;&#1585;&#1608;&#1593; &#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; &#1608; &#1610;&#1605;&#1603;&#1606; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1603;&#1577; &#1601;&#1610;&#1607; &#1576;&#1588;&#1603;&#1604; &#1603;&#1576;&#1610;&#1585; &#1605;&#1606; &#1571;&#1591;&#1585;&#1575;&#1601; &#1571;&#1582;&#1585;&#1609;&#1548;
 &#1604;&#1603;&#1606; &#1605;&#1604;&#1603;&#1610;&#1578;&#1607; &#1604;&#1575; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1604;&#1588;&#1582;&#1589; &#1608;&#1575;&#1581;&#1583;&#1548;&#1608; &#1576;&#1605;&#1575; &#1571;&#1606; &#1579;&#1605;&#1577; &#1571;&#1606;&#1575;&#1587;&#1575;&#8212;&#1601;&#1610; &#1571;&#1610; &#1605;&#1603;&#1575;&#1606;&#8212; 
 &#1605;&#1607;&#1578;&#1605;&#1610;&#1606; &#1576;&#1605;&#1608;&#1575;&#1589;&#1604;&#1577; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1601;&#1604;&#1575; &#1610;&#1605;&#1603;&#1606; &#1575;&#1610;&#1602;&#1575;&#1601;&#1607; &#1576;&#1602;&#1585;&#1575;&#1585; &#1591;&#1585;&#1601; &#1608;&#1575;&#1581;&#1583;.  &#1603;&#1604; &#1608;&#1575;&#1581;&#1583; &#1604;&#1583;&#1610;&#1607; &#1575;&#1604;&#1581;&#1602; &#1575;&#1604;&#1605;&#1591;&#1604;&#1602; &#1601;&#1610; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1603;&#1605;&#1575; &#1571;&#1606; &#1603;&#1604; &#1608;&#1575;&#1581;&#1583; &#1604;&#1610;&#1587; &#1604;&#1583;&#1610;&#1607; &#1571;&#1610; &#1581;&#1602;. &#1608; &#1607;&#1584;&#1607; &#1581;&#1610;&#1608;&#1610;&#1577; &#1605;&#1579;&#1610;&#1585;&#1577; &#1604;&#1604;&#1575;&#1607;&#1578;&#1605;&#1575;&#1605;.</p><p>&#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1576;&#1576; &#1571;&#1585;&#1583;&#1578; &#1578;&#1571;&#1604;&#1610;&#1601; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;. &#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1581;&#1585;&#1577; &#1591;&#1608;&#1585;&#1578; &#1579;&#1602;&#1575;&#1601;&#1577; &#1582;&#1575;&#1589;&#1577; &#1576;&#1607;&#1575;&#1548; &#1605;&#1576;&#1583;&#1574;&#1607;&#1575; &#1575;&#1604;&#1585;&#1574;&#1610;&#1587;&#1610; 
&#1575;&#1604;&#1581;&#1585;&#1610;&#1577; &#1601;&#1610; &#1580;&#1593;&#1604; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1610;&#1601;&#1593;&#1604; &#1571;&#1610; &#1588;&#1610;&#1574; &#1571;&#1610; &#1588;&#1582;&#1589; &#1610;&#1585;&#1610;&#1583;&#1607;&#1548;&#1607;&#1584;&#1607; &#1575;&#1604;&#1581;&#1585;&#1610;&#1577; &#1604;&#1610;&#1587;&#1578; &#1604;&#1578;&#1588;&#1578;&#1610;&#1578; &#1575;&#1604;&#1593;&#1605;&#1604; &#1576;&#1571;&#1606; 
&#1610;&#1589;&#1576;&#1581; &#1604;&#1603;&#1604; &#1588;&#1582;&#1589; &#1606;&#1587;&#1582;&#1578;&#1607; &#1575;&#1604;&#1582;&#1575;&#1589;&#1577; &#1605;&#1606; &#1575;&#1604;&#1603;&#1608;&#1583;&#1548; &#1576;&#1604; &#1578;&#1593;&#1575;&#1608;&#1606; &#1610;&#1591;&#1594;&#1609; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1605;&#1575;&#1587;.
&#1601;&#1610; &#1575;&#1604;&#1608;&#1575;&#1602;&#1593;&#1548; &#1575;&#1604;&#1582;&#1576;&#1585;&#1577; &#1601;&#1610; &#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606; &#1575;&#1604;&#1605;&#1588;&#1578;&#1585;&#1603; &#1607;&#1610; &#1608;&#1575;&#1581;&#1583;&#1577; &#1605;&#1606; &#1571;&#1607;&#1605; &#1605;&#1603;&#1578;&#1587;&#1576;&#1575;&#1578; &#1575;&#1604;&#1593;&#1605;&#1604; &#1601;&#1610; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1581;&#1585;&#1577;.
<span style="color: red">&lt;todo&gt;To manage these projects is to engage
in a kind of hypertrophied cooperation, where one's ability not only
to work with others but to come up with new ways of working together
can result in tangible benefits to the software.  This book attempts
to describe the techniques by which this may be done.  It is by no
means complete, but it is at least a beginning.&lt;/todo&gt;</span></p><p>&#1589;&#1606;&#1593; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1581;&#1585; &#1580;&#1610;&#1583; &#1607;&#1608; &#1607;&#1583;&#1601; &#1606;&#1576;&#1610;&#1604; &#1601;&#1610; &#1581;&#1583; &#1584;&#1575;&#1578;&#1607;&#1548; &#1608; &#1571;&#1578;&#1605;&#1606;&#1609; &#1571;&#1606; &#1610;&#1580;&#1583; &#1575;&#1604;&#1602;&#1585;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606;
 &#1610;&#1576;&#1581;&#1579;&#1608;&#1606; &#1593;&#1606; &#1603;&#1610;&#1601;&#1610;&#1577; &#1578;&#1581;&#1602;&#1610;&#1602; &#1607;&#1584;&#1575; &#1575;&#1604;&#1607;&#1583;&#1601; &#1605;&#1585;&#1575;&#1583;&#1607;&#1605; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;. &#1603;&#1605;&#1575; &#1571;&#1578;&#1605;&#1606;&#1609; &#1571;&#1610;&#1590;&#1575; &#1571;&#1606; 
&#1571;&#1608;&#1589;&#1604; &#1575;&#1604;&#1575;&#1581;&#1587;&#1575;&#1587; &#1575;&#1604;&#1605;&#1605;&#1578;&#1593; &#1575;&#1604;&#1606;&#1575;&#1576;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1605;&#1604; &#1605;&#1593; &#1601;&#1585;&#1610;&#1602; &#1605;&#1606; &#1605;&#1591;&#1608;&#1585;&#1610; &#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585; &#1575;&#1604;&#1605;&#1601;&#1578;&#1608;&#1581;&#1577;
 &#1608; &#1605;&#1606; &#1575;&#1604;&#1578;&#1601;&#1575;&#1593;&#1604; &#1605;&#1593; &#1575;&#1604;&#1605;&#1587;&#1578;&#1582;&#1583;&#1605;&#1610;&#1606; &#1576;&#1575;&#1604;&#1591;&#1585;&#1610;&#1602;&#1577; &#1575;&#1604;&#1605;&#1576;&#1575;&#1588;&#1585;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1588;&#1580;&#1593;&#1607;&#1575; &#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585; 
&#1575;&#1604;&#1605;&#1601;&#1578;&#1608;&#1581;&#1577;. &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1603;&#1577; &#1601;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1581;&#1585; &#1606;&#1575;&#1580;&#1581; &#1607;&#1608; &#1571;&#1605;&#1585; <span class="emphasis"><em>&#1605;&#1605;&#1578;&#1593;</em></span>&#1548; &#1608; &#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1571;&#1587;&#1575;&#1587; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1575;&#1601;&#1592; &#1593;&#1604;&#1609; &#1575;&#1587;&#1578;&#1605;&#1585;&#1575;&#1585;&#1610;&#1577; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605;.</p></div><div class="footnotes"><br><hr width="100" align="right"><div class="footnote"><p><sup>[<a id="ftn.idp125088" href="#idp125088" class="para">1</a>] </sup>
&#1575;&#1604;&#1605;&#1589;&#1591;&#1604;&#1581;&#1610;&#1606; "&#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;" &#1608; "&#1581;&#1585;" &#1605;&#1578;&#1591;&#1575;&#1576;&#1602;&#1575;&#1606; &#1605;&#1606; &#1581;&#1610;&#1579; &#1575;&#1604;&#1605;&#1593;&#1606;&#1609; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1610;&#1575;&#1602;&#1548; &#1587;&#1571;&#1606;&#1602;&#1575;&#1588;&#1607;&#1605;&#1575; &#1576;&#1575;&#1604;&#1578;&#1601;&#1589;&#1610;&#1604; &#1601;&#1610; &#1601;&#1602;&#1585;&#1577;
<a class="xref" href="introduction.html#free-vs-open-source" title='"Free" Versus "Open Source"'>&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;"Free" Versus "Open Source"&#8221;</a><span> 
<a class="xref" href="introduction.html" title="&#1601;&#1589;&#1604; 1. Introduction">&#1601;&#1589;&#1604; 1, <i>Introduction</i></a></span>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="index.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><td width="20%" align="center"> </td><td width="40%" align="left"> <a accesskey="n" href="audience.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr><tr><td width="40%" align="right" valign="top">Producing Open Source Software </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1575;&#1604;&#1576;&#1583;&#1575;&#1610;&#1577;</a></td><td width="40%" align="left" valign="top"> &#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;</td></tr></table></div></body></html>
