<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="preface.html" title="Preface"><link rel="prev" href="audience.html" title="&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567;"><link rel="next" href="acknowledgments.html" title="Acknowledgments"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="audience.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><th width="60%" align="center">Preface</th><td width="20%" align="left"> <a accesskey="n" href="acknowledgments.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr></table><hr></div><div class="sect1" title="&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sources"></a>&#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585;</h2></div></div></div><p>&#1594;&#1575;&#1604;&#1576;&#1610;&#1577; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1605;&#1587;&#1578;&#1602;&#1575;&#1577; &#1605;&#1606; &#1593;&#1605;&#1604; &#1582;&#1605;&#1587; &#1587;&#1606;&#1608;&#1575;&#1578; &#1601;&#1610; &#1605;&#1588;&#1585;&#1608;&#1593; Subversion 
(<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>). Suversion &#1607;&#1608; &#1605;&#1588;&#1585;&#1608;&#1593; &#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; 
&#1604;&#1605;&#1585;&#1575;&#1602;&#1576;&#1577; &#1575;&#1589;&#1583;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1588;&#1601;&#1585;&#1577; (source version control) &#1605;&#1576;&#1585;&#1605;&#1580; 

&#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1585; &#1608; &#1610;&#1607;&#1583;&#1601; &#1575;&#1604;&#1609; &#1578;&#1593;&#1608;&#1610;&#1590; &#1606;&#1592;&#1575;&#1605; CVS &#1604;&#1605;&#1585;&#1575;&#1602;&#1576;&#1577; &#1575;&#1589;&#1583;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1601;&#1585;&#1577; &#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1593;&#1578;&#1576;&#1585; 
&#1575;&#1604;&#1582;&#1610;&#1575;&#1585; &#1575;&#1604;&#1605;&#1601;&#1590;&#1604; &#1604;&#1605;&#1580;&#1578;&#1605;&#1593; &#1575;&#1604;&#1605;&#1589;&#1575;&#1583;&#1585; &#1575;&#1604;&#1605;&#1601;&#1578;&#1608;&#1581;&#1577;. &#1576;&#1583;&#1571; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1601;&#1610; &#1575;&#1604;&#1588;&#1585;&#1603;&#1577; &#1575;&#1604;&#1578;&#1610; &#1571;&#1593;&#1605;&#1604; &#1601;&#1610;&#1607;&#1575; 
CollabNet (<a class="ulink" href="http://www.collab.net/" target="_top">http://www.collab.net/</a>)&#1548; &#1601;&#1610; &#1576;&#1583;&#1575;&#1610;&#1577; &#1587;&#1606;&#1577; 2000&#1548; 
&#1608; &#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1571;&#1606;&#1617; CollbaNet &#1601;&#1607;&#1605;&#1578; &#1580;&#1610;&#1583;&#1575; &#1605;&#1606; &#1575;&#1604;&#1576;&#1583;&#1575;&#1610;&#1577; &#1603;&#1610;&#1601; &#1578;&#1583;&#1610;&#1585;&#1607; &#1593;&#1604;&#1609; &#1571;&#1587;&#1575;&#1587; 
&#1605;&#1580;&#1607;&#1608;&#1583; &#1578;&#1593;&#1575;&#1608;&#1606;&#1610; &#1605;&#1588;&#1578;&#1585;&#1603;.
 &#1581;&#1589;&#1604;&#1606;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1605;&#1591;&#1608;&#1585;&#1610;&#1606; &#1575;&#1604;&#1605;&#1578;&#1591;&#1608;&#1593;&#1610;&#1606; &#1605;&#1606; &#1575;&#1604;&#1576;&#1583;&#1575;&#1610;&#1577;; &#1575;&#1604;&#1610;&#1608;&#1605; &#1610;&#1608;&#1580;&#1583; 50 &#1608; &#1602;&#1604;&#1610;&#1604; &#1605;&#1606; &#1575;&#1604;&#1605;&#1591;&#1608;&#1585;&#1610;&#1606;
 &#1601;&#1610; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593;&#1548; &#1602;&#1604;&#1577; &#1605;&#1606;&#1607;&#1605; &#1610;&#1593;&#1605;&#1604;&#1608;&#1606; &#1601;&#1610; CollbaNet.
</p><p>Subversion &#1607;&#1608; &#1605;&#1579;&#1575;&#1604; &#1580;&#1610;&#1583; &#1605;&#1606; &#1603;&#1604; &#1575;&#1604;&#1606;&#1608;&#1575;&#1581;&#1610; &#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585;&#1548; &#1575;&#1604;&#1609; &#1583;&#1585;&#1580;&#1577; &#1571;&#1606;&#1610; 
&#1575;&#1593;&#1578;&#1605;&#1583;&#1578; &#1593;&#1604;&#1610;&#1607; &#1601;&#1610; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1571;&#1603;&#1579;&#1585; &#1605;&#1605;&#1575; &#1603;&#1606;&#1578; &#1571;&#1578;&#1608;&#1602;&#1593;.
&#1608; &#1607;&#1584;&#1575; &#1610;&#1593;&#1608;&#1583; &#1601;&#1610; &#1580;&#1586;&#1569; &#1605;&#1606;&#1607; &#1575;&#1604;&#1609; &#1605;&#1587;&#1571;&#1604;&#1577; &#1578;&#1608;&#1575;&#1601;&#1602;&#1610;&#1577;: &#1601;&#1603;&#1604;&#1605;&#1575; &#1575;&#1581;&#1578;&#1580;&#1578; &#1575;&#1604;&#1609; &#1590;&#1585;&#1576; &#1605;&#1579;&#1575;&#1604; &#1604;&#1581;&#1575;&#1604;&#1577; 
&#1605;&#1593;&#1610;&#1606;&#1577;&#1548; &#1610;&#1571;&#1578;&#1610; &#1575;&#1604;&#1609; &#1584;&#1607;&#1606;&#1610; &#1605;&#1576;&#1575;&#1588;&#1585;&#1577; &#1605;&#1579;&#1575;&#1604; &#1605;&#1606; &#1605;&#1588;&#1585;&#1608;&#1593; Subversion&#1548; &#1604;&#1603;&#1606;&#1607;&#1575; &#1571;&#1610;&#1590;&#1575; &#1605;&#1587;&#1571;&#1604;&#1577;
&#1575;&#1579;&#1576;&#1575;&#1578;&#1548; &#1601;&#1585;&#1594;&#1605; &#1571;&#1606; &#1605;&#1588;&#1578;&#1585;&#1603; &#1601;&#1610; &#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1576;&#1585;&#1575;&#1605;&#1580; &#1581;&#1585;&#1577; &#1571;&#1582;&#1585;&#1609; &#1576;&#1583;&#1585;&#1580;&#1575;&#1578; &#1605;&#1582;&#1578;&#1604;&#1601;&#1577;&#1548; &#1608; &#1571;&#1593;&#1585;&#1601; 
&#1571;&#1589;&#1583;&#1602;&#1575;&#1569; &#1605;&#1588;&#1578;&#1585;&#1603;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1593;&#1583;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609;&#1548; &#1575;&#1604;&#1575;&#1617; &#1571;&#1606;&#1607; &#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1578;&#1593;&#1604;&#1602; &#1575;&#1604;&#1571;&#1605;&#1585; 
&#1576;&#1575;&#1604;&#1578;&#1571;&#1604;&#1610;&#1601; &#1601;&#1610;&#1580;&#1576; &#1575;&#1604;&#1578;&#1579;&#1576;&#1578; &#1605;&#1606; &#1608;&#1575;&#1602;&#1593;&#1610;&#1577; &#1575;&#1604;&#1581;&#1602;&#1575;&#1574;&#1602; &#1575;&#1604;&#1605;&#1584;&#1603;&#1608;&#1585;&#1577;. &#1604;&#1605; &#1571;&#1585;&#1594;&#1576; &#1601;&#1610; &#1571;&#1606; &#1571;&#1603;&#1578;&#1576; &#1571;&#1605;&#1579;&#1604;&#1577;
&#1605;&#1606; &#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1571;&#1582;&#1585;&#1609; &#1576;&#1575;&#1604;&#1575;&#1593;&#1578;&#1605;&#1575;&#1583; &#1593;&#1604;&#1609; &#1605;&#1575; &#1571;&#1602;&#1585;&#1571;&#1607; &#1601;&#1610; &#1571;&#1585;&#1588;&#1610;&#1601; &#1602;&#1575;&#1574;&#1605;&#1578;&#1607;&#1605; &#1575;&#1604;&#1576;&#1585;&#1610;&#1583;&#1610;&#1577;. <span style="color: red">&lt;todo&gt;
If someone were to trythat with Subversion, I knew, she'd be right about 
half the time and wrong the other half. So when drawing inspiration or 
examples from a project with which I didn't have direct experience, I tried 
to first talk to an informant there, someone I could trust to explain what 
was really going on.&lt;/todo&gt;</span></p><p>&#1593;&#1605;&#1604;&#1578; &#1593;&#1604;&#1609; &#1606;&#1592;&#1575;&#1605; Subversion &#1591;&#1608;&#1575;&#1604; &#1575;&#1604;&#1582;&#1605;&#1587; &#1587;&#1606;&#1610;&#1606; &#1575;&#1604;&#1605;&#1575;&#1590;&#1610;&#1577;&#1548; &#1604;&#1603;&#1606; &#1575;&#1588;&#1578;&#1585;&#1603;&#1578; &#1601;&#1610; 12
&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1581;&#1585; &#1570;&#1582;&#1585;. &#1607;&#1584;&#1607; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1575;&#1604;&#1578;&#1610; &#1604;&#1607;&#1575; &#1578;&#1571;&#1579;&#1610;&#1585; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#1605;&#1588;&#1585;&#1608;&#1593; &#1605;&#1581;&#1585;&#1585; &#1606;&#1589;&#1608;&#1589; &#1573;&#1610;&#1605;&#1575;&#1603;&#1587; Emacs &#1604;&#1606;&#1592;&#1575;&#1605; GNU &#1601;&#1610; &#1605;&#1572;&#1587;&#1587;&#1577; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1581;&#1585;&#1577; 
Free Software Foundation&#1548; &#1581;&#1610;&#1579; &#1571;&#1602;&#1608;&#1605; &#1576;&#1589;&#1610;&#1575;&#1606;&#1577; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1580;&#1586;&#1575;&#1569; &#1575;&#1604;&#1589;&#1594;&#1610;&#1585;&#1577;.</p></li><li class="listitem"><p>&#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1575;&#1589;&#1583;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1586;&#1575;&#1605;&#1606;&#1577; Concurrent Versions System(CVS)&#1548; &#1593;&#1605;&#1604;&#1578; &#1601;&#1610;&#1607; &#1576;&#1588;&#1603;&#1604; 
&#1605;&#1603;&#1579;&#1601; &#1601;&#1610; &#1575;&#1604;&#1601;&#1578;&#1585;&#1577; 1994-1995 &#1605;&#1593; &#1580;&#1610;&#1605; &#1576;&#1604;&#1575;&#1606;&#1583;&#1610; Jim Blandy&#1548; &#1604;&#1603;&#1606; &#1575;&#1588;&#1578;&#1585;&#1575;&#1603;&#1610; &#1601;&#1610;&#1607; 
&#1605;&#1578;&#1602;&#1591;&#1593; &#1605;&#1606;&#1584; &#1584;&#1604;&#1603; &#1575;&#1604;&#1608;&#1602;&#1578;.</p></li><li class="listitem"><p>&#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601;&#1577; &#1576;&#1575;&#1587;&#1605; Apache Software Foundation&#1548; 
&#1582;&#1589;&#1608;&#1589;&#1575; Apach Portable Runtime(APR) &#1608; &#1582;&#1575;&#1583;&#1605; &#1571;&#1576;&#1575;&#1578;&#1588; Apache HTTP Server.</p></li><li class="listitem"><p>&#1581;&#1586;&#1605;&#1577; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1605;&#1603;&#1578;&#1576;&#1610;&#1577; OpenOffice.org&#1548; &#1605;&#1581;&#1585;&#1603; &#1602;&#1608;&#1575;&#1593;&#1583; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606;&#1575;&#1578; Berkeley &#1605;&#1606; &#1588;&#1585;&#1603;&#1577; 
Sleepycat&#1548; &#1606;&#1592;&#1575;&#1605; &#1602;&#1608;&#1575;&#1593;&#1583; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606;&#1575;&#1578; MySQL; &#1604;&#1605; &#1571;&#1588;&#1578;&#1585;&#1603; &#1588;&#1582;&#1589;&#1610;&#1575; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1610;&#1593; 
&#1604;&#1603;&#1606; &#1585;&#1575;&#1602;&#1576;&#1578;&#1607;&#1575; &#1608; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1581;&#1575;&#1604;&#1575;&#1578; &#1578;&#1581;&#1583;&#1579;&#1578; &#1605;&#1593; &#1571;&#1588;&#1582;&#1575;&#1589; &#1593;&#1606;&#1607;&#1575;.</p></li><li class="listitem"><p>GNU Debugger(GDB)(&#1606;&#1601;&#1587; &#1575;&#1604;&#1588;&#1610;&#1574;).</p></li><li class="listitem"><p>&#1605;&#1588;&#1585;&#1608;&#1593; Debian (&#1606;&#1601;&#1587; &#1575;&#1604;&#1588;&#1610;&#1574;).</p></li></ul></div><p>This is not a complete list, of course.  Like most open source
programmers, I keep loose tabs on many different projects, just to
have a sense of the general state of things.  I won't name all of them
here, but they are mentioned in the text where appropriate.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="audience.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">&#1571;&#1593;&#1604;&#1609;</a></td><td width="40%" align="left"> <a accesskey="n" href="acknowledgments.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr><tr><td width="40%" align="right" valign="top">&#1604;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1567; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1575;&#1604;&#1576;&#1583;&#1575;&#1610;&#1577;</a></td><td width="40%" align="left" valign="top"> Acknowledgments</td></tr></table></div></body></html>
