<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Stabilizing a Release</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="development-cycle.html" title="&#1601;&#1589;&#1604; 7. Packaging, Releasing, and Daily Development"><link rel="prev" href="release-branches.html" title="Release Branches"><link rel="next" href="packaging.html" title="Packaging"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF" dir="rtl"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Stabilizing a Release</th></tr><tr><td width="20%" align="right"><a accesskey="p" href="release-branches.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><th width="60%" align="center">&#1601;&#1589;&#1604; 7. Packaging, Releasing, and Daily Development</th><td width="20%" align="left"> <a accesskey="n" href="packaging.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr></table><hr></div><div class="sect1" title="Stabilizing a Release"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="stabilizing-a-release"></a>Stabilizing a Release</h2></div></div></div><p><em class="firstterm">Stabilization</em> is the process of getting a
release branch into a releasable state; that is, of deciding which
changes will be in the release, which will not, and shaping the branch
content accordingly.</p><p>There's a lot of potential grief contained in that word,
"deciding".  The last-minute feature rush is a familiar phenomenon in
collaborative software projects: as soon as developers see that a
release is about to happen, they scramble to finish their current
changes, in order not to miss the boat.  This, of course, is the exact
opposite of what you want at release time.  It would be much better
for people to work on features at a comfortable pace, and not worry
too much about whether their changes make it into this release or the
next one.  The more changes one tries to cram into a release at the
last minute, the more the code is destabilized, and (usually) the more
new bugs are created.</p><p>Most software engineers agree in theory on rough criteria for
what changes should be allowed into a release line during its
stabilization period.  Obviously, fixes for severe bugs can go in,
especially for bugs without workarounds.  Documentation updates are
fine, as are fixes to error messages (except when they are considered
part of the interface and must remain stable).  Many projects also
allow certain kinds of low-risk or non-core changes to go in during
stabilization, and may have formal guidelines for measuring risk.  But
no amount of formalization can obviate the need for human judgement.
There will always be cases where the project simply has to make a
decision about whether a given change can go into a release.  The
danger is that since each person wants to see their own favorite
changes admitted into the release, then there will be plenty of people
motivated to allow changes, and not enough people motivated to bar
them.</p><p>Thus, the process of stabilizing a release is mostly about
creating mechanisms for saying "no".  The trick for open source
projects, in particular, is to come up with ways of saying "no" that
won't result in too many hurt feelings or disappointed developers, and
also won't prevent deserving changes from getting into the release.
There are many different ways to do this.  It's pretty easy to design
systems that satisfy these criteria, once the team has focused on them
as the important criteria.  Here I'll briefly describe two of the most
popular systems, at the extreme ends of the spectrum, but don't let
that discourage your project from being creative.  Plenty of other
arrangements are possible; these are just two that I've seen work in
practice.</p><div class="sect2" title="Dictatorship by Release Owner"><div class="titlepage"><div><div><h3 class="title"><a name="release-owner"></a>Dictatorship by Release Owner</h3></div></div></div><p>The group agrees to let one person be the <em class="firstterm">release
owner</em>.  This person has final say over what changes make
it into the release.  Of course, it is normal and expected for there
to be discussions and arguments, but in the end the group must grant
the release owner sufficient authority to make final decisions.  For
this system to work, it is necessary to choose someone with the
technical competence to understand all the changes, and the social
standing and people skills to navigate the discussions leading up to
the release without causing too many hurt feelings.</p><p>A common pattern is for the release owner to say "I don't think
there's anything wrong with this change, but we haven't had enough
time to test it yet, so it shouldn't go into this release."  It helps
a lot if the release owner has broad technical knowledge of the
project, and can give reasons why the change could be potentially
destabilizing (for example, its interactions with other parts of the
software, or portability concerns).  People will sometimes ask such
decisions to be justified, or will argue that a change is not as risky
as it looks.  These conversations need not be confrontational, as long
as the release owner is able to consider all the arguments objectively
and not reflexively dig in his heels.</p><p>Note that the release owner need not be the same person as the
project leader (in cases where there is a project leader at all; see
<a class="xref" href="social-infrastructure.html#benevolent-dictator" title="Benevolent Dictators">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Benevolent Dictators&#8221;</a><span>
in <a class="xref" href="social-infrastructure.html" title="&#1601;&#1589;&#1604; 4. Social and Political Infrastructure">&#1601;&#1589;&#1604; 4, <i>Social and Political Infrastructure</i></a></span>).  In fact,
sometimes it's
good to make sure they're <span class="emphasis"><em>not</em></span> the same person.
The skills that make a good development leader are not necessarily the
same as those that make a good release owner.  In something as
important as the release process, it may be wise to have someone
provide a counterbalance to the project leader's judgement.</p><p>Contrast the release owner role with the less dictatorial role
described in
<a class="xref" href="stabilizing-a-release.html#release-manager" title="Release manager">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Release manager&#8221;</a><span> later
in this chapter</span>.</p></div><div class="sect2" title="Change Voting"><div class="titlepage"><div><div><h3 class="title"><a name="release-voting"></a>Change Voting</h3></div></div></div><p>At the opposite extreme from dictatorship by release owner,
developers can simply vote on which changes to include in the release.
However, since the most important function of release stabilization is
to <span class="emphasis"><em>exclude</em></span> changes, it's important to design the
voting system in such a way that getting a change into the release
involves positive action by multiple developers.  Including a change
should need more than just a simple majority (see <a class="xref" href="consensus-democracy.html#electorate" title="Who Votes?">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Who Votes?&#8221;</a><span> in
<a class="xref" href="social-infrastructure.html" title="&#1601;&#1589;&#1604; 4. Social and Political Infrastructure">&#1601;&#1589;&#1604; 4, <i>Social and Political Infrastructure</i></a></span>).  Otherwise,
one vote for and none against a given change would suffice to get it
into the release, and an
unfortunate dynamic would be set up whereby each developer would vote
for her own changes, yet would be reluctant to vote against others'
changes, for fear of possible retaliation.  To avoid this, the system
should be arranged such that subgroups of developers must act in
cooperation to get any change into the release.  This not only means
that more people review each change, it also makes any individual
developer less hesitant to vote against a change, because she knows
that no particular one among those who voted for it would take her
vote against as a personal affront.  The greater the number of people
involved, the more the discussion becomes about the change and less
about the individuals.</p><p>The system we use in the Subversion project seems to have struck
a good balance, so I'll recommend it here.  In order for a change to
be applied to the release branch, at least three developers must vote
in favor of it, and none against.  A single "no" vote is enough to
stop the change from being included; that is, a "no" vote in a release
context is equivalent to a veto (see <a class="xref" href="consensus-democracy.html#veto" title="Vetoes">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Vetoes&#8221;</a>).
Naturally, any such vote must be accompanied by a justification, and
in theory the veto could be overridden if enough people feel it is
unreasonable and force a special vote over it.  In practice, this has
never happened, and I don't expect that it ever will.  People are
conservative around releases anyway, and when someone feels strongly
enough to veto the inclusion of a change, there's usually a good
reason for it.</p><p>Because the release procedure is deliberately biased toward
conservatism, the justifications offered for vetoes are sometimes
procedural rather than technical.  For example, a person may feel that
a change is well-written and unlikely to cause any new bugs, but vote
against its inclusion in a micro release simply because it's too
big&#8212;perhaps it adds a new feature, or in some subtle way fails
to fully follow the compatibility guidelines.  I've occasionally even
seen developers veto something because they simply had a gut feeling
that the change needed more testing, even though they couldn't spot
any bugs in it by inspection.  People grumbled a little bit, but the
vetoes stood and the change was not included in the release (I don't
remember if any bugs were found in later testing or not,
though).</p><div class="sect3" title="&#1575;&#1604;&#1573;&#1583;&#1575;&#1585;&#1577; &#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606;&#1610;&#1577; &#1604;&#1578;&#1581;&#1602;&#1610;&#1602; &#1575;&#1604;&#1575;&#1587;&#1578;&#1602;&#1585;&#1575;&#1585;"><div class="titlepage"><div><div><h4 class="title"><a name="release-stabilization-collaboration"></a>&#1575;&#1604;&#1573;&#1583;&#1575;&#1585;&#1577; &#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606;&#1610;&#1577; &#1604;&#1578;&#1581;&#1602;&#1610;&#1602; &#1575;&#1604;&#1575;&#1587;&#1578;&#1602;&#1585;&#1575;&#1585; </h4></div></div></div><p>
  &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1605;&#1588;&#1585;&#1608;&#1593;&#1603; &#1610;&#1582;&#1578;&#1575;&#1585; &#1606;&#1592;&#1575;&#1605; &#1578;&#1594;&#1610;&#1610;&#1585; &#1575;&#1604;&#1578;&#1589;&#1608;&#1610;&#1578; &#1601;&#1605;&#1606; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1570;&#1604;&#1610;&#1575;&#1578;
  &#1575;&#1604;&#1573;&#1583;&#1604;&#1575;&#1569; &#1576;&#1575;&#1604;&#1571;&#1589;&#1608;&#1575;&#1578; &#1605;&#1585;&#1610;&#1581;&#1577; &#1608;&#1605;&#1610;&#1587;&#1585;&#1577; &#1602;&#1583;&#1585; &#1575;&#1604;&#1573;&#1605;&#1603;&#1575;&#1606;
  .&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1585;&#1594;&#1605; &#1605;&#1606; &#1608;&#1580;&#1608;&#1583; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1578;&#1589;&#1608;&#1610;&#1578; &#1575;&#1604;&#1575;&#1604;&#1603;&#1578;&#1585;&#1608;&#1606;&#1610;&#1577; &#1605;&#1601;&#1578;&#1608;&#1581;&#1577; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; .
  &#1601;&#1610; &#1575;&#1604;&#1605;&#1605;&#1575;&#1585;&#1587;&#1577; &#1575;&#1604;&#1593;&#1605;&#1604;&#1610;&#1577; &#1571;&#1587;&#1607;&#1604; &#1588;&#1610;&#1569; &#1593;&#1605;&#1604;&#1577; &#1607;&#1608; &#1573;&#1606;&#1588;&#1575;&#1569; &#1605;&#1604;&#1601; &#1606;&#1589;&#1610; &#1606;&#1587;&#1605;&#1610;&#1607;
   <code class="filename">STATUS</code> or <code class="filename">VOTES</code> &#1571;&#1608; &#1571;&#1610; &#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1602;&#1576;&#1610;&#1604;.
  &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1604;&#1601; &#1610;&#1581;&#1608;&#1610; &#1603;&#1604; &#1602;&#1608;&#1575;&#1574;&#1605; &#1575;&#1604;&#1575;&#1602;&#1578;&#1585;&#1575;&#1581;&#1575;&#1578;
  &#1608;&#1571;&#1610; &#1605;&#1591;&#1608;&#1585; &#1610;&#1587;&#1578;&#1591;&#1610;&#1593; &#1573;&#1583;&#1585;&#1575;&#1580; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585;&#1575;&#1578; &#1587;&#1608;&#1575;&#1569; &#1603;&#1575;&#1606;&#1578;
  &#1605;&#1593; &#1575;&#1604;&#1571;&#1589;&#1608;&#1575;&#1578; &#1571;&#1608; &#1590;&#1583;&#1607;&#1575; &#1576;&#1575;&#1604;&#1573;&#1590;&#1575;&#1601;&#1577; &#1575;&#1604;&#1609; &#1575;&#1604;&#1578;&#1593;&#1604;&#1610;&#1602;&#1575;&#1578; &#1608;&#1575;&#1604;&#1605;&#1604;&#1575;&#1581;&#1592;&#1575;&#1578;
  (&#1576;&#1575;&#1604;&#1605;&#1606;&#1575;&#1587;&#1576;&#1577; &#1575;&#1602;&#1578;&#1585;&#1575;&#1581; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585; &#1604;&#1575; &#1610;&#1593;&#1606;&#1610; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577; &#1575;&#1604;&#1578;&#1589;&#1608;&#1610;&#1578; &#1593;&#1604;&#1610;&#1577;
  &#1608;&#1573;&#1606; &#1603;&#1575;&#1606;&#1575; &#1601;&#1610; &#1575;&#1594;&#1604;&#1576; &#1575;&#1604;&#1571;&#1581;&#1610;&#1575;&#1606; &#1610;&#1587;&#1610;&#1585;&#1575;&#1606; &#1580;&#1606;&#1576;&#1575; &#1573;&#1604;&#1609; &#1580;&#1606;&#1576; )
  &#1593;&#1606;&#1583; &#1605;&#1588;&#1575;&#1607;&#1583; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1604;&#1601; &#1602;&#1583; &#1610;&#1576;&#1583;&#1608; &#1588;&#1610;&#1574;&#1575; &#1603;&#1607;&#1584;&#1575; ...
</p><pre class="screen">
* r2401 (issue #49)
  Prevent client/server handshake from happening twice.
  Justification:
    Avoids extra network turnaround; small change and easy to review.
  Notes:
    This was discussed in http://.../mailing-lists/message-7777.html
    and other messages in that thread.
  Votes:
    +1: jsmith, kimf
    -1: tmartin (breaks compatibility with some pre-1.0 servers;
                 admittedly, those servers are buggy, but why be
                 incompatible if we don't have to?)
</pre><p>
  &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585; &#1581;&#1589;&#1604; &#1593;&#1604;&#1609; &#1589;&#1608;&#1578;&#1610;&#1606; &#1573;&#1610;&#1580;&#1575;&#1576;&#1610;&#1610;&#1606; &#1604;&#1603;&#1606;&#1577; &#1578;&#1593;&#1585;&#1590; &#1604;&#1604;&#1606;&#1602;&#1590; &#1605;&#1606; &#1602;&#1576;&#1604; tmartin's
  &#1608;&#1575;&#1604;&#1587;&#1576;&#1576; &#1575;&#1604;&#1584;&#1610; &#1602;&#1583;&#1605; &#1604;&#1575;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; &#1581;&#1602; &#1575;&#1604;&#1606;&#1602;&#1590; &#1607;&#1608; &#1605;&#1575;&#1576;&#1610;&#1606; &#1575;&#1604;&#1602;&#1608;&#1587;&#1610;&#1606;.
  . &#1608;&#1585;&#1576;&#1605;&#1575; &#1578;&#1601;&#1587;&#1610;&#1585; tmartin's
  &#1604;&#1575;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; &#1581;&#1602; &#1575;&#1604;&#1606;&#1602;&#1590; &#1610;&#1606;&#1576;&#1594;&#1610; &#1571;&#1606; &#1610;&#1608;&#1590;&#1593; &#1601;&#1610; &#1605;&#1604;&#1575;&#1581;&#1592;&#1575;&#1578; &#1575;&#1604;&#1576;&#1575;&#1576; &#1571;&#1608; &#1585;&#1576;&#1605;&#1575; &#1610;&#1606;&#1576;&#1594;&#1610; &#1571;&#1606; &#1610;&#1581;&#1589;&#1604; &#1593;&#1604;&#1609; &#1608;&#1589;&#1601; &#1585;&#1575;&#1587;&#1610; (  &#1608;&#1589;&#1601; Description   )
  &#1585;&#1575;&#1587;&#1610; &#1604;&#1610;&#1578;&#1606;&#1575;&#1587;&#1576; &#1605;&#1593; &#1575;&#1604;&#1571;&#1602;&#1587;&#1575;&#1605; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609; . &#1575;&#1604;&#1605;&#1607;&#1605; &#1607;&#1606;&#1575; &#1607;&#1608; &#1571;&#1606; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; &#1575;&#1604;&#1604;&#1575;&#1586;&#1605;&#1577; &#1604;&#1578;&#1602;&#1610;&#1610;&#1605;
  &#1578;&#1594;&#1610;&#1610;&#1585; &#1605;&#1575; &#1608;&#1575;&#1606; &#1570;&#1604;&#1610;&#1577; &#1575;&#1604;&#1573;&#1583;&#1604;&#1575;&#1569; &#1576;&#1575;&#1604;&#1571;&#1589;&#1608;&#1575;&#1578; &#1610;&#1606;&#1576;&#1594;&#1610; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1587;&#1607;&#1604;&#1577; &#1608;&#1605;&#1605;&#1603;&#1606;&#1577; &#1575;&#1604;&#1578;&#1594;&#1610;&#1585; &#1575;&#1604;&#1605;&#1602;&#1578;&#1585;&#1581; &#1608;&#1610;&#1588;&#1575;&#1585; &#1573;&#1604;&#1609; &#1580;&#1575;&#1606;&#1576; &#1573;&#1593;&#1575;&#1583;&#1577; &#1575;&#1604;&#1606;&#1592;&#1585; &#1601;&#1610; &#1593;&#1583;&#1583; &#1575;&#1604;&#1605;&#1587;&#1578;&#1608;&#1583;&#1593; .
  &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577; &#1573;&#1593;&#1575;&#1583;&#1577; &#1575;&#1604;&#1606;&#1592;&#1585; &#1601;&#1610; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585; , r2401 &#1608;&#1575;&#1606; &#1603;&#1575;&#1606; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585; &#1575;&#1604;&#1605;&#1602;&#1578;&#1585;&#1581; &#1610;&#1605;&#1603;&#1606; &#1576;&#1576;&#1587;&#1575;&#1591;&#1577; &#1571;&#1606; &#1610;&#1578;&#1571;&#1604;&#1601; &#1605;&#1606; &#1593;&#1583;&#1577;
  &#1578;&#1606;&#1602;&#1610;&#1581;&#1575;&#1578; . &#1575;&#1604;&#1578;&#1606;&#1602;&#1610;&#1581; &#1610;&#1601;&#1578;&#1585;&#1590; &#1571;&#1606; &#1610;&#1588;&#1610;&#1585; &#1573;&#1604;&#1609; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585; &#1575;&#1604;&#1581;&#1575;&#1589;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1580;&#1586;&#1569; &#1575;&#1604;&#1601;&#1585;&#1593;&#1610; . &#1608;&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585; &#1576;&#1575;&#1604;&#1601;&#1593;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1580;&#1586;&#1569;
  &#1575;&#1604;&#1601;&#1585;&#1593;&#1610; &#1601;&#1604;&#1606; &#1578;&#1603;&#1608;&#1606; &#1607;&#1606;&#1575;&#1603; &#1581;&#1575;&#1580;&#1577; &#1604;&#1604;&#1578;&#1589;&#1608;&#1610;&#1578; &#1593;&#1604;&#1610;&#1577; .
  &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1573;&#1589;&#1583;&#1575;&#1585; &#1575;&#1604;&#1582;&#1575;&#1589; &#1576;&#1603;  &#1605;&#1606; &#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1605;&#1585;&#1575;&#1602;&#1576;&#1577; &#1604;&#1575; &#1610;&#1605;&#1578;&#1604;&#1603; &#1578;&#1585;&#1603;&#1610;&#1576; &#1608;&#1575;&#1590;&#1581; &#1604;&#1604;&#1573;&#1588;&#1575;&#1585;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1578;&#1594;&#1610;&#1610;&#1585;&#1575;&#1578; &#1575;&#1604;&#1601;&#1585;&#1583;&#1610;&#1577; .. &#1579;&#1605;
  &#1610;&#1606;&#1576;&#1594;&#1610; &#1608;&#1575;&#1581;&#1583; &#1605;&#1606; &#1575;&#1580;&#1604; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606;  &#1593;&#1605;&#1604;&#1610;&#1577; &#1575;&#1604;&#1578;&#1589;&#1608;&#1610;&#1578; &#1571;&#1603;&#1579;&#1585; &#1593;&#1605;&#1604;&#1610;&#1577; .. &#1603;&#1604; &#1578;&#1594;&#1610;&#1610;&#1585; &#1602;&#1610;&#1583; &#1575;&#1604;&#1606;&#1592;&#1585; &#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1608;&#1575;&#1590;&#1581; &#1608;&#1605;&#1587;&#1578;&#1602;&#1604; &#1604;&#1604;&#1578;&#1593;&#1585;&#1601; &#1593;&#1604;&#1610;&#1607; .
  &#1571;&#1608; &#1578;&#1604;&#1603; &#1575;&#1604;&#1578;&#1610; &#1578;&#1602;&#1578;&#1585;&#1581; &#1575;&#1604;&#1578;&#1589;&#1608;&#1610;&#1578; &#1604;&#1604;&#1578;&#1594;&#1610;&#1585; &#1605;&#1572;&#1608;&#1604;&#1577; &#1604;&#1604;&#1578;&#1571;&#1603;&#1583; &#1605;&#1606; &#1571;&#1606;&#1607;&#1575; &#1578;&#1606;&#1591;&#1576;&#1602; &#1605;&#1606; &#1583;&#1608;&#1606; &#1605;&#1593;&#1608;&#1602;&#1575;&#1578; . &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1607;&#1606;&#1575;&#1603; &#1605;&#1593;&#1608;&#1602;&#1575;&#1578; &#1573;&#1605;&#1575; &#1571;&#1606;
  &#1578;&#1588;&#1610;&#1585; &#1573;&#1604;&#1609; &#1571;&#1606; &#1605;&#1593;&#1583;&#1604; &#1575;&#1604;&#1578;&#1589;&#1581;&#1610;&#1581; &#1610;&#1606;&#1591;&#1576;&#1602; &#1578;&#1605;&#1575;&#1605;&#1575; &#1571;&#1608; &#1605;&#1572;&#1602;&#1578; &#1604;&#1601;&#1585;&#1593; &#1610;&#1581;&#1605;&#1604; &#1606;&#1587;&#1582;&#1577; &#1575;&#1604;&#1605;&#1593;&#1583;&#1604;&#1577; &#1604;&#1604;&#1578;&#1594;&#1610;&#1585; .
  &#1605;&#1579;&#1575;&#1604;
</p><p>Those proposing or voting for a change are responsible for
making sure it applies cleanly to the release branch, that is, applies
without conflicts (see <a class="xref" href="vc.html#vc-vocabulary-conflict"><em class="firstterm">conflict</em></a>).
If there are conflicts, then the entry should either point to an
adjusted patch that does apply cleanly, or to a temporary branch that
holds an adjusted version of the change, for example:</p><pre class="screen">
* r13222, r13223, r13232
  Rewrite libsvn_fs_fs's auto-merge algorithm
  Justification:
    unacceptable performance (&gt;50 minutes for a small commit) in
    a repository with 300,000 revisions
  Branch:
    1.1.x-r13222@13517
  Votes:
    +1: epg, ghudson
</pre><p>That example is taken from real life; it comes from the
<code class="filename">STATUS</code> file for the Subversion 1.1.4 release
process.  Notice how it uses the original revisions as canonical
handles on the change, even though there is also a branch with a
conflict-adjusted version of the change (the branch also combines the
three trunk revisions into one, r13517, to make it easier to merge the
change into the release, should it get approval).  The original
revisions are provided because they're still the easiest entity to
review, since they have the original log messages.  The temporary
branch wouldn't have those log messages; in order to avoid duplication
of information (see
<a class="xref" href="vc.html#vc-singularity" title="Singularity of information">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Singularity of information&#8221;</a><span> in
<a class="xref" href="technical-infrastructure.html" title="&#1601;&#1589;&#1604; 3. Technical Infrastructure">&#1601;&#1589;&#1604; 3, <i>Technical Infrastructure</i></a></span>), the
branch's log message for r13517 should simply say "Adjust r13222,
r13223, and r13232 for backport to 1.1.x branch."  All other
information about the changes can be chased down at their original
revisions.</p></div><div class="sect3" title="Release manager"><div class="titlepage"><div><div><h4 class="title"><a name="release-manager"></a>Release manager</h4></div></div></div><p>The actual process of merging (see
<a class="xref" href="vc.html#vc-vocabulary-merge"><em class="firstterm">merge (a.k.a. port)</em></a>) approved changes into the
release branch can be performed by any developer.  There does not need
to be one person whose job it is to merge changes; if there are a lot
of changes, it can be better to spread the burden around.</p><p>However, although both voting and merging happen in a
decentralized fashion, in practice there are usually one or two people
driving the release process.  This role is sometimes formally blessed
as <em class="firstterm">release manager</em>, but it is quite different
from a release owner (see
<a class="xref" href="stabilizing-a-release.html#release-owner" title="Dictatorship by Release Owner">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Dictatorship by Release Owner&#8221;</a><span> earlier
in this chapter</span>) who has
final say over the changes.  Release managers keep track of how many
changes are currently under consideration, how many have been
approved, how many seem likely to be approved, etc.  If they sense
that important changes are not getting enough attention, and might be
left out of the release for lack of votes, they will gently nag other
developers to review and vote.  When a batch of changes are approved,
these people will often take it upon themselves to merge them into the
release branch; it's fine if others leave that task to them, as
long as everyone understands that they are not obligated to do all the
work unless they have explicitly committed to it.  When the time comes
to put the release out the door (see
<a class="xref" href="testing-and-releasing.html" title="Testing and Releasing">&#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#8220;Testing and Releasing&#8221;</a><span>
later in this chapter</span>), the release managers
also take care of the logistics of creating the final release
packages, collecting digital signatures, uploading the packages, and
making the public announcement.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="right"><a accesskey="p" href="release-branches.html">&#1575;&#1604;&#1587;&#1575;&#1576;&#1602;</a> </td><td width="20%" align="center"><a accesskey="u" href="development-cycle.html">&#1571;&#1593;&#1604;&#1609;</a></td><td width="40%" align="left"> <a accesskey="n" href="packaging.html">&#1575;&#1604;&#1578;&#1575;&#1604;&#1610;</a></td></tr><tr><td width="40%" align="right" valign="top">Release Branches </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1575;&#1604;&#1576;&#1583;&#1575;&#1610;&#1577;</a></td><td width="40%" align="left" valign="top"> Packaging</td></tr></table></div></body></html>
