<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="preface.html" title="&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;"><link rel="prev" href="sources.html" title="&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;"><link rel="next" href="disclaimer.html" title="&#2986;&#3014;&#3006;&#2993;&#3009;&#2986;&#3021;&#2986;&#3006;&#2965;&#3006;&#2990;&#3016;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="sources.html">Prev</a> </td><th width="60%" align="center">&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;</th><td width="20%" align="right"> <a accesskey="n" href="disclaimer.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="acknowledgments"></a>&#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;</h2></div></div></div><p>&#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2958;&#2996;&#3009;&#2980;&#3007; &#2990;&#3009;&#2975;&#3007;&#2965;&#3021;&#2965; &#2984;&#3006;&#2985;&#3021; &#2984;&#3007;&#2985;&#3016;&#2980;&#3021;&#2980;&#2980;&#3016; &#2997;&#3007;&#2975; &#2984;&#3006;&#2985;&#3021;&#2965;&#3009; &#2990;&#2975;&#2969;&#3021;&#2965;&#3009; &#2984;&#3015;&#2992;&#2990;&#3021; 
&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009;.  &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2990;&#3009;&#2993;&#3016; &#2984;&#3006;&#2985;&#3021; &#2958;&#2996;&#3009;&#2980; &#2990;&#3009;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021;, &#2962;&#2992;&#3009; &#2986;&#3014;&#2992;&#3007;&#2991; 
piano &#2980;&#2994;&#3016;&#2965;&#3021;&#2965;&#3009; &#2990;&#3015;&#2994;&#3021; &#2980;&#3018;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009;&#2986;&#3019;&#2985;&#3021;&#2993;&#3015; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#3015;&#2985;&#3021;.  &#2986;&#2994;&#2992;&#3007;&#2985;&#3021; &#2953;&#2980;&#2997;&#3007; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; 
&#2951;&#2986;&#3021;&#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3016; &#2990;&#3018;&#2995;&#3009;&#2990;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;.</p><p>Andy Oram, &#2958;&#2985;&#2980;&#3009; O'Reilly-&#2985;&#3021; &#2950;&#2970;&#3007;&#2992;&#3007;&#2991;&#2992;&#3021;, &#2949;&#2997;&#2992;&#3021; &#2962;&#2992;&#3009; &#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2985;&#2997;&#3009; 
&#2986;&#3019;&#2985;&#3021;&#2993;&#2997;&#2992;&#3021;.  &#2951;&#2980;&#3021;&#2980;&#3009;&#2993;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; (&#2949;&#2997;&#2992;&#3021; &#2984;&#3007;&#2993;&#3016;&#2991; &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; 
&#2986;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2992;&#3021;) &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2965;&#3010;&#2993; &#2997;&#3007;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009; &#2949;&#2980;&#2985;&#3016; &#2965;&#3010;&#2993;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2965;&#2995;&#3016; 
&#2965;&#3006;&#2979; &#2953;&#2980;&#2997;&#3009;&#2986;&#2997;&#2992;&#3021;. &#2949;&#2997;&#2992;&#3009;&#2975;&#2985;&#3021; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007;&#2991;&#2980;&#3016; &#2986;&#3014;&#2992;&#3009;&#2990;&#3016;&#2991;&#3014;&#2985; &#2965;&#2992;&#3009;&#2980;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
Andy-&#2965;&#3009; &#2951;&#2997;&#3021;&#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3016; &#2949;&#2993;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980; Chuck Toporek-&#2965;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2993;&#3007; &#2965;&#3010;&#2993; 
&#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;.</p><p>&#2984;&#3007;&#2992;&#2994;&#3021; &#2970;&#2992;&#3007;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; &#2953;&#2980;&#2997;&#3007;&#2991; Brian Fitzpatrick-&#2951;&#2985;&#3021; &#2986;&#2979;&#3007; &#2951;&#2986;&#3021;&#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3016; 
&#2990;&#3014;&#2992;&#3009;&#2965;&#3015;&#2993;&#3021;&#2993; &#2953;&#2980;&#2997;&#3007;&#2991;&#2980;&#3009;&#2975;&#2985;&#3021;; &#2953;&#2994;&#2965;&#3007;&#2994;&#3021; &#2958;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2993;&#3007; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; 
&#2958;&#2985;&#3021;&#2985;&#3016; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2958;&#2996;&#3009;&#2980;&#2997;&#3009;&#2990;&#3021; &#2980;&#3010;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009;.  Ben Collins-Sussman&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Mike 
Pilato-&#2950;&#2965;&#3007;&#2991;&#3019;&#2992;&#3009;&#2990;&#3021; &#2951;&#2980;&#2985;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2984;&#3007;&#2980;&#3021;&#2980;&#3009;&#2980;&#2997;&#3007;&#2985;&#2992;&#3021;. &#2949;&#2980;&#3009;&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2958;&#2980;&#3016;  
&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021; &#8212;&#2970;&#3007;&#2994;&#2970;&#2990;&#2991;&#2990;&#3021; &#2990;&#2979;&#3007;&#2965;&#3021;&#2965;&#2979;&#2965;&#3021;&#2965;&#3007;&#2994;&#3009;&#2990;&#3021;&#8212; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; 
&#2990;&#2965;&#3007;&#2970;&#3021;&#2970;&#3007;&#2991;&#3009;&#2975;&#2985;&#3021; &#2953;&#2980;&#2997;&#3007;&#2985;&#2992;&#3021;.</p><p>&#2984;&#3006;&#2985;&#3021; &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2958;&#2996;&#3009;&#2980;&#3009;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; Biella Coleman &#2949;&#2997;&#2992;&#2980;&#3009; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2997;&#3009;&#2993;&#3016;&#2991;&#3016; 
&#2958;&#2996;&#3009;&#2980;&#3007;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021; .  &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2984;&#3006;&#2995;&#3009;&#2990;&#3021; &#2958;&#2996;&#3009;&#2980;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2984;&#3015;&#2992;&#2990;&#3021; &#2962;&#2980;&#3009;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2984;&#2985;&#3021;&#2965;&#3009; 
&#2953;&#2979;&#2992;&#3021;&#2980;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021;, &#2949;&#2980;&#3009; &#2958;&#2985;&#2965;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2953;&#2980;&#3006;&#2992;&#2985;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;. Alex Golub&#8212;
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2984;&#3010;&#2994;&#3021; &#2949;&#2993;&#3007;&#2974;&#2992;&#3021;, &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2994;&#3021; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3015; 
&#2980;&#2985;&#2980;&#3009; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2997;&#3009;&#2993;&#3016;&#2991;&#3016; &#2984;&#3007;&#2993;&#3016;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021;&#8212; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2950;&#2980;&#2992;&#2997;&#3006;&#2965; 
&#2997;&#3007;&#2995;&#2969;&#3021;&#2965;&#3007;&#2985;&#2992;&#3021;.</p><p>Micah Anderson &#2958;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3019; &#2980;&#2985;&#2980;&#3009; &#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#3015;&#2994;&#3016;&#2991;&#3006;&#2994;&#3021; &#2984;&#3014;&#2992;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; 
&#2980;&#3019;&#2985;&#3021;&#2993; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;, &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; &#2984;&#3019;&#2991;&#3006;&#2995;&#3007;&#2965;&#3021;&#2965;&#3009;&#2965;&#3010;&#2975; &#2986;&#3018;&#2993;&#3006;&#2990;&#3016; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2954;&#2965;&#3021;&#2965;&#2990;&#2995;&#3007;&#2965;&#3021;&#2965; 
&#2997;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2949;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#2975;&#3021;&#2986;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
(&#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2962;&#2992;&#3009;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021;) &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2980;&#2997;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#2991;&#3006;&#2992;&#3006;&#2965;&#2997;&#3015; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021;. 
&#2990;&#3007;&#2965;&#3021;&#2965; &#2984;&#2985;&#3021;&#2993;&#3007;, Micah!</p><p>Jon Trowbridge &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Sander Striker &#2965;&#3018;&#2975;&#3009;&#2980;&#3021;&#2980; &#2953;&#2980;&#2997;&#3007;&#2991;&#3009;&#2990;&#3021;, &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; 
&#8212;&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2950;&#2996;&#3021;&#2984;&#3021;&#2980; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3009;&#2990;&#3021; &#2997;&#3015;&#2993;&#3009; &#2958;&#2997;&#3021;&#2997;&#2996;&#3007;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3006;&#2994;&#3021; 
&#2986;&#3014;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;.</p><p>Greg Stein-&#2965;&#3021;&#2965;&#3009; &#2949;&#2997;&#2992;&#3007;&#2985;&#3021; &#2984;&#2975;&#3021;&#2986;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2980;&#2965;&#3021;&#2965; &#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3007;&#2965;&#3009; 
&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; Subversion &#2986;&#3019;&#2985;&#3021;&#2993; &#2970;&#2990;&#3010;&#2965; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; 
&#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2992;&#3007;&#2970;&#3008;&#2994;&#2985;&#3016;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2953;&#2979;&#2992;&#3021;&#2980;&#3007;&#2991;&#2990;&#3016;&#2965;&#3009;&#2990;&#3021; 
&#2984;&#2985;&#3021;&#2993;&#3007; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; Brian Behlendorf &#2986;&#3009;&#2980;&#3021;&#2980;&#3007;&#2970;&#3006;&#2994;&#3007;&#2980;&#2985;&#2990;&#3006;&#2965; 
&#2958;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#2965;&#3007;&#2992;&#2969;&#3021;&#2965;&#2990;&#3006;&#2965; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2980;&#3010;&#2979;&#3021;&#2975;&#3007;&#2991;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2993;&#3007; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965; 
&#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2965;&#3018;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#2965;&#2995;&#3007;&#2994;&#3021; &#2958;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2980;&#3007;&#2986;&#2994;&#3007;&#2986;&#3021;&#2986;&#2980;&#3016; &#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021; 
&#2958;&#2985; &#2958;&#2979;&#3021;&#2979;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;.</p><p>&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2986;&#2994;&#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; 
&#2986;&#3015;&#2970;&#3021;&#2970;&#3009;&#2997;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; Benjamin "Mako" Hill &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Seth Schoen-&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;; 
&#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#3018;&#2985;&#3021;&#2985;&#3006;&#2985; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2962;&#2980;&#3009;&#2965;&#3007;&#2991; Zack Urlocker 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Louis Suarez-Potts-&#2965;&#3009;&#2990;&#3021;; &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3007;&#2985;&#3021;&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2953;&#2980;&#3006;&#2992;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; 
&#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2991;&#2995;&#3007;&#2980;&#3021;&#2980; Shan-&#2965;&#3009;&#2990;&#3021;; canned hosting sites &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2990;&#3007;&#2965; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2985; &#2962;&#2986;&#3021;&#2986;&#3009;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; 
Haggen-&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2993;&#3007;.</p><p>Alla Dekhtyar, Polina, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Sonya &#2950;&#2965;&#3007;&#2991;&#3019;&#2992;&#3007;&#2985;&#3021; &#2965;&#2985;&#3007;&#2997;&#3006;&#2985; &#2954;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; 
&#2984;&#2985;&#3021;&#2993;&#3007;.  &#2949;&#2997;&#2993;&#3021;&#2993;&#3006;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3008;&#2975;&#3021;&#2975;&#3007;&#2993;&#3021;&#2965;&#3009; &#2970;&#3014;&#2993;&#3021;&#2993;&#3009; &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#2997;&#2985;&#2990;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980; &#2958;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; 
&#2990;&#3006;&#2994;&#3016;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3016; &#2990;&#3007;&#2965;&#2997;&#3007;&#2992;&#3016;&#2997;&#3007;&#2994;&#3021; &#2990;&#3009;&#2975;&#3007;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995; (&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3007;&#2992;&#3016;&#2997;&#3007;&#2994;&#3021; &#2990;&#3009;&#2975;&#3007;&#2965;&#3021;&#2965; &#2951;&#2991;&#2985;&#3021;&#2993;&#3009; 
&#2980;&#3019;&#2994;&#3021;&#2997;&#3007; &#2965;&#3006;&#2979;) &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2986;&#3019;&#2985;&#2980;&#3009;.</p><p>&#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2980;&#2997;&#2992;&#3006;&#2985; &#2950;&#2991;&#3021;&#2997;&#3016; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#3006;&#2980; &#2986;&#3007;&#2975;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#2975;&#3021;&#2986;&#3021;&#2986;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; 
Jack &#2992;&#3015;&#2986;&#3014;&#2985;&#3021;&#2985;&#3007;&#2969;&#3021;-&#2965;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2993;&#3007;.   &#2949;&#2997;&#2992;&#3007;&#2985;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2980;&#3007;&#2994;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993; &#2984;&#3008;&#2979;&#3021;&#2975; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2990;&#3014;&#2992;&#3009;&#2965;&#3015;&#2993;&#3021;&#2993;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.</p><p>&#2986;&#2992;&#2984;&#3021;&#2980; &#2990;&#2985;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016; &#2965;&#3018;&#2985;&#3021;&#2975; CollabNet &#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2951;&#2985;&#3021; &#2984;&#3014;&#2965;&#3007;&#2996;&#3021;&#2997;&#3006;&#2985; &#2949;&#2997;&#2965;&#3006;&#2970;&#2990;&#3021; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3018;&#2993;&#3009;&#2990;&#3016;&#2965;&#3021;&#2965;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; Sandhya Klute   &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; Mahesh Murthy &#2950;&#2965;&#3007;&#2991; &#2951;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2993;&#3007;.
</p><p>&#2965;&#2975;&#2984;&#3021;&#2980; 5 &#2997;&#2992;&#3009;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3015;&#2994;&#3006;&#2965; Subversion &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2979;&#3007; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980; &#2949;&#2985;&#3016;&#2997;&#2992;&#3007;&#2985;&#3021; 
&#2953;&#2984;&#3021;&#2980;&#3009;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3014; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3006;&#2985; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2990;&#3007;&#2965; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3007;&#2965;&#3021;&#2965;&#3016; &#2950;&#2980;&#2994;&#3006;&#2994;&#3021; &#2986;&#3014;&#2991;&#2992;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3009; &#2984;&#2985;&#3021;&#2993;&#3007; &#2965;&#3010;&#2992; &#2951;&#2991;&#2994;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;. </p><p>Rachel Scollon-&#2960; &#2986;&#2994;&#2990;&#3009;&#2993;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2994;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#3015;&#2985;&#3021;; &#2949;&#2997;&#2992;&#3021; 
&#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021; &#2965;&#3015;&#2975;&#3021;&#2965; &#2980;&#2991;&#3006;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;&#2975;&#2985;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985; &#2970;&#3007;&#2994; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965;&#3021;&#2965; &#2953;&#2980;&#2997;&#3007; 
&#2953;&#2995;&#3021;&#2995;&#3006;&#2992;&#3021;. &#2949;&#2980;&#3009; &#2986;&#3015;&#2992;&#3009;&#2980;&#2997;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;&#8212;&#2984;&#2985;&#3021;&#2993;&#3007;.</p><p>Noel Taylor-&#2965;&#3021;&#2965;&#3009; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2993;&#3007;,  &#2984;&#3006;&#2985;&#3021; &#2986;&#2994; &#2990;&#3009;&#2993;&#3016; &#2986;&#3009;&#2994;&#2990;&#3021;&#2986;&#3007;&#2991; &#2986;&#3007;&#2993;&#2965;&#3009;&#2990;&#3021; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; 
&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2958;&#2996;&#3009;&#2980; &#2984;&#3007;&#2985;&#3016;&#2980;&#3021;&#2980;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2997;&#3007;&#2991;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3007;&#2985;&#3021; &#2984;&#2975;&#3021;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; 
&#2951;&#2996;&#2965;&#3021;&#2965;&#3009; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2950;&#2996;&#3009;&#2990;&#3016;&#2991;&#3009;&#2990;&#3021;á &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985; &#2970;&#3010;&#2996;&#2994;&#3007;&#2994;&#3009;&#2990;&#3021; &#2958;&#2985;&#2980;&#3009; &#2997;&#3006;&#2996;&#3021;&#2997;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;.
Matthew Dean &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Dorothea Samtleben-&#2965;&#3021;&#2965;&#3009; &#2986;&#2994; &#2990;&#3009;&#2993;&#3016; &#2951;&#2970;&#3016; &#2984;&#3007;&#2965;&#2996;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3007;&#2994;&#3021; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009; 
&#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2990;&#2994;&#3021; &#2970;&#3014;&#2985;&#3021;&#2993; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021; &#2951;&#2985;&#2965;&#3021;&#2965;&#2990;&#3021; &#2965;&#3006;&#2975;&#3021;&#2975;&#3007;&#2991;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2993;&#3007;. Megan Jennings &#2980;&#2985;&#2965;&#3021;&#2965;&#3009; 
&#2949;&#2985;&#3021;&#2985;&#3007;&#2991;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2984;&#3007;&#2994;&#3016;&#2991;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2949;&#2965;&#3021;&#2965;&#2992;&#3016; &#2965;&#3006;&#2975;&#3021;&#2975;&#3007;&#2991;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2993;&#3007;;
&#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2949;&#2980;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3006;&#2995;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3014;&#2993;&#3009;&#2990;&#3021; &#2953;&#2984;&#3021;&#2980;&#3009;&#2980;&#2994;&#3021;.</p><p>&#2958;&#2985;&#2965;&#3021;&#2965;&#3009; Yoav Shapira, Andrew Stellman, Davanum Srinivas, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
Ben Hyde &#2950;&#2965;&#3007; &#2984;&#3006;&#2985;&#3021;&#2965;&#3009; &#2949;&#2993;&#3007;&#2997;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3007;&#2975;&#3006;&#2990;&#3009;&#2991;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3009;&#2975;&#3016;&#2991; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2965;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021;.   
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2959;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; &#2951;&#2980;&#3016; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2985; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3006;&#2965; 
&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021;. &#2984;&#3015;&#2992; &#2984;&#3014;&#2992;&#3009;&#2965;&#3021;&#2965;&#2975;&#3007;&#2991;&#3006;&#2994;&#3021; &#2970;&#3007;&#2994;&#2997;&#2993;&#3021;&#2992;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980;&#3021;&#2980;&#3009;.  
&#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3009;.</p><p>&#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2958;&#2985;&#2965;&#3021;&#2965;&#3009; &#2953;&#2993;&#3009;&#2980;&#3009;&#2985;&#3016;&#2991;&#3006;&#2965; &#2951;&#2993;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#2980;&#3009; &#2986;&#3014;&#2993;&#3021;&#2993;&#3019;&#2992;&#3021; Frances &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Hendra, 
&#2958;&#2985;&#2980;&#3009; &#2990;&#3009;&#2984;&#3021;&#2980;&#2991; &#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3016; &#2997;&#3007;&#2975; &#2951;&#2980;&#3009; &#2970;&#2993;&#3021;&#2993;&#3009; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2985; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3006;&#2965; &#2953;&#2979;&#2992;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2958;&#2985;&#3021;&#2993;&#3009; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;.</p><p>&#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965;, &#2949;&#2992;&#3021;&#2986;&#3021;&#2986;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009; &#2953;&#2995;&#3021;&#2995; Karen Underhill &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Jim Blandy &#2984;&#2985;&#3021;&#2993;&#3007;.  
Karen'&#2985;&#3021; &#2984;&#2975;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3009;&#2992;&#3007;&#2980;&#2994;&#3021; &#2958;&#2985;&#3021;&#2965;&#3021;&#2965;&#3009; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2958;&#2996;&#3009;&#2980;&#2991;&#3007;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2965;&#2975;&#2984;&#3021;&#2980; 7 &#2950;&#2979;&#3021;&#2975;&#3009;&#2965;&#2995;&#3006;&#2965; 
&#2953;&#2993;&#3009;&#2980;&#3009;&#2985;&#3016;&#2991;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2949;&#2997;&#2992;&#3021; &#2953;&#2980;&#2997;&#3007; &#2951;&#2985;&#3021;&#2993;&#3007; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2951;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;.
&#2997;&#3007;&#2990;&#3006;&#2985;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2986;&#2993;&#2965;&#3021;&#2965; &#2965;&#2993;&#3021;&#2993;&#3009;&#2980;&#3021;&#2980;&#2984;&#3021;&#2980; &#2986;&#2993;&#2997;&#3016; &#2986;&#3019;&#2994;&#3021; &#2958;&#2985;&#2965;&#3021;&#2965;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2994;&#3021; &#2965;&#2993;&#3021;&#2993;&#3009;&#2980;&#3021;&#2980;&#2984;&#3021;&#2980;  
&#3001;&#3015;&#2965;&#3021;&#2965;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#3001;&#3015;&#2965;&#3021;&#2965;&#2992;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2984;&#2975;&#3021;&#2986;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2990;&#3016;&#2984;&#3021;&#2980; Jim-&#2965;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2993;&#3007; </p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="sources.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="disclaimer.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2986;&#3014;&#3006;&#2993;&#3009;&#2986;&#3021;&#2986;&#3006;&#2965;&#3006;&#2990;&#3016;</td></tr></table></div></body></html>
