<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="getting-started.html" title="Chapter 2. &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;"><link rel="prev" href="setting-tone.html" title="&#2980;&#3018;&#2985;&#3007; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009;"><link rel="next" href="technical-infrastructure.html" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="setting-tone.html">Prev</a> </td><th width="60%" align="center">Chapter 2. &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</th><td width="20%" align="right"> <a accesskey="n" href="technical-infrastructure.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="announcing"></a>&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;</h2></div></div></div><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2949;&#2993;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#2991;&#3006;&#2992;&#3006;&#2985;&#2997;&#3009;&#2975;&#2985;&#3021;&#8212;&#2990;&#3009;&#2994;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2951;&#2994;&#3021;&#2994;&#3006;&#2997;&#3007;&#2975;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2993;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;
&#2980;&#2991;&#3006;&#2992;&#3006;&#2985;&#2997;&#3009;&#2975;&#2985;&#3021;&#8212;&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3014;&#2995;&#3007; &#2953;&#2994;&#2965;&#3007;&#2993;&#3021;&#2965;&#3009; &#2949;&#2993;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965; &#2980;&#2991;&#3006;&#2992;&#3006;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2951;&#2980;&#3009; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021; &#2986;&#3006;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2975; &#2990;&#3007;&#2965; &#2958;&#2996;&#3007;&#2980;&#3006;&#2965;&#2997;&#3015; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2980;&#2992;&#3021;&#2965;&#3009; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2997;&#2965;&#3016;
&#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;: &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2962;&#2980;&#3021;&#2980; &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;.</p><p><a class="ulink" href="http://freecode.com/" target="_top">freecode.com</a>
&#2962;&#2992;&#3009; &#2990;&#3007;&#2965; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#2985;&#3021;&#2993;&#2990;&#3021; &#8212; &#2990;&#3015;&#2994;&#3021; &#2980;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2949;&#2990;&#3016;&#2984;&#3021;&#2980; 
<span class="guimenuitem">&#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2979;&#3007;&#2991;&#3016;&#2970;&#3021; &#2970;&#2990;&#2992;&#3021;&#2986;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;</span> &#2958;&#2985;&#3021;&#2993; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007;&#2991;&#3016; &#2951;&#2991;&#2969;&#3021;&#2965;&#3007;&#2985;&#3006;&#2994;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021;.  
&#2986;&#3021;&#2992;&#3007;&#2965;&#3019;&#2975;&#3007;&#2985;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; 
<a class="ulink" href="http://slashdot.org/" target="_top">Slashdot.org</a> &#2958;&#2985;&#3021;&#2993; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985; &#2980;&#2995;&#2980;&#3007;&#2994;&#3021; 
&#2980;&#3006;&#2985;&#2965; &#2953;&#2995;&#3021; &#2951;&#2985;&#3016;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3009; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986; &#2953;&#2995;&#3021;&#2995; &#2962;&#2992;&#3009;&#2997;&#2992;&#3007;&#2985;&#3021; &#2997;&#3006;&#2991;&#3021;&#2997;&#2996;&#3007; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2991;&#3006;&#2965; &#2986;&#2992;&#2997;&#3009;&#2990;&#3021; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3016; &#2980;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.
(&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;: 2011 &#2951;&#2994;&#3021; &#2990;&#2993;&#3009; &#2986;&#3014;&#2991;&#2992;&#3007;&#2975;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2986;&#3021;&#2992;&#3007;&#2965;&#3019;&#2975;&#3021; Freshmeat.net &#2958;&#2985;&#3021;&#2993;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.) &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; <a class="ulink" href="http://OhLoh.net/" target="_top">OhLoh.net</a> &#2951;&#2994;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2975;&#2994;&#3006;&#2990;&#3021;, &#2951;&#2980;&#3009;
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2997;&#3007;&#2997;&#2992;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975; &#2980;&#2965;&#2997;&#2994;&#3021; &#2965;&#2994;&#2974;&#3021;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2984;&#3007;&#2965;&#2992;&#3006;&#2985;&#2980;&#3009;. 
(<a class="ulink" href="http://www.reddit.com/r/technology/" target="_top">reddit.com/r/technology</a>
&#2951;&#2985;&#3021; &#2986;&#3007;&#2992;&#3007;&#2997;&#3006;&#2985; 
<a class="ulink" href="http://news.ycombinator.com/" target="_top">news.ycombinator.com</a>
&#2986;&#3015;&#2985;&#3021;&#2993;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2986;&#2965;&#3021;&#2965;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2997;&#3006;&#2991;&#3021;&#2997;&#2996;&#3007; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; / &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3021;&#2993;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2953;&#2995;&#3021;&#2995;&#2985;.
&#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2986;&#2975;&#3021;&#2975; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2986;&#2965;&#3021;&#2965;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2984;&#2994;&#3021;&#2994; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, 
&#2984;&#3006;&#2985;&#3021; &#2997;&#3007;&#2991;&#2986;&#3006;&#2992; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2986;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#3010;&#2992; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2990;&#3007;&#2965; &#2949;&#2980;&#3007;&#2965; &#2949;&#2995;&#2997;&#3007;&#2994;&#3021; 
&#2997;&#3008;&#2985;&#3021; &#2997;&#3007;&#2995;&#2990;&#3021;&#2986;&#2992;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2997;&#2985;&#3021;&#2985;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.)</p><p>&#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;&#2980;&#3006;&#2985;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2965;&#2997;&#2979;&#2990;&#3021; &#2952;&#2969;&#3021;&#2965;&#3009; &#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#3016;.  &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; 
&#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2958;&#2984;&#3021;&#2980; &#2990;&#2985;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; 
&#2958;&#2985;&#3021;&#2985;&#3007;&#2986;&#3021;&#2986;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021; &#8212; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994; &#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2970;&#2984;&#3021;&#2980;&#2980;&#3006;&#2992;&#2992;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021; &#8212; &#2986;&#3007;&#2985;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965;
<span class="emphasis"><em>&#2962;&#2992;&#3015; &#2962;&#2992;&#3009;</em></span> &#2986;&#2980;&#3007;&#2997;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016;&#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#2992;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#2985;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2949;&#2985;&#3009;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021; (&#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2949;&#2985;&#3009;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; 
<code class="systemitem">Reply-to</code> &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3016; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2951;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;).  &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3018;&#2994;&#3021;&#2994; &#2997;&#2984;&#3021;&#2980;&#2980;&#3016; &#2970;&#3018;&#2994;&#3021;&#2994;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; 
&#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009; &#2951;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#3010;&#2992; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;:</p><pre class="screen">
To: discuss@some.forum.about.search.indexers
Subject: [ANN] Scanley, a new full-text indexer project.
Reply-to: dev@scanley.org

This is a one-time post to announce the creation of the Scanley
project, an open source full-text indexer and search engine with a
rich API, for use by programmers in providing search services for
large collections of text files.  Scanley is now running code, is
under active development, and is looking for both developers and
testers.

Home page: http://www.scanley.org/

Features:
   - Searches plain text, HTML, and XML
   - Word or phrase searching
   - (planned) Fuzzy matching
   - (planned) Incremental updating of indexes
   - (planned) Indexing of remote web sites
   - (planned) Long-distance mind-reading

Requirements:
   - Python 3.2 or higher
   - SQLite 3.8.1 or higher

For more information, please come find us at scanley.org!

Thank you,
-J. Random
</pre><p>(&#2986;&#3007;&#2985;&#3021;&#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2949;&#2993;&#3007;&#2991;
<a class="xref" href="publicity.html" title="Publicity">the section called &#8220;Publicity&#8221;</a><span> &#2951;&#2985;&#3021;
<a class="xref" href="communications.html" title="Chapter 6. Communications">Chapter 6, <i>Communications</i></a></span> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; &#2986;&#3006;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3021;.)</p><p>&#2951;&#2991;&#2969;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3006; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;/&#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2984;&#2975;&#3016;&#2986;&#3014;&#2992;&#3009;&#2990;&#3021; 
&#2965;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3015;&#2991;&#3015; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2986;&#2994;&#2985;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2965;&#3007;&#2975;&#3016;&#2969;&#3021;&#2965;&#3009;&#2990;&#3006; &#2958;&#2985;&#3021;&#2993; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2953;&#2994;&#2965;&#3007;&#2994;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2984;&#3006;&#2985;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; 
&#2970;&#3007;&#2993;&#2984;&#3021;&#2980;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2958;&#2985;&#3021;&#2985;&#3007; &#2997;&#2984;&#3021;&#2980;&#3015;&#2985;&#3021;, &#2949;&#2980;&#3009; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2996;&#3016;&#2991;&#3006;&#2975;&#3021;&#2975;&#3009; &#2986;&#3018;&#2993;&#3009;&#2994;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3007;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009;
&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2985; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2953;&#2986;&#2991;&#3019;&#2965;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2990;&#3008;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2949;&#2965;&#3021;&#2965;&#2992;&#3016; &#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p><p>&#2949;&#2980;&#3009; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2980;&#2997;&#2992;&#3006;&#2965; &#2986;&#3019;&#2985;&#2980;&#3009;.  &#3000;&#2986;&#3021;&#2997;&#3015;&#2992;&#3021;&#2970;&#2985;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016;, &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2965;&#3009; 
&#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2950;&#2997;&#2979;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2959;&#2980;&#3009;&#2990;&#3021; 
<span class="emphasis"><em>&#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;</em></span> &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2985;&#3019;&#2990;&#3021;.  &#2958;&#2985;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2950;&#2970;&#3021;&#2970;&#3007;&#2992;&#3007;&#2991;&#2984;&#3021;&#2980;&#2992;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2984;&#3021;&#2980; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3015; &#2970;&#3009;&#2993;&#3009;&#2970;&#3009;&#2993;&#3009;&#2986;&#3021;&#2986;&#3006;&#2965; &#2986;&#2969;&#3021;&#2965;&#3006;&#2993;&#3021;&#2993;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2994;&#2992;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993;&#2980;&#3009; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2970;&#3007;&#2993;&#3007;&#2980;&#3009; &#2951;&#2991;&#2969;&#3021;&#2965; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021;  
&#2990;&#3009;&#2985;&#3021;&#2986;&#3015; &#2950;&#2996;&#2990;&#3006;&#2965; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2970;&#3007;&#2994;&#2992;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;&#2992;&#3021;.  &#3000;&#2986;&#3021;&#2997;&#3015;&#2992;&#3021;&#2970;&#2985;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994; 
&#2990;&#3015;&#3006;&#2970;&#3007;&#2994;&#3021;&#2994;&#3006; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3015;&#2991;&#3015; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965; 
&#2986;&#2975;&#3021;&#2975;&#2980;&#3019;&#2975;&#3009; &#2951;&#2985;&#3021;&#2993;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#2965;&#2992;&#2990;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2970;&#3006;&#2985;&#3021;&#2993;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994; &#2953;&#2980;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021;, &#2951;&#2991;&#2969;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009;&#2975;&#2985;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2958;&#2985;&#2980;&#3009; &#2997;&#2994;&#3007;&#2991;&#3009;&#2993;&#3009;&#2980;&#3021;&#2980;&#2994;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2984;&#3006;&#2985;&#3021; &#2986;&#3007;&#2985;&#3021; &#2997;&#3006;&#2969;&#3021;&#2965; &#2984;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3009;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; 
&#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3009; &#2990;&#3007;&#2965; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2949;&#2975;&#3007;&#2980;&#3021;&#2980;&#2994;&#2990;&#3006; &#2953;&#2995;&#3021;&#2995;&#2985;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009;&#2997;&#2992;&#3016; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3016; &#2980;&#2994;&#3021;&#2994;&#3007; &#2986;&#3019;&#2975;&#3009;&#2997;&#2980;&#3009; &#2962;&#2992;&#3009; 
&#2984;&#2994;&#3021;&#2994; &#2997;&#2996;&#3007;&#2965;&#3006;&#2975;&#3021;&#2975;&#2994;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.<sup>[<a name="idp5684848" href="#ftn.idp5684848" class="footnote">24</a>]</sup>.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; 
&#2970;&#3007;&#2994; &#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2992;&#3021;&#2980;&#3021;&#2980;&#2990;&#3009;&#2995;&#3021;&#2995;&#2980;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2984;&#2985;&#3021;&#2965;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; 
&#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2950;&#2997;&#2979;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2962;&#2992;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3015;&#2985;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3015; 
&#2965;&#2992;&#3009;&#2980;&#3009;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;&#8212;&#2949;&#2980;&#3009; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2990;&#2965;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3016; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2984;&#2994;&#3021;&#2994;&#3014;&#2985;&#3021;&#2985;&#2990;&#3021; 
&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009; &#2965;&#3006;&#2975;&#3021;&#2975; &#2959;&#2980;&#3015;&#2990;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3009;&#2994;&#3021;&#2994; &#2962;&#2985;&#3021;&#2993;&#3015;&#2985;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; &#2953;&#2975;&#2985;&#2975;&#3007;&#2991;&#3006;&#2965; &#2965;&#3009;&#2990;&#3021;&#2986;&#2994;&#3006;&#2965; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2994;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965; &#2965;&#3007;&#2975;&#3021;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#3006;&#2980;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980; &#2953;&#2975;&#2985;&#3021; &#2962;&#2992;&#3009; &#2970;&#3007;&#2994; &#2970;&#3006;&#2980;&#3006;&#2992;&#2979; &#2997;&#3007;&#2985;&#3006;&#2965;&#3021;&#2965;&#2995;&#3021; &#2990;&#3021;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994;&#2992;&#3021; &#2970;&#2984;&#3021;&#2980;&#3006; &#2986;&#3014;&#2992;&#3009;&#2997;&#3006;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2984;&#2975;&#3016;&#2986;&#3018;&#2992;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#2997;&#3016; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3015; &#2958;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2984;&#3006;&#2975;&#3021;&#2965;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2994;&#3021;&#2994; &#2970;&#3014;&#2994;&#3021;&#2994; &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#3021;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3008;&#2985;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2965;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3016; &#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021;.  &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2962;&#2992;&#3009; &#2997;&#3007;&#2980;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;.  &#2949;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2986;&#2992;&#2997; &#2990;&#3007;&#2965; &#2984;&#3008;&#2985;&#3021;&#2975; &#2965;&#3006;&#2994;&#3021;&#2990; &#2950;&#2965;&#2994;&#3006;&#2990;&#3021;.  &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2986;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3014;&#2965;&#3009;&#2990;&#2980;&#3007;&#2965;&#2995;&#3016; &#2970;&#3008;&#2992;&#3006;&#2965; &#2980;&#2992;&#3009;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; <span class="emphasis"><em>&#2986;&#2992;&#2997;&#3009;&#2990;&#3021;</em></span>, &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009;&#2985;&#2993;&#3021;&#2984;&#3021;&#2980; &#2984;&#2994;&#3021;&#2994; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2994; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2993;&#3006;&#2965; &#2949;&#2990;&#3016;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3007;&#2997;&#3015;&#2965;&#2990;&#3006;&#2985; &#2980;&#3018;&#2994;&#3016;&#2980;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021;, &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3007;&#2985;&#3021; &#2986;&#3014;&#2991;&#2992;&#3021;&#2990;&#3021; &#2965;&#2997;&#2979;&#3007;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2980; &#2990;&#3007;&#2965; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985; &#2970;&#2990;&#3010;&#2965;&#2990;&#3006;&#2965; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2997;&#2995;&#2992;&#2970;&#3021;&#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021;.  &#2949;&#2975;&#3009;&#2980;&#3021;&#2980; &#2949;&#2980;&#3021;&#2991;&#3006;&#2991;&#2990;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2970;&#3010;&#2996;&#2994;&#3007;&#2994;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2986;&#2985;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#2980;&#3009;.</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp5684848" href="#idp5684848" class="para">24</a>] </sup><span class="emphasis"><em>&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;</em></span> &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2980;&#3007;&#2975;&#3021;&#2975; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2986;&#3007;&#2985;&#3021; &#2984;&#3008;&#2985;&#3021;&#2975; &#2951;&#2975;&#3016;&#2997;&#3015;&#2995;&#3016;&#2965;&#3021;&#2965;&#3009; &#2986;&#3007;&#2985;&#3021;&#2986;&#3009; &#2997;&#2992;&#3009;&#2997;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#2997;&#2979;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 
&#2965;&#3018;&#2994;&#3021;&#2965;.  &#2958;&#2985;&#2980;&#3009; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2950;&#2994;&#3019;&#2970;&#2985;&#3016;&#2991;&#3016; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2980;&#2984;&#3021;&#2980;&#2980;&#3006;&#2965; &#2958;&#2985;&#3021;&#2985; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021; &#8212; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2990;&#2965;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; 
&#2949;&#2985;&#3009;&#2965;&#2965;&#3021; &#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3006;&#2965; &#2949;&#2980;&#2985;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3015; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2949;&#2980;&#2985;&#3016; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3009; 
&#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2997;&#3015;&#2992;&#3009; &#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; 
<a class="xref" href="setting-tone.html#be-open-from-day-one" title="&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;">the section called &#8220;&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;&#8221;</a> &#2960; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="setting-tone.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="technical-infrastructure.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2980;&#3018;&#2985;&#3007; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</td></tr></table></div></body></html>
