<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="social-infrastructure.html" title="Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><link rel="prev" href="social-infrastructure.html" title="Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><link rel="next" href="written-rules.html" title="&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2997;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="social-infrastructure.html">Prev</a> </td><th width="60%" align="center">Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</th><td width="20%" align="right"> <a accesskey="n" href="written-rules.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="consensus-democracy"></a>&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;</h2></div></div></div><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3014;&#2965;&#3009;&#2984;&#3006;&#2975;&#3021;&#2965;&#2995;&#3006;&#2965; &#2951;&#2991;&#2969;&#3021;&#2965;&#3007;&#2997;&#2992;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2997;&#3016; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2994;&#2965;&#3007;, &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007; &#2984;&#2965;&#2992;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3006;&#2985; &#2997;&#3014;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009;, &#2951;&#2980;&#2993;&#3021;&#2965;&#3009; &#2965;&#3006;&#2992;&#2979;&#2990;&#2994;&#3021;&#2994;. &#2953;&#2991;&#3007;&#2992;&#3007;&#2991;&#2994;&#3021; &#2992;&#3008;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2962;&#2986;&#3021;&#2986;&#3009;&#2984;&#3019;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2965;&#3009;&#2996;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2950;&#2975;&#3021;&#2970;&#3007;&#2990;&#3009;&#2993;&#3016;, &#2986;&#2992;&#3007;&#2979;&#3006;&#2990; &#2992;&#3008;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2984;&#3007;&#2994;&#3016;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2962;&#2992;&#3009; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007; &#2980;&#2985;&#3021; &#2986;&#2980;&#2997;&#3007;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2994;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#2980;&#3009;&#2990;&#3021;, &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3016; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3007;&#2975;&#3016;&#2991;&#3015; &#2970;&#3008;&#2992;&#3006;&#2965; &#2986;&#2992;&#2986;&#3021;&#2986;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3016;&#2991;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991;, &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#2993;&#3021;&#2993; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3006;&#2965; &#2949;&#2990;&#3016;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2970;&#3007;&#2994; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3006;&#2990;&#2994;&#3021; &#2986;&#3019;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021;&#2984;&#3021;&#2980;&#3015;&#2991;&#3006;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3018;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021;&#2984;&#3021;&#2980;&#2986;&#3007;&#2985;&#3021;&#2986;&#3009;, &#2949;&#2980;&#3016;&#2980;&#3021; &#2949;&#2992;&#3007;&#2980;&#3006;&#2965;&#2997;&#3015; &#2980;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2986;&#3021;&#2986;&#3014;&#2993;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3018;&#2980;&#3009; &#2949;&#2993;&#3007;&#2997;&#3016;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2951;&#2980;&#3016; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. 10 &#2986;&#3015;&#2992;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#2975;&#3021;&#2970;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;, &#2990;&#3008;&#2980;&#2990;&#3009;&#2995;&#3021;&#2995; 9 &#2986;&#3015;&#2992;&#3009;&#2990;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#3016;&#2991; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#3016; &#2965;&#3009;&#2993;&#3016;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021; &#2958;&#2985;&#3021;&#2993;&#3015; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021;. &#2990;&#2985;&#3007;&#2980;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2986;&#2994;&#2985;&#3006;&#2965;&#2965;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#3021; &#2984;&#3007;&#2986;&#2984;&#3021;&#2980;&#2985;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2975;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3006;&#2965;&#2997;&#3015; &#2949;&#2990;&#3016;&#2991;&#3009;&#2990;&#3021;: &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2994;&#3021; &#2984;&#3007;&#2991;&#2990;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021;. &#2949;&#2997;&#2992;&#3016; &#2986;&#2980;&#2997;&#3007;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2949;&#2965;&#2993;&#3021;&#2993;&#2997;&#3009;&#2990;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2994;&#3021; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;. &#2950;&#2965;&#2997;&#3015;, &#2962;&#2992;&#3009; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3007;&#2985;&#3021; &#2980;&#2994;&#3016;&#2990;&#3016;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;, &#2965;&#3009;&#2996;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2980;&#2994;&#3016;&#2990;&#3016;&#2991;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007; &#2962;&#2992;&#3009; &#2965;&#3009;&#2996;&#3009; &#2984;&#2965;&#2992;&#3021;&#2984;&#3021;&#2980; &#2986;&#3007;&#2993;&#2965;&#3009;, &#2949;&#2980;&#3009; &#2949;&#2992;&#3007;&#2980;&#3006;&#2965;&#2997;&#3015; &#2986;&#2996;&#3016;&#2991; &#2984;&#3007;&#2994;&#3016;&#2965;&#3021;&#2965;&#3009; &#2990;&#3006;&#2993;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2997;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#2995;&#2997;&#3007;&#2994;&#3021; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2965;&#3021;&#2965;&#3010;&#2993;&#3009;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;: &#2990;&#3009;&#2980;&#2994;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p><p>&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2980;&#3021;&#2980;&#3016;&#2991;&#3015; <em class="firstterm">&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;</em> &#2958;&#2985;&#3021;&#2965;&#3007;&#2993;&#3019;&#2990;&#3021;. &#2951;&#2980;&#3009; &#2962;&#2992;&#3009; &#2980;&#3014;&#2995;&#3007;&#2997;&#2993;&#3021;&#2993; &#2984;&#3007;&#2994;&#3016;&#2991;&#2994;&#3021;&#2994;: &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3006;&#2965; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2997;&#3015;&#2993;&#3009;&#2991;&#3006;&#2992;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2950;&#2975;&#3021;&#2970;&#3015;&#2986;&#3007;&#2965;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021;. &#2949;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991;&#3009;&#2990;&#3021; &#2984;&#2986;&#2992;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2997;&#3007;&#2995;&#3016;&#2997;&#3006;&#2965; &#2958;&#2985;&#3021;&#2985;&#3014;&#2985;&#3021;&#2985; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3009;&#2990;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3015; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2962;&#2992;&#3009; &#2997;&#2996;&#3009;&#2997;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#3009;&#2993;&#3016;&#2991;&#3014;&#2980;&#3009;, &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3007;&#2991;&#2994;&#3021;&#2986;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#3015;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006; &#2951;&#2994;&#3021;&#2994;&#3016;&#2991;&#3006;, &#2951;&#2975;&#3016;&#2990;&#3009;&#2965;&#2969;&#3021;&#2965;&#2995;&#3016; &#2958;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2950;&#2997;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2986;&#3019;&#2985;&#3021;&#2993;&#2997;&#3016; &#2951;&#2997;&#2993;&#3021;&#2993;&#3009;&#2995;&#3021; &#2949;&#2975;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2984;&#3009;&#2975;&#3021;&#2986;&#2990;&#3021;&#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2980;&#2975;&#3016;&#2991;&#3007;&#2985;&#3021;&#2993;&#3007; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2950;&#2975;&#3021;&#2970;&#3007;&#2990;&#3009;&#2993;&#3016; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3007;&#2994;&#3021;, &#2958;&#2984;&#3021;&#2980; &#2990;&#3006;&#2992;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#3014;&#2994;&#3021;&#2994;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985; &#2962;&#2992;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2990;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#3006;&#2980;&#3009;. &#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; &#2962;&#2992;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2991;&#3006;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021;, &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3009;&#2975;&#3007;&#2997;&#3016;&#2991;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2997;&#3006;&#2992;&#3021;. &#2951;&#2980;&#3009;&#2997;&#3015;, &#2980;&#2985;&#2980;&#3009; &#2950;&#2975;&#3021;&#2970;&#3015;&#2986;&#2985;&#3016;&#2991;&#3016; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2965;&#2975;&#3016;&#2970;&#3007; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3006;&#2965;&#3009;&#2990;&#3021;.</p><p>&#2970;&#3007;&#2993;&#3007;&#2991;, &#2970;&#2992;&#3021;&#2970;&#3021;&#2970;&#3016;&#2965;&#2995;&#2993;&#3021;&#2993; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2997;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2962;&#2985;&#3021;&#2993;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2962;&#2992;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;, &#2997;&#2996;&#3009;&#2997;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2980;&#3008;&#2992;&#3021;&#2997;&#3016; &#2953;&#2975;&#2985;&#2975;&#3007;&#2991;&#3006;&#2965; &#2984;&#3007;&#2992;&#2994;&#3007;&#2994;&#3021; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2980;&#3009;&#2997;&#3015; &#2949;&#2984;&#3021;&#2980; &#2997;&#2996;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2997;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;: &#8220;&#2951;&#2984;&#3021;&#2980; &#2997;&#2996;&#3009; &#2984;&#3008;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016; &#2951;&#2980;&#3009;&#2980;&#3006;&#2985;&#3014;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3006;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2959;&#2993;&#3021;&#2965;&#3007;&#2993;&#3019;&#2990;&#3021; &#2958;&#2985; &#2984;&#3006;&#2985;&#3021; &#2965;&#2992;&#3009;&#2980;&#3009;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;&#8221;. &#2951;&#2984;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021; &#2965;&#3010;&#2993;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;; &#2997;&#2996;&#3009;&#2997;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2980;&#3008;&#2992;&#3021;&#2997;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021;. &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#2993;&#3021;&#2993; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2986;&#3021;&#2986;&#3009;&#2980;&#2994;&#3016;&#2991;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3020;&#2985;&#2990;&#3021; &#2970;&#2990;&#3021;&#2990;&#2980;&#2990;&#3006;&#2965; &#2959;&#2993;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016;, <span class="emphasis"><em>&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3006;&#2965; &#2990;&#3006;&#2993;&#3006;&#2980;</em></span> &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2962;&#2986;&#3021;&#2986;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2984;&#3007;&#2992;&#2994;&#3021;&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2984;&#3007;&#2965;&#2996;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#2965;&#3021;&#2965;&#2992;&#3009;&#2980;&#3007;, &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2965;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2984;&#3007;&#2992;&#2994;&#3021;&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3016; &#2984;&#3007;&#2965;&#2996;&#3006;&#2980;&#2997;&#3018;&#2985;&#3021;&#2993;&#3006;&#2965; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2965;&#2992;&#3009;&#2980;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2949;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#2992;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.</p><div class="sect2" title="&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2963;&#2991;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="version-control-relaxation"></a>&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2963;&#2991;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;</h3></div></div></div><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2984;&#3007;&#2992;&#2994;&#3021; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2958;&#2975;&#3021;&#2975;&#2994;&#3006;&#2990;&#3021;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2997;&#2992;&#3021; &#2958;&#2985;&#2965;&#3021;&#2965;&#2992;&#3009;&#2980;&#3007; &#2962;&#2992;&#3009; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021; &#2962;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007;&#2980;&#3021;&#2980;&#3009;, &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2958;&#2996;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2962;&#2992;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2984;&#2975;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985;&#2997;&#3018;&#2985;&#3021;&#2993;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965;, &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2990;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2990;&#3009;&#2984;&#3021;&#2980;&#3016;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965;&#3006;&#2990;&#2994;&#3021; &#2986;&#3019;&#2985;&#2980;&#2993;&#3021;&#2965;&#3009; &#2997;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#3009; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3021;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2990;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2997;&#2992;&#3006;&#2994;&#3021;, &#2997;&#3007;&#2997;&#3006;&#2980;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#2992;&#3021; &#2984;&#2975;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2965;&#3006;&#2979;&#2990;&#3009;&#2975;&#3007;&#2991;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2951;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2997;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#3018;&#2985;&#3007;, &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007;&#2980;&#3021;&#2980;&#2986;&#3007;&#2985;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3006;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3006; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2990;&#3006;&#2993;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2984;&#3007;&#2965;&#2996;&#3021;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#3007;&#2993; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2965;&#2996;&#3006;&#2980; &#2997;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2980;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2986;&#3021;&#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2990;&#3019;&#2970;&#2990;&#3006;&#2985; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2997;&#2970;&#2992; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2980;&#3007;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2985;&#3016; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2990;&#3009;&#2993;&#3016;&#2990;&#3016;&#2965;&#2995;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021;, &#2962;&#2992;&#3009; &#2997;&#3015;&#2994;&#3016;&#2991;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965;, &#2958;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; &#2986;&#3007;&#2985;&#3021;&#2985;&#3010;&#2975;&#3021;&#2975;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3014;&#2985;&#3021;&#2986;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#3009;&#2979;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3016; &#2984;&#2990;&#3021;&#2986;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2980;&#3021;&#2980;&#3016; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2986;&#3014;&#2993;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p><p>&#2951;&#2980;&#2985;&#3006;&#2994;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2958;&#2975;&#3021;&#2975;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;, &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2979;&#2992;&#3021;&#2997;&#3009; &#2992;&#3008;&#2980;&#3007;&#2991;&#3007;&#2994;&#3015;&#2991;&#3015; &#2951;&#2980;&#2985;&#3016; &#2965;&#3016;&#2991;&#3006;&#2995;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2970;&#3007;&#2993;&#3007;&#2991; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2959;&#2980;&#3009;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2949;&#2995;&#2997;&#3007;&#2994;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021;, &#2970;&#3007;&#2994;&#2992;&#2980;&#3009; &#2962;&#2986;&#3021;&#2986;&#3009;&#2980;&#2994;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2986;&#3014;&#2993;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2984;&#3007;&#2992;&#2994;&#3007;&#2985;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2985;&#3021; &#2984;&#3007;&#2994;&#3016;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3016; &#2986;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#2997;&#2994;&#3021;&#2994;, &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2980;&#3021;&#2980;&#2965;&#3009;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2958;&#2975;&#3021;&#2975;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021; &#2963;&#2992;&#3007;&#2992;&#3009; &#2984;&#3006;&#2975;&#3021;&#2965;&#2995;&#3021; &#2965;&#3006;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;. &#2962;&#2992;&#3009; &#2970;&#3007;&#2994;&#2992;&#3021; &#2949;&#2975;&#3007;&#2965;&#3021;&#2965;&#2975;&#3007; &#2980;&#2985;&#2980;&#3009; &#2990;&#3007;&#2985;&#3021;&#2985;&#2974;&#3021;&#2970;&#2994;&#3016; &#2965;&#2997;&#2985;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965;, &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2953;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2962;&#2980;&#3009;&#2965;&#3021;&#2965;&#3007;&#2997;&#3007;&#2975;&#2965;&#3021;&#2965;&#3010;&#2975;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3015; &#2951;&#2980;&#2993;&#3021;&#2965;&#3009; &#2965;&#3006;&#2992;&#2979;&#2990;&#3021;.</p><p>&#2950;&#2965;&#3016;&#2991;&#3006;&#2994;&#3021;, &#2958;&#2985;&#3021;&#2985; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3021;&#2993;&#3009; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2953;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2949;&#2993;&#3007;&#2991;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2980;&#2991;&#2965;&#3021;&#2965;&#2990;&#3007;&#2985;&#3021;&#2993;&#3007; &#2949;&#2980;&#3016; &#2949;&#2997;&#2992;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2984;&#3007;&#2992;&#2994;&#3021;&#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;, &#2997;&#2994;&#3016;&#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2950;&#2997;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2980;&#2994;&#3021; &#2986;&#3019;&#2985;&#3021;&#2993; &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2970;&#2992;&#3021;&#2970;&#3021;&#2970;&#3016;&#2991;&#2993;&#3021;&#2993; &#2997;&#3007;&#2975;&#2991;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2980;&#3009; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;. &#2962;&#2992;&#3007;&#2970;&#3007;&#2994; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;, &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2993;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2951;&#2997;&#2993;&#3021;&#2993;&#3016; &#2962;&#2997;&#3021;&#2997;&#3018;&#2985;&#3021;&#2993;&#3006;&#2965; &#2965;&#3016;&#2991;&#3006;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965;, &#2990;&#3009;&#2992;&#2975;&#3021;&#2975;&#3009;&#2980;&#3021;&#2980;&#2985;&#2990;&#3006;&#2985; &#2984;&#2975;&#2980;&#3021;&#2980;&#3016;&#2991;&#3016; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3006;&#2980;&#3009;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2997;&#3007;&#2975;&#2991;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2975;&#2991;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; (&#2980;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3021;&#2986;&#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; &#2965;&#3010;&#2975;), &#2953;&#2995;&#2997;&#3007;&#2991;&#2994;&#3021;&#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2985; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985;&#3019;&#2992;&#3021;, &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2953;&#2980;&#3021;&#2997;&#3015;&#2965;&#2980;&#3021;&#2980;&#3019;&#2975;&#3009; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009;&#2975;&#3016;&#2991;&#2980;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3016;&#2997;&#3007;&#2975;, &#2949;&#2980;&#3016; &#2980;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3021;&#2986;&#2986;&#3014;&#2993;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2980;&#2991;&#2969;&#3021;&#2965;&#3009;&#2997;&#2992;&#3021;. &#2951;&#2980;&#2985;&#3016; &#2980;&#2997;&#2993;&#3006;&#2965; &#2962;&#2992;&#3009; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;, &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2970;&#2992;&#3021;&#2970;&#3021;&#2970;&#3016;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2991; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3016;&#2965;&#3021;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#3009;&#2965;&#3006;&#2992;&#2995;&#3007;&#2980;&#3021;&#2980;&#3009;, &#2997;&#3007;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3021;&#2993;&#2990;&#3021; &#2980;&#3014;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016;, &#2949;&#2984;&#3021;&#2984;&#3007;&#2992;&#2994;&#2992;&#3016; &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#2992;&#2984;&#3007;&#2992;&#3021;&#2979;&#2991;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2953;&#2975;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p></div><div class="sect2" title="&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2975;&#3021;&#2975;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2986;&#3019;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="voting"></a>&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2975;&#3021;&#2975;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2986;&#3019;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;</h3></div></div></div><p>&#2970;&#3007;&#2994; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2958;&#2975;&#3021;&#2975;&#3006;&#2990;&#2994;&#3021; &#2986;&#3019;&#2997;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2962;&#2992;&#3009; &#2990;&#3009;&#2975;&#3021;&#2975;&#3009;&#2965;&#3021;&#2965;&#2975;&#3021;&#2975;&#3016;&#2991;&#3006;&#2985; &#2984;&#3007;&#2994;&#3016;&#2991;&#3016; &#2970;&#2990;&#3006;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2965;&#2995;&#3009;&#2990;&#3021; &#2980;&#3019;&#2994;&#3021;&#2997;&#3007;&#2991;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3015; &#2980;&#3008;&#2992;&#3021;&#2997;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009;, &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2985; &#2980;&#3014;&#2992;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2969;&#3021;&#2965;&#3015;&#2991;&#3009;&#2990;&#3021;, &#2984;&#3009;&#2975;&#3021;&#2986;&#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;&#2991;&#3019;&#2975;&#3009; &#2980;&#2993;&#3021;&#2970;&#3014;&#2991;&#2994;&#3006;&#2965; &#2951;&#2979;&#3016;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021;, &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985; &#2986;&#2985;&#3021;&#2990;&#3009;&#2965;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016;&#2965;&#3018;&#2979;&#3021;&#2975; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#2995;&#3016; &#2953;&#2995;&#3021;&#2995;&#2975;&#2965;&#3021;&#2965;&#3007;&#2991;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; &#2963;&#2992;&#3007;&#2992;&#3009;&#2997;&#2992;&#3021; <em class="firstterm">&#2984;&#3015;&#2992;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#2992;&#2965;&#2992;&#3006;&#2965;</em> &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2997;&#2992;&#3021;: &#2951;&#2975;&#3016;&#2991;&#3007;&#2975;&#3016;&#2991;&#3015;, &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3016; &#2970;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; &#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;, &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3016;&#2991;&#2986;&#3021;&#2986;&#3009;&#2995;&#3021;&#2995;&#3007;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#2979;&#3021;&#2965;&#3006;&#2979;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3021;&#2993;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009;&#2997;&#2992;&#3009;&#2990;&#3021; &#2949;&#2995;&#2997;&#3007;&#2975;&#3021;&#2975;&#3009; &#2949;&#2993;&#3007;&#2991;&#2997;&#3009;&#2990;&#3021;, &#2990;&#3008;&#2980;&#2990;&#3009;&#2995;&#3021;&#2995; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2984;&#3007;&#2985;&#3016;&#2997;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3009;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2953;&#2980;&#2997;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3006;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2951;&#2984;&#3021;&#2980; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3015;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2970;&#3021;&#2970;&#3008;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2984;&#3015;&#2992;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#2992;&#2965;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2979;&#3007;&#2991;&#3016; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021;, &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2970;&#2990;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2949;&#2996;&#3016;&#2986;&#3021;&#2986;&#3016; &#2997;&#3007;&#2975;&#3009;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#2980;&#3009; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2970;&#3021;&#2970;&#3008;&#2975;&#3021;&#2975;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2980;&#2991;&#3006;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2992;&#3021;. &#2951;&#2980;&#3021;&#2980;&#2992;&#2965;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; &#2986;&#3007;&#2993;&#2992;&#3007;&#2985;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#3009;, &#2949;&#2980;&#3016; &#2986;&#3007;&#2992;&#2980;&#3007;&#2986;&#2994;&#3007;&#2986;&#3021;&#2986;&#2980;&#3019;&#2975;&#3009;, &#2980;&#2985;&#2980;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2986;&#3006;&#2965;&#3009;&#2986;&#3006;&#2975;&#3009; &#2959;&#2993;&#3021;&#2986;&#2975;&#3006;&#2990;&#2994;&#3021;, &#2984;&#2975;&#3009;&#2984;&#3007;&#2994;&#3016;&#2991;&#3019;&#2975;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2994;&#3016;&#2991;&#3016; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;&#2997;&#2992;&#3016;, &#2951;&#2980;&#3021;&#2980;&#2992;&#2965;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2965;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2994;&#2965;&#3007;&#2991;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;.</p><p>&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2970;&#3021;&#2970;&#3008;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2953;&#2995;&#3021;&#2995;&#2975;&#2965;&#3021;&#2965;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2970;&#2992;&#3021;&#2970;&#3021;&#2970;&#3016;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2991;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#3007;&#2994;&#3016;&#2991;&#3016; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2958;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2970;&#3007;&#2994; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3007;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3009;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2991;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2970;&#3007;&#2994;&#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2991;&#3006;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2970;&#3021;&#2970;&#3008;&#2975;&#3021;&#2975;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2997;&#3015; &#2950;&#2975;&#3021;&#2970;&#3015;&#2986;&#2985;&#3016; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2992;&#3021;. &#2970;&#3007;&#2994;&#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2997;&#2992;&#2980;&#3009; &#2965;&#2997;&#2994;&#3016; &#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2962;&#2992;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2980;&#3014;&#2992;&#3007;&#2997;&#3009; &#2997;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2965; &#2997;&#3007;&#2997;&#2992;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3006;&#2990;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2990;&#2993;&#3021;&#2993; &#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2980;&#2985;&#2980;&#3009; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2958;&#2980;&#3007;&#2992;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;, &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2997;&#3018;&#2985;&#3021;&#2993;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2991;&#2994;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2980;&#2975;&#3016;&#2965;&#2995;&#3016; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#2990;&#3006;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985; <a class="xref" href="difficult-people.html" title="Difficult People">the section called &#8220;Difficult People&#8221;</a><span>&#2951;&#2986;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021;<a class="xref" href="communications.html" title="Chapter 6. Communications">Chapter 6, <i>Communications</i></a></span> &#2949;&#2993;&#3007;&#2991;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2990;&#2993;&#2965;&#3021;&#2965;&#3006;&#2990;&#2994;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2986;&#2994;&#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;, &#2958;&#2984;&#3021;&#2980; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2980;&#2997;&#2993;&#3006;&#2985; &#2949;&#2985;&#3009;&#2990;&#3006;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; <em class="firstterm">&#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;</em> &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2980;&#3007;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3006;&#2995;&#2992;&#3021;, &#2980;&#3006;&#2985;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#3014;&#2992;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2984;&#3021;&#2980; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2997;&#3007;&#2997;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;&#2990;&#3021;, &#2951;&#2980;&#3007;&#2994;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2958;&#2979;&#3021;&#2979;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2990;&#2993;&#3021;&#2993; &#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2997;&#3007;&#2975; &#2958;&#2995;&#3007;&#2990;&#3016;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.&#2986;&#3007;&#2993; &#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2986;&#3021;&#2986;&#3019;&#2994; &#2949;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3015;&#2991;&#3018;&#2992;&#3009; &#2970;&#3009;&#2993;&#3021;&#2993;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#3009;&#2990;&#3021;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007; <a class="ulink" href="http://en.wikipedia.org/wiki/Voting_system" target="_top">en.wikipedia.org/wiki/Voting_system</a> &#2951;&#2997;&#3021;&#2997;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2958;&#2984;&#3021;&#2980; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3021;&#2986;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2984;&#3008;&#2979;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;. &#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2984;&#3007;&#2991;&#3006;&#2991;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;, &#2991;&#3006;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2951;&#2990;&#3021;&#2990;&#3009;&#2993;&#3016;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2994;&#3021; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2986;&#3018;&#2980;&#3009;&#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2951;&#2992;&#2965;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3009;&#2990;&#3021;, &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3016; &#2990;&#2975;&#2994;&#3006;&#2975;&#2993;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2949;&#2985;&#3009;&#2986;&#3021;&#2986;&#2970;&#3021;&#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021;, &#2962;&#2992;&#3009; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3006;&#2995;&#2992;&#3006;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3016; &#2970;&#2992;&#3007;&#2970;&#3014;&#2991;&#3021;&#2980;&#3009;, &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2970;&#2992;&#3007;&#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;. &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2997;&#3007;&#2997;&#2992;&#2969;&#3021;&#2965;&#2995;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2997;&#3016;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.</p></div><div class="sect2" title="&#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="when-to-vote"></a>&#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;</h3></div></div></div><p>&#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985; &#2997;&#3007;&#2975;&#2991;&#2990;&#3021;, &#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2980;&#3006;&#2985;&#3021;. &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2992;&#3007;&#2980;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2990;&#2993;&#3021;&#2993; &#2953;&#2980;&#3021;&#2980;&#3007;&#2965;&#2995;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2980;&#3019;&#2994;&#3021;&#2997;&#3007;&#2991;&#2975;&#3016;&#2984;&#3021;&#2980;&#2980; &#2986;&#3007;&#2993;&#2965;&#3009;, &#2965;&#2975;&#3016;&#2970;&#3007; &#2953;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2965; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009; &#2965;&#3006;&#2979;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3009;&#2993;&#3016;&#2991;&#2985;&#3021;&#2993;&#3009;. &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2975;&#3007;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2950;&#2965;&#3021;&#2965;&#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2985; &#2970;&#3007;&#2984;&#3021;&#2980;&#2985;&#3016;&#2991;&#3016; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016;, &#2991;&#3006;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#3021;&#2965;&#3009;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991; &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016; &#2965;&#2979;&#3021;&#2975;&#2993;&#3007;&#2991; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2990;&#3007;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2997;&#3007;&#2991;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2949;&#2975;&#3007;&#2965;&#3021;&#2965;&#2975;&#3007; &#2951;&#2990;&#3021;&#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3006;&#2985; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2962;&#2992;&#3009; &#2953;&#2991;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;&#2995;&#3021;&#2995; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2970;&#3007;&#2984;&#3021;&#2980;&#2985;&#3016;&#2965;&#3021;&#2965;&#3009; &#2997;&#3007;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#3009;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991; &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991; &#2997;&#2996;&#3007;&#2997;&#2965;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2970;&#2990;&#2992;&#2970;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2997;&#2996;&#3007;&#2997;&#2965;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3016; &#2997;&#3007;&#2975; &#2970;&#2990;&#2992;&#2970;&#2990;&#2975;&#3016;&#2997;&#2980;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980;&#2980;&#3009;. &#2970;&#2990;&#2992;&#2970;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#2965;&#3009;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2980;&#3007; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#2965;&#3009;, &#2970;&#3007;&#2994;&#2992;&#3021; &#2949;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2980;&#3007;&#2991;&#2975;&#3016;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985;&#3019;&#2992;&#3021; &#2990;&#2965;&#3007;&#2996;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3006;&#2965;&#2997;&#3015; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2984;&#3007;&#2994;&#3016;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2990;&#3009;&#2984;&#3021;&#2980;&#3016;&#2991; &#2984;&#3007;&#2994;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#2980;&#3009;: &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2986;&#2975;&#3021;&#2970;&#2990;&#3021;, &#2980;&#2985;&#2980;&#3009; &#2997;&#2992;&#3009;&#2980;&#3021;&#2980;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;  &#2963;&#2992;&#2995;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2952;&#2975;&#3009;&#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2958;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993; &#2953;&#2979;&#2992;&#3021;&#2997;&#3016; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2980;&#2985;&#3021;&#2985;&#3016;&#2986;&#3021;&#2986;&#3019;&#2994;&#2997;&#3015; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2980;&#3007;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2963;&#2992;&#2995;&#2997;&#3009; &#2950;&#2993;&#3009;&#2980;&#2994;&#3016;&#2980;&#3021;&#2980;&#2992;&#3009;&#2990;&#3021;.</p><p>&#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3008;&#2992;&#3021;&#2997;&#2995;&#3007;&#2980;&#3021;&#2980;&#3009;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3007;&#2970;&#3021;&#2970;&#3014;&#2994;&#3021;&#2994;&#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3015; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2984;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;, &#2986;&#2965;&#3009;&#2980;&#3021;&#2980;&#2993;&#3007;&#2997;&#3009;&#2990;&#3007;&#2965;&#3021;&#2965; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985;&#3019;&#2992;&#3007;&#2985;&#3021; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3021;&#2980;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007; &#2949;&#2985;&#3016;&#2997;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021; &#2984;&#2965;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3009;&#2995;&#3021;&#2995;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#3006;&#2979; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2990;&#3006;&#2993;&#3006;&#2965;, &#2951;&#2980;&#3009;&#2997;&#2992;&#3016; &#2950;&#2994;&#3019;&#2970;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2950;&#2992;&#3006;&#2991;&#3021;&#2997;&#2992;&#3021;. &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2980;&#2985;&#2980;&#3009; &#2950;&#2992;&#2990;&#3021;&#2986; &#2984;&#3007;&#2994;&#3016;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2951;&#2993;&#2969;&#3021;&#2965;&#3007;&#2997;&#2984;&#3021;&#2980;&#3009; &#2970;&#2990;&#2992;&#2970;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2985;&#3016;&#2997;&#2992;&#3021;. &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2986;&#2992;&#3009;&#2997;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965;, &#2949;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2986;&#2994; &#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;. &#8220;&#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3009; &#2959;&#2980;&#3009;&#2997;&#3006;&#2985; &#2984;&#3007;&#2994;&#3016;&#2991;&#3016; &#2984;&#3006;&#2990;&#3021; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2958;&#2975;&#3021;&#2975;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#8221; &#2958;&#2985; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2951;&#2984;&#3021;&#2980; &#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3009;&#2995;&#3021; &#2990;&#3007;&#2965; &#2958;&#2995;&#3007;&#2980;&#3006;&#2985;&#2980;&#3009;&#2990;&#3021;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#2980;&#3009;&#2990;&#3021; &#2950;&#2965;&#3009;&#2990;&#3021;. &#2990;&#3006;&#2993;&#3021;&#2993;&#3006;&#2965;, &#2990;&#3009;&#2993;&#3016;&#2970;&#3006;&#2992;&#3006; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#2994;&#3006;&#2990;&#3021;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2980;&#3006;&#2985;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975; &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2950;&#2980;&#2992;&#2997;&#3006;&#2965; &#2965;&#3016;&#2965;&#2995;&#3016; &#2953;&#2991;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021;,&#2990;&#2993;&#3021;&#2993; &#2986;&#3007;&#2993; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3016; &#2950;&#2980;&#2992;&#3007;&#2986;&#3021;&#2986;&#3019;&#2992;&#3021;, &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2970;&#2990;&#2992;&#2970;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2953;&#2975;&#2985;&#3021;&#2986;&#2975; &#2950;&#2991;&#2980;&#3021;&#2980;&#2990;&#3006;&#2991;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2992;&#3021;. &#2951;&#2980;&#2985;&#3021;&#2990;&#3010;&#2994;&#2990;&#3021; &#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2985; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3008;&#2992;&#3021;&#2997;&#3016;&#2991;&#3019;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2986;&#2996;&#3016;&#2991; &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016; &#2986;&#3009;&#2980;&#3007;&#2991; &#2965;&#3019;&#2979;&#2980;&#3021;&#2980;&#3007;&#2994;&#3019; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2992;&#3016;&#2986;&#3021;&#2986;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021;, &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3016; &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#3009;, &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3009; &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2950;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2965; &#2952;&#2975;&#3009;&#2986;&#2975;&#2997;&#3016;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.</p><p>&#2970;&#3007;&#2994; &#2949;&#2992;&#3007;&#2980;&#3006;&#2985; &#2980;&#2992;&#3009;&#2979;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2970;&#2990;&#2992;&#2970;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2965;&#3010;&#2975;&#3007;&#2991; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021;, &#2970;&#2990;&#2992;&#2970;&#2990;&#2993;&#3021;&#2993; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3016; &#2997;&#3007;&#2975; &#2990;&#3019;&#2970;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3016; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2997;&#2992;&#3021;. &#2949;&#2980;&#3021;&#2980;&#2992;&#3009;&#2979;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3007;&#2975;&#2990;&#3021; &#2949;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2980;&#3007; &#2990;&#3007;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2984;&#3007;&#2992;&#3006;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2986;&#3019;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2997;&#2970;&#2992; &#2949;&#2997;&#2970;&#2992;&#2990;&#3006;&#2965; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2984;&#2975;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#3010;&#2975;&#3006;&#2980;&#3009;. &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007;&#2991; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3021; &#2980;&#3006;&#2985;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2993;&#3007;&#2997;&#3010;&#2975;&#3021;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2958;&#2985;&#2997;&#3015;, &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2953;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3016; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2980;&#2992;&#2980;&#3021;&#2980;&#3016; &#2965;&#3009;&#2993;&#3016;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;.</p><p>(&#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2984;&#2975;&#2980;&#3021;&#2980; &#2980;&#2991;&#2969;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2949;&#2993;&#3007;&#2997;&#3009;&#2992;&#3016;, <a class="xref" href="stabilizing-a-release.html" title="Stabilizing a Release">the section called &#8220;Stabilizing a Release&#8221;</a><span>&#2951;&#2969;&#3021;&#2965;&#3015;<a class="xref" href="development-cycle.html" title="Chapter 7. Packaging, Releasing, and Daily Development">Chapter 7, <i>Packaging, Releasing, and Daily Development</i></a></span> &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;, &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;&#2965;&#3021;&#2965;&#3009;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2980;&#3009;. &#2951;&#2969;&#3021;&#2965;&#3015;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;, &#2962;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2980;&#2985;&#2980;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009;&#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2962;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2958;&#2980;&#3021;&#2980;&#2985;&#3016; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2969;&#3021;&#2965;&#2995;&#3016;&#2986;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985; &#2949;&#2993;&#3007;&#2991;&#2994;&#3006;&#2990;&#3021;.)</p></div><div class="sect2" title="&#2991;&#3006;&#2992;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?"><div class="titlepage"><div><div><h3 class="title"><a name="electorate"></a>&#2991;&#3006;&#2992;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?</h3></div></div></div><p>&#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007; &#2949;&#2980;&#2985;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016;&#2986;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#2980;&#3009;: &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009; &#2991;&#3006;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;? &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2949;&#2980;&#3007;&#2965; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2995;&#3021;&#2995;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021; &#2970;&#3007;&#2994; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991;&#2980;&#3021;&#2980;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021;,  &#2951;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2953;&#2979;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3006;&#2965; &#2990;&#3006;&#2993; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.</p><p>&#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2962;&#2992;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3016; (&#2984;&#3007;&#2992;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2949;&#2985;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021;) &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2997;&#3016;&#2980;&#3021;&#2980;&#3009;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2990;&#3016;&#2991;&#3016; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2962;&#2992;&#3009; &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2970;&#3007;&#2994; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2990;&#3021;, &#2970;&#3007;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2965;&#3009;&#2980;&#3007; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2990;&#3021; &#2949;&#2995;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2958;&#2980;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2995;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3019;, &#2949;&#2980;&#3015; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2986;&#2965;&#3009;&#2980;&#3007; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2990;&#3016;&#2991;&#3009;&#2990;&#3021; &#2980;&#3008;&#2992;&#3021;&#2990;&#3006;&#2985;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016;, &#2951;&#2997;&#3021;&#2997;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2986;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3006;&#2992;&#3006;&#2995;&#2990;&#3006;&#2965; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; (&#2958;.&#2965;&#3006;: third-party library-&#2965;&#2995;&#3016; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965;), &#2951;&#2984;&#3021;&#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2990;&#3016; &#2965;&#3007;&#2975;&#3016;&#2991;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2990;&#3007;&#2965;&#2980;&#3021;&#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2965; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2992;&#3016;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2980;&#3015;&#2986;&#3019;&#2994;&#3021;, &#2962;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2996;&#3009; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2997;&#2992;&#3016; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#2992;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2984;&#3006;&#2990;&#3021; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;, &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#2997;&#2985;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2962;&#2992;&#3009;&#2997;&#2992;&#3021;, &#2990;&#3007;&#2965;&#2970;&#3021;&#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2984;&#3009;&#2975;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2993;&#2985;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#2986;&#3019;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2990;&#2975;&#2994;&#3006;&#2975;&#2993;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2951;&#2975;&#3016;&#2974;&#3021;&#2970;&#2994;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#3019;&#2965;&#3021;&#2965;&#3007;&#2985;&#3016; &#2965;&#2975;&#3016;&#2986;&#3007;&#2975;&#3007;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2996;&#3009; &#2984;&#3007;&#2992;&#2994;&#3021; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2958;&#2970;&#3021;&#2970;&#2992;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2986;&#2965;&#3009;&#2980;&#3007; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3015; &#2962;&#2992;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2980;&#3021;&#2980;&#2992;&#3009;&#2979;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2992;&#2965;&#2970;&#3007;&#2991;&#2990;&#3021; &#2965;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2984;&#3007;&#2992;&#2994;&#2992;&#3006;&#2965; &#2951;&#2979;&#3016;&#2991; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3009;&#2995;&#3021;&#2995; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3016; &#2986;&#3018;&#2980;&#3009; &#2990;&#2975;&#2994;&#3006;&#2975;&#2993;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2949;&#2997;&#2992;&#2980;&#3009; &#2953;&#2979;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3016; &#2965;&#3006;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3019;&#2975;&#3009;, &#2984;&#2993;&#3021;&#2986;&#3014;&#2991;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2965;&#3016;&#2991;&#3006;&#2994;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3007;&#2992;&#2994;&#3021; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2962;&#2992;&#3009; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#2975;&#2994;&#3006;&#2975;&#2993;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991;&#2994;&#3006;&#2990;&#3021;. &#2949;&#2965;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021;&#2986;&#3014;&#2993;&#3021;&#2993; &#2962;&#2992;&#3009; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2965;&#3021;&#2965;&#3009;&#2996;&#3009; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;, &#2986;&#3007;&#2993; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2990;&#3006;&#2965; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2992;&#3016;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#2995;&#3007;&#2965;&#3021;&#2965; &#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3006;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2994;&#2995;&#3007;&#2965;&#3021;&#2965; &#2959;&#2980;&#3009;&#2997;&#3006;&#2965;, &#2970;&#3007;&#2994; &#2984;&#3006;&#2975;&#3021;&#2965;&#2995;&#3021; &#2965;&#3006;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021;, &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2984;&#3007;&#2992;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#2995;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2990;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2986;&#3007;&#2993; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2965;&#3015;&#2975;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#2975;&#3016;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2962;&#2995;&#3007;&#2997;&#3009;&#2990;&#2993;&#3016;&#2997;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3015; &#2992;&#2965;&#2970;&#3007;&#2991;&#2990;&#3006;&#2965; &#2965;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016;, &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2984;&#2986;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2997;&#3021;&#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2980;&#3014;&#2992;&#3007;&#2984;&#3021;&#2980;&#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021;, &#2949;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2980;&#3006;&#2985;&#3021; &#2980;&#3019;&#2994;&#3021;&#2997;&#3007;&#2991;&#3009;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2980;&#3008;&#2992;&#3021;&#2990;&#3006;&#2985;&#3007;&#2980;&#3021;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021; &#2997;&#2992;&#3009;&#2984;&#3021;&#2980;&#2984;&#3015;&#2992;&#2994;&#3006;&#2990;&#3021;. &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965;, &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985; &#2965;&#3019;&#2992;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2980;&#3016; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2986;&#2992;&#3007;&#2970;&#3008;&#2994;&#3007;&#2980;&#3021;&#2980;&#3009; &#2959;&#2993;&#3021;&#2965;&#2997;&#3019; &#2990;&#2993;&#3009;&#2965;&#3021;&#2965;&#2997;&#3019; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2990;&#2993;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3016; &#2986;&#2979;&#3007;&#2997;&#3006;&#2965; &#2980;&#3014;&#2992;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009;&#2975;&#2985;&#3021;, &#2949;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2985; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;: &#8220;&#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2990;&#2992;&#3021;&#2986;&#3007;&#2980;&#3021;&#2980; &#2962;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3016; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2993;&#3019;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985; &#2949;&#2995;&#2997;&#3009; &#2962;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3016; &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2990;&#2992;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;" &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;, &#8220;&#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2990;&#2992;&#3021;&#2986;&#3007;&#2980;&#3021;&#2980; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2962;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3006;&#2992;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#3007;&#2993;&#3019;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2984;&#3007;&#2992;&#2994;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965; &#2949;&#2980;&#3007;&#2965; &#2949;&#2995;&#2997;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3006;&#2994;&#3021;, &#2980;&#2993;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2995;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2965;&#3006;&#2994;&#2986;&#3021;&#2986;&#3019;&#2965;&#3021;&#2965;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009; &#2990;&#3006;&#2993;&#2994;&#3006;&#2990;&#3021; &#2958;&#2985; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2993;&#3019;&#2990;&#3021;." &#2949;&#2979;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2984;&#2986;&#2992;&#3007;&#2985;&#3021; &#2980;&#2985;&#3021;&#2985;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016;&#2986;&#3021;&#2986;&#3018;&#2993;&#3009;&#2980;&#3021;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3015;&#2992;&#3007;&#2975;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2965;&#3016;&#2991;&#3006;&#2994;&#3021;, &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3007;&#2985;&#3021;&#2985;&#2974;&#3021;&#2970;&#2994;&#3016; &#2958;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980; &#2984;&#2986;&#2992;&#3007;&#2985;&#3021; &#2965;&#2979;&#3021;&#2979;&#3019;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2970;&#3007;&#2984;&#3021;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2958;&#2996;&#3009;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2962;&#2992;&#3015;&#2991;&#3018;&#2992;&#3009;&#2990;&#3009;&#2993;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009; &#2984;&#3007;&#2992;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2984;&#2992;&#3016; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#3007;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2986;&#3007;&#2985;&#3021;&#2997;&#3007;&#2995;&#3016;&#2997;&#3009;&#2965;&#2995;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2970;&#3007;&#2994; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#3009;&#2980;&#3007;&#2965;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;, &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2986;&#2975;&#3021;&#2970;&#2990;&#3021; <span class="emphasis"><em>&#2951;&#2980;&#3021;&#2980;&#2985;&#3016;</em></span> &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2958;&#2980;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3021; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3006;&#2980;&#3009;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2993;&#3009;&#2980;&#3007;&#2986;&#3021;&#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2949;&#2995;&#2997;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3021;&#2986;&#2980;&#3009; &#2951;&#2969;&#3021;&#2965;&#3015; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#2994;&#3021;&#2994;. &#2986;&#3009;&#2980;&#3007;&#2991; &#2984;&#3007;&#2992;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3016; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2997;&#3007;&#2996;&#3007;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3021;&#2986;&#2980;&#3015; &#2951;&#2980;&#2985;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#2990;&#3021;. &#2951;&#2980;&#3009;&#2986;&#3019;&#2985;&#3021;&#2993;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#2965;&#3009;&#2980;&#3007;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2984;&#3007;&#2992;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2984;&#2992;&#3016; <span class="emphasis"><em>&#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985;</em></span> &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3015; &#2949;&#2985;&#3016;&#2997;&#2992;&#2980;&#3009; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3021;. &#2984;&#3007;&#2992;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3016; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2970;&#3006;&#2992;&#3006;&#2980; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009;, <a class="xref" href="committers.html" title="Committers">the section called &#8220;Committers&#8221;</a><span>&#2951;&#2997;&#3021;&#2997;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021;,<a class="xref" href="managing-volunteers.html" title="Chapter 8. Managing Volunteers">Chapter 8, <i>Managing Volunteers</i></a></span> &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;.</p></div><div class="sect2" title="&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="polls"></a>&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021;</h3></div></div></div><p>&#2970;&#3007;&#2994; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2992;&#3007;&#2997;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2986;&#2991;&#2985;&#3009;&#2995;&#3021;&#2995;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2986;&#2991;&#2985;&#2992;&#3007;&#2985;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2993;&#3021;&#2965;&#3009; &#2959;&#2993;&#3021;&#2993; &#2951;&#2975;&#3016;&#2990;&#3009;&#2965;&#2980;&#3021;&#2980;&#3016;, &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2970;&#2984;&#3021;&#2980;&#3006;&#2980;&#3006;&#2992;&#2992;&#3021;&#2965;&#2995;&#3016; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3009; &#2962;&#2992;&#3009; &#2980;&#3008;&#2992;&#3021;&#2997;&#3006;&#2965; &#2949;&#2990;&#3016;&#2991;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2997;&#3016; <em class="firstterm">&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3015;</em> &#2949;&#2985;&#3021;&#2993;&#3007; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#2994;&#3021;&#2994;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2980;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3007;&#2985;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2986;&#3007;&#2993; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;&#2986;&#3021; &#2986;&#3019;&#2994;&#2997;&#3015;, &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#3014;&#2992;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2997;&#3007;&#2975; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3007;&#2985;&#3016; &#2953;&#2995;&#3021;&#2995;&#3007;&#2975;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2997;&#2970;&#2980;&#3007;&#2991;&#3009;&#2990;&#3021; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;&#3006;&#2995;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2980;&#3014;&#2995;&#3007;&#2997;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2953;&#2995;&#3021;&#2995;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2990;&#3009;&#2975;&#3007;&#2997;&#3006;&#2965; &#2990;&#3006;&#2993;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;.</p></div><div class="sect2" title="&#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="veto"></a>&#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;</h3></div></div></div><p><em class="firstterm">&#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;</em> &#2958;&#2985;&#3021;&#2993;&#2996;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3016;, &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2949;&#2997;&#2970;&#2992;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985; &#2949;&#2995;&#2997;&#3009; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2980;&#3021;&#2980; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2951;&#2984;&#3021;&#2980; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#3021; &#2980;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2990;&#3009;&#2975;&#3021;&#2975;&#3009;&#2965;&#3021;&#2965;&#2975;&#3021;&#2975;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2975;&#3016;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3006;&#2965; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2980;&#2985;&#3021; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#2994;&#3006;&#2990;&#3021;. &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980; &#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#3016; &#2992;&#2980;&#3021;&#2980;&#3009;&#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;; &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2980;&#3021;&#2980; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2951;&#2980;&#2985;&#3016; &#2992;&#2980;&#3021;&#2980;&#3009;&#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;. &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2962;&#2992;&#3009; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2990;&#2995;&#3007;&#2965;&#3021;&#2965;&#3006;&#2980; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3021; &#2970;&#3014;&#2994;&#3021;&#2994;&#3006;&#2980;&#2997;&#3016;&#2991;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2980;&#2997;&#2993;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3009;&#2990;&#3021; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#2975;&#3016;&#2991;&#3006;&#2980; &#2970;&#3010;&#2996;&#2994;&#3007;&#2994;&#3021; &#2965;&#3010;&#2975; &#2970;&#3007;&#2994; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2950;&#2992;&#3021;&#2997;&#2990;&#3006;&#2991;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2992;&#3021;. &#2951;&#2980;&#3009;&#2986;&#3019;&#2985;&#3021;&#2993; &#2980;&#2997;&#2993;&#3006;&#2985; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2951;&#2992;&#3009; &#2997;&#2996;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2990;&#3009;&#2980;&#2994;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#3016;&#2991; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965; &#2980;&#2991;&#2965;&#3021;&#2965;&#2990;&#3021; &#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;. &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2980;&#2985;&#2980;&#3009; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2949;&#2975;&#3007;&#2965;&#3021;&#2965;&#2975;&#3007; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3019;&#2992;&#3007;&#2975;&#2990;&#3021; &#2949;&#2980;&#3009;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#2979;&#3007;&#2997;&#3009;&#2975;&#2985;&#3021; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;. &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#3021; &#2997;&#3007;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2949;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3007;&#2985;&#3016;&#2997;&#3010;&#2975;&#3021;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;. &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985;&#3019;&#2992;&#3021; &#2962;&#2992;&#3009; &#2965;&#3006;&#2992;&#3007;&#2991;&#2980;&#3021;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2980;&#3009; &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2984;&#2975;&#2984;&#3021;&#2980;&#3015;&#2980;&#3008;&#2992;&#3009;&#2990;&#3021;. &#2962;&#2985;&#3021;&#2993;&#3009;, &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021; &#2986;&#3007;&#2985;&#3021;&#2997;&#3006;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2984;&#2975;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#2992;&#2990;&#3021;&#2986;&#3016; &#2965;&#3009;&#2993;&#3016;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3016; &#2986;&#3007;&#2992;&#2991;&#3019;&#2965;&#3007;&#2965;&#3021;&#2965;, &#8220;-1&#8221; &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3009;&#2997;&#2980;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2984;&#3021;&#2980; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3009;, &#2949;&#2986;&#3006;&#2970;&#3007; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2949;&#2993;&#2965;&#3021;&#2965;&#2975;&#3021;&#2975;&#2995;&#3016;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3014;&#2993;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;. &#2949;&#2986;&#3006;&#2970;&#3007; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2949;&#2993;&#2965;&#3021;&#2965;&#2975;&#3021;&#2975;&#2995;&#3016; &#2990;&#3007;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009;. &#2951;&#2980;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007; <a class="ulink" href="http://www.apache.org/foundation/voting.html" target="_top">&#2951;&#2997;&#3021;&#2997;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;.</a> &#2951;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3021;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3021; &#2949;&#2986;&#3006;&#2970;&#3007;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3007;&#2993; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2992;&#2997;&#3007;&#2991;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2994;&#2965;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009;&#2986;&#3019;&#2985;&#3021;&#2993; &#2990;&#2992;&#2986;&#3009;&#2965;&#2995;&#3021; &#2986;&#2994;&#3021;&#2997;&#3015;&#2993;&#3009; &#2949;&#2995;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3016; &#2984;&#3006;&#2990;&#3021; &#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021;. &#2949;&#2986;&#3006;&#2970;&#3007; &#2980;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021;, &#8220;-1&#8221; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009; &#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2985; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#3016; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#2992;&#3009;&#2979;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3016;&#2970;&#3006;&#2992;&#3006; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3006;&#2965; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2986;&#2975;&#3021;&#2970;&#2990;&#3021;, &#2990;&#3007;&#2965;&#2965;&#3021;&#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3016; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;.</p><p>&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3016;&#2986;&#3021;&#2986;&#3019;&#2994;&#2997;&#3015;, &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2986;&#3007;&#2985;&#3021;&#2985;&#3019;&#2965;&#3021;&#2965;&#3007; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#2994;&#3006;&#2990;&#3021;. &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965; &#2962;&#2992;&#3009; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3016; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#2980;&#2994;&#3021;&#2994;. &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980; &#2997;&#3007;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2951;&#2980;&#2993;&#3021;&#2965;&#3009; &#2997;&#3007;&#2980;&#3007;&#2997;&#3007;&#2994;&#2965;&#3021;&#2965;&#3009; (&#2958;.&#2965;&#3006;: &#2954;&#2975;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3009;). &#2990;&#3006;&#2993;&#3006;&#2965;, &#2949;&#2980;&#3007;&#2965; &#2965;&#3006;&#2994;&#2990;&#3021; &#2980;&#3006;&#2996;&#3021;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3021; &#2986;&#3014;&#2992;&#3007;&#2980;&#3006;&#2965; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2949;&#2980;&#3016; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2965; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="social-infrastructure.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="social-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="written-rules.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2997;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;</td></tr></table></div></body></html>
