<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 1. &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3016;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="disclaimer.html" title="&#2986;&#3014;&#3006;&#2993;&#3009;&#2986;&#3021;&#2986;&#3006;&#2965;&#3006;&#2990;&#3016;"><link rel="next" href="today.html" title="The Situation Today"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 1. &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3016;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="disclaimer.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="today.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 1. &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3016;"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>Chapter 1. &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3016;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="introduction.html#history">&#2997;&#2992;&#2994;&#3006;&#2993;&#3009;</a></span></dt><dd><dl><dt><span class="sect2"><a href="introduction.html#propertization">&#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2958;&#2996;&#3009;&#2970;&#3021;&#2970;&#3007;</a></span></dt><dd><dl><dt><span class="sect3"><a href="introduction.html#history-conscious-resistance">&#2951;&#2985;&#2969;&#3021;&#2965;&#2979;&#3021;&#2975;&#3009; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;</a></span></dt><dt><span class="sect3"><a href="introduction.html#history-accidental-resistance">&#2980;&#2993;&#3021;&#2970;&#3014;&#2991;&#2994;&#3006;&#2985; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;</a></span></dt></dl></dd><dt><span class="sect2"><a href="introduction.html#free-vs-open-source">"Free" Versus "Open Source"</a></span></dt></dl></dd><dt><span class="sect1"><a href="today.html">The Situation Today</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007;&#2991;&#2975;&#3016;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.</p><p>&#2984;&#3006;&#2990;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007;&#2965;&#2995;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; &#2965;&#3015;&#2975;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#3019;&#2990;&#3021;.&#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3014; 
&#2984;&#2990;&#2980;&#3009; &#2986;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016; &#2952;&#2992;&#3021;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2958;&#2985;&#3021;&#2985;&#3007;&#2994;&#3021; &#2949;&#2975;&#2969;&#3021;&#2965;&#3006; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;<sup>[<a name="idp4646816" href="#ftn.idp4646816" class="footnote">2</a>]</sup> &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#3007;&#2991; &#2970;&#2980;&#2997;&#3008;&#2980;&#2990;&#3021;
&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2986;&#3014;&#2993;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2951;&#2980;&#2985;&#3021; &#2997;&#3007;&#2995;&#3016;&#2997;&#3006;&#2965; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2986;&#3009;&#2994;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2993;&#3016;&#2991; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.
&#2984;&#3006;&#2990;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007;&#2965;&#2995;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#3015;&#2975;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;, &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007; &#2962;&#2992;&#3009; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009; &#2949;&#2994;&#3021;&#2994;.  
&#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#3009; &#2986;&#3019;&#2997;&#2980;&#3009;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2962;&#2993;&#3021;&#2993;&#3016; &#2965;&#2979;&#2990;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;; &#2990;&#2965;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2970;&#3007;&#2993;&#3007;&#2991; 
&#2965;&#2997;&#2985;&#2970;&#3021;&#2970;&#3007;&#2980;&#2993;&#2994;&#3014; &#2990;&#3009;&#2996;&#3009; &#2997;&#3015;&#2994;&#3016;&#2991;&#3016; &#2984;&#3007;&#2993;&#3009;&#2980;&#3021;&#2980; &#2986;&#3018;&#2980;&#3009;&#2990;&#3006;&#2985;&#2980;&#3009;.  &#2970;&#3007;&#2994; &#2965;&#2979;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3014; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2984;&#3007;&#2993;&#3016;&#2997;&#3009; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2949;&#2980;&#3009;&#2997;&#3015; &#2949;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2985;&#3021; &#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2985;&#2992;&#3021;&#2997;&#2980;&#3009; 
&#2951;&#2994;&#3021;&#2994;&#3016;.  &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2965;&#3006;&#2994;&#3006;&#2997;&#2980;&#3007;&#2991;&#3006;&#2997;&#2980;&#3016; &#2965;&#3010;&#2975; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2965; &#2997;&#2992;&#3016;&#2991;&#2993;&#3016;&#2991;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2949;&#2980;&#3016; 
&#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2965; &#2950;&#2993;&#3009; &#2990;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2965;&#3007;&#2975;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2984;&#3007;&#2993;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3006;?  &#2949;&#2980;&#2985;&#3021; &#2986;&#2991;&#2985;&#3008;&#2975;&#3021;&#2975;&#3006;&#2995;&#2992;&#3021; 
&#2965;&#3009;&#2993;&#3016;&#2997;&#2980;&#3006;&#2994;&#3021;, &#2951;&#2994;&#3021;&#2994;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021; &#2984;&#3006;&#2975;&#3021;&#2975;&#2990;&#3021; &#2965;&#3009;&#2993;&#3016;&#2997;&#2980;&#3006;&#2994;&#3021; &#2984;&#3007;&#2993;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3006;? &#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#2994;&#3021;&#2994;&#3009;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2997;&#3015;&#2992;&#3021;&#2992;&#3018;&#2993;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2990;&#2993;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3006;&#2991;&#3021; &#2953;&#2985;&#2992;&#3021;&#2997;&#2980;&#3006;&#2994;?&#8212;&#2951;&#2994;&#3021;&#2994;&#3016;&#2958;&#2985;&#3007;&#2994;&#3021; &#2997;&#3015;&#2992;&#3021;&#2992;&#3018;&#2993;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021; 
&#2951;&#2985;&#3016;&#2984;&#3021;&#2980;&#3009; &#2980;&#2969;&#3021;&#2965;&#2994;&#3007;&#2985;&#3021; &#2986;&#2994;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975; &#2949;&#2985;&#3009;&#2986;&#2997;&#2980;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3007;&#2995;&#3016;&#2997;&#2980;&#3006;&#2994;&#3006;?</p><p>&#2959;&#2985;&#2997;&#3014; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#2995;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007; &#2997;&#3007;&#2965;&#3007;&#2980; &#2965;&#2979;&#2965;&#3021;&#2965;&#3008;&#2975;&#3016; &#2980;&#3009;&#2994;&#3021;&#2994;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3016;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;.
&#2950;&#2985;&#3006;&#2994;&#3021; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2980;&#2970;&#3006;&#2986;&#3021;&#2980;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2980;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; 
(see <a class="xref" href="web-site.html#canned-hosting" title="&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;">the section called &#8220;&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;&#8221;</a><span> in
<a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;">Chapter 3, <i>&#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</i></a></span> for more about
them), &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3006;&#2993;&#2985;&#3007;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; google &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007; &#2997;&#3007;&#2965;&#3007;&#2980;&#2990;&#3021; &#2990;&#3007;&#2965; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2992;&#2965;&#3021;&#2965;&#3010;&#2975;&#3009;&#2990;&#3021;: &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; 90&#8211;95% &#2997;&#2992;&#3016;&#2965;&#3021;&#2965;&#3010;&#2975; &#2951;&#2993;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2997;&#3006;&#2996;&#3009;&#2990;&#3021; &#2950;&#2985;&#3006;&#2994;&#3021;
&#2970;&#3014;&#2991;&#2994;&#3007;&#2996;&#2984;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2953;&#2995;&#3021;&#2995;&#3007;&#2975;&#3021;&#2975;&#2994;&#3021; &#2951;&#2997;&#3021; &#2958;&#2979;&#3021;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;: &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
<span class="emphasis"><em>&#2958;&#2997;&#3016;</em></span>emphasis&gt; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2997;&#3007;&#2965;&#3007;&#2980;&#2980;&#3021;&#2980;&#3016; &#2997;&#3007;&#2975; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; 
&#2997;&#2995;&#2993;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2997;&#3019;.</p><p>&#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007;&#2991;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#2980;&#3009;.  &#2951;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2970;&#2992;&#3007;&#2991;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#2980;&#3009; 
&#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2958;&#2985;&#3021;&#2993;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2950;&#2992;&#3006;&#2991;&#3006;&#2990;&#2994;&#3021;, &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2980;&#2997;&#2993;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#2991;&#3009;&#2990;&#3021; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009;, 
&#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#3007;&#2985;&#3016;&#2965;&#2995;&#3021; &#2980;&#3014;&#3006;&#2975;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2949;&#2975;&#3016;&#2991;&#3006;&#2995;&#2990;&#3021; &#2965;&#3006;&#2979; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.  &#2951;&#2980;&#3016; 
&#2986;&#2975;&#3007;&#2980;&#3021;&#2980;&#2997;&#3009;&#2975;&#2985;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3014;&#3006;&#2980;&#3009;&#2997;&#3006;&#2985; &#2980;&#2997;&#2993;&#3009;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007;, &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975; 
&#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#3009; &#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3021; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;.. 
&#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2970;&#3007;&#2993;&#3009; &#2997;&#3007;&#2995;&#3016;&#2991;&#3006;&#2975;&#3021;&#2975;&#3009; &#2949;&#2994;&#3021;&#2994;, &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2949;&#2975;&#2991;&#2997;&#3018; &#2949;&#2994;&#3021;&#2994;&#3006;&#2980;&#3009; &#2997;&#2979;&#3007;&#2965; 
&#2986;&#3015;&#3006;&#2975;&#3021;&#2975;&#3007;&#2991;&#3007;&#2994;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#2979;&#3007;&#2991;&#3007;&#2994;&#3021; &#2986;&#3014;&#2993;&#3009;&#2997;&#2980;&#3009; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#3018; &#2949;&#2994;&#3021;&#2994;. &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965; &#2962;&#2992;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2986;&#2965;&#3009;&#2980;&#3007;, &#2990;&#2993;&#3021;&#2993; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009;&#2975;&#3016;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; 
&#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2970;&#3009;&#2990;&#3010;&#2965;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3014;. &#2980;&#3018;&#2994;&#3016;&#2984;&#3019;&#2965;&#3021;&#2965;&#3007;&#2994;&#3021;, &#2962;&#2997;&#3021;&#2997;&#3014;&#3006;&#2992;&#3009; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3009;&#2990;&#3021; &#2953;&#2994;&#2965;&#2995;&#3006;&#2997;&#3007;&#2991; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2984;&#2994;&#3021;&#2997;&#3006;&#2996;&#3021;&#2997;&#3007;&#2992;&#3021;&#2965;&#3014; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;</p><p>&#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007;&#2991;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2980;&#3015; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3015;&#3006;&#2994;&#3021;&#2997;&#3007;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3010;&#2992; &#2980;&#3010;&#2979;&#3021;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. 
&#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965;, &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2984;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#2965;&#3006;&#2980; &#2958;&#2984;&#3021;&#2980; &#2959;&#2965;&#2986;&#3015;&#3006;&#2965; &#2953;&#2992;&#3007;&#2990;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#2994;&#3021;&#2994;, 
&#2990;&#3006;&#2993;&#3006;&#2965; &#2980;&#3014;&#2995;&#3007;&#2997;&#2993;&#3021;&#2993; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2965;&#3009;&#2992;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021;, &#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3006;&#2985; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2951;&#2985;&#3021;&#2990;&#3016; 
&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021; &#2984;&#2985;&#3021;&#2965;&#3009; &#2949;&#2993;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#2996;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2984;&#3021;&#2980; 
&#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#3007;&#2993;&#2991; &#2958;&#2996;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2984;&#3006;&#2985;&#3021; &#2949;&#2980;&#3016; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3007;&#2994;&#3021; &#2986;&#3007;&#2992;&#2980;&#3007; 
&#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2965;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3006;&#2965;, &#2984;&#3006;&#2985;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2997;&#3007;&#2970;&#3007;&#2980;&#3021;&#2980;&#3007;&#2992;&#2990;&#3006;&#2985; 
&#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#3007;&#2985;&#3016;&#2965;&#2995;&#3016; &#2997;&#3007;&#2997;&#2992;&#3007;&#2965;&#3021;&#2965; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2986;&#3021;&#2986;&#3015;&#2985;&#3021;. </p><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2991;&#2980;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#2990;&#2993;&#3021;&#2993; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2986;&#3014;&#3006;&#2980;&#3009;&#2997;&#3006;&#2985; &#2980;&#2997;&#2993;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;. &#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3007;&#2975;&#3008;&#2992;&#3014;&#2985;&#3021;&#2993;&#3009; &#2986;&#2969;&#3021;&#2965;&#3008;&#2975;&#3021;&#2975;&#2994;&#3007;&#2965;&#3021;&#2965; &#2965;&#3006;&#2993;&#2985;&#3007; &#2950;&#2997;&#2980;&#3009;&#2990;&#3021;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#2980;&#2993;&#3021;&#2993;&#2990;&#3006;&#2985; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021; &#2986;&#2993;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2980;&#3006;&#2985;&#3006;&#2965;&#2997;&#3015; &#2949;&#2980;&#2985;&#3021; &#2970;&#2992;&#3007;&#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;.. 
&#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3006;&#2985;&#2980;&#3009;: &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2990;&#3009;&#2996;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; 
&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3016; &#2970;&#3015;&#2992;&#3021;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3014;&#2993;&#3009;&#2990;&#2985;&#3015; &#2965;&#3009;&#2993;&#3009;&#2965;&#3007;&#2991; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#3014;&#2994;&#2997;&#3016; <span class="emphasis"><em>&#2990;&#3015;&#2994;&#3009;&#2990;&#3021;
</em></span> &#2953;&#2991;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;. &#2980;&#3007;&#2993;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#2994;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; 
&#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2990;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2997;&#2995;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2980;&#2991;&#3006;&#2992;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3007;&#2985;&#3021; 
&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2949;&#2990;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#3009;&#2980;&#2994;&#3021; &#2990;&#3009;&#2993;&#3016; &#2950;&#2997;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;.  &#2951;&#2997;&#3016; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2990;&#3007;&#2965; &#2949;&#2980;&#3007;&#2965;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;&#2985; &#2997;&#3015;&#2994;&#3016;.  &#2949;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007;, <span class="emphasis"><em>&#2950;&#2992;&#3021;&#2997;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2951;&#2970;&#3016;&#2997;&#3009; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2986;&#3018;&#2980;&#3009;</em></span> &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3019;&#2980;&#3007;&#2991; &#2997;&#3007;&#2994;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3015; &#2949;&#2980;&#3007;&#2965;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;&#2985; 
&#2970;&#3009;&#2990;&#3016;&#2991;&#3016; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2963;&#2992;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3006;&#2965; Mozilla project-&#2994;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986; &#2965;&#3006;&#2994;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; 
&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; Jamie Zawinski &#2965;&#3010;&#2993;&#3007;&#2991;&#2980;&#3009;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3021; &#2986;&#2994;&#2985;&#3021; &#2980;&#2992;&#2997;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2949;&#2980;&#3015; &#2970;&#2990;&#2991;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2949;&#2980;&#3009; &#2963;&#2992;&#3009; 
      &#2970;&#2974;&#3021;&#2970;&#3008;&#2997;&#3007;&#2985;&#3007; &#2949;&#2994;&#3021;&#2994;.  &#2963;&#2992;&#3009; &#2958;&#2970;&#3021;&#2970;&#2992;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2985; &#2965;&#2993;&#3009;&#2980;&#3021;&#2980;&#3016; &#2970;&#3018;&#2994;&#3021;&#2994; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2963;&#2992;&#3021; &#2949;&#2996;&#3007;&#2997;&#3007;&#2985;&#3021; 
      &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;, "&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3021;" &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2990;&#2984;&#3021;&#2980;&#3007;&#2992; &#2980;&#3009;&#2965;&#2995;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; 
      &#2980;&#3010;&#2997;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2953;&#2991;&#3007;&#2992;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;. &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985;&#2980;&#3009;.  &#2949;&#2980;&#2985;&#3021; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#3007;&#2985;&#3016;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; 
      &#2958;&#2995;&#3007;&#2990;&#3016;&#2991;&#3006;&#2985;&#2997;&#3016; &#2949;&#2994;&#3021;&#2994;.</em></span></p><p>(from <span class="bold"><strong><a class="ulink" href="http://www.jwz.org/gruntle/nomo.html" target="_top">jwz.org/gruntle/nomo.html</a></strong></span>)</p></blockquote></div><p>&#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3007;&#2994;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2984;&#2985;&#3021;&#2993;&#3006;&#2965; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2965;&#2997;&#2985;&#2965;&#3021;&#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2963;&#2992;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; &#2980;&#2997;&#2993;&#3009;&#2980;&#2994;&#3021;.  &#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3007;&#2994;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2980;&#2994;&#3021; 
&#2986;&#2994;&#3021;&#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009;, &#2949;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2951;&#2985;&#3016;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#3009;&#2992;&#3007;&#2991; &#2953;&#2995;&#3021;&#2995; 
&#2980;&#2975;&#3016;&#2965;&#2995;&#3016; &#2965;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009;.  &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2997;&#2992;&#2997;&#3015;&#2993;&#3021;&#2965;&#3021;&#2965; &#2980;&#2965;&#3021;&#2965;&#2980;&#3006;&#2965; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; 
&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;, &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021;  &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2980;&#2991;&#3006;&#2992;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3007;&#2992;&#3009;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2980;&#3006;&#2985;&#3007;&#2991;&#2969;&#3021;&#2965; &#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994;.</p><p>&#2986;&#2994;&#2992;&#3021; &#2951;&#2980;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3016; &#2997;&#3007;&#2975; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3009;&#2997;&#2980;&#3009; &#2997;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#2965;&#3021;&#2965;&#2980;&#3009;.  
&#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2970;&#3007;&#2994; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2970;&#2994;&#3007;&#2986;&#3021;&#2986;&#3010;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2986;&#2991;&#2985;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; 
&#2980;&#3014;&#2995;&#3007;&#2997;&#3009; &#2949;&#2993;&#3021;&#2993;&#2997;&#2992;&#2965;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997;&#3009;&#2997;&#2980;&#3009; &#8212; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#2993;&#3009;&#2980;&#2994;&#3016;&#2991;&#3006;&#2965;: &#2990;&#3018;&#2980;&#3021;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, 
&#2949;&#2984;&#3021;&#2980; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2980;&#3009;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3006;&#2994;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2984;&#2985;&#3021;&#2965;&#3009; &#2949;&#2993;&#3007;&#2997;&#2992;&#3021;.  
&#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2980;&#3007;&#2993;&#2990;&#3016; &#2949;&#2980;&#3016; &#2990;&#3009;&#2985;&#3021;&#2985;&#3007;&#2994;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; 
&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2980;&#3007;&#2993;&#2990;&#3016; 
&#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3007;&#2994;&#3021;&#2980;&#3006;&#2985;&#3021; &#2950;&#2992;&#3021;&#2997;&#2990;&#3021; &#2965;&#3018;&#2995;&#3021;&#2997;&#2992;&#3021;.  <a class="xref" href="getting-started.html" title="Chapter 2. &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;">Chapter 2, <i>&#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</i></a> 
&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3007;&#2994;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015;  &#2958;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; 
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995; &#2970;&#3014;&#2991;&#2994;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.</p><p>&#2949;&#2975;&#3009;&#2980;&#3021;&#2980;&#3021;&#2980;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995; &#2962;&#2992;&#3009; &#2980;&#2997;&#2992;&#3006;&#2985; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2980;&#3015;&#2997;&#3016;&#2991;&#2993;&#3021;&#2993;&#2980;&#3009; 
&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;, &#2949;&#2980;&#3015; &#2986;&#3019;&#2994;&#3021; &#2963;&#2992;&#3021; &#2949;&#2994;&#3009;&#2997;&#2994;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#2975;&#3016;&#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; 
&#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2965;&#3018;&#2995;&#3021;&#2965;&#3016;&#2965;&#2995;&#3021; &#2951;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2958;&#2985; &#2958;&#2985;&#3021;&#2985;&#3009;&#2997;&#2980;&#3009;.  &#2980;&#3007;&#2993;&#3021;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; 
&#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2958;&#2986;&#3021;&#2986;&#3018;&#2980;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2980;&#3014;&#2992;&#3007;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016; &#2949;&#2980;&#3015; &#2970;&#2990;&#2991;&#2990;&#3021; &#2962;&#2992;&#3009; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 
&#2949;&#2980;&#3009; &#2951;&#2994;&#3016;&#2990;&#2993;&#3016; &#2965;&#3006;&#2991;&#3006;&#2965; &#2949;&#2990;&#3016;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3016; &#2984;&#3007;&#2992;&#3010;&#2986;&#3007;&#2965;&#3021;&#2965; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#3007;&#2991; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3006;&#2991;&#3021;&#2997;&#3009; &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985;&#2980;&#3009;.
&#2962;&#2992;&#3009; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2986;&#2994;&#2980;&#2992;&#2986;&#2975;&#3021;&#2975; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3016; &#2965;&#3018;&#2985;&#3021;&#2975; &#2965;&#2994;&#2986;&#3021;&#2986;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;; &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#2985;&#3016; &#2951;&#2994;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021;, 
&#2984;&#3015;&#2992;&#3007;&#2994;&#3021; &#2965;&#2979;&#3021;&#2975;&#3007;&#2992;&#3006;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2975;&#2965;&#3021;&#2965;&#3007;&#2991;&#3006;&#2980;&#3009;&#8212;&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#3007;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992; &#2990;&#2985;&#2990;&#3021; &#2986;&#2975;&#3016;&#2980;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;&#8212;.  
&#2951;&#2984;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3006;&#2991;&#3021;&#2997;&#3007;&#2994;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; <span class="emphasis"><em>&#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021;</em></span> 
&#2958;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3007;&#2996;&#3016;&#2997;&#3009;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#2993;&#3021;&#2986;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;. &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2949;&#2980;&#3007;&#2970;&#2991;&#2990;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021; &#2949;&#2980;&#3009; 
&#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;. &#2958;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009;&#2997;&#3006;&#2965;&#2997;&#3015; &#2984;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.
&#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2990;&#3007;&#2965; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3015;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021; &#2950;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#3009;&#2993;&#3016;&#2970;&#3006;&#2992;&#3006;, &#2984;&#3009;&#2975;&#3021;&#2986;&#2990;&#3006;&#2985; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2990;&#3021; &#2965;&#3018;&#2985;&#3021;&#2975;&#2980;&#3009;.  &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2985;&#3016;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3019;&#2995;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2965; 
&#2970;&#3014;&#2991;&#2994;&#3006;&#2993;&#3021;&#2993;&#3009;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2949;&#2980;&#3007;&#2965; &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3021;&#2993;&#2990;&#3021; &#2965;&#3006;&#2979; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2980;&#3006;&#2985;&#3021; &#2963;&#2992;&#3009; &#2953;&#2992;&#3009;&#2997;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2965;&#3009;&#2996;&#3009;&#2997;&#3016; &#2951;&#2985;&#3016;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975; &#2997;&#3016;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2958;&#2985;&#2997;&#3015; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3019;&#2995;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; 
&#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016; &#2997;&#2995;&#2992;&#3021;&#2965;&#3021;&#2965;, &#2965;&#3009;&#2996;&#3009; &#2980;&#2965;&#2997;&#2994;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009; &#2962;&#2996;&#3009;&#2969;&#3021;&#2965;&#3009;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016; &#2997;&#2965;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; 
&#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3006;&#2994;&#3021; &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3006;&#2990;&#2994;&#3021; &#2965;&#3006;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2997;&#2992;&#3009;&#2990;&#3021; 
&#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2950;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#3007;&#2997;&#3006;&#2985; &#2997;&#3007;&#2994;&#2965;&#3021;&#2965;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; 
&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#3007;&#2985;&#3021;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.</p><p>&#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965;, &#2962;&#2992;&#3009; &#2986;&#3018;&#2980;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2965;&#3006;&#2992;&#2985;&#3007;&#2991;&#3016; "&#2965;&#2994;&#3006;&#2970;&#3021;&#2970;&#3006;&#2992; 
&#2954;&#2975;&#3009;&#2992;&#3009;&#2997;&#2994;&#3021; &#2980;&#3019;&#2994;&#3021;&#2997;&#3007;" &#2958;&#2985; &#2965;&#3010;&#2992;&#2994;&#3006;&#2990;&#3021;. &#2986;&#2980;&#3021;&#2980;&#3009; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#2980;&#3009; &#2997;&#2992;&#3009;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2953;&#2994;&#2965;&#2994;&#3006;&#2997;&#3007;&#2991; &#2965;&#2994;&#3006;&#2970;&#3021;&#2970;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#3010;&#2992;&#3009;&#2997;&#2980;&#3009; &#2990;&#3009;&#2980;&#3007;&#2992;&#3021;&#2997;&#2993;&#3021;&#2993; &#2965;&#3010;&#2993;&#3021;&#2993;&#3006;&#2965; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2980;&#3009; &#2950;&#2985;&#3006;&#2994;&#3021; 
&#2949;&#2980;&#3009; &#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;.   &#2962;&#2992;&#3009; &#2965;&#2997;&#2985;&#3007;&#2965;&#3021;&#2965; &#2980;&#2965;&#3021;&#2965; &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3009; &#2990;&#3014;&#2980;&#3009;&#2997;&#3006;&#2965; &#2980;&#3019;&#2985;&#3021;&#2993;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;, 
&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009; &#2962;&#2992;&#3015;&#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3006;&#2985;&#2980;&#3009; &#2949;&#2994;&#3021;&#2994;&#8212;&#2949;&#2980;&#3007;&#2994;&#3021; &#2970;&#3007;&#2993;&#3007;&#2991; &#2949;&#2995;&#2997;&#3007;&#2994;&#3015;&#2985;&#3009;&#2990;&#3021; &#2986;&#3009;&#2997;&#3007;&#2991;&#3007;&#2991;&#2994;&#3021;
&#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2953;&#2975;&#3021;&#2965;&#2975;&#3021;&#2970;&#3007;&#2986;&#3021;&#2986;&#3010;&#2970;&#2994;&#3009;&#2990;&#3021; 
&#2953;&#2995;&#3021;&#2995;&#2980;&#3009;&#8212;&#2949;&#2980;&#3009; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2970;&#3008;&#2992;&#3006;&#2985; &#2953;&#2975;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2986;&#3014;&#2993;&#3021;&#2993; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; 
&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2984;&#3021;&#2980; &#2953;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009; &#2970;&#3007;&#2994; &#2965;&#3009;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2985;.  
&#2949;&#2997;&#3016; &#2970;&#3007;&#2994; &#2951;&#2991;&#2994;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985; &#2990;&#2993;&#3021;&#2993;&#2997;&#2993;&#3021;&#2993;&#3016; &#2980;&#2979;&#3021;&#2975;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.  &#2949;&#2997;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; 
&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3016; &#2997;&#2995;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#3010;&#2996;&#3021;&#2984;&#3007;&#2994;&#3016;&#2991;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2970;&#3007;&#2994; &#2970;&#2990;&#2991;&#2990;&#3021; &#2990;&#2980;&#3021;&#2980;&#3007; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3016; &#2997;&#3007;&#2994;&#2965;&#3021;&#2965;&#3007;&#2991;&#3009;&#2990;&#3021;;
&#2949;&#2997;&#3016; &#2990;&#3014;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2970;&#3016;&#2986;&#3006;&#2975;&#3009;&#2990;&#3021; &#2986;&#2979;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#2979;&#3007;&#2970;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2985;.  
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965;, &#2984;&#3008;&#2979;&#3021;&#2975; &#2984;&#3006;&#2995;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;  &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2953;&#2975;&#3021;&#2986;&#3009;&#2965;&#3009;&#2980;&#3021;&#2980;&#3007; 
&#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2958;&#2985;&#2997;&#3015; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2951;&#2994;&#2965;&#3009;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.    
&#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2986;&#3014;&#2993;&#3006;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2953;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
&#2997;&#2992;&#3009;&#2984;&#3021;&#2980; &#2980;&#2965;&#3021;&#2965; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3009; &#2951;&#2985;&#3021;&#2993;&#3007; &#2953;&#2995;&#3021;&#2995;&#2985;.  &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2965;&#3009;&#2996;&#2986;&#3021;&#2986;&#2990;&#3006;&#2985; &#2970;&#3010;&#2996;&#3021;&#2984;&#3007;&#2994;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2980;&#3009;
&#2990;&#3014;&#2985;&#3021;&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2986;&#3007;&#2995;&#2997;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;. </p><p>&#2949;&#2984;&#3021;&#2980; &#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2965;&#3006;&#2992;&#2985;&#3007;, &#2965;&#2994;&#3006;&#2970;&#3021;&#2970;&#3006;&#2992; &#2954;&#2975;&#3009;&#2992;&#3009;&#2997;&#2994;&#3021; &#2980;&#3019;&#2994;&#3021;&#2997;&#3007;, &#2962;&#2992;&#3009; &#2965;&#2997;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3019;&#2993;&#3021;&#2993;&#2986;&#3021;&#2986;&#3006;&#2975;&#3016; 
&#2980;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;: &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; &#2970;&#3007;&#2994; &#2965;&#3009;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; 
&#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3009; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2949;&#2995;&#2997;&#3015; &#2959;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2985; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2986;&#3021;&#2986;&#3019;&#2994;&#3021; &#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.
&#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2980;&#2991;&#3006;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2958;&#2985;&#2965;&#3021;&#2965;&#3009; &#2984;&#2990;&#3021;&#2986;&#3007; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980; &#2986;&#3014;&#2992;&#3007;&#2991; &#2950;&#2970;&#3021;&#2970;&#2992;&#3007;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;, 
&#2958;&#2985;&#2980;&#3009; &#2949;&#2985;&#3009;&#2986;&#2997;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2949;&#2992;&#2970;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2949;&#2995;&#2997;&#3015; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;; &#2994;&#3006;&#2986;
&#2984;&#3019;&#2965;&#3021;&#2965;&#3007;&#2994;&#3006;&#2985; &#2980;&#2985;&#3007;&#2991;&#3006;&#2992;&#3021; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#2985;&#3021;&#2965;&#3009; &#2962;&#2980;&#3021;&#2980;&#3009;&#2986;&#3021;&#2986;&#3019;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3015; &#2984;&#3015;&#2992;&#2990;&#3021; &#2994;&#3006;&#2986; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007;&#2994;&#3021;&#2994;&#3006; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2951;&#2992;&#2979;&#3021;&#2975;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2975;&#3016;&#2986;&#2975;&#3021;&#2975; &#2951;&#2985;&#2965;&#3021;&#2965;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2986;&#2994; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985; 
(see <a class="xref" href="governments-and-open-source.html" title="Chapter 9. Governments and Open Source">Chapter 9, <i>Governments and Open Source</i></a>), &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2970;&#2990;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2965;&#2997;&#2985;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2953;&#2995;&#3021;&#2995; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985; 
&#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#8212; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2962;&#2992;&#3009; &#2986;&#2975;&#3007;&#2984;&#3007;&#2994;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
<span class="emphasis"><em>&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975; &#2980;&#2965;&#3021;&#2965;</em></span> &#2986;&#2975;&#3007;&#2984;&#3007;&#2994;&#3016;&#2965;&#2995;&#3016; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
&#2986;&#3018;&#2980;&#3009;&#2990;&#2965;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2965;&#3010;&#2992; &#2951;&#2991;&#2994;&#3006;&#2980; &#8212; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965; &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#2997;&#3019; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;  &#2990;&#3006;&#2993;&#3021;&#2993;&#2997;&#3019; &#2990;&#3009;&#2991;&#2994;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3007;&#2994; &#2970;&#2990;&#2992;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2962;&#2992;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021;&#2990;&#3009;&#2992;&#3016; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2990;&#3015; &#2949;&#2985;&#3021;&#2993;&#3007;, &#2997;&#2992;&#2994;&#3006;&#2993;&#3021;&#2993;&#3009; &#2950;&#2991;&#3021;&#2997;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2992;&#3016;&#2991;&#3019; &#2990;&#3006;&#2985;&#3009;&#2975;&#2997;&#3007;&#2991;&#2994;&#3021; 
&#2997;&#3007;&#2995;&#2965;&#3021;&#2965; &#2953;&#2993;&#3016;&#2991;&#3019; &#2949;&#2994;&#3021;&#2994;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2949;&#2993;&#3007;&#2997;&#3009;&#2993;&#3016; &#2965;&#3010;&#2993;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2994;&#3006;&#2970;&#3006;&#2992;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986;&#2990;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;.  &#2949;&#2980;&#3016; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#2997;&#2992;&#3021;, &#2986;&#2994; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;, &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#2997;&#3009;&#2990;&#3021; &#2980;&#2991;&#2965;&#3021;&#2965;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; 
&#2965;&#3016;&#2991;&#3006;&#2994;&#2997;&#3009;&#2990;&#3021; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021;.  &#2990;&#3006;&#2993;&#3006;&#2965; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2965;&#2994;&#3006;&#2970;&#3021;&#2970;&#3006;&#2992; &#2980;&#3014;&#2995;&#3007;&#2997;&#3009; &#2949;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#2997;&#3019; 
&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3019; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2990;&#3021;&#2990;&#3009;&#2990;&#3021;, &#2950;&#2970;&#3021;&#2970;&#2992;&#3007;&#2991;&#2990;&#3021; &#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;&#2965; &#2970;&#3015;&#2992;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#2965; &#2965;&#3010;&#2992;&#3007;&#2991;&#2980;&#3009; &#2986;&#3019;&#2994;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; 
&#2980;&#3014;&#2995;&#3007;&#2997;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2965;&#3006;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;&#8212;&#2951;&#2980;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#3009;&#2994;&#2990;&#3021;&#2986;&#3014;&#2991;&#2992;&#3021;&#2984;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021;, 
&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2970;&#3010;&#2996;&#2994;&#3021; &#2970;&#3007;&#2994;&#2965;&#3006;&#2994;&#2990;&#3021; &#2984;&#3008;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#3007;&#2992;&#3007;&#2997;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2997;&#2992;&#3021; &#2958;&#2985;&#3007;&#2994;&#3021; 
&#2986;&#3007;&#2985;&#3021;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#3006;&#2965;&#2990;&#3021; &#2949;&#2975;&#3009;&#2980;&#3021;&#2980; &#2965;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009;, &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2951;&#2979;&#3016;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993; 
&#2965;&#2975;&#3021;&#2975;&#3010;&#2992;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2965;&#2995;&#3016; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  (&#2990;&#3006;&#2993;&#3006;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2984;&#3008;&#2979;&#3021;&#2975; &#2984;&#3006;&#2995;&#3021; 
&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021; &#2958;&#2985;&#3007;&#2994;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2965;&#3008;&#2996;&#3021;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#3006;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2997;&#3016; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; 
&#2986;&#2996;&#2965;&#3007;&#2991;&#2997;&#3016;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#2997;&#3015; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#2985;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009; &#2949;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#3006;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009;
&#2970;&#3014;&#2994;&#3021;&#2994;&#2994;&#3006;&#2990;&#3021;.)</p></div><div class="sect1" title="&#2997;&#2992;&#2994;&#3006;&#2993;&#3009;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>&#2997;&#2992;&#2994;&#3006;&#2993;&#3009;</h2></div></div></div><p>&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2997;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2985; &#2965;&#3006;&#2994;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#2975;&#3016;&#2990;&#3009;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  
&#2950;&#2992;&#2990;&#3021;&#2986;&#2965;&#3006;&#2994;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2986;&#3021;&#2986;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2997;&#2979;&#3007;&#2965; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3006;&#2965; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2958;&#2985;&#3021;&#2985;&#3007;&#2985;&#2992;&#3021;, &#2958;&#2985;&#2997;&#3015; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2962;&#2992;&#3009; &#2970;&#3018;&#2980;&#3021;&#2980;&#3006;&#2965; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2949;&#2965;&#3021;&#2965;&#3006;&#2994; 
&#2997;&#3006;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2974;&#3021;&#2974;&#3006;&#2985;&#3007;&#2965;&#2995;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2997;&#2994;&#3021;&#2994;&#3009;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#2997;&#3015; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3009;&#2975;&#2985;&#3021; 
&#2997;&#2992;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009; &#2959;&#2993;&#3021;&#2993;&#2997;&#3006;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965;&#2997;&#2994;&#3021;&#2994;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993; &#2986;&#2975;&#3021;&#2975; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;(patches) &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993; &#2949;&#2980;&#3015; 
&#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2965;&#2995;&#3016; &#2997;&#3016;&#2980;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2985;&#2992;&#3021;.  &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2959;&#2993;&#3021;&#2993;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3009;&#2990;&#3021; 
&#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2990;&#3021; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#2985;&#2992;&#3021;:&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2994;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3021;&#2993;&#2990;&#3021; 
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2997;&#2979;&#3007;&#2965;&#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2965; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#2980;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3006;&#2965; &#2958;&#2985;&#3021;&#2985;&#3007;&#2985;&#2992;&#3021;.</p><p>&#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2965;&#2994;&#3006;&#2970;&#3021;&#2970;&#3006;&#2992;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#2991; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2962;&#2980;&#3021;&#2980;&#3009; &#2986;&#3019;&#2997;&#2980;&#3006;&#2965; &#2980;&#3019;&#2985;&#3021;&#2993;&#3007;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; 
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021;, &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021;  
&#2951;&#2994;&#3021;&#2994;&#3016;&#8212;&#2949;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2992;&#3007; &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2965; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#3021;&#2993;&#3009; &#2997;&#2984;&#3021;&#2980;&#2980;&#3009; &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; 
&#2962;&#2985;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3006;&#2965; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993; &#2958;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2951;&#2991;&#2965;&#3021;&#2965; &#2980;&#2965;&#3021;&#2965;&#2980;&#3006;&#2965; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; 
&#2965;&#2979;&#3007;&#2985;&#3007; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993; &#2958;&#2984;&#3021;&#2980; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3006;&#2980;&#3009;: &#2958;&#2985;&#2997;&#3015; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#2994;&#3021;&#2994;&#3009;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3007; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016; &#2986;&#3007;&#2992;&#3007;&#2997;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#2994;&#3007; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#2996;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2965;&#3018;&#2995;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; (&#2950;&#2985;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; 
&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2992;&#3007; &#2990;&#3018;&#2996;&#3007;&#2991;&#3016; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2990;&#3018;&#2996;&#3007; &#2997;&#2965;&#3016;&#2991;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3006;&#2985; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; 
&#2990;&#3018;&#2996;&#3007;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#2996;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2965;&#3018;&#2995;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.).  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2950;&#2965;&#3021;&#2965; &#2980;&#3007;&#2992;&#2985;&#3021; &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3007; 
&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3006;&#2965; &#2990;&#3006;&#2993;&#3007;&#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016;&#2991;&#3015; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; 
&#2986;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.   &#2958;&#2985;&#2997;&#3015; &#2965;&#3009;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3007; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#3007; &#2965;&#3018;&#2994;&#3021;&#2997;&#2980;&#3009; 
&#2949;&#2984;&#3021;&#2980; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#3008;&#2980;&#3009; &#2952;&#2992;&#3021;&#2986;&#3021;&#2986;&#3016; &#2949;&#2980;&#3007;&#2965;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3016; &#2997;&#2992;&#2997;&#3015;&#2993;&#3021;&#2993;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;. </p><p>&#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2949;&#2965;&#3021;&#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2991;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2970;&#2975;&#3021;&#2975;&#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2985; 
&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3021; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986;&#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2985; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;: &#2962;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#3009; 
&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2990;&#2993;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#3007;&#2965; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.  &#2963;&#2992;&#3007;&#2992;&#3009; &#2970;&#3007;&#2993;&#3007;&#2991; &#2949;&#2995;&#2997;&#3007;&#2994;&#3006;&#2985;, &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2953;&#2995;&#3021;&#2995;&#3015; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2994;&#3009;&#2997;&#2994;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2953;&#2995;&#3021;&#2995;&#3015;, &#2951;&#2991;&#2969;&#3021;&#2965; 
&#2965;&#3010;&#2975;&#3007;&#2991; &#2997;&#2994;&#3016; &#2980;&#2994;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2949;&#2985;&#3016;&#2997;&#2992;&#3007;&#2975;&#2990;&#3009;&#2990;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; 
&#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016; &#2980;&#2975;&#3016;&#2965;&#2995;&#3021; <span class="emphasis"><em>&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;</em></span> &#2986;&#2994; 
&#2970;&#2984;&#3021;&#2980;&#2992;&#3021;&#2986;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#2975;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2985;.  &#2970;&#3007;&#2994; &#2970;&#2984;&#3021;&#2980;&#2992;&#3021;&#2986;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2994;&#3021;&#2997;&#3015;&#2992;&#3009; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; 
&#2965;&#3018;&#2985;&#3021;&#2975;&#3009;  &#2980;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2984;&#3006;&#2975;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#2992;&#3016;&#2997;&#2996;&#3007; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3007; 
&#2965;&#3018;&#2985;&#3021;&#2975;&#2985;&#2992;&#3021;, &#2970;&#3007;&#2994; &#2970;&#2984;&#3021;&#2980;&#2992;&#3021;&#2986;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3015; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#2985;&#2992;&#3021;.  &#2949;&#2980;&#3015; 
&#2997;&#3015;&#2994;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#2994;&#3021;&#2994;&#3009;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2994;&#3021;&#2965;&#2994;&#3016;&#2965;&#2996;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2990;&#3016;&#2991;&#3006;&#2994;&#3021; 
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2949;&#2970;&#3021;&#2970;&#3007;&#2975; &#2984;&#3015;&#2992;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#2993;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3007;&#2994;&#3021; 
&#2980;&#2975;&#3016;&#2991;&#3016; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2991;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980; &#2980;&#2975;&#3016; &#2980;&#3010;&#2992;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; &#2984;&#3015;&#2992;&#2975;&#3007; &#2997;&#3007;&#2965;&#3007;&#2980;&#3006;&#2970;&#3006;&#2992;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009;(&#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2965;).  &#2980;&#3019;&#2991;&#3021;&#2997;&#3009; &#2949;&#2994;&#3021;&#2994;&#3006;&#2980; &#2986;&#2992;&#2997;&#2994;&#3006;&#2985; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021;, &#2951;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3016; &#2986;&#3019;&#2994;&#3021;, &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3021; 
&#2949;&#2994;&#3021;&#2994;.</p><div class="sect2" title="&#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2958;&#2996;&#3009;&#2970;&#3021;&#2970;&#3007;"><div class="titlepage"><div><div><h3 class="title"><a name="propertization"></a>&#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2958;&#2996;&#3009;&#2970;&#3021;&#2970;&#3007;</h3></div></div></div><p>&#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2986;&#2994; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2949;&#2980;&#3015; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2985;.  &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2986;&#2985;&#3021;&#2990;&#3009;&#2965;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016; &#2951;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2991;&#3006;&#2994;&#2992;&#3016; &#2949;&#2975;&#3016;&#2991;&#3006;&#2994; 
&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;&#8212;&#2953;&#2991;&#2992;&#3021;&#2984;&#3021;&#2980; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986;&#2990;&#3021;, &#2953;&#2991;&#2992;&#3021;&#2984;&#3021;&#2980; &#2970;&#2984;&#3021;&#2980;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2994;&#3009;&#2990;&#3021; 
&#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2991;&#3006;&#2995;&#2992;&#3016;.  &#2949;&#2980;&#3015; &#2984;&#3015;&#2992;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#2993;&#3021;&#2970;&#3014;&#2991;&#2994;&#3006;&#2965; &#2951;&#2985;&#3021;&#2993;&#3007;, &#2953;&#2991;&#2992;&#3021;&#2990;&#2975;&#3021;&#2975; &#2965;&#2979;&#3007;&#2985;&#3007; &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965; 
&#2990;&#3018;&#2996;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2962;&#2992;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009; &#2958;&#2996;&#3009;&#2980;&#3007;&#2991; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3006;&#2985;&#2965; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
("&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;') &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2980;&#2980;&#3009;.  &#2951;&#2984;&#3021;&#2980; &#2980;&#3006;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3009;&#2990;&#3021; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;: &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2990;&#3018;&#2996;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2953;&#2980;&#2997;&#3007;&#2991;&#3006;&#2994;&#3021; &#2962;&#2992;&#3009; &#2997;&#3006;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2986;&#3018;&#2993;&#3007;&#2991;&#3007;&#2994;&#3016; 
&#2965;&#2979;&#3007;&#2985;&#3007; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#2997;&#2994;&#3016; &#2951;&#2985;&#3021;&#2993;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021;.  &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2990;&#3018;&#2996;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3007;&#2991;&#3006;&#2994;&#3021; 
&#2970;&#3014;&#2991;&#2994;&#3006;&#2965;&#3021;&#2965; &#2980;&#3007;&#2993;&#2985;&#3016; &#2965;&#3006;&#2992;&#2979;&#3007;&#2991;&#3006;&#2965; &#2997;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#2994;&#2980;&#2992; &#2986;&#2975;&#3021;&#2975; &#2965;&#2985;&#3007;&#2979;&#3007;&#2965;&#2995;&#3016; &#2962;&#2986;&#3021;&#2986;&#3008;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2992;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; 
&#2965;&#3009;&#2993;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2980;&#2985;&#2980;&#3009; &#2970;&#3018;&#2980;&#3021;&#2980;&#3006;&#2965; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021; &#2997;&#2985;&#3007;&#2965; 
&#2951;&#2994;&#3006;&#2986; &#2997;&#3007;&#2965;&#3007;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#2992;&#3007;&#2997;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2958;&#2980;&#3007;&#2992;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965; &#2984;&#3015;&#2992;&#3009;&#2990;&#3021;.  &#2970;&#3014;&#2991;&#2994;&#3006;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2986;&#3021; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2986;&#3019;&#2994;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3015; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2965;&#3006;&#2992;&#2985;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2950;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2951;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#3007;&#2993;&#3021;&#2986;&#2985;&#3016;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
&#2949;&#2980;&#2985;&#3016; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009; &#2949;&#2969;&#3021;&#2965;&#2990;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3009;&#2997;&#2980;&#3009;, &#2962;&#2992;&#3009; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2953;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2965; &#2990;&#2993;&#3007;&#2991;&#2980;&#3009;.</p><p>&#2949;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2986;&#2969;&#3021;&#2965;&#3007;&#2975;&#2986;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2970;&#3007;&#2965;&#3021;&#2965; &#2997;&#3006;&#2991;&#3021;&#2986;&#3009; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3021;&#2980;&#3009;.  &#2951;&#2980;&#2985;&#3006;&#2994;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016;&#2991;&#3016; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3006;&#2985;&#2992;&#3021;.    
&#2949;&#2980;&#3016; &#2990;&#3008;&#2993;&#3007;&#2991;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3009;&#2975;&#2985;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#3019;&#2992;&#3021;, 
"&#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021;" &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2986;&#3014;&#2991;&#2992;&#3007;&#2994;&#3021; &#2997;&#3007;&#2993;&#3021;&#2986;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2965;&#2995;&#3016; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3015; 
&#2958;&#2996;&#3009;&#2980; &#2984;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3021;&#2980;&#3009;.  &#2951;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2992;&#2979;&#3021;&#2986;&#3006;&#2975;&#3006;&#2965; &#2951;&#2979;&#3016;&#2991;&#2990;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;.  &#2949;&#2980;&#2994;&#3006;&#2994;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2986;&#2965;&#3007;&#2992;&#3021;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2980;&#3015;&#2997;&#3016; &#2986;&#2975;&#3021;&#2975; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2997;&#2970;&#2980;&#3007;&#2991;&#3009;&#2990;&#3021; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3006;&#2985;&#2980;&#3009;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2951;&#2970;&#3021;&#2970;&#2990;&#3016;&#2991;&#2990;&#3021; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2970;&#2984;&#3021;&#2980;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2980;&#2994;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986; &#2980;&#2965;&#3021;&#2965;&#2980;&#3006;&#2965; &#2951;&#2994;&#3021;&#2994;&#3016;, 
&#2962;&#2992;&#3009; &#2970;&#3007;&#2994; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2993;&#3021;&#2986;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; 
&#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2994;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2984;&#3015;&#2992;&#2975;&#3007;&#2991;&#3006;&#2965; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2992;&#2965;&#2970;&#3007;&#2991; &#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2990;&#3021; 
&#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2969;&#3021;&#2965;&#3008;&#2975;&#3021;&#2975;&#3016; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#2992;&#3021;. </p><div class="sect3" title="&#2951;&#2985;&#2969;&#3021;&#2965;&#2979;&#3021;&#2975;&#3009; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;"><div class="titlepage"><div><div><h4 class="title"><a name="history-conscious-resistance"></a>&#2951;&#2985;&#2969;&#3021;&#2965;&#2979;&#3021;&#2975;&#3009; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;</h4></div></div></div><p>&#2951;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2949;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2969;&#3021;&#2965;&#3008;&#2975;&#3009; &#2949;&#2996;&#3007;&#2984;&#3021;&#2980;&#3009; &#2997;&#2984;&#3021;&#2980; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#2992;&#3009;&#2995;&#3021; 
&#2997;&#2994;&#3021;&#2994;&#3009;&#2984;&#2992;&#3021; &#2990;&#2985;&#2980;&#3007;&#2994;&#3021; &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#3007;&#2992;&#3021; &#2997;&#3007;&#2985;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2958;&#2979;&#3021;&#2979;&#2990;&#3021; &#2997;&#2994;&#3009; &#2986;&#3014;&#2993;&#3021;&#2993;&#2980;&#3009;.
Richard Stallman 1970 &#2965;&#2995;&#3007;&#2994;&#3009;&#2990;&#3021; 80'-&#2985;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2997;&#3015;&#2994;&#3016;&#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2997;&#2984;&#3021;&#2980;  Massachusetts 
Institute of Technology-&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;  &#2970;&#3014;&#2991;&#2993;&#3021;&#2965;&#3016; &#2984;&#3009;&#2979;&#3021;&#2979;&#2993;&#3007;&#2997;&#3009; &#2950;&#2991;&#3021;&#2997;&#2965;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2969;&#3021;&#2965;&#3008;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2959;&#2993;&#3021;&#2993; 
&#2951;&#2975;&#2990;&#3021; &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#3018;&#2993;&#3021;&#2965;&#3006;&#2994;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.  &#2949;&#2984;&#3021;&#2980; &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2950;&#2995;&#2990;&#3006;&#2985; "&#3001;&#3015;&#2965;&#3021;&#2965;&#2992;&#3021; 
&#2984;&#3014;&#2993;&#3007;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3021;" &#2984;&#2975;&#3016;&#2990;&#3009;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;,<sup>[<a name="idp4718576" href="#ftn.idp4718576" class="footnote">3</a>]</sup> &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; 
&#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3007;&#2975;&#2990;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2980;&#3009;&#2975;&#2985;&#3021; &#2949;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2985;&#2992;&#3021;.  Stallman-&#2986;&#3007;&#2985;&#3021;&#2997;&#3006;&#2992;&#3009; &#2958;&#2996;&#3009;&#2980;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3016; &#2986;&#3019;&#2994;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2996;&#3009;&#2980;&#3007;&#2991; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; "&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;"&#2958;&#2985;&#3021;&#2993;&#3009; &#2949;&#2996;&#3016;&#2980;&#3021;&#2980;&#2980;&#3009; 
      &#2951;&#2994;&#3021;&#2994;&#3016; &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021; &#2949;&#2986;&#3021;&#2986;&#2975;&#3009; &#2962;&#2992;&#3009; &#2970;&#3018;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; 
      &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;.  &#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3014;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993; &#2986;&#2994;&#3021;&#2965;&#2994;&#3016;&#2965;&#2996;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
      &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007; &#2965;&#3015;&#2975;&#3021;&#2975;&#3006;&#2994;&#3009;&#2990;&#3021; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2992;&#2984;&#3021;&#2980; &#2990;&#2985;&#2980;&#3009;&#2975;&#2985;&#3021; &#2965;&#3018;&#2975;&#3009;&#2980;&#3021;&#2980;&#3019;&#2990;&#3021;.  &#2958;&#2997;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2986;&#2992;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993; 
      &#2970;&#3014;&#2991;&#2994;&#3007;&#2991;&#3016; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2965;&#3006;&#2975;&#3021;&#2975; &#2970;&#3018;&#2994;&#3021;&#2994;&#3007; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; 
      &#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;, &#2990;&#3006;&#2993;&#3021;&#2993;&#3007;&#2991;&#2990;&#3016;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; &#2986;&#3007;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#3009;&#2980;&#3007;&#2980;&#3006;&#2965; &#2962;&#2985;&#3021;&#2993;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.
      </em></span></p><p>(from <span class="bold"><strong><a class="ulink" href="http://www.gnu.org/gnu/thegnuproject.html" target="_top">gnu.org/gnu/thegnuproject.html</a></strong></span>)</p></blockquote></div><p>1908 &#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2985;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; AI &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; 
&#2949;&#2975;&#3016;&#2984;&#3021;&#2980; &#2986;&#3019;&#2980;&#3009;, Stallman-&#2960; &#2970;&#3009;&#2993;&#3021;&#2993;&#3007; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2950;&#2992;&#2990;&#3021;&#2986;&#2965;&#3006;&#2994; &#2965;&#3009;&#2994;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021;  &#2986;&#3007;&#2995;&#2997;&#3009;&#2986;&#2975;&#3021;&#2975;&#2985;.  &#2962;&#2992;&#3009; 
&#2980;&#3018;&#2975;&#2965;&#3021;&#2965; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2980;&#3016; &#2986;&#3019;&#2994;&#3021; &#2962;&#2992;&#3009; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2980;&#2995;&#2990;&#3021; &#2986;&#3007;&#2992;&#2980;&#3021;&#2991;&#3015;&#2965; &#2953;&#2992;&#3007;&#2990;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; 
&#2965;&#3008;&#2996;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2997;&#3014;&#2994;&#3016;&#2965;&#3021;&#2965;&#3009; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021; &#2965;&#3018;&#2985;&#3021;&#2975;&#2980;&#3009;.  &#2949;&#2980;&#3015; &#2984;&#3015;&#2992;&#2990;&#3021; AI &#2950;&#2991;&#3021;&#2997;&#2965;&#2990;&#3021; &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; 
&#2965;&#2992;&#3009;&#2997;&#3007;&#2991;&#3016; &#2997;&#3006;&#2969;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009; &#2949;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#2985;&#2990;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009; &#2980;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975; &#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3009;.</p><p>&#2949;&#2969;&#3021;&#2965;&#3015; &#2984;&#3007;&#2965;&#2996;&#3021;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2986;&#3006;&#2969;&#3021;&#2965;&#3007;&#2985;&#3016; &#3000;&#3021;&#2975;&#3006;&#2994;&#3021;&#2990;&#3014;&#2985;&#3021; &#2965;&#2979;&#3021;&#2975;&#3006;&#2992;&#3021;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#2949;&#2984;&#3021;&#2980; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; VAX &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 68020 &#2986;&#3019;&#2985;&#3021;&#2993; &#2984;&#2997;&#3008;&#2985; &#2965;&#2985;&#3007;&#2979;&#3007;&#2965;&#2995;&#3021; 
      &#2986;&#3007;&#2992;&#2980;&#3021;&#2991;&#3015;&#2965;&#2990;&#3006;&#2985; &#2970;&#3014;&#2991;&#2994;&#3007;&#2965;&#2995;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2949;&#2994;&#3021;&#2994;:
      	     &#2951;&#2991;&#2969;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991; &#2984;&#2965;&#2994;&#3016; &#2986;&#3014;&#2993; &#2965;&#3010;&#2975; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3006;&#2990;&#3016; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2990;&#3021; &#2965;&#3016;&#2991;&#3014;&#2996;&#3009;&#2980;&#3021;&#2980;&#3007;&#2975; 
         &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;</em></span> </p><p><span class="emphasis"><em>&#2949;&#2980;&#2985;&#3021; &#2949;&#2992;&#3021;&#2980;&#3021;&#2980;&#2990;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3015;&#2985;&#3021;&#2975;&#3007;&#2991; &#2990;&#3009;&#2980;&#2994;&#3021; &#2965;&#3006;&#2992;&#3007;&#2991;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997; 
      &#2990;&#3006;&#2975;&#3021;&#2975;&#3015;&#2985;&#3021; &#2958;&#2985; &#2953;&#2993;&#3009;&#2980;&#3007; &#2949;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;. &#2986;&#2969;&#3021;&#2965;&#3007;&#2975;&#3021;&#2975;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2985;. &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975; 
              &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#3007;&#2993;&#3021;&#2986;&#3021;&#2986;&#2997;&#2992;&#3007;&#2985;&#3021; &#2970;&#2975;&#3021;&#2975;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;, "&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3014;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2991;&#2997;&#2992;&#3009;&#2975;&#2985;&#3021; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; 
         &#2965;&#3018;&#2979;&#3021;&#2975;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#3016; &#2965;&#3018;&#2995;&#3021;&#2995;&#3016;&#2991;&#2992;&#3021;. &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2958;&#2969;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; 
         &#2965;&#3014;&#2974;&#3021;&#2970;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;."
      </em></span> </p></blockquote></div><p>&#2950;&#2995;&#3009;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2980;&#3007;&#2975;&#3008;&#2992;&#3021;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021;, &#2949;&#2997;&#2992;&#3021; &#2949;&#2984;&#3021;&#2980; &#2986;&#3015;&#3006;&#2965;&#3021;&#2965;&#3016; &#2958;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2992;&#3021;.
&#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2970;&#3007;&#2980;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; AI &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2997;&#2980;&#3016; &#2997;&#3007;&#2975;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#2985;&#2980;&#3009; &#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2962;&#2992;&#3009; 
&#2986;&#3014;&#2975;&#3021;&#2975;&#3007;&#2965;&#3021;&#2965;&#3009;&#2995;&#3021; &#2949;&#2975;&#3016;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; &#2986;&#3009;&#2980;&#3007;&#2991; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2997;&#3015;&#2994;&#3016; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2990;&#2994;&#3021;, &#2949;&#2997;&#2992;&#3021; &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2994;&#2965;&#3007; 
GNU &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;(FSF) &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#3006;&#2992;&#3021;.  
GNU<sup>[<a name="idp4812688" href="#ftn.idp4812688" class="footnote">4</a>]</sup> &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3019;&#2994;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; 
&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2970;&#3014;&#2991;&#2994;&#3007; &#2962;&#2985;&#3021;&#2993;&#3016; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3016; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009;, &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2984;&#3021;&#2980; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021; &#2990;&#3010;&#2994; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; 
&#2965;&#3018;&#2995;&#3021;&#2995; &#2958;&#2984;&#3021;&#2980;&#2997;&#3007;&#2980; &#2980;&#2975;&#3016;&#2965;&#2995;&#3009;&#2990;&#3021; &#2997;&#3007;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#3007;&#2975;&#3016;&#2991;&#3006;&#2980;&#3009;.  &#2949;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2958;&#2979;&#3021;&#2979;&#3007; &#2949;&#2997;&#2992;&#3021; &#2950;&#2991;&#3021;&#2997;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; 
&#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3016; &#2953;&#2994;&#2965;&#2990;&#3021; &#2990;&#3009;&#2996;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2970;&#3015;&#2992;&#3021;&#2965;&#3021;&#2965; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021; &#2949;&#2980;&#3015; &#2997;&#3015;&#2995;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2980;&#3009; &#2986;&#3007;&#2995;&#2997;&#3009; &#2986;&#2975; 
&#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2986;&#3006;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2953;&#2979;&#3021;&#2975;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991; &#2965;&#3006;&#2992;&#2979;&#3007; &#2951;&#2985;&#3021;&#2993;&#3007;.</p><p>&#2986;&#3009;&#2980;&#3007;&#2991; &#2970;&#3014;&#2991;&#2994;&#3007; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007; &#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980; &#2949;&#2980;&#3015; &#2997;&#3015;&#2994;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2949;&#2997;&#3016; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3007;&#2992;&#2984;&#3021;&#2980;&#2992;&#2990;&#3006;&#2965; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#3009; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; Stallman &#2986;&#3009;&#2980;&#3007;&#2991; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016; &#2962;&#2985;&#3021;&#2993;&#3016;&#2991;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#3006;&#2992;&#3021;.
&#2949;&#2980;&#3009; GNU General Public License (GPL) &#2958;&#2985;&#3021;&#2993; &#2986;&#3009;&#2980;&#3021;&#2980;&#3007;&#2970;&#3006;&#2994;&#3007;&#2980;&#2985;&#2990;&#3006;&#2985; &#2970;&#2975;&#3021;&#2975; &#2984;&#3009;&#2975;&#3021;&#2986;&#2990;&#3021;: &#2949;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3009;&#2990;&#3021; &#2953;&#2992;&#3007;&#2990;&#3016; &#2997;&#2995;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2980;&#3015; &#2970;&#2990;&#2991;&#2990;&#3021;, &#2990;&#3010;&#2994; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; 
&#2970;&#3014;&#2991;&#3021;&#2980;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980;&#2997;&#3007;&#2980; &#2965;&#3010;&#2975;&#3009;&#2980;&#2994;&#3021; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2980;&#3015; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016;&#2991;&#3009;&#2975;&#2985;&#3021; &#2986;&#2969;&#3021;&#2965;&#3007;&#2975;&#3021;&#2975;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2949;&#2980;&#2985;&#3021; &#2997;&#3007;&#2994;&#3016;&#2997;&#3006;&#2965; &#2949;&#2980;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016; &#2970;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2984;&#2975;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#3007;&#2992;&#3021; 
&#2997;&#3007;&#2985;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;: &#2949;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3006;&#2990;&#2994;&#3021;, &#2949;&#2980;&#3009; 
<span class="emphasis"><em>&#2949;&#2985;&#3016;&#2997;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021;</em></span>, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2985;&#3021; &#2950;&#2970;&#3007;&#2992;&#3007;&#2991;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021; &#2970;&#3015;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2949;&#2993;&#3021;&#2993; 
&#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#3010;&#2979;&#3021;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;.  Stallman-&#2965;&#3021;&#2965;&#3009; &#2951;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2986;&#3018;&#2980;&#3009; &#2965;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975;&#3009;&#2997;&#2980;&#3016; 
&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2951;&#2980;&#3009; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980;&#2980;&#3006;&#2965; &#2980;&#3019;&#2985;&#3021;&#2993;&#3007;&#2991;&#2980;&#3009;.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;  &#2986;&#3018;&#2980;&#3009; &#2965;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2958;&#2984;&#3021;&#2980; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#3007;&#2992;&#2980;&#3007;&#2991;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009; &#2965;&#3006;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3009;&#2975;&#2985;&#3021; &#2951;&#2979;&#3016;&#2965;&#3021;&#2965; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.
(&#2949;&#2980;&#3009; &#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2991;&#2995;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2965;&#3008;&#2996;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3009;&#2990;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; 
<sup>[<a name="idp4820896" href="#ftn.idp4820896" class="footnote">5</a>]</sup>).  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016; &#2990;&#3010;&#2994; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2965;&#3021;&#2965; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021; 
&#2949;&#2975;&#3016;&#2997;&#2980;&#3009; Stallman-&#2985;&#3007;&#2985;&#3021; &#2958;&#2980;&#3007;&#2992;&#3007;&#2965;&#2995;&#3021;&#8212;&#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;.  &#2949;&#2980;&#3009; 
&#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3018;&#2995;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;, 
&#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021; &#2949;&#2980;&#2985;&#3021; &#2990;&#3009;&#2996;&#3009; &#2986;&#2991;&#2985;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2965;&#3018;&#2995;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  GPL &#2990;&#2993;&#3021;&#2993;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993; 
&#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3007;&#2990;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995; &#2953;&#2993;&#2997;&#3009; &#2951;&#2969;&#3021;&#2965;&#3009; <a class="xref" href="legal.html" title="Chapter 10. Licenses, Copyrights, and Patents">Chapter 10, <i>Licenses, Copyrights, and Patents</i></a> &#2990;&#3007;&#2965; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; 
&#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.</p><p>Stallman-&#2960; &#2986;&#3019;&#2985;&#3021;&#2993; &#2958;&#2979;&#3021;&#2979;&#2990;&#3021; &#2986;&#2975;&#3016;&#2980;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; 
&#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3009;&#2990;&#3021; &#2951;&#2985;&#3016;&#2984;&#3021;&#2980;&#3009; &#2965;&#3009;&#2985;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3007; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2951;&#2991;&#2965;&#3021;&#2965;&#3007;&#2969;&#3021;&#2965;&#2995;&#3016; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975; &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3007;&#2985;&#2992;&#3021;.
&#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2965;&#3009;&#2985;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009; &#2951;&#2991;&#2965;&#3021;&#2965;&#3007;&#2965;&#2995;&#3016; &#2990;&#2993;&#3021;&#2993; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#2992;&#3009;&#2995;&#3021; &#2970;&#3014;&#2991;&#2994;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; 
&#2951;&#2991;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980;&#2980;&#3009;, &#2986;&#2994;&#2992;&#3021; &#2949;&#2980;&#3016; &#2951;&#2991;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#2985;&#2992;&#3021;.  &#2965;&#3009;&#2985;&#3009; &#2953;&#2992;&#3016; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007;(Emacs) &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3007; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007; 
(gcc)&#2951;&#2992;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#3018;&#2995;&#3021;&#2965;&#3016; &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2949;&#2985;&#3021;&#2993;&#3007; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2990;&#3007;&#2965;&#2986;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007; 
&#2986;&#3014;&#2993;&#3021;&#2993;&#2985;.  &#2965;&#3007;&#2975;&#3021;&#2975; &#2980;&#2975;&#3021;&#2975; 1990-&#2994;&#3021; &#2965;&#3009;&#2985;&#3009; &#2962;&#2992;&#3009; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009; &#2980;&#2994;&#2990;&#3021; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965; &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2965;&#2992;&#3021;&#2985;&#2994;&#3021; &#2980;&#2997;&#3007;&#2992; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;&#8212;&#2965;&#2992;&#3021;&#2985;&#2994;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2965;&#2985;&#3007;&#2979;&#3007;&#2991;&#3016; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2984;&#3007;&#2985;&#3016;&#2997;&#2965;&#2990;&#3021;, 
&#2997;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2993;&#3007; &#2997;&#2995;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3009;&#2990;&#3021; &#2965;&#3010;&#2975;&#3007;&#2991; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;.</p><p>&#2997;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#2965;&#3021;&#2965; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2965;&#3009;&#2985;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980; &#2965;&#2992;&#3021;&#2985;&#2994;&#3021; &#2997;&#2975;&#3009;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2958;&#2980;&#3007;&#2992;&#3021; &#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#2980;&#3016; &#2997;&#3007;&#2975; 
&#2958;&#2996;&#3009;&#2980;&#3009;&#2997;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965;&#3007; &#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#2975;&#3016;&#2991;&#3006;&#2994;&#3021; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2970;&#2990;&#3021;&#2986;&#3015;&#2995;&#2985;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2951;&#2991;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009; &#2980;&#2994;&#2980;&#3021;&#2980;&#3016; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975;&#2997;&#3009;&#2990;&#3021; &#2980;&#2975;&#3016;&#2991;&#3006;&#2965; 
&#2990;&#3006;&#2993;&#3007;&#2991;&#2980;&#3009;.  &#2949;&#2984;&#3021;&#2980; &#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2986;&#3006;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; Linus Torvalds &#2958;&#2985;&#3021;&#2993; &#2986;&#3007;&#2985;&#3021;&#2994;&#3006;&#2984;&#3021;&#2980;&#3009; &#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2993;&#3007; &#2990;&#3006;&#2979;&#2997;&#2992;&#3021;, 
&#2953;&#2994;&#2965;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2990;&#2993;&#3021;&#2993; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2995;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2953;&#2980;&#2997;&#3007;&#2991;&#3009;&#2975;&#2985;&#3021;, &#2958;&#2995;&#3007;&#2990;&#3016;&#2991;&#3006;&#2985; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; 
&#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2985;&#3006;&#2992;&#3021;.  &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2949;&#2997;&#2992;&#3021; Linux &#2958;&#2985;&#3021;&#2993;&#3009; &#2986;&#3014;&#2991;&#2992;&#3021; &#2997;&#3016;&#2980;&#3021;&#2980;&#3006;&#2992;&#3021;, &#2949;&#2980;&#3016; &#2990;&#2993;&#3021;&#2993; GNU &#2970;&#3014;&#2991;&#2994;&#3007;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; 
&#2951;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2951;&#2991;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; (&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; X Windows System) &#2949;&#2980;&#3009; &#2963;&#2992;&#3009; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2951;&#2994;&#2997;&#2970; &#2965;&#2979;&#3007;&#2985;&#3007; 
&#2951;&#2991;&#2969;&#3021;&#2965;&#3009; &#2980;&#2995;&#2990;&#3006;&#2965;&#3007;&#2991;&#2980;&#3009;.  &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2965; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2990;&#3006;&#2985; &#2962;&#2992;&#3009; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; 
&#2965;&#3018;&#2985;&#3021;&#2975;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2993;&#3007;&#2991;&#3016; &#2951;&#2991;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3021; &#2950;&#2985;&#2980;&#3009;.<sup>[<a name="idp4826864" href="#ftn.idp4826864" class="footnote">6</a>]</sup></p><p>&#2951;&#2984;&#3021;&#2980; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2986;&#2994; &#2970;&#3014;&#2991;&#2994;&#3007;&#2965;&#2995;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#3009;&#2985;&#3009;  &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2980;&#3009; 
&#2949;&#2994;&#3021;&#2994;.&#2953;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2965;&#3009;&#2985;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3021; &#2965;&#3009;&#2996;&#3009; 
&#2949;&#2994;&#3021;&#2994;(NetBSD &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; FreeBSD &#2958;&#2985;&#3021;&#2986;&#2985; &#2959;&#2993;&#3021;&#2965;&#3021;&#2965;&#2985;&#2997;&#3015; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;).  &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;
&#2949;&#2993;&#2965;&#3021;&#2965;&#2975;&#3021;&#2975;&#2995;&#3016;&#2991;&#3007;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2980;&#2985;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; 
&#2970;&#3018;&#2994;&#3021;&#2994;&#3006;&#2975;&#3021;&#2970;&#3007;&#2991;&#3006;&#2994;&#3021; &#2949;&#2990;&#3016;&#2984;&#3021;&#2980;&#3021;&#2980;&#3009;.  &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2962;&#2992;&#3009; &#2970;&#2994;&#3009;&#2965;&#3016;&#2991;&#3006;&#2965; &#2949;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2949;&#2980;&#3016; &#2962;&#2992;&#3009; &#2970;&#3015;&#2997;&#3016; 
&#2986;&#3019;&#2994;&#3021; &#2953;&#2979;&#2992; &#2997;&#3016;&#2980;&#3021;&#2980;&#3009;, &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;  &#2949;&#2980;&#2985;&#3021;  &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2997;&#3007;&#2996;&#3007;&#2986;&#3021;&#2986;&#3009;&#2979;&#2992;&#3021;&#2997;&#3009; &#2949;&#2993;&#3021;&#2993; &#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3016; 
<span class="emphasis"><em>&#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;</em></span> &#2970;&#3014;&#2991;&#3021;&#2980;&#2985;&#2992;&#3021;.  FSF  &#2953;&#2975;&#2985;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#3015;&#2992;&#3009;&#2986;&#3006;&#2975;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; 
&#2949;&#2980;&#2985;&#3007;&#2975;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2965;&#3006;&#2975;&#3021;&#2975; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2991;&#3016; &#2965;&#3016;&#2991;&#3006;&#2994; &#2984;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3021;&#2980;&#3009;.  FSF-&#2951;&#2985;&#3021; 
&#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#3006;&#2992;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; GPL &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2953;&#2992;&#3016;&#2990;&#3010;&#2994;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3019;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; 
&#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#2992;&#3021;.  &#2949;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#3010;&#2994;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3016;&#2997;&#3006;&#2965; &#2986;&#2992;&#2997;&#3009;&#2980;&#2994;&#3021; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; 
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2953;&#2975;&#2985;&#3021; &#2986;&#2992;&#2997;&#3007;&#2991;&#2980;&#3009;.</p></div><div class="sect3" title="&#2980;&#2993;&#3021;&#2970;&#3014;&#2991;&#2994;&#3006;&#2985; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;"><div class="titlepage"><div><div><h4 class="title"><a name="history-accidental-resistance"></a>&#2980;&#2993;&#3021;&#2970;&#3014;&#2991;&#2994;&#3006;&#2985; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;</h4></div></div></div><p>&#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3006;&#2994;&#2965;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2994; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3009;&#2992;&#2975;&#3021;&#2970;&#3007;&#2965;&#2995;&#3021; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#3009; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985; &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; Stallman &#2965;&#3009;&#2985;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2986;&#3019;&#2994;&#3021; &#2953;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2970;&#3007;&#2980;&#3021;&#2980;&#3006;&#2984;&#3021;&#2980;&#2990;&#3021; 
&#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985;&#2980;&#3009; <em class="firstterm">Berkeley Software Distribution
</em>(<em class="firstterm">BSD</em>), &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; &#2991;&#3009;&#2985;&#3007;&#2965;&#3021;&#8204;&#3000;&#3021; &#2970;&#3014;&#2991;&#2994;&#3007;&#2991;&#3007;&#2985;&#3021; &#2990;&#2993;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021;&#8212;1970 &#2997;&#2992;&#3016; &#2949;&#2980;&#3009; &#2990;&#3014;&#2994;&#3021;&#2994;&#3007;&#2991; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2953;&#2975;&#3016;&#2991; AT&amp;T &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2950;&#2991;&#3021;&#2997;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; 
&#8212;&#2986;&#3014;&#2992;&#3021;&#2965;&#3021;&#2994;&#3015;&#2991;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2965;&#2994;&#3007;&#2986;&#3019;&#2992;&#3021;&#2985;&#3007;&#2991;&#3006; &#2986;&#2994;&#3021;&#2965;&#2994;&#3016;&#2965;&#2996;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; 
&#2980;&#2991;&#3006;&#2992;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  BSD &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2993;&#2985;&#3009;&#2975;&#2985;&#3009;&#2990;&#3021; &#2965;&#3010;&#2975;&#3007;&#2991; &#2953;&#2993;&#3021;&#2970;&#3006;&#2965;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; 
&#2963;&#2993;&#3021;&#2993;&#3009;&#2990;&#3016; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2992;&#3000;&#3021;&#2986;&#2992;&#2990;&#3021; &#2986;&#2969;&#3021;&#2965;&#3007;&#2975;&#3021;&#2975;&#3009; &#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; <span class="emphasis"><em>&#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007;&#2985;&#2992;&#3021;</em></span> &#2950;&#2985;&#2994;&#3021; 
&#2949;&#2980;&#3016; &#2958;&#2984;&#3021;&#2980; &#2963;&#2992;&#3009; &#2970;&#2975;&#3021;&#2975; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;, &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#3010;&#2994;&#2990;&#3021; &#2949;&#2980;&#3008;&#2980;
&#2997;&#3015;&#2994;&#3016; &#2965;&#2995;&#3006;&#2985; &#2991;&#3009;&#2985;&#3007;&#2965;&#3021;&#3000;&#3021; &#2965;&#2975;&#3021;&#2975;&#2994;&#3016; &#2997;&#2992;&#3007; &#2986;&#2991;&#2985;&#3009;&#2975;&#3016;&#2990;&#3016;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3019;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; 
&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2993;&#3007; &#2970;&#3014;&#2991;&#2994;&#3007;&#2991;&#3007;&#2985;&#3021; &#2965;&#3014;&#2992;&#3021;&#2985;&#2994;&#3016;&#2991;&#3009;&#2990;&#3021;  &#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3006;&#2994;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2965;&#3018;&#2979;&#3021;&#2975;&#3015; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2985;&#2992;&#3021;.  &#2958;&#2985;&#2997;&#3015; BDS &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2991;&#2994;&#3021; &#2949;&#2993;&#3021;&#2993; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3009;&#2980;&#2994;&#3007;&#2985;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; 
&#2953;&#2980;&#3006;&#2992;&#2985;&#2990;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2986;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009;&#2975;&#2985;&#3021; &#2980;&#3018;&#2975;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; &#2986;&#2994; 
&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#2991;&#3007;&#2993;&#3021;&#2970;&#3021;&#2970;&#3007; &#2990;&#3016;&#2991;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.</p><p>Another crucible of cooperative development was the <em class="firstterm">X
Window System</em>, a free, network-transparent graphical
computing environment, developed at MIT in the mid-1980's in
partnership with hardware vendors who had a common interest in being
able to offer their customers a windowing system.  Far from opposing
proprietary software, the X license deliberately allowed proprietary
extensions on top of the free core&#8212;each member of the consortium
wanted the chance to enhance the default X distribution, and thereby
gain a competitive advantage over the other members.  X
Windows<sup>[<a name="idp4828480" href="#ftn.idp4828480" class="footnote">7</a>]</sup> itself was free
software, but mainly as a way to level the playing field between
competing business interests and increase standardization, not out of
some desire to end the 
dominance of proprietary software.  Yet another example, predating the
GNU project by a few years, was TeX, Donald Knuth's free,
publishing-quality typesetting system.  He released it under terms
that allowed anyone to modify and distribute the code, but not to call 
the result "TeX" unless it passed a very strict set of compatibility
tests (this is an example of the "trademark-protecting" class of free
licenses, discussed more in <a class="xref" href="legal.html" title="Chapter 10. Licenses, Copyrights, and Patents">Chapter 10, <i>Licenses, Copyrights, and Patents</i></a>).  Knuth wasn't
taking a stand one way or the other on the question of
free-versus-proprietary software; he just needed a better typesetting
system in order to complete his
<span class="emphasis"><em>real</em></span> goal&#8212;a book on computer
programming&#8212;and saw no reason not to release his system to the
world when done.</p></div><p>Without listing every project and every license, it's safe to
say that by the late 1980's, there was a lot of free software
available under a wide variety of licenses.  The diversity of licenses
reflected a corresponding diversity of motivations.  Even some of the
programmers who chose the GNU GPL were much less ideologically driven
than the GNU project itself was.  Although they enjoyed working on free
software, many developers did not consider proprietary software a
social evil.  There were people who felt a moral impulse to rid the
world of "software hoarding" (Stallman's term for non-free software),
but others were motivated more by technical excitement, or by the
pleasure of working with like-minded collaborators, or even by a
simple human desire for glory.  Yet by and large these disparate
motivations did not interact in destructive ways.  This may be
because software, unlike other creative forms like prose or the visual
arts, must pass semi-objective tests in order to be considered
successful: it must run, and be reasonably free of bugs.  This gives
all participants in a project a kind of automatic common ground, a
reason and a framework for working together without worrying too much
about qualifications or motivations beyond the technical.</p><p>Developers had another reason to stick together as well: it
turned out that the free software world was producing some very
high-quality code.  In some cases, it was demonstrably technically
superior to the nearest non-free alternative; in others, it was at
least comparable, and of course it always cost less.  While only a few
people might have been motivated to run free software on strictly
philosophical grounds, a great many people were happy to run it
because it did a better job.  And of those who used it, some
percentage were always willing to donate their time and skills to help
maintain and improve the software.</p><p>This tendency to produce good code was certainly not universal,
but it was happening with increasing frequency in free software
projects around the world.  Businesses that depended heavily on
software gradually began to take notice.  Many of them discovered that
they were already using free software in day-to-day operations, and
simply hadn't known it (upper management isn't always aware of
everything the IT department does).  Corporations began to take a more
active and public role in free software projects, contributing time
and equipment, and sometimes even directly funding the development of
free programs.  Such investments could, in the best scenarios, repay
themselves many times over.  The sponsor only pays a small number of
expert programmers to devote themselves to the project full time, but
reaps the benefits of <span class="emphasis"><em>everyone's</em></span> contributions,
including work from unpaid volunteers and from programmers being paid
by other corporations.</p></div><div class="sect2" title='"Free" Versus "Open Source"'><div class="titlepage"><div><div><h3 class="title"><a name="free-vs-open-source"></a>"Free" Versus "Open Source"</h3></div></div></div><p>As the corporate world gave more and more attention to free
software, programmers were faced with new issues of presentation.  One
was the word "free" itself.  On first hearing the term "free software"
many people mistakenly think it means just "zero-cost software."  It's
true that all free software is zero-cost,<sup>[<a name="idp4858208" href="#ftn.idp4858208" class="footnote">8</a>]</sup>
but not all zero-cost software is free as in "freedom"&#8212;that is,
the freedom to share and modify for any purpose.  For example, during the
battle of the browsers in the 1990s, both Netscape and Microsoft gave
away their competing web browsers at no charge, in a scramble to gain
market share.  Neither browser was free in the "free software" sense.
You couldn't get the source code, and even if you could, you didn't
have the right to modify or redistribute it.<sup>[<a name="idp4848896" href="#ftn.idp4848896" class="footnote">9</a>]</sup>
The only thing
you could do was download an executable and run it.  The browsers were
no more free than shrink-wrapped software bought in a store; they
merely had a lower price.</p><p>This confusion over the word "free" is due entirely to an
unfortunate ambiguity in the English language.  Most other tongues
distinguish low prices from liberty (the distinction between
<span class="emphasis"><em>gratis</em></span> and <span class="emphasis"><em>libre</em></span> is
immediately clear to speakers of Romance languages, for example).  But
English's position as the de facto bridge language of the Internet
means that a problem with English is, to some degree, a problem for
everyone.  The misunderstanding around the word "free" was so
prevalent that free software programmers eventually evolved a standard
formula in response: "It's <span class="emphasis"><em>free</em></span> as in
<span class="emphasis"><em>freedom</em></span>&#8212;think <span class="emphasis"><em>free
speech</em></span>, not <span class="emphasis"><em>free beer</em></span>."  Still, having
to explain it over and over is tiring.  Many programmers felt, with
some justification, that the ambiguous word "free" was hampering the
public's understanding of this software.</p><p>But the problem went deeper than that.  The word "free" carried
with it an inescapable moral connotation: if freedom was an end in
itself, it didn't matter whether free software also happened to
be better, or more profitable for certain businesses in certain
circumstances.  Those were merely pleasant side effects of a motive
that was, at its root, neither technical nor mercantile, but moral.
Furthermore, the "free as in freedom" position forced a glaring
inconsistency on corporations who wanted to support particular free
programs in one aspect of their business, but continue marketing
proprietary software in others.</p><p>These dilemmas came to a community that was already poised for
an identity crisis.  The programmers who actually
<span class="emphasis"><em>write</em></span> free software have never been of one mind
about the overall goal, if any, of the free software movement.  Even
to say that opinions run from one extreme to the other would be
misleading, in that it would falsely imply a linear range where there
is instead a multidimensional scattering.  However, two broad
categories of belief can be distinguished, if we are willing to ignore
subtleties for the moment.  One group takes Stallman's view, that the
freedom to share and modify is the most important thing, and that
therefore if you stop talking about freedom, you've left out the core
issue.  Others feel that the software itself is the most important
argument in its favor, and are uncomfortable with proclaiming
proprietary software inherently bad.  Some, but not all, free
software programmers believe that the author (or employer, in the case
of paid work)
<span class="emphasis"><em>should</em></span> have the right to control the terms of
distribution, and that no moral judgement need be attached to the
choice of particular terms.  Others don't believe this.</p><p>For a long time, these differences did not need to be carefully
examined or articulated, but free software's burgeoning success in the
business world made the issue unavoidable.  In 1998, the term
<em class="firstterm">open source</em> was created as an alternative
to "free", by a coalition of programmers who eventually became The
Open Source Initiative (OSI).<sup>[<a name="idp4869232" href="#ftn.idp4869232" class="footnote">10</a>]</sup>  The OSI felt
not only that "free software" was potentially confusing, but that the
word "free" was just one symptom of a general problem: that the
movement needed a marketing program to pitch it to the corporate
world, and that talk of morals and the social benefits of sharing
would never fly in corporate boardrooms.  In their own words at the
time:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>The Open Source Initiative is a marketing
      program for free software. It's a pitch for "free software" on
      solid pragmatic grounds rather than ideological
      tub-thumping. The winning substance has not changed, the losing
      attitude and symbolism have. ...</em></span></p><p><span class="emphasis"><em>The case that needs to be made to most techies
      isn't about the concept of open source, but the name. Why not
      call it, as we traditionally have, free software?</em></span></p><p><span class="emphasis"><em>One direct reason is that the term "free
      software" is easily misunderstood in ways that lead to
      conflict. ...</em></span></p><p><span class="emphasis"><em>But the real reason for the re-labeling is a
      marketing one. We're trying to pitch our concept to the
      corporate world now. We have a winning product, but our
      positioning, in the past, has been awful. The term "free
      software" has been misunderstood by business persons, who
      mistake the desire to share with anti-commercialism, or worse,
      theft.</em></span></p><p><span class="emphasis"><em>Mainstream corporate CEOs and CTOs will never
      buy "free software." But if we take the very same tradition, the
      same people, and the same free-software licenses and change the
      label to "open
      source" &#8212; <span class="emphasis"><em>that</em></span>, they'll
      buy.</em></span></p><p><span class="emphasis"><em>Some hackers find this hard to believe, but
      that's because they're techies who think in concrete,
      substantial terms and don't understand how important image is
      when you're selling something.</em></span></p><p><span class="emphasis"><em>In marketing, appearance is reality. The
      appearance that we're willing to climb down off the barricades
      and work with the corporate world counts for as much as the
      reality of our behavior, our convictions, and our
      software.</em></span></p><p>(from <a class="ulink" href="http://www.opensource.org/" target="_top">opensource.org</a>.  Or
      rather, <span class="emphasis"><em>formerly</em></span> from that
      site &#8212; the OSI has apparently taken down the
      pages since then, although they can still be seen at 
      <a class="ulink" href="http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php" target="_top">web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php</a>
      and
      <a class="ulink" href="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing" target="_top">web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing</a> [sic].)</p></blockquote></div><p>The tips of many icebergs of controversy are visible in that
text.  It refers to "our convictions", but smartly avoids spelling out
exactly what those convictions are.  For some, it might be the
conviction that code developed according to an open process will be
better code; for others, it might be the conviction that all
information should be shared.  There's the use of the word "theft" to
refer (presumably) to illegal copying&#8212;a usage that many object
to, on the grounds that it's not theft if the original possessor still
has the item afterwards.  There's the tantalizing hint that the free
software movement might be mistakenly accused of anti-commercialism,
but it leaves carefully unexamined the question of whether such an
accusation would have any basis in fact.</p><p>None of which is to say that the OSI's web site is inconsistent
or misleading.  It's not.  Rather, it is an example of exactly what
the OSI claims had been missing from the free software movement: good
marketing, where "good" means "viable in the business world."  The
Open Source Initiative gave a lot of people exactly what they had been
looking for&#8212;a vocabulary for talking about free software as a
development methodology and business strategy, instead of as a moral
crusade.</p></div><p>The appearance of the Open Source Initiative changed the
landscape of free software.  It formalized a dichotomy that had long
been unnamed, and in doing so forced the movement to acknowledge that
it had internal politics as well as external.  The effect today is
that both sides have had to find common ground, since most projects
include programmers from both camps, as well as participants who don't
fit any clear category.  This doesn't mean people never talk about
moral motivations&#8212;lapses in the traditional "hacker ethic" are
sometimes called out, for example.  But it is rare for a free software
/ open source developer to openly question the basic motivations of
others in a project.  The contribution trumps the contributor.  If
someone writes good code, you don't ask them whether they do it for
moral reasons, or because their employer paid them to, or because
they're building up their résumé, or whatever.  You evaluate
the contribution on technical grounds, and respond on technical
grounds.  Even explicitly political organizations like the Debian
project, whose goal is to offer a 100% free (that is, "free as in
freedom") computing environment, are fairly relaxed about integrating
with non-free code and cooperating with programmers who don't share
exactly the same goals.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp4646816" href="#idp4646816" class="para">2</a>] </sup>&#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2953;&#2980;&#2997;&#3007;&#2965;&#3018;&#2985;&#3021;&#2975;&#3009; &#2984;&#3006;&#2985;&#3021; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;
&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2984;&#3010;&#2993;&#3009; &#2990;&#3009;&#2980;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3010;&#2993;&#3009;&#2993;&#3006;&#2991;&#3021;&#2992;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2958;&#2979;&#3021;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; 
&#2958;&#2979;&#3021;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021; &#2958;&#2985;&#3021;&#2985;&#3009;&#2975;&#3016;&#2991; &#2958;&#2979;&#3021;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2997;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4718576" href="#idp4718576" class="para">3</a>] </sup>-&#2985;&#3021; &#2997;&#2992;&#3016;&#2991;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; "&#3001;&#3015;&#2965;&#3021;&#2965;&#2992;&#3021;" &#2958;&#2985;&#3021;&#2986;&#2997;&#2992;&#3021; 
"&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2958;&#2996;&#3009;&#2980;&#3009;&#2997;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2984;&#3015;&#2970;&#3007;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2986;&#3014;&#2992;&#3009;&#2990;&#3016; &#2986;&#2975;&#3021;&#2975;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#2992;&#3021;" 
&#2990;&#3006;&#2993;&#3006;&#2965; "&#2965;&#2985;&#3007;&#2979;&#3007;&#2965;&#2995;&#3016; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2965;&#2975;&#3021;&#2975;&#3009; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;" &#2949;&#2994;&#3021;&#2994;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4812688" href="#idp4812688" class="para">4</a>] </sup>&#2949;&#2980;&#2985;&#3021; &#2997;&#3007;&#2992;&#3007;&#2997;&#3006;&#2965;&#3021;&#2965;&#2990;&#3021; "GNU's Not Unix", &#2951;&#2980;&#3007;&#2994;&#3021; "GNU" 
&#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#2993;&#3021;&#2993; &#2949;&#2975;&#3007;&#2965;&#3021;&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3007;&#2985;&#3021; &#2970;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021;</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4820896" href="#idp4820896" class="para">5</a>] </sup>&#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2991;&#2995;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; GPL-style "&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016; &#2949;&#2993;&#3021;&#2993;" &#2953;&#2992;&#3007;&#2990;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2975;&#3016;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; 
&#2997;&#3015;&#2993;&#3021;&#2993;&#3009;&#2990;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;<a class="xref" href="legal.html#licenses-terminology" title="Terminology">the section called &#8220;Terminology&#8221;</a>.  opensource.org &#2951;&#2994;&#3021; 
&#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; FAQ-&#2997;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3016;&#2991;&#2990;&#3021; &#8212;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;<a class="ulink" href="http://opensource.org/faq#copyleft" target="_top">opensource.org/faq#copyleft</a>.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4826864" href="#idp4826864" class="para">6</a>] </sup>&#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2994;&#3007;&#2985;&#2965;&#3021;&#8204;&#3000;&#3021; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2985; &#2951;&#2994;&#2997;&#2970; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2980;&#2995;&#2990;&#3021;  &#2949;&#2994;&#3021;&#2994;.  &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2970;&#2993;&#3021;&#2993;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3015; 386BSD &#2958;&#2985;&#3021;&#2993; IBM 
&#2965;&#2979;&#3007;&#2985;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2980;&#2995;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3006;&#2965;&#3007;&#2991;&#2980;&#3009;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#2985;&#3016;  &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2951;&#2991;&#2965;&#3021;&#2965; 
&#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.  Linux-&#2985;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007; &#2949;&#2980;&#3009; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2990;&#3006;&#2965; &#2951;&#2991;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3006;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
&#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2980;&#2985;&#3016; &#2984;&#3007;&#2993;&#3009;&#2997;&#3007;&#2991; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2949;&#2980;&#3016; &#2951;&#2991;&#2965;&#3021;&#2965; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;&#2990;&#3021; &#2958;&#2995;&#3007;&#2990;&#3016;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021;.
</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4828480" href="#idp4828480" class="para">7</a>] </sup>They prefer it to be called the "X Window
System", but in practice, people usually call it "X Windows", because
three words is just too cumbersome.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4858208" href="#idp4858208" class="para">8</a>] </sup>One may charge
a fee for giving out copies of free software, but since one cannot
stop the recipients from offering it at no charge afterwards, the
price is effectively driven to zero immediately.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4848896" href="#idp4848896" class="para">9</a>] </sup>The source
code to Netscape Navigator
<span class="emphasis"><em>was</em></span> eventually released under an open source
license, in 1998, and became the foundation for the Mozilla web
browser.  See <a class="ulink" href="http://www.mozilla.org/" target="_top">mozilla.org</a>.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp4869232" href="#idp4869232" class="para">10</a>] </sup>OSI's web home is <a class="ulink" href="http://www.opensource.org/" target="_top">opensource.org</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="disclaimer.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="today.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2986;&#3014;&#3006;&#2993;&#3009;&#2986;&#3021;&#2986;&#3006;&#2965;&#3006;&#2990;&#3016; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> The Situation Today</td></tr></table></div></body></html>
