<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><link rel="prev" href="web-site.html" title="&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;"><link rel="next" href="vc.html" title="Version Control"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="web-site.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</th><td width="20%" align="right"> <a accesskey="n" href="vc.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="message-forums"></a>&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;</h2></div></div></div><a name="mailing-lists"></a><p>&#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2980;&#2965;&#2997;&#2994;&#3021; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3014;&#2965;&#3009; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021;  &#2970;&#2990;&#2992;&#3021;&#2986;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2980;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2986;&#3014;&#2992;&#2997;&#3009;&#2990;&#3021;
&#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;&#2980;&#3006;&#2985;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2959;&#2993;&#3021;&#2993;&#2997;&#3016;.  &#2984;&#3008;&#2979;&#3021;&#2975; &#2984;&#3006;&#2975;&#3021;&#2965;&#2995;&#3006;&#2965; &#2951;&#2980;&#3009; &#2990;&#3007;&#2985;&#2974;&#3021;&#2970;&#2994;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; 
&#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2997;&#2994;&#3016; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; &#2951;&#2975;&#3016;&#2991;&#3015; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021; &#2984;&#2994;&#3021;&#2994; &#2997;&#3015;&#2994;&#3016;&#2991;&#3006;&#2965; &#2949;&#2980;&#3009; &#2990;&#3014;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#2993;&#3016;&#2984;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;. <a class="ulink" href="https://groups.google.com/" target="_top">Google Groups</a> 
(&#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;) &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
<a class="ulink" href="http://Gmane.org/" target="_top">Gmane.org</a> 
(&#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021;) &#2986;&#3019;&#2985;&#3021;&#2993; &#2970;&#3015;&#2997;&#3016;&#2965;&#2995;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3007;&#2985;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; 
&#2951;&#2975;&#3016;&#2991;&#3014; &#2965;&#3009;&#2993;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2979;&#3009;&#2965;&#3009;&#2990;&#3009;&#2993;&#3016;&#2965;&#3021;&#2965;&#3009; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2965;&#3021; &#2965;&#3010;&#2993;&#3009;&#2965;&#2995;&#3016; &#2958;&#2995;&#3007;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2984;&#2997;&#3008;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; 
&#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3006;&#2985; GroupServer &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; Sympa &#2951;&#2980;&#3016; &#2986;&#3007;&#2992;&#2980;&#3007;&#2986;&#2994;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.</p><p>&#2990;&#3007;&#2985;&#3021;&#2985;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2994;&#3016;-&#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2975;&#3016;&#2991;&#3015; &#2960;&#2965;&#3021;&#2965;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;  &#2965;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#2975;&#3021;&#2975; &#2984;&#3007;&#2993;&#3016;&#2997;&#3009; 
&#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#3006;&#2994;&#3009;&#2990;&#3021;<sup>[<a name="idp6367024" href="#ftn.idp6367024" class="footnote">26</a>]</sup>
<em class="firstterm">&#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2990;&#3021;</em> &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
<em class="firstterm">&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;</em> &#2958;&#2985;&#3021;&#2993; &#2997;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3016;&#2965;&#2995;&#3016; &#2990;&#3006;&#2993;&#3007; &#2990;&#3006;&#2993;&#3007; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3015;&#2985;&#3021;.
&#2949;&#2980;&#3009;  &#2997;&#2993;&#3021;&#2993;&#3016;&#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3006;&#2994;&#3021; &#2951;&#2979;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2980;&#2995;&#2980;&#3021;&#2980;&#3016;&#2965;&#3021; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3009; (&#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021;)&#2962;&#2985;&#3021;&#2993;&#3006;&#2965; 
&#2986;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2959;&#2993;&#3021;&#2965;&#3021;&#2965; &#2997;&#2994;&#3021;&#2994; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#3007;&#2985;&#3021;&#2985;&#2974;&#3021;&#2970;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2962;&#2992;&#3009; &#2951;&#2979;&#3016;&#2991; &#2953;&#2994;&#3006;&#2997;&#3007; &#2990;&#3010;&#2994;&#2990;&#3021;
&#2950;&#2997;&#2979;&#2965;&#3021;&#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2965;&#2975;&#2984;&#3021;&#2980; &#2965;&#3006;&#2994;  &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2953;&#2994;&#3006;&#2980;&#2965;&#3021;&#2965; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.</p><p>&#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2980;&#3006;&#2985;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#2994;&#3016; &#2980;&#2997;&#3007;&#2992; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021;  &#2949;&#2993;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2954;&#2975;&#2965;&#2990;&#3021; &#2949;&#2965;&#3009;&#2990;&#3021;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021; 
&#2990;&#2985;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#2985;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3021; &#2986;&#3014;&#2992; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.
&#2958;&#2985;&#2997;&#3014; &#2986;&#3018;&#2980;&#3009;&#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2985; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2990;&#2985;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#3009;&#2990;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; 
&#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2986;&#3009;&#2980;&#3009;&#2990;&#3009;&#2965;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#3016; &#2953;&#2994;&#2997; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2958;&#2969;&#3021;&#2965;&#3009; &#2990;&#3009;&#2980;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;
 &#2958;&#2985; &#2980;&#3008;&#2992;&#3021;&#2990;&#3006;&#2985;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2965;&#3006;&#2975;&#3021;&#2975;&#2994;&#3021; &#2965;&#3014;&#3006;&#2975;&#3009;&#2965;&#3021;&#2965;  &#2951;&#2980;&#3009; &#2980;&#3006;&#2985;&#3021; &#2953;&#2980;&#2997;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991;&#2980;&#3018;&#2992;&#3009; &#2986;&#3014;&#3006;&#2980;&#3009;&#2997;&#3006;&#2985; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2990;&#3021; &#2986;&#3007;&#2985;&#3021; &#2997;&#2992;&#3009;&#2997;&#2980;&#3009; 
 &#2986;&#3015;&#3006;&#2985;&#3021;&#2993; &#2959;&#2980;&#3006;&#2997;&#2980;&#3009; &#2970;&#3014;&#3006;&#2994;&#3021;&#2994; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;;</p><pre class="screen">
	&#2951;&#2984;&#3021;&#2980; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; Scanley &#2970;&#2990;&#3010;&#2965;&#2990;&#3021; &#2980;&#3007;&#2985;&#2984;&#3021;&#2980;&#3019;&#2992;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2985; &#2980;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;.
	&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;  &#2965;&#3009;&#2996;&#3009;&#2970;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2951;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; 
	&#2986;&#2980;&#3007;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; (&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2984;&#3021;&#2980;&#3006;&#2980;&#3006;&#2992;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2997;&#3007;&#2975;&#3021;&#2975;&#3006;&#2994;&#3009;&#2990;&#3021;) &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2991;&#3016; &#2962;&#2992;&#3009; &#2990;&#2985;&#3007;&#2980; &#2949;&#2969;&#3021;&#2965;&#3007;&#2965;&#2992;&#3007;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021; 
	&#2949;&#2980;&#3009; &#2980;&#3006;&#2985;&#3007;&#2991;&#2969;&#3021;&#2965;&#3007;&#2991;&#3006;&#2994;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#2991;&#2985;&#3021;&#2993;&#3021;&#2993; &#2953;&#2995;&#3021;&#2995;&#3008;&#2975;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2993;&#3009;&#2980;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2997;&#2992;&#3007;&#2970;&#3016;&#2991;&#3007;&#2994;&#3021; 
	&#2949;&#2990;&#2992;&#3021;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2984;&#3021;&#2980; &#2980;&#3006;&#2990;&#2980;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2990;&#2985;&#3021;&#2985;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;; &#2949;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2951;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021;&#2993;&#3021;&#2993; &#2953;&#2995;&#3021;&#2995;&#3008;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; 
	&#2950;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.

	Scanley &#2986;&#3007;&#2985;&#3021;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; :

      <span class="bold"><strong><code class="literal">users {_AT_} scanley.org</code></strong></span>:
    Scanley-&#2997;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; Scanley API &#2965;&#3018;&#2985;&#3021;&#2975;&#3009; &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2986;&#2993;&#3021;&#2993;&#3007;,
    &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3006;&#2985; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2986;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2970;&#2992;&#3021;&#2984;&#3021;&#2980; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;. &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021;@ 
    &#2970;&#3014;&#2991;&#3021;&#2980; &#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2969;&#3021;&#2965;&#2995;&#3016; <span class="bold"><strong>&lt;&lt;&lt;link to archive&gt;&gt;&gt;</strong></span> 
    &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; <span class="bold"><strong>&lt;&lt;&lt;link to subscribe&gt;&gt;&gt;</strong></span>-&#2991;&#3007;&#2994;&#3021;
    &#2953;&#2994;&#2997; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.

<span class="bold"><strong><code class="literal">dev {_AT_} scanley.org</code></strong></span>:
    Scanley &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3015;&#2979;&#3009;&#2965;&#3016;&#2965;&#3021;&#2965;&#3006;&#2965; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021;  &#2951;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2970;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#3006;&#2992;&#3021;,  
   &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021;@ &#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; <span class="bold"><strong>&lt;&lt;&lt;link to archive&gt;&gt;&gt;</strong></span> 
    &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; subscribe here: <span class="bold"><strong>&lt;&lt;&lt;link to subscribe&gt;&gt;&gt;</strong></span>-&#2994;&#3021; &#2953;&#2994;&#2997; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;

    (&#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009; users@ &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; dev@ &#2951;&#2975;&#3016;&#2991;&#3015; &#2965;&#2975;&#2984;&#3021;&#2980;&#3009;  &#2970;&#2994;&#3021;&#2994;&#2994;&#3006;&#2990;&#3021;.
    &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2980;&#3018;&#2975;&#2992;&#3021;&#2965;&#2995;&#3007;&#2995;&#3009;&#2990;&#3021; &#2986;&#2969;&#3021;&#2965;&#3009; &#2986;&#3014;&#2992;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2986;&#3014;&#3006;&#2980;&#3009;&#2997;&#3006;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2969;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2986;&#2980;&#3007;&#2997;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2953;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021;
<code class="literal">users@</code>-&#2994;&#3021; &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;. &#2949;&#2980;&#3009;  &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; 
<code class="literal">dev@</code>-&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2994;&#3021;&#2994; &#2991;&#3006;&#2992;&#3006;&#2997;&#2980;&#3009; &#2986;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.)

  <span class="bold"><strong><code class="literal">announcements {_AT_} scanley.org</code></strong></span>:
&#2951;&#2980;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3006;&#2985; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2986;&#3019;&#2965;&#3021;&#2965;&#3009;&#2997;&#2992;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;.  
&#3000;&#3021;&#2965;&#3006;&#2985;&#3021;&#2994;&#3007; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2997;&#3021;&#2997;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#3000;&#3021;&#2965;&#3006;&#2985;&#3021;&#2994;&#3007; &#2965;&#3009;&#2996;&#3009; &#2990;&#3009;&#2994;&#3009;&#2997;&#2980;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3006;&#2985; &#2997;&#3015;&#2992;&#3009; &#2970;&#3007;&#2994; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; 
users@ &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; dev@-&#2951;&#2994;&#3021; &#2984;&#2975;&#3016;&#2986;&#3014;&#2992;&#3009;&#2990;&#3021;.
    <span class="bold"><strong>&lt;&lt;&lt;&#2986;&#2980;&#3007;&#2997;&#3009; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007;&gt;&gt;&gt;</strong></span>.

  <span class="bold"><strong><code class="literal">notifications {_AT_} scanley.org</code></strong></span>:
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021;, &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2985;&#3007;&#2986;&#3021;&#2986;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021;, &#2980;&#3006;&#2985;&#3007;&#2991;&#2969;&#3021;&#2965;&#3009; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;/&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021;,
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994; &#2951;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#2991;&#2994;&#3007;&#2994;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;.  &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2986;&#3014;&#2992; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;:
<span class="bold"><strong>&lt;&lt;&lt;&#2986;&#2980;&#3007;&#2997;&#3009; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007;&gt;&gt;&gt;</strong></span>.

  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2970;&#2984;&#3021;&#2980; &#2986;&#3014;&#2993;&#3021;&#2993; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3009;&#2986;&#3021;&#2986;&#2994;&#3006;&#2990;&#3021;:

  <span class="bold"><strong><code class="literal">security {_AT_} scanley.org</code></strong></span>:
    &#3000;&#3021;&#2965;&#3006;&#2985;&#3021;&#2994;&#3007; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2993;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2951;&#2992;&#2965;&#2970;&#3007;&#2991; &#2949;&#2993;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3016; &#2951;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021;
    &#2986;&#3014;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2951;&#2997;&#3016; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2986;&#3018;&#2980;&#3009; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2986;&#3007;&#2996;&#3016; &#2965;&#3006;&#2992;&#2979;&#3007;&#2991;&#3016; 
    &#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2951;&#2992;&#2965;&#2970;&#3007;&#2991;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;; &#2958;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2986;&#2993;&#3021;&#2993;&#3007; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; 
    [...]
</pre><div class="sect2" title="&#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#2985;&#3021;&#2993; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="message-forum-choosing"></a>&#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#2985;&#3021;&#2993; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021;</h3></div></div></div><p>&#2962;&#2992;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2970;&#3014;&#2991;&#2994;&#3007;&#2991;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2970;&#3007;&#2993;&#3007;&#2980;&#3009; &#2984;&#3015;&#2992;&#2990;&#3021; 
&#2970;&#3014;&#2994; &#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021; &#2980;&#2992;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2984;&#2997;&#3008;&#2985; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2970;&#3014;&#2991;&#2994;&#3007; 
&#2986;&#3007;&#2985;&#3021; &#2997;&#2992;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016;&#2991;&#3006;&#2997;&#2980;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#3016;:</p><div class="variablelist"><dl><dt><span class="term">&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2985;&#3016;&#2991; &#2997;&#2996;&#3007; &#2949;&#2979;&#3016;&#2965;&#2994;&#3021;</span></dt><dd><p>&#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2997;&#2996;&#3008;&#2991;&#3006;&#2965; &#2970;&#2984;&#3021;&#2980; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2997;&#2970;&#2980;&#3007; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; 
		&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2951;&#2985;&#3016;&#2991;&#2980;&#3007;&#2994;&#3021; &#2986;&#2975;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007;&#2991;&#3009;&#2990;&#3016; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; 
		(&#2949;&#2969;&#3021;&#2965;&#3009; &#2949;&#2997;&#3016; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2985;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2949;&#2997;&#3016; &#2953;&#2992;&#3016;&#2991;&#3006;&#2975;&#2994;&#3021; 
		&#2965;&#3019;&#2997;&#3016;&#2965;&#2995;&#3006;&#2965;&#2997;&#3019; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#3018;&#2975;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3019; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;).</p></dd><dt><span class="term">&#2990;&#3007;&#2980;&#2990;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021;</span></dt><dd><p>"&#2990;&#3007;&#2980;&#2990;&#3006;&#2965;&#3021;&#2965;&#2994;&#3021;" &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2986;&#2992;&#3007;&#2970;&#3021;&#2970;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; &#2990;&#3009;&#2980;&#2994;&#3021; &#2990;&#3009;&#2993;&#3016; 
		&#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2990;&#3009;&#2996;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2970;&#3014;&#2994;&#3021;&#2994;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3021; &#2986;&#2980;&#2975;&#3007;&#2965;&#2995;&#3021; 
		&#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2980;&#2994;&#3021;.  "&#2990;&#3007;&#2980;&#2990;&#3006;&#2965;&#3021;&#2965;&#2994;&#3021;" &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2990;&#2985;&#3007;&#2980; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3021;&#2970;&#3007; 
		&#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;, &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2949;&#2984;&#3021;&#2980; &#2997;&#3015;&#2994;&#3016;&#2991;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965;&#3021;&#2965; 
		&#2965;&#3010;&#2975;&#3009;&#2990;&#3021;.  &#2990;&#3007;&#2980;&#2990;&#3006;&#2965;&#3021;&#2965;&#2994;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2980;&#2965;&#2997;&#2995;&#3021;&#2965;&#2995;&#3021; 
		<a class="xref" href="message-forums.html#spam-prevention" title="&#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;">the section called &#8220;&#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;&#8221;</a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980; 
		&#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2951;&#2993;&#3007;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2985;.</p></dd><dt><span class="term">&#2953;&#2991;&#2992;&#3021;&#2980;&#2992; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965; &#2951;&#2975;&#3016;&#2990;&#3009;&#2965;&#2990;&#3021;</span></dt><dd><p>&#2986;&#2980;&#2975;&#3007;&#2965;&#2995;&#3016; &#2965;&#2975;&#3021;&#2975;&#3009; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2994;&#3021;&#2997;&#3015;&#2992;&#3009; &#2986;&#2979;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;
		 &#8212; &#2953;&#2980;&#3006;&#2992;&#2985;&#2990;&#3006;&#2965;, &#2997;&#2996;&#2965;&#3021;&#2965;&#2993;&#3021;&#2993; &#2990;&#3009;&#2965;&#2997;&#2992;&#3007;&#2965;&#2995;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009;, "&#2984;&#3006;&#2985;&#3021; &#2951;&#2984;&#3021;&#2980; 
		&#2990;&#3009;&#2965;&#2997;&#2992;&#3007;&#2991;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;" &#2958;&#2985;&#3021;&#2993; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;
		&#2997;&#2992;&#2980;&#3021;&#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3007;&#2985;&#3006;&#2994;&#3021; &#2951;&#2980;&#3009; &#2953;&#2975;&#2985;&#2975;&#3007; &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3007;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021; (&#2970;&#3007;&#2994; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3021; &#2951;&#2980;&#2985;&#3016;
		&#2965;&#2979;&#3021;&#2975;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2970;&#2984;&#3021;&#2980;&#3006;&#2997;&#3007;&#2985;&#3016; &#2980;&#3006;&#2985;&#3006;&#2965; &#2984;&#3008;&#2965;&#3021;&#2965;&#3007; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2951;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3006;&#2985;&#2980;&#3009;).
		&#2953;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#2985;&#3021;&#2993; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3016; &#2970;&#2992;&#3007;&#2997;&#2992; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; 
		&#2949;&#2980;&#2985;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009;&#2985;&#2992; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3016; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007;&#2997;&#3007;&#2975; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2975;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021;
		&#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;.</p></dd><dt><span class="term">&#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2965;&#3016;&#2991;&#3006;&#2995;&#3009;&#2980;&#2994;&#3021;</span></dt><dd><p>&#2970;&#3007;&#2994;&#2992;&#3021; &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3006;&#2985; &#2997;&#2975;&#3007;&#2965;&#2975;&#3021;&#2975;&#3009;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2996;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2980;&#3007;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2985;&#3007;&#2994;&#3021; 
		&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2980;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2992;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2951;&#2985;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#2985;&#3021;&#2993; 
		&#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; 
		<a class="xref" href="message-forums.html#header-management" title="Identification and Header Management">the section called &#8220;Identification and Header Management&#8221;</a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021; &#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; 
		&#2965;&#3006;&#2979;&#3021;&#2965;.</p></dd><dt><span class="term">&#2950;&#2997;&#2979;&#2965;&#3021;&#2965;&#3006;&#2980;&#3021;&#2980;&#2994;&#3021;</span></dt><dd><p>&#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975; &#2986;&#2975;&#3021;&#2975;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3021; &#2958;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2970;&#3015;&#2990;&#3007;&#2965;&#3021;&#2965; 
		&#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2985;&#3016;&#2991;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2997;&#2996;&#3007;&#2991;&#3006;&#2965; &#2949;&#2985;&#3009;&#2965;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; (&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;
		<a class="xref" href="growth.html#using-archives" title="Conspicuous Use of Archives">the section called &#8220;Conspicuous Use of Archives&#8221;</a><span> &#2958;&#2985;&#3021;&#2993; &#2986;&#3006;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;
            <a class="xref" href="communications.html" title="Chapter 6. Communications">Chapter 6, <i>Communications</i></a></span> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; &#2986;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;).
		&#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2986;&#2992;&#3007;&#2990;&#3006;&#2992;&#3009;&#2990;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2985; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2950;&#2997;&#2979;&#2969;&#3021;&#2965;&#3006;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;; 
		&#2970;&#3007;&#2994; &#2970;&#2990;&#3016;&#2991;&#2990;&#3021;, &#2949;&#2980;&#3009; &#2980;&#2985;&#3007;&#2991;&#3006;&#2985; &#2970;&#3006;&#2980;&#2985;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; 
		&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.</p></dd></dl></div><p>&#2990;&#3015;&#2994;&#3015; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985; &#2997;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985; &#2970;&#3014;&#2991;&#2994;&#3021; 
&#2949;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2986;&#2994;&#2997;&#3007;&#2980;&#2990;&#3006;&#2985; &#2970;&#3007;&#2984;&#3021;&#2980;&#2985;&#3016;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;&#2975;&#2985;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#3006;&#2985; &#2986;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; 
&#2953;&#2995;&#3021;&#2995;&#2985; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021;.  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2997;&#2995;&#3021;&#2995;&#3009;&#2985;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2958;&#2985;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; 
&#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2965;&#2995;&#3006;&#2997;&#2980;&#3009; &#2980;&#3014;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; &#2951;&#2991;&#2969;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 
&#2970;&#3008;&#2992;&#3007;&#2991; &#2951;&#2975;&#3016;&#2997;&#3014;&#2995;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2980;&#3016;&#2985;&#3016; &#2984;&#3007;&#2992;&#3009;&#2997;&#2965;&#3007;&#2965;&#3021;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3015;&#2992;&#2990;&#3009;&#2990;&#3021; &#2970;&#3014;&#2994;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2949;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; 
&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3021; &#2970;&#3007;&#2994;&#2997;&#2993;&#3021;&#2993;&#3016; &#2949;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2986;&#3021;&#2986;&#3019;&#2990;&#3021;.</p><div class="sect3" title="&#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;"><div class="titlepage"><div><div><h4 class="title"><a name="spam-prevention"></a>&#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</h4></div></div></div><p>&#2951;&#2984;&#3021;&#2980; &#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2958;&#2996;&#3009;&#2980;&#3007;&#2991;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2949;&#2970;&#3021;&#2970;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2975;&#3016;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2965;&#3006;&#2994;&#2965;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 
&#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3018;&#2994;&#3021;&#2994;&#3016; &#2951;&#2992;&#3009;&#2990;&#2975;&#2969;&#3021;&#2965;&#3006;&#2965;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#8212;&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2980;&#3019;&#2985;&#3021;&#2993;&#2997;&#3006;&#2997;&#2980;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021;.  &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2985;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#3006;&#2994;&#3021;&#2965;&#2995;&#3021; &#2951;&#2991;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009; &#2962;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3008;&#2985;&#3021;&#2975; &#2984;&#3006;&#2995;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; 
&#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#3021;&#2993; &#2962;&#2985;&#3021;&#2993;&#3009; &#2949;&#2994;&#3021;&#2994;.  &#2949;&#2997;&#3021;&#2997;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2970;&#3007;&#2994; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3021; &#2980;&#2997;&#2992;&#3009;&#2980;&#2994;&#3006;&#2965; &#2997;&#2984;&#3021;&#2980;&#2980;&#3009;&#2990;&#3021; &#2953;&#2985;&#3021;&#2975;&#3009; &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; 
&#2965;&#2997;&#2979;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993; &#2990;&#3007;&#2965;&#2997;&#2990;&#3021; &#2970;&#3018;&#2993;&#3021;&#2986;&#3021;&#2986; &#2984;&#3007;&#2965;&#2995;&#3021;&#2997;&#3009;&#2965;&#2995;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2991;&#3009;&#2965;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#2975;&#2984;&#3021;&#2980;&#3009;
&#2986;&#3019;&#2991;&#3007;&#2993;&#3021;&#2993;&#3009;.  &#2951;&#2985;&#3021;&#2993;&#3019;, &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2949;&#2993;&#3021;&#2993; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990; &#2986;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2951;&#2991;&#2994;&#3006;&#2980; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2997;&#3014;&#2992;&#3009;&#2990;&#3021; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2984;&#3007;&#2992;&#2990;&#3021;&#2986;&#3007; &#2997;&#2996;&#3007;&#2997;&#2980;&#3016; &#2997;&#3007;&#2992;&#3016;&#2997;&#3007;&#2994;&#3021; &#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021;.  &#2958;&#2985;&#2997;&#3015; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;.</p><p>&#2984;&#3006;&#2985;&#3021; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3016; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2965; &#2986;&#3007;&#2992;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;: &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; 
&#2951;&#2975;&#2990;&#3021;&#2986;&#3014;&#2993;&#3006; &#2997;&#2985;&#3021;&#2985;&#2990;&#3021; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3016; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2986;&#2992;&#2986;&#3021;&#2986;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021; 
&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3006; &#2997;&#2979;&#3021;&#2985;&#2990;&#3021; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;.  &#2990;&#3009;&#2980;&#2994;&#3006;&#2997;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;, &#2958;&#2985;&#2997;&#3015; &#2949;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; 
&#2965;&#3006;&#2979;&#3021;&#2986;&#3019;&#2990;&#3021;.</p><div class="sect4" title="&#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2997;&#2975;&#3007;&#2965;&#2975;&#3021;&#2975;&#3009;&#2980;&#2994;&#3021;"><div class="titlepage"><div><div><h5 class="title"><a name="spam-filtering"></a>&#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2997;&#2975;&#3007;&#2965;&#2975;&#3021;&#2975;&#3009;&#2980;&#2994;&#3021;</h5></div></div></div><p>&#2997;&#3008;&#2985;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965; &#2990;&#3010;&#2985;&#3021;&#2993;&#3009; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2997;&#2996;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;, &#2949;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2951;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021; 
&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3015; &#2984;&#2994;&#3021;&#2994;&#2980;&#3009;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#3016;:
</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p><span class="bold"><strong>&#2970;&#2984;&#3021;&#2980; &#2986;&#3014;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;  
            &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.</strong></span></p><p>&#2951;&#2980;&#3009; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980; &#2997;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2980;&#2985;&#3016; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2985;&#3021; &#2970;&#3007;&#2994; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#3009;&#2990;&#3021; &#2990;&#3007;&#2965; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#2994;&#3006;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#3009; &#2986;&#3019;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2949;&#2996;&#3007;&#2984;&#3021;&#2980;&#3009; &#2986;&#3019;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#3010;&#2975;&#3006;&#2980;&#3009;.  &#2949;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; 
&#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965;, &#2990;&#3007;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#2992;&#3007;&#2970;&#3016; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2970;&#3015;&#2990;&#3007;&#2965;&#3021;&#2965;&#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2990;&#3009;&#2980;&#2994;&#3006;&#2997;&#2980;&#3006;&#2965;, 
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2984;&#3021;&#2980; &#2986;&#3014;&#2992;&#3006;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2949;&#2985;&#3009;&#2986;&#3021;&#2986; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;: &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021; &#2965;&#3015;&#2975;&#3021;&#2965; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;  
&#2949;&#2993;&#3007;&#2997;&#3009;&#2992;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#3019;&#2992;&#3016; &#2970;&#2984;&#3021;&#2980; &#2986;&#3014;&#2992;&#3009;&#2990;&#3006;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2980;&#3009;. 
&#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2970;&#2984;&#3021;&#2980;&#3006; &#2986;&#3014;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#3015;&#2992;&#3009; &#2962;&#2992;&#3009; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2990;&#3009;&#2965;&#2997;&#2992;&#3007;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2985;&#3016; 
&#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;.  &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2990;&#3009;&#2965;&#2997;&#2992;&#3007;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3016; &#2949;&#2975;&#3016;&#2991;&#3006;&#2994;&#2990;&#3021; &#2965;&#3006;&#2975;&#3021;&#2975; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2985; &#2949;&#2975;&#3016;&#2991;&#3006;&#2994;&#2990;&#3021; 
&#2949;&#2994;&#3021;&#2994;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2949;&#2980;&#2985;&#3016; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3009;&#2990;&#3021; &#2965;&#3010;&#2991;&#3006;&#2980;&#3009;.</p></li><li class="listitem"><p><span class="bold"><strong>&#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2986;&#2965;&#3009;&#2980;&#3021;&#2980;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3018;&#2985;&#3021;&#2975;&#3009; 
            &#2997;&#2975;&#3007;&#2965;&#2975;&#3021;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.</strong></span></p><p>&#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2997;&#2975;&#3007;&#2965;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2997;&#3015;&#2994;&#3016;&#2991;&#3016; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; (&#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985;&#2997;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#2995;&#3021;&#2994;&#2997;&#3016;), &#2949;&#2980;&#2985;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#3018;&#2994;&#3021;&#2994;&#2994;&#3006;&#2990;&#3021;.
&#2980;&#3006;&#2985;&#3007;&#2991;&#2969;&#3021;&#2965;&#3007; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3016; &#2980;&#2992;&#3009;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; 
&#2986;&#2992;&#2986;&#3021;&#2986;&#3009;&#2997;&#3019;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3016; &#2980;&#2975;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2984;&#2975;&#3016;&#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2986;&#3019;&#2992;&#3006;&#2975;&#3021;&#2975;&#2990;&#3021; &#2949;&#2997;&#3016;&#2965;&#2995;&#3006;&#2994;&#3021; &#2990;&#3009;&#2996;&#3009; &#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3016; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980; &#2965;&#3006;&#2992;&#3007;&#2991;&#2990;&#3021; &#2950;&#2965;&#3021;&#2965;&#3007; 
&#2997;&#3007;&#2975;&#3021;&#2975;&#2985;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; &#2990;&#3007;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#2992;&#3007;&#2970;&#3016;&#2991;&#3007;&#2994;&#3021; &#2970;&#3015;&#2992;&#3009;&#2990;&#3021; &#2997;&#3008;&#2985;&#3021; &#2970;&#3014;&#2980;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; 
&#2958;&#2985;&#3021;&#2985;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016; &#2997;&#3014;&#2965;&#3009;&#2997;&#3006;&#2965; &#2965;&#3009;&#2993;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#2985;&#3007;&#2980; &#2949;&#2993;&#3021;&#2993;&#2994;&#3021; &#2949;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2985;&#3021; &#2984;&#3008;&#2994;&#2980;&#3021;&#2980;&#3016; 
&#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2970;&#3007;&#2992;&#3007;&#2991; &#2997;&#2975;&#3007;&#2965;&#2975;&#3021;&#2975;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2986;&#3021;&#2986;&#3006;&#2985; &#2986;&#2991;&#2985;&#3021; &#2980;&#2992;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3009;.</p><p>There is not space here for detailed instructions
            on setting up spam filters.  You will have to consult
            your mailing list software's documentation for that (see
            <a class="xref" href="message-forums.html#mailing-list-software">the section called &#8220;Mailing List / Message Forum Software&#8221;</a><span> later in this chapter</span>).  List
            software often comes with some built-in spam prevention
            features, but you may want to add some third-party
            filters.  I've had good experiences with SpamAssassin
            (<a class="ulink" href="http://spamassassin.apache.org/" target="_top">spamassassin.apache.org</a>) and SpamProbe
            (<a class="ulink" href="http://spamprobe.sourceforge.net/" target="_top">spamprobe.sourceforge.net</a>), but this
            is not a comment on the many other open source spam
            filters out there, some of which are apparently also quite
            good.  I just happen to have used those two myself and
            been satisfied with them.</p></li><li class="listitem"><p><span class="bold"><strong>Moderation.</strong></span></p><p>For mails that aren't automatically allowed by
            virtue of being from a list subscriber, and which make it
            through the spam filtering software, if any, the last stage
            is <em class="firstterm">moderation</em>: the mail is routed
            to a special holding area, where a human examines it and
            confirms or rejects it.</p><p>Confirming a post usually takes one of two forms:
            you can accept the sender's post just this once, or you
            can tell the system to allow this and all future posts
            from the same sender.  You almost always want to do the
            latter, in order to reduce the future moderation
            burden &#8212; after all, someone who has made a
            valid post to a forum is unlikely to suddenly turn into a
            spammer later.</p><p>Rejecting is done by either marking the item to be
            discarded, or by explicitly telling the system the message
            was spam so the system can improve its ability to
            recognize future spams.  Sometimes
            you also have the option to automatically discard future
            mails from the same sender without them ever being held in
            the moderation queue, but there is rarely any point doing
            this, since spammers don't send from the same address
            twice anyway.</p><p>Oddly, most message-forum systems have not yet given
            the moderation queue administrative interface the
            attention it deserves, considering how common the task is,
            so moderation often still requires more clicks and UI
            gestures than it should.  I hope this situation will
            improve in the future.  In the meantime, perhaps knowing
            you're not alone in your frustration will temper your
            disappointment somewhat.</p></li></ol></div><p>Be sure to use moderation <span class="emphasis"><em>only</em></span> for
filtering out spams, and perhaps for clearly off-topic messages such
as when someone accidentally posts to the wrong mailing list.
Although the moderation system may give you a way to respond directly
to the sender, you should never use that method to answer questions
that really belong on the mailing list itself, even if you know the
answer off the top of your head.  To do so would deprive the project's
community of an accurate picture of what sorts of questions people are
asking, and deprive people of a chance to answer questions themselves
and/or see answers from others.  Mailing list moderation is strictly
about keeping the list free of spam and of wildly off-topic emails,
nothing more.</p></div><div class="sect4" title="Address hiding in archives"><div class="titlepage"><div><div><h5 class="title"><a name="address-hiding"></a>Address hiding in archives</h5></div></div></div><p>To prevent your mailing lists from being a source of addresses
for spammers, a common technique is for the archiving software to
obscure people's email addresses, for example by replacing</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandom@somedomain.com</code></p></blockquote></div><p>with</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandom_AT_somedomain.com</code></p></blockquote></div><p>or</p><div class="blockquote"><blockquote class="blockquote"><p><code class="literal">jrandomNOSPAM@somedomain.com</code></p></blockquote></div><p>or some similarly obvious (to a human) encoding.  Since spam
address harvesters often work by crawling through web
pages&#8212;including your mailing list's online archives&#8212;and
looking for sequences containing "@", encoding the addresses is a way
of making people's email addresses invisible or useless to spammers.
This does nothing to prevent spam from being sent to the mailing list
itself, of course, but it does avoid increasing the amount of spam
sent directly to list users' personal addresses.</p><p>Address hiding can be controversial.  Some people like it a lot,
and will be surprised if your archives don't do it automatically.
Other people think it's too much of an inconvenience (because humans
also have to translate the addresses back before using them).
Sometimes people assert that it's ineffective, because a harvester
could in theory compensate for any consistent encoding pattern.
However, note that there is empirical evidence that address hiding
<span class="emphasis"><em>is</em></span> effective; see <a class="ulink" href="http://www.cdt.org/speech/spam/030319spamreport.shtml" target="_top">cdt.org/speech/spam/030319spamreport.shtml</a>.</p><p>Ideally, the list management software would leave the choice up
to each individual subscriber, either through a special yes/no header
or a setting in that subscriber's list account preferences.  However,
I don't know of any software which offers per-subscriber or per-post
choice in the matter, so for now the list manager must make a decision
for everyone (assuming the archiver offers the feature at all, which
is not always the case).  For what it's worth, I lean toward turning
address hiding on.  Some people are very careful to avoid posting
their email addresses on web pages or anywhere else a spam harvester
might see it, and they would be disappointed to have all that care
thrown away by a mailing list archive; meanwhile, the inconvenience
address hiding imposes on archive users is very slight, since it's
trivial to transform an obscured address back to a valid one if you
need to reach the person.  But keep in mind that, in the end, it's
still an arms race: by the time you read this, harvesters might well
have evolved to the point where they can recognize most common forms
of hiding, and we'll have to think of something else.</p></div></div><div class="sect3" title="Identification and Header Management"><div class="titlepage"><div><div><h4 class="title"><a name="header-management"></a>Identification and Header Management</h4></div></div></div><p>When interacting with the forum by email, subscribers often want
to put mails from the list into a project-specific folder, separate
from their other mail.  Their mail reading software can do this
automatically by examining the mail's <em class="firstterm">headers</em>.
The headers are the fields at the top of the mail that indicate the
sender, recipient, subject, date, and various other things about the
message.  Certain headers are well known and are effectively
mandatory:</p><pre class="screen">
From: ...
To: ...
Subject: ...
Date: ...
</pre><p>Others are optional, though still quite standard.  For example,
emails are not strictly required to have the</p><pre class="screen">
Reply-to: sender@email.address.here
</pre><p>header, but most do, because it gives recipients a foolproof way
to reach the author (it is especially useful when the author had to
send from an address other than the one to which replies should be
directed).</p><p>Some mail reading software offers an easy-to-use interface for
filing mails based on patterns in the Subject header.  This leads
people to request that the mailing list add an automatic prefix to all
Subjects, so they can set their readers to look for that prefix and
automatically file the mails in the right folder.  The idea is that
the original author would write:</p><pre class="screen">
Subject: Making the 2.5 release.
</pre><p>but the mail would show up on the list looking like this:</p><pre class="screen">
Subject: [Scanley Discuss] Making the 2.5 release.
</pre><p>Although most list management software offers the option to do
this, you may decide against turning the option on.  The problem
it solves can often be solved in less obtrusive ways (see below), and
there is a cost to eating space in the Subject field.  Experienced
mailing list users typically scan the Subjects of the day's incoming
list mail to decide what to read and/or respond to.  Prepending the
list's name to the Subject can push the right side of the Subject off
the screen, rendering it invisible.  This obscures information that
people depend on to decide what mails to open, thus reducing the
overall functionality of the mailing list for everyone.</p><p>Instead of munging the Subject header, your project could take
advantage of the other standard headers, starting with the To header,
which should say the mailing list's address:</p><pre class="screen">
To: &lt;discuss@lists.example.org&gt;
</pre><p>Any mail reader that can filter on Subject should be able to filter on
To just as easily.</p><p>There are a few other optional-but-standard headers expected for
mailing lists; they are sometimes not displayed by most mailreader
software, but they are present nonetheless.  Filtering on them is
even more reliable than using the "To" or "Cc" headers, and since these
headers are added to each post by the mailing list management software
itself, some users may be counting on their presence:</p><pre class="screen">
list-help: &lt;mailto:discuss-help@lists.example.org&gt;
list-unsubscribe: &lt;mailto:discuss-unsubscribe@lists.example.org&gt;
list-post: &lt;mailto:discuss@lists.example.org&gt;
Delivered-To: mailing list discuss@lists.example.org
Mailing-List: contact discuss-help@lists.example.org; run by ezmlm
</pre><p>For the most part, they are self-explanatory.  See <a class="ulink" href="http://www.nisto.com/listspec/list-manager-intro.html" target="_top">nisto.com/listspec/list-manager-intro.html</a> for more
explanation, or if you need the really detailed, formal specification,
see <a class="ulink" href="http://www.faqs.org/rfcs/rfc2369.html" target="_top">faqs.org/rfcs/rfc2369.html</a>.
</p><p>Having said all that, these days I find that most subscribers
just request that the Subject header include a list-identifying
prefix.  That's increasingly how people are accustomed to filtering
email: Subject-based filtering is what many of the major online email
services (like Gmail) offer users by default, and those services tend
not to make it easy to see the presence of less-commonly used headers
like the ones I mentioned above &#8212; thus making it hard
for people to figure out that they would even have the option of
filtering on those other headers.</p><p>Therefore, reluctantly, I recommend using a Subject prefix (keep
it as short as you can) if that's what your community wants.  But if
your project highly technical and most of its participants are
comfortable using the other headers, then that option is always there
as a more space-efficient alternative.</p><p>It also used to be the case that if you have a mailing list
named "foo", then you also have administrative addresses "foo-help"
and "foo-unsubscribe" available.  In addition to these, it was
traditional to have "foo-subscribe" for joining, and "foo-owner",
for reaching the list administrators.  Increasingly, however,
subscribers manage their list membership via Web-based interfaces, so
even if the list management software you use sets up these
administrative addresses, they may go largely unused.</p><p>Some mailing list software offers an option to append
unsubscription instructions to the bottom of every post.  If that
option is available, turn it on.  It causes only a couple of extra
lines per message, in a harmless location, and it can save you a lot
of time, by cutting down on the number of people who mail you&#8212;or
worse, mail the list!&#8212;asking how to unsubscribe.</p></div><div class="sect3" title="The Great Reply-to Debate"><div class="titlepage"><div><div><h4 class="title"><a name="reply-to"></a>The Great Reply-to Debate</h4></div></div></div><p>Earlier, in <a class="xref" href="setting-tone.html#avoid-private-discussions" title="&#2980;&#2985;&#3007;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;">the section called &#8220;&#2980;&#2985;&#3007;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;&#8221;</a>, I stressed the
importance of making sure discussions stay in public forums, and
talked about how active measures are sometimes needed to prevent
conversations from trailing off into private email threads;
furthermore, this chapter is all about setting up project
communications software to do as much of the work for people as possible.
Therefore, if the mailing list management software offers a way to
automatically cause discussions to stay on the list, you would think
turning on that feature would be the obvious choice.</p><p>Well, not quite.  There is such a feature, but it has some
pretty severe disadvantages.  The question of whether or not to use it
is one of the hottest debates in mailing list
management&#8212;admittedly, not a controversy that's likely to make
the evening news in your city, but it can flare up from time to time
in free software projects.  Below, I will describe the feature, give
the major arguments on both sides, and make the best recommendation I
can.</p><p>The feature itself is very simple: the mailing list software
can, if you wish, automatically set the Reply-to header on every post
to redirect replies to the mailing list.  That is, no matter what the
original sender puts in the Reply-to header (or even if they don't
include one at all), by the time the list subscribers see the post,
the header will contain the list address:</p><pre class="screen">
Reply-to: discuss@lists.example.org
</pre><p>On its face, this seems like a good thing.  Because virtually
all mail reading software pays attention to the Reply-to header, now
when anyone responds to a post, their response will be automatically
addressed to the entire list, not just to the sender of the message
being responded to.  Of course, the responder can still manually
change where the message goes, but the important thing is that
<span class="emphasis"><em>by default</em></span> replies are directed to the list.
It's a perfect example of using technology to encourage
collaboration.</p><p>Unfortunately, there are some disadvantages.  The first is known
as the <em class="firstterm">Can't Find My Way Back Home</em> problem:
sometimes the original sender will put their "real" email address in
the Reply-to field, because for one reason or another they send email
from a different address than where they receive it.  People who
always read and send from the same location don't have this problem,
and may be surprised that it even exists.  But for those who have
unusual email configurations, or who cannot control how the From
address on their mails looks (perhaps because they send from work and
do not have any influence over the IT department), using Reply-to may
be the only way they have to ensure that responses reach them.  When
such a person posts to a mailing list that he's not subscribed to, his
setting of Reply-to becomes essential information.  If the list
software overwrites it<sup>[<a name="idp6480448" href="#ftn.idp6480448" class="footnote">27</a>]</sup>, he may
never see the responses to his post.</p><p>The second disadvantage has to do with expectations, and in my
opinion is the most powerful argument against Reply-to munging.  Most
experienced mail users are accustomed to two basic methods of
replying: <em class="firstterm">reply-to-all</em> and
<em class="firstterm">reply-to-author</em>.  All modern mail reading
software has separate keys for these two actions.  Users know that to
reply to everyone (that is, including the list), they should choose
reply-to-all, and to reply privately to the author, they should choose
reply-to-author.  Although you want to encourage people to reply to
the list whenever possible, there are certainly circumstances where a
private reply is the responder's prerogative&#8212;for example, they
may want to say something confidential to the author of the original
message, something that would be inappropriate on the public
list.</p><p>Now consider what happens when the list has overridden the
original sender's Reply-to.  The responder hits the reply-to-author
key, expecting to send a private message back to the original author.
Because that's the expected behavior, he may not bother to look
carefully at the recipient address in the new message.  He composes
his private, confidential message, one which perhaps says embarrassing
things about someone on the list, and hits the send key.
Unexpectedly, a few minutes later his message appears <span class="emphasis"><em>on the
mailing list!</em></span> True, in theory he should have looked
carefully at the recipient field, and should not have assumed anything
about the Reply-to header.  But authors almost always set Reply-to to
their own personal address (or rather, their mail software sets it for
them), and many longtime email users have come to expect that.  In
fact, when a person deliberately sets Reply-to to some other address,
such as the list, she usually makes a point of mentioning this in the
body of her message, so people won't be surprised at what happens when
they reply.</p><p>Because of the possibly severe consequences of this unexpected
behavior, my own preference is to configure list management software
to never touch the Reply-to header.  This is one instance where using
technology to encourage collaboration has, it seems to me, potentially
dangerous side-effects.  However, there are also some powerful
arguments on the other side of this debate.  Whichever way you choose,
you will occasionally get people posting to your list asking why you
didn't choose the other way.  Since this is not something you ever
want as the main topic of discussion on your list, it might be good to
have a canned response ready, of the sort that's more likely to stop
discussion than encourage it.  Make sure you do
<span class="emphasis"><em>not</em></span> insist that your decision, whichever it is,
is obviously the only right and sensible one (even if you think that's
the case).  Instead, point out that this is a very old debate, there
are good arguments on both sides, no choice is going to satisfy
all users, and therefore you just made the best decision you
could.  Politely ask that the subject not be revisited unless someone
has something genuinely new to say, then stay out of the thread and
hope it dies a natural death.</p><p>Someone may suggest a vote to choose one way or the other.  You
can do that if you want, but I personally do not feel that counting
heads is a satisfactory solution in this case.  The penalty for
someone who is surprised by the behavior is so huge (accidentally
sending a private mail to a public list), and the inconvenience for
everyone else is fairly slight (occasionally having to remind someone
to respond to the whole list instead of just to you), that it's not
clear that the majority, even though they are the majority, should be
able to put the minority at such risk.</p><p>I have not addressed all aspects of this issue here, just the
ones that seemed of overriding importance.  For a full discussion, see
these two canonical documents, which are the ones people always cite
when they're having this debate:

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Leave Reply-to alone</strong></span>,
     <span class="emphasis"><em>by Chip Rosenthal</em></span></p><p><a class="ulink" href="http://www.unicom.com/pw/reply-to-harmful.html" target="_top">unicom.com/pw/reply-to-harmful.html</a></p></li><li class="listitem"><p><span class="bold"><strong>Set Reply-to to list</strong></span>,
     <span class="emphasis"><em>by Simon Hill</em></span></p><p><a class="ulink" href="http://www.metasystema.net/essays/reply-to.mhtml" target="_top">metasystema.net/essays/reply-to.mhtml</a></p></li></ul></div><p>

</p><p>Despite the mild preference indicated above, I do not feel there
is a "right" answer to this question, and happily participate in many
lists that <span class="emphasis"><em>do</em></span> set Reply-to.  The most important
thing you can do is settle on one way or the other early, and try not
to get entangled in debates about it after that.  When the debate
re-arises every few years, as it inevitably will, you can point people
to the archived discussion from last time.</p><div class="sect4" title="Two fantasies"><div class="titlepage"><div><div><h5 class="title"><a name="reply-fantasies"></a>Two fantasies</h5></div></div></div><p>Someday, someone will get the bright idea to implement a
<em class="firstterm">reply-to-list</em> key in a mail reader.  It would
use some of the custom list headers mentioned earlier to figure out
the address of the mailing list, and then address the reply directly
to the list only, leaving off any other recipient addresses, since
most are probably subscribed to the list anyway.  Eventually, other
mail readers will pick up the feature, and this whole debate will go
away.  (Actually, the <a class="ulink" href="http://www.mutt.org/" target="_top">Mutt</a>
mail reader does offer this feature.<sup>[<a name="idp6498624" href="#ftn.idp6498624" class="footnote">28</a>]</sup>)</p><p>An even better solution would be for Reply-to munging to be a
per-subscriber preference.  Those who want the list to set Reply-to
munged (either on others' posts or on their own posts) could ask for
that, and those who don't would ask for Reply-to to be left alone.
However, I don't know of any list management software that offers this
on a per-subscriber basis.  For now, we seem to be stuck with a global
setting.<sup>[<a name="idp6500784" href="#ftn.idp6500784" class="footnote">29</a>]</sup></p></div></div><div class="sect3" title="Archiving"><div class="titlepage"><div><div><h4 class="title"><a name="archiving"></a>Archiving</h4></div></div></div><p>The technical details of setting up mailing list archiving are
specific to the software that's running the list, and are beyond the
scope of this book.  If you have to choose or configure an archiver,
consider these qualities:</p><div class="variablelist"><dl><dt><span class="term">Prompt updating</span></dt><dd><p>People will often want to refer to an archived message
            that was posted recently.  If possible, the archiver
            should archive each post instantaneously, so that by the
            time a post appears on the mailing list, it's already
            present in the archives.  If that option isn't available,
            then at least try to set the archiver to update itself
            every hour or so.  (By default, some archivers run their
            update processes once per night, but in practice that's
            far too much lag time for an active mailing list.)</p></dd><dt><span class="term">Referential stability</span></dt><dd><p>Once a message is archived at a particular URL, it should
            remain accessible at that exact same URL forever, or as
            close to forever as possible.  Even if the archives are
            rebuilt, restored from backup, or otherwise fixed, any
            URLs that have already been made publicly available
            should remain the same.  Stable references make it
            possible for Internet search engines to index the
            archives, which is a major boon to users looking for
            answers.  Stable references are also important because
            mailing list posts and threads are often linked to from
            the bug tracker (see
            <a class="xref" href="bug-tracker.html" title="Bug Tracker">the section called &#8220;Bug Tracker&#8221;</a><span>
            later in this chapter</span>) or
            from other project documents.</p><p>Ideally, mailing list software would include a message's
            archive URL, or at least the message-specific portion of
            the URL, in a header when it distributes the message to
            recipients.  That way people who have a copy of the
            message would be able to know its archive location
            without having to actually visit the archives, which would
            be helpful because any operation that involves one's web
            browser is automatically time-consuming.  Whether any
            mailing list software actually offers this feature, I don't
            know; unfortunately, the ones I have used do not.
            However, it's something to look for (or, if you write
            mailing list software, it's a feature to consider
            implementing, please).</p></dd><dt><span class="term">Thread support</span></dt><dd><p>It should be possible to go from any individual message to
            the <em class="firstterm">thread</em> (group of related
            messages) that the original message is part of.  Each
            thread should have its own URL too, separate from the URLs
            of the individual messages in the thread.</p></dd><dt><span class="term">Searchability</span></dt><dd><p>An archiver that doesn't support searching&#8212;on the
            bodies of messages, as well as on authors and
            subjects&#8212;is close to useless.  Note that some archivers 
            support searching by simply farming the work out to an
            external search engine such as <a class="ulink" href="http://www.google.com/" target="_top">Google</a>.  This is
            acceptable, but direct search support is usually more
            fine-tuned, because it allows the searcher to specify that
            the match must appear in a subject line versus the body,
            for example.</p></dd></dl></div><p>The above is just a technical checklist to help you evaluate and
set up an archiver.  Getting people to
actually <span class="emphasis"><em>use</em></span> the archiver to the project's
advantage is discussed in later chapters, in particular
<a class="xref" href="growth.html#using-archives" title="Conspicuous Use of Archives">the section called &#8220;Conspicuous Use of Archives&#8221;</a>.</p></div><div class="sect3" title="Mailing List / Message Forum Software"><div class="titlepage"><div><div><h4 class="title"><a name="message-forum-software"></a>Mailing List / Message Forum Software</h4></div></div></div><a name="mailing-list-software"></a><p>Here are some tools for running message forums.  If the site
where you're hosting your project already has a default setup, then
you can just use that and avoid having to choose.  But if you need to
install one yourself, below are some possibilities.  (Of course, there
are probably other tools out there that I just didn't happen to find,
so don't take this as a complete list).</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p><span class="bold"><strong>Google Groups</strong></span> &#8212; <a class="ulink" href="http://groups.google.com/" target="_top">groups.google.com</a></p><p>Listing Google Groups first was a tough call.  The service is
         not itself open source, and a few of its administrative
         functions can be a bit hard to use.  However, its advantages
         are substantial: your group's archives are always online and
         searchable; you don't have to worry about scalability,
         backups, or other run-time infrastructure issues; the
         moderation and spam-prevention features are pretty good (with
         the latter constantly being improved, which is important in
         the neverending spam arms race); and Google Groups are easily
         accessible via both email and web, in ways that are likely to
         be already familiar to many participants.  These are strong
         advantages.  If you just want to get your project started,
         and don't want to spend too much time thinking about what
         message forum software or service to use, Google Groups
         is a good default choice.</p></li><li class="listitem"><p><span class="bold"><strong>GroupServer</strong></span> &#8212; <a class="ulink" href="http://www.groupserver.org/" target="_top">http://www.groupserver.org/</a></p><p>Has built-in archiver and integrated Web-based interface.
         GroupServer is a bit of work to set up, but once you have it
         up and running it offers users a good experience.
         You may  able to find free or low-cost hosted GroupServer
         hosting for your project's forums, for example from <a class="ulink" href="https://OnlineGroups.net/" target="_top">OnlineGroups.net</a>.</p></li><li class="listitem"><p><span class="bold"><strong>Sympa</strong></span> &#8212; <a class="ulink" href="http://www.sympa.org/" target="_top">sympa.org</a></p><p>Developed and maintained by a consortium of French
         universities, and designed for a given instance to handle
         both very large lists (&gt; 700000 members, they claim) and a
         large number of lists.  Sympa can work with a variety of
         dependencies; for example, you can run it with sendmail,
         postfix, qmail or exim as the underlying message transfer
         agent.  It has built-in Web-based archiving.</p></li><li class="listitem"><p><span class="bold"><strong>Mailman</strong></span> &#8212; <a class="ulink" href="http://www.list.org/" target="_top">list.org</a></p><p>For many years, Mailman was the standard for open source
         project mailing lists.  It comes with a built-in archiver,
         Pipermail, and hooks for plugging in external archivers.
         Unfortunately, Mailman is showing its age now, and while
         it is very reliable in terms of message delivery and other
         under-the-hood functionality, its administrative
         interfaces &#8212; especially for spam moderation
         and subscription moderation &#8212; are frustrating
         for those accustomed to the modern Web.  As of this writing
         in late 2013, the long-awaited Mailman 3 was still in
         development but was about to enter beta-testing; by the time
         you read this, Mailman 3 may be released, and would be worth
         a look.  It is supposed to solve many of the problems of
         Mailman 2, and may make Mailman a reasonable choice again.</p></li><li class="listitem"><p><span class="bold"><strong>Dada</strong></span> &#8212; <a class="ulink" href="http://dadamailproject.com/" target="_top">dadamailproject.com</a></p><p>I've not used Dada myself, but it is actively maintained and,
         at least from outward appearances, quite spiffy.  Note that
         to use it for participatory lists, as opposed to announcement
         lists, you apparently need to activate the plug-in "Dada
         Bridge".  Commercial Dada hosting and installation offerings
         are available, or you can download the code and install it
         yourself.</p></li></ul></div></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp6367024" href="#idp6367024" class="para">26</a>] </sup>&#2984;&#3008;&#2979;&#3021;&#2975; &#2965;&#3006;&#2994;&#2990;&#3006;&#2965; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#8212; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;
&#2980;&#2965;&#2997;&#2994;&#3009;&#2965;&#3021;&#2965;&#3009; <a class="ulink" href="http://www.rants.org/2008/03/06/thread_theory/" target="_top">rants.org/2008/03/06/thread_theory</a>-&#2960;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;.  &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3009;&#2975;&#2985;&#3021; 
&#2984;&#3006;&#2985;&#3021; &#2958;&#2985;&#3021; &#2970;&#3014;&#3006;&#2984;&#3021;&#2980; &#2997;&#2994;&#3016;&#2986;&#3021;&#2986;&#2980;&#3007;&#2997;&#3016; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp6480448" href="#idp6480448" class="para">27</a>] </sup>In theory, the list software
could <span class="emphasis"><em>add</em></span> the lists's address to whatever
Reply-to destination were already present, if any, instead of
overwriting.  In practice, for reasons I don't know, most list
software overwrites instead of appending.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp6498624" href="#idp6498624" class="para">28</a>] </sup>Shortly after this
book appeared, <a class="ulink" href="http://www.michaelbernstein.com/" target="_top">Michael Bernstein</a> wrote me to say: "There are other email
clients that implement a reply-to-list function besides Mutt. For
example, Evolution has this function as a keyboard shortcut, but not a
button (Ctrl+L)."</p></div><div class="footnote"><p><sup>[<a id="ftn.idp6500784" href="#idp6500784" class="para">29</a>] </sup>Since I wrote that, I've learned that there is
at least one list management system that offers this
feature: <a class="ulink" href="http://siesta.unixbeard.net/" target="_top">Siesta</a>.
See also this article about it:
<a class="ulink" href="http://www.perl.com/pub/a/2004/02/05/siesta.html" target="_top">perl.com/pub/a/2004/02/05/siesta.html</a></p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="web-site.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="vc.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Version Control</td></tr></table></div></body></html>
