<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 5. Money</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="non-profit.html" title="&#2951;&#2994;&#3006;&#2986;&#2984;&#3019;&#2965;&#3021;&#2965;&#2993;&#3021;&#2993; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2980;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;"><link rel="next" href="types-of-involvement.html" title="&#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 5. Money</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="non-profit.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="types-of-involvement.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 5. Money"><div class="titlepage"><div><div><h2 class="title"><a name="money"></a>Chapter 5. Money</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="money.html#crowdfunding">Crowdfunding: Kickstarter, etc</a></span></dt><dt><span class="sect1"><a href="types-of-involvement.html">&#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;</a></span></dt><dt><span class="sect1"><a href="long-term-developers.html">Hire for the Long Term</a></span></dt><dt><span class="sect1"><a href="appear-as-many.html">Appear as Many, Not as One</a></span></dt><dt><span class="sect1"><a href="open-motives.html">Be Open About Your Motivations</a></span></dt><dt><span class="sect1"><a href="money-vs-love.html">Money Can't Buy You Love</a></span></dt><dt><span class="sect1"><a href="contracting.html">Contracting</a></span></dt><dd><dl><dt><span class="sect2"><a href="contracting.html#community-review-acceptance">Review and Acceptance of Changes</a></span></dt><dd><dl><dt><span class="sect3"><a href="contracting.html#cvs-pserver">Case study: the CVS password-authentication protocol</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="funding-non-programming.html">Funding Non-Programming Activities</a></span></dt><dd><dl><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-qa">Quality Assurance (i.e., Professional Testing)</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-legal">Legal Advice and Protection</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-documentation-usability">Documentation and Usability</a></span></dt><dt><span class="sect2"><a href="funding-non-programming.html#subsidize-hosting">Providing Hosting/Bandwidth</a></span></dt></dl></dd><dt><span class="sect1"><a href="marketing.html">Marketing</a></span></dt><dd><dl><dt><span class="sect2"><a href="marketing.html#goldfish-bowl">Remember That You Are Being Watched</a></span></dt><dt><span class="sect2"><a href="marketing.html#competing-products">Don't Bash Competing Open Source Products</a></span></dt></dl></dd><dt><span class="sect1"><a href="hiring.html">Hiring Open Source Developers</a></span></dt><dt><span class="sect1"><a href="bounties.html">Bounties</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2970;&#3010;&#2996;&#2994;&#3009;&#2965;&#3021;&#2965;&#3009;&#2995;&#3021; &#2984;&#3007;&#2980;&#3007; &#2997;&#2992;&#2997;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3014;&#2985; &#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2990;&#3021;, &#2954;&#2980;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2986;&#2979;&#3007;&#2986;&#3009;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#2994;&#3021;&#2994;&#3006;&#2980;&#3009;, &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965; &#2970;&#3010;&#2996;&#2994;&#3007;&#2985;&#3021; &#2970;&#2990;&#3010;&#2965; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2990;&#3015;&#2994;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3006;&#2985;&#2980;&#3009;. &#2986;&#3007;&#2985;&#3021;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3014;&#2993;&#3009;&#2984;&#2992;&#3021;, &#2954;&#2980;&#3007;&#2991;&#2990;&#3021;&#2986;&#3014;&#2993;&#3009;&#2990;&#3021; &#2984;&#3007;&#2992;&#2994;&#2992;&#3006;&#2965;&#2997;&#3019;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3015;&#2994;&#3006;&#2995;&#2992;&#3006;&#2965;&#2997;&#3019; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2986;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2949;&#2993;&#3007;&#2997;&#3009;&#2992;&#3016;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2951;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2949;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980;&#2986;&#3019;&#2980;&#3009; &#2991;&#3006;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2949;&#2993;&#3007;&#2997;&#3009;&#2992;&#3016;&#2991;&#3014;&#2985;&#3021;&#2986;&#2980;&#3009; &#2970;&#3010;&#2996;&#2990;&#3016;&#2997;&#3007;&#2985;&#3006;&#2994;&#3021; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2965; &#2997;&#2992;&#3016;&#2991;&#2993;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2980;&#3007;&#2991;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#2994;&#3021;&#2994;. &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2993;&#3016;&#2970;&#3006;&#2992;&#3006; &#2990;&#3006;&#2985;&#3007;&#2991;&#2990;&#3021; &#2986;&#3014;&#2993;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2990;&#3009;&#2993;&#3016;&#2990;&#3016; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965;&#3007;&#2991;&#3018;&#2992;&#3009;&#2997;&#2992;&#3021;, &#2980;&#2985;&#2980;&#3009; &#2986;&#2965;&#3009;&#2986;&#3021;&#2986;&#3006;&#2991;&#3021;&#2997;&#3009;&#2986;&#3021; &#2986;&#2979;&#3007;&#2965;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965; &#2962;&#2992;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2991;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021;. &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021;, &#2949;&#2980;&#3016; &#2951;&#2979;&#3016;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975;&#3021;&#2975;&#3009; &#2986;&#3007;&#2993; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3016;, &#2997;&#2996;&#3009;&#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3016; &#2951;&#2979;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2986;&#3014;&#2993;&#3009;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021;. &#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2951;&#2969;&#3021;&#2965;&#3015; &#2962;&#2992;&#3009; &#2990;&#3009;&#2993;&#3016;&#2970;&#3006;&#2992;&#3006; &#2965;&#3010;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3007;&#2991;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2951;&#2984;&#3021;&#2980; &#2965;&#3010;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2984;&#3007;&#2980;&#3007;, &#2949;&#2984;&#3021;&#2980; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2954;&#2980;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2979;&#3007;&#2986;&#3009;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2980;&#3014;&#2992;&#3007;&#2984;&#3021;&#2980;&#3019; &#2980;&#3014;&#2992;&#3007;&#2991;&#3006;&#2990;&#2994;&#3019;, &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2986;&#2979;&#3007;&#2991;&#3007;&#2975;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2951;&#2979;&#3016;&#2991; &#2949;&#2994;&#3016;&#2997;&#2992;&#3007;&#2970;&#3016;&#2991;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#3018;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2980;&#2997;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2951;&#2984;&#3021;&#2980; &#2990;&#3009;&#2980;&#2994;&#3008;&#2975;&#3021;&#2975;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2984;&#3021;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2994;&#3006;&#2986;&#2990;&#3021; &#2952;&#2975;&#3021;&#2975;&#3007;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2951;&#2980;&#3009;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3015;&#2991;&#3015; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;.</p><p>&#2951;&#2980;&#3009;&#2986;&#3019;&#2985;&#3021;&#2993; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2965;&#2995;&#3021; &#2980;&#2993;&#3021;&#2986;&#3019;&#2980;&#3009; &#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2985;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#2995;&#3016; &#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2979;&#2992;&#2980;&#3021;&#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2991;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2984;&#3015;&#2992;&#2975;&#3007;&#2991;&#3006;&#2965; &#2952;&#2975;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2965;&#3018;&#2975;&#3016;&#2965;&#2995;&#3021; &#2965;&#3007;&#2975;&#3016;&#2986;&#3021;&#2986;&#2980;&#3019;&#2975;&#3009;, &#2984;&#3008;&#2979;&#3021;&#2975;&#2965;&#3006;&#2994; &#2950;&#2980;&#2992;&#2997;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2952;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2951;&#2991;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3016; &#2951;&#2984;&#3021;&#2980; &#2986;&#2979;&#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3009; &#2958;&#2984;&#3021;&#2980;&#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2958;&#2979;&#3021;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2984;&#3007;&#2992;&#2994;&#2992;&#3009;&#2990;&#3021; &#2970;&#3014;&#2994;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#2995;&#2997;&#3007;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2991;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#3019;&#2992;&#3021; &#2953;&#2992;&#3016;&#2991;&#3006;&#2975;&#3009;&#2990;&#3021; &#2997;&#3007;&#2980;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007;&#2991;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2986;&#2979;&#2980;&#3021;&#2980;&#3016; &#2970;&#3014;&#2994;&#2997;&#2996;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3007;&#2985;&#3021;&#2993;&#3007;, &#2949;&#2984;&#3021;&#2980; &#2990;&#3009;&#2980;&#2994;&#3008;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2986;&#2994;&#2985;&#3016; &#2949;&#2995;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2970;&#3014;&#2991;&#2994;&#3021;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2995;&#3006;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#3010;&#2975; &#2970;&#3007;&#2994; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3021;&#2965;&#2995;&#3021; &#2958;&#2996;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2986;&#2975;&#3007;&#2984;&#3007;&#2994;&#3016; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021;, &#2986;&#2992;&#2997;&#2994;&#3006;&#2985; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2994;&#2992;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975; &#2970;&#2990;&#3010;&#2965;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2951;&#2979;&#3016;&#2984;&#3021;&#2980;&#3009; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;? "&#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2980;&#3021;&#2980;&#3007;&#2993;&#2985;&#3021;" &#2958;&#2985;&#3021;&#2985; &#2958;&#2985;&#3021;&#2986;&#2980;&#3007;&#2994;&#3006;&#2997;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2995;&#3021; &#2962;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3006;</p><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2970;&#2990;&#3010;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2984;&#3007;&#2980;&#3007; &#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3016;, &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2997;&#2992;&#2997;&#3015;&#2993;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965;&#2997;&#3015; &#2986;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2975;&#2965;&#3021;&#2965;&#3007;&#2991; &#2958;&#2979;&#3021;&#2979;&#2993;&#3021;&#2993; &#2965;&#3009;&#2996;&#2986;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2965;&#3021;&#2965; &#2951;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2986;&#2975;&#3021;&#2970;&#2990;&#3021;, &#2949;&#2975;&#3009;&#2980;&#3021;&#2980; &#2950;&#2993;&#3009;&#2990;&#3006;&#2980; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2997;&#2980;&#3009; &#2951;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2953;&#2991;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2965; &#2984;&#2990;&#2980;&#3009; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3016; &#2970;&#3014;&#2994;&#2997;&#3007;&#2975;&#3009;&#2965;&#3007;&#2993;&#3019;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2958;&#2979;&#3021;&#2979;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2995;&#3007;&#2980;&#3021;&#2980;&#3009;, &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2950;&#2992;&#3021;&#2997;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965; &#2997;&#2996;&#3007;&#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2950;&#2980;&#2992;&#2997;&#3006;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009; &#2986;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016; &#2986;&#3007;&#2993;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. IBM &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2950;&#2980;&#2992;&#3007;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2949;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2991;&#3006;&#2992;&#3009;&#2990;&#3021; &#2965;&#3016;&#2997;&#3007;&#2975;&#2986;&#3021;&#2986;&#3019;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985; &#2986;&#2994;&#2992;&#3009;&#2990;&#3021; &#2984;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3015;&#2991;&#3015;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2949;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2985;&#3016;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p><p>&#2984;&#3007;&#2980;&#3007;&#2991;&#3006;&#2980;&#3006;&#2992;&#2990;&#3021;, &#2962;&#2992;&#3009;&#2997;&#3007;&#2980; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992; &#2984;&#3019;&#2965;&#3021;&#2965;&#3016;&#2991;&#3009;&#2990;&#3021; &#2980;&#2985;&#3021;&#2985;&#3009;&#2975;&#2985;&#3021; &#2949;&#2996;&#3016;&#2980;&#3021;&#2980;&#3009;&#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2970;&#2992;&#3007;&#2991;&#3006;&#2965;&#2965;&#3021; &#2965;&#3016;&#2991;&#3006;&#2995;&#2986;&#3021;&#2986;&#2975;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3016;, &#2986;&#2979;&#2990;&#3021;, &#2951;&#2992;&#3009; &#2986;&#3007;&#2992;&#3007;&#2997;&#3007;&#2985;&#2992;&#3006;&#2965;&#2986;&#3021; &#2986;&#3007;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;. &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3016; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965; &#2984;&#3007;&#2980;&#3007;&#2991;&#3006;&#2980;&#2992;&#2997;&#3009; &#2980;&#2992;&#3009;&#2990;&#3021; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3015; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993; &#2958;&#2979;&#3021;&#2979;&#2990;&#3021;, &#2954;&#2980;&#3007;&#2991;&#2990;&#3021; &#2986;&#3014;&#2993;&#3006;&#2980; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2990;&#3006;&#2991;&#3007;&#2985;&#3021;, &#2986;&#3007;&#2993;&#2992;&#2980;&#3009; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2996;&#3016;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009;&#2986;&#3021; &#2986;&#2980;&#3007;&#2994;&#3006;&#2965;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2965;&#3009;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3007;&#2990;&#3016; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007; &#2984;&#2965;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2994;&#3021;&#2997;&#2992;&#3021;. &#2951;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2990;&#2975;&#2994;&#3006;&#2975;&#2993;&#3021;&#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2986;&#3009;&#2965;&#3006;&#2992;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2965;&#3018;&#2974;&#3021;&#2970;&#2990;&#3021; &#2965;&#3018;&#2974;&#3021;&#2970;&#2990;&#3006;&#2965;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#3008;&#2997;&#3007;&#2992; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2994;&#2965;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2997;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021; &#2965;&#2979;&#3021;&#2975;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009; &#2949;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2997;&#2996;&#3009;&#2984;&#3008;&#2965;&#3021;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993; &#2970;&#3007;&#2993;&#3009; &#2970;&#3007;&#2993;&#3009; &#2997;&#3015;&#2994;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2980;&#3018;&#2975;&#2992;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2990;&#3007;&#2965;&#2986;&#3021;&#2986;&#3014;&#2992;&#3007;&#2991; &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965;&#2990;&#3019;, &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3019; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3014;&#2985;&#3021;&#2985; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;, &#2949;&#2980;&#2993;&#3021;&#2965;&#3015;&#2993;&#3021;&#2993;&#2986;&#2975;&#3007; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p><p>&#2986;&#2979;&#2980;&#3021;&#2980;&#3016; &#2965;&#2997;&#2985;&#2990;&#3006;&#2965; &#2965;&#3016;&#2991;&#3006;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2986;&#2979;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2997;&#3007;&#2975; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2990;&#2993;&#3016;&#2990;&#3009;&#2965;&#2990;&#3006;&#2965; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2986;&#3014;&#2993; &#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2984;&#3015;&#2992;&#2975;&#3007;&#2991;&#3006;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2997;&#2979;&#3007;&#2965;&#2986;&#3021;&#2986;&#2992;&#3007;&#2997;&#2992;&#3021;&#2980;&#3021;&#2980;&#2985;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#2985;&#2980;&#3009; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; &#2986;&#2979;&#2980;&#3021;&#2980;&#3016; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2949;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3016;&#2991;&#3014;&#2996;&#3009;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#3009;, &#2986;&#2979;&#2990;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#3007;, &#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2949;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2962;&#2992;&#3009;&#2970;&#3007;&#2994; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2990;&#3007;&#2975;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2979;&#2990;&#3021; &#2980;&#2992;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2965;&#3019;&#2992;&#3007;&#2965;&#3021;&#2965;&#3016; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021; &#2970;&#2990;&#3010;&#2965;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2980;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2984;&#3021;&#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3016; &#2959;&#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3019;&#2975;&#3009;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2959;&#2990;&#3006;&#2993;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3015; &#2953;&#2979;&#3021;&#2990;&#3016;. &#2980;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2970;&#2990;&#3010;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2962;&#2980;&#3021;&#2980;&#3009;&#2986;&#3021;&#2986;&#3019;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#3015; &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3015; &#2980;&#2997;&#3007;&#2992;, &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2984;&#3019;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965;&#3006;&#2980;&#3009;.</p><p>&#2958;&#2985;&#2997;&#3015;, &#2986;&#2979;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3016;&#2986;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2980;&#3021;&#2980;&#2992; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3016; &#2949;&#2980;&#3007;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3016;&#2986;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2980;&#3021;&#2980;&#2992;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;. &#2958;.&#2965;&#3006;: &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021;. &#2984;&#2994;&#3021;&#2994; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3016; &#2997;&#3015;&#2994;&#3016;&#2965;&#3021;&#2965;&#3009; &#2949;&#2990;&#2992;&#3021;&#2980;&#3021;&#2980;&#3007;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3009;&#2990;&#3021;, &#2984;&#2990;&#3021;&#2986;&#2965;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2995;&#3021;&#2995; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2986;&#3007;&#2993;&#2992;&#3016;&#2986;&#3021;&#2986;&#3019;&#2994;&#2997;&#3015; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2990;&#3016; &#2949;&#2995;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2990;&#3016;&#2991;&#3016;&#2980;&#3021;&#2980;&#3006;&#2979;&#3021;&#2975;&#3007; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#2980;&#3009; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2997;&#2995;&#2992;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2954;&#2980;&#3007;&#2991;&#2990;&#3021; &#2986;&#3014;&#2993;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2984;&#3019;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#2993;&#3016;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;. &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2997;&#2992; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2990;&#3021; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2965;&#3006;&#2992;&#2979;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3015; &#2949;&#2980;&#3016;&#2970;&#3021; &#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#3016;&#2991; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2975; &#2958;&#2984;&#3021;&#2980;&#2997;&#3007;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2984;&#3007;&#2991;&#3006;&#2991;&#2990;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2953;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2986;&#3007;&#2992;&#2980;&#3007;&#2984;&#3007;&#2980;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2984;&#3007;&#2994;&#3016;&#2991;&#3016;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#3015; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2995;&#2997;&#3009;&#2990;&#3021;, &#2984;&#3007;&#2980;&#3007;&#2984;&#3007;&#2994;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2997;&#2979;&#3007;&#2965;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3009;&#2990;&#3021; &#2951;&#2980;&#3007;&#2994;&#3021; &#2958;&#2997;&#3021;&#2997;&#3007;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;.</p></div><div class="sect1" title="Crowdfunding: Kickstarter, etc"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="crowdfunding"></a>Crowdfunding: Kickstarter, etc</h2></div></div></div><p><span class="emphasis"><em>24 March 2013: If you're reading this note, then
you've encountered this section while it's undergoing substantial
revision; see <a class="ulink" href="http://producingoss.com/v2.html" target="_top">producingoss.com/v2.html</a> for details.</em></span></p><p>poss2 tbd</p><p><span class="emphasis"><em>Kickstarter is the obvious place to start, but there
are other funding systems too.  Look at campaigns that have used
indiegogo, snowdrift (if in production by then), ask around for
others.  Use Michael Bernstein's tips on how to do it
right.</em></span></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="non-profit.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="types-of-involvement.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2951;&#2994;&#3006;&#2986;&#2984;&#3019;&#2965;&#3021;&#2965;&#2993;&#3021;&#2993; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2980;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;</td></tr></table></div></body></html>
