<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="index.html" title="Producing Open Source Software"><link rel="next" href="audience.html" title="&#2991;&#3006;&#2992;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2986;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="audience.html">Next</a></td></tr></table><hr></div><div class="preface" title="&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="preface.html#why">&#2959;&#2985;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021;?</a></span></dt><dt><span class="sect1"><a href="audience.html">&#2991;&#3006;&#2992;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2986;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?</a></span></dt><dt><span class="sect1"><a href="sources.html">&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;</a></span></dt><dt><span class="sect1"><a href="acknowledgments.html">&#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;</a></span></dt><dt><span class="sect1"><a href="disclaimer.html">&#2986;&#3014;&#3006;&#2993;&#3009;&#2986;&#3021;&#2986;&#3006;&#2965;&#3006;&#2990;&#3016;</a></span></dt></dl></div><div class="sect1" title="&#2959;&#2985;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021;?"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="why"></a>&#2959;&#2985;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021;?</h2></div></div></div><p>&#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3014;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2984;&#3007;&#2965;&#2996;&#3021;&#2970;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;
 &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; &#2958;&#2985;&#3021;&#2985;&#3016; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021;  &#2959;&#2995;&#2985;&#2990;&#3006;&#2965; &#2986;&#3006;&#2992;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;, &#2986;&#2980;&#3007;&#2994;&#3006;&#2965; "&#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;!! &#2994;&#3007;&#2985;&#2965;&#3021;&#3000;&#3021; &#2986;&#3019;&#2985;&#3021;&#2993; 
 &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;?" &#2958;&#2985;&#3021;&#2993;&#3009; &#2950;&#2997;&#2994;&#3006;&#2965; &#2997;&#3007;&#2985;&#2997;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.  &#2984;&#3006;&#2985;&#3009;&#2990;&#3021; "&#2950;&#2990;&#3021;, &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#2992;&#3007;&#2991;&#3006;&#2965; 
 &#2970;&#3018;&#2985;&#3021;&#2985;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;!!" &#2958;&#2985;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3016;&#2991;&#3009;&#2975;&#2985;&#3021;.  &#2951;&#2980;&#2985;&#3006;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021;&#2965;&#2975;&#2984;&#3021;&#2980; &#2965;&#3006;&#2994;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; 
 &#2949;&#2984;&#3021;&#2984;&#3007;&#2991;&#2990;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2986;&#3021;&#2986;&#3019;&#2980;&#3014;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; "&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2997;&#2992;&#3009;&#2990;&#3006;&#2985;&#2990;&#3021; 
 &#2986;&#3014;&#2993;&#3009;&#2965;&#3007;&#2993;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;" &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2990;&#2965;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2951;&#2992;&#2979;&#3021;&#2975;&#2997;&#2980;&#3009; &#2997;&#3007;&#2985;&#3006;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3009;.  &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2990;&#3009;&#2993;&#3016; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
 &#2951;&#2980;&#3016; &#2997;&#3007;&#2985;&#2997;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021; &#2984;&#3006;&#2985;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#2992;&#3009;&#2995;&#3021; &#2962;&#2992;&#3009;&#2970;&#3007;&#2994; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2997;&#3007;&#2991;&#2986;&#3006;&#2992; 
 &#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2986;&#3019;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2962;&#2992;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2991;&#3006;&#2965; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;. &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#2985;&#3021;, 
 &#2986;&#3007;&#2992;&#2980;&#3007;&#2965;&#2995;&#3016; &#2997;&#3007;&#2993;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2990;&#3006;&#2993;&#3006;&#2965; &#2949;&#2984;&#3021;&#2980; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#2986;&#3014;&#2993;&#3009;&#2990;&#3021;
 &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2993;&#3009;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;  &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3021;&#2986;&#3015;&#2985;&#3021;</p><p>&#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#3007;&#2985;&#3006; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; <sup>[<a name="idp122864" href="#ftn.idp122864" class="footnote">1</a>]</sup> &#2986;&#3019;&#2992;&#3009;&#2995;&#2980;&#2992;&#2980;&#3007;&#2985;&#3016; 
&#2986;&#2993;&#3021;&#2993;&#3007; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; <span class="emphasis"><em> "&#2949;&#2980;&#3009; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;?"</em></span> &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021;.</p><p>&#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2958;&#2993;&#3021;&#2993;&#3009;&#2965;&#3018;&#2994;&#3021;&#2994;&#2965;&#3010;&#2975;&#3007;&#2991; &#2986;&#2980;&#3007;&#2994;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;; &#2990;&#3014;&#2994;&#3021;&#2994;&#3009;&#2990;&#3021; 
&#2949;&#2980;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007; &#2970;&#3007;&#2984;&#3021;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;&#2990;&#3021; &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2990;&#2993;&#3021;&#2993; 
&#2980;&#3019;&#2996;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;(&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2985;&#3021; &#2986;&#2992;&#3007;&#2985;&#2990;&#2980;&#3007;&#2985;&#3016; &#2990;&#3009;&#2985;&#3021;&#2986;&#3007;&#2985;&#3021; 
&#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3007;&#2992;&#3006;&#2980; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997; &#2980;&#3018;&#2979;&#3021;&#2975;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2990;&#3009;&#2993;&#3021;&#2970;&#3007;&#2991;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3007;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;), &#2994;&#3006;&#2986;&#2984;&#3019;&#2965;&#3007;&#2985;&#3021;&#2993;&#3007; 
&#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3006;&#2965;&#2997;&#3019; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965;&#2997;&#3019; &#2965;&#3010;&#2975; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  
&#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#3007;&#2991;&#2985;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#2979;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2970;&#2993;&#3021;&#2993;&#3009; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021; <span class="foreignphrase"><em class="foreignphrase">
sui generis</em></span> &#2958;&#2985;&#3021;&#2993; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3015; &#2990;&#3009;&#2975;&#3007;&#2997;&#3006;&#2965; &#2997;&#2992;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2986;&#2993;&#3021;&#2986;&#2994; 
&#2965;&#3010;&#2993;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2958;&#2985;&#3021;&#2985;&#3006;&#2994;&#3021; &#2962;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#3009; &#2986;&#2992;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3015; &#2980;&#2997;&#3007;&#2992; &#2958;&#2980;&#2985;&#3009;&#2975;&#2985;&#3009;&#2990;&#3021; &#2970;&#2990;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;.  &#2963;&#2992;&#3021; 
&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; (project) <span class="emphasis"><em>&#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2997;&#3007;&#2975;&#2994;&#3006;&#2990;&#3021;</em></span> 
&#2949;&#2980;&#3009; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997; &#2980;&#3018;&#2979;&#3021;&#2975;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2965;&#2997;&#2992;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2997;&#3015;&#2965;&#3009;&#2970;&#3007;&#2992;&#2986;&#2965;&#2997;&#3015; 
&#2990;&#3015;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3009;&#2990;&#3021; &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2953;&#2992;&#3007;&#2990;&#3016;&#2965;&#3019;&#2992; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2958;&#2969;&#3021;&#2965;&#3015;&#2985;&#3009;&#2990;&#3021; &#8212;&#2958;&#2994;&#3021;&#2994;&#3006;&#2997;&#3007;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;&#8212; &#2991;&#3006;&#2992;&#3019;&#2997;&#3018;&#2992;&#3009;&#2997;&#2992;&#3021; &#2949;&#2980;&#2985;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2980;&#3009; &#2984;&#2975;&#2980;&#3021;&#2980; 
&#2990;&#3009;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;&#2986;&#3018;&#2980;&#3009; &#2949;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2984;&#3007;&#2993;&#3009;&#2980;&#3021;&#2980;&#3007;&#2997;&#3007;&#2975; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;.  &#2951;&#2969;&#3021;&#2965;&#3009; &#2958;&#2994;&#3021;&#2994;&#3019;&#2992;&#3009;&#2990;&#3021; 
&#2949;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2950;&#2993;&#3021;&#2993;&#2994;&#3009;&#2990;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;;&#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2950;&#2993;&#3021;&#2993;&#2994;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009;&#2990;&#3007;&#2965;&#3021;&#2965; 
&#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3009;. </p><p>&#2951;&#2980;&#2994;&#2985;&#3016;&#2991;&#3015; &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#2965;&#2980;&#3007;&#2985;&#3016; &#2958;&#2996;&#3009;&#2980; &#2990;&#3009;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3015;&#2985;&#3021;.  &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2962;&#2992;&#3009;&#2990;&#3006;&#2992;&#3009;&#2986;&#2975;&#3021;&#2975; &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3016; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2997;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2951;&#2980;&#2985;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3015; &#2958;&#2994;&#3021;&#2994;&#3019;&#2992;&#3009;&#2990;&#3021; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, 
&#2949;&#2980;&#3015;&#2970;&#2990;&#2991;&#2990;&#3021; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; &#2986;&#3006;&#2980;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3009;&#2990;&#3021;, &#2962;&#2992;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3018;&#2993;&#3021;&#2993; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#2965;&#3007;&#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;.  
&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3018;&#2993;&#3021;&#2993;&#3009;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2950;&#2992;&#3019;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2991;&#3015; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#2979;&#3021;&#2986;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  
&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2975;&#2985;&#3009;&#2990;&#3021; &#2970;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#2979;&#3007;&#2991;&#2993;&#3021;&#2993;&#2997;&#2980;&#3009; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3007;&#2985;&#3021;&#2993;&#3007; &#2949;&#2985;&#3016;&#2997;&#2992;&#3007;&#2985;&#3021; &#2980;&#3007;&#2993;&#2990;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; 
&#2997;&#2996;&#3007;&#2997;&#2965;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2990;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3016; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965; 
&#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965; &#2990;&#3009;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2951;&#2980;&#3009; &#2958;&#2984;&#3021;&#2980; &#2997;&#3007;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3006;&#2965; 
&#2965;&#2992;&#3009;&#2980;&#2997;&#3007;&#2991;&#2994;&#3006;&#2980;&#3009; &#2950;&#2985;&#3006;&#2994;&#3021; &#2962;&#2992;&#3009; &#2980;&#3018;&#2975;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965;&#2997;&#3015; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2990;&#3015; &#2990;&#3007;&#2965; &#2953;&#2985;&#3021;&#2985;&#2980;&#2990;&#3006;&#2985; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3019;&#2995;&#3021;, &#2949;&#2980;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; 
&#2990;&#3009;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007; &#2965;&#3010;&#2993;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; &#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016; &#2986;&#2991;&#2985;&#3009;&#2995;&#3021;&#2995;&#2980;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; 
&#2997;&#3007;&#2992;&#3009;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2997;&#3006;&#2991;&#3007;&#2994;&#3006;&#2965; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2984;&#3015;&#2992;&#2975;&#3007;&#2991;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995; &#2997;&#2996;&#3007;&#2997;&#2965;&#3016; 
&#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3018;&#2995;&#3021;&#2965;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2991;&#2985;&#3021;&#2993;&#2997;&#2993;&#3021;&#2993;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3015;&#2985;&#3021;.  
&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2975;&#3009;&#2986;&#2975;&#3009;&#2997;&#2980;&#3015; <span class="emphasis"><em>&#2951;&#2985;&#3021;&#2986;&#2990;&#3021;</em></span>, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2949;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#2995;&#2992;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997;&#3009;&#2990;&#3021;.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp122864" href="#idp122864" class="para">1</a>] </sup>The
terms "open source" and "free" are essentially synonymous in this
context; they are discussed more in
<a class="xref" href="introduction.html#free-vs-open-source" title='"Free" Versus "Open Source"'>the section called &#8220;"Free" Versus "Open Source"&#8221;</a><span> in
<a class="xref" href="introduction.html" title="Chapter 1. &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3016;">Chapter 1, <i>&#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3016;</i></a></span>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="audience.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Producing Open Source Software </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2991;&#3006;&#2992;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2986;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?</td></tr></table></div></body></html>
