<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2980;&#3018;&#2985;&#3007; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="getting-started.html" title="Chapter 2. &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;"><link rel="prev" href="license-quickstart.html" title="&#2962;&#2992;&#3009; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2997;&#3007;&#2979;&#3021;&#2979;&#2986;&#3021;&#2986;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;"><link rel="next" href="announcing.html" title="&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2980;&#3018;&#2985;&#3007; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="license-quickstart.html">Prev</a> </td><th width="60%" align="center">Chapter 2. &#2980;&#3018;&#2975;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</th><td width="20%" align="right"> <a accesskey="n" href="announcing.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2980;&#3018;&#2985;&#3007; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="setting-tone"></a>&#2980;&#3018;&#2985;&#3007; &#2970;&#3015;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009;</h2></div></div></div><p>&#2951;&#2980;&#3009;&#2997;&#2992;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2993;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007; &#2970;&#3015;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3019;&#2990;&#3021;: &#2953;&#2992;&#3007;&#2990;&#2990;&#3021;
&#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965; &#2951;&#2979;&#3016;&#2991; &#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2980;&#2991;&#3006;&#2992;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#2997;&#2993;&#3021;&#2993;&#3016;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021;
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2965;&#3006;&#2992;&#3007;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2953;&#2992;&#3007;&#2991;&#2997;&#3016;.  &#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;
&#2958;&#2995;&#3007;&#2980;&#3009;; &#2949;&#2980;&#3007;&#2994;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2950;&#2965;&#3021;&#2965;&#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2980;&#3008;&#2990;&#3016; &#2949;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; 
&#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; &#2965;&#3006;&#2992;&#3007;&#2991;&#2990;&#3021;.  &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2959;&#2993;&#3021;&#2965;&#3021;&#2965;&#2985;&#2997;&#3015; &#2970;&#3007;&#2994; &#2965;&#3006;&#2994;&#2990;&#3006;&#2965; &#2984;&#2975;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;
&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3018;&#2994;&#3009;&#2980;&#3009; &#2949;&#2980;&#2985;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2970;&#3014;&#2991;&#2994;&#3021;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3021; &#2990;&#3006;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3016;&#2994;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; 
&#2986;&#2985;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2980;&#2993;&#3021;&#2965;&#3021;&#2965;&#3006;&#2965; &#2980;&#2991;&#3006;&#2992;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2984;&#3015;&#2992;&#3009;&#2990;&#3021;.</p><p>&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985;&#2997;&#3016;, &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2980;&#3006;&#2992;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021; &#2986;&#3006;&#2992;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; 
&#2949;&#2990;&#3016;&#2965;&#3021;&#2965; &#2986;&#2975; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2980;&#2985;&#3021;&#2990;&#3016; &#2949;&#2980;&#2985;&#3021; &#2997;&#2992;&#3016;&#2991;&#2992;&#3009;&#2965;&#3021;&#2965;&#2986;&#2975;&#3021;&#2975; &#2965;&#3014;&#3006;&#2995;&#3021;&#2965;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;, 
&#2965;&#3006;&#2994;&#2986;&#3021;&#2986;&#3015;&#3006;&#2965;&#3021;&#2965;&#3007;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#3009; &#2965;&#3006;&#2975;&#3021;&#2975; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2985;&#3021;&#2975; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2974;&#3006;&#2985;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.
&#2958;&#2996;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2965;&#3018;&#2995;&#3021;&#2965;&#3016;&#2965;&#2995;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;, &#2949;&#2997;&#3016; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2984;&#3007;&#2992;&#3021;&#2997;&#2965;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#2993;&#3007;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980; 
&#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#2995;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2962;&#2986;&#3021;&#2986;&#2984;&#3021;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021;&#2980;&#3006;&#2985;&#3021;.  &#2958;&#2996;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#2992;&#3016;&#2991;&#2993;&#3016;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; 
&#2986;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3016; &#2980;&#3019;&#2992;&#3006;&#2991;&#2990;&#3006;&#2965; &#2965;&#3010;&#2975; &#2980;&#3014;&#2993;&#3007;&#2997;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.</p><p>&#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975; &#2970;&#3007;&#2994; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;.  &#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#2990;&#3010;&#2965; &#2997;&#2992;&#3016;&#2991;&#2993;&#3016;&#2965;&#2995;&#3006;&#2994;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3007; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965; &#2965;&#3014;&#3006;&#2995;&#3021;&#2990;&#3009;&#2980;&#2994;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2984;&#3007;&#2985;&#3016;&#2986;&#3021;&#2986;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2970;&#3015;&#2980;&#2990;&#3021; &#2949;&#2975;&#3016;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;
<span class="emphasis"><em>&#2949;&#2980;&#3008;&#2980;</em></span> &#2997;&#3015;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3006;&#2980; &#2997;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#2984;&#3021;&#2980;&#3009; &#2970;&#3015;&#2992;&#2997;&#3009;&#2990;&#3021; &#2965;&#2993;&#3021;&#2993;&#2993;&#3007;&#2991;&#2997;&#3009;&#2990;&#3021;
&#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985; &#2965;&#2994; &#2949;&#2997;&#2965;&#2970;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2951;&#2979;&#3016;&#2984;&#3021;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980;&#2985;&#3016; &#2997;&#2994;&#3009;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; 
&#2990;&#2994;&#3016;&#2991;&#2992;&#3021; &#2986;&#3006;&#2975;&#2994;&#3021;&#2965;&#2995;&#3021; &#2986;&#2994; &#2984;&#3010;&#2993;&#3021;&#2993;&#3006;&#2985;&#3021;&#2975;&#3009;&#2965;&#2995;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985; &#2949;&#2980;&#3016; &#2984;&#3007;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; 
&#2953;&#2995;&#3021;&#2995; &#2965;&#3009;&#2996;&#2984;&#3021;&#2980;&#3016;&#2965;&#2995;&#3021; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2984;&#3010;&#2993;&#3009; &#2997;&#2992;&#3009;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2959;&#2992;&#2980;&#3021;&#2980;&#3006;&#2994; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3006;&#2975;&#3007;&#2997;&#3006;&#2992;&#3015; 
&#2951;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3006;&#2975;&#3007; &#2997;&#2992;&#3009;&#2965;&#3007;&#2992;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2970;&#3007;&#2993;&#3009; &#2965;&#3009;&#2996;&#2984;&#3021;&#2980;&#3016;&#2965;&#2995;&#3021; &#2986;&#3014;&#2992;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3006;&#2975;&#3007;&#2991;&#2980;&#3016; &#2965;&#3015;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2997;&#2995;&#2984;&#3021;&#2980;&#3009; &#2986;&#3014;&#2992;&#3007;&#2991;&#2997;&#2992;&#3021; &#2950;&#2985;&#2986;&#3007;&#2985;&#3021;&#2986;&#3009; &#2980;&#2985;&#3021;&#2985;&#3016; &#2997;&#3007;&#2975; &#2970;&#3007;&#2993;&#3007;&#2991;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3006;&#2975;&#3007; &#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2997;&#2992;&#3021;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3016; &#2986;&#2992;&#2997;&#2994;&#3006;&#2965;&#3021;&#2965; 
&#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2986;&#3006;&#2975;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#3006;&#2975;&#3007; &#2949;&#2980;&#2985;&#3016; &#2986;&#2992;&#2986;&#3021;&#2986;&#3007;&#2985;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.
&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#3006;&#2994; &#2949;&#2995;&#2997;&#3009;&#2965;&#2995;&#3021; &#2984;&#3010;&#2993;&#3021;&#2993;&#3006;&#2979;&#3021;&#2975;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#2979;&#2965;&#3021;&#2965;&#3007;&#2975; &#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; (&#2984;&#2990;&#3021;&#2990;&#3006;&#2994;&#3021; &#2949;&#2980;&#2985;&#3021;
&#2997;&#3006;&#2996;&#3021;&#2984;&#3006;&#2995;&#3016; &#2970;&#3014;&#2994;&#3021;&#2994;&#2997;&#3009;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;), &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2986;&#2992;&#2986;&#3021;&#2986;&#3009;&#2980;&#2994;&#3021; &#2980;&#3015;&#2997;&#3016; &#2965;&#3007;&#2975;&#3021;&#2975;&#2980;&#2975;&#3021;&#2975; &#2949;&#2980;&#3015;&#2986;&#3019;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; 
&#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993; &#2997;&#3007;&#2965;&#3007;&#2980;&#2990;&#3021; &#2997;&#3015;&#2965;&#2990;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3016; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2997;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2992;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2990;&#3010;&#2994;&#2990;&#3021; 
&#2952;&#2975;&#3009;&#2965;&#2975;&#3021;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2953;&#2980;&#2997;&#3007;&#2991;&#3016; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2970;&#2990;&#3010;&#2965; 
&#2984;&#3014;&#2993;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009;.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2980;&#3006;&#2985;&#3021; &#2990;&#2985;&#3007;&#2980; &#2970;&#2990;&#3010;&#2965;&#2990;&#3021;
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3009;&#2990;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3006;&#2994;&#3021; &#2951;&#2985;&#3016;&#2980;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#3009;&#2979;&#2992;&#3021;&#2997;&#3009;
&#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2979;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2985;&#3016;&#2984;&#3021;&#2980;&#3009; &#2986;&#3019;&#2997;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021; &#2949;&#2969;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#2992;&#3021; &#2950;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; 
&#2990;&#3009;&#2985;&#3021;&#2985;&#3019;&#2975;&#3007;&#2965;&#2995;&#3016; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; "&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021;" &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3016; &#2949;&#2984;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2986;&#2991;&#2985;&#3021; &#2953;&#2995;&#3021;&#2995;&#2997;&#3006;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021;;
&#2962;&#2992;&#3009;&#2990;&#3009;&#2992;&#3016; &#2984;&#3007;&#2993;&#3009;&#2997;&#3007;&#2991;&#2986;&#3007;&#2985;&#3021;, &#2949;&#2980;&#3007;&#2994;&#3021; &#2980;&#3006;&#2985;&#3006;&#2965; &#2986;&#3014;&#2992;&#3009;&#2990;&#2995;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009; &#2970;&#3009;&#2991; &#2984;&#3008;&#2975;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.</p><p>&#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3009;&#2985;&#3021;&#2985;&#3019;&#2975;&#3007;&#2965;&#2995;&#3016; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#2992;&#3021;&#2965;&#3009; &#2986;&#3007;&#2985;&#3021; &#2997;&#2992;&#3009;&#2997;&#2985; &#2970;&#3007;&#2994; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2953;&#2980;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#2994;&#3006;&#2990;&#3021;.
&#2949;&#2997;&#3016; &#2990;&#3009;&#2994;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2990;&#2985;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3016; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#2994;&#3021; &#2949;&#2980;&#3009; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; 
&#2997;&#3007;&#2991;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#2965;&#3009; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#2985;&#3021; &#2953;&#2980;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;.  &#2953;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021;,
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3015; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; 
&#2962;&#2992;&#3015; &#2949;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; <span class="emphasis"><em>&#2990;&#2985;&#2984;&#3007;&#2994;&#3016;</em></span> &#2949;&#2990;&#3016;&#2991; &#2986;&#2994; &#2997;&#2993;&#3021;&#2993;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;.  
&#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2980;&#3007;&#2965; &#2984;&#3015;&#2992;&#2990;&#3021; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009;&#2975;&#2985;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009; 
&#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2985;&#3021;&#2975; &#3000;&#2986;&#3021;&#2997;&#3014;&#2992;&#3021;&#3000;&#2985;&#3021; 
(<a class="ulink" href="http://subversion.apache.org/" target="_top">subversion.apache.org</a>)
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021; &#2997;&#2992;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021; &#2951;&#2984;&#3021;&#2980; &#2953;&#2980;&#3006;&#2992;&#2980;&#3021;&#2980;&#3007;&#2979;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#3015;&#2985;&#3021;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; &#3000;&#2986;&#3021;&#2997;&#3014;&#2992;&#3021;&#3000;&#2985;&#3021; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2986;&#2997;&#3016; &#2949;&#2994;&#3021;&#2994;; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#2994;&#3021;&#2997;&#3015;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; 
&#2970;&#3010;&#2996;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2997;&#2980;&#3006;&#2994;&#3021; &#2951;&#2980;&#2985;&#3016; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#2994;&#3006;&#2990;&#3021;.</p><div class="sect2" title="&#2980;&#2985;&#3007;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="avoid-private-discussions"></a>&#2980;&#2985;&#3007;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;</h3></div></div></div><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007;&#2991; &#2986;&#3007;&#2985;&#3021;&#2986;&#3009;&#2990;&#3021;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993; &#2984;&#3007;&#2993;&#3009;&#2997;&#3009;&#2985;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985; 
&#2980;&#2992;&#3009;&#2985;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#2985;&#3007;&#2991;&#3006;&#2965; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#3006;&#2985; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;.  &#2951;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;
&#2980;&#2965;&#3009;&#2980;&#3007; &#2986;&#2975;&#3016;&#2980;&#3021;&#2980; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2985; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2986;&#2994; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007; 
&#2953;&#2995;&#3021;&#2995;&#2980;&#3006;&#2994;&#3021; &#2951;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2984;&#2975;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.  &#2965;&#3016;&#2991;&#3006;&#2995;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991; &#2986;&#3018;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2980; &#2965;&#3009;&#2993;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021;
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2985;&#3021; &#2980;&#3019;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;: &#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2980;&#3006;&#2990;&#2980;&#2990;&#3021;, &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2958;&#2985;&#3021;&#2985;&#2990;&#3021; &#2980;&#3019;&#2985;&#3021;&#2993; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2984;&#3015;&#2992;&#2990;&#3021;, &#2958;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2965; &#2980;&#3014;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#3006;&#2990;&#2994;&#3021; &#2958;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; 
&#2949;&#2986;&#3021;&#2986;&#3006;&#2997;&#3007;&#2991;&#3006;&#2985; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997;&#2994;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2980;&#3019;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#3009;&#2996;&#2986;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3021; (&#2958;&#2994;&#3021;&#2994;&#3006; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2995;&#3009;&#2990;&#3021; &#2951;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;; &#2970;&#3007;&#2994; 
&#2984;&#3015;&#2992;&#3021;&#2990; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#2992;&#3009;&#2969;&#3021;&#2965;&#3006;&#2994; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2970;&#3007;&#2994; &#2970;&#2990;&#2991;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3015; 
&#2949;&#2986;&#3021;&#2986;&#3006;&#2997;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;), Y &#2958;&#2985;&#3021;&#2993; &#2986;&#3014;&#2992;&#3007;&#2991; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3007;&#2985;&#3021; X &#2958;&#2985;&#3021;&#2993; &#2970;&#3007;&#2993;&#3007;&#2991; &#2986;&#2965;&#3009;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2959;&#2985;&#3021; 
&#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3021; &#2980;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#3006;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994;.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#3006;&#2990;&#2994;&#3021;, 
&#2990;&#3010;&#2975;&#3007;&#2991; &#2949;&#2992;&#3016;&#2965;&#3021;&#2965;&#3009;&#2995;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2949;&#2980;&#3016; <span class="foreignphrase"><em class="foreignphrase">faits 
accomplis</em></span> (&#2984;&#3007;&#2992;&#3021;&#2986;&#2984;&#3021;&#2980;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2984;&#3007;&#2992;&#3016;&#2997;&#3015;&#2993;&#3021;&#2993; &#2986;&#2975;&#3021;&#2975;&#2980;&#3009;) &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2985;&#3016;&#2984;&#3021;&#2980; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; 
&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#2995;&#3006;&#2994;&#3021; &#2986;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#3009; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975; &#2980;&#3019;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#2994;&#2985;&#2990;&#3021;.</p><p>&#2949;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;.</p><p>&#2986;&#3018;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3014;&#2980;&#3009;&#2997;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021; &#2984;&#3008;&#2979;&#3021;&#2975; &#2984;&#3006;&#2995;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3007;&#2965;&#3021;&#2965;&#3009; 
&#2953;&#2965;&#2984;&#3021;&#2980;&#2980;&#3009;.  &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3016; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3016; &#2986;&#2992;&#2986;&#3021;&#2986;&#3009;&#2997;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#2980;&#3009;. &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2980;&#3008;&#2997;&#3007;&#2992; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3009;&#2990;&#3021;, &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2992;&#2965;&#2970;&#3007;&#2991; &#2965;&#3009;&#2996;&#3009; &#2953;&#2995;&#3021;&#2995; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#3008;&#2975;&#3007;&#2980;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2990;&#3006;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2993;&#3009;&#2965;&#3007;&#2991; &#2965;&#3006;&#2994; &#2980;&#3019;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007; &#2958;&#2980;&#3009;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2986;&#3018;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2984;&#3008;&#2985;&#3021;&#2975; &#2965;&#3006;&#2994; &#2984;&#2985;&#3021;&#2990;&#3016; &#2986;&#2991;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2965;&#3021;&#2965; &#2997;&#3007;&#2995;&#3016;&#2997;&#3009;&#2965;&#2995;&#3021; &#2953;&#2979;&#3021;&#2975;&#3009;:

</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#2949;&#2980;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2997;&#2995;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2991;&#3007;&#2992;&#3021;&#2970;&#3007; &#2980;&#2992; &#2953;&#2980;&#2997;&#3009;&#2990;&#3021;.  &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2958;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; 
&#2986;&#3015;&#2992;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2965;&#2997;&#2979;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2980;&#3014;&#2992;&#3007;&#2991;&#3006;&#2980;&#3009;; &#2986;&#2994;&#2992;&#3021; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965; 
&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2990;&#3016;&#2980;&#3007;&#2991;&#3006; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3006;&#2992;&#3021;&#2980;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2986;&#2994;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#3006; &#2980;&#2965;&#2997;&#2995;&#3021;&#2965;&#2995;&#3016; &#2970;&#3015;&#2965;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.</p></li><li class="listitem"><p>&#2949;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; <span class="emphasis"><em>&#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;</em></span> &#2949;&#2984;&#3021;&#2980; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007; 
&#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985; &#2980;&#3014;&#2995;&#3007;&#2997;&#3009; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2993; &#2986;&#2991;&#3007;&#2993;&#3021;&#2970;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2984;&#3021;&#2980; &#2980;&#3007;&#2993;&#2990;&#3016; &#2986;&#2991;&#3007;&#2993;&#3021;&#2970;&#3007;&#2991;&#3006;&#2994;&#3021; &#2997;&#2992;&#3009;&#2997;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2984;&#2985;&#3021;&#2965;&#3009; &#2949;&#2992;&#3007;&#2984;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2975;&#2985;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#3014;&#2992; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;.</p></li><li class="listitem"><p>&#2949;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, 
&#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2965;&#3006;&#2994; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3015; &#2997;&#2996;&#3007;&#2990;&#3009;&#2992;&#3016;&#2965;&#2995;&#3021; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3016; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.       
&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#2992;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; <a class="xref" href="growth.html#using-archives" title="Conspicuous Use of Archives">the section called &#8220;Conspicuous Use of Archives&#8221;</a><span>
        &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; <a class="xref" href="communications.html" title="Chapter 6. Communications">Chapter 6, <i>Communications</i></a></span> &#2951;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;.</p></li></ul></div><p>

</p><p>&#2951;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021; &#2986;&#3006;&#2992;&#3006;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009; &#2962;&#2985;&#3021;&#2993;&#3016;, &#2949;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#2991;&#2994;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2958;&#2997;&#2992;&#3015;&#2985;&#3009;&#2985;&#3021; &#2965;&#3010;&#2992;&#3007; 
&#2953;&#2993;&#3007;&#2991; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3016; &#2949;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2980;&#2992;&#3009;&#2997;&#2992;&#3021;.  &#2949;&#2980;&#3016; &#2949;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; &#2953;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3018;&#2994;&#3021;&#2994; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;; &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009; &#2958;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2958;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2970;&#3007;&#2992;&#2986;&#3021;&#2986;&#3009; &#2980;&#3007;&#2992;&#2990;&#3016; &#2980;&#3015;&#2997;&#3016;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;
&#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2980;&#3009;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2951;&#2975;&#3016;&#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009; &#2980;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3009; 
&#2953;&#2995;&#3021;&#2995;&#3009;&#2985;&#2992;&#3021;&#2997;&#3007;&#2994;&#3021; &#2984;&#3007;&#2985;&#3016;&#2986;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2975; &#2997;&#3007;&#2995;&#3016;&#2997;&#3009;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965; &#2990;&#3019;&#2970;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#3000;&#2986;&#3021;&#2997;&#3014;&#2992;&#3021;&#2970;&#2985;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021;, &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; 
(&#2984;&#3007;&#2992;&#3009;&#2997;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;) &#2986;&#2994; &#2990;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2970;&#3007;&#2984;&#3021;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2950;&#2996;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3007;&#2991;, &#2962;&#2992;&#3009;
&#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2991;&#3016;, &#2986;&#3009;&#2980;&#3007;&#2980;&#3006;&#2965; &#2949;&#2990;&#3016;&#2980;&#3021;&#2980; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2958;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2980;&#3008;&#2992;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2958;&#2985;&#3021;&#2985;&#3007;&#2985;&#3019;&#2990;&#3021;.
&#2958;&#2985;&#2997;&#3015; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3015; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3009;&#2991;&#2994;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;, &#2949;&#2980;&#3016; &#2962;&#2992;&#3009; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;
&#2965;&#2997;&#2979;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;<sup>[<a name="idp5505632" href="#ftn.idp5505632" class="footnote">21</a>]</sup> &#2949;&#2980;&#3016; &#2949;&#2997;&#2992;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009;&#2985;&#2992;&#3021;&#2980;&#2997;&#3009;&#2975;&#2985;&#3021; &#2949;&#2980;&#3016; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; 
&#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965; &#2997;&#2993;&#3021;&#2986;&#3009;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3006;&#2992;&#3021;.  &#2970;&#2993;&#3021;&#2993;&#3009; &#2980;&#2991;&#2965;&#3021;&#2965;&#2980;&#3009;&#2975;&#2985;&#3021; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3019;&#2990;&#3021;&#8212;&#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; 
&#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2953;&#2995;&#3021;&#2995;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2986;&#2980;&#3007;&#2994;&#3021;&#2965;&#2995;&#3016; &#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2997;&#3007;&#2991;&#2986;&#3021;&#2986;&#3007;&#2995;&#3021; &#2950;&#2994;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#3019;&#2990;&#3021;.  &#2986;&#2994; &#2970;&#3010;&#2996;&#3021;&#2984;&#3007;&#2994;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021;
&#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2965;&#3018;&#2975;&#3009;&#2980;&#3021;&#2980; &#2991;&#3019;&#2970;&#2985;&#3016;&#2965;&#2995;&#3021; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021; &#2986;&#3006;&#2992;&#3021;&#2980;&#3007;&#2992;&#3006;&#2980;&#3021;&#2980;&#3009;.  &#2949;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#2991;&#2994;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994; 
<span class="emphasis"><em>&#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021;</em></span> &#2984;&#3009;&#2985;&#3021;&#2985;&#2993;&#3007;&#2997;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2992;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007; &#2965;&#3006;&#2975;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009;; 
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2980;&#2992;&#3009;&#2985;&#2980;&#3007;&#2992;&#3021;&#2965;&#3006;&#2965; &#2965;&#3006;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;&#2992;&#3021;.  &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2975; &#2986;&#3018;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#2993;&#3021;&#2993;&#3009; 
&#2965;&#3006;&#2994;&#2980;&#3006;&#2990;&#2980;&#2990;&#3021; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#3016;&#2980;&#3006;&#2985;&#3021;, &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2990;&#3021; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3016; &#2965;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2986;&#2994;&#2985;&#3021; &#2980;&#2992;&#3009;&#2990;&#3021;.</p><p>"&#2980;&#2985;&#3007; &#2990;&#2985;&#3007;&#2980;&#2992;&#3016; &#2997;&#3007;&#2975; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2949;&#2993;&#3007;&#2997;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;" &#2958;&#2985;&#3021;&#2993;&#3009; &#2953;&#2975;&#2985;&#2975;&#3007;&#2991;&#3006;&#2965; 
&#2986;&#3014;&#3006;&#2980;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965;&#3021;&#2965;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#2997;&#3009;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009; (&#2984;&#3006;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2994; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2970;&#2984;&#3021;&#2980;&#3007;&#2980;&#3021;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#3019;&#2990;&#3021;), &#2950;&#2985;&#3006;&#2994;&#3021;
&#2970;&#3007;&#2994; &#2965;&#3009;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2965;&#3006;&#2992;&#3007;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#3009;&#2996;&#3009; &#2980;&#3007;&#2993;&#2990;&#3016; &#2990;&#3007;&#2965;&#3021;&#2965;&#2980;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2986;&#3018;&#2992;&#3007;&#2991; &#2949;&#2995;&#2997;&#3007;&#2994;&#3006;&#2985; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3021; &#2986;&#2992;&#3007;&#2970;&#3008;&#2994;&#2985;&#3016; 
&#2949;&#2980;&#3007;&#2994;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;; &#2986;&#2994; &#2986;&#3009;&#2980;&#3007;&#2991; &#2991;&#3019;&#2970;&#2985;&#3016;&#2965;&#2995;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;.  &#2991;&#3019;&#2970;&#2985;&#3016;&#2965;&#2995;&#3007;&#2985;&#3021; &#2980;&#2992;&#2990;&#3021; &#2949;&#2980;&#3016; &#2997;&#2992;&#3021;&#2965;&#2995;&#3021;
&#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#2985;&#3021; &#2980;&#2992;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3009;, &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2986;&#2975;&#3021;&#2975; &#2970;&#3007;&#2984;&#3021;&#2980;&#2985;&#3016;&#2991;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2965;&#3009;&#2996;&#2986;&#3021;&#2986;&#2990;&#3006;&#2985; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016; &#2980;&#2984;&#3021;&#2980;&#3009; &#2980;&#3010;&#2979;&#3021;&#2975;&#3007;&#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2949;&#2993;&#3007;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2965;&#2997;&#3015;, &#2970;&#3007;&#2994; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3009;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; 
&#2990;&#3009;&#2994;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2953;&#2980;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#3006;&#2979;&#3021;&#2986;&#3019;&#2990;&#3021;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2980;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3015;: 
<span class="emphasis"><em>&#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2965;&#3006;&#2992;&#2979;&#2990;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2986;&#3018;&#2980;&#3009;
&#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</em></span></p><p>&#2951;&#2980;&#3016; &#2984;&#2975;&#2965;&#3021;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991; &#2970;&#3007;&#2994; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016; &#2980;&#3015;&#2997;&#3016;.  &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; 
&#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2994;&#3021;&#2994;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3006;&#2980;&#3009;.  &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3015;&#2997;&#3016;&#2991;&#2993;&#3021;&#2993; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2962;&#2992;&#3009; &#2997;&#3015;&#2994;&#3016; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993; 
&#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3016; &#2986;&#3018;&#2980;&#3009;&#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2975;&#2990;&#3016; &#2950;&#2965;&#3007;&#2992;&#2980;&#3009;.  &#2949;&#2984;&#3021;&#2980;
&#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3016; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#2985;&#3007;&#2990;&#3016; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2992;&#3009;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#2992;&#3006;&#2980;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2985;&#3006;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3007;&#2997;&#3006;&#2980; &#2965;&#2994;&#2980;&#3021;&#2980;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007; &#2997;&#3007;&#2975;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.</p></div><div class="sect2" title="&#2990;&#3009;&#2992;&#2975;&#3021;&#2975;&#3009;&#2980;&#2985;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2995;&#3016;&#2991;&#3007;&#2994;&#3015;&#2991;&#3015; &#2965;&#3007;&#2995;&#3021;&#2995;&#3007; &#2958;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="prevent-rudeness"></a>&#2990;&#3009;&#2992;&#2975;&#3021;&#2975;&#3009;&#2980;&#2985;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2995;&#3016;&#2991;&#3007;&#2994;&#3015;&#2991;&#3015; &#2965;&#3007;&#2995;&#3021;&#2995;&#3007; &#2958;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;</h3></div></div></div><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015;, &#2990;&#3009;&#2992;&#2975;&#3021;&#2975;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2997;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3009;&#2995;&#3007;&#2991;&#3009;&#2990;&#3021; &#2951;&#2975;&#2990;&#3021; 
&#2980;&#2992;&#2965;&#3021;&#2965;&#3010;&#2975;&#3006;&#2980;&#3009;.  &#2980;&#3009;&#2995;&#3007;&#2991;&#3009;&#2990;&#3021; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2953;&#2992;&#3007;&#2990;&#3016;&#2991;&#3016; &#2986;&#2993;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2980;&#2992;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.  
(&#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2980;&#2990;&#3006;&#2985; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3009;&#2990;&#3021; &#2986;&#3018;&#2991;&#3021;&#2980;&#3021;&#2980; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009; &#2986;&#2975;
&#2984;&#3015;&#2992;&#2994;&#3006;&#2990;&#3021;.)  &#2980;&#3009;&#2995;&#3007;&#2991;&#3009;&#2990;&#3021; &#2951;&#2975;&#2990;&#3021; &#2980;&#2992; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2980;&#2997;&#2992;&#3006;&#2985; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3021; &#2958;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#3006;&#2990;&#2994;&#3021;
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021;.  &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2958;&#2997;&#2992;&#3006;&#2997;&#2980;&#3009; &#2962;&#2992;&#3009; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; 
<span class="foreignphrase"><em class="foreignphrase">ad hominem</em></span>&#2991;&#3009;&#2975;&#2985;&#3016; &#2951;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3016; 
&#2986;&#3009;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; <span class="foreignphrase"><em class="foreignphrase">ad hominem</em></span> &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2990;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2996;&#2965;&#3021;&#2965;&#3007; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007; &#2965;&#3006;&#2975;&#3021;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2950;&#2965;&#3021;&#2965; &#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3010;&#2975; &#2970;&#3007;&#2994; &#2970;&#2990;&#3016;&#2991;&#2990;&#3021; &#2949;&#2996;&#3007;&#2997;&#3009; &#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3007;&#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; 
&#2980;&#3009;&#2992;&#2980;&#3007;&#2992;&#3009;&#2999;&#3021;&#2975;&#2997;&#2970;&#2990;&#3006;&#2985;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2990;&#2994;&#3021; &#2949;&#2975;&#3007;&#2965;&#3021;&#2965;&#2975;&#3007; &#2984;&#2975;&#2986;&#3021;&#2986;&#2980;&#3009;.  &#2984;&#3015;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3015;&#2992;&#3006;&#2965; &#2970;&#3014;&#2994;&#3021;&#2994;&#3006;&#2980;&#2997;&#2993;&#3021;&#2993;&#3016; 
&#2965;&#3010;&#2975; &#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3007;&#2994;&#3021; &#2986;&#2994;&#2992;&#3009;&#2990;&#3021; &#2980;&#3014;&#2992;&#3009;&#2997;&#3007;&#2986;&#3021;&#2986;&#2992;&#3021;.  &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009; &#2949;&#2980;&#2985;&#3016; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2980;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;:
&#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2962;&#2992;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021;&#2980;&#3006;&#2985;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3006;&#2965; &#2986;&#2994;&#2992;&#3009;&#2990;&#3021; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;, &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2984;&#3021;&#2980;
&#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2965;&#2997;&#2985;&#2965;&#3021;&#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#3009;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021;&#2980;&#2985;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992;&#3009;&#2997;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;
&#2962;&#2992;&#3015; &#2997;&#2996;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2962;&#2992;&#3009;&#2997;&#3006;&#2992;&#3007;&#2985;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2986;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3016; &#2990;&#3009;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021; &#2980;&#2985;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;
&#2965;&#3010;&#2992;&#3009;&#2997;&#3006;&#2980;&#3009; &#2949;&#2997;&#2992;&#3016; &#2990;&#3009;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2970;&#3018;&#2994;&#3021;&#2994;&#3009;&#2997;&#2980;&#2992;&#3021;&#2965;&#3009; &#2970;&#2990;&#2990;&#3006;&#2985;&#2980;&#3009;.  &#2984;&#2975;&#2990;&#3009;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2958;&#2984;&#3021;&#2980; &#2951;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986;
&#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980;&#3009; &#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3009; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2965;&#2975;&#3007;&#2985;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3006;&#2994;&#3021;&#2980;&#3006;&#2985;&#3021; &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; 
&#2980;&#2985;&#3021;&#2975;&#2985;&#3016; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#2975;&#3016;&#2965;&#2995;&#3021; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2970;&#3014;&#2991;&#2994;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2980;&#3009;.  &#2958;&#2985;&#2997;&#3015; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2984;&#2975;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, 
&#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#2997;&#2992;&#3006;&#2985; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2997;&#2995;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2990;&#2994;&#3021; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965;, &#2984;&#2975;&#3021;&#2986;&#3009; &#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#3016; &#2953;&#2979;&#2992;&#3021;&#2980;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#3010;&#2992;&#3016;&#2991;&#3016; &#2986;&#2980;&#3007;&#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; "&#2990;&#3014;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2965;&#3018;&#2995;&#3021;&#2965;&#3016;" &#2990;&#2996;&#2994;&#3016;&#2991;&#2992;&#3021; &#2986;&#2995;&#3021;&#2995;&#3007;&#2991;&#3007;&#2994;&#3021; &#2984;&#2985;&#3021;&#2984;&#2975;&#2980;&#3021;&#2980;&#3016; &#2986;&#3006;&#2975;&#2990;&#3021; 
&#2986;&#3009;&#2965;&#2975;&#3021;&#2975;&#3009;&#2997;&#2980;&#3009; &#2986;&#3019;&#2994;&#3021; &#2980;&#3019;&#2993;&#3021;&#2993;&#2990;&#3021; &#2980;&#2992;&#3009;&#2990;&#3021;:</p><div class="blockquote"><blockquote class="blockquote"><p><span class="emphasis"><em>&#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021;, (&#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3009;&#2995;&#3021;&#2995;) &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2965;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#2995;&#3016; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980;&#2997;&#2992;&#3016; &#2965;&#3009;&#2992;&#3016;&#2980;&#3021;&#2980;&#3009; 
&#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2991;&#2992;&#3021;&#2970;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2972;&#3014; &#2958;&#2985;&#3021;&#2986;&#2997;&#2992;&#3007;&#2985;&#3021; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2949;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016;
"&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3018;&#2992;&#3007; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993; &#2949;&#2986;&#3021;&#2986;&#3006;&#2997;&#3007;&#2991;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2949;&#2993;&#3007;&#2997;&#3009; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;." &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3010;&#2992;&#3009;&#2997;&#2980;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#2997;&#2993;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2995;&#3006;&#2990;&#3021;,
&#2958;&#2980;&#3009;&#2997;&#3006;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3016;&#2965;&#2995;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2997;&#3016;. &#2972;&#3014; &#2949;&#2997;&#2992;&#3007;&#2985;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3016; &#2984;&#2994;&#3021;&#2994; 
&#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3009;&#2975;&#2985;&#3021; &#2970;&#3018;&#2994;&#3021;&#2994;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3007;&#2994;&#3021; &#2980;&#2997;&#2993;&#3009;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021;, &#2970;&#3009;&#2975;&#3021;&#2975;&#3007; &#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;
&#2984;&#3006;&#2990;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2980;&#3007;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3019;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2997;&#3015;&#2992;&#3009; &#2962;&#2992;&#3009; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2986;&#3018;&#2992;&#2994;&#3006;&#2990;&#3021;.  &#2958;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021; 
&#2972;&#3014;&#2997;&#3016; &#2951;&#2996;&#3007;&#2997;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2970;&#3018;&#2994;&#3021;&#2994;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3009; &#2984;&#3006;&#2985;&#3021; &#2984;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2992;&#3015;&#2985;&#3021;, &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2970;&#3018;&#2993;&#3021;&#2993;&#3018;&#2975;&#2992;&#3021; 
&#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2969;&#3021;&#2965;&#3009; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2965;&#3021;&#2965; &#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007;
&#2986;&#3006;&#2992;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2991;&#2994; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</em></span></p><p><span class="emphasis"><em>&#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2990;&#3009;&#2985;&#3021;&#2990;&#3018;&#2996;&#3007;&#2991; &#2986;&#2975;&#3021;&#2975; &#2949;&#2984;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021;.  &#2958;&#2985;&#2980;&#3009; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016; &#2986;&#2975;&#3007; 
&#2958;&#2990;&#3021; &#2970;&#2992;&#3007;&#2991;&#3006;&#2965; &#2970;&#3018;&#2994;&#3021;&#2994; &#2984;&#3007;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;...</em></span></p></blockquote></div><p>&#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#2980;&#3007;&#2994;&#3021; &#2986;&#2965;&#2975;&#3021;&#2975;&#3006;&#2985;&#2980;&#3006;&#2965;&#3021; &#2980;&#3019;&#2985;&#3021;&#2993;&#3007;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2997;&#3016; &#2986;&#2994;&#2985;&#3021; &#2980;&#2992;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#3016;.  &#2980;&#2997;&#2993;&#3006;&#2985; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2970;&#3014;&#2994;&#3021;&#2994; &#2986;&#2975;&#3021;&#2975; &#2986;&#2980;&#3007;&#2994;&#3021;&#2965;&#2995;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2965;&#2997;&#2979;&#3007;&#2980;&#3021;&#2980;&#3009; &#2970;&#3018;&#2985;&#3021;&#2985;&#2997;&#2992;&#3016; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2990;&#2994;&#3009;&#2990;&#3021; &#2997;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965; &#2997;&#2993;&#3021;&#2986;&#3009;&#2992;&#3009;&#2980;&#3021;&#2980;&#3006;&#2990;&#2994;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2970;&#3018;&#2994;&#3021;&#2994;&#3007; &#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2950;&#2970;&#3009;&#2997;&#3006;&#2970; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2984;&#3015;&#2992;&#2990;&#3021; &#2980;&#2984;&#3021;&#2980;&#3009; &#2949;&#2975;&#3009;&#2980;&#3021;&#2980; &#2990;&#3009;&#2992;&#3016; &#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2986;&#2980;&#3007;&#2994;&#3021; &#2970;&#3018;&#2994;&#3021;&#2994; &#2997;&#3006;&#2991;&#3021;&#2986;&#3009; &#2980;&#2992;&#2994;&#3006;&#2990;&#3021;&#8212;&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.</p><p>&#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2990;&#3006;&#2992;&#3009;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965; &#2990;&#3006;&#2992;&#3006;&#2990;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021; &#2949;&#2980;&#3016; 
&#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2986;&#3014;&#2992; &#2997;&#3016;&#2965;&#3021;&#2965; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#2970;&#3007;&#2991;&#2990;&#3021;.  &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#3009;&#2992;&#3016;&#2984;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009;
&#2970;&#3007;&#2992;&#3009;&#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2951;&#2969;&#3021;&#2965;&#3009; &#2965;&#2997;&#2979;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; "&#2984;&#3006;&#2990;&#3021; &#2951;&#2986;&#3021;&#2986;&#2975;&#3007;&#2986;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; 
&#2951;&#2969;&#3021;&#2965;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2965;&#3007;&#2975;&#3016;&#2991;&#3006;&#2980;&#3009;" &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#3009; &#2949;&#2984;&#3021;&#2980; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#3007;&#2980;&#3009; &#2970;&#3018;&#2994;&#3021;&#2994;&#3007; &#2990;&#3009;&#2975;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;
&#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; &#2949;&#2984;&#3021;&#2980; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992; &#2959;&#2980;&#3009;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2991;&#3006;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3010;&#2992;&#3007;&#2991;&#2980;&#3016; &#2980;&#2997;&#2992;&#3006;&#2965; 
&#2984;&#3007;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;	 &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2965;&#3010;&#2992;&#3007;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2970;&#2993;&#3021;&#2993;&#3009; &#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3006;&#2990;&#2994;&#3021; &#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;
&#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992;&#3006;&#2990;&#2994;&#3021; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021; (&#2962;&#2992;&#3009;&#2997;&#3015;&#2994;&#3016; &#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2996;&#3007;&#2965;&#3021;&#2965; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2980;&#3016; &#2997;&#3014;&#2992;&#3009;&#2990;&#2985;&#3015; &#2997;&#3014;&#2992;&#3009;&#2986;&#3021;&#2986;&#3016; 
&#2965;&#3018;&#2975;&#3021;&#2975;&#3007;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021; &#2997;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021; &#2970;&#3018;&#2994;&#3021;&#2994;&#3007; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;), &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2980;&#3007;&#2965;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;&#2985; &#2986;&#2980;&#3007;&#2994;&#3021; &#2997;&#3007;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#2980;&#3006;&#2965; 
&#2965;&#2992;&#3009;&#2980;&#3007;&#2985;&#3006;&#2994;&#3021; &#2990;&#2985;&#3021;&#2985;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#3015;&#2975;&#3021;&#2975;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#3009; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2958;&#2965;&#3021;&#2965;&#3006;&#2992;&#2985;&#2990;&#3021;
&#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2984;&#2986;&#2992;&#3007;&#2985;&#3021; &#2970;&#3014;&#2991;&#2994;&#3016; &#2980;&#2985;&#3007;&#2991;&#3006;&#2965;&#2997;&#3019; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2986;&#3018;&#2980;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3019; &#2965;&#3009;&#2993;&#3016;&#2965;&#3010;&#2992; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965; &#2997;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2980;&#3014;&#2992;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2985;&#3006;&#2994;&#3021; &#2984;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3016; &#2997;&#2992;&#3021;&#2986;&#3009;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991; 
&#2970;&#3018;&#2994;&#3021;&#2997;&#2980;&#3009; &#2990;&#2985;&#2965;&#3021;&#2965;&#2970;&#2986;&#3021;&#2986;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985; &#2951;&#2994;&#2970;&#3021;&#2970;&#3007;&#2991;&#2990;&#3021; "&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021;" &#2984;&#2994;&#3021;&#2994; &#2984;&#2975;&#2980;&#3021;&#2980;&#3016;&#2965;&#2995;&#3016; &#2949;&#2985;&#3021; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2985; &#2986;&#2979;&#3021;&#2986;&#3006;&#2965; &#2997;&#2995;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;.
&#2949;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2980;&#3015;&#2997;&#3016;&#2991;&#2993;&#3021;&#2993; &#2970;&#2985;&#3021;&#2975;&#3016;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; (&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2984;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007; 
&#2953;&#2980;&#2997; &#2984;&#3007;&#2985;&#3016;&#2980;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;) &#2990;&#3015;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2994;&#2965;&#3007; &#2970;&#3014;&#2985;&#3021;&#2993;&#3009;&#2997;&#3007;&#2975;&#3009;&#2997;&#3006;&#2992;&#3021;&#2995;&#3021;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2994;&#2965;&#3007;&#2991;&#2980;&#3009; &#2965;&#3010;&#2975; &#2953;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2965;&#2997;&#2979;&#3007;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;; &#2970;&#3007;&#2994;&#2992;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#3009; &#2986;&#3014;&#2992;&#3009;&#2997;&#3006;&#2980;&#3009; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009;
&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2980;&#2992;&#3006;&#2990;&#2994;&#3021; &#2986;&#2980;&#3009;&#2969;&#3021;&#2965;&#3007; &#2997;&#3007;&#2975;&#2994;&#3006;&#2990;&#3021;.  &#2997;&#3007;&#2997;&#3006;&#2980; &#2990;&#3015;&#2975;&#3016;&#2991;&#3016; &#2984;&#2975;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2984;&#2975;&#2980;&#3021;&#2980;&#3007; 
&#2997;&#2992;&#3009;&#2997;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2985;&#3016; &#2984;&#3008;&#2985;&#3021;&#2975; &#2984;&#3006;&#2995;&#3021; &#2997;&#3006;&#2996; &#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2970;&#3007;&#2993;&#3007;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3015; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; 
&#2958;&#2995;&#3007;&#2980;&#3009;.  &#2949;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2985;&#3021; &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3006;&#2965; &#2990;&#3006;&#2993;&#3007;&#2991; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2949;&#2980;&#2985;&#3016; &#2997;&#2995;&#3007;&#2991;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; 
&#2990;&#3006;&#2975;&#3021;&#2975;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2980;&#3009; &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2986;&#2980;&#3009;&#2965;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2990;&#3021;.</p></div><div class="sect2" title="&#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016;&#2965;&#3021; &#2965;&#2997;&#2992;&#3021;&#2965;&#3007;&#2993; &#2997;&#2979;&#3021;&#2985;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2994;&#2965;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="code-review"></a>&#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016;&#2965;&#3021; &#2965;&#2997;&#2992;&#3021;&#2965;&#3007;&#2993; &#2997;&#2979;&#3021;&#2985;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2994;&#2965;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;</h3></div></div></div><p>&#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2990;&#3007;&#2965;&#3021;&#2965; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3016; &#2984;&#3007;&#2992;&#3009;&#2997; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3007;&#2980;&#3007; &#2962;&#2992;&#3009;&#2997;&#2992;&#3007;&#2985;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; 
&#2965;&#2997;&#2979;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3015; &#2950;&#2965;&#3009;&#2990;&#3021; &#8212; &#2986;&#2994;&#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021;, &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2949;&#2997;&#2992;&#3021;
<span class="emphasis"><em>&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980; &#2953;&#2975;&#2985;&#3015;</em></span> &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; &#2965;&#3006;&#2979; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980;&#2980;&#3009;.  
<em class="firstterm">&#2986;&#2980;&#3007;&#2997;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021;</em> (&#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; <em class="firstterm">&#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; 
&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021;</em>) &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2975;&#3021;&#2975; &#2953;&#2975;&#2985;&#3015;, &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021; &#2965;&#2979;&#3021;&#2975;&#2992;&#3007;&#2991; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3014;&#2986;&#3021;&#2986;&#2985;&#3007;&#2975;, 
&#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2950;&#2965;&#3009;&#2990;&#3021;.</p><p>&#2986;&#3009;&#2980;&#3007;&#2980;&#3006;&#2965; &#2986;&#2980;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2970;&#3007;&#2994;&#2965;&#3006;&#2994;&#2990;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2997;&#3007;&#2975; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2990;&#3021; &#2980;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; 
&#2970;&#3007;&#2994; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2994;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; &#2984;&#2985;&#3021;&#2990;&#3016; &#2980;&#2992;&#3009;&#2990;&#3021;.  &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;: &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;
&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3021;&#2990;&#3016; &#2965;&#3006;&#2994; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2949;&#2980;&#3007;&#2994;&#3021; &#2950;&#2992;&#3021;&#2997;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2965;&#3006;&#2975;&#3021;&#2975; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.  &#2950;&#2993;&#3009; &#2990;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2994;&#3007;&#2984;&#3021;&#2980; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2949;&#2997;&#2992;&#3021; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#3007;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2949;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3016; 
&#2984;&#3007;&#2985;&#3016;&#2997;&#3009; &#2965;&#3010;&#2992; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2980;&#3007;&#2994;&#3021; &#2965;&#2997;&#2979;&#2990;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#2997;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3007;&#2991; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2980;&#3009;. &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2958;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#3006;&#2979; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3015; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2965;&#2995;&#2980;&#3021;&#2980;&#3016; &#2950;&#2991;&#3021;&#2997;&#3009; 
&#2970;&#3014;&#2991;&#3021;&#2991; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2997;&#3006;&#2991;&#3021;&#2986;&#3009; &#8212; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2991;&#2992;&#3021;&#2970;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#2980;&#3006;&#2994;&#3021; 
&#2949;&#2980;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2962;&#2992;&#3009;&#2997;&#2992;&#3016; &#2949;&#2980;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016;, &#2949;&#2980;&#3009; &#2990;&#3015;&#2993;&#3021; &#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;, &#2949;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993; 
&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2965;&#3018;&#2985;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995; &#2970;&#3006;&#2992;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994;&#2997;&#2993;&#3021;&#2993;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2949;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3007; &#2980;&#2992;&#3009;&#2990;&#3021;.
<sup>[<a name="idp5550048" href="#ftn.idp5550048" class="footnote">22</a>]</sup></p><p>&#2986;&#2980;&#3007;&#2997;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2986;&#2994; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2953;&#2980;&#2997;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2951;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#2992;&#2980;&#3021;&#2980;&#3016; 
&#2984;&#3007;&#2992;&#3021;&#2997;&#2965;&#3007;&#2965;&#3021;&#2965; &#2953;&#2980;&#2997;&#3009;&#2997;&#2980;&#3009;&#2975;&#2985;&#3021; &#2970;&#2990;&#2990;&#3006;&#2985;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2992;&#3007;&#2970;&#3008;&#2994;&#2985;&#3016;&#2991;&#3016; &#2986;&#2992;&#3016;&#2970;&#3006;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#2994;&#3021;&#2994; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3021; &#2950;&#2965;&#3009;&#2990;&#3021;.  &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2985;&#3021; &#2986;&#3019;&#2980;&#3015; &#2965;&#2994;&#3016;&#2991;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2949;&#2997;&#3016; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3007;&#2992;&#3021;&#2965;&#3009; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009; &#2986;&#3007;&#2975;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; 
&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;; &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3007;&#2992;&#3021;&#2965;&#3009; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2951;&#2985;&#2990;&#3021;&#2965;&#3006;&#2985;&#2986;&#3021;&#2986;&#2975;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.  
&#2951;&#2980;&#3007;&#2994;&#3021; &#2990;&#2993;&#3016;&#2990;&#3009;&#2965;&#2990;&#3006;&#2985; &#2986;&#2994;&#2985;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;: &#2980;&#2985;&#2965;&#3021;&#2965;&#3009; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2965;&#2997;&#2979;&#2990;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2992;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2951;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3021;&#2980;&#3016; &#2949;&#2992;&#3007;&#2991; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; &#2949;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021;
&#2970;&#3014;&#2991;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2979;&#2992;&#3021;&#2997;&#2980;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2970;&#3007;&#2992;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.</p><p>&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2984;&#2975;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2949;&#2992;&#3009;&#2965;&#3006;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3015; 
&#2949;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2958;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2965;&#3009;&#2992;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#2980;&#3007;&#2997;&#3007;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980; &#2953;&#2975;&#2985;&#3021; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; &#2949;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; 
&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3016; &#2980;&#2985;&#3007;&#2991;&#3006;&#2965; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#3006;&#2990;&#2994;&#3021; &#2986;&#3018;&#2980;&#3009; &#2990;&#2985;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3007;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2986;&#3006;&#2992;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2997;&#3019;&#2990;&#3021;.  &#2949;&#2984;&#3021;&#2980; 
&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#3014;&#2992;&#3009;&#2997;&#2992;&#3021;.  &#2949;&#2980;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994;&#2992;&#3021; &#2965;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#2992;&#3007;&#2991;&#2994;&#3006;&#2990;&#3021;; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2951;&#2994;&#3021;&#2994;&#3016; 
&#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3006;&#2980;&#3021;&#2980;&#3007;&#2992;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#2994;&#3009;&#2997;&#3009;&#2980;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2997;&#3006;&#2970;&#2994;&#3016; &#2970;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3006;&#2985;
&#2970;&#3014;&#2991;&#2994;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3007;&#2985;&#3016;&#2997;&#3009; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;.</p><p>&#2986;&#2980;&#3007;&#2997;&#3009; &#2986;&#3007;&#2985;&#3021; &#2986;&#2980;&#3007;&#2997;&#3006;&#2965; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2997;&#2970;&#2980;&#3007;&#2991;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;.  &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2986;&#2980;&#3007;&#2997;&#3009; 
&#2970;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3016; &#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009;.  &#2986;&#2980;&#3007;&#2997;&#3009; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2990;&#3009;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021;
&#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2986;&#2980;&#3007;&#2997;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2991;&#3009;&#2975;&#2985;&#3021; &#2949;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; (&#2949;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2990;&#3007;&#2965;&#2986;&#3021;&#2986;&#3018;&#2992;&#3007;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2997;&#3007;&#2975;&#3007;&#2994;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2993;&#3007;&#2991; <a class="xref" href="vc.html#vc-vocabulary-diff"><em class="firstterm">diff</em></a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; 
<a class="xref" href="vc.html#vc-vocabulary" title="Version Control Vocabulary">the section called &#8220;Version Control Vocabulary&#8221;</a>&#2951;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;).  &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3007;&#2994;&#3021; &#2970;&#3007;&#2992;&#3009; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016;
&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; Gerrit &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; GitHub &#2986;&#3019;&#2985;&#3021;&#2993;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; "&#2990;&#3007;&#2965;&#3009;&#2980;&#3007; &#2965;&#3015;&#3006;&#2992;&#3007;&#2965;&#3021;&#2965;&#3016;" &#2951;&#2975;&#3016;&#2990;&#3009;&#2980;&#3021;&#2980;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; 
&#2965;&#3010;&#2975; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#2994;&#3006;&#2990;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#2992;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; <a class="xref" href="vc.html#commit-emails" title="Commit emails">the section called &#8220;Commit emails&#8221;</a>
<span> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; 
<a class="xref" href="technical-infrastructure.html" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;">Chapter 3, <i>&#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</i></a></span> &#2991;&#3007;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2965;.</p><div class="sect3" title="&#2990;&#3006;&#2980;&#3007;&#2992;&#3007; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009;"><div class="titlepage"><div><div><h4 class="title"><a name="subversion-commit-review"></a>&#2990;&#3006;&#2980;&#3007;&#2992;&#3007; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009;</h4></div></div></div><p>&#3000;&#2986;&#3021;&#2997;&#3014;&#2992;&#3021;&#2970;&#2985;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#3006;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2992;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991; 
&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;.  &#2949;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3006;&#2985; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; 
&#2953;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2958;&#2984;&#3021;&#2980; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2951;&#2979;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;
&#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3009;&#2975;&#3021;&#2990;&#3021; &#2997;&#3007;&#2985;&#3007;&#2991;&#3019;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2965;&#3021;&#2992;&#3016;&#2965;&#3021; &#3000;&#3021;&#2975;&#3016;&#2985;&#3021; (Greg Stein) &#2958;&#2985;&#3021;&#2993; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; 
&#2986;&#2994;&#2985;&#3016; &#2953;&#2985;&#2992;&#3021;&#2984;&#3021;&#2980; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021; <span class="emphasis"><em>&#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2986;&#2980;&#3007;&#2997;&#3007;&#2994;&#3009;&#2990;&#3021;</em></span> &#2953;&#2995;&#3021;&#2995; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2997;&#2992;&#3007;&#2991;&#3016;&#2991;&#3009;&#2990;&#3021;
&#2986;&#2975;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#3007;&#2980;&#3021;&#2980;&#3009; &#2962;&#2992;&#3009; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2985;&#3006;&#2992;&#3021;.  &#2958;&#2985;&#2997;&#3015; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3007;&#2975;&#2990;&#3021;
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2949;&#2980;&#2985;&#3021; &#2997;&#3007;&#2995;&#3016;&#2997;&#3009;&#2965;&#2995;&#3021;, &#2949;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#2994; &#2990;&#3009;&#2992;&#3016; &#2970;&#3007;&#2992;&#2986;&#3021;&#2986;&#3006;&#2985; &#2986;&#2980;&#3007;&#2997;&#3016; &#2986;&#3006;&#2992;&#3006;&#2975;&#3021;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975; &#2962;&#2992;&#3009; &#2990;&#3007;&#2985;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2980;&#3018;&#2975;&#2992;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2953;&#2975;&#2985;&#3009;&#2965;&#3021;&#2965;&#3009; &#2953;&#2975;&#2985;&#3021; &#2949;&#2997;&#2992;&#3021;
&#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3014;&#2994;&#3009;&#2990;&#3016; &#2949;&#2993;&#3021;&#2993; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3016; &#2965;&#2979;&#3021;&#2975;&#2992;&#3007;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021;, &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3007;&#2994;&#3021;&#2994;&#3016; 
&#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2949;&#2997;&#3016; &#2965;&#2979;&#3021;&#2975;&#2992;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3006;&#2990;&#2994;&#3021; &#2984;&#2994;&#3009;&#2997;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2997;&#2992;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3006;&#2994;&#3021; &#2949;&#2980;&#3009; 
&#2949;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3015;&#2992; &#2997;&#3007;&#2992;&#2991;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3010;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2980;&#3021;&#2980;&#3016; &#2997;&#3006;&#2991;&#3021;&#2986;&#3021;&#2986;&#3009; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3014;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2970;&#3009;&#2975;&#3021;&#2975;&#3007; 
&#2965;&#3006;&#2975;&#3021;&#2975;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2992;&#3021;.  &#2990;&#3007;&#2965; &#2997;&#3007;&#2992;&#3016;&#2997;&#3007;&#2994;&#3021; &#2958;&#2985;&#3021;&#2985;&#3016;&#2991;&#3009;&#2990;&#3021; &#2970;&#3015;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2986;&#2980;&#3007;&#2997;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2980;&#3009; 
&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2985;&#2992;&#3021;.</p><p>&#2958;&#2969;&#3021;&#2965;&#2995;&#3016; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2980;&#3021;&#2980;&#2980;&#3009; &#2958;&#2985;&#3021;&#2985;? &#2965;&#3021;&#2992;&#3016;&#2965;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#3014;&#2975;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2970;&#3014;&#2991;&#3021;&#2980;&#3021;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021; &#2984;&#3007;&#2992;&#3010;&#2986;&#3007;&#2980;&#3021;&#2980;&#2980;&#3009;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; 
&#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2950;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#2980;&#3009;&#2990;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021; &#2980;&#2992;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2984;&#3006;&#2990;&#3021; &#2970;&#3014;&#2994;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021; 
&#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3016; &#2986;&#2991;&#2985;&#3009;&#2995;&#3021;&#2995;&#2980;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2980;&#3006;&#2985;&#3021;.  &#2949;&#2980;&#3016; &#2949;&#2997;&#2992;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2965;&#3006;&#2975;&#3021;&#2975;&#3007;&#2991; &#2953;&#2975;&#2985;&#3021; &#2949;&#2980;&#3009; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965; &#2986;&#2975;&#3009;&#2990;&#3021; 
&#2970;&#3014;&#2991;&#2994;&#3021; &#2950;&#2965;&#3007; &#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3009;&#2990;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3006;&#2997;&#3007;&#2975;&#3007;&#2994;&#3021; &#2949;&#2984;&#3021;&#2980; &#2986;&#2980;&#3007;&#2997;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2970;&#3021;&#2970;&#2990;&#3021; 
&#2954;&#2975;&#3021;&#2975;&#3007;, &#2991;&#3006;&#2992;&#3015;&#2985;&#3009;&#2985;&#3021; &#2949;&#2984;&#3021;&#2980; &#2986;&#2980;&#3007;&#2997;&#3016; &#2950;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980;&#2980;&#3006; &#2958;&#2985;&#3021;&#2993;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2965;&#3015;&#2975;&#3021;&#2975;&#2965;&#2997;&#3009;&#2990;&#3021; &#2980;&#3010;&#2985;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009;. 
&#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021;, &#2965;&#3021;&#2992;&#3016;&#2965;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3015;&#2992;&#3009; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2985;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993; &#2980;&#3015;&#2997;&#3016; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#2980;&#3006;&#2994;&#3021;, &#3000;&#2986;&#3021;&#2997;&#3014;&#2992;&#3021;&#2970;&#2985;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;
&#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2950;&#2991;&#3021;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2990;&#3021;&#2994; &#2986;&#3019;&#2985;&#2980;&#3009;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2994;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2986;&#2985;&#3021;&#2986;&#3006;&#2975;&#3009; 
&#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2984;&#3021;&#2980;&#3009; &#2970;&#3007;&#2994; &#2965;&#3006;&#2994;&#2990;&#3006;&#2965; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#3019;&#2990;&#3021;.</p></div><p>&#2990;&#3009;&#2980;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2950;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2993;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021;, &#2970;&#3015;&#2990;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2970;&#3007;&#2997;&#3009;, 
&#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2985; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; API &#2950;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2980;&#2997;&#2992;&#3006;&#2985; &#2984;&#3007;&#2986;&#2984;&#3021;&#2980;&#2985;&#3016; &#2965;&#3010;&#2993;&#3021;&#2993;&#3009;&#2965;&#2995;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;, &#2965;&#2979;&#3021;&#2979;&#3007;&#2965;&#2995;&#3021;, &#2997;&#2992;&#3016;&#2990;&#3009;&#2993;&#3016; &#2980;&#2997;&#2992;&#3007;&#2991; &#2970;&#3006;&#2992;&#3021;&#2986;&#3009; &#2949;&#2996;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2980;&#3016; &#2986;&#3019;&#2994;&#3021; &#2970;&#3010;&#2996;&#2994;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2997;&#3007;&#2997;&#2992;&#2990;&#3021; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; 
&#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#3016;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021;, 
&#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2980;&#3007;&#2993;&#2985;&#3006;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2990;&#3008;&#2985;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2986;&#3007;&#2992;&#3007;&#2980;&#3021;&#2980;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; 
&#2980;&#2985;&#3007;&#2991;&#3006;&#2965; &#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009; &#2970;&#3006;&#2992;&#3021;&#2986;&#3009;&#2965;&#2995;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2980;&#2997;&#2992;&#3007;&#2991; &#2951;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#3010;&#2975; &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#2994;&#3006;&#2990;&#3021;, &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; 
&#2990;&#3009;&#2984;&#3021;&#2980;&#2991; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2980;&#3007;&#2993;&#2985;&#3006;&#2991;&#3021;&#2997;&#3007;&#2985;&#3021; &#2984;&#3007;&#2985;&#3016;&#2997;&#3009; &#2951;&#2997;&#2993;&#3021;&#2993;&#3016; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2949;&#2975;&#3016;&#2991;&#3006;&#2994;&#2990;&#3021; 
&#2965;&#3006;&#2979; &#2953;&#2980;&#2997;&#3009;&#2990;&#3021;.</p><p>&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2993;&#2985;&#3006;&#2991;&#3021;&#2997;&#3007;&#2994;&#3021; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3019; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991; &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985; &#2949;&#2993;&#3007;&#2997;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3019; &#2965;&#2997;&#2995;&#3016;&#2986;&#3021;&#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;.  &#2965;&#3007;&#2975;&#3021;&#2975;&#2980;&#2975;&#3021;&#2975; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#2980;&#3007;&#2997;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007;&#2991;&#3009;&#2990;&#3021; &#2970;&#3018;&#2994;&#3021;&#2994;
&#2959;&#2980;&#3006;&#2997;&#2980;&#3009; &#2962;&#2985;&#3021;&#2993;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007; &#2965;&#3015;&#2975;&#3021;&#2965; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2986;&#3006;&#2992;&#3006;&#2975;&#3021;&#2975; &#2958;&#2980;&#3006;&#2997;&#2980;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.  
&#2949;&#2980;&#3007;&#2994;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985;&#2980;&#3009; &#2958;&#2985;&#3021;&#2985; &#2997;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#2985;&#3016; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#2997;&#2979;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; 
&#2965;&#3014;&#2979;&#3021;&#2975;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016; &#2997;&#2992;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2986;&#2993;&#3007;&#2970;&#3019;&#2980;&#2985;&#3016; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3009;&#2991; &#2980;&#3007;&#2993;&#2985;&#3006;&#2991;&#3021;&#2997;&#3009; 
&#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3014;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#2985;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#3016; &#2965;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2980;&#3007;&#2993;&#2985;&#3006;&#2991;&#3021;&#2997;&#3007;&#2985;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3006;&#2991;&#3021;&#2997;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021;
&#2984;&#2990;&#3021;&#2986;&#3007; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975; &#2965;&#3010;&#2975;&#3006;&#2980;&#3009;.</p></div><div class="sect2" title="&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="be-open-from-day-one"></a>&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;</h3></div></div></div><p>&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2958;&#2980;&#3021;&#2980;&#3009;&#2985;&#3016; &#2965;&#3006;&#2994;&#2990;&#3021; &#2980;&#2985;&#3007; 
&#2953;&#2993;&#3007;&#2990;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2951;&#2992;&#2984;&#3021;&#2980;&#2980;&#3019; &#2949;&#2980;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; &#2970;&#2992;&#3007;&#2997;&#3007;&#2965;&#3007;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#2997;&#2980;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.<sup>[<a name="idp5583920" href="#ftn.idp5583920" class="footnote">23</a>]</sup></p><p>&#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3006;&#2965; &#2997;&#2996;&#2969;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2970;&#2990;&#3010;&#2965; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2949;&#2980;&#3007;&#2965;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;&#2985; &#2986;&#3018;&#2992;&#3009;&#2986;&#3021;&#2986;&#3016; &#2959;&#2993;&#3021;&#2993;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.
"&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;" &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; "&#2949;&#2992;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021; &#2965;&#3015;&#2975;&#3021;&#2975;&#3009; &#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016; &#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;"
&#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009; &#8212; &#2980;&#2990;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3015;
&#2949;&#2980;&#2993;&#3021;&#2965;&#3021;&#2965;&#3006;&#2985; &#2980;&#2992;&#3009;&#2984;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;.  &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2986;&#2965;&#3007;&#2992;&#2969;&#3021;&#2965;&#2990;&#3006;&#2965; &#2986;&#3009;&#2994;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; 
&#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3018;&#2985;&#3021;&#2975;&#3009; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2986;&#2994; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2990;&#3006;&#2993;&#3006;&#2965;, &#2958;&#2997;&#3021;&#2997;&#2994;&#2997;&#3009; &#2965;&#3006;&#2994;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3019;, &#2949;&#2984;&#3021;&#2980; 
&#2949;&#2995;&#2997;&#3009; &#2949;&#2984;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2990;&#2990;&#3021;.</p><p>&#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016; &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2984;&#3006;&#2985;&#3021; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;:</p><p>&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;: &#2949;&#2985;&#3009;&#2990;&#3006;&#2985;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; 
&#2997;&#2992;&#3009;&#2969;&#3021;&#2965;&#3006;&#2995; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2950;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2959;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3006;&#2965;&#3021;&#2965;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2958;&#2980;&#3007;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006; &#2958;&#2985;&#3021;&#2993; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2990;&#3009;&#2993;&#3016; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2949;&#2984;&#3021;&#2980; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3009; &#2997;&#2996;&#3007;&#2991;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2950;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2965;&#2975;&#3007;&#2985; &#2990;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.</p><p>&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2999;&#2991;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; 
&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009; &#8212; &#2990;&#3015;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3007;&#2985;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2949;&#2996;&#3009;&#2980;&#3021;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; 
&#2997;&#3016;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;.  &#2970;&#3019;&#2980;&#3007;&#2986;&#3021;&#2986;&#3019;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#2979;&#3021;&#2975;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3016; &#2980;&#3007;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2997;&#3006;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021; &#2986;&#3009;&#2980;&#3007;&#2980;&#3006;&#2965;
&#2997;&#3007;&#2997;&#2992;&#2965;&#3021;&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2985;&#3016;&#2980;&#3021;&#2980; &#2949;&#2990;&#3021;&#2970;&#2980;&#3021;&#2980;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993; &#2984;&#3007;&#2965;&#2996;&#3021;&#2965;&#2995;&#3006; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2949;&#2980;&#3015;
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;&#2997;&#2980;&#3021;&#2980;&#3016; &#2997;&#2992;&#3009;&#2969;&#3021;&#2965;&#3006;&#2994; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2950;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3006;&#2965; &#2980;&#2992;&#3009;&#2997;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3021;.  
&#2949;&#2980;&#3015;&#2986;&#3019;&#2994;&#3021; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2980;&#3007;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021; &#2965;&#3018;&#2995;&#3021;&#2995;&#2995;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2958;&#2985;&#3021;&#2985;&#3007; &#2997;&#2992;&#2997;&#3009; &#2970;&#3014;&#2994;&#2997;&#3009; &#2965;&#2979;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3016; &#2965;&#3006;&#2965;&#3021;&#2965; 
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2970;&#3007;&#2994; &#2997;&#2993;&#3021;&#2993;&#3016; &#2951;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009;&#2965;&#3021;&#2965;&#3018;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;&#2990;&#3021; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2980;&#3009; (&#2997;&#3006;&#2992;&#3021;&#2975;&#3009; &#2965;&#2985;&#3021;&#2985;&#3007;&#2969;&#3021;&#2965;&#3006;&#2990;&#3021; &#2965;&#3010;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2986;&#2975;&#3007;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
"<a class="ulink" href="http://en.wikipedia.org/wiki/Technical_debt" target="_top">&#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; 
&#2965;&#2975;&#2985;&#3009;&#2965;&#3021;&#2965;&#3009;</a>" &#2953;&#2995;&#3021;&#2995;&#3006;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;).</p><p>&#2951;&#2980;&#2985;&#3006;&#2994;&#3021; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993; &#2984;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;, &#2953;&#2975;&#2985;&#2975;&#3007;&#2991;&#3006;&#2965; &#2965;&#3008;&#2996;&#3021; &#2997;&#2992;&#3009;&#2990;&#3021; 
&#2997;&#3007;&#2999;&#2991;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#2997;&#2979;&#3007;&#2965;&#3021;&#2965; &#2984;&#3015;&#2992;&#3007;&#2975;&#3009;&#2990;&#3021;:</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#2997;&#3006;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2965;&#2975;&#2997;&#3009;&#2970;&#3021;&#2970;&#3018;&#2994;&#3021;&#2965;&#2995;&#3021; 
&#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;;</li><li class="listitem">&#2986;&#2991;&#2985;&#3021; &#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;(&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2992;&#2965;&#2970;&#3007;&#2991;) &#2980;&#2965;&#2997;&#2995;&#3021;&#2965;&#2995;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007; &#2980;&#2992;&#2997;&#3009;&#2965;&#2995;&#3021;;</li><li class="listitem">&#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2986;&#2965;&#3007;&#2992; &#2965;&#3010;&#2975;&#3006;&#2980; &#2990;&#3007;&#2965; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2980;&#2965;&#2997;&#2995;&#3021;&#2965;&#2995;&#3021; &#2986;&#3007;&#2996;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; 
&#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;;</li><li class="listitem">&#2997;&#3006;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3006;&#2995;&#2992;&#3007;&#2985;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991; &#2965;&#3019;&#2992;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2965; &#2980;&#2992;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;
		&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021;;</li><li class="listitem">&#2949;&#2993;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2962;&#2980;&#3021;&#2980;&#3009; &#2986;&#3019;&#2965;&#3006;&#2980; &#2970;&#3007;&#2994; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; 
&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2950;&#2997;&#2979; &#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#2970;&#3007;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#3009;&#2997;&#2980;&#3009;;</li><li class="listitem">&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#3007;&#2992;&#3006;&#2985;, &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2962;&#2980;&#3021;&#2980;&#3009; 
&#2986;&#3019;&#2965;&#3009;&#2990;&#3021; (&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#3010;&#2975; &#2962;&#2980;&#3021;&#2980;&#3009; &#2986;&#3019;&#2965;&#3006;&#2980;) &#2970;&#3006;&#2992;&#3021;&#2986;&#3009;&#2984;&#3007;&#2994;&#3016; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2984;&#3010;&#2994;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; 
&#2953;&#2992;&#3007;&#2990;&#2969;&#3021;&#2965;&#2995;&#3021;;</li><li class="listitem">&#2980;&#2997;&#2992;&#3006;&#2985; &#2997;&#2975;&#3007;&#2997;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; &#2950;&#2997;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; (&#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; 
&#2986;&#3014;&#2993;&#3021;&#2993;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2992;&#3009;&#2997;&#2985;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#3007;&#2965;&#3021;&#2965;&#3007;), &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2997;&#3007;&#2985;&#3007;&#2991;&#3019;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2962;&#2980;&#3021;&#2980;&#3009; 
&#2986;&#3019;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; &#2953;&#2992;&#3009;&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2980;&#2992;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2965;&#2995;&#3021; &#2965;&#3010;&#2975; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; 
&#2951;&#2992;&#3009;&#2986;&#3021;&#2980;&#3009;.;</li><li class="listitem">&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021; &#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2962;&#2997;&#3021;&#2997;&#3006;&#2980; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; 
&#2970;&#3010;&#2996;&#2994;&#3021;;</li><li class="listitem">&#2970;&#3009;&#2980;&#3021;&#2980; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980; &#2965;&#3010;&#2993;&#3009;&#2984;&#3007;&#2994;&#3016;&#2990;&#3016; &#2990;&#3008;&#2993;&#2994;&#3021;&#2965;&#2995;&#3021;, &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;
&#2991;&#3006;&#2992;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2990;&#3009;&#2975;&#3007;&#2965;&#3021;&#2965;&#3006;&#2980;&#2997;&#3016;</li><li class="listitem">(&#2951;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2986;&#3019;&#2991;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3015; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.)</li></ul></div><p>&#2949;&#2980;&#3007;&#2994;&#3021; &#2970;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016; &#2951;&#2994;&#3021;&#2994;&#3016;; &#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2991;&#3009;&#2995;&#3021;&#2995; 
&#2949;&#2980;&#3007;&#2965;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021;&#2980;&#3006;&#2985;&#3021;.  &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2951;&#2992;&#2965;&#2970;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;
&#2986;&#2980;&#3007;&#2997;&#3015;&#2993;&#3021;&#2993; &#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2965;&#2993;&#3021;&#2993;&#3007; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009;&#2997;&#2980;&#3006;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#2992;&#2994;&#3006;&#2993;&#3021;&#2993;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2970;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021;
&#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2980;&#2992;&#3009;&#2997;&#2980;&#3006; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980; &#2986;&#2980;&#3007;&#2997;&#3016; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2975;&#3021;&#2975;&#3009; &#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2949;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;
("&#2990;&#3015;&#2994;&#3021; &#2984;&#3008;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#8212; top-skim" &#2958;&#2985;&#3021;&#2993;&#3009; &#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; 
&#2970;&#3018;&#2994;&#3021;&#2994;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;) &#2986;&#3018;&#2980;&#3009; &#2990;&#2965;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3006; &#2986;&#3019;&#2985;&#3021;&#2993; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007; &#2997;&#2992;&#2994;&#3006;&#2990;&#3021;.  &#2951;&#2980;&#3007;&#2994;&#3021; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; 
&#2980;&#2997;&#2992;&#3006;&#2985; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#3009;&#2993;&#3016;&#2991;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#8212; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2969;&#3021;&#2965;&#3009; &#2949;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2991;&#3015;:
&#2951;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2990;&#3021; &#2958;&#2975;&#3021;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.
&#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2980;&#3007; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2986;&#2994; &#2990;&#3009;&#2993;&#3016; &#2990;&#3006;&#2993;&#3021;&#2993;&#3007; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2985;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3008;&#2985;&#2975;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2970;&#3014;&#2994;&#2997;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3015;.</p><div class="sect3" title="&#2965;&#3006;&#2980;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2997;&#3014;&#2992;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2984;&#3007;&#2965;&#2995;&#3021;&#2997;&#3016; &#2953;&#2985;&#3021;&#2975;&#3006;&#2965;&#3021;&#2965;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;"><div class="titlepage"><div><div><h4 class="title"><a name="avoid-exposure-events"></a>&#2965;&#3006;&#2980;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2997;&#3014;&#2992;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2984;&#3007;&#2965;&#2995;&#3021;&#2997;&#3016; &#2953;&#2985;&#3021;&#2975;&#3006;&#2965;&#3021;&#2965;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;</h4></div></div></div><p>&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2990;&#3010;&#2994;&#2980;&#3021;&#2980;&#3016; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2984;&#3007;&#2965;&#2995;&#3021;&#2997;&#3016; 
&#2953;&#2985;&#3021;&#2975;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2991;&#3009;&#2990;&#3021; 
(&#2965;&#3010;&#2993;&#3009;&#2984;&#3007;&#2994;&#3016;&#2990;&#3016; &#2965;&#3009;&#2993;&#3016;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; &#2951;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2993;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994;), &#2986;&#3018;&#2980;&#3009;&#2997;&#3009;&#2975;&#2990;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3006;&#2994;&#3021; 
&#2990;&#3018;&#2980;&#3021;&#2980;&#2990;&#3006;&#2965; &#2984;&#3009;&#2979;&#3021;&#2979;&#3006;&#2991;&#3021;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2995;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009; &#8212; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#3021;&#2965;&#2994;&#3021;
&#2980;&#3018;&#2996;&#3007;&#2994;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986; &#2997;&#2994;&#3016;&#2986;&#3021;&#2986;&#2980;&#3007;&#2997;&#3009;&#2994;&#2965;&#3007;&#2993;&#3021;&#2965;&#3009; &#2953;&#2975;&#2985;&#2975;&#3007;&#2991;&#3006;&#2965; &#2949;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2986;&#2965;&#3009;&#2980;&#3021;&#2980;&#3006;&#2991;&#3021;&#2984;&#3021;&#2980;&#3009; &#2958;&#2985;&#3021;&#2985; &#2965;&#2979;&#3021;&#2975;&#3009; &#2986;&#3007;&#2975;&#3007;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2993; &#2950;&#2997;&#2994;&#3016; &#2980;&#3010;&#2979;&#3021;&#2975;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.</p><p>&#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2990;&#3006;&#2993;&#3006;&#2965; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3009; &#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021;: 
&#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2962;&#2997;&#3021;&#2997;&#3018;&#2985;&#3021;&#2993;&#3006;&#2965; &#2997;&#2984;&#3021;&#2980;&#3009; &#2970;&#3015;&#2992;&#3009;&#2990;&#3021;, &#2958;&#2985;&#2997;&#3015; &#2958;&#2984;&#3021;&#2980; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; &#2997;&#2992;&#3009;&#2990;&#3021;&#2986;&#3019;&#2980;&#3015; &#2980;&#3008;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; 
(&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2986;&#2994;&#2992;&#3021; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016; &#2951;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2997;&#3016; &#2990;&#3007;&#2965; &#2997;&#3007;&#2992;&#3016;&#2997;&#3007;&#2994;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2965;&#3007;&#2979;&#3021;&#2993;&#2985;).  &#2986;&#3018;&#2980;&#3009; &#2990;&#2965;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021;, &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3016; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021;
&#2949;&#2997;&#3021;&#2997;&#2986;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#3009; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#2997;&#2993;&#3006;&#2985; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; &#2965;&#3009;&#2993;&#3016; &#2965;&#3010;&#2992; &#2990;&#3006;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  
&#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3015; &#2949;&#2980;&#3007;&#2994;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#3009; &#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3006;&#2994;&#3021;; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016; &#2953;&#2994;&#2965;&#3007;&#2994;&#3021; &#2951;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2959;&#2993;&#3021;&#2993; &#2980;&#3006;&#2994;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;
&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2997;&#3016;. "FIXME" &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#2996;&#3007;&#2991;&#3006;&#2965; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2975;&#3021;&#2975;&#3009; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; 
&#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2965;&#2975;&#2985;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2993;&#3016;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2980;&#3008;&#2992;&#3021;&#2965;&#3021;&#2965; &#2986;&#2975;&#3009;&#2990;&#3021; &#2997;&#2992;&#3016; &#2984;&#2994;&#3021;&#2994;&#2980;&#3009;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991;
&#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;&#2965;&#2995;&#3021; &#2970;&#3007;&#2993;&#3007;&#2980;&#3009; &#2970;&#3007;&#2993;&#3007;&#2980;&#3006;&#2991;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2980;&#3019;&#2985;&#3021;&#2993;&#3006;&#2990;&#2994;&#3021; &#2980;&#3007;&#2975;&#3008;&#2992;&#3014;&#2985;&#3021;&#2993;&#3009; &#2962;&#2992;&#3015; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2985;&#3009;&#2980;&#3006;&#2986;&#2990;&#2993;&#3021;&#2993; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#3007;&#2965;&#2965;&#3021; &#2965;&#2975;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975;&#3009;&#2997;&#2992;&#3021;.</p><p>(&#2949;&#2992;&#2970;&#3006;&#2969;&#3021;&#2965; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980;&#2965;&#3021; &#2965;&#2997;&#2994;&#3016;&#2965;&#2995;&#3021; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2997;&#2994;&#3009;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2997;&#3007;&#2997;&#2992;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; <a class="ulink" href="starting-open-for-govs" target="_top">&#2949;&#2992;&#2970;&#3009; &#2970;&#3006;&#2992;&#3021; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980;&#3021; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; 
&#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; <span>-&#2991;&#3007;&#2994;&#3021; 
<a class="xref" href="governments-and-open-source.html" title="Chapter 9. Governments and Open Source">Chapter 9, <i>Governments and Open Source</i></a></span> &#2986;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.)</p></div><p>&#2951;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2985; &#2980;&#2997;&#2992;&#3009;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2962;&#2992;&#3009; &#2984;&#2994;&#3021;&#2994; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;  
&#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2985; &#2970;&#3014;&#2994;&#2997;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965; &#2958;&#2995;&#3007;&#2991; &#2997;&#2996;&#3007;: &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2951;&#2991;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021;.</p><p>"&#2980;&#3007;&#2992;&#2984;&#3021;&#2980;" &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2986;&#3007;&#2985;&#3021;&#2997;&#2992;&#3009;&#2986;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;, &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; &#2997;&#2975;&#3007;&#2997;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2949;&#2979;&#3009;&#2965;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#2997;&#3016;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;: &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2990;&#3021;, &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2979;&#3007;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021;,
&#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2950;&#2997;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2986;&#2991;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2950;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2997;&#3007;&#2965;&#3021;&#2965;&#3007;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980; 
&#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2980;&#2985;&#3021; &#2949;&#2992;&#3021;&#2980;&#3021;&#2980;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2950;&#2997;&#2979;&#2969;&#3021;&#2965;&#2995;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2997;&#2995;&#2969;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2965;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3009; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021; &#2980;&#3007;&#2985; &#2970;&#2992;&#3007;
&#2986;&#2979;&#3007;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2965;&#3006;&#2979;&#3009;&#2990;&#3021;&#2986;&#2975;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2992;&#3021;&#2980;&#3021;&#2980;&#2990;&#3021; &#2980;&#2992;&#3009;&#2965;&#3007;&#2992;&#2980;&#3009;.</p><p>"&#2980;&#3007;&#2992;&#2984;&#3021;&#2980;" &#2958;&#2985;&#3021;&#2986;&#2980;&#2985;&#3021; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#3007;&#2985;&#3021; &#2997;&#2992;&#3009;&#2986;&#2997;&#3016; &#2949;&#2994;&#3021;&#2994;&#3016;: &#2949;&#2992;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; 
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; (&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#3007;&#2992;&#2980;&#3007; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2949;&#2980;&#3007;&#2994;&#3021; &#2980;&#2975;&#3016; &#2951;&#2985;&#3021;&#2993;&#3007; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2990;&#3015;&#2993;&#3021;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;);  &#2949;&#2985;&#3016;&#2997;&#2992;&#3016;&#2991;&#3009;&#2990;&#3021; 
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2985;&#3007;&#2986;&#3021;&#2986;&#3006;&#2985;&#3007;&#2994;&#3021; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; (&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2992; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;
&#2965;&#3018;&#2995;&#3021;&#2965;&#3016;&#2991;&#3016; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3021; &#2986;&#3019;&#2994;&#3021; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2949;&#2992;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991;&#2990;&#3021; &#2959;&#2980;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;); &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2992;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2980;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; 
&#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2975;&#3021;&#2975; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2996;&#3007;&#2965;&#3021;&#2965; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2965;&#3015;&#2975;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; 
&#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3016; &#2986;&#2975;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2996;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;(&#2949;&#2980;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2985;&#3007;&#2965;&#3021;&#2965;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;); &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
&#2991;&#3019;&#2970;&#2985;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3008;&#2995;&#3006;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;, &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3015;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3016; &#2997;&#3007;&#2992;&#2991;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021;; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994;</p><p>&#2949;&#2980;&#3016; &#2970;&#2992;&#3007;&#2991;&#3006;&#2965; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3015;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2980;&#2992;&#2965;&#3007;&#2985;&#3021;&#2993;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3016; &#2949;&#2994;&#3021;&#2994;.  &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009; &#2958;&#2985;&#3021;&#2985;&#2993;&#3021;&#2993; &#2990;&#3009;&#2993;&#3016; &#2986;&#3007;&#2992;&#2980;&#3007; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2997;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#2980;&#3009; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2994;&#3021;&#2994;.
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3014;&#2995;&#3007; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2958;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2952;&#2975;&#3009;&#2986;&#2975;&#2997;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009; &#2953;&#2965;&#2984;&#3021;&#2980;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; 
&#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2965;&#3006;&#2994;&#2986;&#3021;&#2986;&#3019;&#2965;&#3021;&#2965;&#3007;&#2994;&#3021; &#2949;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2950;&#2965;&#3007;&#2992;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#3018;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007; &#2949;&#2980;&#3016;
&#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#3010;&#2992;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021;
&#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2990;&#3009;&#2993;&#3016; &#2951;&#2980;&#3016; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2950;&#2991;&#3007;&#2994;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2975;&#3021;&#2975; 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#2992;&#3009;&#2990;&#3009;&#2992;&#3016;&#2986;&#3021;&#2986;&#2975;&#3007; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;&#2975;&#2985;&#3021; &#2962;&#2980;&#3021;&#2980;&#3009; &#2986;&#3019;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2992;&#3009;&#2980;&#3007; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;.
</p></div><div class="sect2" title="&#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2992;&#3009;&#2990;&#2985;&#3016; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2958;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009;"><div class="titlepage"><div><div><h3 class="title"><a name="opening-closed-projects"></a>&#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2992;&#3009;&#2990;&#2985;&#3016; &#2953;&#2979;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2958;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009;</h3></div></div></div><p>&#2990;&#3009;&#2993;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; <a class="xref" href="setting-tone.html#be-open-from-day-one" title="&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;">the section called &#8220;&#2990;&#3009;&#2980;&#2994;&#3021; &#2984;&#3006;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3015; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;&#8221;</a> &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009;, &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985; &#2970;&#3010;&#2996;&#2994;&#3016; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2980;&#2997;&#3007;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980; &#2997;&#2992;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965;&#2997;&#3015;
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2990;&#3009;&#2991;&#2994;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2990;&#2994;&#3021; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965; 
&#2990;&#3006;&#2993;&#3021;&#2993; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991;&#2990;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2986;&#2985;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3009; &#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3018;&#2992;&#3007;&#2991; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009; 
&#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2984;&#3007;&#2985;&#3016;&#2965;&#3010;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;&#8212;&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#3007;&#2994;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3009;&#2990;&#3021; 
&#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.</p><p>&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2984;&#3021;&#2980; &#2970;&#3010;&#2996;&#2994;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#2993;&#3021;&#2986;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2986;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;: &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965;, 
&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007; &#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2962;&#2980;&#3021;&#2980; &#2980;&#3014;&#2995;&#3007;&#2997;&#3009;&#2995;&#3021;&#2995;
&#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2994;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2949;&#2996;&#3009;&#2980;&#3021;&#2980;&#2980;&#3007;&#2994;&#3021; 
&#2986;&#2985;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#3007;&#2992;&#2990;&#3016;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2965;&#3009; &#2953;&#2985;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; 
&#2951;&#2992;&#3021;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2949;&#2992;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;, &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3007;&#2985;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2997;&#3016;&#2980;&#3021;&#2980;&#3009; &#2958;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; 
&#2997;&#2992;&#3021;&#2980;&#3021;&#2980;&#2965; &#2949;&#2996;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021; &#2970;&#3007;&#2994; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2965;&#2975;&#3021;&#2975;&#3006;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#2997;&#2994;&#3016; &#2951;&#2985;&#3021;&#2993;&#3007;  
&#2990;&#3008;&#2994;&#3006;&#2991;&#3021;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2959;&#2993;&#3021;&#2993; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2970;&#3018;&#2994;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;. &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; 
&#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2994; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3016; &#2965;&#3015;&#2975;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965; &#2970;&#3007;&#2992;&#2980;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2950;&#2997;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; <span class="emphasis"><em>&#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021;</em></span> &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993; &#2984;&#3007;&#2985;&#3016;&#2986;&#3021;&#2986;&#3016; 
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2975;&#3009;&#2990;&#3021;(&#2949;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2980;&#2980;&#3009;).  &#2951;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3006;&#2965;, &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;
&#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2990;&#3009;&#2965;&#2990;&#3021; &#2980;&#3014;&#2992;&#3007;&#2991;&#3006;&#2980; &#2949;&#2992;&#3007;&#2990;&#3009;&#2965;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2953;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; &#2980;&#2985;&#2980;&#3009; &#2980;&#3007;&#2993;&#2990;&#3016; &#2990;&#3008;&#2980;&#3009; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016; 
&#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021;, &#2949;&#2997;&#2992;&#3007;&#2985;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3021;&#2990;&#3008;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993; &#2953;&#2975;&#2985;&#3021; &#2986;&#2985;&#3007;&#2986;&#3009;&#2992;&#3007;&#2986;&#2997;&#2992;&#3007;&#2985;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2990;&#3010;&#2985;&#3021;&#2993;&#3006;&#2990;&#3021; &#2984;&#2986;&#2992;&#3021; &#2965;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;
&#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2958;&#2985;&#3021;&#2985;&#3007; &#2986;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2990;&#3007;&#2965; &#2980;&#3009;&#2995;&#3021;&#2995;&#3007;&#2991;&#2990;&#3006;&#2985; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2965; &#2953;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#3009;&#2996;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2951;&#2980;&#2985;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;&#8212;&#2951;&#2980;&#3009; 
&#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#3007;&#2965;&#2994;&#2994;&#3006;&#2990;&#3021;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#3007;&#2992;&#2990;&#3016; &#2949;&#2993;&#3021;&#2993; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994; &#2990;&#3006;&#2993;&#3006;&#2965; 
&#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2984;&#3007;&#2992;&#2994;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2949;&#2995;&#2997;&#3016;&#2980;&#3006;&#2985;&#3021;&#2975;&#3007;&#2985;&#3006;&#2994;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021; &#2997;&#2992;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2953;&#2975;&#2985;&#3021; 
&#2986;&#2985;&#3007;&#2986;&#3009;&#2992;&#3007;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2992;&#2985;&#3006;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2965;&#2979;&#3021;&#2975;&#3009; &#2986;&#3007;&#2975;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009;&#2990;&#3021; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2985;&#2980;&#3015;.
(<a class="xref" href="setting-tone.html#code-review" title="&#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016;&#2965;&#3021; &#2965;&#2997;&#2992;&#3021;&#2965;&#3007;&#2993; &#2997;&#2979;&#3021;&#2985;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2994;&#2965;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;">the section called &#8220;&#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016;&#2965;&#3021; &#2965;&#2997;&#2992;&#3021;&#2965;&#3007;&#2993; &#2997;&#2979;&#3021;&#2985;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2986;&#2994;&#2965;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;&#8221;</a><span> &#2958;&#2985;&#3021;&#2993; &#2990;&#3009;&#2980;&#3021;&#2980;&#2991; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; 
&#2986;&#3006;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;</span>).  &#2949;&#2980;&#3015; &#2970;&#2990;&#2991;&#2990;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#3006;&#2980;&#2980;&#3006;&#2994;&#3021; 
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2986;&#2992;&#3008;&#2970;&#3008;&#2994;&#2979;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2980;&#3009; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; 
&#2965;&#3009;&#2993;&#3016;&#2965;&#2995;&#3009;&#2990;&#3021; &#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007;&#2991;&#3015; &#2970;&#3018;&#2994;&#3021;&#2994;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3006;&#2965; &#2980;&#3019;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;.  &#2951;&#2980;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2994;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2993;&#3021;&#2993;&#3009;&#2965;&#3016; 
&#2990;&#2985;&#3015;&#3006;&#2986;&#3006;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3007; &#2997;&#3007;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2980;&#2985;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2997;&#2996;&#3007; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021; &#2986;&#3006;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;, &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#2969;&#3021;&#2965;&#2975;&#2990;&#3006;&#2985; &#2970;&#3010;&#2996;&#2994;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2985;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#3006;&#2994;&#2990;&#3021; &#2970;&#3014;&#2994;&#3021;&#2994; &#2970;&#3014;&#2994;&#3021;&#2994; &#2949;&#2980;&#3009;
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3009; &#2949;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3010;&#2992;&#3009;&#2980;&#2994;&#3021;.  &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; 
&#2980;&#2985;&#3007;&#2991;&#3006;&#2965; &#2949;&#2993;&#3007;&#2997;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2997;&#3016;.  &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2990;&#2965;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2980;&#3009; &#2986;&#3009;&#2980;&#3007;&#2980;&#3006;&#2965; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975;
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2985;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021; &#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3009;&#2985;&#3021;&#2985;&#3015;&#2993;&#3021;&#2993;&#2990;&#3021; &#2965;&#3006;&#2979; &#2970;&#3007;&#2993;&#3007;&#2980;&#3009; &#2965;&#3006;&#2994;&#2990;&#3021; &#2950;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; 
&#2949;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3016;&#2980;&#2992;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2984;&#2994;&#3021;&#2994;&#2980;&#3009;.  &#2951;&#2980;&#2985;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#3007;&#2965; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3021; &#2990;&#3009;&#2985;&#3021; &#2984;&#3007;&#2985;&#3021;&#2993;&#3009; &#2997;&#2996;&#3007; &#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3015;.  
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965; &#2986;&#2980;&#3007;&#2994;&#3021; &#2980;&#2992;&#3006;&#2997;&#3007;&#2975;&#3007;&#2994;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992;
&#2970;&#3018;&#2994;&#3021;&#2997;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#2994;&#2985;&#3021; &#2980;&#2992;&#3006;&#2980;&#3009;.  &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2980;&#2993;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;
&#2980;&#3014;&#2993;&#3007;&#2991;&#3006;&#2990;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2986;&#2985;&#3007;&#2991;&#3007;&#2985;&#3021; &#2970;&#3009;&#2990;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2997;&#3014;&#2995;&#3007;&#2991;&#3009;&#2994;&#2965;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; 
&#2965;&#3010;&#2992;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#3009;&#2992;&#3007;&#2990;&#3016; &#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2980;&#3014;&#2993;&#3007;&#2991;&#3006;&#2990;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2997;&#2980;&#3006;&#2985;&#3021; 
&#2990;&#3010;&#2994;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2986;&#2969;&#3021;&#2965;&#3009; &#2986;&#3014;&#2993; &#2970;&#3014;&#2991;&#3021;&#2997;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.  &#2986;&#3018;&#2980;&#3009; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2986;&#2969;&#3021;&#2965;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2949;&#2980;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994; 
&#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992;&#2997;&#3009;&#2990;&#3021; &#2980;&#2997;&#2992;&#3006;&#2980;&#3007;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2953;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2986;&#2980;&#3007;&#2994;&#3021; &#2965;&#3010;&#2992; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980; &#2997;&#2993;&#3021;&#2993;&#3016; &#2949;&#2980;&#3007;&#2994;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009;
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3014;&#2994;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2990;&#3009;&#2985;&#3021; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009; &#2965;&#3010;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;&#8212;&#2949;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3019; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#3008;&#2992;&#3021;&#2997;&#3019; 
&#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2986;&#2975;&#3007; &#2986;&#3007;&#2985;&#3021; &#2980;&#3018;&#2975;&#2992;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.  &#2951;&#2980;&#3009; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2965;&#2997;&#3015; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#2993;&#3021;&#2993; &#2984;&#3008;&#2985;&#3021;&#2975; &#2984;&#3006;&#2995;&#3021; 
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#3010;&#2985;&#3021;&#2975;&#3007;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;.  &#2953;&#2995;&#3021;&#2995;&#3008;&#2975;&#3006;&#2985; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; 
&#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; &#2951;&#2985;&#2990;&#3021; &#2965;&#2979;&#3021;&#2975;&#3009; &#2949;&#2980;&#3016; &#2986;&#3018;&#2980;&#3009; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2997;&#3009;&#2990;&#3021; &#2949;&#2993;&#3007;&#2997;&#3009;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.
</p><p>&#2986;&#2994;&#2991; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#3007;&#2992;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994; &#2984;&#3008;&#2985;&#3021;&#2975; &#2965;&#3006;&#2994; &#2970;&#2997;&#3006;&#2994;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;.
<a class="xref" href="money.html" title="Chapter 5. Money">Chapter 5, <i>Money</i></a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2954;&#2980;&#3007;&#2991;&#2990;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2954;&#2980;&#3007;&#2991;&#2990;&#3021; &#2949;&#2993;&#3021;&#2993; &#2986;&#2985;&#3007;&#2991;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995;&#3016; &#2965;&#3016;&#2991;&#3006;&#2994;&#3021;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021;, <a class="xref" href="legal.html" title="Chapter 10. Licenses, Copyrights, and Patents">Chapter 10, <i>Licenses, Copyrights, and Patents</i></a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3009;&#2980;&#3007; &#2986;&#3007;&#2992; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2958;&#2996;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;
&#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2970;&#2975;&#3021;&#2975;&#2986;&#3021;&#2986;&#2975;&#3007; &#2965;&#3016;&#2991;&#3006;&#2994;&#3021;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#3021;.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp5505632" href="#idp5505632" class="para">21</a>] </sup>&#2965;&#3020;&#2992;&#2997;&#2990;&#3021; &#2965;&#3018;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021; &#2986;&#2993;&#3021;&#2993;&#3007; &#2984;&#3006;&#2990;&#3021; &#2951;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965; 
&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2984;&#3006;&#2985;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2994;&#3021;&#2994;&#3007;&#2980;&#3021;&#2980;&#2992;&#3009;&#2997;&#2980;&#3016; &#2984;&#3006;&#2985;&#3009;&#2990;&#3021; &#2965;&#2975;&#3016;&#2986;&#3007;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;
&#2953;&#2992;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985;&#2997;&#2985;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2970;&#3018;&#2994;&#3021;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;: &#2949;&#2984;&#3021;&#2980; &#2953;&#2993;&#3021;&#2993;&#3009;&#2984;&#3015;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3007;&#2985;&#3021; &#2986;&#3014;&#2991;&#2992;&#3021;  Brian Behlendorf, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2949;&#2997;&#2992;&#3021; &#2970;&#3007;&#2992;&#2986;&#3021;&#2986;&#3009; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;
&#2953;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2997;&#2993;&#3021;&#2986;&#3009;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007; &#2997;&#2984;&#3021;&#2980;&#3006;&#2992;&#3021;.</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5550048" href="#idp5550048" class="para">22</a>] </sup>&#2951;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2950;&#2992;&#2990;&#3021;&#2986;&#2990;&#3021; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007; &#2951;&#2992;&#3009;&#2980;&#3007;&#2997;&#2992;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2990;&#3009;&#2994;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; 
&#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3016;, &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2980;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016; &#2986;&#3018;&#2985;&#3021;&#2993;&#2997;&#2993;&#3021;&#2993;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2949;&#2994;&#3021;&#2994;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;
&#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2951;&#2980;&#3009; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2984;&#2994;&#3021;&#2994; &#2986;&#2979;&#3021;&#2986;&#3006;&#2975;&#3006;&#2965; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2951;&#2980;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3007;&#2990;&#2992;&#2970;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3016; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2980;&#3009;.
</p></div><div class="footnote"><p><sup>[<a id="ftn.idp5583920" href="#idp5583920" class="para">23</a>] </sup>&#2951;&#2984;&#3021;&#2980; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#2965;&#2997;&#2995;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; 
<a class="ulink" href="http://blog.civiccommons.org/2011/01/be-open-from-day-one/" target="_top">
blog.civiccommons.org/2011/01/be-open-from-day-one</a> &#2958;&#2985;&#3021;&#2993; &#2997;&#2994;&#3016;&#2986;&#3021;&#2986;&#2980;&#3007;&#2997;&#3007;&#2994;&#3021; &#2958;&#2996;&#3009;&#2980; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007; &#2986;&#3007;&#2985;&#3021;&#2986;&#3009; &#2951;&#2969;&#3021;&#2965;&#3009; &#2951;&#2985;&#3016;&#2986;&#3021;&#2986;&#2980;&#2992;&#3021;&#2965;&#3006;&#2965; &#2970;&#3007;&#2994; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#2980;&#3009;.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="license-quickstart.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="getting-started.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="announcing.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2962;&#2992;&#3009; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2997;&#3007;&#2979;&#3021;&#2979;&#2986;&#3021;&#2986;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;</td></tr></table></div></body></html>
