<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="social-networking.html" title="Social Networking Services"><link rel="next" href="consensus-democracy.html" title="&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="social-networking.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="consensus-democracy.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><div class="titlepage"><div><div><h2 class="title"><a name="social-infrastructure"></a>Chapter 4. &#2970;&#2990;&#3010;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2992;&#2970;&#3007;&#2991;&#2994;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="social-infrastructure.html#benevolent-dictator">&#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021;</a></span></dt><dd><dl><dt><span class="sect2"><a href="social-infrastructure.html#benevolent-dictator-qualifications">&#2991;&#3006;&#2992;&#3006;&#2994;&#3021; &#2984;&#2994;&#3021;&#2994; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;?</a></span></dt></dl></dd><dt><span class="sect1"><a href="consensus-democracy.html">&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;</a></span></dt><dd><dl><dt><span class="sect2"><a href="consensus-democracy.html#version-control-relaxation">&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2963;&#2991;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#voting">&#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2958;&#2975;&#3021;&#2975;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#2986;&#3019;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2991;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#when-to-vote">&#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#electorate">&#2991;&#3006;&#2992;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#polls">&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021; &#2997;&#3006;&#2965;&#3021;&#2965;&#3014;&#2975;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3009;&#2990;&#3021;</a></span></dt><dt><span class="sect2"><a href="consensus-democracy.html#veto">&#2980;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2965;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;</a></span></dt></dl></dd><dt><span class="sect1"><a href="written-rules.html">&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2997;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;</a></span></dt><dt><span class="sect1"><a href="non-profit.html">&#2951;&#2994;&#3006;&#2986;&#2984;&#3019;&#2965;&#3021;&#2965;&#2993;&#3021;&#2993; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2980;&#2994;&#3021; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009;, &#2986;&#2994;&#2992;&#3009;&#2990;&#3021; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2965;&#3015;&#2975;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021;, &#8220;&#2951;&#2980;&#3009; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; 
&#2997;&#3015;&#2994;&#3016;&#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;? &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2984;&#2975;&#2980;&#3021;&#2980; &#2953;&#2984;&#3021;&#2980;&#3009;&#2970;&#2965;&#3021;&#2980;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2980;&#3009;? &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2991;&#3006;&#2992;&#3021; 
&#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;?&#8221; &#2958;&#2985;&#3021;&#2986;&#2997;&#3016;&#2991;&#3015;. &#2980;&#2965;&#3009;&#2980;&#3007;&#2965;&#3021;&#2965;&#3015;&#2993;&#3021;&#2993; &#2990;&#2992;&#3007;&#2991;&#3006;&#2980;&#3016;, &#2962;&#2980;&#3021;&#2980;&#3009;&#2996;&#3016;&#2986;&#3021;&#2986;&#3009; &#2953;&#2979;&#2992;&#3021;&#2997;&#3009;, &#2984;&#3007;&#2992;&#2994;&#3007;&#2985;&#3021; &#2980;&#2992;&#2990;&#3021; &#2950;&#2965;&#3007;&#2991;&#2997;&#3016; ]&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2970;&#3006;&#2984;&#3021;&#2980;&#2990;&#3006;&#2985; &#2990;&#2993;&#3009;&#2990;&#3018;&#2996;&#3007;&#2965;&#2995;&#3021; &#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2980;&#3007;&#2991;&#3016; &#2980;&#2992;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2953;&#2979;&#3021;&#2990;&#3016; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2951;&#2997;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2985;
&#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021; &#2949;&#2994;&#3021;&#2994;. &#2980;&#3007;&#2993;&#2990;&#3016;, &#2980;&#2965;&#3009;&#2980;&#3007;, &#2962;&#2980;&#3021;&#2980;&#3009;&#2996;&#3016;&#2986;&#3021;&#2986;&#3009;, &#2984;&#3007;&#2992;&#2994;&#3007;&#2985;&#3021; &#2980;&#2992;&#2990;&#3021; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3007;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2986;&#2969;&#3021;&#2965;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3014;&#2985;&#3007;&#2985;&#3009;&#2990;&#3021;, 
&#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2984;&#3006;&#2995;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2984;&#2975;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2986;&#2993;&#3021;&#2993;&#3007;, &#2951;&#2997;&#3016; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965;&#2997;&#3015; 
&#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2990;&#3009;&#2992;&#2979;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2965;&#2995;&#3016;&#2997;&#2980;&#3014;&#2986;&#3021;&#2986;&#2975;&#3007; &#2958;&#2985; &#2997;&#3007;&#2997;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;, &#2986;&#2994; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2965;&#3021;&#2965; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; 
&#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985;  &#2949;&#2970;&#3021;&#2970;&#3006;&#2979;&#3007;&#2965;&#2995;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021;. &#2951;&#2969;&#3021;&#2965;&#3015; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2985; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2997;&#2992;&#3016;&#2991;&#2993;&#3016;, &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; 
&#2980;&#2992;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021;, &#2950;&#2992;&#3019;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2953;&#2991;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; 
&#2953;&#2995;&#3021;&#2995;&#2975;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;. &#2950;&#2992;&#3019;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;, &#2984;&#3007;&#2992;&#2994;&#3007;&#2994;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2951;&#2991;&#2969;&#3021;&#2965;&#3007;&#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2953;&#2995;&#3021;&#2995;&#2975;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2997;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; 
&#2986;&#3009;&#2965;&#3006;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009; &#2997;&#3007;&#2992;&#3016;&#2997;&#3006;&#2965; &#2986;&#2980;&#3007;&#2994;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2980;&#3006;&#2985;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2953;&#2991;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3014;&#2985;&#3021;&#2986;&#2980;&#3009;, &#2962;&#2992;&#3009; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2980;&#2985;&#3007;&#2990;&#2985;&#3007;&#2980; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009;&#2990;&#3021;, &#2950;&#2980;&#2992;&#2997;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3006;&#2990;&#2994;&#3021; 
&#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2965;&#3009;&#2990;&#3021;&#8212;&#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#3015;&#2993;&#3009; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3014;&#2985;&#3021;&#2993;&#2986;&#3007;&#2993;&#2965;&#3009;&#2990;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2953;&#2991;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985; &#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2992;&#3008;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2991;&#2975;&#3016;&#2997;&#2980;&#3009; &#2990;&#3007;&#2965; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2985;&#2980;&#2994;&#3021;&#2994;. &#2950;&#2985;&#3006;&#2994;&#3021;,  &#2997;&#2994;&#3009;&#2997;&#3006;&#2985; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021; 
&#2965;&#3009;&#2996;&#3009;&#2997;&#3009;&#2990;&#3021;, &#2970;&#2990;&#3010;&#2965; &#2949;&#2975;&#3007;&#2980;&#3021;&#2980;&#2995;&#2990;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2950;&#2992;&#2990;&#3021;&#2986;&#2965;&#3006;&#2994; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016; &#2952;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3007;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2985;&#3021;&#2993; &#2986;&#3007;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021;,  &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3016; &#2970;&#2990;&#3006;&#2995;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2970;&#3007;&#2992;&#2990;&#2990;&#3006;&#2965; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2991;&#2975;&#3016;&#2991; &#2986;&#2994; &#2997;&#2996;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2970;&#3007;&#2994; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021;, &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; 
&#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#3006;&#2979;&#2997;&#3009;&#2990;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2996;&#3016;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2997;&#3007;&#2975;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2975;&#2997;&#3009;&#2990;&#3021; 
&#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2985; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2953;&#2995;&#3021;&#2995;&#2975;&#2965;&#3021;&#2965;&#3007; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2990;&#2993;&#3021;&#2993; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021;, &#2970;&#3006;&#2980;&#3006;&#2992;&#2979; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; 
&#2953;&#2995;&#3021;&#2995;&#2975;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3019;&#2975;&#3009;, &#2970;&#3009;&#2991; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2984;&#3015;&#2992;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2970;&#3010;&#2996;&#2994;&#3016;&#2991;&#3009;&#2990;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3007;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3007;&#2985;&#3021; &#2984;&#2990;&#3021;&#2986;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016;&#2986;&#3021; 
&#2986;&#3014;&#2993;&#3021;&#2993; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2951;&#2992;&#3009;&#2997;&#2996;&#3007;&#2965;&#2995;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2986;&#2994;&#2985;&#3016;&#2980;&#3021;&#2980;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;: 
&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;, &#2986;&#2996;&#2965;&#3021;&#2965;&#2997;&#2996;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3007;&#2985;&#3021; &#2950;&#2980;&#2992;&#2997;&#3009; &#2986;&#3014;&#2993;&#3021;&#2993;, 
&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2984;&#3007;&#2992;&#2984;&#3021;&#2980;&#2992;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3016; &#2949;&#2995;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2951;&#2984;&#3021;&#2980; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2990;&#2980;&#3021;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2984;&#3007;&#2992;&#3021;&#2997;&#2965;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2975;, 
&#2970;&#3009;&#2991; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2970;&#3007;&#2994; &#2949;&#2996;&#3009;&#2965;&#3007;&#2991; &#2950;&#2986;&#3021;&#2986;&#3007;&#2995;&#3021;&#2965;&#2995;&#3021;, &#2962;&#2992;&#3009; &#2990;&#3009;&#2996;&#3009; 
&#2965;&#3010;&#2975;&#3016;&#2991;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021; &#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3009;&#2975;&#3016;&#2991;&#2980;&#3009; &#2958;&#2985;, &#2970;&#3009;&#2991; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021;, &#2970;&#3007;&#2994; &#2965;&#3006;&#2994;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2997;&#2980;&#3009; 
&#2984;&#3007;&#2985;&#3016;&#2997;&#3007;&#2994;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2992;&#3021;.</p><div class="sect1" title="&#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="forkability"></a>&#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016;</h2></div></div></div><p>&#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;, &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3016; &#2962;&#2985;&#3021;&#2993;&#3007;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009;, &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; 
&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2970;&#2990;&#2992;&#2970;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3009;&#2990;&#3021; &#2951;&#2979;&#2969;&#3021;&#2965;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2962;&#2992;&#3009; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980; &#2965;&#3006;&#2992;&#2979;&#3007;&#2991;&#3006;&#2965;, 
<em class="firstterm">&#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016;</em> &#2997;&#3007;&#2995;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2984;&#3007;&#2992;&#2994;&#3007;&#2985;&#3021; &#2984;&#2965;&#2994;&#3016;&#2991;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;, 
&#2949;&#2980;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016; &#2958;&#2985;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2986;&#3021;&#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; 
<em class="firstterm"> &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;</em> &#2958;&#2985;&#3021;&#2993;&#3009; &#2949;&#2996;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2980;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2992;&#2979;&#3021;&#2986;&#3006;&#2975;&#3006;&#2985; &#2997;&#3007;&#2975;&#2991;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3007;&#2994;&#3021;, &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2965;&#2995;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; 
<span class="emphasis"><em>&#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3015;</em></span>, &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2965;&#2995;&#3016;&#2997;&#3007;&#2975; &#2997;&#2994;&#3009;&#2997;&#3006;&#2985; &#2970;&#2965;&#3021;&#2980;&#3007;&#2991;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2965;&#2995;&#3021; &#2990;&#3007;&#2965; &#2949;&#2992;&#3007;&#2980;&#3006;&#2965;&#2997;&#3015; &#2965;&#3006;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2962;&#2992;&#3009; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; 
&#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3006;&#2980;&#2965;&#2990;&#3006;&#2965; &#2949;&#2990;&#3016;&#2997;&#2980;&#3006;&#2994;&#3021;, (&#2949;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3021; <a class="xref" href="forks.html" title="Forks">the section called &#8220;Forks&#8221;</a>
<span>&#2951;&#2969;&#3021;&#2965;&#3015;<a class="xref" href="managing-volunteers.html" title="Chapter 8. Managing Volunteers">Chapter 8, <i>Managing Volunteers</i></a></span> 
&#2997;&#3007;&#2997;&#2992;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2985;), &#2962;&#2992;&#3009; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2980;&#2994;&#3007;&#2985;&#3021; &#2949;&#2986;&#3006;&#2991;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; 
&#2970;&#2990;&#2992;&#2970;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2951;&#2979;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; 
&#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009;, &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3015; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994;&#2992;&#3016;, 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#3019;&#2994;&#2985;&#3021; &#2958;&#2985; &#2949;&#2996;&#3016;&#2986;&#3021;&#2986;&#2980;&#3016; &#2986;&#2992;&#2997;&#2994;&#3006;&#2965; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2991;&#3009;&#2993;&#3021;&#2993;&#3019;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2951;&#2965;&#3021;&#2965;&#3010;&#2993;&#3021;&#2993;&#3009; &#2950;&#2970;&#3021;&#2970;&#2992;&#3007;&#2991;&#2990;&#3006;&#2965; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2969;&#3021;&#2965;&#3015; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3018;&#2975;&#3009;&#2969;&#3021;&#2965;&#3019;&#2985;&#3021;&#2990;&#3016;, &#2949;&#2984;&#3021;&#2980; &#2970;&#3018;&#2994;&#3021;&#2994;&#3007;&#2985;&#3021; &#2986;&#3006;&#2992;&#2990;&#3021;&#2986;&#2992;&#3007;&#2991; 
&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2970;&#2993;&#3021;&#2993;&#3009; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2980;&#3016; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;, &#2951;&#2992;&#3009; &#2984;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; 
&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2990;&#3009;&#2980;&#2994;&#3006;&#2997;&#2980;&#3009; &#2984;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021;, &#2949;&#2992;&#2970;&#2985;&#3021; &#2958;&#2985;&#3021;&#2985; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#2985;&#3019;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; 
&#2965;&#2975;&#3021;&#2975;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3009; &#2984;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021;, &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2980;&#2992;&#3009;&#2979;&#2980;&#3021;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2984;&#3021;&#2984;&#3006;&#2975;&#3021;&#2975;&#3016; &#2986;&#3007;&#2992;&#2980;&#3007;&#2991;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;, 
&#2949;&#2986;&#3021;&#2986;&#3007;&#2992;&#2980;&#3007;&#2991;&#3016;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2986;&#2975;&#3007; &#2950;&#2979;&#3021;&#2975;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021;&#2986;&#3014;&#2993;&#3021;&#2993; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3009; 
&#2984;&#3006;&#2975;&#3021;&#2975;&#3009; &#2949;&#2992;&#2970;&#2992;&#3007;&#2985;&#3021; &#2950;&#2975;&#3021;&#2970;&#3007;, &#2990;&#3009;&#2980;&#2994;&#3006;&#2990;&#3021; &#2984;&#3006;&#2975;&#3021;&#2975;&#3009; &#2949;&#2992;&#2970;&#2992;&#3007;&#2985;&#3021; &#2950;&#2975;&#3021;&#2970;&#3007;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#2994;&#3021;&#2994;&#2997;&#3006;? &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3009; &#2984;&#3006;&#2975;&#3021;&#2975;&#3007;&#2993;&#3021;&#2965;&#3009; &#2962;&#2986;&#3021;&#2986;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2951;&#2980;&#2985;&#3006;&#2994;&#3015;&#2991;&#3015;, &#2990;&#3009;&#2993;&#3016;&#2991;&#3006;&#2965; &#2990;&#2965;&#3021;&#2965;&#2995;&#3006;&#2975;&#3021;&#2970;&#3007; &#2986;&#3014;&#2993;&#3021;&#2993; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2958;&#2985; &#2949;&#2993;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; 
&#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2965;&#3010;&#2975;, &#2970;&#3007;&#2994; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016;&#2991;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;, &#2990;&#2965;&#3021;&#2965;&#2995;&#3006;&#2975;&#3021;&#2970;&#3007; &#2990;&#3009;&#2993;&#3016;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. 
&#2986;&#3007;&#2992;&#2980;&#3007;&#2991;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021;, &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016;&#2991;&#3016; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016; &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3016; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; 
&#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2993;&#3016;&#2965;&#3010;&#2993;&#3009;&#2990;&#3021; &#2990;&#2985;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021;&#2993;&#3007;, &#2997;&#2974;&#3021;&#2970;&#2965;&#2984;&#3019;&#2965;&#3021;&#2965;&#2990;&#3007;&#2985;&#3021;&#2993;&#3007;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021;, &#2962;&#2992;&#3009; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3016; 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3006;&#2965; (&#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2994;&#3007;&#2985;&#2965;&#3021;&#3000;&#3021; &#2965;&#2992;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2994;&#3007;&#2985;&#3000;&#3021; &#2975;&#3006;&#2992;&#3021;&#2997;&#3006;&#2994;&#3021;&#2975;&#3021;&#3000;&#3021;) 
<span class="emphasis"><em>&#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;</em></span>. &#2951;&#2984;&#3021;&#2980; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009; &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2997;&#3007;&#2970;&#3015;&#2999; 
&#2986;&#3007;&#2975;&#3007;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;. &#2984;&#3007;&#2992;&#2994;&#3007;&#2985;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#2965;&#3021;&#2980;&#3007;&#2991;&#3016;, 
&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3007;&#2990;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2970;&#2990;&#2990;&#3006;&#2965; &#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2991;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3015; &#2949;&#2980;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2990;&#3021; &#2950;&#2965;&#3009;&#2990;&#3021;. 
&#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;, &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2990;&#3019;&#2970;&#2990;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3007;&#2975;&#3016;&#2991;&#3015; 
&#2949;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2980;&#3007;&#2991;&#3016; &#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;. &#2949;&#2980;&#3016;&#2980;&#3021;&#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2962;&#2992;&#3009; &#2965;&#3007;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2959;&#2993;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#2986;&#3021;&#2986;&#2975;&#2994;&#3006;&#2990;&#3021;. 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021; &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2970;&#2990;&#2992;&#2970;&#2980;&#3021;&#2980;&#3016; &#2984;&#3006;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021;, &#2951;&#2980;&#3009;&#2986;&#3019;&#2985;&#3021;&#2993; &#2984;&#3007;&#2965;&#2996;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2949;&#2992;&#3007;&#2980;&#3006;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. </p><p>&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009;, &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;, &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016; &#2962;&#2992;&#3009; &#2953;&#2970;&#3021;&#2970;&#2997;&#2992;&#2990;&#3021;&#2986;&#3016; 
&#2997;&#3007;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3015;&#2991;&#3015;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3021; &#2959;&#2980;&#3009;&#2990;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995; 
&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2997;&#3015;&#2993;&#3009;&#2997;&#2996;&#3007;&#2965;&#2995;&#3021; &#2959;&#2980;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2980;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2991;&#3007;&#2994;&#3021; &#2997;&#2984;&#3021;&#2980;&#3009; &#2984;&#3007;&#2993;&#3021;&#2986;&#2980;&#3009; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#2980;&#2994;&#3021;&#2994;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3016; &#2949;&#2980;&#3009; 
&#2970;&#2994;&#3007;&#2986;&#3021;&#2986;&#3010;&#2975;&#3021;&#2975;&#3009;&#2997;&#2980;&#3019;&#2975;&#3009;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2979;&#3007;&#2991;&#3016; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2950;&#2993;&#3021;&#2993;&#2994;&#3016;&#2991;&#3009;&#2990;&#3021; &#2953;&#2993;&#3007;&#2974;&#3021;&#2970;&#3007;&#2991;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;. &#2949;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2992;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009; 
&#2986;&#2965;&#3009;&#2980;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2970;&#3009;&#2990;&#3010;&#2965;&#2990;&#3006;&#2965; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#2997;&#2994;&#3021;&#2994;, &#2951;&#2992;&#3009;&#2997;&#3015;&#2993;&#3009; &#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007; &#2950;&#2991;&#3021;&#2984;&#3021;&#2980;&#2993;&#3007;&#2991;&#2994;&#3006;&#2990;&#3021;. 
&#2951;&#2997;&#3021;&#2997;&#3007;&#2992;&#3009;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3009;&#2990;&#3021; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2996;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2958;&#2980;&#3007;&#2992;&#3014;&#2980;&#3007;&#2992;&#3021; &#2958;&#2994;&#3021;&#2994;&#3016;&#2965;&#2995;&#3006;&#2965;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2994;&#3006;&#2990;&#3021;. &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2997;&#3016;&#2991;&#3007;&#2992;&#2979;&#3021;&#2975;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2975;&#3016;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2984;&#3007;&#2994;&#3016;&#2991;&#3007;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.</p></div></div><div class="sect1" title="&#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="benevolent-dictator"></a>&#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021;</h2></div></div></div><a name="benevolant-dictator"></a><p>&#2951;&#2984;&#3021;&#2980; <em class="firstterm">&#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;</em> &#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2985;&#3021; &#2986;&#3014;&#2991;&#2992;&#3009;&#2965;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;, 
&#2951;&#2993;&#3009;&#2980;&#3007; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2986;&#3021;&#2986;&#3009;, &#2980;&#2985;&#2980;&#3009; &#2950;&#2995;&#3009;&#2990;&#3016; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2985;&#3009;&#2986;&#2997;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021;, &#2951;&#2986;&#3021;&#2986;&#3018;&#2992;&#3009;&#2986;&#3021;&#2986;&#3016; &#2970;&#3006;&#2990;&#2992;&#3021;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3006;&#2965; 
&#2965;&#3016;&#2991;&#3006;&#2995;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3007;&#2975;&#2990;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. </p><p>&#8220;&#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;" &#2958;&#2985;&#3021;&#2993; &#2986;&#2980;&#2990;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#2995;&#2997;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2951;&#2984;&#3021;&#2980; 
&#2986;&#3018;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3016; &#2997;&#2965;&#3007;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2970;&#2990;&#3010;&#2965;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021; &#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2984;&#2975;&#3009;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3019;, &#2984;&#3008;&#2980;&#3007;&#2986;&#2980;&#3007;&#2965;&#2995;&#3006;&#2965;&#2997;&#3019; &#2980;&#3006;&#2985;&#3021; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021;, &#2958;&#2994;&#3021;&#2994;&#3006; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2980;&#3006;&#2969;&#3021;&#2965;&#2995;&#3006;&#2965;&#2997;&#3015; &#2958;&#2975;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. 
&#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3010;&#2975; &#2951;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#3008;&#2992;&#3021;&#2990;&#3006;&#2985;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#3007;&#2992;&#3007;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3009;&#2990;&#3021;, 
&#2958;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016;&#2991;&#3015; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2958;&#2994;&#3021;&#2994;&#3006; &#2984;&#3007;&#2986;&#3009;&#2979;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3009;&#2990;&#3021;, &#2980;&#2985;&#3007;&#2991;&#3018;&#2992;&#3009;&#2997;&#2992;&#3007;&#2975;&#2990;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; 
&#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#2994;&#3021;&#2994;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#3006;&#2980;&#3016; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3009;&#2975;&#3016;&#2991; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3007;&#2994;&#3021; 
&#2980;&#2992;&#2990;&#3006;&#2985; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#3008;&#2975;&#3007;&#2965;&#3021;&#2965;&#2990;&#3006;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021;, &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; 
&#2949;&#2980;&#3007;&#2965; &#2950;&#2980;&#3007;&#2965;&#3021;&#2965;&#2990;&#3021; &#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2990;&#3006;&#2993;&#3006;&#2965;, &#2997;&#3007;&#2975;&#2991;&#2969;&#3021;&#2965;&#2995;&#3016; &#2949;&#2980;&#2985;&#3021; &#2986;&#3019;&#2965;&#3021;&#2965;&#3007;&#2994;&#3015;&#2991;&#3015;, &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3009;&#2990;&#3021;, 
&#2986;&#2992;&#3007;&#2970;&#3019;&#2980;&#2985;&#3016;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#3006;&#2991;&#3007;&#2994;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;,  &#2970;&#2992;&#3007;&#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2997;&#3021;&#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3006;&#2990;&#3009;&#2990;&#3021;, &#2962;&#2992;&#3009; &#2970;&#3006;&#2980;&#3006;&#2992;&#2979; &#2984;&#3007;&#2992;&#2994;&#2992;&#3006;&#2965;&#2997;&#3015; 
&#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;&#2980;&#3009;&#2975;&#2985;&#3021;, &#2949;&#2980;&#3021;&#2980;&#3009;&#2993;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2984;&#3007;&#2986;&#3009;&#2979;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2992;&#3009;&#2986;&#3021;&#2986;&#3016; &#2949;&#2995;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2986;&#3021;&#2986;&#2975;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; 
&#2990;&#3010;&#2994;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2990;&#3009;&#2975;&#3007;&#2997;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2975;&#3021;&#2975;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;, &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965;&#2990;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2984;&#2975;&#3016;&#2986;&#3014;&#2993;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965;, 
&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3007;&#2994;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985;&#3019;&#2992;&#3021;, &#2990;&#3009;&#2975;&#3007;&#2997;&#3016; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;, &#2980;&#3006;&#2985;&#3021; , &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#3007;&#2970;&#3021;&#2970;&#3014;&#2994;&#3021;&#2994;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985; 
<span class="emphasis"><em>&#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;</em></span> &#2958;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;,  &#2980;&#3007;&#2975;&#3021;&#2975;&#2997;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2980;&#3014;&#2992;&#3007;&#2984;&#3021;&#2980;&#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3015;, &#2951;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2980;&#3008;&#2992;&#3021;&#2990;&#3006;&#2985;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2980;&#2991;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#3015;, &#2951;&#2984;&#3021;&#2980; 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2994;&#2992;&#3007;&#2975;&#2990;&#3021; &#2965;&#3006;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#2990;&#3021;&#2970;&#2990;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2951;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2986;&#3018;&#2993;&#3009;&#2986;&#3021;&#2986;&#3016; &#2984;&#3008;&#2979;&#3021;&#2975;&#2965;&#3006;&#2994;&#2990;&#3021; &#2997;&#2965;&#3007;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; 
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2965;&#3006;&#2992;&#2979;&#2990;&#3009;&#2990;&#3021; &#2951;&#2980;&#3009;&#2997;&#3015;&#2991;&#3006;&#2965;&#3009;&#2990;&#3021;.</p><div class="sect2" title="&#2991;&#3006;&#2992;&#3006;&#2994;&#3021; &#2984;&#2994;&#3021;&#2994; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;?"><div class="titlepage"><div><div><h3 class="title"><a name="benevolent-dictator-qualifications"></a>&#2991;&#3006;&#2992;&#3006;&#2994;&#3021; &#2984;&#2994;&#3021;&#2994; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;?</h3></div></div></div><a name="benevolant-dictator-qualifications"></a><p> &#2962;&#2992;&#3009; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009; &#2986;&#2994; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2965;&#3009;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. 
&#2990;&#3009;&#2980;&#2994;&#3006;&#2997;&#2980;&#3006;&#2965;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009; &#2980;&#2985;&#2965;&#3021;&#2965;&#3009;&#2992;&#3007;&#2991; &#2970;&#3014;&#2994;&#3021;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2984;&#2985;&#3021;&#2993;&#3006;&#2965; &#2949;&#2993;&#3007;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021;, 
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3009;&#2991; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2958;&#2984;&#3021;&#2980; 
&#2986;&#2991;&#2985;&#3009;&#2990;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985; &#2958;&#2979;&#3021;&#2979;&#3009;&#2990;&#2995;&#2997;&#3007;&#2993;&#3021;&#2965;&#3009;, &#2962;&#2992;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3015;&#2991;&#3015;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2997;&#2975;&#3021;&#2975;&#2990;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, 
&#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2965;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3006;&#2980;&#3009;. &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016;, &#2990;&#3009;&#2975;&#3021;&#2975;&#3006;&#2995;&#3021;&#2980;&#2985;&#2990;&#3006;&#2985; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3010;&#2975;, 
&#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2990;&#3006;&#2965; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995; &#2990;&#3009;&#2975;&#3007;&#2991;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; 
&#2990;&#3009;&#2975;&#3021;&#2975;&#3006;&#2995;&#3021;&#2980;&#2985;&#2990;&#3006;&#2985; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009;&#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2950;&#2965;&#3016;&#2991;&#3006;&#2994;&#3021;,  &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021;, 
&#2962;&#2992;&#3009; &#2980;&#2997;&#2993;&#3006;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2949;&#2980;&#3016; &#2949;&#2975;&#3016;&#2991;&#3006;&#2995;&#2990;&#3021;&#2965;&#2979;&#3021;&#2975;&#3009; &#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2965;&#3009;&#2979;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; 
&#2986;&#3018;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#2986;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. <span class="emphasis"><em>&#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009;</em></span> &#2984;&#2994;&#3021;&#2994; &#2984;&#3007;&#2992;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, 
&#2949;&#2980;&#3007;&#2994;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#3008;&#2979;&#3021;&#2975;&#2984;&#3006;&#2995;&#3021; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2984;&#3007;&#2992;&#2994;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2951;&#2965;&#3021;&#2965;&#3009;&#2979;&#2990;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;. &#2951;&#2980;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; 
&#2997;&#3007;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2970;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;, &#2980;&#2985;&#2980;&#3009; &#2984;&#2990;&#3021;&#2986;&#2965;&#2980;&#3021;&#2980;&#2985;&#3021;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009; &#2954;&#2993;&#3009; 
&#2997;&#3007;&#2995;&#3016;&#2997;&#2980;&#3016;&#2986;&#3021;&#2986;&#2993;&#3021;&#2993;&#3007; &#2965;&#2997;&#2994;&#3016;&#2986;&#3021;&#2986;&#2975;&#3006;&#2990;&#2994;&#3021;, &#2949;&#2997;&#3021;&#2997;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2970;&#3007;&#2994; &#2990;&#3009;&#2975;&#3021;&#2975;&#3006;&#2995;&#3021;&#2980;&#2985;&#2990;&#3006;&#2985; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016; &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. 
&#2950;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3007;&#2965; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3007;&#2994;&#3021;&#2994;&#3006;&#2980; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3006;&#2985; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2980;&#3021;&#2980;&#3016; &#2958;&#2979;&#3021;&#2979;&#3007;, &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; 
&#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2980;&#2991;&#2965;&#3021;&#2965;&#2990;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2965;&#3016;&#2991;&#3006;&#2994;&#3021;, &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;, &#2980;&#2985;&#2980;&#3009; &#2997;&#3007;&#2990;&#2992;&#3021;&#2970;&#2985;&#2969;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, 
&#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2953;&#2995;&#2997;&#3007;&#2991;&#2994;&#3021; &#2992;&#3008;&#2980;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2949;&#2997;&#3016; 
&#2959;&#2993;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991; &#2980;&#3006;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2950;&#2996;&#3021;&#2984;&#3021;&#2980;&#3009; &#2970;&#3007;&#2984;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;, &#2980;&#2985;&#3021; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; &#2949;&#2985;&#3016;&#2997;&#2992;&#3016;&#2997;&#3007;&#2975;&#2997;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2965; 
&#2984;&#3009;&#2975;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2993;&#2985;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3006;&#2965;, &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; <span class="emphasis"><em>&#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3007;&#2994;&#3021;&#2994;&#3016;.</em></span> &#2980;&#2985;&#3021;&#2985;&#3007;&#2970;&#3021;&#2970;&#3016;&#2991;&#3006;&#2965; 
&#2984;&#3007;&#2992;&#2994;&#3007;&#2994;&#3021; &#2997;&#3015;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2958;&#2984;&#3021;&#2980;&#2997;&#3018;&#2992;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2980;&#3021;&#2980;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2984;&#2985;&#3021;&#2965;&#3009; 
&#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2979;&#3021;&#2975;&#2997;&#2992;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2990;&#3008;&#2980;&#3009; &#2980;&#2985;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2975;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#2992;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; 
<span class="emphasis"><em>&#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;</em></span>. &#2951;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007; &#2958;&#2985;&#3021;&#2993; &#2986;&#3018;&#2992;&#3009;&#2986;&#3021;&#2986;&#3009;, &#2949;&#2980;&#3008;&#2980; &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965; 
&#2980;&#3007;&#2993;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2986;&#3014;&#2993;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3019;, &#2980;&#2965;&#3021;&#2965;&#2997;&#3016;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2980;&#3019; &#2949;&#2994;&#3021;&#2994;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3009;&#2990;&#3021;, 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;&#2965;&#3021;&#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980; &#2949;&#2993;&#3007;&#2997;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;. &#2984;&#2994;&#3021;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2984;&#2994;&#3021;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2991;&#3006;&#2992;&#3007;&#2975;&#2990;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3016; &#2965;&#2979;&#3021;&#2975;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009; &#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#2992;&#3007;&#2965;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;&#2997;&#2992;&#3006;&#2965; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965;, &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#3009;&#2985;&#2992;&#3015;, &#2949;&#2980;&#2985;&#3021; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2984;&#3009;&#2975;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2993;&#2985;&#3021;, &#2986;&#3007;&#2993;&#2992;&#3016; &#2980;&#2985;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021;&#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021;, &#2986;&#3019;&#2985;&#3021;&#2993; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; 
&#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2965;&#2980;&#3021; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965; &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2986;&#2979;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2980;&#3006;&#2985;&#3021; &#2962;&#2992;&#3009; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#3009;&#2985;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3007;&#2975;&#3016;&#2991;&#3015; &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2965; &#2962;&#2992;&#3009; &#2990;&#3010;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2984;&#3021;&#2980; 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#2986;&#3021;&#2986;&#3006;&#2980;&#3016;, &#2962;&#2992;&#3009; &#2980;&#2975;&#3016;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995; &#2986;&#3006;&#2980;&#3016;&#2991;&#3006;&#2965; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3014;&#2992;&#3007;&#2965;&#3007;&#2993;&#2980;&#3009;.</p><p>&#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2951;&#2992;&#3009;&#2997;&#2996;&#3007;&#2986;&#3021;&#2986;&#3006;&#2980;&#3016; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2984;&#3006;&#2990;&#3021; &#2984;&#3007;&#2985;&#3016;&#2997;&#3007;&#2994;&#3021; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. 
&#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#3021; &#2986;&#3007;&#2993; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3016;&#2986;&#3021;&#2986;&#3019;&#2994;&#2997;&#3015;, &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#2994;&#3006;&#2990;&#3021;. &#2970;&#3007;&#2994; 
&#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#3019;&#2965;&#3021;&#2965;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009;, &#2980;&#2985;&#2980;&#3009; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2994;&#3021; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985;&#3019;&#2992;&#3007;&#2985;&#3021; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2990;&#3009;&#2990;&#3021; 
&#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2970;&#3007;&#2994; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#2995;&#3021; &#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3007;&#2991;&#3009;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021;. 
&#2986;&#3007;&#2992;&#3007;&#2991;&#3010;&#2985;&#3021;&#2993;&#3009;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;, &#2962;&#2992;&#3009; &#2990;&#3009;&#2993;&#3016;&#2990;&#3016;&#2991;&#3007;&#2985;&#3021; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009;&#2992;&#3007;&#2990;&#3016;&#2965;&#2995;&#3016; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007; 
&#2986;&#3014;&#2993;&#3021;&#2993;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#3006;&#2992;&#3006; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2975;&#3006;&#2965; &#2949;&#2990;&#3016;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;. &#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2991;&#3007;&#2985;&#3021; &#2990;&#3008;&#2980;&#3006;&#2985; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#3015;, 
&#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2985;&#2980;&#3014;&#2985;&#3021;&#2993;&#3009; &#2970;&#3007;&#2994;&#2992;&#3021; &#2958;&#2979;&#3021;&#2979;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3006;&#2985;&#2980;&#2985;&#3021;&#2993;&#3009;. &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2992;&#2994;&#3021; 
&#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2991;&#3007;&#2994;&#3021;, &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2975;&#2997;&#3009;&#2970;&#3021;&#2970;&#3018;&#2993;&#3021;&#2965;&#2995;&#3016; &#2970;&#3015;&#2992;&#3021;&#2965;&#3021;&#2965;&#2997;&#3019;, &#2984;&#3008;&#2965;&#3021;&#2965;&#2997;&#3019; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2990;&#3021;, &#2949;&#2984;&#3021;&#2980; &#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2991;&#3007;&#2994;&#3009;&#2995;&#3021;&#2995; &#2984;&#3007;&#2992;&#2994;&#3021; &#2984;&#2965;&#2994;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;. &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3007;&#2965;&#3006;&#2992;&#2980;&#3021;&#2980;&#3016; 
&#2980;&#2997;&#2993;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3019;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2986;&#3007;&#2993; &#2953;&#2993;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#2992;&#3021;&#2965;&#2995;&#3019;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; 
&#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3016; &#2997;&#3015;&#2993;&#3018;&#2992;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#3007;&#2965;&#3021;&#2965;&#3009; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2970;&#3021;&#2970;&#3014;&#2994;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;.</p></div><p>&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3007;&#2985;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3006;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;, 
&#2997;&#3015;&#2993;&#3009; &#2970;&#3007;&#2994; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2990;&#3016;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3015; &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985;&#2980;&#3006; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009;, &#2951;&#2984;&#3021;&#2980; &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; 
&#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3007;&#2985;&#3021; &#2986;&#3006;&#2980;&#3021;&#2980;&#3007;&#2992;&#2980;&#3021;&#2980;&#3016; &#2991;&#3006;&#2992;&#3021; &#2959;&#2993;&#3021;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2980;&#3009;. &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2991;&#3006;&#2965; &#2991;&#3006;&#2992;&#3021; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3014;&#2985;&#3021;&#2986;&#2980;&#3009; &#2965;&#3009;&#2996;&#3009;&#2997;&#3007;&#2985;&#2992;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2965; &#2980;&#3014;&#2992;&#3007;&#2991;&#3009;&#2990;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009;, &#2984;&#3006;&#2990;&#3021; &#2949;&#2997;&#3021;&#2997;&#2996;&#3007;&#2991;&#3007;&#2994;&#3015;&#2991;&#3015; 
&#2980;&#3018;&#2975;&#2992;&#2994;&#3006;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021;, &#2951;&#2992;&#2965;&#3021;&#2965;&#2990;&#3009;&#2995;&#3021;&#2995; &#2970;&#2992;&#3021;&#2997;&#3006;&#2980;&#3007;&#2965;&#3006;&#2992;&#3007;&#2965;&#3021;&#2965;&#3006;&#2985; &#2997;&#3015;&#2975;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2991;&#3006;&#2992;&#3014;&#2985; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2965; 
&#2980;&#3014;&#2992;&#3007;&#2991;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016;&#2991;&#3014;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021;, &#2949;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#2992;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009; &#2986;&#3019;&#2994;, &#2986;&#2992;&#2997;&#2994;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; 
&#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3016;&#2990;&#3016;&#2991;&#3016; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#3018;&#2980;&#3009;&#2997;&#3007;&#2980;&#3007;.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="social-networking.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="consensus-democracy.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Social Networking Services </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2962;&#2992;&#3009;&#2990;&#3007;&#2980;&#3021;&#2980; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3006;&#2985; &#2972;&#2985;&#2984;&#3006;&#2991;&#2965;&#2990;&#3021;</td></tr></table></div></body></html>
