<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="preface.html" title="&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;"><link rel="prev" href="audience.html" title="&#2991;&#3006;&#2992;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2986;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;?"><link rel="next" href="acknowledgments.html" title="&#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="audience.html">Prev</a> </td><th width="60%" align="center">&#2990;&#3009;&#2965;&#2997;&#3009;&#2992;&#3016;</th><td width="20%" align="right"> <a accesskey="n" href="acknowledgments.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sources"></a>&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021;</h2></div></div></div><p>Subversion &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 5 &#2997;&#2992;&#3009;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2980;&#3021;&#2980;&#2980;&#2985;&#3021;  &#2997;&#3006;&#2991;&#3007;&#2994;&#3006;&#2965; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3015; 
&#2951;&#2986;&#3021;&#2986;&#2975;&#3016;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021;  &#2986;&#3014;&#2992;&#3009;&#2997;&#3006;&#2992;&#3007;&#2991; &#2950;&#2980;&#3006;&#2992;&#2990;&#3006;&#2965; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009; (<a class="ulink" href="http://subversion.tigris.org/" target="_top">http://subversion.tigris.org/</a>).  Subversion &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2962;&#2992;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; 
&#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; (version control version control system)&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;, cvs &#2958;&#2985;&#3021;&#2993;; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#3019;&#2980;&#3009;&#2986;&#3021;&#2986;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2991;&#3006;&#2965; &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  2000&#2990;&#3006;&#2990;&#3021; &#2950;&#2979;&#3021;&#2975;&#3007;&#2985;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; CollabNet (<a class="ulink" href="http://www.collab.net/" target="_top">http://www.collab.net/</a>) &#2958;&#2985;&#3021;&#2993; &#2958;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2980;&#3009;&#2997;&#2969;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;, &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2990;&#3021; 
&#2990;&#3009;&#2980;&#2994;&#3015; &#2951;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016; &#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#2995;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2984;&#3007;&#2992;&#3021;&#2997;&#2965;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2984;&#2985;&#3021;&#2965;&#3009; &#2953;&#2979;&#2992;&#3021;&#2980;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#2985;&#2992;&#3021;.  &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#3007;&#2993;&#3016;&#2991; &#2980;&#2985;&#3021;&#2985;&#3006;&#2992;&#3021;&#2997; &#2980;&#3018;&#2979;&#3021;&#2975;&#2992;&#3021;&#2965;&#2995;&#3016; 
&#2952;&#2992;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3019;&#2990;&#3021;, &#2951;&#2986;&#3021;&#2986;&#3018;&#2996;&#3009;&#2980;&#3009; &#2970;&#3009;&#2990;&#3006;&#2992;&#3021; 50&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3015;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3006;&#2965; 
&#2951;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2997;&#2992;&#3021;&#2965;&#2995;&#3015; CollabNet-&#2951;&#2985;&#3021; &#2980;&#3018;&#2996;&#3007;&#2994;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021;. 
</p><p> 
&#2986;&#2994;&#3021;&#2997;&#3015;&#2993;&#3009; &#2990;&#3010;&#2994;&#2965;&#3021;&#2965;&#3009;&#2992;&#3009;&#2965;&#2995;&#3007;&#2994;&#3021; Subversion-&#2960; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3007;&#2965;&#2970;&#3021;&#2970;&#3007;&#2993;&#2984;&#3021;&#2980; 
&#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2965;&#2992;&#3009;&#2980;&#2994;&#3006;&#2990;&#3021;, &#2958;&#2985;&#2997;&#3015; &#2949;&#2980;&#2985;&#3007;&#2975;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2958;&#2979;&#3021;&#2979;&#3007;&#2991;&#2980;&#3016;&#2997;&#3007;&#2975; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965;&#2997;&#3015; &#2952;&#2992;&#3021;&#2980;&#3009; 
&#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#3015;&#2985;&#3021;.  &#2949;&#2980;&#2993;&#3021;&#2965;&#3009; &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3007;&#2985;&#3009;&#2990;&#3021; Subversion-&#2984;&#3007;&#2994;&#3021; 
&#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2991;&#2980;&#3016; &#2958;&#2995;&#3007;&#2990;&#3016;&#2991;&#3006; &#2984;&#3007;&#2985;&#3016;&#2997;&#3007;&#2994;&#3021; &#2986;&#3014;&#2993;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2985;&#3021;&#2993;&#3007; &#2949;&#2980;&#2985;&#3016; 
&#2970;&#2992;&#3007;&#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;&#2980;&#2985;&#3021;. &#2984;&#3006;&#2985;&#3021; &#2990;&#2993;&#3021;&#2993; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; 
&#2997;&#3014;&#2997;&#3021;&#2997;&#3015;&#2993;&#3009; &#2986;&#2975;&#3021;&#2975; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2984;&#2979;&#3021;&#2986;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#3010;&#2994;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2962;&#2985;&#3021;&#2993;&#3016; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009; &#2958;&#2985;&#3021;&#2985;&#2997;&#3014;&#2985;&#3007;&#2994;&#3021; &#2958;&#2980;&#3016; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3007;&#2993;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2953;&#2979;&#3021;&#2990;&#3016; 
&#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2953;&#2993;&#3009;&#2980;&#3007;&#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3015;.  &#2958;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3007; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2965;&#3010;&#2993;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2959;&#2985;&#3021;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021; &#2991;&#3006;&#2992;&#3015;&#2985;&#3009;&#2990;&#3021; 
&#2949;&#2965;&#3021;&#2965;&#3010;&#2993;&#3021;&#2993;&#3016; Subversion-&#2984;&#3007;&#2994;&#3021; &#2970;&#2992;&#3007;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; &#2984;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021; &#2949;&#2980;&#3016; &#2949;&#2993;&#3016;&#2970;&#2980;&#3021;&#2997;&#3007;&#2965;&#3007;&#2980;&#2990;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; 
&#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.  &#2949;&#2986;&#3021;&#2986;&#2975;&#3007; &#2959;&#2980;&#3015;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3007;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021; &#2984;&#3015;&#2992;&#2975;&#3007;&#2991;&#3006;&#2965; 
&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2965;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021;; &#2953;&#2975;&#2985;&#3015; &#2949;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009; &#2997;&#2992;&#3009;&#2990;&#3021; &#2984;&#2990;&#3021;&#2986;&#2965;&#2990;&#3006;&#2985; &#2962;&#2992;&#3009;&#2997;&#2992;&#3007;&#2975;&#2990;&#3021; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2990;&#3021; 
&#2965;&#3015;&#2975;&#3021;&#2975;&#3009;&#2997;&#3007;&#2975;&#3009;&#2997;&#3015;&#2985;&#3021;.</p><p>&#2984;&#3006;&#2985;&#3021; &#2965;&#2975;&#2984;&#3021;&#2980; 5 &#2997;&#2992;&#3009;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3006;&#2985;&#3021; 
Subversion-&#2984;&#3007;&#2994;&#3021; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007; &#2997;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; 12 &#2950;&#2979;&#3021;&#2975;&#3009; 
&#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3007;&#2975;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2951;&#2986;&#3021;&#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2950;&#2980;&#3006;&#2992;&#2990;&#3006;&#2965; &#2953;&#2980;&#2997;&#3007;&#2991; &#2997;&#3015;&#2993;&#3009; &#2970;&#3007;&#2994; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2965;&#3008;&#2996;&#3015; &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2985;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2965;&#3010;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; GNU Emacs &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021;.  &#2951;&#2980;&#3007;&#2994;&#3021; 
			&#2984;&#3006;&#2985;&#3021; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#3007;&#2991; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2970;&#3014;&#2991;&#2994;&#3006;&#2965;&#3021;&#2965; 
			&#2953;&#2980;&#2997;&#3007;&#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;.</p></li><li class="listitem"><p>Concurrent Versions System (CVS).  1994-&#2951;&#2994;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; 
			&#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009;&#2975;&#2985;&#3009;&#2990;&#3021; &#8211;1995-&#2951;&#2994;&#3021; Jim Blandy &#2951;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007; 
			&#2953;&#2995;&#3021;&#2995;&#3015;&#2985;&#3021;, &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2958;&#2985;&#2980;&#3009; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009;.</p></li><li class="listitem"><p>Apache Software Foundation-&#2960; &#2970;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980; &#2965;&#2993;&#3021;&#2993;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
			&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; Apache Portable Runtime (APR) &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
			Apache HTTP Server &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;.</p></li><li class="listitem"><span style="color: red">&lt;param&gt;OpenOffice.org, Sleepycat-&#2951;&#2985;&#3021; Berkeley Database 
			&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; MySQL Database; &#2958;&#2985;&#2980;&#3009; &#2984;&#3015;&#2992;&#2975;&#3007; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#2986;&#3019;&#2980;&#3009;&#2990;&#3021; 
			&#2951;&#2997;&#2993;&#3021;&#2993;&#3016; &#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3015;&#2985;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2994;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009; &#2997;&#2992;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; 
			&#2965;&#2994;&#2984;&#3021;&#2980;&#3009;&#2992;&#3016;&#2991;&#3006;&#2975;&#3007;&#2991;&#3009;&#2995;&#3021;&#2995;&#3015;&#2985;&#3021;. &lt;/param&gt;</span></li><li class="listitem"><p>GNU Debugger (GDB) (&#2990;&#3015;&#2993;&#3021;&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3015;).</p></li><li class="listitem"><p>The Debian Project (&#2990;&#3015;&#2993;&#3021;&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3015;).</p></li></ul></div><p>&#2951;&#2980;&#3009; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2980;&#3015;&#2997;&#3016;&#2965;&#3007;&#2979;&#2969;&#3021;&#2965; &#2990;&#2993;&#3021;&#2993; 
	&#2950;&#2980;&#3006;&#2992;&#2969;&#3021;&#2965;&#2995;&#3016; &#2949;&#2997;&#3021;&#2997;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#3015;&#2985;&#3021;.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="audience.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="preface.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="acknowledgments.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2991;&#3006;&#2992;&#3021; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2990;&#3021; &#2986;&#2975;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;? </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2962;&#2986;&#3021;&#2986;&#3009;&#2965;&#3016;</td></tr></table></div></body></html>
