<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="index.html" title="Producing Open Source Software"><link rel="prev" href="announcing.html" title="&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;"><link rel="next" href="web-site.html" title="&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="announcing.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="web-site.html">Next</a></td></tr></table><hr></div><div class="chapter" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><div class="titlepage"><div><div><h2 class="title"><a name="technical-infrastructure"></a>Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="technical-infrastructure.html#tools-needed">&#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2985;</a></span></dt><dt><span class="sect1"><a href="web-site.html">&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;</a></span></dt><dd><dl><dt><span class="sect2"><a href="web-site.html#canned-hosting">&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;</a></span></dt><dd><dl><dt><span class="sect3"><a href="web-site.html#canned-hosting-choosing">&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2980;&#3021;&#2980;&#3015; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021;</a></span></dt><dt><span class="sect3"><a href="web-site.html#hosting-on-freedom">&#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021;</a></span></dt><dt><span class="sect3"><a href="web-site.html#anonymity">&#2949;&#2993;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="message-forums.html">&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;</a></span></dt><dd><dl><dt><span class="sect2"><a href="message-forums.html#message-forum-choosing">&#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#2985;&#3021;&#2993; &#2990;&#3015;&#2994;&#3006;&#2985;&#3021;&#2990;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021;</a></span></dt><dd><dl><dt><span class="sect3"><a href="message-forums.html#spam-prevention">&#2997;&#3008;&#2985;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2984;&#3008;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</a></span></dt><dt><span class="sect3"><a href="message-forums.html#header-management">Identification and Header Management</a></span></dt><dt><span class="sect3"><a href="message-forums.html#reply-to">The Great Reply-to Debate</a></span></dt><dt><span class="sect3"><a href="message-forums.html#archiving">Archiving</a></span></dt><dt><span class="sect3"><a href="message-forums.html#message-forum-software">Mailing List / Message Forum Software</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="vc.html">Version Control</a></span></dt><dd><dl><dt><span class="sect2"><a href="vc.html#vc-vocabulary">Version Control Vocabulary</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-choosing">Choosing a Version Control System</a></span></dt><dt><span class="sect2"><a href="vc.html#vc-using">Using the Version Control System</a></span></dt><dd><dl><dt><span class="sect3"><a href="vc.html#version-everything">Version everything</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-browsing">Browsability</a></span></dt><dt><span class="sect3"><a href="vc.html#branches">Use branches to avoid bottlenecks</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-singularity">Singularity of information</a></span></dt><dt><span class="sect3"><a href="vc.html#vc-authz">Authorization</a></span></dt></dl></dd><dt><span class="sect2"><a href="vc.html#receiving-changes">Receiving and reviewing contributions</a></span></dt><dd><dl><dt><span class="sect3"><a href="vc.html#pull-requests">Pull requests</a></span></dt><dt><span class="sect3"><a href="vc.html#commit-review-systems">Review systems</a></span></dt><dt><span class="sect3"><a href="vc.html#commit-emails">Commit emails</a></span></dt></dl></dd></dl></dd><dt><span class="sect1"><a href="bug-tracker.html">Bug Tracker</a></span></dt><dd><dl><dt><span class="sect2"><a href="bug-tracker.html#bug-tracker-email-interaction">Interaction with Email</a></span></dt><dt><span class="sect2"><a href="bug-tracker.html#bug-filtering">Pre-Filtering the Bug Tracker</a></span></dt></dl></dd><dt><span class="sect1"><a href="irc.html">IRC / Real-Time Chat Systems</a></span></dt><dd><dl><dt><span class="sect2"><a href="irc.html#irc-bots">IRC Bots</a></span></dt><dd><dl><dt><span class="sect3"><a href="irc.html#irc-commit-notifications">Commit Notifications in IRC</a></span></dt></dl></dd><dt><span class="sect2"><a href="irc.html#irc-archiving">Archiving IRC</a></span></dt></dl></dd><dt><span class="sect1"><a href="rss.html">RSS Feeds</a></span></dt><dt><span class="sect1"><a href="wikis.html">Wikis</a></span></dt><dd><dl><dt><span class="sect2"><a href="wikis.html#wiki-spam">Wikis and Spam</a></span></dt><dt><span class="sect2"><a href="wikis.html#wiki-choosing">Choosing a Wiki</a></span></dt></dl></dd><dt><span class="sect1"><a href="q-and-a-forums.html">Q&amp;A Forums</a></span></dt><dt><span class="sect1"><a href="social-networking.html">Social Networking Services</a></span></dt></dl></div><div class="simplesect"><div class="titlepage"></div><p>&#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2980;&#3016; 
&#2965;&#2997;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2965;&#3014;&#3006;&#2995;&#3009;&#2990;&#3021; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2951;&#2984;&#3021;&#2980; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2949;&#2980;&#3007;&#2980; 
&#2980;&#3007;&#2993;&#2990;&#3016;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021;  &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2951;&#2979;&#2969;&#3021;&#2965;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2950;&#2993;&#3021;&#2993;&#2994;&#3021;, &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2965; 
&#2950;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.
</p><p>&#2949;&#2984;&#3021;&#2980;&#2965;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#2995;&#2992; &#2997;&#2995;&#2992; &#2951;&#2980;&#3009; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2965;&#3009;&#2990;&#3021;.  &#2986;&#3021;&#2992;&#3010;&#2965;&#3021;&#3000;&#3021;' &#2970;&#2975;&#3021;&#2975;&#2990;&#3021; &#2970;&#3014;&#3006;&#2994;&#3021;&#2994;&#3009;&#2997;&#2980;&#3009;&#2986;&#3019;&#2994;&#3021; &#2984;&#2994;&#3021;&#2994; 
&#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3016; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;(Brooks' Law)<sup>[<a name="idp6135168" href="#ftn.idp6135168" class="footnote">25</a>]</sup>,
&#2951;&#2980;&#3009; &#2962;&#2992;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2985;&#3021; &#2986;&#3007;&#2993;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2954;&#2996;&#3007;&#2991;&#2992;&#3021;&#2965;&#2995;&#3021; &#2970;&#3015;&#2992;&#3021;&#2980;&#3021;&#2980;&#2994;&#3021; &#2949;&#2980;&#3009; &#2949;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2980;&#3006;&#2990;&#2980;&#2990;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985; &#2970;&#3014;&#3006;&#2994;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2986;&#3007;&#2992;&#3014;&#2975;&#3021; &#2986;&#3021;&#2992;&#3010;&#2965;&#3021;&#3000;&#3021;-&#2985;&#3021; &#2986;&#3009;&#2992;&#3007;&#2980;&#2994;&#3021;&#2986;&#2975;&#3007; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2980;&#2965;&#2997;&#2994;&#3021; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009; &#2949;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; 
&#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2995;&#2997;&#3007;&#2994;&#3021; 
<span class="emphasis"><em>&#2951;&#2992;&#3009;&#2986;&#2975;&#3007;</em></span> &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985;&#2980;&#3006;&#2965;&#3007;&#2992;&#2980;&#3009;.
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2994;&#3021; &#2965;&#3009;&#2993;&#3016;&#2997;&#3006;&#2985; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2986;&#3019;&#2980; &#2980;&#2965;&#2997;&#2994;&#3021; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009; &#2958;&#2995;&#3007;&#2980;&#3006;&#2985;&#2980;&#3009;, &#2949;&#2980;&#3009;&#2997;&#3014; 
&#2984;&#3010;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#2979;&#2965;&#3021;&#2965;&#3006;&#2985;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;, &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#2994;&#3006;&#2993;&#3021;&#2993;&#2994;&#3016; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3009;&#2980;&#2994;&#3021; 
&#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#2993;&#3021;&#2993;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2984;&#2994;&#3021;&#2994; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2962;&#2992;&#3015; &#2949;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2962;&#2985;&#3021;&#2993;&#3006;&#2965; &#2997;&#3015;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021; &#2986;&#3019;&#2994;&#3021; &#2953;&#2979;&#2992; &#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3007;&#2994;&#3021;, &#2980;&#3015;&#3006;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; 
&#2984;&#3007;&#2991;&#3006;&#2991;&#2990;&#3006;&#2985; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2991;&#3006;&#2980;&#3014;&#2985;&#3007;&#2994;&#3021;: &#2949;&#2997;&#3021; &#2949;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2984;&#3015;&#2992;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#3015;&#2970; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2958;&#2985;&#3021;&#2985;&#2997;&#3006;&#2965;&#3009;&#2990;&#3021;?</p><p>&#2951;&#2984;&#3021;&#2980; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016; &#2986;&#3009;&#2980;&#3007;&#2991;&#2980;&#3009; &#2949;&#2994;&#3021;&#2994;.  &#2953;&#2992;&#3009;&#2997;&#2965;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#3006;&#2980; &#2984;&#3014;&#2992;&#3007;&#2970;&#2994;&#3006;&#2985; &#2949;&#2993;&#3016;&#2965;&#2995;&#3007;&#2995;&#3021; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;
<em class="firstterm">&#2986;&#3006;&#2992;&#3006;&#2995;&#3009;&#2990;&#2985;&#3021;&#2993; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;</em>: &#2986;&#3014;&#2992;&#3007;&#2991; &#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#3007;&#2965;&#2996;&#3021; &#2984;&#3015;&#2992; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3016; 
&#2984;&#2975;&#2980;&#3021;&#2980; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#2996;&#3007;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3021;,  &#2997;&#3014;&#2995;&#3021;&#2995;&#2990;&#3006;&#2991;&#3021; &#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2990;&#3018;&#2996;&#3007;&#2980;&#2994;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; 
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2984;&#3015;&#2992;&#3021;&#2990;&#3009;&#2992;&#2979;&#3006;&#2985; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2980;&#2997;&#2992;&#3006;&#2990;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2994;&#3021;&#2980;&#2994;&#3021;, &#2980;&#3009;&#2979;&#3016;&#2965;&#3021;&#2965;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007;, 
&#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;, &#2986;&#3015;&#3006;&#2985;&#3021;&#2993;&#2997;&#3016;.  &#2965;&#3009;&#2996;&#3009; &#2949;&#2980;&#2985;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; 
&#2958;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2986;&#3006;&#2992;&#3006;&#2995;&#3009;&#2990;&#2985;&#3021;&#2993; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#2991;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2970;&#3007;&#2994; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#2995;&#3021; 
"&#2986;&#2980;&#3007;&#2997;&#3009;&#2970;&#3021; " &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2990;&#2993;&#3021;&#2993;&#2997;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2997;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2986;&#2980;&#3007;&#2997;&#3009; &#2965;&#3016;&#2991;&#3006;&#2995;&#3009;&#2980;&#2994;&#3021; &#2997;&#3014;&#2993;&#3009;&#2990;&#3021;&#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#3021;&#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2991;&#3021;  
&#2958;&#2985;&#3021;&#2985; &#2984;&#2975;&#2984;&#3021;&#2980;&#2980;&#3014;&#2985;&#3021;&#2993;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2965;&#3009;&#2996;&#3009; &#2958;&#2980;&#3016; <span class="emphasis"><em>&#2962;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021; &#2965;&#3014;&#3006;&#2995;&#3021;&#2995;</em></span> &#2980;&#2991;&#3006;&#2992;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009; 
&#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3009;&#2990;&#3021;.  &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2986;&#2975;&#3007;&#2980;&#3021;&#2980;&#3006;&#2985;&#2980;&#2994;&#3021;&#2994;, &#2962;&#2997;&#3021;&#2997;&#3018;&#2992;&#3009; &#2965;&#3006;&#2992;&#2979;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#2985;&#3007; &#2997;&#2975;&#3007;&#2997;&#2990;&#3021; 
&#2965;&#3018;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;. &#2949;&#2980;&#3009; &#2970;&#3007;&#2993;&#3009; &#2970;&#3007;&#2993;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2965;&#3009;&#2996;&#3007;&#2965;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021;, &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2965;&#3009;&#2996;&#3007;&#2965;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3021;, 
&#2970;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3021;, &#2984;&#3007;&#2965;&#2996;&#3021;&#2970;&#3021;&#2970;&#3007; &#2984;&#3007;&#2992;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965; &#2953;&#2992;&#3016;, &#2965;&#3009;&#2996;&#3009; &#2949;&#2993;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3007;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3006;&#2980; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3021; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2994; &#2997;&#2993;&#3021;&#2993;&#3016; &#2965;&#3018;&#2979;&#3021;&#2975;&#2980;&#3009;.</p><p>&#2951;&#2979;&#3016;&#2991;&#2990;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2949;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;, &#2986;&#3006;&#2992;&#3006;&#2995;&#3009;&#2990;&#2985;&#3021;&#2993; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016; &#2986;&#3019;&#2994;&#3021; 
&#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3015;&#2970;&#3009;&#2990;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009; &#2970;&#3007;&#2994;&#2992;&#3016; &#2949;&#2990;&#3016;&#2980;&#3007;&#2991;&#3006;&#2965; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#2994;&#3021;&#2994;&#3006;&#2980;&#2980;&#3009;. &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; 
&#2953;&#2980;&#3021;&#2980;&#3007;&#2965;&#2995;&#3016; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#2997;&#2992;&#3016; &#2984;&#2985;&#3021;&#2965;&#3009; &#2951;&#2991;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965; &#2986;&#2975;&#3021;&#2975; &#2986;&#3006;&#2992;&#3006;&#2995;&#3009;&#2990;&#2985;&#3021;&#2993; 
&#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016; &#2986;&#3015;&#3006;&#2985;&#3021;&#2993;&#2980;&#3009;.  &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#2975;&#3021;&#2975; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#2965;&#2997;&#2994;&#3021; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009;&#2990;&#3021; &#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3009; &#2986;&#3010;&#2992;&#3021;&#2997;&#2990;&#3006;&#2985;&#2980;&#3006;&#2994;&#3021;; &#2986;&#3015;&#3006;&#2994;&#3007;&#2991;&#3006;&#2985; 
&#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3009;&#2980;&#2994;&#3021;&#2965;&#2995;&#3016; &#2980;&#2997;&#3007;&#2992;&#3021;&#2980;&#3021;&#2980;&#2994;&#3021;, &#2980;&#2992;&#2997;&#3009;&#2965;&#2995;&#3016; &#2970;&#3015;&#2990;&#3007;&#2980;&#3021;&#2980;&#3009; &#2990;&#3008;&#2975;&#3021;&#2975;&#3014;&#2975;&#3009;&#2980;&#2994;&#3021;, &#2980;&#2997;&#2993;&#3006;&#2985; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2997;&#2996;&#2965;&#3021;&#2965;&#2993;&#3021;&#2993; &#2980;&#2965;&#2997;&#2994;&#3021; &#2980;&#3007;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3021;, 
&#2950;&#2965;&#3007;&#2997;&#2993;&#3021;&#2993;&#3007;&#2965;&#3009; &#2997;&#3007;&#2992;&#3007;&#2997;&#3006;&#2985; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3014;&#2991;&#2992;&#3007;&#2975;&#2994;&#3021; &#2980;&#2992;&#2997;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2997;&#2995;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3021;&#2975;&#2985;.  
&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2951;&#2997;&#3021; &#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965; &#2953;&#2975;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;. &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; 
&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985; &#2990;&#2985;&#3007;&#2980; &#2950;&#2993;&#3021;&#2993;&#2994;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2970;&#2992;&#3007;&#2991;&#3006;&#2965; &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#2997;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2951;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; 
&#2949;&#2980;&#3007; &#2984;&#2997;&#3008;&#2985; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3009;&#2985;&#3016;&#2991;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2980;&#3018;&#2994;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009; &#2954;&#2975;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3019;&#2980;&#3009;&#2990;&#3006;&#2985;&#2997;&#2992;&#3016; &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2980;&#2994;&#3021;, 
&#2970;&#3014;&#2990;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3014;&#2991;&#2992;&#3007;&#2975;&#3009;&#2980;&#2994;&#3021; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3016; &#2990;&#2985;&#3007;&#2980;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2994;&#3007;&#2980;&#3006;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2950;&#2985;&#3006;&#2994;&#3021; &#2984;&#2975;&#3016;&#2990;&#3009;&#2992;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2986;&#2994;&#2997;&#2993;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3009; &#2990;&#2985;&#3007;&#2980; &#2980;&#2994;&#3016;&#2991;&#3008;&#2975;&#3009; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  
&#2990;&#2985;&#3007;&#2980;&#2992;&#3021;&#2965;&#2995;&#3015; &#2980;&#2965;&#2997;&#2994;&#3021; &#2986;&#3014;&#2991;&#2992;&#3007;&#2975;&#3009;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2984;&#2975;&#2980;&#3021;&#2980;&#3009;&#2980;&#2994;&#3016; &#2954;&#2975;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2975;&#3021;&#2970;&#3014;&#2994;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009; &#2970;&#3014;&#2991;&#3021;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; 
&#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2990;&#3009;&#2975;&#3007;&#2984;&#3021;&#2980;&#2997;&#2992;&#3016; &#2949;&#2984;&#3021;&#2980; &#2980;&#2992;&#2997;&#3009; &#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#2992;&#2997;&#3009;&#2965;&#2995;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2965;&#3021; &#2965;&#3018;&#2995;&#3021;&#2995;&#3009;&#2990;&#3006;&#2993;&#3009; 
&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2965;&#3021;&#2965;&#2986;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2986;&#2975;&#3021;&#2975;&#3009;&#2994;&#3021;&#2994; &#2950;&#2994;&#3019;&#2970;&#2985;&#3016;&#2965;&#2995;&#3021; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#2980;&#3009;, &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2997;&#2996;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980; &#2949;&#2985;&#3009;&#2986;&#2997;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993;&#2980;&#3009;. &#2950;&#2985;&#3006;&#2994;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; 
&#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2965;&#2993;&#3021;&#2993;&#3009; &#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#3006;&#2990;&#2994;&#3021; &#2970;&#3007;&#2993;&#3007;&#2991; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2985; 
&#2949;&#2985;&#3009;&#2965;&#3009;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2997;&#3007;&#2997;&#2992;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;. &#2951;&#2984;&#3021;&#2980; &#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3021; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2980;&#3007;&#2993;&#2985;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2994;&#2997;&#3016; 
&#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.  &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2980;&#3015;&#2997;&#3016;, &#2958;&#2986;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3021; &#2980;&#3014;&#2997;&#3016; &#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3006;&#2994;&#3021; &#2958;&#2996;&#3009;&#2990;&#3021; 
&#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3007;&#2965;&#3021;&#2965;&#3009; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2980;&#3007;&#2993;&#2985;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016; (&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#2996;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2991;&#3016; &#2965;&#3016;&#2991;&#3006;&#2996;&#3021;&#2997;&#2980;&#3009;
&#2958;&#2985;&#3021;&#2993; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3016; <a class="xref" href="bug-tracker.html#bug-filtering" title="Pre-Filtering the Bug Tracker">the section called &#8220;Pre-Filtering the Bug Tracker&#8221;</a><span>
&#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#3007;&#2993;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2994;&#3021; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;</span>).  &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2993;&#2985;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; &#2959;&#2985;&#3014;&#2985;&#3007;&#2994;&#3021; &#2990;&#2985;&#3007;&#2980; 
&#2970;&#2990;&#3010;&#2965;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#3009; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;; &#2958;&#2986;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3021; &#2951;&#2984;&#3021;&#2980; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3016; &#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2953;&#2975;&#2985;&#2975;&#3007;&#2991;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2990;&#3009;&#2996;&#3009; 
&#2986;&#2991;&#2985;&#3021; &#2949;&#2975;&#3016;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2965; &#2951;&#2994;&#3021;&#2994;&#3016;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2970;&#2984;&#3021;&#2980;&#2992;&#3021;&#2986;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2992;&#2979;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#2992;&#2986;&#3009;&#2965;&#2995;&#3016; 
&#2986;&#3007;&#2985;&#3021;&#2986;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2953;&#2985;&#3021;&#2975;&#3009;. (&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, <code class="systemitem">Reply-to-&#2960;</code> &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; 
&#2997;&#3014;&#2995;&#3007;&#2991;&#3015;&#2993;&#3009;&#2990;&#3021; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2985;&#3021; &#2980;&#2994;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3016; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;
<a class="xref" href="message-forums.html" title="&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;">the section called &#8220;&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;&#8221;</a>).
&#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2997;&#2996;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009;&#2975;&#3016;&#2991; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3016; 
&#2962;&#2996;&#3009;&#2969;&#3021;&#2965;&#3009;&#2986;&#2975; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965; &#2954;&#2965;&#3021;&#2965;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2970;&#2990;&#3021;&#2986;&#2984;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; 
&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009; &#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3016; &#2949;&#2993;&#3007;&#2991; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2980;&#2991;&#3006;&#2992;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2997;&#3016;&#2980;&#3021;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009; &#2959;&#2980;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2949;&#2980;&#3007;&#2994;&#3021; &#2986;&#2994; &#2990;&#3006;&#2993;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;.  
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2991;&#2997;&#3006;&#2992;&#3009; &#2951;&#2993;&#3009;&#2980;&#3007;&#2991;&#3006;&#2965; &#2958;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#2994;&#3006;&#2990;&#3021;,  &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3016; &#2970;&#2990;&#3010;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3006;&#2990;&#3021;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2949;&#2984;&#3021;&#2980; &#2970;&#3007;&#2994; &#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3016; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2986;&#2992;&#3007;&#2990;&#3006;&#2979;&#2990;&#2985;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2962;&#2980;&#3021;&#2980;&#3009; 
&#2997;&#3007;&#2992;&#3007;&#2997;&#3009;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2990;&#2994;&#3021; &#2970;&#3014;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;. &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2953;&#2993;&#3009;&#2980;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2995;&#2992;&#3021; 
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021; &#2970;&#2990;&#3010;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2997;&#2970;&#2980;&#3007;&#2991;&#3006;&#2965; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3014;&#3006;&#2985;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; 
&#2991;&#3006;&#2992;&#3015;&#3006; &#2997;&#2984;&#3021;&#2980;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2970;&#3015;&#2997;&#3016;&#2991;&#3018;&#2985;&#3021;&#2993;&#3016; &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2980;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2997;&#3007;&#2992;&#3016;&#2997;&#3007;&#2994;&#3021; &#2986;&#3009;&#2980;&#3009;&#2990;&#3009;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2949;&#2980;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009; &#2959;&#2985;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3015;&#2975;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;&#8212;&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;, &#2951;&#2980;&#3009; 
&#2997;&#3007;&#2965;&#3021;&#2965;&#3007;&#2991;&#3007;&#2985;&#3021; (wiki) &#2965;&#2979;&#3021;&#2975;&#3009;&#2986;&#3007;&#2975;&#3007;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2984;&#3021;&#2980;&#3016;&#2991;&#2985;&#2997;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#3007;&#2993;&#3016;&#2991;&#2997;&#2993;&#3021;&#2993;&#3007;&#2994;&#3021; 
&#2984;&#2975;&#2984;&#3021;&#2980;&#2980;&#3009;(see <a class="ulink" href="http://en.wikipedia.org/wiki/Wiki" target="_top">en.wikipedia.org/wiki/Wiki</a>), &#2990;&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2985;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; GigHub&#2991;&#3016; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; 
&#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2990;&#3014;&#3006;&#2996;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2965;&#2975;&#3021;&#2975;&#2995;&#3016;&#2990;&#3009;&#2993;&#3016; &#2958;&#2985; &#2950;&#2997;&#2980;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#3015;&#2994;&#3016;&#2991;&#3015;&#3006;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016;&#2965;&#3021; 
&#2997;&#2965;&#3009;&#2980;&#3021;&#2980; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;(see <a class="xref" href="vc.html#pull-requests" title="Pull requests">the section called &#8220;Pull requests&#8221;</a>). &#2986;&#2994; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; 
&#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;  &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2953;&#2975;&#3021;&#2965;&#3014;&#3006;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2997;&#2970;&#2980;&#3007;&#2965;&#3021;&#2965;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995; &#2970;&#2990;&#2984;&#3007;&#2994;&#3016; &#2990;&#3009;&#2975;&#3007;&#2997;&#3016; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2949;&#2984;&#3021;&#2980; &#2980;&#2965;&#2997;&#2994;&#3021; 
&#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016;&#2991;&#3016; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2965;&#3021;&#2965; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2984;&#3015;&#2992;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007;&#2965;&#3021;&#2965;&#3009; &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2953;&#2980;&#2997;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3021;&#2980;&#3009;.</p><p>&#2949;&#2995;&#2997;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2980;&#3006;&#2985;&#3007;&#2991;&#2965;&#3021;&#2965; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#2994;&#2985;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#2997;&#2985;&#2990;&#3021; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3006;&#2997;&#2980;&#3009;, &#2990;&#2985;&#3007;&#2980; &#2965;&#2997;&#2985;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; 
&#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016; &#2980;&#3006;&#2985;&#3007;&#2991;&#2965;&#3021;&#2965; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;.  &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3021;, &#2949;&#2985;&#3006;&#2994;&#3021; &#2962;&#2992;&#3009; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; 
&#2986;&#2979;&#3007;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#2995;&#2992; &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985;&#2980;&#3009; &#2990;&#2985;&#3007;&#2980;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2949;&#2965;&#3021;&#2965;&#2992;&#3016;&#8212;&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2997;&#3021; &#2949;&#2965;&#3021;&#2965;&#2992;&#3016;&#2991;&#3007;&#2985;&#3021; &#2949;&#2993;&#3007;&#2997;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009;&#8212;.
&#2980;&#3018;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; &#2949;&#2997;&#3021; &#2949;&#2965;&#3021;&#2965;&#2992;&#3016;&#2991;&#3016; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2953;&#2980;&#2997;&#3009;&#2997; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3014; &#2980;&#3015;&#2997;&#3016;.</p></div><div class="sect1" title="&#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2985;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="tools-needed"></a>&#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2985;</h2></div></div></div><p>&#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2965; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2980;&#3009; &#2962;&#2992;&#3009; &#2984;&#3007;&#2994;&#3016;&#2991;&#3006;&#2985; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#3015;&#2994;&#3006;&#2979;&#3021;&#2990;&#3016; &#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3016; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;:</p><div class="variablelist"><dl><dt><span class="term">&#2997;&#2994;&#3016; &#2980;&#2995;&#2990;&#3021;</span></dt><dd><p>&#2986;&#3018;&#2980;&#3009;&#2990;&#2965;&#3021;&#2965;&#2975;&#3021;&#2965;&#3009;&#2992;&#3007;&#2991; &#2990;&#3009;&#2980;&#2985;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985; &#2962;&#2992;&#3009; &#2990;&#3016;&#2991;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2962;&#2992;&#3009;-&#2997;&#2996;&#3007; &#2954;&#2975;&#2965;&#2990;&#3021;.  &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; 
     &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965; &#2951;&#2975;&#3016;&#2990;&#3009;&#2965;&#2990;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#2994;&#3006;&#2990;&#3021;.</p></dd><dt><span class="term">&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;</span></dt><dd><p>&#2997;&#2996;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; &#2990;&#3007;&#2965; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2965; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009; &#2990;&#2985;&#3021;&#2993;&#2990;&#3021;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
       "&#2950;&#2997;&#2979;&#2986;&#3021;&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2954;&#2975;&#2965;&#2990;&#3021;."</p></dd><dt><span class="term">&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2970;&#3006;&#2980;&#2985;&#2990;&#3021;</span></dt><dd><p>&#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#2970;&#2980;&#3007;&#2991;&#3006;&#2965; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2984;&#3007;&#2992;&#3021;&#2997;&#2965;&#3007;&#2965;&#3021;&#2965; &#2953;&#2980;&#2997;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009; , &#2949;&#2980;&#3009;
             &#2986;&#2996;&#3016;&#2991; &#2984;&#3007;&#2994;&#3016;&#2965;&#3021;&#2965;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#3009;&#2997;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; , "&#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2949;&#2985;&#3009;&#2986;&#3021;&#2986;" &#2953;&#2980;&#2997;&#3009;&#2997;&#2980;&#3009; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3016;&#2991;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;,
             &#2949;&#2980;&#3009;&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2985;&#3021;&#2993;&#3007; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3007;&#2994;&#3021; &#2958;&#2985;&#3021;&#2985; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#2975;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; &#2958;&#2985; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965; &#2997;&#2996;&#3007;&#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2992;&#2980;&#3009;.</p></dd><dt><span class="term">&#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;</span></dt><dd><p>&#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3007;&#2994;&#3021; &#2997;&#3015;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2992;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985; &#2965;&#2979;&#3021;&#2965;&#3006;&#2979;&#3007;&#2965;&#3021;&#2965;, 
       &#2962;&#2992;&#3009;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3014;&#3006;&#2992;&#3009;&#2997;&#2992;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2965;&#3021;&#2965;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2975; &#2997;&#2970;&#2980;&#3007;&#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2992;&#2980;&#3009;.  &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2986;&#3007;&#2996;&#3016; &#2984;&#3007;&#2994;&#3016;&#2991;&#3016; 
       &#2997;&#3007;&#2985;&#2997; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; (e.g., &#2990;&#3008;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016; &#2953;&#2979;&#3021;&#2975;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;)  &#2997;&#2970;&#2980;&#3007;&#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2992;&#2980;&#3009;.
      &#2986;&#3007;&#2996;&#3016;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2986;&#2979;&#3007;&#2965;&#2995;&#3021;, &#2986;&#3009;&#2980;&#3007;&#2991; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3007;&#2985;&#3021; &#2965;&#2979;&#3021;&#2965;&#3006;&#2979;&#3007;&#2986;&#3021;&#2986;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
      &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.</p></dd><dt><span class="term">&#2984;&#3007;&#2965;&#2996;&#3021; &#2984;&#3015;&#2992; &#2949;&#2995;&#2997;&#2995;&#3006;&#2997;&#3007;</span></dt><dd><p>&#2997;&#3007;&#2992;&#3016;&#2997;&#3006;&#2985;, &#2951;&#2994;&#2965;&#3009;&#2992;&#2965; &#2997;&#3007;&#2997;&#3006;&#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007; / &#2986;&#2980;&#3007;&#2994;&#3021; &#2986;&#2992;&#3007;&#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985; &#2962;&#2992;&#3009; &#2951;&#2975;&#2990;&#3021;. 
       &#2958;&#2986;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2965;&#3006;&#2986;&#3021;&#2986;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2986;&#2975;&#3009;&#2997;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016;.</p></dd></dl></div><p>&#2951;&#2984;&#3021;&#2980; &#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2962;&#2997;&#3021;&#2997;&#3014;&#3006;&#2992;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2991;&#3009;&#2990;&#3021; &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3006;&#2985; &#2980;&#3015;&#2997;&#3016;&#2991;&#3016; &#2965;&#3009;&#2993;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#3016; &#2953;&#2975;&#3021;&#2970;&#3006;&#2992;&#3021; 
&#2986;&#3009;&#2975;&#3016;&#2991; &#2997;&#3015;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#3016; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2965;&#3021;&#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3021; &#2962;&#2985;&#3021;&#2993;&#3006;&#2965; &#2997;&#3015;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021; &#2984;&#3006;&#2990;&#3021; &#2949;&#2997;&#3016;&#2965;&#2995;&#3021; 
&#2958;&#2986;&#3021;&#2986;&#2975;&#3007; &#2949;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; 
&#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2950;&#2991;&#3021;&#2997;&#3019;&#2990;&#3021;.</p><p>&#2951;&#2984;&#3021;&#2980; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3021; &#2986;&#2994;&#2997;&#2993;&#3021;&#2993;&#3016; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#2994;&#3016;&#2997;&#2994;&#3007;&#2991;&#3016;  &#2980;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; <em class="firstterm">&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;
(canned hosting)</em> &#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3006;&#2990;&#3021;: &#2986;&#2994; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3016; &#2980;&#3019;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009; 
&#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#2995;&#2990;&#3021;.  &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2969;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3006;&#2985; &#2997;&#3007;&#2997;&#3006;&#2980;&#2980;&#3021;&#2980;&#3007;&#2985;&#3016;
<a class="xref" href="web-site.html#canned-hosting" title="&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;">the section called &#8220;&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;&#8221;</a><span>
&#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;</span> 

.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a id="ftn.idp6135168" href="#idp6135168" class="para">25</a>] </sup>&#2949;&#2997;&#2992;&#2980;&#3009; &#2951;&#2984;&#3021;&#2980; &#2986;&#3009;&#2980;&#3021;&#2980;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; <em class="citetitle">The Mythical Man-Month
</em>, 1975.  See 
<a class="ulink" href="http://en.wikipedia.org/wiki/The_Mythical_Man-Month" target="_top">
en.wikipedia.org/wiki/The_Mythical_Man-Month</a>, 
<a class="ulink" href="http://en.wikipedia.org/wiki/Brooks_Law" target="_top">
en.wikipedia.org/wiki/Brooks_Law</a>, and
<a class="ulink" href="http://en.wikipedia.org/wiki/Fred_Brooks" target="_top">
en.wikipedia.org/wiki/Fred_Brooks</a>.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="announcing.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="web-site.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">&#2949;&#2993;&#3007;&#2997;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;</td></tr></table></div></body></html>
