<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="money.html" title="Chapter 5. Money"><link rel="prev" href="money.html" title="Chapter 5. Money"><link rel="next" href="long-term-developers.html" title="Hire for the Long Term"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="money.html">Prev</a> </td><th width="60%" align="center">Chapter 5. Money</th><td width="20%" align="right"> <a accesskey="n" href="long-term-developers.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="types-of-involvement"></a>&#2986;&#3014;&#2992;&#3009;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3021;&#2975;&#3007;&#2985;&#3021; &#2997;&#2965;&#3016;&#2965;&#2995;&#3021;</h2></div></div></div><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2984;&#3007;&#2980;&#3007;&#2991;&#3009;&#2980;&#2997;&#3007; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965; &#2986;&#2994; &#2965;&#3006;&#2992;&#2979;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;. &#2951;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2953;&#2992;&#3009;&#2986;&#3021;&#2986;&#2975;&#3007;&#2965;&#2995;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2985;&#3021;&#2993;&#3009; &#2997;&#3007;&#2994;&#2965;&#3021;&#2965;&#3006;&#2985;&#2997;&#3016;&#2991;&#2994;&#3021;&#2994;. &#2965;&#3008;&#2996;&#3021;&#2965;&#2979;&#3021;&#2975; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3007;&#2980;&#3007;&#2991;&#3006;&#2980;&#3006;&#2992;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;:</p><div class="variablelist"><dl><dt><span class="term">&#2970;&#3009;&#2990;&#3016;&#2991;&#3016; &#2986;&#2965;&#3007;&#2992;&#3021;&#2980;&#2994;&#3021;</span></dt><dd><p>&#2962;&#2980;&#3021;&#2980; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016;&#2991;&#3009;&#2995;&#3021;&#2995; &#2980;&#2985;&#3007;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3009;&#2990;&#3021; &#2962;&#2992;&#3015; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3006;&#2985; &#2984;&#3007;&#2992;&#2994;&#3016; &#2970;&#3018;&#2984;&#3021;&#2980;&#2990;&#3006;&#2965; &#2958;&#2996;&#3009;&#2980;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2997;&#2979;&#3007;&#2965;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2962;&#2992;&#3015; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2991;&#3006;&#2985; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3016; &#2997;&#3006;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#2980;&#3009; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2997;&#3008;&#2979;&#3006;&#2997;&#2980;&#3006;&#2965; &#2953;&#2979;&#2992;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2997;&#3021;&#2997;&#3006;&#2993;&#3009; &#2953;&#2979;&#2992;&#3009;&#2990;&#3021;&#2986;&#3019;&#2980;&#3009;, &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2980;&#2969;&#3021;&#2965;&#2995;&#2980;&#3009; &#2997;&#2995;&#2969;&#3021;&#2965;&#2995;&#3016; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#3021;&#2965;&#3015;&#2993;&#3021;&#2993; &#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2949;&#2994;&#3021;&#2994;&#2980;&#3009;, &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2949;&#2986;&#3021;&#2986;&#2975;&#3007;&#2991;&#3018;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2949;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2951;&#2979;&#3016;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;&#2992;&#3021;. &#2951;&#2980;&#2985;&#3006;&#2994;&#3021; &#2997;&#3007;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2997;&#3014;&#2995;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3006;&#2985; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#2995;&#3021;: &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009; &#2950;&#2965;&#3009;&#2990;&#3021; &#2970;&#3014;&#2994;&#2997;&#3009; &#2986;&#2965;&#3007;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;&#2965;&#3018;&#2995;&#3021;&#2995;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;, &#2949;&#2980;&#2985;&#3021; &#2986;&#2991;&#2985;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2953;&#2992;&#3007;&#2991;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2970;&#3021;&#2970;&#3010;&#2996;&#2994;&#3021; &#2994;&#3006;&#2986;&#2984;&#3019;&#2965;&#3021;&#2965;&#2993;&#3021;&#2993; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2985;&#2980;&#3006;&#2991;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2951;&#2994;&#3006;&#2986;&#2984;&#3019;&#2965;&#3021;&#2965;&#3009;&#2995;&#3021;&#2995; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2951;&#2980;&#3009; &#2986;&#3018;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;.</p><p>&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3021;: <a class="ulink" href="http://www.openadapter.org/" target="_top">openadapter.org</a>,
                    <a class="ulink" href="http://www.koha.org/" target="_top">koha.org</a></p></dd><dt><span class="term">&#2970;&#3015;&#2997;&#3016;&#2965;&#2995;&#3016;&#2986;&#3021; &#2986;&#3014;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2980;&#2994;&#3021;</span></dt><dd><p>&#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3016;&#2970;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;, &#2962;&#2992;&#3009; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2984;&#3007;&#2980;&#3007; &#2952;&#2975;&#3021;&#2975;&#3007;&#2980;&#3021;&#2980;&#2992;&#3009;&#2990;&#3021; &#2970;&#3015;&#2997;&#3016;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3006;&#2991;&#3007;&#2985;&#3021;, &#2951;&#2991;&#2994;&#3021;&#2986;&#3006;&#2965;&#2997;&#3015;, &#2949;&#2984;&#3021;&#2980; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3016; &#2980;&#3018;&#2975;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021; &#2949;&#2984;&#3021;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;.</p><p>&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;: <a class="ulink" href="http://www.collab.net/" target="_top">CollabNet's</a> support of
                    <a class="ulink" href="http://subversion.apache.org/" target="_top">&#2970;&#2986;&#3021;&#2997;&#3014;&#2992;&#3021;&#2970;&#2985;&#3021;</a>
                    (&#2986;&#3018;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009;&#2980;&#3009;&#2993;&#2986;&#3021;&#2986;&#3009;: &#2984;&#3006;&#2985;&#3021; &#2965;&#3018;&#2994;&#3006;&#2986;&#3021;&#2984;&#3014;&#2975;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3006;&#2985;&#3021; &#2951;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2979;&#3007;&#2991;&#3006;&#2993;&#3021;&#2993;&#3007;&#2991;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#3015;&#2985;&#3021;. &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3009;&#2990;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2997;&#2965;&#3016;&#2965;&#3021;&#2965;&#3009; &#2951;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2962;&#2992;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965;&#3009;&#2990;&#3021;)</p></dd><dt><span class="term">&#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#3007;&#2993;&#3021;&#2986;&#2985;&#3016;&#2965;&#3021;&#2965;&#3009; &#2950;&#2980;&#2992;&#2997;&#2995;&#3007;&#2980;&#3021;&#2980;&#2994;&#3021;</span></dt><dd><p>&#2965;&#2979;&#3007;&#2985;&#3007;&#2991;&#3007;&#2985;&#3021; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021;, &#2949;&#2980;&#2985;&#3021; &#2986;&#3006;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2990;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2993;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2958;&#2979;&#3021;&#2979;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#3021;&#2965;&#3009; &#2984;&#3015;&#2992;&#3021;&#2997;&#3007;&#2965;&#3007;&#2980;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#2979;&#3007;&#2965;&#2992;&#3021;&#2965;&#2995;&#3021; &#8212; &#2990;&#3009;&#2996;&#3009;&#2965;&#3021;&#2965;&#2979;&#3007;&#2985;&#3007; &#2997;&#3007;&#2993;&#3021;&#2986;&#2985;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#2994;&#3021;&#2994;&#3006;&#2980;&#3009;, &#2984;&#3009;&#2979;&#3021;&#2970;&#3007;&#2994;&#3021;&#2994;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3007;&#2993; &#2970;&#3006;&#2980;&#2985;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#8212; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007;&#2991;, &#2953;&#2991;&#2992;&#3021;&#2980;&#2992; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3009;&#2965;&#2992;&#3021;&#2997;&#3019;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985;&#2980;&#3009; &#2958;&#2985; &#2965;&#2979;&#3021;&#2975;&#2993;&#3007;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021;.</p></dd><dt><span class="term">&#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2991;&#3006;&#2995;&#2992;&#3007;&#2985;&#3021; &#2997;&#2994;&#3009;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2993;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021;</span></dt><dd><p>&#2970;&#3007;&#2994;&#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#2985;&#2980;&#3009; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2991;&#3006;&#2995;&#2992;&#3007;&#2985;&#3021;, &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#3016; &#2986;&#3014;&#2993;&#3021;&#2993;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2997;&#2994;&#3009;&#2997;&#3007;&#2996;&#2965;&#3021;&#2965;&#2970;&#3021;&#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3015;, &#2986;&#2994; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;, &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2950;&#2980;&#2992;&#3007;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965;, &#2951;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2962;&#2992;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2952;&#2975;&#3009;&#2986;&#2975;&#2965;&#3021;&#2965;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2951;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2965;&#3006;&#2992;&#2979;&#3007;&#2991;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;: <a class="ulink" href="http://www.openoffice.org/" target="_top">openoffice.org</a> (&#2980;&#2993;&#3021;&#2970;&#2990;&#2991;&#2990;&#3021;, &#2951;&#2980;&#3009; &#2962;&#2992;&#3009; &#2970;&#2992;&#3007;&#2980;&#3021;&#2980;&#3007;&#2992; &#2992;&#3008;&#2980;&#3007;&#2991;&#3007;&#2994;&#3006;&#2985; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;. &#2963;&#2986;&#2985;&#3021;&#2950;&#2986;&#3007;&#3000;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016;&#2980;&#3021; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#3007;&#2991; &#2970;&#2985;&#3021; &#2990;&#3016;&#2965;&#3021;&#2992;&#3019;&#2970;&#3007;&#3000;&#3021;&#2975;&#2990;&#3021;&#3000;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3016;, &#2950;&#2992;&#2965;&#3021;&#2965;&#3007;&#2995;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2997;&#3007;&#2994;&#3016;&#2965;&#3021;&#2965;&#3009; &#2997;&#3006;&#2969;&#3021;&#2965;&#3007;&#2991;&#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021;, &#2963;&#2986;&#2985;&#3021;&#2950;&#2986;&#3007;&#3000;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965; &#2953;&#2980;&#3021;&#2997;&#3015;&#2965;&#2990;&#3021;, &#2949;&#2980;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2986;&#3007;&#2993;&#2984;&#3021;&#2980; &#2994;&#3007;&#2986;&#3021;&#2992;&#3015;&#2950;&#2986;&#3007;&#3000;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2970;&#3014;&#2985;&#3021;&#2993;&#2980;&#3009;. &#2990;&#3016;&#2965;&#3021;&#2992;&#3019;&#2970;&#3006;&#2986;&#3021;&#2975;&#3021; &#2950;&#2986;&#3007;&#3000;&#3021; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3007;&#2985;&#3021; &#2997;&#2994;&#3009;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2993;&#3016;&#2986;&#3021;&#2986;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015;, &#2970;&#2985;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2963;&#2986;&#2985;&#3021;&#2950;&#2986;&#3007;&#3000;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2980;&#3009;&#2997;&#2965;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3009; &#2962;&#2992;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2965;&#3006;&#2992;&#2979;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2990;&#2993;&#3009;&#2965;&#3021;&#2965;&#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;. &#2951;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021; &#2994;&#3007;&#2986;&#3021;&#2992;&#3015;&#2950;&#2986;&#3007;&#3000;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2990;&#3016;&#2965;&#3021;&#2992;&#3019;&#2970;&#3006;&#2986;&#3021;&#2975;&#3021; &#2950;&#2986;&#3007;&#3000;&#3007;&#2993;&#3021;&#2965;&#3009; &#2997;&#2994;&#3009;&#2997;&#3006;&#2985; &#2986;&#3019;&#2975;&#3021;&#2975;&#3007;&#2991;&#3006;&#2995;&#2992;&#3006;&#2965; &#2980;&#3007;&#2965;&#2996;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;).</p></dd><dt><span class="term">&#2997;&#3007;&#2995;&#2990;&#3021;&#2986;&#2992;&#2990;&#3021;</span></dt><dd><p>&#2962;&#2992;&#3009; &#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009;&#2975;&#2985;&#3021; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009;&#2975;&#3016;&#2991; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2984;&#2994;&#3021;&#2994; &#2997;&#3007;&#2995;&#2990;&#3021;&#2986;&#2992;&#2990;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;.</p></dd><dt><span class="term">&#2951;&#2992;&#2975;&#3021;&#2975;&#3016; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021;</span></dt><dd><p><em class="firstterm">&#2951;&#2992;&#2975;&#3021;&#2975;&#3016; &#2953;&#2992;&#3007;&#2990;&#2990;&#3021;</em> &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#2996;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3009;&#2995;&#3021; &#2962;&#2985;&#3021;&#2993;&#3006;&#2965;&#3009;&#2990;&#3021;. &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3019;&#2975;&#3009;, &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3016; &#2951;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#3007;&#2993;&#3021;&#2986;&#2985;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#3019;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#3006;&#2992;&#2990;&#3021;&#2986;&#2992;&#3007;&#2991; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3009;&#2990;&#3021;, &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2997;&#3007;&#2980;&#3007;&#2990;&#3009;&#2993;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3007;&#2979;&#2969;&#3021;&#2965; (see
                    <a class="xref" href="dual-licensing.html" title="Dual Licensing Schemes">the section called &#8220;Dual Licensing Schemes&#8221;</a><span> in
                        <a class="xref" href="legal.html" title="Chapter 10. Licenses, Copyrights, and Patents">Chapter 10, <i>Licenses, Copyrights, and Patents</i></a></span>) &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3007;&#2996;&#3016;&#2997;&#3019;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009; &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2953;&#2992;&#3007;&#2990;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2965;&#3008;&#2996;&#3009;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. &#2965;&#2975;&#3021;&#2975;&#2993;&#3021;&#2993; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#3009;&#2984;&#2992;&#3021; &#2970;&#2990;&#3010;&#2965;&#2990;&#3021; &#2970;&#3009;&#2993;&#3009;&#2970;&#3009;&#2993;&#3009;&#2986;&#3021;&#2986;&#3009;&#2975;&#2985;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;&#2986;&#3021; &#2986;&#2992;&#2984;&#3021;&#2980; &#2997;&#2996;&#3009;&#2984;&#3008;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#2994;&#2985;&#3021; &#2965;&#3007;&#2975;&#3021;&#2975;&#3009;&#2997;&#2980;&#3019;&#2975;&#3009;, &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2980;&#2985;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2953;&#2992;&#3007;&#2990;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2986;&#2969;&#3021;&#2965;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3009;&#2996;&#3009;&#2984;&#3015;&#2992; &#2984;&#3007;&#2992;&#2994;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2954;&#2980;&#3007;&#2991;&#2990;&#2995;&#3007;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2965;&#3007;&#2993;&#2980;&#3009;.</p><p>&#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3009;&#2965;&#2995;&#3021;: <a class="ulink" href="http://www.mysql.com/" target="_top">&#2990;&#3016; &#2958;&#3000;&#3021;.&#2965;&#3007;&#2991;&#3010;.&#2958;&#2994;&#3021;</a>, &#2990;&#3016; &#2958;&#3000;&#3021;.&#2965;&#3007;&#2991;&#3010;.&#2958;&#2994;&#3021; &#2958;&#2985;&#3021;&#2993; &#2986;&#3014;&#2991;&#2992;&#3007;&#2994;&#3021; &#2980;&#2992;&#2997;&#3009;&#2980;&#2995; &#2990;&#3014;&#2985;&#3021;&#2986;&#3018;&#2992;&#3009;&#2995;&#3021; &#2980;&#2991;&#3006;&#2992;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021;. <a class="ulink" href="http://www.sleepycat.com/" target="_top">&#3000;&#3021;&#2994;&#3008;&#2986;&#3007;&#2965;&#3015;&#2975;&#3021;</a> - &#2951;&#2984;&#3021;&#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2990;&#3021; &#2986;&#3014;&#2992;&#3021;&#2965;&#3021;&#2994;&#3007; &#2980;&#2992;&#2997;&#3009;&#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2997;&#3007;&#2984;&#3007;&#2991;&#3019;&#2965;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2997;&#3021;&#2997;&#3007;&#2992;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2980;&#2992;&#2997;&#3009;&#2980;&#2995; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2980;&#2993;&#3021;&#2970;&#3014;&#2991;&#2994;&#3006;&#2985;&#2980;&#2994;&#3021;&#2994;. &#2980;&#2992;&#2997;&#3009;&#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3007;&#2993; &#2986;&#2991;&#2985;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3009;&#2975;&#2985;&#3021; &#2951;&#2979;&#3016;&#2984;&#3021;&#2980;&#3015; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2997;&#3007;&#2993;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;. &#2958;&#2985;&#2997;&#3015;, &#2951;&#2992;&#2975;&#3021;&#2975;&#3016; &#2953;&#2992;&#3007;&#2990; &#2990;&#3006;&#2980;&#3007;&#2992;&#3007;&#2965;&#3021;&#2965;&#3009; &#2951;&#2980;&#3009; &#2953;&#2965;&#2984;&#3021;&#2980;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;.</p></dd><dt><span class="term">&#2984;&#2985;&#3021;&#2965;&#3018;&#2975;&#3016;&#2965;&#2995;&#3021;</span></dt><dd><p>&#2986;&#2992;&#2997;&#2994;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2970;&#3007;&#2994;&#2970;&#2990;&#2991;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#2985;&#3007;&#2984;&#2986;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;, &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965; &#2949;&#2995;&#2997;&#3009; &#2984;&#3007;&#2980;&#3007; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2951;&#2979;&#3016;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2984;&#2985;&#3021;&#2965;&#3018;&#2975;&#3016; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3006;&#2985; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3009;&#2990;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2980;&#3021;&#2980;&#3007;&#2992;&#3016;&#2991;&#3007;&#2975;&#3021;&#2975; &#2986;&#3018;&#2992;&#3009;&#2975;&#3021;&#2965;&#2995;&#3016; &#2997;&#3007;&#2993;&#3021;&#2986;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3009;&#2990;&#3021; &#2951;&#2984;&#3021;&#2984;&#3007;&#2980;&#3007;&#2991;&#3016;&#2986;&#3021;&#2986;&#3014;&#2993;&#2994;&#3006;&#2990;&#3021;. &#2962;&#2992;&#3009; &#2958;&#2970;&#3021;&#2970;&#2992;&#3007;&#2965;&#3021;&#2965;&#3016;: &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2984;&#2985;&#3021;&#2965;&#3018;&#2975;&#3016;&#2965;&#2995;&#3016; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3016; &#2958;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; <span class="emphasis"><em>&#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965;&#2997;&#3015;</em></span> &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3007;&#2975;&#3021;&#2975;&#3009;, &#2997;&#2994;&#3016;&#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2986;&#2979;&#2990;&#3021; &#2997;&#2992;&#3009;&#2997;&#2980;&#2993;&#3021;&#2965;&#3009; &#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965;&#2997;&#3015;, &#2986;&#2979;&#2980;&#3021;&#2980;&#3016; &#2958;&#2980;&#2993;&#3021;&#2965;&#3006;&#2965;, &#2958;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; &#2970;&#3014;&#2994;&#2997;&#2996;&#3007;&#2965;&#3021;&#2965;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3009; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965;&#3007;&#2993;&#2980;&#3009;. &#2962;&#2992;&#3009;&#2997;&#3015;&#2995;&#3016; &#2950;&#2975;&#3021;&#2970;&#3015;&#2986;&#2979;&#3016; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3016; &#2990;&#3009;&#2985;&#3021;&#2985;&#2980;&#3006;&#2965;&#2997;&#3015; &#2949;&#2993;&#3007;&#2997;&#2980;&#3009; &#2984;&#2994;&#3021;&#2994;&#2980;&#3009;.</p></dd></dl></div><p>A funder's business model is not the only factor in how it
relates to an open source community.  The historical relationship
between the two also matters: did the company start the project, or is
it joining an existing development effort?  In both cases, the funder
will have to earn credibility, but, not surprisingly, there's a bit
more earning to be done in the latter case.  The organization needs to
have clear goals with respect to the project.  Is the company trying
to keep a position of leadership, or simply trying to be one voice in
the community, to guide but not necessarily govern the project's
direction?  Or does it just want to have a couple of committers
around, able to fix customers' bugs and get the changes into the
public distribution without any fuss?</p><p>Keep these questions in mind as you read the guidelines that
follow.  They are meant to apply to any sort of organizational
involvement in a free software project, but every project is a human
environment, and therefore no two are exactly alike.  To some degree,
you will always have to play by ear, but following these principles
will increase the likelihood of things turning out the way you
want.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="money.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="money.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="long-term-developers.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 5. Money </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Hire for the Long Term</td></tr></table></div></body></html>
