<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;</title><link rel="stylesheet" type="text/css" href="styles.css"><meta name="generator" content="DocBook XSL Stylesheets V1.76.1"><link rel="home" href="index.html" title="Producing Open Source Software"><link rel="up" href="technical-infrastructure.html" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><link rel="prev" href="technical-infrastructure.html" title="Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;"><link rel="next" href="message-forums.html" title="&#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="technical-infrastructure.html">Prev</a> </td><th width="60%" align="center">Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;</th><td width="20%" align="right"> <a accesskey="n" href="message-forums.html">Next</a></td></tr></table><hr></div><div class="sect1" title="&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="web-site"></a>&#2997;&#2994;&#3016;&#2980;&#3021; &#2980;&#2995;&#2990;&#3021;</h2></div></div></div><p><span class="emphasis"><em>possv2 24 March 2013: If you're reading this note, then
you've encountered this chapter while it's undergoing substantial
revision; see <a class="ulink" href="http://producingoss.com/v2.html" target="_top">producingoss.com/v2.html</a> for details.</em></span></p><p>&#2984;&#2990;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965;,<span class="emphasis"><em>&#2951;&#2979;&#3016;&#2991; &#2980;&#2995;&#2990;&#3021;</em></span> &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2953;&#2980;&#2997;&#3007;&#2965;&#3021;&#2965;&#3006;&#2965; 
&#2949;&#2992;&#3021;&#2986;&#3021;&#2986;&#2979;&#3007;&#2980;&#3021;&#2980; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2950;&#2997;&#2979;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#3015;&#3006;&#2985;&#3021;&#2993;&#2997;&#3016; &#2965;&#3019;&#2985;&#3021;&#2975; &#2997;&#2994;&#3016; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021;.  
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; &#2951;&#2980;&#3009;  &#2986;&#2991;&#2985;&#2992;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2965;&#3014;&#3006;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2951;&#2979;&#3016;&#2991; &#2980;&#2995; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2990;&#3006;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#2980;&#3009;.  &#2986;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; 
(&#2986;&#3009;&#2995;&#3021;&#2995;&#3007;&#2991;&#3007;&#2991;&#2994;&#3021; &#2986;&#2975;&#3007;) &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021;  &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2951;&#2975;&#2990;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009;&#2986;&#2975;&#3021;&#2975;&#2980;&#3015;&#2997;&#3016; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3007;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2970;&#2990;&#3006;&#2985; &#2990;&#2985;&#2984;&#3007;&#2994;&#3016;
 &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#2992;&#3021;.  &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2991;&#2985;&#3009;&#2995;&#3021;&#2995;&#2980;&#3006;&#2985; &#2997;&#2994;&#3016;&#2986;&#3021; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2953;&#2980;&#2997;&#3009;&#2997;&#2980;&#3006;&#2965; &#2949;&#2990;&#3016;&#2991; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021; 
&#2951;&#2994;&#3021;&#2994;&#3016; &#8212; &#2997;&#2994;&#3016; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2970;&#3007;&#2994; &#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2986;&#3021;&#2986;&#3009; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3016; &#2965;&#3006;&#2986;&#3021;&#2986;&#3006;&#2993;&#3021;&#2993;  
"&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#3014;&#3006;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; &#2963;&#2992;&#3021; &#2949;&#2995;&#2997;&#3016;&#2965;&#3018;&#2979;&#3021;&#2975;"  &#2962;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2994;&#3021; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;; &#2949;&#2980;&#3009; &#2958;&#2997;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2953;&#2980;&#2997;&#3006;&#2980; &#2962;&#2992;&#3009; 
&#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#3019;&#2991;&#3021; &#2984;&#3007;&#2993;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2986;&#2979;&#3021;&#2986;&#3009; &#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965; &#2965;&#2994;&#2984;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2949;&#2980;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#2979;&#3021;&#2986;&#3009; &#2980;&#3006;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3021;, 
&#2958;&#2969;&#3021;&#2965;&#3006;&#2997;&#2980;&#3009; &#2962;&#2992;&#3009; &#2990;&#3010;&#2994;&#3016;&#2991;&#3007;&#2994;&#3021; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#2995;&#2980;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2985; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3016; &#2997;&#2996;&#3007; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2965;&#3006;&#2992;&#2985;&#2990;&#3021; 
&#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3009;&#2980;&#3007;&#2991; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2965;&#3014;&#3006;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3014;&#3006;&#2975;&#2969;&#3021;&#2965;&#3007; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; &#2980;&#3015;&#2975;&#3009;&#2997;&#3006;&#3021;&#2965;&#2995;&#3021;.</p><p>&#2962;&#2992;&#3009; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3021;, &#2951;&#2984;&#3021;&#2980; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2985; &#2997;&#3007;&#2995;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975;&#3009;&#2990;&#3021;.  &#2984;&#2997;&#2990;&#3021;&#2986;&#2992;&#3021; 2013 &#2949;&#2985;&#3021;&#2993;&#3009; &#2951;&#2984;&#3021;&#2980;&#3016; &#2958;&#2996;&#3009;&#2980;&#3021;&#2980;&#3009; &#2986;&#3015;&#3006;&#2980;&#3009;, &#2949;&#2994;&#3009;&#2997;&#2994;&#2965; &#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; 
LibreOffice &#2949;&#2980;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2986;&#2991;&#2985;&#2992;&#3021; &#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980; &#2997;&#2994;&#3016; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009; 
<a class="ulink" href="https://libreoffice.org/" target="_top">libreoffice.org</a> 
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3007;&#2993;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009;.  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2986;&#2991;&#2985;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;
LibreOffice &#2986;&#2980;&#3007;&#2997;&#3007;&#2993;&#2965;&#3021;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2984;&#3007;&#2993;&#3009;&#2997; , &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3015;&#2992;&#3006;&#2965; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; " &#2986;&#2980;&#3007;&#2997;&#3007;&#2993;&#2965;&#3021;&#2965; " &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3015;&#2992;&#3021;&#2997;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2950;&#2985;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; 
(&#2953;&#2980;&#3006;&#2992;&#2979;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;) &#2962;&#2992;&#3009; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3006;&#2965; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;,   &#2962;&#2992;&#3009; &#2986;&#3007;&#2996;&#3016; &#2970;&#2992;&#3007;&#2970;&#3014;&#2991;&#3021;&#2991; &#2950;&#2992;&#3021;&#2997;&#2990;&#3021; &#2965;&#3019;&#2979;&#3021;&#2975;&#3006;&#2994;&#3021;&#2984;&#3015;&#2992;&#3006;&#2965; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; 
<a class="ulink" href="https://libreoffice.org/" target="_top">libreoffice.org</a> &#2970;&#3014;&#2985;&#3021;&#2993;&#3009; 
<span class="emphasis"><em>&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#2975;&#2994;&#3021;</em></span> " &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;"  &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; " &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; "  &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
" &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965;"  &#8212; &#2997;&#3015;&#2993;&#3009; &#2997;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3016;&#2965;&#2995;&#3007;&#2994;&#3021;,  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2984;&#3009;&#2996;&#3016;&#2997;&#3006;&#2991;&#3007;&#2994;&#3021; &#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3016; &#2980;&#3015;&#2975;&#3009;&#2997;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;.</p><p>LibreOffice-&#2960; &#2986;&#3019;&#2985;&#3021;&#2993; &#2997;&#3015;&#2993;&#3009; &#2970;&#3007;&#2994; &#2986;&#3014;&#2992;&#3007;&#2991; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3018;&#2979;&#3021;&#2975;&#3006;&#2994;&#3021;,
&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2962;&#2985;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#3015;&#2993;&#3021;&#2986;&#2975;&#3021;&#2975; &#2984;&#3009;&#2996;&#3016;&#2997;&#3006;&#2991;&#3007;&#2994;&#3021;&#2965;&#2995;&#3021; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;. 
<a class="ulink" href="https://www.libreoffice.org/get-involved/" target="_top">"&#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965;"</a>&#2958;&#2985;&#3021;&#2993;&#3009; &#2965;&#3010;&#2993;&#3009;&#2965;&#3007;&#2993; &#2962;&#2992;&#3009; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;  &#2949;&#2980;&#3015; &#2986;&#3019;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3018;&#2985;&#3021;&#2993;&#3009;  
<a class="ulink" href="https://www.libreoffice.org/developers/" target="_top">"&#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;"
</a>&#2958;&#2985;&#3021;&#2993;&#3009; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.  "&#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965;" &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3021;&#2965;&#2990;&#3021; &#2990;&#3007;&#2965;&#2986;&#3021; &#2986;&#2992;&#2984;&#3021;&#2980; &#2949;&#2995;&#2997;&#3007;&#2994;&#3021; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3006;&#2985; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016; &#2958;&#2980;&#3007;&#2992;&#3021; &#2984;&#3015;&#3006;&#2965;&#3021;&#2965;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;: 
&#2949;&#2980;&#3009; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2984;&#3019;&#2965;&#3021;&#2965;&#3007;&#2991;&#2980;&#3009;, &#2949;&#2980;&#3015; &#2970;&#2990;&#2991;&#2990;&#3021; &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2950;&#2997;&#2979;&#2986;&#3021; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3006;&#2970;&#3007;&#2992;&#3007;&#2991;&#2992;&#3021;&#2965;&#2995;&#3021;, 
&#2980;&#2992;&#2990;&#3021; &#2953;&#2980;&#3021;&#2980;&#2992;&#2997;&#3006;&#2980;&#2990;&#3021; &#2970;&#3015;&#3006;&#2980;&#3007;&#2986;&#3021;&#2986;&#3019;&#2992;&#3021; , &#2970;&#2984;&#3021;&#2980;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2950;&#2992;&#3021;&#2997;&#2990;&#3007;&#2965;&#3021;&#2965;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2997;&#2994;&#3016; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2950;&#2992;&#3021;&#2997;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2984;&#3007;&#2980;&#3007; 
&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2984;&#3007;&#2980;&#3007;-&#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2984;&#2985;&#3021;&#2965;&#3014;&#3006;&#2975;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2951;&#2975;&#3016;&#2990;&#3009;&#2965;&#2990;&#3021; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2950;&#2980;&#2992;&#2997;&#3009; &#2990;&#2985;&#3021;&#2993; &#2986;&#2969;&#3021;&#2965;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2986;&#3015;&#3006;&#2985;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021; &#2984;&#3015;&#3006;&#2965;&#3021;&#2965;&#3007; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;. &#2949;&#2980;&#3009; "&#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;" &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3016; LibreOffice &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3016; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2965;&#2979;&#3007;&#2985;&#3007; &#2984;&#3007;&#2992;&#2994;&#3006;&#2965;&#3021;&#2965;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2958;&#2985;&#3021;&#2993; &#2965;&#3009;&#2992;&#3009;&#2965;&#3007;&#2991; &#2970;&#2986;&#3016;&#2991;&#3019;&#2992;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2965;&#2997;&#2985;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3018;&#2994;&#3021;&#2994; &#2997;&#3007;&#2975;&#3009;&#2997;&#3007;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.  &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3021; &#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#2986;&#3021;&#2975;&#3021;&#2975;&#3009;&#2994;&#3021;&#2994; &#2965;&#3009;&#2993;&#3009;&#2965;&#3007;&#2991;
&#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2992;&#3009; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2990;&#3007;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2970;&#3009;&#2992;&#3009;&#2965;&#3021;&#2965;&#2990;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2985; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;:
&#2986;&#3006;&#3021;&#2980;&#3021;&#2980; &#2953;&#2975;&#2985;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2969;&#3021;&#2965;&#3009; &#2953;&#2995;&#3021;&#2995;&#3007;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#3007;&#2985;&#3021; &#2958;&#2969;&#3021;&#2965;&#3009; &#2970;&#3014;&#2994;&#3021;&#2994; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; &#2953;&#2975;&#2985;&#3021; 
&#2986;&#3009;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2965;&#3014;&#3006;&#2995;&#3021;&#2995; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;.  "&#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021;" &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2958;&#2969;&#3021;&#2965;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; &#2965;&#3007;&#2975;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993; &#2980;&#2965;&#2997;&#2994;&#3021; &#2965;&#3014;&#3006;&#2975;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;,
&#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2980;&#3018;&#2975;&#2992;&#3021;&#2986;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;, &#2958;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2986;&#3007;&#2996;&#3016;&#2986;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2962;&#2980;&#3021;&#2980;
&#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3021; &#2980;&#2992;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2990;&#3007;&#2965; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2965; &#2980;&#3008;&#2997;&#3007;&#2992;&#2990;&#3006;&#2965; &#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009; &#2997;&#2992;&#3009;&#2990;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; <span class="emphasis"><em>
&#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3006;&#2985;</em></span>  &#2984;&#3009;&#2996;&#3016;&#2997;&#3006;&#2991;&#3007;&#2994;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; &#2949;&#2985;&#3009;&#2986;&#2997;&#2990;&#3009;&#2995;&#3021;&#2995; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2965;&#2992;&#3009;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; 
wiki-&#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3016; <a class="ulink" href="http://wiki.documentfoundation.org/Development" target="_top">wiki.documentfoundation.org/Development</a> &#2965;&#3014;&#3006;&#2975;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;.</p><p>&#2951;&#2980;&#3009; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2986;&#3007;&#2992;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2965;&#3021;&#2965;&#3007;&#2993;&#2980;&#3009;, &#2962;&#2985;&#3021;&#2993;&#3009; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2980;&#2992;&#3009;&#2997;&#3019;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2990;&#2993;&#3021;&#2993;&#2980;&#3009; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3009; 
&#2965;&#2997;&#2985;&#2990;&#3021; &#2970;&#2994;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3019;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;, &#2951;&#2986;&#3021;&#2986;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009; LibreOffice &#2986;&#3019;&#2985;&#3021;&#2993; &#2986;&#2985;&#3021;&#2990;&#3009;&#2965; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985;&#2980;&#3009;. &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2951;&#2984;&#3021;&#2980; &#2986;&#3007;&#2992;&#3007;&#2997;&#3009; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006; &#2958;&#2985; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;; &#2986;&#2980;&#3009;&#2997;&#3006;&#2965; &#2980;&#3018;&#2975;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2980;&#3009; &#2980;&#3015;&#2997;&#3016; &#2951;&#2985;&#3021;&#2993;&#3007; 
&#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.  &#2950;&#2992;&#2990;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2986;&#2969;&#3021;&#2965;&#2995;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2980;&#2992;&#3009;&#2997;&#3019;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2953;&#2995;&#3021;&#2995; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3016; &#2959;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2949;&#2980;&#3009; &#2997;&#2996;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009;
&#2986;&#2992;&#3006;&#2990;&#2992;&#3007;&#2965;&#3021;&#2965; &#2951;&#2991;&#2994;&#3006;&#2990;&#2994;&#3021;  &#8212; &#2953;&#2969;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993; &#2984;&#3008;&#2979;&#3021;&#2975; &#2965;&#3006;&#2994; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2951;&#2991;&#2993;&#3021;&#2965;&#3016;&#2991;&#3006;&#2965;&#2997;&#3015;
&#2949;&#2993;&#3007;&#2990;&#3009;&#2965;&#2990;&#3006;&#2965;&#3007; &#2953;&#2995;&#3021;&#2995; &#2986;&#2994;&#2997;&#3008;&#2985;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#2993;&#3021;&#2993;&#3007; &#2986;&#3009;&#2965;&#3006;&#2992;&#3021;&#2965;&#2995;&#3016; &#2965;&#2997;&#2985;&#2990;&#3006;&#2965; &#2965;&#3015;&#2975;&#3021;&#2965;! &#8212; &#2950;&#2985; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2970;&#2984;&#3021;&#2980;&#2992;&#3021;&#2986;&#3021;&#2986;&#2990;&#3021;
&#2970;&#3006;&#2992;&#3021;&#2984;&#3021;&#2980;&#3009; &#2986;&#3007;&#2992;&#3007;&#2980;&#3021;&#2980;&#3009; &#2965;&#3018;&#2995;&#3021;&#2995;&#2995;&#3006;&#2990;&#3021;.</p><p>&#2980;&#3007;&#2975;&#3021;&#2975; &#2997;&#2994;&#3016; &#2980;&#2995;&#2990;&#3021; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965; &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2965;&#3010;&#2992; &#2949;&#2980;&#3007;&#2965;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;.  &#2962;&#2992;&#3009; &#2997;&#2994;&#3016; &#2997;&#2995;&#2969;&#3021;&#2965;&#3007; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2980;&#3021;&#2980;&#2994;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
&#2997;&#2994;&#3016; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3016; &#2958;&#2996;&#3009;&#2980;&#3009;&#2980;&#2994;&#3021; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2958;&#2995;&#3007;&#2990;&#3016;&#2991;&#3006;&#2985; &#2986;&#2979;&#3007;&#2965;&#2995;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3008;&#2992;&#2990;&#3016;&#2986;&#3021;&#2986; &#2986;&#3019;&#2985;&#3021;&#2993; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; 
&#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3007;&#2999;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2984;&#3021;&#2980;&#3016;&#2991; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2985;.
&#2997;&#2994;&#3016; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009; &#2980;&#3014;&#2995;&#3007;&#2997;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#2992;&#2997;&#3015;&#2993;&#3021;&#2965;&#3021;&#2965;&#2980;&#2965;&#3021;&#2965;  &#2965;&#2979;&#3021;&#2979;&#3015;&#3006;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2990;&#3009;&#2985;&#3021;&#2997;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009;,
&#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3007;&#2993; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3016;(&#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;, &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2979;&#3007;&#2986;&#3021;&#2986;&#3009;, &#2990;&#3009;&#2980;&#2994;&#3007;&#2991;&#2985;&#2997;&#3016;&#2965;&#2995;&#3016;) &#2962;&#2985;&#3021;&#2993;&#3006;&#2965; &#2986;&#3007;&#2979;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009;.
 &#2962;&#2992;&#3009; &#2997;&#2994;&#3016; &#2997;&#2996;&#2969;&#3021;&#2965;&#3007; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2984;&#3007;&#2986;&#3009;&#2979;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3021; &#2986;&#3014;&#2993;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;, &#2949;&#2980;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2965;&#3021;&#2965;&#3010;&#2975;&#3007; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2953;&#2980;&#2997; &#2980;&#2991;&#3006;&#2992;&#3006;&#2965; &#2953;&#2995;&#3021;&#2995; 
 &#2997;&#2992;&#3021;&#2965;&#2995;&#3016; &#2965;&#3006;&#2979;&#3021;&#2986;&#2980;&#3009; &#2965;&#2975;&#3007;&#2985;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;.  &#2950;&#2991;&#3007;&#2985;&#3009;&#2990;&#3021;&#2965;&#3010;&#2975;, &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2984;&#3015;&#2992;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2991;&#3016; &#2970;&#3015;&#2990;&#3007;&#2965;&#3021;&#2965; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3009;&#2990;&#3021; 
 &#2962;&#2992;&#3009; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3016; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2990;&#2965;&#3021;&#2965;&#2995;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2985;&#3021;&#2992;&#2985;&#2992;&#3021;.</p><div class="sect2" title="&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;"><div class="titlepage"><div><div><h3 class="title"><a name="canned-hosting"></a>&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;</h3></div></div></div><p>&#2962;&#2992;&#3009; <em class="firstterm">&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;</em> &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2997;&#2995;&#3016; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; 
&#2965;&#3018;&#2975;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2970;&#3015;&#2997;&#3016;&#2965;&#2995;&#3016; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2986;&#2979;&#3007;&#2980;&#3021;&#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; 
&#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009;&#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3015;&#2991;&#3009;&#2990;&#3021; &#2980;&#2992;&#3009;&#2997;&#2980;&#3009;.  &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2986;&#2975;&#3021;&#2970;&#2990;&#3006;&#2965;, &#2962;&#2992;&#3009; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; 
&#2986;&#3014;&#3006;&#2980;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3009; &#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2985;&#3007;&#2986;&#3021;&#2986;&#3006;&#2985;&#3016; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;; &#2986;&#2994; &#2997;&#3007;&#2965;&#3021;&#2965;&#3007; 
&#2951;&#2975;&#2990;&#3009;&#2990;&#3021;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2986;&#2994; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;, &#2970;&#3007;&#2994; &#2980;&#3018;&#2975;&#2992;&#3021; &#2986;&#3007;&#2985;&#3016;&#2986;&#3021;&#2986;&#3009; &#2970;&#3019;&#2980;&#3007;&#2986;&#3021;&#2986;&#3006;&#2985;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2951;&#2980;&#2992; 
&#2970;&#3015;&#2997;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985; .</p><p>&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2997;&#2995;&#3016; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2986;&#2991;&#2985;&#3021; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2970;&#3015;&#2997;&#3016;&#2991;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
&#2965;&#2993;&#3021;&#2993;&#3016; &#2949;&#2965;&#2994;&#2990;&#3021;: &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2970;&#3015;&#2997;&#3016;&#2991;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2979;&#3021;&#2990;&#3016;&#2991;&#3007;&#2994;&#3021; &#2965;&#2993;&#3021;&#2993;&#3016; &#2949;&#2965;&#2994;&#2990;&#3021; &#2990;&#3007;&#2965;&#3009;&#2984;&#3021;&#2980; &#2965;&#3009;&#2996;&#3006;&#2991;&#3021;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3009; &#2949;&#2990;&#3016;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2985;.  
&#2958;&#2997;&#3021;&#2997;&#2995;&#2997;&#3009; &#2997;&#3014;&#2993;&#3021;&#2993;&#3007;&#2965;&#2992;&#2990;&#3006;&#2965; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#3007;&#2992;&#3009;&#2980;&#3021;&#2980;&#3007; &#2949;&#2975;&#3016;&#2984;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#2975;&#3021;&#2975;&#3009; &#2951;&#2975;&#2990;&#3021; &#2990;&#3009;&#2996;&#3009; &#2965;&#3014;&#3006;&#2995;&#3021;&#2995;&#2995;&#2997;&#3016; &#2949;&#2975;&#3016;&#2997;&#2980;&#3009;
 &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2990;&#3007;&#2980; &#2990;&#3007;&#2974;&#3021;&#2970;&#3007; &#2970;&#3009;&#2990;&#3016;&#2991;&#3016; &#2986;&#3014;&#2993;&#3009;&#2997;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#3007;&#2985;&#3016;&#2965;&#2995;&#3021; &#2958;&#2980;&#3009;&#2997;&#3009;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3016;. 
 &#2951;&#2992;&#2979;&#3021;&#2975;&#3006;&#2997;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3007;&#2985;&#3021; &#2958;&#2995;&#3007;&#2990;&#3016;. &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3016; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2962;&#2992;&#3009; &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2965;&#3006;&#2985;&#3007;&#2986;&#3021;&#2986;&#3009;, 
 &#2962;&#2992;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009;  &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; , &#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2990;&#3021; &#2997;&#3007;&#2997;&#3006;&#2980; &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021;, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3015;&#2993;&#3009; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3016;&#2991;&#3009;&#2990;&#3021; 
 &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2951;&#2992;&#3009;&#2986;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;. &#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009;, &#2986;&#3014;&#3006;&#2992;&#3009;&#2980;&#3021;&#2980;&#2990;&#3006;&#2985; &#2951;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; 
 &#2962;&#2993;&#3021;&#2993;&#3016; &#2949;&#2969;&#3021;&#2965;&#3008;&#2965;&#3006;&#2992; &#2953;&#2995;&#3021;&#2984;&#3009;&#2996;&#3016;&#2997;&#3009; &#2959;&#2993;&#3021;&#2986;&#3006;&#2975;&#3021; &#2970;&#3014;&#2991;&#3021;&#2980;&#2994;&#3021;, &#2970;&#3015;&#2990;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#2992;&#2997;&#3009;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; 
 &#2990;&#2993;&#3016;&#2965;&#3006;&#2986;&#3021;&#2986;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009; &#2986;&#3015;&#3006;&#2985;&#3021;&#2993;&#2997;&#3016;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2986;&#3006;&#2992;&#3021;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3014;&#3006;&#2995;&#3021;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;.  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2994; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009;&#2965;&#2995;&#3016; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021;.  
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009; &#2986;&#2975;&#3007;&#2997;&#2980;&#3021;&#2980;&#3016; &#2986;&#3010;&#2992;&#3021;&#2980;&#3021;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2997;&#2980;&#3009;, &#2986;&#3007;&#2985;&#3021; &#2962;&#2992;&#3009; &#2986;&#3014;&#3006;&#2980;&#3021;&#2980;&#3006;&#2985;&#3016; &#2949;&#2996;&#3009;&#2980;&#3021;&#2980;&#3007;&#2991;&#2997;&#3009;&#2975;&#2985;&#3021;
&#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2980;&#3007;&#2975;&#3008;&#2992;&#3014;&#2985;&#3021;&#2993;&#3009; &#2962;&#2992;&#3009; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#2995;&#2992;&#3021;&#2970;&#3021;&#2970;&#3007; &#2997;&#2994;&#3016; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3016;&#2980;&#3021;&#2980;&#3009;&#2997;&#3007;&#2975;&#3009;&#2990;&#3021;.</p><p>&#2951;&#2980;&#3009; &#2986;&#3015;&#3006;&#2985;&#3021;&#2993; &#2965;&#3010;&#2975;&#3009;&#2980;&#2994;&#3006;&#2985; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965; &#2984;&#2985;&#3021;&#2990;&#3016;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;.   &#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3014;&#3006;&#2995;&#3021;&#2995; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991; &#2986;&#3006;&#2980;&#2965;&#2990;&#3021;
&#2962;&#2985;&#3021;&#2993;&#3009; &#2953;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2949;&#2980;&#3009; &#2997;&#3015;&#2993;&#3009; &#2959;&#2980;&#3006;&#2997;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2984;&#2985;&#3021;&#2993;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; 
<span class="emphasis"><em>&#2949;&#2997;&#2992;&#3021;&#2965;&#2995;&#3009;&#2975;&#3016;&#2991;</em></span> &#2980;&#3015;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2959;&#2993;&#3021;&#2993;&#3009;&#2965;&#3021;&#2965;&#3014;&#3006;&#2995;&#3021;&#2995; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.
&#2986;&#3014;&#3006;&#2980;&#3009;&#2997;&#3006;&#2965; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3009;&#2965;&#3007;&#2991; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2949;&#2994;&#2997;&#3007;&#2994;&#3021; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2970;&#3008;&#2992;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#2980;&#3021;&#2980;&#2965;&#3021;&#2965; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; 
&#2950;&#2985;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2980;&#3007;&#2992;&#3021;&#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2990;&#3009;&#2996;&#3009; &#2984;&#3007;&#2992;&#3021;&#2997;&#3006;&#2965; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3015;&#2997;&#3016;&#2991;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2979;&#3009;&#2965;&#3009;&#2980;&#2994;&#3021; &#2986;&#3019;&#2985;&#3021;&#2993;&#2997;&#3016; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;
&#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#3007;&#2975;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2986;&#3019;&#2985;&#3021;&#2993;&#3009; &#2965;&#3007;&#2975;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.</p><p> &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3015;&#3006;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2965;&#3016;&#2991;&#3006;&#2995;&#3021;&#2997;&#2980;&#3009; &#2951;&#2984;&#3021;&#2980; &#2962;&#2992;&#3009; &#2970;&#2992;&#3007;&#2991;&#3006;&#2985; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3021;.   
&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#2994;&#3016; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3015;&#2997;&#3016;&#2965;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3015;&#3006;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016;&#8212;&#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965;; 
&#2949;&#2975;&#3007;&#2965;&#3021;&#2965;&#2975;&#3007; &#2965;&#3015;&#2975;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3015;&#2995;&#3021;&#2997;&#3007;&#2965;&#2995;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975; &#2986;&#2965;&#3021;&#2965;&#2969;&#3021;&#2965;&#2995;&#3021; HTML, PDF &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2997;&#3015;&#2993;&#3009; &#2997;&#2996;&#2969;&#3021;&#2965;&#2994;&#3021; &#2997;&#2975;&#3007;&#2997;&#2969;&#3021;&#2965;&#2995;&#3007;&#2995;&#3021; 
&#2980;&#3015;&#2997;&#3016;&#2965;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#2994;&#3006;&#2990;&#3021;.  <a class="xref" href="vc.html#version-everything" title="Version everything">the section called &#8220;Version everything&#8221;</a><span>
&#2951;&#2984;&#3021;&#2980; &#2949;&#2980;&#3021;&#2980;&#3007;&#2991;&#3006;&#2991;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2990;&#3009;&#2993;&#3021;&#2986;&#2965;&#3009;&#2980;&#3007;&#2991;&#3007;&#2994;&#3021;</span> &#2997;&#3007;&#2995;&#2965;&#3021;&#2965;&#3007;&#2991;&#2997;&#3006;&#2992;&#3009;,  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2980;&#2985;&#3021;&#2990;&#3016; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3009; 
&#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#3006;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;, &#2980;&#3015;&#2997;&#3016;&#2965;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2965;&#3015;&#3006;&#2986;&#3021;&#2986;&#3009;&#2965;&#2995;&#3016; &#2949;&#2994;&#3021;&#2994;. &#2950;&#2985;&#3006;&#2994;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#2994;&#3016; 
&#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2997;&#3015;&#2993;&#3009; &#2991;&#3006;&#2992;&#3015;&#3006; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2970;&#3015;&#2997;&#3016;&#2991;&#2965;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2997;&#3016;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2990;&#3009;&#2980;&#2985;&#3021;&#2990;&#3016;&#2965;&#3021; &#2965;&#3015;&#3006;&#2986;&#3021;&#2986;&#3009; &#2990;&#3006;&#2993;&#3021;&#2993;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3015;&#3006;&#2980;&#3009; FAQ 
HTML &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; &#2990;&#2993;&#3009; &#2953;&#2993;&#3021;&#2986;&#2980;&#3021;&#2980;&#3007; &#2997;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986; &#2965;&#3014;&#3006;&#2965;&#3021;&#2965;&#3007; &#2949;&#2990;&#3016;&#2965;&#3021;&#2965; &#2965;&#2975;&#3007;&#2985;&#2990;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2992;&#3009; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3009;&#2990;&#3006;&#2985; &#2997;&#3008;&#2975;&#3021;&#2975;&#3009; &#2990;&#3009;&#2965;&#2997;&#2992;&#3007;&#2991;&#3016; &#2997;&#3007;&#2992;&#3009;&#2986;&#3007; 
&#2950;&#2980;&#3007;&#2965;&#3021;&#2965; &#2997;&#2992;&#2990;&#3021;&#2986;&#3007;&#2985;&#3021; &#2986;&#3014;&#2991;&#2992;&#3021; (domain name) &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2997;&#3015;&#2993;&#3009; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2994;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2990;&#2985;&#2980;&#3007;&#2994;&#3021; 
&#2997;&#3016;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021; &#2965;&#3014;&#3006;&#2995;&#3021;&#2995;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;. &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2984;&#3021;&#2980; URL-&#2994;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2949;&#2985;&#3009;&#2986;&#3021;&#2986; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;, 
&#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2962;&#2992;&#3009; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2980;&#2985;&#3007;&#2986;&#3021;&#2986;&#2991;&#2985;&#3006;&#2965;&#3021;&#2965;&#2990;&#3021; &#2986;&#3014;&#2993;&#3021;&#2993; &#2990;&#3009;&#2965;&#2986;&#3021;&#2986;&#3009; &#2986;&#2965;&#3021;&#2965;&#2990;&#3021; &#2949;&#2990;&#3016;&#2980;&#3021;&#2980;&#3009;, 
&#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2970;&#3014;&#2991;&#2994;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2979;&#3016;&#2986;&#3021;&#2986;&#3009; &#2959;&#2993;&#3021;&#2986;&#3006;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2990;&#3009;&#2991;&#2993;&#3021;&#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;. 
&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2997;&#3015;&#2993;&#3009; &#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3021; &#2990;&#3009;&#2965;&#2986;&#3021;&#2986;&#3009; &#2986;&#2965;&#3021;&#2965; &#2990;&#3009;&#2965;&#2997;&#2992;&#3007; &#2990;&#3006;&#2993;&#3021;&#2993;&#2990;&#3021; &#2951;&#2994;&#3021;&#2994;&#3006;&#2990;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;  &#2980;&#2965;&#3021;&#2965; &#2959;&#2993;&#3021;&#2986;&#3006;&#2975;&#3009;&#2965;&#2995;&#3016; 
&#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#3016;&#2980;&#3021;&#2980;&#3007;&#2992;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.</p><p>&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006; &#2958;&#2985;&#3021;&#2986;&#2980;&#3016; &#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965; &#2990;&#3009;&#2975;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2951;&#2991;&#2994;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021; ,
&#2949;&#2985;&#3015;&#2965;&#2990;&#3006;&#2965; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2951;&#2980;&#3009; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2980;&#2994;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; 
&#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2958;&#2985;&#3007;&#2994;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2991;&#2985;&#3009;&#2994;&#3021;&#2994; &#2997;&#2996;&#3007;&#2965;&#2995;&#3007;&#2994;&#3021; &#2951;&#2984;&#3021;&#2980; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2958;&#2979;&#3021;&#2979;&#2993;&#3021;&#2993; &#2970;&#3015;&#2997;&#3016;&#2965;&#2995;&#3016; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2980;&#3021;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#2985; 
(&#2962;&#2992;&#3009; &#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3021;: &#2962;&#2992;&#3009; &#2962;&#2986;&#3021;&#2986;&#3009;&#2997;&#3007; &#2970;&#3014;&#2991;&#2994;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3007;&#2975;&#3021;&#2975; &#2997;&#2975;&#3007;&#2997;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2962;&#2992;&#3009; &#2986;&#3007;&#2996;&#3016; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3021;&#2975;&#3009; &#2958;&#2979;&#3021;
&#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3021;, &#2986;&#3007;&#2985;&#3021;&#2985;&#2992;&#3021; &#2991;&#3006;&#2992;&#3014;&#2985;&#3009;&#2990;&#3021; &#2980;&#3015;&#2975;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2949;&#2980;&#3009; &#2980;&#3006;&#2985;&#3006;&#2965; &#2949;&#2986;&#3021;&#2986;&#3007;&#2996;&#3016; &#2986;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2951;&#2979;&#3016;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009;&#2994;&#3021;&#2994;&#2980;&#3016; 
&#2965;&#3006;&#2979;&#2994;&#3006;&#2990;&#3021;. &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2993;&#3009;&#2990;&#3009;&#2992;&#3016; &#2986;&#3007;&#2996;&#3016; &#2959;&#2993;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2970;&#3014;&#2991;&#2994;&#3016; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2986;&#3006;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#2996;&#3007;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021; &#2958;&#2995;&#3007;&#2980;&#3007;&#2994;&#3021; 
&#2965;&#2979;&#3021;&#2975;&#3009;&#2965;&#3018;&#2994;&#3021;&#2994;&#3021;&#2994;&#3006;&#2990;&#3021;).  &#2962;&#2980;&#3021;&#2980;&#3009;&#2996;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2953;&#2994;&#2965;&#2990;&#3021; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3006;&#2985; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3006;&#2992;&#2979;&#3007;&#2965;&#2995;&#3006;&#2994;&#3021; &#2970;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2985;&#2980;&#3006;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#2992;&#2984;&#3021;&#2980;&#3009; &#2997;&#3007;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021; 
&#2965;&#3006;&#2979;&#2986;&#3021;&#2986;&#2975;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2985; &#2950;&#2985;&#3006;&#2994;&#3021; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2997;&#2992;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2985;&#3009;&#2986;&#2997;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2949;&#2980;&#3015; &#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#3007;&#2985;&#3021; 
&#2980;&#3015;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2958;&#2985;&#2997;&#3014; &#2970;&#3007;&#2994; &#2986;&#2979;&#3021;&#2986;&#2975;&#3021;&#2975; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009;&#2965;&#2995;&#3021; &#2951;&#2986;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995;&#2985;.  &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2962;&#2997;&#3021;&#2997;&#3014;&#3006;&#2985;&#3021;&#2993;&#3009;&#2990;&#3021;
&#2951;&#2984;&#3021;&#2980; &#2980;&#3008;&#2992;&#3021;&#2997;&#3009; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2984;&#3007;&#2991;&#3006;&#2991;&#2990;&#3006;&#2985; &#2980;&#3009;&#2979;&#3016;&#2965;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3016; &#2970;&#3014;&#2991;&#2994;&#3006;&#2965;&#3021;&#2965; &#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#3016;&#2997;&#3007;&#2975; &#2970;&#3007;&#2993;&#2986;&#3021;&#2986;&#3006;&#2965; &#2970;&#3014;&#2991;&#3021;&#2991; 
&#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021; &#2958;&#2985;&#3021;&#2985;&#3009;&#2990;&#3021; &#2958;&#2979;&#3021;&#2979;  &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2959;&#2980;&#3014;&#2985;&#3009;&#2990;&#3021; &#2962;&#2992;&#3009; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; &#2986;&#2991;&#2985;&#3021; 
&#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2970;&#3007;&#2993;&#2984;&#3021;&#2980;&#3009; &#2951;&#2991;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><div class="sect3" title="&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2980;&#3021;&#2980;&#3015; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021;"><div class="titlepage"><div><div><h4 class="title"><a name="canned-hosting-choosing"></a>&#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2980;&#3021;&#2980;&#3015; &#2980;&#3015;&#2992;&#3021;&#2984;&#3021;&#2980;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3021;</h4></div></div></div><p><span class="emphasis"><em>possv2 todo 26 September 2014: If you're reading this
note, then you've encountered this section while it's undergoing
revision; see <a class="ulink" href="http://producingoss.com/v2.html" target="_top">producingoss.com/v2.html</a> for details.  The specific todo item
here is: update this to talk more about <a class="ulink" href="https://about.gitlab.com/" target="_top">GitLab.com</a> (and similarly
well-integrated and easy-to-use services that are themselves open
source).  I'm not sure that the recommendation toward GitHub below
should be as strong as it is.  GitHub is still dominant, but that is
not the important question; the important question is the degree to
which choosing GitHub is in itself a factor in your project's
success &#8212; that is, would some developers be slower to
contribute if one is hosted somewhere other than GitHub?  I'm not sure
it makes that much of a difference anymore.  All the good forge sites
are looking basically alike now.  And GitLab is open source, whereas
GitHub is not.</em></span></p><p>&#2951;&#2986;&#3021;&#2986;&#3019;&#2980;&#3009; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3016; &#2951;&#2994;&#2997;&#2970;&#2990;&#3006;&#2965; &#2997;&#3014;&#2995;&#3007;&#2991;&#3007;&#2975; &#2958;&#2979;&#3021;&#2979;&#2993;&#3021;&#2993; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;
&#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2949;&#2997;&#2993;&#3021;&#2993;&#3016; &#2951;&#2969;&#3021;&#2965;&#3009; &#2997;&#3007;&#2997;&#3006;&#2980;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2951;&#2994;&#3021;&#2994;&#3016;.</p><p>&#2949;&#2980;&#2985;&#3006;&#2994;&#3021; &#2984;&#3006;&#2985;&#3021; &#2951;&#2984;&#3021;&#2980; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965; ; <a class="ulink" href="http://github.com/" target="_top">GitHub</a>-&#2960; &#2980;&#3015;&#2992;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3009;&#2994;&#3021;&#2994;&#3015;&#2985;&#3021;.  &#2949;&#2980;&#3009; &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985;&#2980;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2980;&#2997;&#3007;&#2980;&#2990;&#3006;&#2965; &#2970;&#3007;&#2994;&#2965;&#3006;&#2994;&#2990;&#3021; 
&#2984;&#3007;&#2994;&#3016;&#2965;&#3021;&#2965;&#2997;&#3019; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2970;&#3007;&#2994; &#2997;&#2992;&#3009;&#2975;&#2990;&#3006;&#2997;&#2980;&#3009; &#2997;&#2995;&#2992;&#2997;&#3019; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3009; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2997;&#3009; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3006;&#2985; &#2984;&#2994;&#3021;&#2994; 
&#2980;&#3014;&#3006;&#2965;&#3009;&#2986;&#3021;&#2986;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2970;&#3007;&#2992;&#2984;&#3021;&#2980; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.  &#2986;&#2994; &#2990;&#3015;&#2990;&#3021;&#2986;&#3006;&#2975;&#3021;&#2975;&#3006;&#2994;&#2992;&#3021;&#2965;&#2995; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015; &#2949;&#2992;&#3007;&#2984;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2980;&#3019;&#2975;&#3009; 
&#2949;&#2969;&#3021;&#2965;&#3015; &#2962;&#2992;&#3009; &#2965;&#2979;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3016;&#2980;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021;.  &#2962;&#2992;&#3009;  &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3009;&#2975;&#2985;&#3021; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2979;&#3016;&#2965;&#3021;&#2965;&#2997;&#2994;&#3021;&#2994;
<a class="ulink" href="http://develop.github.com/" target="_top">API</a>-&#2960; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;, &#2949;&#2980;&#3009; 
&#2980;&#2993;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009; &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#2997;&#3007;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3016; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021;
<a class="ulink" href="http://groups.google.com/" target="_top">Google
Groups</a>&#2986;&#3019;&#2985;&#3021;&#2993; &#2990;&#2993;&#3021;&#2993; &#2951;&#2975;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2980;&#3018;&#2965;&#3009;&#2980;&#3021;&#2980;&#3009; &#2997;&#2995;&#2969;&#3021;&#2965; &#2984;&#3007;&#2993;&#3016;&#2991; &#2997;&#2996;&#3007;&#2965;&#2995;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;</p><p>GitHub &#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2959;&#2993;&#3021;&#2986;&#3009;&#2975;&#3016;&#2991;&#2980;&#3006;&#2965; &#2951;&#2994;&#3021;&#2994;&#3016; &#2958;&#2985;&#3007;&#2994;&#3021;(&#2953;&#2980;&#3006;&#2992;&#2979;&#2990;&#3006;&#2965; Git-&#2965;&#3021;&#2965;&#3009; &#2986;&#2980;&#3007;&#2994;&#3021; Mercurial
&#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021;),  Wikipedia-&#2997;&#3007;&#2985;&#3021; <a class="ulink" href="http://en.wikipedia.org/wiki/Comparison_of_open_source_software_hosting_facilities" target="_top">&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2997;&#2970;&#2980;&#3007;&#2965;&#2995;&#3007;&#2985;&#3021; &#2962;&#2986;&#3021;&#2986;&#3008;&#2975;&#3009;</a> &#2958;&#2985;&#3021;&#2993; &#2986;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3016; &#2965;&#3006;&#2979;&#3021;&#2965;; &#2951;&#2980;&#3009;&#2980;&#3006;&#2985;&#3021; 
&#2984;&#2975;&#2986;&#3021;&#2986;&#3009; &#2962;&#2980;&#3021;&#2980;
&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3007;&#2985;&#3021; &#2980;&#3018;&#2965;&#3009;&#2986;&#3021;&#2986;&#3009;. &#2980;&#2993;&#3021;&#2986;&#3015;&#3006;&#2980;&#3009; &#2953;&#2995;&#3021;&#2995; &#2990;&#3007;&#2965; &#2986;&#3007;&#2992;&#2986;&#2994;&#2990;&#3006;&#2985; &#2990;&#2993;&#3021;&#2993; &#2951;&#2992;&#2979;&#3021;&#2975;&#3009; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021;
<a class="ulink" href="http://code.google.com/hosting/" target="_top">Google Code Hosting</a>,
<a class="ulink" href="http://sourceforge.net/" target="_top">SourceForge</a>, &#2950;&#2985;&#3006;&#2994;&#3021; Wikipedia
&#2986;&#2965;&#3021;&#2965;&#2980;&#3021;&#2980;&#3016; &#2965;&#2994;&#2984;&#3021;&#2980;&#3006;&#2994;&#3015;&#3006;&#2970;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980; &#2990;&#3009;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2969;&#3021;&#2965;&#2995;&#3021;.</p></div><div class="sect3" title="&#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021;"><div class="titlepage"><div><div><h4 class="title"><a name="hosting-on-freedom"></a>&#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021;</h4></div></div></div><p>&#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2984;&#3007;&#2993;&#3016;&#2991;  &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3016; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2997;&#3007;&#2991;&#2994;&#3007;&#2994;&#3021; 
&#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3016; &#2962;&#2992;&#3009;&#2969;&#3021;&#2965;&#3007;&#2985;&#3016;&#2965;&#3021;&#2965; &#2986;&#2994; &#2965;&#3006;&#2986;&#3021;&#2986;&#3008;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3016;&#2991;&#3009;&#2990;&#3021;
&#2958;&#2996;&#3009;&#2980;&#3007; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3007; &#2953;&#2995;&#3021;&#2995;&#2985;&#2992;&#3021;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#2991; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021; &#2970;&#3010;&#2996;&#2994;&#3021; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2985; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;&#2990;&#3021; &#2950;&#2965;&#2980;&#3009;, &#2949;&#2980;&#2985;&#3006;&#2994;&#3021; 
&#2990;&#2993;&#3021;&#2993;&#2997;&#2992;&#3021;&#2965;&#2995;&#3006;&#2994;&#3021; &#2958;&#2995;&#3007;&#2980;&#3006;&#2965; &#2990;&#2993;&#3009;&#2997;&#3009;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2951;&#2991;&#2994;&#3006;&#2980;&#3009;.  &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965; Git &#2962;&#2992;&#3009; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; 
&#2950;&#2985;&#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3021; GitHub &#2963;&#2992;&#2995;&#2997;&#3009; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3009; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021; &#2970;&#3015;&#2997;&#3016; &#8212; 
GitHub-&#2994;&#3021; &#2951;&#2993;&#3009;&#2984;&#3021;&#2980;&#3009; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2997;&#3014;&#2995;&#3007;&#2991;&#3015;&#2993;&#3007;&#2985;&#3006;&#2994;&#3021;,  &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2980;&#2985;&#3021; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3016; &#2962;&#2992;&#3009; &#2990;&#3009;&#2996;&#3009; &#2984;&#2965;&#2994;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3006;&#2980;&#3009;.</p><p>&#2970;&#3007;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2993;&#3021;&#2993;&#3007;&#2994;&#3009;&#2990;&#3021; &#2951;&#2994;&#2997;&#2970; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021; &#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3007;&#2994;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021;, &#2965;&#3018;&#2995;&#3021;&#2965;&#3016; &#2949;&#2975;&#3007;&#2986;&#3021;&#2986;&#2975;&#3016;&#2991;&#3007;&#2994;&#3021;, 
&#2980;&#3015;&#2997;&#3016; &#2959;&#2992;&#3021;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009; &#2990;&#2993;&#3009; &#2953;&#2993;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2980;&#2965;&#3021;&#2965;, &#2962;&#2992;&#3009; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;
 &#2980;&#2995;&#2980;&#3021;&#2980;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;, &#2984;&#2994;&#3021;&#2994; &#2965;&#3006;&#2994;&#2990;&#3006;&#2965;, &#2949;&#2980;&#3009; &#2986;&#3015;&#3006;&#2985;&#3021;&#2993; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2953;&#2995;&#3021;&#2995;&#2985;(2014-&#2994;&#3021; &#2951;&#2980;&#3016; &#2958;&#2996;&#3009;&#2980;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;), 
 &#2990;&#3007;&#2965;&#2997;&#3009;&#2990;&#3021; &#2984;&#2985;&#3021;&#2965;&#3009; &#2949;&#2993;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; 
<a class="ulink" href="http://gitlab.com/" target="_top">GitLab</a>, 
<a class="ulink" href="http://gitorious.org/" target="_top">Gitorious</a>, &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; 
<a class="ulink" href="http://savannah.gnu.org/" target="_top">GNU Savannah</a>.&#2990;&#3015;&#2994;&#3009;&#2990;&#3021;
<a class="ulink" href="http://redmine.org/" target="_top">Redmine</a> &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; <a class="ulink" href="http://trac.edgewall.org" target="_top">Trac</a> &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009; &#2962;&#2980;&#3021;&#2980;&#3009;&#2996;&#3016;&#2986;&#3021;&#2986;&#3009; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3007; 
&#2962;&#2992;&#3009; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965; &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2986;&#3014;&#2992;&#3009;&#2990;&#3021;&#2986;&#3006;&#2994;&#3006;&#2985; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; &#2949;&#2975;&#2969;&#3021;&#2965;&#3007;&#2991;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021;
&#2949;&#2997;&#2993;&#3021;&#2993;&#3016;  &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2958;&#2984;&#3021;&#2980; &#2970;&#3015;&#2997;&#3016;&#2991;&#3009;&#2990;&#3021;  &#2980;&#3007;&#2993;&#2990;&#3021;&#2986;&#2975; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2970;&#3009;&#2980;&#2984;&#3021;&#2980;&#3007;&#2992;&#2990;&#3021; &#2986;&#3006;&#2980;&#3009;&#2965;&#3006;&#2965;&#3021;&#2965;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.
&#2970;&#3007;&#2994; &#2984;&#3007;&#2993;&#3009;&#2997;&#2985;&#2969;&#3021;&#2965;&#2995;&#3021;  &#2949;&#2984;&#3021;&#2980; &#2997;&#2965;&#3016;&#2991;&#3006;&#2985; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3016; &#2997;&#2979;&#3007;&#2965;&#2993;&#3007;&#2980;&#3007;&#2991;&#3006;&#2965; &#2970;&#3007;&#2993;&#3007;&#2991; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2990;&#3007;&#2965; &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980; &#2965;&#2975;&#3021;&#2975;&#2979;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021;
&#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994;  &#2980;&#3007;&#2975;&#3021;&#2975;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3006;&#2965; &#2997;&#2996;&#2969;&#3021;&#2965;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2985;.</p><p>&#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3009;&#2996;&#3009;&#2990;&#3016;&#2991;&#3006;&#2965; &#2980;&#3007;&#2993;&#2984;&#3021;&#2980; &#2990;&#3010;&#2994; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009;&#2980;&#3006;&#2985;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3016; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3006;?
&#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2979;&#3009;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3007;&#2991;&#2980;&#3009; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#2980;&#2965;&#3021;&#2965;&#2980;&#3009; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3009;&#2990;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975; &#2980;&#2992;&#2997;&#3009;&#2965;&#2995;&#3016; &#2959;&#2993;&#3021;&#2993;&#3009;&#2990;&#2980;&#3007; 
&#2970;&#3014;&#2991;&#3021;&#2991; &#2962;&#2992;&#3009; &#2997;&#2996;&#3007;&#2991;&#3009;&#2990;&#3021;, &#2949;&#2980;&#3016; &#2980;&#3006;&#2985;&#3007;&#2991;&#2969;&#3021;&#2965;&#3007; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2951;&#2991;&#2994;&#3021;&#2997;&#2980;&#3009;&#2997;&#3009; &#2980;&#3006;&#2985;&#3021; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991;&#2990;&#3006;&#2985; &#2997;&#3007;&#2975;&#2991;&#2990;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3009; &#2958;&#2985;&#2980;&#3009; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;.
&#2951;&#2984;&#3021;&#2980; &#2949;&#2995;&#2997;&#3009;&#2965;&#3015;&#3006;&#2994;&#3021;&#2965;&#2995;&#3016; &#2986;&#3010;&#2992;&#3021;&#2980;&#3021;&#2980;&#3007; &#2962;&#2992;&#3009; &#2980;&#2995;&#2990;&#3021; &#2962;&#2992;&#3009;&#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3006;&#2980;&#3009; &#2949;&#2980;&#3014; &#2970;&#2990;&#2991;&#2990;&#3021; &#2949;&#2980;&#3016; 
&#2951;&#2975;&#3016;&#2990;&#3009;&#2965;&#2990;&#3021; &#2997;&#2996;&#3007;&#2991;&#3006;&#2965; &#2984;&#3008;&#2975;&#3007;&#2965;&#3021;&#2965;&#2997;&#3009;&#2990;&#3021; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021;.  &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;&#3009;&#2990;&#3021; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021; &#2949;&#2979;&#3009;&#2965;&#3009;&#2997;&#2980;&#3009; &#2949;&#2985;&#3009;&#2965;&#3010;&#2994;&#2990;&#3006;&#2985;&#3006;&#2994;&#3009;&#2990;&#3021;,
&#2984;&#2975;&#3016;&#2990;&#3009;&#2993;&#3016;&#2991;&#3007;&#2994;&#3021; &#2949;&#2984;&#3021;&#2980; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2962;&#2992;&#3009; &#2980;&#2991;&#3006;&#2992;&#3007;&#2986;&#3021;&#2986;&#3009; &#2970;&#3010;&#2996;&#2994;&#3007;&#2994;&#3021; &#2997;&#3007;&#2992;&#3007;&#2997;&#3009;&#2993;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009; &#2980;&#2975;&#3016; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3009; &#2953;&#2995;&#3021;&#2995;&#2985;.
&#2951;&#2984;&#3021;&#2980; &#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2986;&#2994; &#2970;&#3015;&#2997;&#3016;&#2990;&#3016;&#2991;&#2969;&#3021;&#2965;&#2995;&#3021;,  &#2980;&#2985;&#3007;&#2980;&#3021;&#2980;&#3009;&#2997;&#2990;&#3021; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2997;&#2994;&#3016;&#2986;&#3007;&#2985;&#3021;&#2985;&#2994;&#3021; &#2949;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009;, &#2990;&#3015;&#2994;&#3009;&#2990;&#3021; &#2951;&#2991;&#2969;&#3021;&#2965;
&#2997;&#3016;&#2965;&#3021;&#2965; &#2990;&#3009;&#2996;&#3009; &#2984;&#3015;&#2992; &#2954;&#2996;&#3007;&#2991;&#2992;&#3021;&#2965;&#2995;&#3009;&#2990;&#3021; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;. &#2997;&#3014;&#2993;&#3009;&#2990;&#2985;&#3015; &#2965;&#3009;&#2993;&#3007;&#2991;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2965;&#3014;&#3006;&#2979;&#3021;&#2975;&#3007;&#2992;&#3009;&#2986;&#3021;&#2986;&#2980;&#3009; &#2984;&#2965;&#2994;&#3021; &#2958;&#2975;&#3009;&#2965;&#3021;&#2965;&#2997;&#3018; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; 
&#2970;&#3015;&#2997;&#3016;&#2991;&#3016; "&#2986;&#2975;&#3016; &#2986;&#3007;&#2995;&#2997;&#3009;" &#2970;&#3014;&#2991;&#3021;&#2991;&#2997;&#3018; &#2986;&#3015;&#3006;&#2980;&#3009;&#2990;&#3006;&#2985;&#2980;&#3006;&#2965; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965;&#3006;&#2980;&#3009;. &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2997;&#3007;&#2975;&#2991;&#2990;&#3021; &#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#2992;&#2997;&#3009;&#2965;&#2995;&#3021; &#2970;&#3007;&#2965;&#3021;&#2965;&#3007; &#2997;&#3007;&#2975;&#3006;&#2990;&#2994;&#3021; 
&#2953;&#2993;&#3009;&#2980;&#3007; &#2970;&#3014;&#2991;&#3021;&#2991;&#2980;&#3009;&#2965;&#3018;&#2994;&#3021;&#2997;&#2980;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3014;.</p><p>&#2965;&#2979;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965;, &#2951;&#2997;&#3016; &#2949;&#2985;&#3016;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2997;&#3007;&#2992;&#3009;&#2984;&#3021;&#2980;&#3019;&#2990;&#3021;&#2986;&#2994;&#3021; &#2980;&#2995;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2953;&#2995;&#3021;&#2995; &#2970;&#3015;&#2997;&#3016; &#2990;&#3016;&#2991;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3015; &#2986;&#3014;&#3006;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009;&#2990;&#3021;,
&#2953;&#2969;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2986;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016; &#2980;&#2969;&#3021;&#2965;&#2995;&#3021; &#2951;&#2991;&#2984;&#3021;&#2980;&#3007;&#2992;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#3008;&#2980;&#3009; &#2980;&#2985;&#3007;&#2991;&#3009;&#2992;&#3007;&#2990; &#2965;&#3010;&#2975;&#3021;&#2975;&#3009; &#2990;&#3014;&#2985;&#3021;&#2986;&#3014;&#3006;&#2992;&#3009;&#2995;&#3021;&#2965;&#2995;&#3016; &#2951;&#2991;&#2965;&#3021;&#2965; 
&#2980;&#3015;&#2997;&#3016;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021; &#2997;&#2965;&#3016;&#2991;&#3007;&#2994;&#3021; &#2951;&#2992;&#3009;&#2965;&#3021;&#2965; &#2965;&#3010;&#2975;&#3006;&#2980;&#3009; .</p></div><div class="sect3" title="&#2949;&#2993;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;"><div class="titlepage"><div><div><h4 class="title"><a name="anonymity"></a>&#2949;&#2993;&#3007;&#2991;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;</h4></div></div></div><p>&#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3021; &#2980;&#3007;&#2975;&#3021;&#2975;&#2990;&#3021; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3006;&#2985; &#2986;&#2994;&#3021;&#2997;&#3015;&#2993;&#3009; &#2949;&#2990;&#3021;&#2970;&#2969;&#3021;&#2965;&#2995;&#3021; &#2965;&#3009;&#2993;&#3007;&#2980;&#3021;&#2980;&#3009; &#2986;&#2969;&#3021;&#2965;&#3015;&#2993;&#3021;&#2965; &#2980;&#3015;&#2997;&#3016;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965;&#2990;&#3006;&#2965; &#2980;&#3007;&#2979;&#3007;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#2991;&#2985;&#2992;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; 
&#2990;&#3009;&#2992;&#3016; &#2980;&#3018;&#2965;&#3009;&#2965;&#3021;&#2965;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975; &#2986;&#3014;&#2992;&#3009;&#2984;&#3021;&#2980;&#3007;&#2992;&#2995;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#3018;&#2980;&#3009;&#2997;&#3006;&#2965; &#2965;&#3006;&#2979;&#2986;&#3021;&#2986;&#2975;&#3021;&#2975;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2980;&#3009; &#2949;&#2997;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2949;&#2994;&#3021;&#2994;&#3006;&#2980; &#2962;&#2992;&#3009; 
&#2986;&#3018;&#2980;&#3009; &#2986;&#3007;&#2992;&#2970;&#3021;&#2970;&#2985;&#3016;. &#2980;&#3015;&#2997;&#3016;&#2991;&#3006;&#2985; &#2949;&#2994;&#2997;&#3016; &#2984;&#3007;&#2992;&#3021;&#2985;&#3016;&#2986;&#3021;&#2986;&#2980;&#3009; &#2962;&#2992;&#3009; &#2990;&#3009;&#2965;&#3021;&#2965;&#3007;&#2991; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2980;&#3021;&#2980;&#2994;&#3016; &#2986;&#3018;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;&#2995;&#3021;&#2995;&#2980;&#3009;.
&#2990;&#3009;&#2980;&#2994;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2997;&#3008;&#2979;&#3021;&#2970;&#3014;&#2991;&#3021;&#2980;&#3007;&#2965;&#2995;&#3021; &#2980;&#2975;&#3009;&#2965;&#3021;&#2965;&#3007;&#2985;&#3021;&#2992;&#2980;&#3009;, &#2958;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2965;&#3021;&#2965;&#3006;&#2975;&#3021;&#2975;&#3006;&#2965; &#2962;&#2997;&#3021;&#2997;&#3014;&#3006;&#2992;&#3009; &#2986;&#2980;&#3007;&#2986;&#3021;&#2986;&#3016;&#2991;&#3009;&#2990;&#3021; &#2984;&#3008;&#2969;&#3021;&#2965;&#2995;&#3021; &#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#3006;&#2991;&#3021;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2980;&#3006;&#2994;&#3009;&#2990;&#3021; &#2949;&#2984;&#3021;&#2984;&#3007;&#2991;&#2992;&#3021;&#2965;&#2995;&#3021;
&#2980;&#2995;&#3021;&#2995;&#3009;&#2990;&#3021; &#2990;&#3006;&#2993;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3016; &#2965;&#2995;&#2974;&#3021;&#2970;&#3007;&#2991;&#2980;&#3021;&#2980;&#3007;&#2993;&#3021;&#2965;&#3009;&#2994;&#3021; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2986;&#3021;&#2986;&#2980;&#3016; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986; &#2990;&#3006;&#2975;&#3021;&#2975;&#3008;&#2992;&#3021;&#2965;&#2995;&#3021;..</p><p>&#2950;&#2985;&#3006;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#2986;&#3021;&#2986;&#2975;&#3006;&#2980; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#2980;&#2965;&#3021;&#2965; &#2986;&#2979;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2970;&#3007;&#2994; &#2984;&#3015;&#2992;&#2969;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#2991;&#2985;&#2992;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; 
&#2997;&#2994;&#3007;&#2991;&#3009;&#2993;&#3009;&#2980;&#3021;&#2980;&#2986;&#3021;&#2986;&#2975;&#3009;&#2990;&#3021;&#2986;&#2975;&#3007; &#2950;&#2965;&#3007;&#2992;&#2980;&#3009;, &#2965;&#3009;&#2993;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2986;&#3007;&#2996;&#3016; &#2980;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2949;&#2994;&#3021;&#2994;&#2980;&#3009; &#2959;&#2993;&#3021;&#2965;&#2985;&#2997;&#3015;&#2991;&#3009;&#2995;&#3021;&#2995; &#2986;&#3007;&#2996;&#3016; &#2980;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2965;&#2992;&#3009;&#2980;&#3021;&#2980;&#3009;
&#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; &#2984;&#3015;&#2992;&#3009;&#2990;&#3021;&#2986;&#3019;&#2980;&#3009;.  &#2949;&#2980;&#3021;&#2980;&#2965;&#3016;&#2991; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2962;&#2992;&#3009; &#2953;&#2995;&#3021;&#2984;&#3009;&#2996;&#3016;&#2984;&#3021;&#2980; &#2986;&#2991;&#2985;&#2992;&#3021; &#2986;&#3014;&#2991;&#2992;&#3021; &#2965;&#3015;&#3006;&#2992;&#3009;&#2997;&#2980;&#2985;&#3021; &#2990;&#3010;&#2994;&#2990;&#3021;, &#2980;&#3007;&#2975;&#3021;&#2975;&#2980;&#3021;&#2980;&#3007;&#2985;&#3021; 
&#2958;&#2994;&#3021;&#2994;&#3016; &#2958;&#2996;&#3009;&#2986;&#3021;&#2986; &#2986;&#2975;&#3009;&#2997;&#2980;&#3006;&#2994;&#3021; &#2997;&#3007;&#2992;&#3016;&#2965; &#2952;&#2975;&#3009;&#2986;&#3006;&#2975;&#3009;&#2990;&#3021; &#2952;&#2992;&#3021;&#2986;&#3021;&#2986;&#3009; &#2980;&#2975;&#3016;&#2986;&#2975;&#3009;&#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;. &#2958;&#2997;&#2992;&#3009;&#2990;&#3021; &#2986;&#3019;&#2980;&#3009;&#2997;&#3006;&#2965; &#2962;&#2992;&#3009; &#2986;&#3007;&#2996;&#3016; &#2986;&#2980;&#3007;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3006;&#2965; 
&#2986;&#2991;&#2985;&#2992;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991;&#3009;&#2990;&#3021; &#2949;&#2994;&#2997;&#3007;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2949;&#2980;&#3007;&#2965; &#2970;&#3007;&#2992;&#2980;&#3021;&#2980;&#3016; &#2990;&#3015;&#2993;&#3021;&#2965;&#3021;&#2965;&#3018;&#2994;&#3021;&#2994; &#2990;&#3006;&#2975;&#3021;&#2975;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021; &#2958;&#2985;&#3021;&#2986;&#2980;&#3006;&#2994;&#3021; &#2951;&#2980;&#3009; &#2986;&#3007;&#2996;&#3016; &#2980;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; 
&#2970;&#3014;&#2991;&#3021;&#2991;&#2990;&#3021; &#2952;&#2992;&#3021;&#2986;&#3021;&#2986;&#3016; &#2965;&#3009;&#2992;&#3016;&#2980;&#3021;&#2980;&#3009; &#2986;&#3007;&#2996;&#3016; &#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2997;&#3019;&#2992;&#3021; &#2958;&#2979;&#3021;&#2985;&#3007;&#2965;&#3021;&#2965;&#3016;&#2991;&#3016; &#2997;&#3014;&#2965;&#3009;&#2997;&#3006;&#2965; &#2990;&#2993;&#3021;&#2993;&#3009; &#2965;&#3007;&#2985;&#3021;&#2993;&#2980;&#3009;(&#2949;&#2997;&#3021;&#2997;&#3006;&#2992;&#3009; &#2970;&#3014;&#2991;&#3021;&#2986;&#2997;&#2992;&#3021;&#2965;&#2995;&#3021; 
&#2980;&#3007;&#2975;&#3021;&#2975; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2962;&#2992;&#3009; &#2986;&#2965;&#3021;&#2965;&#2970;&#3021;&#2970;&#3006;&#2992;&#3021;&#2986;&#3006;&#2985;  &#2980;&#3009;&#2979;&#3016;&#2965;&#3021;&#2965;&#3009;&#2996;&#3009;&#2997;&#3006;&#2965; &#2990;&#2992;&#3007;&#2997;&#3007;&#2975;&#3009;&#2997;&#3006;&#2992;&#3021;&#2965;&#2995;&#3021;).  &#2984;&#3007;&#2970;&#3021;&#2970;&#2991;&#2990;&#3006;&#2965;,  &#2986;&#3007;&#2996;&#3016; &#2980;&#2975;&#2980;&#3021;&#2980;&#3007;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3009; 
&#2970;&#3014;&#2991;&#3021;&#2991;&#2980;&#2997;&#2992;&#3016; &#2962;&#2992;&#3009;&#2997;&#2992;&#3021; &#2962;&#2992;&#3009; &#2980;&#3014;&#3006;&#2975;&#2992;&#3021;&#2986;&#3009; &#2965;&#3018;&#2994;&#3021;&#2994; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2997;&#3006;&#2992;&#3021;, &#2950;&#2985;&#3006;&#2994;&#3021; &#2986;&#2980;&#3007;&#2997;&#3007;&#2985;&#3021;&#2986;&#3019;&#2980;&#3009; &#2949;&#2997;&#2992;&#3021; &#2990;&#3007;&#2985;&#3021;&#2985;&#2974;&#3021;&#2970;&#2994;&#3021; &#2990;&#3009;&#2965;&#2997;&#2992;&#3007;&#2991;&#3016; 
&#2953;&#2995;&#3021;&#2995;&#3007;&#2975;&#2997;&#3009;&#2990;&#3021; (&#2949;&#2997;&#2992;&#3021; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3009;&#2965;&#3007;&#2993;&#3006;&#2992;&#3021; &#2958;&#2985;&#3021;&#2993;&#3006;&#2994;&#3021;) &#2997;&#2965;&#3016;&#2970;&#3014;&#2991;&#3021;&#2980;&#3009; &#2949;&#2980;&#2985;&#3016; &#2970;&#3006;&#2980;&#3021;&#2980;&#3007;&#2991;&#2990;&#3021; &#2950;&#2965;&#3021;&#2965; &#2990;&#3009;&#2975;&#3007;&#2991;&#3009;&#2990;&#3021;. &#2962;&#2992;&#3009; &#2986;&#3009;&#2980;&#3007;&#2991; &#2986;&#2991;&#2985;&#2992;&#3021; 
&#2962;&#2992;&#3009; &#2986;&#3007;&#2996;&#3016; &#2965;&#2979;&#3021;&#2975;&#3009; &#2949;&#2980;&#3016; &#2980;&#3014;&#2992;&#3007;&#2997;&#3007;&#2965;&#3021;&#2965; &#2997;&#3007;&#2992;&#3009;&#2990;&#3021;&#2986;&#3007;&#2985;&#3006;&#2994;&#3021;, &#2986;&#3007;&#2996;&#3016; &#2980;&#2975;&#2980;&#3021;&#2980;&#3016; &#2949;&#2975;&#3016;&#2991;&#3009;&#2990;&#3021; &#2990;&#3009;&#2985;&#3021;&#2986;&#3009; &#2962;&#2992;&#3009;  &#2962;&#2992;&#3009; &#2965;&#2979;&#2965;&#3021;&#2965;&#3009; &#2953;&#2992;&#3009;&#2997;&#3006;&#2965;&#3021;&#2965;
&#2986;&#2975;&#3007;&#2997;&#2980;&#3021;&#2980;&#3016; &#2984;&#3007;&#2992;&#2986;&#3021;&#2986; &#2984;&#3015;&#2992;&#3007;&#2975;&#3021;&#2975;&#3006;&#2994;&#3021; &#2949;&#2997;&#2992;&#3021; &#2965;&#2985;&#3021;&#2975;&#3007;&#2986;&#3021;&#2986;&#3006;&#2965; &#2958;&#2992;&#3007;&#2970;&#3021;&#2970;&#2994;&#2975;&#3016;&#2997;&#3006;&#2992;&#3021;.  &#2949;&#2997;&#2992;&#3021; &#2997;&#3014;&#2993;&#3009;&#2990;&#2985;&#3015; &#2986;&#3007;&#2996;&#3016;&#2991;&#3016; &#2980;&#2975;&#2986;&#3021;&#2986;&#2980;&#3007;&#2997;&#3009; &#2970;&#3014;&#2991;&#3021;&#2991; 
&#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2990;&#3021; &#2958;&#2985; &#2990;&#3009;&#2975;&#3007;&#2997;&#3014;&#2975;&#3009;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021;.</p><p>&#2953;&#2969;&#3021;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2958;&#2984;&#3021;&#2980; &#2970;&#3014;&#2991;&#2994;&#3021;&#2965;&#2995;&#3007;&#2994;&#3021; &#2986;&#3014;&#2991;&#2992;&#3007; &#2949;&#2992;&#3007;&#2991; &#2997;&#3015;&#2979;&#3021;&#2975;&#3006;&#2980; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3016; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965;&#2994;&#3006;&#2990;&#3021; &#2958;&#2985;&#3021;&#2993;&#3009; 
&#2965;&#2975;&#3021;&#2975;&#3009;&#2986;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2990;&#3021; &#2950;&#2993;&#3021;&#2993;&#2994;&#3021; &#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3006;&#2994;&#3021;.  &#2965;&#3009;&#2993;&#3016;&#2984;&#3021;&#2980;&#2986;&#2975;&#3021;&#2970;&#3021;&#2970;&#2990;&#3021; <span class="emphasis"><em>&#2958;&#2994;&#3021;&#2994;&#3006; &#2997;&#3007;&#2980;&#2990;&#3006;&#2985;</em></span> 
&#2986;&#2975;&#3007;&#2965;&#3021;&#2965;-&#2990;&#2975;&#3021;&#2975;&#3009;&#2990;&#3021; &#2951;&#2991;&#2994;&#3009;&#2990;&#3021; &#2984;&#2975;&#2997;&#2975;&#3007;&#2965;&#3021;&#2965;&#3016;&#2965;&#2995;&#3021; &#2990;&#2993;&#3021;&#2993;&#3009;&#2990;&#3021; &#2986;&#3007;&#2996;&#3016; &#2980;&#2975; &#2953;&#2995;&#3021;&#2995;&#3008;&#2975;&#3021;&#2975;&#3009; &#2951;&#2979;&#3016;&#2991;&#2980;&#2995;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#3015;&#3006;&#2985;&#3021;&#2993; &#2986;&#2991;&#2985;&#2992;&#3021;&#2965;&#2995;&#3007;&#2975;&#2990;&#3021; 
&#2951;&#2992;&#3009;&#2984;&#3021;&#2980;&#3009; &#2980;&#2965;&#2997;&#2994;&#3021;&#2965;&#2995;&#3016; &#2990;&#3015;&#2990;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#3019;&#2992;&#3021;&#2965;&#3021;&#2965;&#3009; &#2965;&#3018;&#2979;&#3021;&#2975;&#3009; &#2970;&#3014;&#2994;&#3021;&#2994;&#3009;&#2990;&#3021; &#2965;&#2992;&#3009;&#2997;&#3007;&#2965;&#2995;&#3009;&#2965;&#3021;&#2965;&#3009; &#2950;&#2965;&#3007;&#2991;&#2997;&#2993;&#3021;&#2993;&#3016;&#2991;&#3006;&#2997;&#2980;&#3009; 
&#2986;&#3009;&#2965;&#3009;&#2986;&#2980;&#3007;&#2965;&#3016; &#2949;&#2994;&#3021;&#2994;&#3006;&#2980; &#2986;&#3006;&#2992;&#3021;&#2997;&#3016;&#2991;&#3006;&#2995;&#2992;&#3021;&#2965;&#2995;&#3016; &#2949;&#2985;&#3009;&#2990;&#2980;&#3007;&#2965;&#3021;&#2965; &#2997;&#3015;&#2979;&#3021;&#2975;&#3009;&#2990;&#3021;.  &#2949;&#2980;&#3015; &#2970;&#2990;&#2991;&#2990;&#3021; &#2986;&#2991;&#2985;&#3021;&#2993;&#3021;&#2993; &#2953;&#2995;&#3021;&#2995;&#3008;&#2975;&#3009;&#2965;&#2995;&#3016; &#2965;&#2995;&#3016;&#2991; 
captchas &#2986;&#3019;&#2985;&#3021;&#2993; &#2984;&#3009;&#2975;&#3021;&#2986;&#2969;&#3021;&#2965;&#2995;&#3021; &#2986;&#2991;&#2985;&#3021;&#2986;&#2975;&#3009;&#2980;&#3021;&#2980;&#3009;&#2997;&#2980;&#3009;&#2990;&#3021; &#2949;&#2997;&#2970;&#3007;&#2991;&#2990;&#3021;.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="technical-infrastructure.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="technical-infrastructure.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="message-forums.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter 3. &#2980;&#3014;&#3006;&#2996;&#3007;&#2994;&#3021;&#2984;&#3009;&#2975;&#3021;&#2986; &#2953;&#2995;&#3021;&#2965;&#2975;&#3021;&#2975;&#2990;&#3016;&#2986;&#3021;&#2986;&#3009; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> &#2949;&#2974;&#3021;&#2970;&#2994;&#3021; &#2986;&#2975;&#3021;&#2975;&#3007;&#2991;&#2994;&#3021;&#2965;&#2995;&#3021; / &#2980;&#2965;&#2997;&#2994;&#3021; &#2990;&#2985;&#3021;&#2993;&#2969;&#3021;&#2965;&#2995;&#3021;</td></tr></table></div></body></html>
